{
    "Funding Contribution to Wild West Women Inc. for Suffrage Tea Event.": [
        "'speaker_0': 'Thank you. Next up. Let's go ahead and do items ten, 11, 12, 14 and 15, which are all the funds transfer, please?'",
        "'speaker_1': 'Item Tense Communication from Councilwoman Allen recommendation to increase appropriation in the City Manager Department by 400 to provide a contribution to our West women. Item 11 Communication from Councilman Allen. Recommendation to increase appropriations in the city manager's department by $705 to provide contribution to partners of Parks to support AOC seven.'",
        "'speaker_1': 'CAVUTO Street BLOCK Party on August 14, 2021. M 12 is a communication from Councilman Price recommendation to increase appropriation in the city manager's department by $250 to provide a donation to California Families in Focus for their annual trends parade.'",
        "'speaker_1': 'Adam, 14, is communication from councilmen subpoena recommendation to increase appropriation in the city manager's department by 400 to provide a donation to the Long Beach Suffrage 100. And item 15 is communication from Councilwoman Sara recommendation to increase appropriations in the City Manager Department by 400 to provide a contribution to Wild West woman.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_3': 'I have no comments, but I support all these items.'",
        "'speaker_0': 'And Truman zero.'",
        "'speaker_2': 'Same thing that I support the items of supporting our women's Long Beach women's suffrage.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_2': 'I'd like to make a friendly because this is an item that we were going to bring next week, but we pulled it for next week to add that council district three through our divide by $9 would be contributing $400 to Wild West Women Inc for the Long Beach 100th suffrage event and for $400.'",
        "'speaker_0': 'There's a. That's item ten.'",
        "'speaker_4': 'That's your money.'",
        "'speaker_2': 'I believe so, yes.'",
        "'speaker_0': 'Thank you. We have all the there is no public comment on these.'",
        "'speaker_1': 'There's no public coming.'",
        "'speaker_0': 'Please cast your votes.'",
        "'speaker_1': 'As women mango. Hell of a man, Alan. We should, Kerry.'",
        "'speaker_0': 'Thank you. I'm going to go ahead and move on to the five members of the public that are here to speak on public comment. General public comment, please. We can have these. These folks, please line up at the podium in this order.'"
    ],
    "Renaming of Sports Complex at Chittick Field.": [
        "'speaker_0': 'Actually me, Madam Court, I've had a council request to actually hear item 16, so let me do 16. Then we'll do 17. Then the budget and the rest of the agenda. So we'll do item 16, please.'",
        "'speaker_1': 'I'm sick. I'm sick. This is a communication from Councilman Spooner, Chair of the Government Personnel and Election Services Committee recommendation to approve renaming the sports complex at Chick fil de Andrews Sports Complex at Citi Field District six.'",
        "'speaker_0': 'There's was emotion and a second. Frontman Austin.'",
        "'speaker_4': 'Sir. Thank you. And I want to thank, first of all, the government Oversight Personnel Committee. I'm. I'm soprano. Soprano and Cindy Allan, who sit on the committee. I want to thank the many residents who have written letters in support of an action that started at this city council.'",
        "'speaker_4': 'And that is a motion that was made to rename Chinook Field after the Andrews. Oh, the sports complex. I want to be very clear that this in no way is meant to undermine or undercut the the reverence and respect that we have for the true Dick family and the contributions that Mr. Chillicothe has.'",
        "'speaker_4': 'I want to point out that the critic name in the critic field will always be critic field as far as I'm concerned, because there is a significant investment in terms of signage that is already there. But I think it's important that we point out that.'",
        "'speaker_4': 'Former Council member and Vice Mayor Andrew's great commitment to the community as a young child. He played at what was Hamilton Ball and now to the field as a city council member. Oh, I want to go on to greatness in high school.'",
        "'speaker_4': 'Become a legend at public high school, a legend at Long Beach City College, a legend in the community, but also someone who was and has been instrumental in touching the lives of. Countless young people as a mentor, as an educator through the longest unified school district.'",
        "'speaker_4': 'His commitment to the city, his love for the city, his his accomplishments are far too much for me to go into right now. I'll leave that up to some in the community and my colleagues. But he is worthy of of our honor and this distinction.'",
        "'speaker_4': 'Our Parks Recreation Commission voted unanimously to support this naming. Dozens of letters have come in and public speakers from through the process have sent letters to my office and that of the sixth District Councilmember, Sally Sara. I want to thank Councilmember Sara for her support in this process because obviously this is this is something that will be'",
        "'speaker_4': 'in a sixth district in the central area, like I said, an area that a former councilmember or Vice Mayor DeAngelis represented for 13 years from 2007 to 2020 2000, 2013 years. That's that's that's another record, I believe, in terms of service on the city council.'",
        "'speaker_4': 'That should be noted. So that's it. I am very proud to bring forth this motion. I think of everything that this city council has been working on. Working on from the standpoint of. Equality and connecting and allowing our community members to to to have buy in.'",
        "'speaker_4': 'And in terms of process 2021, I think is is a great time, great year to to honor our former colleague, the Andrews. And so I'm proud to make this motion and as my council colleagues support.'",
        "'speaker_0': 'Throwing mango.'",
        "'speaker_2': 'Thank you. I'm very excited to support this renaming opportunity. I want to thank the committee for their diligent work on this important project. It was great to see Councilmember Andrews about a week ago at a local fifth District place.'",
        "'speaker_2': 'He's a staple of the community and it's great to still see him around and participating and I'm excited to support this in the same way that he has supported our city and our residents for more than a decade.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I support this item, and I very much appreciate everything that Vice Mayor Andrews did for our community and all of us individually as his colleagues. He was always so kind and understanding and just really taught me a lot about being on council and answered any question that I had when I first started and'",
        "'speaker_2': 'was just has always been just a very friendly and kind human being. And I think he presents a really amazing, selfless role model for a lot of the youth in the community. And he has been a very positive influence on a lot of people in terms of sharing his own experiences and lessons learned in his life.'",
        "'speaker_2': 'And for that, I'm grateful for him because not everyone shares this openly and as transparently as he did, and he did so far a greater good and really made some positive changes in our city. So I'm very happy to support this item.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you very much, Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Wanted to chime in. My voice is in support of this this action today. I think it's appropriate. Think it's fitting. I'm honored to have spent the time that I've spent on city council with Vice Mayor Andrews.'",
        "'speaker_4': 'I'm honored to cast his vote today in support of this effort. I think Councilman Vice Mayor Andrews has left an important impact in his story and his example and the fact that he loves Long Beach. And I'll tell you about the history.'",
        "'speaker_4': 'He'll tell you, you know, about his health, how he's helped impact history and set an example that anyone anyone born and raised or not born and raised in the city, you have something to offer and you can make a difference your entire life.'",
        "'speaker_4': 'And I think that's what it represents. And I think this is a very appropriate, very fitting. A great recommendation that came out of the committee. I want to thank both council members, Sorrell in Austin, for working together to make sure this this happens, Parks and Rec Commission and everyone involved.'",
        "'speaker_4': 'So I'm happy to cast his vote today in support of the news of the sports complex it should feel to be Andrews sports complex to feel. Thank you.'",
        "'speaker_0': 'Thank you, Council Supernanny.'",
        "'speaker_6': 'Thank you. It was quite an honor to chair the committee to bring this item forward. You know, there was on multiple occasions, I pointed out I was I was the number one sports fan of Andrew's. I think I showed his his highlight reel from the.'",
        "'speaker_4': 'Junior Rose.'",
        "'speaker_6': 'Bowl multiple times at.'",
        "'speaker_4': 'City council.'",
        "'speaker_6': 'But I'd just like to add to that, that when you consider that he was the first African-American student body president at Pauley High School in 1959, five years prior to the 64 Civil Rights Act, and he served on this council until 2020.'",
        "'speaker_6': 'So that's a leadership legacy within the community of over 60 years. And I'm just very, very proud to support this item. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Allen.'",
        "'speaker_3': 'I'm also very excited to support this item. I consider Councilwoman the Councilman de Andrews just a friend. I know also going to poly and being student body president one time. I mean, I think anyone that went to poly looks up to him.'",
        "'speaker_3': 'He's a role model and definitely a role model for me. And I also appreciated you know, we were talking earlier about the gentleman about jobs and and I know he was always pushing for jobs and and really hiring locally.'",
        "'speaker_3': 'And that's definitely a torch that that I'm happy to carry and just so proud of him. And I'm just so happy to support this.'",
        "'speaker_0': 'Thank you. The day has.'",
        "'speaker_2': 'Mayor also just wanted to make sure that I lent my support to this awesome item and to say congratulations to our former Vice Mayor Andrews for all the work that he did in the district and for his community.'",
        "'speaker_2': 'And to the naming of this and this location is definitely fitting. So very happy to support. And he will always remain in my mind as one of the best dressed council people I have always known. So. Cheers to our former vice mayor, Andres.'",
        "'speaker_0': 'I'll go ahead and say my comments at the end before the vote. And of course, I'm supportive as well. But I do think there's two members of the public. So why don't we allow the two members of the public to speak and then I'll close up.'",
        "'speaker_1': 'We have Sonic and Fay and Eric Parker.'",
        "'speaker_4': 'You can take my time, Mr.. If you want to. Okay. So I can say sixth district. It means a lot to be able here to support the former vice mayor, Dean Andrews. You know, when I was in the seventh grade, you know, I caught a case and, you know, and just the reality of the surroundings, of the'",
        "'speaker_4': 'environment that I grew up in. And my mother couldn't take off time to go to court with me. And for whatever reason, Mr. Andrews, you know, this is 24 years ago. He came in. He was my court liaison.'",
        "'speaker_4': 'And he helped me to get a very sizable amount of community service hours instead of the, uh, the sentence I never told him, and I don't think he remembers me. But, you know, that helped change my life. And I never forget that.'",
        "'speaker_4': 'And I asked him, uh, you don't even know me, man. And he said, Yeah, but I seen you in the neighborhood. And for me, it just, man had a lot to take and take care of the kids in the neighborhood, you know, to see someone of his size.'",
        "'speaker_4': 'So in a lot of the records that he was able to say 1248 rushing yards and Long Beach State. You know, he's still on the he's still on the records for that one. You know, I think he's the most sports accomplished council person in the last hundred years will say, I can't speak to, you know, the late'",
        "'speaker_4': '1800s, but I can say that in the 20th century, at least. And it's.'",
        "'speaker_6': 'Very appropriate that.'",
        "'speaker_4': 'Someone whose grew up in the 19th and Lewis, you know, he grew up in the neighborhood and it's just happened to skip away from city feel we in the community we very much support the civic family and and what it means to have them with respect to Hamilton Boone.'",
        "'speaker_4': 'And, you know, this is a, uh, um, a celebration of a pioneering athlete turned teacher turned, uh, political representative for a community that's been underrepresented for so long. And I just want to thank the city council here and everyone for supporting.'",
        "'speaker_4': 'And, um, yeah, I'm honored to speak in support of my hero, the former vice mayor Anthony. So thank you. Good afternoon, everyone. This town.'",
        "'speaker_0': 'Certainly got.'",
        "'speaker_4': 'Go. Oh, I got to put my back. About that, I guess you can describe. This town was very different when I came. Almost 60 years ago. There were places that. African-Americans could not go in this town. You can go to signal hill can go to some of that places these Long Beach.'",
        "'speaker_4': 'You council people are doing a great job because the symbolic. Effort. It's symbolic. Naming a field after a good friend of mine and a great person. But it stands to talk about how Long Beach has changed. In these years.'",
        "'speaker_4': 'Being an African-American, Latino, especially male. Living in this town and other cities in this country is tough. And for you to vote. Some of the ancestors who have gone and transitioned out are rejoicing now because you have voted.'",
        "'speaker_4': 'Someone who is African-American. In a symbolic way. And I think there are some friends of mine who's on the council vote on stance on talking about how you guys. But this town needs so much more. And this is a step in the right direction.'",
        "'speaker_4': 'I hope you take that seriously. You have to walk in the shoes of people who have been oppressed, and the equity things that you guys are trying to do with is monumental to try to bring some hope. To people who have been down depressed.'",
        "'speaker_4': 'You have an awesome responsibility. Let's not hide from it. Naming this field is a good token for that and it is very much deserving but says much, much more. Take out. From where you are. And look at the other guy.'",
        "'speaker_4': 'And legislation is not going to change it, but changing the hearts of people will. So supporting this is very, very good. Very honored to be honored this way. But there's so much more to do. And I know that because I know some friends on the council will do that.'",
        "'speaker_4': 'Thank you very much. That the new mayor council members. My name is Keith Durham. Lily. I grew up with this city.'",
        "'speaker_6': 'At.'",
        "'speaker_4': 'Seven years old. I came here from Oxnard, California. And the first thing, I lived in Navy housing and heard all the tales and stories about the great athletes we had. And then I got to meet this guy when I was 11 years old.'",
        "'speaker_4': 'We didn't know about college, but we knew about education. They took us to Cal State, Long Beach, put us on a bus, and we played all day. We went to the classes. We would play basketball. We swam and we were impressed.'",
        "'speaker_4': 'And as I got older, I played football and Pauly D rides up in a white Rolls-Royce with a white suit on and white shoes on, serve as a take tag. So the students were going like, I want to be like that guy.'",
        "'speaker_4': 'So we were like, He gets out, he's flamboyant, he's real cool. We say, Wow, we got to be like you. But the good thing about Eddie, he was the president of the Poly and Poly. I went to poly as the homeless and champions.'",
        "'speaker_4': 'So he just wasn't an athlete for be an African-American man to be the president. In 1959 at a school like Poly was run by a Virginia clergy club. You're going to be very bright as a person. You have to be on the class.'",
        "'speaker_4': 'You didn't get passed through like some of the athletes used to. So he had to be able to read and write, comprehend. So he's our hero. And I only had three heroes. I had it, Wilson, who was a councilman, he gave me a chance to see that somebody considered what you guys a black man, John Rambo, who's'",
        "'speaker_4': 'an Olympian, and the angels, those three people major me to do community work. I do now. So I represent a group called Cultural Arts in Long Beach. And about the future leaders, what we do. I teach young men to go out to be respectable, and I work with Council on Councilwoman Sue that facility.'",
        "'speaker_4': 'So we tried to build the camaraderie that the Angel talents to do, take kids where they haven't been before. We got to continue doing that. We missed that. You said said or high education is important athletic is second for a kid to be able to read and write comprehend like Mr. Judy and like you guys can do'",
        "'speaker_4': 'on this council. It represents what kids can be when they like Mayor Garcia. So we want to do the things and I feel I won championships there. I play there. We call the Hampton Ball. We call it the Dust Bowl because I'm mother.'",
        "'speaker_4': 'Why are you so dirty? We play at the Dust Bowl where you play. So we you know, we had a lot of the thing. So the church feel the angel feel together is a great accomplishment for a black man in that sixth district.'",
        "'speaker_4': 'So you guys keep doing a great job and thank you for honoring this. And you have a good day.'",
        "'speaker_0': 'Thank you, sir. I've actually got to give some additional comments before I close.'",
        "'speaker_4': 'Yes. Thank you, Mr. Mayor. They also want to thank those who took time out today to come and speak on public comment. I also want to thank the dozens of people who've written letters and emails and contacted my office and the sixth District office in support of this particular item.'",
        "'speaker_4': 'I think Mr. Lilley summed it up very, very well. This is an iconic figure. Who are we, who we are celebrating and recognizing home with this vote? And, you know, some of the people who have written and many of the people who have written in support of this item are our truly respected leaders throughout our community who've'",
        "'speaker_4': 'been impacted by Mr. Andrews and all of the impact work that he and commitment that he has had to the city of Long Beach for well over five or six decades. So with that is my comments. And again, I'm honored to bring this item forward and work with my colleagues to.'",
        "'speaker_4': 'Honor of our former colleague.'",
        "'speaker_0': 'If you're going to close. Close us up. I first want to just thank everyone for all the really great comments about Vice, me or Andrews or, you know, of course, Audie, as we as we all know him and and column and I particularly want to thank the members of the public that spoke.'",
        "'speaker_0': 'We've heard a lot of those stories before. But I think that the historic nature of the work that Vice Mayor Andrews has been involved with and especially his work at a time when he was a younger man, that was a much more difficult place for him.'",
        "'speaker_0': 'He's made a lasting impact on our community, and I'm just grateful to the entire council for working on this naming. It's very fitting and it's very, I think, very important a way to recognize someone's life contributions. And for those that haven't seen Vice Mayor Andrews in a while, he's doing very well.'",
        "'speaker_0': 'And he's still here and he's still going almost daily to his favorite McDonald's here in Long Beach. And, you know, he when when I hear things about him, is he every single day he goes out, buys a press telegram from the same delivery person every day, and then he walks into his favorite McDonald's in the morning and'",
        "'speaker_0': 'has breakfast there. So he's a real, real, real community guy. And with that, let's go ahead and vote on this item.'",
        "'speaker_1': 'Richard Kay.'"
    ],
    "Oral Report on Everyone Home Long Beach Initiative.": [
        "'speaker_0': 'Thank you. So just as a reminder, we have one item and then after this one item, it's a presentation, an important presentation. Then we move on to the budget hearing. So we're going to hear an update on the Everyone at Home Long Beach plan and then we'll move on to the budget.'",
        "'speaker_1': 'Item 17 is a report from Health and Human Services Development Services recommendation to receive and file an update on the Everyone Long Beach Initiative of the city by.'",
        "'speaker_0': 'Thank you. And before we before we have Mr. Modica start, I do know that everyone in front of them has the original everyone home Long Beach Task Force recommendations, I think should have a book in front of them.'",
        "'speaker_0': 'And also I know the presentation we wanted them in talking to Mr. Modica. For those who don't know our everyone home Long Beach plan is our our action plan and our work product that the Health Department put together with a really great group of folks from across the community chaired by our President, Jane Connolly of Cal State'",
        "'speaker_0': 'Long Beach, and included almost all of our organizations that were doing direct work around around homelessness and helping people experiencing homelessness and the housing work that's been in place for so many years. This plan will this update will give us the latest as to where this plan is from when it was released to the city council.'",
        "'speaker_0': 'And also talk about how we have met some of the metrics or maybe not met some of the metrics that we still have to work on as part of the plan. And so again, want to thank before Mr. Modica starts.'",
        "'speaker_0': 'Just the incredible group of folks that worked on this plan a few years ago. I think they are probably listed in this book and just grateful to that work and the work of the Long Beach Health Department. So, Mr. Modica.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I think he summarized that very, very well. So I will just turn it directly to Kelly and Oscar, who will give the report's Kelly copy and Oscar worthy.'",
        "'speaker_7': 'Good evening, honorable mayor and Council Members. I thank you for this opportunity to share the mid-term progress on everyone's home line breach plan. Oscar worthy Director of Development Services has joined me for this presentation. You. Everyone from Long Beach Initiative was established to address the homelessness crisis in the city of Long Beach.'",
        "'speaker_7': 'We gathered a task force chaired by Cal State Long Beach President Jane Close Connelly. The task force comprised of nearly 50 community leaders, stakeholders and people with lived experience during the summer of 2018 to present information on homelessness, existing resources and gaps, the task force developed engaged the Homeless Services Advisory Committee, Continuum of Care Board and other'",
        "'speaker_7': 'community members to inform the recommendations. The Task Force established a set of goals and strategies which were adopted on December 11th, 2018. This document has been our guiding focus since that time. There are seven key goals within the report.'",
        "'speaker_7': 'Strengthening governance. And increasing funding. Increasing housing access. Reducing homelessness.'",
        "'speaker_2': 'Employing people.'",
        "'speaker_7': 'Supporting families. Connected to help. And developing population based service models. I'd like to start tonight's presentation with some context. In our last homeless count in January 2020, just before the pandemic, we had 2034 people experiencing homelessness in Long Beach.'",
        "'speaker_7': 'This was up slightly from the previous year. People self-reported that they became homeless due to insufficient income and loss of jobs, family problems, loss of housing and behavioral health concerns, including mental health and substance use. Nearly half reported that it was their first time homeless.'",
        "'speaker_7': '28% had experienced homelessness for more than two years and are considered chronically homeless. In the past year, we have seen substantial increases in funding and recognition of homelessness as a public health crisis. However, this is not fully led to more people in transitional housing, as COVID 19 protocols reduce by nearly half the number of beds available in'",
        "'speaker_7': 'congregate shelters. Given the distancing restrictions and some shelters stopped taking new participants to ensure a person with COVID wasn't entering the facility, we began to hear more about encampments and as CDC guidance was to reduce encampment cleanups, to reduce possible community transmission due to encampment disruption proven also led to reduced access to vital public facilities and services'",
        "'speaker_7': 'as people were needing them even more than before. Another factor in the past year was the focus on reducing people in congregate settings, including the jails and prisons to reduce transmission. People in jails and prisons were released, but there were little, if any, additional housing and resources to meet their needs, leaving many of them homeless as well'",
        "'speaker_7': '. The COVID pandemic has in many ways set us back in our efforts a little to address homelessness in Long Beach. However, you will see that we've made great strides on many areas of the Everyone Home Long Beach plan and we have significant opportunities in our future.'",
        "'speaker_7': 'Our first goal was to strengthen governance and increase funding. It was to build governance, data capabilities, communications and financing to support a coordinated and robust homeless services system and housing system. The task force set a goal of 25 million and ongoing sustainable funding for operations, programs and services and another 220 million in capital funding.'",
        "'speaker_7': 'Rapidly expanding state and county funding has helped us move very close to this goal. To date, we're very near the goals for ongoing funding and one quarter of the way there for capital funding. We expect to reach about 50% of the capital funding goal by 2023.'",
        "'speaker_7': 'Is there significant capital funding in the state budget over the next two years? The chart on the left here shows the funding. In 2018, we had eight funding sources for a total of $39 million, including housing voucher subsidies and capital funding.'",
        "'speaker_7': 'We now have 11 funding sources totaling nearly $95 million. 64 million is for new services and assistance funding, and 23 million is available to us through grant terms over the next two years. The primary focus areas for the funding include interim housing, housing authority, vouchers and capital improvements, remaining funds, support, homeless prevention, outreach, coordinated entry system and'",
        "'speaker_7': 'case management, rapid rehousing and permanent supportive housing. Remaining resources also fund MSD Operations Program and Administrative Staffing Data Systems and overall administration. Our additional accomplishments in it, in addition to the funding, is that we have elevated the homeless services from a division to a bureau, hiring many new staff, including a focus on hiring around mental health and'",
        "'speaker_7': 'health care in our jurisdictional work and other special projects. We improve the continuum of care governance, adopting a new charter in 2020 to increase policy and decision making responsibility within the CRC Board. We also implemented a new number and implemented a number of collaborative work groups to focus on specific areas of need in the city.'",
        "'speaker_7': 'Finally, we enhance collaboration by transitioning to the Clarity Homeless Management Information system, which is right surrounding jurisdictions are using. This allows us to better coordinate services and outcomes with our regional partners. Our initiatives in progress include developing an affirmative marketing plan to ensure communications are focused and effective in achieving equity for communities who are disproportionately impacted by'",
        "'speaker_7': 'and experiencing homelessness. We are implementing a lived experience advisory board to ensure a lived experience is informing our policy program and resource decision making. We expanded access and referrals to the coordinated entry system to improve access so that regardless of which homeless services provider you are working with, you are being all or being prioritized for the resources'",
        "'speaker_7': 'within the system. And we're also developing contractor performance management dashboards, advocating for additional funding and piloting the Unite US referral platform to increase service access. The second goal is to expand housing opportunities and incentivize major landlords to provide housing to low income and homeless individuals and families.'",
        "'speaker_7': 'Everyone home goals for increasing housing. Access for 200 shelter beds by 2020, 200 new permanent supportive housing units by 2023 and 2000 very low and low income units either entitled or online in the pipeline by 2023. We have made strong progress on this goal in the past two and a half years, surpassed our goal by double in'",
        "'speaker_7': '2024. The shelter crisis beds are bringing 402 shelter crisis beds online in 2020. 402 beds in one year. During the pandemic, we have quadrupled the permanent supportive housing goal with 844 units of permanent supportive housing underway or completed.'",
        "'speaker_7': 'And we have an additional 425 units of low and very low income housing being developed or in the pipeline. In 2020, the city opened. The Atlantic Bridge community in North Long Beach, purchased the best western motel on Long Beach Boulevard.'",
        "'speaker_7': 'The project Homekey funding and supported the Los Angeles County Purchase and opening a project Homekey Sites funded Motel six and Holiday Inn, which brought an additional 175 beds to our city. We continue to operate Project Roomkey through August of 2021, which brings an additional 43 beds.'",
        "'speaker_7': 'In addition, we've issued 1582 vouchers for a total of 9375 bed nights. Through our new nightly capacity at this time is 484 individuals and households each night.'",
        "'speaker_0': 'Efforts to increase our housing access has resulted in the development or processing of approximately or not approximately 1269 total supportive housing units, as well as low and very low income housing units. This figure includes 15 projects that have been completed throughout the city.'",
        "'speaker_8': 'With a yield.'",
        "'speaker_0': 'Of approximately 589 total housing units. Next slide, please. Also included in this figure are the preservation and rehabilitation efforts that have maintained 288 units in the city. Three residential projects with 53 units currently under construction and five development projects with 483 units that are approved or in the permitting process.'",
        "'speaker_8': 'We estimate that an additional 400.'",
        "'speaker_0': 'Units will be processed in the near future under current funding sources. Next slide, please. Additional accomplishments aimed at increasing housing access include inclusionary housing and the no net loss ordinance aimed at providing new affordable housing through new market rate development.'",
        "'speaker_0': 'The motel conversion ordinance creates avenues to increase supportive and rapid entry, as well as transitional housing. The Interim Housing Zoning Code Update expanded the locations of interim housing, as well as supportive of various supportive housing types throughout the city.'",
        "'speaker_0': 'The A.C. ordinance provides a clear path to encourage the rehabilitation and preservation of unpermitted units and the Miller Ordinance updated policies for the replacement of affordable housing within the coastal zone. The new plan and rezoning, which is a collaborative effort between the city and the North Long Beach community, establish zoning to provide, in part, additional housing support'",
        "'speaker_0': '. Excellent.'",
        "'speaker_7': 'Continue to develop new housing opportunities through the Long Beach Recovery Act. In the next year, we anticipate opening a transition age shelter for youth aged 17 to 24 at our Navigation Center location on Hayes Avenue, as well as bringing 50 modular shelter units online.'",
        "'speaker_7': 'The Project Homekey sites are slated to be turned into permanent supportive housing in 2022, utilizing state funding, bringing an additional 217 permanent supportive housing units online.'",
        "'speaker_0': 'Thank you. Notable policy efforts. Policy efforts included the housing element, which will identify development opportunities to accommodate over 26,000 additional dwelling units throughout the city of various income levels. The housing element was released earlier this year. Community engagement continues and the draft element will be brought to the council in the fourth quarter of this year.'",
        "'speaker_0': 'The Anaheim Corridor Zoning Implementation Plan will provide visioning and planning efforts for new zones that will implement the land use element and encourage housing production. Lastly, the Enhanced Density Bonus Program is designed to incentivize and facilitate the development of mixed income.'",
        "'speaker_4': 'Multifamily housing.'",
        "'speaker_8': 'By.'",
        "'speaker_0': 'Establishing development concessions in exchange for onsite affordable units. Excellent.'",
        "'speaker_7': 'The third goal is to reduce homelessness. We reduce homelessness for prevention, early intervention and reducing our chronic homeless population. The Homeless Services division as partners continue to make progress on this goal. The goal focuses on reducing people falling into homelessness to fewer than 1500 annually, ensuring that if people fall into homelessness, they can be rehoused within six'",
        "'speaker_7': 'months, and that we have fewer than 350 chronically homeless people in Long Beach. The pandemic has slowed our progress in preventing homelessness. We currently are serving 1200 new homeless households engaged with us as well as we know that during the homeless count there were nearly a thousand people who were identified.'",
        "'speaker_7': 'So we know that there are more than 1500 households currently that are falling into homelessness. You prevention resources are available and we'll continue to work closely with partners to reduce the number of falling into homelessness. We've made strong progress in moving people from temporary to permanent housing.'",
        "'speaker_7': 'At this time, 66% of households access housing in less than six months, and 74% of households with a child are accessing housing within six months. Producing and reducing our chronically homeless population remains a challenge. The 2020 count found that we had 665 people who are chronically homeless.'",
        "'speaker_7': 'We continue to prioritize those who've been homeless for more than two years and seek to achieve this goal by 2023. These charts sort of provide a picture to what we were just discussing. What you'll see here is that in the chart on the left is that the chronic, chronically homeless population remains fairly stable, and that what we're'",
        "'speaker_7': 'seeing is that the new homeless is where we're seeing our increases. We continue to prioritize this population and work to build relationship and connection to services that on the right shows the percent of households exiting to permanent housing over a over a year time frame and longer.'",
        "'speaker_7': 'And once again, 66% of adults and 74% of families with children exit into permanent housing within six months. People who are experiencing unsheltered homelessness have significant, longer experiences of homelessness. This chart here basically shows it shows you that we've been fairly consistent in our ability to house people each year when we're talking about households.'",
        "'speaker_7': 'But because we've had the increase in resources in 2020, we have seen an increase, almost doubling of the number of households that we've been able to house in one year. We continue to expand outreach and sheltering opportunities. We've moved forward with outreach on the weekends and high impact neighborhoods and implemented the Safe Parking Program with the ability'",
        "'speaker_7': 'to serve 13 each night. We are working now to identify an additional site and expand operations.'",
        "'speaker_0': 'The L.B. Cares Rental Assistance Program provided up to $3,000 per household impacted by the pandemic. This program served 1440 households in the city. The city also entered into an MOU with L.A. County to provide legal assistance for those experiencing tenant landlord disputes.'",
        "'speaker_0': 'Policies to reduce homelessness included tenant assistance, including just cost termination, as well as the State Tenant Protection Act, which established provisions to protect tenants from evictions caused by the pandemic. The Senior and Disabled Security Deposit Assistance Program provided provides security deposit assistance of up to $3,000 to lower income seniors and or disabled households.'",
        "'speaker_0': 'Excellent.'",
        "'speaker_7': 'The Housing Authority received 582 emergency housing vouchers this year for people experiencing homelessness. This is a great opportunity to provide permanent housing opportunities in existing housing across the city. Vouchers will be prioritized for those with the greatest need.'",
        "'speaker_7': 'We have identified funding to provide case management to households receiving these vouchers to support their housing success.'",
        "'speaker_0': 'The City Council elected to combine federal and state funds for a total of $64.4 million to provide rental assistance for those tenants impacted by the pandemic. So far, there are over 13,000 registered applicants and we continue to process their requests.'",
        "'speaker_0': 'The city will be amending the MRU with the County of Los Angeles to expand the right to counsel program services to assist tenants facing evictions due to direct and indirect impacts from the pandemic and related economic impact. Excellent.'",
        "'speaker_7': 'The fourth goal is focused on increasing employment opportunities for people at risk of or experiencing homelessness. Our goal was to create 600 new job opportunities for adults and 240 job opportunities for transition age youth by 2021. At this time, the city has created 60 slots of supported employment and we are in the planning for a transition age'",
        "'speaker_7': 'youth program. During the pandemic, many jobs across the city were lost and creating new opportunities was very difficult. Jobs programs with our partners continued, but at lower capacities during the pandemic, we continued to seek employment resources. The primary funding in the county is administered through the Los Angeles County Department of Workforce Development, Aging and Community Services, otherwise'",
        "'speaker_7': 'known as the Relax Relax hubs for initiatives focused on employment, supports for people experiencing homelessness across the county and is seeing large increases in funding. We are working to tap into those programs and resources to grow employment supports in the City of London.'",
        "'speaker_7': 'Homeless pilot. The other things that we have been doing this year is the Homeless Corp pilot, which is current misdemeanors and working and works towards dismissal. If persons are working with service provider which expunging their past convictions and works to address current warrants, that may be barriers to housing or employment.'",
        "'speaker_7': 'Pacific Gateway has co-located career counseling staff across the city at places like the Center for Health Equity and Reform, as well as link housing sites such as the Spark and the Palace. Pacific Gateway has engaged in a cross-agency case conferencing.'",
        "'speaker_7': 'The Long Beach Youth Services Network addressing the housing, health, employment and other needs of transition age youth. In progress. As part of the Recovery Act, the Health Department is exploring partnerships with economic development and public works to create a social enterprise healthy foods market at the Rented Bridge Farm Shelter in North Bombay, which would create a workforce'",
        "'speaker_7': 'development opportunity for transition age youth experiencing homelessness, as well as providing access to healthy food for the surrounding neighborhood. Pacific Gateway has reached out to the City of Long Beach Council of Business Associations, encouraging businesses to create employment opportunities for jobseekers experiencing homelessness.'",
        "'speaker_7': 'We also continue to focus on our employment program through our state hub funding and our focus. And there are tax incentives, state tax incentives for hiring persons who are experiencing homelessness. It goes supporting families and children so that we know that we have strong families because we know they are essential to positive futures.'",
        "'speaker_7': 'We set out to establish 400 new childcare slots for very low income and homeless parents by 2021. 200 were created prior to the pandemic, but we don't have a good sense of where things are now, given the pandemic's impact on early childhood providers.'",
        "'speaker_7': 'In 2018, the Health Department launched the Early Childhood Education Plan that outlined many goals and strategies to ensure our young children and families have opportunities for success. It continued to implement this plan that included creating opportunities for people experiencing homelessness.'",
        "'speaker_7': 'Also, nearly 1 million in CARES Act funding supported families and providers in the past year, and we will continue this work through the Recovery Act. In addition, we are creating housing opportunities as part of the previously discussed emergency vouchers.'",
        "'speaker_7': 'We are currently holding 100 vouchers for families with young children, as well as 64 people being served by a victim service provider. Future opportunities include 1 billion in funding and then state budget to address family homelessness and 1.5 million set aside for early childhood supports in the Recovery Act.'",
        "'speaker_7': 'The six goals focused on behavioral health and physical health services. This girl continues to be our most difficult to achieve, given county focus and funding limitations. At this time, there are only three medical detox sites in L.A. County, and we have not identified substance use funds for sobering center.'",
        "'speaker_7': 'We have continued to engage in conversations with the county around detox programs. However, Medi-Cal funding does not fund these at the same level as other services, and few providers are interested in opening these sites. The county has opened 14 new recuperative care beds in the city, but they serve not just the city of Long Beach, but all'",
        "'speaker_7': 'of L.A. County. Mechanisms for tracking hospital E.R. discharge data are not currently available. Prior to the pandemic, there was a discharge planning collaborative that kept track of this, but they have not been meeting since the pandemic due to resourcing, and we anticipate that that will start back up in upcoming months.'",
        "'speaker_7': 'However, in the past year we have implemented a number of programs to support the health and mental health of people experiencing homelessness. This includes partnering with UCLA to implement a mobile opiate and HIV testing and treatment pilot, conducting vaccination clinics at the mercy shelters and in encampments, visiting registered nurses at various shelter sites, and placing a mental'",
        "'speaker_7': 'health clinician at the mercy to engage with people at the mercy. Moving into this year. We are also we are implementing a number of new programs, including our new REACH program with the mental health and public health nurses in the field and additional alternative mental health crisis planning.'",
        "'speaker_7': 'We continue to partner and advocate with the Los Angeles Department of Mental Health and Safety and Substance Use Center to advise mental states right to increase mental health and substance use opportunities in Long Beach. Yet this was not a key focus area of the county in the past year.'",
        "'speaker_7': 'Finally, the Recovery Act funds are providing an opportunity for mobile, mental or mobile multi-service clinics to create greater access to services in the community. And our final goal is focused on developing population specific housing opportunities and supports. There are many initiatives taking place to generate housing and supportive services for specific populations in Long Beach.'",
        "'speaker_7': 'To date, we funded rapid rehousing and homeless prevention services for youth utilizing hip funds. He funds one strategic plan for youth in emerging adults and the Office of Youth Development. These efforts focus on upstream prevention of homelessness in our youth.'",
        "'speaker_7': 'The Department is currently hiring a youth development manager as well as a reentry coordinator, funding a healthy aging coordinator, and establishing an older adult housing work group through the Healthy Aging Center. Collaborating with Pacific Gateway and other providers to connect transition ages, age youth to housing and supportive services.'",
        "'speaker_7': 'Focusing on equity and homeless services and partnering with the L.A. County offers a diversion and reentry co-location at the Multi-Service Center. There are ongoing challenges and needs that that have come from the pandemic. The economic impacts of COVID 19 pandemic rapidly exacerbated existing affordable housing and homeless needs and service gaps.'",
        "'speaker_7': 'We've seen a real increase in the cost of real estate, which impacts housing affordability and production, as well as the city's ability to purchase and construct facilities without sacrificing direct services. We had city staff focus, the city staff focus and prioritization has shifted due to the pandemic response.'",
        "'speaker_7': 'Hiring challenges have limited our capacity of the Homeless Services Bureau to quickly respond to emerging needs. The administration and location of mental health and substance use. Reentry services largely fall under L.A. County's jurisdiction, and they're planning is not currently meet the needs for Long Beach.'",
        "'speaker_7': 'You've also had new a lot of new and more flexible state funding, but they're almost all one time funds limiting the ability to fund ongoing supports and operations to support homeless services. The new Long Beach Recovery Act funds, which are approximately $11 million, will support the creation of multiple new programs, including two mobile mental to mobile and'",
        "'speaker_7': 'AC clinics that will be deployed throughout the community to improve services. The modular shelter program, the opening of a navigation center which will have storage as well as 12 shelter beds for youth outreach workers stationed at libraries throughout Long Beach.'",
        "'speaker_7': 'Supported employment programs for youth. Expansion of the Safe Parking Program. And implementation of the REACH program. The Rich program launched at the beginning of August. It is a mobile response team focused on urgent community requests and low level, non nonviolent calls for service related to people experiencing homelessness.'",
        "'speaker_7': 'There are two teams. Each one has a public health nurse, a mental health condition and two outreach workers. We are also hiring one person to focus specifically on phones and field coordination. This really is an alternative response model focused on getting people to services such as interim and interim and permanent housing, mental and physical health services.'",
        "'speaker_7': 'Case management. Crisis intervention and trauma informed care. The REACH team is currently available 7 a.m. to 5 p.m. during the weekdays and will be expanding that as additional resources are secured. At this time it is early. Watch it or piloting the proactive outreach in impacted areas and urgent requests and in early September will be we'll have live'",
        "'speaker_7': 'response to the MFC hotline, the version of low level and nonviolent nine on one calls for service with police and fire department handle. There's a large set of opportunities when it comes to funding. The enacted 2021 state budget provides about $10 billion towards housing and homelessness, reflecting the level of focus and support the state is providing to'",
        "'speaker_7': 'this important issue. The allocations listed here represent a variety of funding sources administered by different agencies, some of which are direct funding, while others are competitive grants or collaborations with the county. All of these represent opportunities to address the various root causes of homelessness.'",
        "'speaker_7': 'I don't plan to go through all of these, but you have them available to you to understand the large number and focus areas of funding available. We do know that you cannot run you cannot address homelessness in our city with just city employees.'",
        "'speaker_7': 'This list represents a portion of our important partners in this work. It takes all of us working together toward the same goals. Your city and community based teams. Thank you for your support in our efforts. I also want to give a big shout out to our homeless services team who kept the NSC open and have worked every'",
        "'speaker_7': 'day during the pandemic to ensure people experiencing homelessness feel supported, are housed and can continue their progress toward housing. It has been a big year for our Homeless Services Now bureau. So with that and our presentation or open for questions.'",
        "'speaker_4': 'Thank you, Mayor. Members of the City Council. Mr. Vice Mayor. That was a comprehensive presentation. I know this is such a big topic for the council. We wanted to really show you kind of all the pieces. We're prepared to answer a lot of questions.'",
        "'speaker_4': 'I do want to underscore, while there's a lot of successes and you can see there's funding opportunities, the funding need is still incredibly great. Affordable housing is incredibly expensive to build along, which has been a leader in that.'",
        "'speaker_4': 'But we need more and more resources every time we open up one of our shelters to those take operation dollars to be able to run, not only purchase them and run them. So the team is very aggressive. They're looking for a lot of funding opportunities that are out there.'",
        "'speaker_4': 'But I do want to point out there is still a ways to go. We know that there's a crisis across the country. Long Beach is a model in reacting and responding and being very proactive, as well as compassionate about dealing with people who are experiencing homelessness.'",
        "'speaker_4': 'But we know there is still a lot of work left to do. And with that, we're available for questions. Thank you, Tom. So we'll take the conversation back behind the rail. I'll go ahead and start. First of all, thanks for acknowledging there's still a long way to go.'",
        "'speaker_4': 'But what you have here, I think you demonstrate incredible progress. Congratulations to you. Our continuum of care, all of our partners on the incredible work that you presented today and your hard work over the past few years since adopting the Everyone Home Plan.'",
        "'speaker_4': 'When we adopted this, we emphasized data and goals, and what you were able to present today was responses with data and metrics and goals, and that's a measurability and that's important to highlight. We love to see that in plans because we can show to the public the benefit of having our own health department and our own continuum'",
        "'speaker_4': 'of care. We can we can control local outcomes on these issues. That's incredibly important. I think I'll highlight a few things and then I have a question or two. I'm very happy to see a lot of the things here, particularly the expansion of temporary shelter beds.'",
        "'speaker_4': 'We had no idea we would be able to expand so much over the course of the past year. And I think the pandemic actually changed a lot of attitudes around that. A lot of my backyard sentiments and you saw people even with the temporary shelters during the pandemic that popped up temporarily all across town prior to Project'",
        "'speaker_4': 'Homekey. You saw a complete change in that narrative. That's important to note. I'm very happy with the Atlantic Bridge community in North Long Beach. I'm very happy was completed. The residents are happy with it. It's a great community.'",
        "'speaker_4': 'We can't get to the larger master plan fast enough, so we want to get to that so we can actually start talking about what the what the permanent site looks like. I'm happy to see the direct connection to racial equity.'",
        "'speaker_4': 'I think it's important. You know, we've learned a lot and it's important that we make a connection. We know that homelessness disproportionately, it impacts everyone, but this personally impacts black homeless. We know that black families are impacted to a significant degree.'",
        "'speaker_4': 'And if you go in with that awareness, then you know how to approach the issue with the right level of attention and cultural sensitivity to be able to address the issues. That's important. I love that you had a policy like a lot of the homelessness issues and the poverty issues we have in our city are directly linked'",
        "'speaker_4': 'to policy, land policy, and the solution will have to be rooted in policy. And so you highlighted things like inclusion, inclusionary housing, dwelling, amnesty or local land use plans like the Uptown Plan, motel conversions and our housing element.'",
        "'speaker_4': 'The fact that in our land use element we create the space for 26,000 units that's actually above what our arena requirement is, is important. And that's important for people to understand because within that arena number, it's previous need, current need and future need over the next decade for housing.'",
        "'speaker_4': 'All of that is built into that number. We've already put forward a number and created the space in the city to surpass it. All other communities are really fighting and struggling to figure out how to deal with it.'",
        "'speaker_4': 'We were ahead of the ball, ahead of the curve. That's really important to note. I love the highlight under go for around jobs and employment. I love the partnership at the the new Ron Arias Health Equity Center soon to open.'",
        "'speaker_4': 'We love to see that the social enterprise market with the Atlantic Bridge community that will employ individuals experiencing homelessness. I think that's important. And and I also know that there are still there's still much more to do. There are some some threats.'",
        "'speaker_4': 'And one significant threat is growth of the social. Economic conditions globally are still creating conditions where people are still vulnerable. The vulnerability is still there are people still slipping into homelessness. And so that moves our targets. It's hard to say this is our goal when the goal continues to grow.'",
        "'speaker_4': 'We're seeing this resident see this manifest in the scenes of life. You see them in the you know, you see encampments that crop up on freeway, on an off ramps and in the areas that are not even the responsibility, the city, but other agencies.'",
        "'speaker_4': 'But that's what our community see. And those people definitely, certainly need help. So I think we're headed in the right direction with the partnerships that were born with Caltrans and others. I think that's important. I think it's important to know it's going to be expensive to buy, to build affordable housing.'",
        "'speaker_4': 'We had, you know, redevelopment years ago, $25 million a year. We're going to have affordable housing production. We're nowhere close to that in terms of the subsidy. Have to think outside the box. We have to continue to advocate for a dedicated source of revenue.'",
        "'speaker_4': 'I think one are opportunities as be. 649. A lot a lot comes out of Sacramento that may or may not be helpful as it relates to local giving local cities the tools to make a difference. And I think this is one that will on city council and have a discussion next week about supporting SB 649.'",
        "'speaker_4': 'And, you know, a few other things I think, you know, we need to think about creating our own mental health department within the city. No other jurisdictions have done that and have contracted in from the county. And I would love to explore what looks like the contract in mental health services.'",
        "'speaker_4': 'I think we need our own housing department to think about something to talk about. And I think the rights program, I think it's a great the fact that is great that we're rolling it out. I think there's some questions and, you know, I'll stop there, but I'll go ahead and ask a question on the REACH model.'",
        "'speaker_4': 'Walk me through a little bit of how how it works. I know it's a separate phone line to 911, but walked me through what happens if someone calls our regular emergency line 911? How would that be processed with the Reese model?'",
        "'speaker_4': 'If you could walk me through that, I think that would be helpful.'",
        "'speaker_7': 'They said they could call two different lines. So, one, they could call the NSC directly and request support, and then we would respond or they could call 911. And there are certain certain criteria for which 911 would transfer that line to the to the NSC to respond.'",
        "'speaker_7': 'Or they would send out, depending the police and fire department, depending on what the call was about. And then once their situation may be stabilized, to the point that the REACH team would then arrive and there would be a handoff opportunity at that point to continue to work with someone to engage them in additional services.'",
        "'speaker_4': 'Okay, great. So it sounds like there's more than one way that people can call and access this reach service or alternative crisis response. Okay. Those are my comments. I'm going to go now to Councilwoman Mongo.'",
        "'speaker_2': 'Thank you. I'm pushing the wrong button. Thank you. When you were talking about goal four of employing people, you discussed DAX or we DAX, the workforce development agent and Community Services Department and the program that they have. We have our own workforce department and typically when federal funds are allocated, we have our own allocation.'",
        "'speaker_2': 'Have we advocated for a similar apportionment for direct allocation to our own workforce development department of the Homeless funding for employing people out of homelessness? I know that.'",
        "'speaker_7': 'There are specific funds that we taxes receiving that is not federal funding. Correct. So it's coming from the county funding and. Correct.'",
        "'speaker_2': 'And I'm asking if we're advocating to use the same federal formula, if L.A. County on the way that Exide gets 40 million and we get 4 million, then if the county is receiving homeless funds and the amount of 4 million, then we would get equivalent.'",
        "'speaker_7': 'I understand now. Thank you. And I would have to, you know, engage with have the workforce discuss that upward.'",
        "'speaker_2': 'So I'm really interested in having that discussion. Otto Solorzano, the director, they're great individual, used to be my boss, and he was often really open to partnerships, especially regional ones that decentralized funding and gave other agencies the opportunity as long as we reported back on the systems that they're using to provide transparency through their dashboard.'",
        "'speaker_2': 'And I just see that as a huge opportunity for us to localize that workforce side that I just think is critical in getting individuals employed. I also want to thank our Economic Development Commission. I sat in on their meeting on Monday and their discussions around different issues that help people stay off the brink of homelessness and fall'",
        "'speaker_2': 'into homelessness and what economic factors that they can contribute to. And I really think it's very thoughtful and I appreciate that. I see an intersection between the Everyone Home and the Workforce blueprint to point out that I see as being a really huge step.'",
        "'speaker_2': 'I also appreciate this is a very comprehensive report and I know we're doing so much. And when we talked about the chronically homeless. I don't know if I can find the page quickly enough. It doesn't seem like we're making as much of an impact.'",
        "'speaker_2': 'And I think you'd stated how long a person is homeless to become chronically homeless. Could you remind me what that was? Over two years. Over two years. So. Is it that how many chronically homeless individuals are we getting into housing annually?'",
        "'speaker_7': 'I'm going to ask Paul Duncan, who's in the audience, if he has that number. We don't have a specific number.'",
        "'speaker_2': 'Like a dozen, two dozen. I mean, we have 600 people who are chronically homeless and that number is fluctuating a little bit. But I'm not clear what the inflow is and what the outflow is. And do we have a dashboard that demonstrates that?'",
        "'speaker_7': 'Can we can bring that information forward. But I'm going to ask Paul to join us now.'",
        "'speaker_4': 'Good evening, council members. The large majority of the permanent supportive housing units that you see within that presentation are all prioritized to people that are experiencing chronically homeless or experiencing chronic homelessness, as well as a number of resources that we get through HUD and through our Continuum of Care program.'",
        "'speaker_4': 'So we receive $10 million annually, about 6 million of that goes towards permanent supportive housing. So anytime there's a turnover in one of those units, they're also prioritized towards people that are experiencing chronic homelessness. So the majority of the people that we're housing that are single adults tend to be chronically homeless.'",
        "'speaker_2': 'Thank you. I appreciate that. I think that. There's a lot of discussion in our community about. How much do we spend on homelessness? It's not enough. I don't think people know how much it is. If you look at a $90 million number or a $40 million number, and then you take the homeless count of.'",
        "'speaker_2': '1820, 400, I mean, different numbers of year by year. And you spread that out and then you add to it the additional resources that are provided by city departments that are really just embedded in the work that we do every day.'",
        "'speaker_2': 'I think it really speaks to the value of certain programs. And this was another discussion that was had at the Economic Development Commission, which is the universal basic income. And if the universal basic income could keep someone from falling into homelessness and how much it really saves the taxpayer in the long run.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you. Next, we have Councilwoman Pryce.'",
        "'speaker_2': 'Thank you very much. So thanks for that presentation. I really appreciate it. Has a lot of detail. I think it's safe to say that some of the increase that we've seen, increase of transient activity and homelessness that we've seen over the last year has a lot to do with the early release of certain populations without treatment rehabilitation'",
        "'speaker_2': 'once they're released from custody. Is that fair to say?'",
        "'speaker_7': 'We are saying that on the street. Yes.'",
        "'speaker_2': 'You know, are there any sort of what organizations do we have available in the city of Long Beach that can meet people literally as they're leaving jail to provide them access to services or offer some sort of, you know, treatment program or reentry services.'",
        "'speaker_7': 'We currently have the jail commission, so that is in jail now and who assesses and connects people to services as they're coming out. And we have a treatment center which also focuses with that population, but there's insufficient supports, certainly within the city of Palm Beach and frankly, all across L.A. County in the ability to address the number'",
        "'speaker_7': 'of people who need mental health and substance use support.'",
        "'speaker_2': 'That's unfortunate. What about in the area of nonprofits? I know in Orange County, we have an amazing organization called Project Kinship. They work really closely with our health care agency. They're literally at the jail. As people are released, they'll interface with everyone and at least give them the opportunity to connect.'",
        "'speaker_2': 'Is there any nonprofits like that that are active in that space? Not necessarily in Long Beach, but even in the county jail.'",
        "'speaker_4': 'We have a number of nonprofits that are focused to measure. H also pays for some jail and it's more focused on the county jails where necessarily the city jails. But there are a number of nonprofits that are doing enrich to the jails.'",
        "'speaker_4': 'And then we have a number of nonprofits that are focused on our reentry population within Long Beach. The two organizations that are most active within that space are there's three are The Advocate, a Tarzana treatment center and a center.'",
        "'speaker_4': 'So there are three nonprofits that we do work with and also partner with the city prosecutor's office and supporting and contracting to to some of those agencies.'",
        "'speaker_2': 'Okay. Thank you for that information. That might be something that maybe we can do a study session on in the future, because I think the work that those organizations do is incredible and would be worth highlighting and replicating many times over.'",
        "'speaker_2': 'And, you know, while we're talking about incredible work, Paul, I just want to take a moment and thank you. You've just been a really noticeable force over at the multicultural center. And I will say that my team and I very much enjoy working with you and appreciate your responsiveness and understanding.'",
        "'speaker_2': 'You know, kind of where we're coming from. It's always from a place of patience, not judgment and help. And I really appreciate that. So thank you. In regards to the jail conditions, so we do still have a jail commission in the jail in Long Beach.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_7': 'Programs still exist. But I think during the during the pandemic, it's been not as much of a presence, but an opportunity, I think more an online presence.'",
        "'speaker_2': 'Okay. All right. In terms of the employment opportunities you talked about, I know that a number of years ago that was one of the items I brought to council to start our homeless work pilot program. I'm curious, how is that program going and is that something that we can consider turning into a more of a permanent program'",
        "'speaker_2': 'moving forward?'",
        "'speaker_4': 'Yeah. When we look at some of the work force development programs that exist, there's a large focus on metrics, especially with the funding that comes from the federal level and really making sure that people are getting to sustainable, sustainable employment.'",
        "'speaker_4': 'And what we often see is a real hesitance to work with people that have been experiencing homelessness and maybe have been out of the workforce for a while because the outcomes are often not quite as high. So really looking at things around supportive employment, where we're offering some financial assistance to take a chance on somebody and provide'",
        "'speaker_4': 'them an employment opportunity. And I think that's the one area that we've seen the largest impact looking at employment focused services for people experiencing homelessness. So we could definitely look at expanding more opportunities there.'",
        "'speaker_2': 'That's great. I would very much support that and then I know I'm out of time here. But just the final question, the REACH program, which is a replacement for the HARP program. I know the HEART program had to have some approvals from L.A. County.'",
        "'speaker_2': 'DHS does the REACH program, or am I mistaken on that? I just don't know what kind of approvals we need from the county.'",
        "'speaker_7': 'The REACH program does not need any approvals.'",
        "'speaker_2': 'Got it. Thank you.'",
        "'speaker_4': 'Thank you. Council member Supernormal.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'I will also follow up on the REACH program.'",
        "'speaker_6': 'We we featured that in our July 30th newsletter and we included a link to your I think it's July 22nd press release on that. And for for folks reading our newsletter, it's a little bit of a complicated formula.'",
        "'speaker_6': 'And so I guess I wanted to drill down a little bit on that. So fire will still respond to calls for persons experiencing homelessness. We know after 4:30 p.m. they will do that. But let's say during the day, will will fire still respond to those calls.'",
        "'speaker_6': 'And then is there an if is there an interaction in the field with the REACH teams or how do you see that actually working out there?'",
        "'speaker_7': 'So when the calls come in, if it is an emergency fire, we're always respond first. I mean that. So if if if it's a health emergency and is deemed a health emergency at the at the nine moment call center.'",
        "'speaker_7': 'Other than that, the the REACH team will be available wandering pro-active outreach in communities and encampments and others in addressing physical and mental health needs while they're there, as well as being responsive. So if someone calls the AMC and requests support or calls 911, it's not deemed an emergency.'",
        "'speaker_7': 'Then the Multi-Service Center, the REACH team would also go out. So it is a partnership. There are will be handoffs in different ways. So it might be that police or fire response first says, you know, this is not it's not an emergency, it's not critical.'",
        "'speaker_7': 'They'll hand them off to the REACH team to do further case management and other supports to try and eliminate the need to call nine on one in the future. Or it may be that we go out and we determine that the REACH team needs additional supports and may call on fire or police to support in those situations'",
        "'speaker_7': '. So it's an ongoing partnership for sure through that process and the REACH team is available every day, at least during the weekdays until and we have additional resources will be on the weekends to be able to support the mental health and substance or side mental health and physical health needs of people.'",
        "'speaker_6': 'And the the REACH team itself with a county clinician is that from the unit model, same type of personnel working?'",
        "'speaker_7': 'It's not a county clinician, it's someone that we have hired with. So this person works directly for us and it's not through the county departments. So we've hired specifically to two nurses and two public health nurses and two mental health clinicians that are hired directly through the city.'",
        "'speaker_6': 'Okay. So you would have the same possible issue in the field if the Met unit is responding and and there could be a handoff from the Met Unit two to reach.'",
        "'speaker_7': 'Sure there could be. Yes.'",
        "'speaker_6': 'Okay. And just I see the fire chief there. Do we have any moneys, any funding coming in to address all of the fires that are happening in the areas of these encampments? Thank you, Councilman, at this moment. No, there is no additional funding specifically for the fires that we are that we are combating in the vegetation and'",
        "'speaker_6': 'all the other areas. We are realizing a great increase in fees as far as our firefighting.'",
        "'speaker_4': 'Foam.'",
        "'speaker_6': 'And some of the other issues that we have to contend with. Okay. Thank you. That's all I have.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_3': 'Thank you so much for that comprehensive presentation and just all that you and your team does and the community. I know you've been out there in my district and I just feel like thank you isn't enough. But we sure appreciate it.'",
        "'speaker_3': 'We know that the programs that you are doing touches every aspect of lives, and I know for sure that we are a better city because of all your work. So thank you. I also wanted to say that I know the housing and employment opportunities are critically important to the community and we need to make sure that we'",
        "'speaker_3': 'are redoubling our efforts on supporting employment and those experiencing homelessness. And we need to get roofs over their heads. So they can pursue employment. I've said this before and I'll keep saying this, but, you know, childcare is absolutely imperative and important.'",
        "'speaker_3': 'This pandemic has a lot of people back and we need to help kids and we need to get their parents back to work. You know, I have a lot of people, especially those businesses that can't find employees, but it's really hard when when folks don't have good childcare.'",
        "'speaker_3': 'I know that we've had several questions regarding regarding the the REACH team. And so I'm just trying to just one further question, like what is the difference between the REACH team and the Heart team?'",
        "'speaker_7': 'And I can have as the fire chief to speak a little bit more about some of the specifics of the Hurt Team. The Hurt Team, they were available to respond. So if a call came in through 911, they may be dispatched to be able to respond to issues or medical related issues among the homeless population.'",
        "'speaker_7': 'And I think that their paramedics.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_6': 'Yeah, there. Yeah. So the if I can jump in here for just a sec. So the heart team, specifically the mission of the Heart team was to enable the rest of our resources to be freed up. So the heart team would monitor dispatch and then go out on these calls, on typical calls that they thought might be'",
        "'speaker_6': 'dealing with the homeless or something that they could handle on their own, and they could upgrade or downgrade as they saw fit. And that would take calls off from our other apparatus, the engines and the rescues that would free them up for additional calls, heart attacks, difficulty breathing, stuff like that.'",
        "'speaker_6': 'So that was the the intent of the heart team primarily.'",
        "'speaker_7': 'And then the reached him includes a mental health response as well. So it's it's not specific to the same level from dispatch as fire and the integration of the fire response. But the REACH team includes a public health nurse who has a lot of case management and other sorts of opportunities and engagement to be able to connect'",
        "'speaker_7': 'people to services. And then our mental health clinician that will be onsite as well to be able to sort of maybe de-escalate certain situations, really try to understand where the what the different issues are, and to be able to connect people also to mental health and supports.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_6': 'I might add, Councilwoman Ellen, some of some of the additional things that the Hart team is doing currently. So Councilman Supernanny brought up the all of the vegetation fires that we have. So we are currently using them to heat map the city, find where various encampments are ingress and egress for our fighting firefighting forces.'",
        "'speaker_6': 'They also, once we get rain, if we do get rain, they patrol the riverbanks, start to clear people out so that they're not in harm's way. So they're utility players for us, for the fire department.'",
        "'speaker_3': 'All right. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman.'",
        "'speaker_2': 'Sun ink you. Thank you for this great and very, very informative presentation. I think our city is doing a lot of good work and to provide a large amount of support to our homeless and homeless crisis that we're in and that we're living in today.'",
        "'speaker_2': 'One of my concerns often is that we as a city, I think, fall short of ensuring that our residents receive all of the information and direct connections to all of the resources and projects that we have. Can you can I have staff explain maybe a little bit more on the outreach efforts with this initiative and how to'",
        "'speaker_2': 'ensure what you're doing to ensure that this information is dispersed both in Spanish, English and any other language that may be needed out there.'",
        "'speaker_4': 'So we do work to make sure that our information is translated within on the website so that you're able to access it in multiple languages. We do provide translation services on site for anybody that is in need of translation.'",
        "'speaker_4': 'We have a number of staff that speak Spanish that that speaks command. But if somebody was in need of translation for another language, we do have access to supports for that as well as people that may need sign language.'",
        "'speaker_4': 'So that is something that we continue to make sure is available and that we're utilizing when when needed. As far as communicating out and being able to reach people, I think really in the slide we talked about Unite US, that's an online platform that's really focused on it's basically like a yelp for for support of services.'",
        "'speaker_4': 'So we're partnering with them and making sure that people know how to connect in with the agencies that are providing services and can even coordinate referrals to the best service provider to meet that need through an online platform.'",
        "'speaker_4': 'So that will be launching shortly. And then we have a number of efforts to increase our outreach, the incorporation of the mobile MFC clinic. So making sure that we're reaching throughout the community, that we're in the community and finding people where they're at and engaging them through a number of different ways.'",
        "'speaker_2': 'Thank you. Thank you for that. Also, one more question. I know that we've been referring a lot to the REACH team, which is, you know, great. And one of the questions that I had and you kind of touched upon it a little bit earlier, but who takes on those calls?'",
        "'speaker_2': 'Maybe you can clarify that a little bit for me. I know that in the past, from what I remember, please correct me if I'm wrong, but I do remember that with there were there was a dispatcher that was hired and to take those those calls from the community instead of calling the 911 number to be able to'",
        "'speaker_2': 'free up that number for other emergency. So maybe you can touch a little bit upon that, please.'",
        "'speaker_4': 'So we've had an outreach hotline for quite some time. It has not been staff just to do capacity. So this will be the first time where we have a staff that is answering that live and being able to coordinate with the caller who's asking for a response.'",
        "'speaker_4': 'So right now, if somebody were to call that hotline, there's a message system. We check that multiple times a day that the caller asks us for a call back to let them know the outcome, which is basically that we went out and we were able to engage.'",
        "'speaker_4': 'We will return the call. We do work to process those. Typically, we get every call within 24 hours and being able to go out. Sometimes it does take 48 hours just depending on the requests that are coming in.'",
        "'speaker_4': 'So this will be the first time that that's being answered. We also have an email where a number of people also submit requests through email. So we try to get as many requests as we can through the communities as we want to get out and engage as many people as we can.'",
        "'speaker_7': 'But remember, I think the the the model that you're referring to is we did pilot where we had a person from the multi-service center sitting in 911 dispatch where the nine one dispatcher could transfer calls to that person to have a discussion.'",
        "'speaker_7': 'But it didn't it wasn't a space where we would had someone to send out. It was more someone to answer questions and engage with those people who are calling. In this case, if someone calls 911, they will transfer.'",
        "'speaker_7': 'If it's the appropriate call, they will transfer it to the NSC and we'll take those calls.'",
        "'speaker_2': 'Thank you. I know my time's up, but thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_4': 'Thank you. And I want to thank you for the very thorough report. I think there was maybe, oh, 45 slides on that. A lot of good information. And I think it speaks to. Burn Long Beach in our city actually you know investing in and having a plan that everyone home task force was put together.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And all of those who served on that that task force gave us some guidelines and framework and goals to to achieve. I think in many respects we have we're definitely on the right track, especially when you think about just the shelter beds and transitional housing opportunities that have been created in the last just'",
        "'speaker_4': 'a couple of years. Uh, I want to say that I think. That when it comes to this issue of dealing with homelessness and the unhoused, we need to maintain and continue to be flexible and adaptable with our programing and governance over this issue, because the resources are not unlimited, they're not abundant, and we don't have many opportunities'",
        "'speaker_4': 'to get it right. Right. And so I want to caution us from, you know, creating a program and being married to that being the only solution to to fixing this issue. We need to be continue to be adaptable, because I can assure you that the challenge that we face, those who are on house are not, you know'",
        "'speaker_4': ', in a square box. We're going to have to move to be able to move it around. And oftentimes, I think I've been on this council long enough to see us create initiatives before we even had the opportunity to assess to determine whether that initiative is working.'",
        "'speaker_4': 'We've created a new one and a new one, and we started layering on top of initiatives. And so I want to be mindful that, you know, that's something that I've been paying attention to watching. I think so. In some respects, we need to.'",
        "'speaker_4': 'Take a step back in and allow the good work that this council, this community has supported to actually manifest and then determine whether or not we need to do something extra. I just wanted to add add those comments.'",
        "'speaker_4': 'Again, I do appreciate this report and look forward to the implementation.'",
        "'speaker_9': 'They did have one question.'",
        "'speaker_4': 'Related to goal number four, employing people. There is a. Initiative in progress to hire a reentry coordinator. Can you explain a little bit about what that individual will be doing? The the target population, the goals set forth, particularly for that position, because I think that reentry is is an area of focus that we need to take to'",
        "'speaker_4': 'actually put as a priority and to just look at the data coming from L.A. County and CCR. We have a lot of folks that are reentering our community who will need these services.'",
        "'speaker_7': 'So the entry, the reentry coordinator is actually being funded to the racial equity and reconciliation funding. It's part of that process within the violence prevention area at the health department. And so the goal and the long term goal is to establish a sort of a11 stop shop for people who are reentering from incarcerated settings to support employment'",
        "'speaker_7': ', housing and many other things. Those resources have not yet been identified to go that far. So at this point, it's really it's an individual who will be working closely with nonprofit organizations and others to start to build a more coordinated capacity to be able to serve people as they're exiting incarcerated settings.'",
        "'speaker_4': 'I think you'll all be watching that process very carefully, because I think it's very important that we like I said, we get it right. We don't have very many options and opportunities like we have right now. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Sorrell.'",
        "'speaker_2': 'Thank you, Mayor. Thank you, Ms.. Collopy and Mr. R.S. for the presentation. And can you you know, I've heard this answered several times, but if you can answer it again, how many times is outreach? Does outreach get done to an individual before services is accepted?'",
        "'speaker_4': 'So this was and this is something that gets thrown around. And I don't know that it's the most impactful answer truthfully. And, you know, it varies. 15 to 20 is what people say. However, that's kind of an averaging.'",
        "'speaker_4': 'So what we find is people either are willing to engage right away or it takes a whole lot of times more like 30, 40 times that somebody is very hesitant for a number of reasons. We are working with people with a significant amount of trauma, a lot of disappointment within our social services as a whole throughout their'",
        "'speaker_4': 'life. So there's a number of different reasons why somebody might be hesitant to engage with us. So I think as Councilmember Austin kind of said, we need to look at various different approaches, not being married to any one particular approach, but that people have a wide range of different experiences and backgrounds.'",
        "'speaker_4': 'So creating programs that engage people in different ways and really making sure that each program really takes a trauma informed friends to recognize people's histories, what they've gone through and really recognizing. And allowing that person to express from that viewpoint and not be reactive to it.'",
        "'speaker_2': 'And that's why I really appreciate this Slide 34, where the goal is to develop population based service model. And I had hoped that maybe there would be a little bit more. But I do think that it does it really gets down to kind of what you're speaking about, ensuring that it's really addressing their individual experience and also'",
        "'speaker_2': 'situation that range is not, you know, from older adults to transition you to LGBT, LGBTQ reentry, single parents, veterans, etc.. Right. I really love to see more of it being kind of flushed out. The other two is just with what you just shared in.'",
        "'speaker_2': 'I know the team does so much work, you know, the city staff do so much work. So at the end of the day, how do we communicate to everyday people, residents, businesses that walk down our street or drive down our street, see people living on the street, or at least people who are unhappy?'",
        "'speaker_2': 'And how's that? You know that what we're doing is working. How do we communicate that to to to our residents? Right. That is probably not reading this report or reading the numbers or understanding the statistics. How do we how is that communicated that what we're doing is working as councilmember?'",
        "'speaker_7': 'So that is one area that when you are in direct service models, we often don't have the time and the capacity to do the level of communication that you're talking about. And we fully understand the importance of that.'",
        "'speaker_7': 'And happy to say that the health department now has a peer. But Arpaio has been heavily involved in COVID response rate and has not been able to create as much of the other kinds of conversations. We've had multiple conversations about sort of campaigns, right, about sharing about all the work that we're doing and others, but that has'",
        "'speaker_7': 'been put on the back burner in the last year. That is something we will be focusing on moving forward.'",
        "'speaker_2': 'Though I hope we do prioritize that because I think that it's really important that we share the different various work and because there's so much money also invested in this that it's so important we communicate all of the various approaches that has to be taken and needs to be taken.'",
        "'speaker_2': 'No further comment or question. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Thank you. So when we move from the Hart team to the Reach team, how will we have a consistency of data reporting? So currently, earlier this evening, the fire department replaced their data system, but that's a data system that the Health Department doesn't have access to.'",
        "'speaker_2': 'Or are we going to give them access? How do we track these? Calls and contacts longitudinally when we're changing our methodology. Perhaps you guys can work on that and give you.'",
        "'speaker_4': 'A capsule on Mongo?'",
        "'speaker_6': 'Yeah. We haven't been asked for that data as of yet, but we are looking forward to sharing that data. We would like to see also if it's working and if it's not working, how we can get it to work better.'",
        "'speaker_2': 'That would be great. And then I really appreciate the discussion around funding from the measure H For all the different components of our city that have had increased costs, including, you noted, 200% increase in fires. I know L.A. City had a and a news show and I think they talked about a 600%.'",
        "'speaker_2': 'I don't know if that was on Channel seven. And I think that perhaps there's an appropriate opportunity for some discussions among the fire chiefs to really come together and discuss the environmental and regional impacts. And then I know that Supervisor Barger had an agenda item related to clear out on county property that would not take the standard'",
        "'speaker_2': '14 to 21 days when a brush fire risk is adjacent. And I don't know that we're really using that. I know I've talked with a few of my council colleagues about some of the issues we have related to the Nature Center.'",
        "'speaker_2': 'We've worked with P.D., but those fires are still happening on a regular basis underneath those trees, and we've already had multiple fires. So being able to reimburse some foam from the funding, I think is a reasonable request. And I think if we went in with a three or four agency approach, we might be successful.'",
        "'speaker_2': 'So I, I look forward to hearing what that might look like and then also having a better system in place for identifying those risks more quickly and making sure that we don't have as many of those fires because of the a dual impacts.'",
        "'speaker_2': 'There's also a lot of risk to the individuals that are homeless when a fire breaks out. So let's get that process memorialized. Thank you.'",
        "'speaker_6': 'Yeah, I totally agree with you. And in fact, we have the public safety committee meeting coming up at the end of the month, and that is the topic that we're going to be addressing from the fire department, because regionally, the fires have been growing exponentially.'",
        "'speaker_6': 'And we've spoken to some of the council members about all of these vegetation fires and how they're impacting.'",
        "'speaker_4': 'Us, our.'",
        "'speaker_6': 'Run load, our resources and all the rest of that. So we do have our support services staff looking at ways to get reimbursement for that. And once we do, I'll get back to you that information.'",
        "'speaker_2': 'And I appreciate that. And I know that when the funding first became available, there was an effort at that time and it just we didn't have the volume that we have today. And I think a new day is here and we can make a new effort.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Ringo.'",
        "'speaker_4': 'Thank you. I also want to add my voice to the accomplishment of putting this report together very thoroughly. Very informative. A lot of information here that I'm going to have to dove a little deeper into with the author.'",
        "'speaker_4': 'But there's two things that stand out to me in terms of some of your goals here. Employ people and connect to health. I mean, those are important things that are always here when I'm out there in terms of why are these so many people homeless, what's going on, why they need a job?'",
        "'speaker_4': 'And some of those people also have some kind of mental health issues, whether it's substance abuse or or just some other kind of a diagnosis that they might have in terms of of their mental health. So one thing that came out to here that I that I saw here and it's like 27, was that there's a homeless'",
        "'speaker_4': 'court pilot. With the city prosecutor's office. What is that? Could you describe it for a little bit to what it is? Sure. We received a some funding through the D.A. Hahn's office, Supervisor Hines office through the L.A.. Community Development Agency.'",
        "'speaker_4': 'So that funding comes to the health department and we are partnering with the city prosecutor's office. So we have a judge who joins us by video conferencing and people can request to have their misdemeanor heard within that court.'",
        "'speaker_4': 'And basically, the focus is on really making sure that people are getting connected and to services and resolving issues that related to that legal issue that they're now facing. So that's the main focus. However, we partner with other aspects of the Los Angeles criminal justice system, including the.'",
        "'speaker_4': 'The county public defender has a program to focus on expungements. They come out to the homeless court as well. So we have met with over ten people that are focusing on expunging past convictions that way, when they're going to get employment, when they're working on housing, that that's not showing up on their background check and potentially affecting'",
        "'speaker_4': 'their ability to access either of those. We also are able to clear warrants for a no show and re-issue that for a future court date which might be at homeless court. We also have a number liccardo to show up to provide additional case management as well as we have are a partnership with the county to have a'",
        "'speaker_4': 'probation officer at the multi-service center 20 hours a week. So people that are also on probation that may have a probation issue, they're able to check in at the multi-service center as well. So all of those are offered at our homeless court, which occurs on the third Wednesday of each month.'",
        "'speaker_4': 'So we have done two so far. This month will be our third. How do they get that information? Is it. Because of some kind of contact that you probably had with one of the homeless person who says, I can't get a job because I have a record.'",
        "'speaker_4': 'Is that is that when you direct them towards the court? Yeah. So it comes up in our conversations. We have also there's been several press stories and presentations regarding this. So as we're out on outreach, engaging people around their legal needs, if people want to sign up for homeless court, there is a way to go on to'",
        "'speaker_4': 'the city prosecutor site and sign up to have your case heard the process and then assigned to that court. The other part about collecting to help you have here that there's an ongoing partnership and advocacy with the L.A. County Department of Mental Health to get some more on substance abuse facilities in Long Beach.'",
        "'speaker_6': 'What requirements do.'",
        "'speaker_4': 'You need to have to open up a mental health facility here in Long Beach? I know we have one. It's in my district. I support it because I think it's important. But is there another is there another effort to open up another one?'",
        "'speaker_4': 'And what is the requirements, if any, to open up a mental health facility here?'",
        "'speaker_7': 'Councilmember There are two. The requirements are different for mental health and for substance use. So they're run by to the department. The L.A. County Department of Mental Health is a full department with a focus area, and then the substance abuse area actually lands within the public health department within within L.A. County.'",
        "'speaker_7': 'They are you know, they focus primarily on the Medicaid and unfunded population. And those are three with high level needs in terms of the substance use providers. They have to go through a licensing process at the state level, which is not easy.'",
        "'speaker_7': 'But we're hearing it's quite, quite complicated. The county does work with organizations who are interested to to work them through that process and provide them some guidelines. I don't know what the requirements are for the mental health side.'",
        "'speaker_7': 'We have the Behavioral Health Urgent Care Clinic, which is in it, which is in your district. And then but there are many other mental health providers. One Damage has a site that's near the health department that's a direct service provider, but they also fund many other nonprofits within the city of Long Beach around mental health services.'",
        "'speaker_7': 'So it's a real mix. And then so like the MHRA, you know, Mental Health America and others all have contracts with with the image to be able to provide those services.'",
        "'speaker_0': 'Thinking the time is up and we'll move on to the next member. If you want to queue up again. Councilmember. If if you need to be. Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. This is a big, big issue. And, you know, I had a lot to say and I was looking at that five minute clock. But I want to go back and lift up, you know, one or two points that I really want to talk about.'",
        "'speaker_4': 'First of all, I'm glad to hear the health department has a PIO. It's pretty important at this moment that we're able to communicate out to the public during a pandemic. It's great to have a public health department. A lot of folks, a lot of cities don't have it.'",
        "'speaker_4': 'Now they're looking at Long Beach to say, what do we need to do to do it? One thing I mentioned earlier is having our own like contracting in mental health services from the county. I want to go back to that.'",
        "'speaker_4': 'You know, I saw a presentation recently about the Trinity Mental Health Partnership. It's a three city JPA between Pomona, Laverne and Claremont. And for the purposes of this JPA, they're they're independent. They for the purposes of mental health funding from the state and for reimbursements from Medicare and Medicaid.'",
        "'speaker_4': 'And the way that the reason I think that's interesting is that we've seen the fact that we have our own health department and our own continuum of care. We've been able to amplify the amount of resources that we bring here to Long Beach for public health and for homelessness.'",
        "'speaker_4': 'And I think with the issues related to mental health in our communities, I think we have to explore what happens if we're fully in charge, not necessarily getting approvals from the county to be innovative or to invest more in mental health.'",
        "'speaker_4': 'And so I want to drive that home. I want to I would love to explore, you know, because you've done a great job here at everyone home with over at home report. We certainly need to look at. You know, moving past the partnerships we have in establishing our own independent mental health bureau or mental health department within'",
        "'speaker_4': 'our health department. What are your initial thoughts on this, on this idea?'",
        "'speaker_7': 'I think it's certainly something that we're, you know, willing to to investigate. And along the way, we have had multiple conversations with the AMA and the funding makes sense to be to be carved out. So there's only one other one city jurisdiction on their own that receives mental health funding at Berkley.'",
        "'speaker_7': 'They did started a long time ago and they got their carve out of the all the state mental health funding. So I don't know what that approach looks like at the state level to be able to carve that out outside of the out of the L.A. County piece.'",
        "'speaker_7': 'But it's something that we could look at what those steps would be, and then we can report back.'",
        "'speaker_4': 'Okay. Yeah, I would love to. I would love to see that, particularly because we have such a great track record and one of only three cities in the whole state with a health department. I think we have a good story to tell on.'",
        "'speaker_4': 'As in, we should be thinking about being more entrepreneurial about how we can handle it. If we give us the funding, it probably gets directly to the street faster. And we can we can locally control our own outreach around mental health.'",
        "'speaker_4': 'I think that's that's an idea that certainly demands some research. So so thank you so much. The last thing that I kind of glossed over before it's an idea that's come up time and time again is we do a lot of housing in the city and it's spread across two departments.'",
        "'speaker_4': 'Where are we with the conversation about unifying and having one housing department where there's one shared vision between the production of housing and the servicing servicing of and the education around housing units? Is there an update on the feasibility of that?'",
        "'speaker_4': 'Mr. Modica. It's an idea that we've talked about a little bit. I think that would come with some significant resources. So we kind of consider that if there was going to be a large investment maybe by property owners or by the state or by others, where we really can can create a department.'",
        "'speaker_4': 'Departments are are wonderful and they really provide a service, but they require a lot of backbone infrastructure to do that. So that is something that if we were to get a large revenue source, we could certainly consider. Thank you.'",
        "'speaker_0': 'Is that our vice mayor? Yes, councilman, sir?'",
        "'speaker_2': 'Yes. I just have one more question. I was wondering, is copy if you can give an example of a call that 901 receives that would go straight to the REACH team. An example of a call that would go straight to fire instead.'",
        "'speaker_2': 'So that would go to fire instead of the REACH team.'",
        "'speaker_4': 'I can't remember what the exact designation happened and it's like six or seven or something like that. But it's, it's, it's termed in a way that probably is a little misleading. So I'm more just describe it. So somebody calls in and says, Somebody in my neighborhood is experiencing homelessness, and I'm concerned about that.'",
        "'speaker_4': 'They'll ask a number of questions to make sure that there's no concern of, you know, safety or any illegal, illegal activity occurring like that. Somebody says this person looks suspicious. They'll ask a number of questions that they kind of dig down of what does that mean and suggest that you're concerned that this person is in your neighborhood'",
        "'speaker_4': '. So no major concerns are identified. Those would be calls that normally would have been transferred to PD, will now be referred over to the REACH team and then on fire.'",
        "'speaker_6': 'And so there's a complete matrix that the dispatchers go through. And so if they determine in any way, shape or form that it's medical in nature, then it will come to the fire department and we'll go out and evaluate the patient first.'",
        "'speaker_6': 'It becomes problematic when some of the callers are unable or unwilling to approach the patients, because at that point we can't really determine are they having a medical emergency or not. And so more often than not, the fire department is going to be rolling out on that that type of response.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'And Americans, I would want to point out that heart and reach are very different. They're not a replacement. We're not replacing heart with reach. We're looking at a different service model. The heart model is really a medical response model was an innovation that we didn't have at the time.'",
        "'speaker_4': 'And it was really designed to help lighten the load with our firefighters who were responding to these calls because there wasn't anyone else to go to those. As we look towards reach one with a budget reduction, but also it was to look at more of a case management model, and that really is the REACH model.'",
        "'speaker_4': 'It's an alternative to police. It's an alternative to fire. It's also a model where you have actual homeless outreach workers who can then do more of that kind of mobile connection to services, as well as mental health as well as nursing.'",
        "'speaker_4': 'So they are very different. We're not looking at just taking, you know, firefighters and replacing them with with nursing staff or health staff. It is a different model that we're looking to take that next level of innovation.'",
        "'speaker_0': 'Thank you. Councilman. Sir, anything.'",
        "'speaker_4': 'Else?'",
        "'speaker_2': 'No further questions. Thank you. That was the only one.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I was wondering what the status of the bed fap item that I brought to council a couple of years ago.'",
        "'speaker_7': 'Councilmember. We started that process through the search process, as you remember. And through that process, what we found out was that the providers were not interested in participating. So a real time build up requires that the providers enter the information and engage with the app and the business.'",
        "'speaker_7': 'There was not a lot of interest. The team did reach out to a number of different providers and to others. So that was a key piece around the mental health and substance use space. We do have more in insight around sheltering and the folks that the areas that we are funding through our other service provision model.'",
        "'speaker_7': 'So we have been looking more at stronger technology to connect people to services, unite us into other things. But the better conversation, there was not really any incentive because we don't fund the mental health and substance use providers and others to engage in that app with us.'",
        "'speaker_7': 'And so that piece of it has has not moved forward.'",
        "'speaker_2': 'So is that the difference between Long Beach and other cities that are using the real app, that other cities are directly funding into the providers and we're not?'",
        "'speaker_7': 'I think that there are they may just have other providers in that space that they've been able to connect with or engage with, or they may be funding them to engage in those services moving forward. We did the initial outreach and there just wasn't an interest in Long Beach.'",
        "'speaker_7': 'We continue to watch and to pay attention and to look at to look at other options, to be able to connect people to services. We have very tight relationships with with all of those providers in the city of Long Beach.'",
        "'speaker_7': 'And so through the case management and outreach and other connections, we do everything we can to connect them as quickly as possible.'",
        "'speaker_2': 'Okay. And then in terms of the number of beds that we have available, do we have beds available on a daily basis if somebody wanted shelter?'",
        "'speaker_4': 'It varies from day to day. We have a number of pets within Long Beach that have very specific criteria. So a lot of the times those beds are available, however, and months or a veteran, unless you're experiencing or fleeing from domestic violence, those beds may not be available if you do not meet those care characteristics.'",
        "'speaker_4': 'As far as our beds that are more general as an access, it does vary. There are some days where we have a number of beds due to somebody leaving the shelter, moving into housing. There are other days where we might have no women's beds, we may have no men's beds.'",
        "'speaker_4': 'It just varies from time to time as we're coming along, people that are vulnerable and are looking for a bed. If we don't have one available that night, we have been utilizing our motel vouchers to continue to engage that person and work towards with them until a bed does become available.'",
        "'speaker_4': 'So we do our best when people are looking for a bed to get them into a place immediately while we navigate towards an open bed.'",
        "'speaker_2': 'And so how are we how are our first responders who are tasked with enforcement able to determine whether or not there is availability or shelter space before? Choosing an enforcement action pursuant to Boise and Judge Judge Carter directives and best practices that we have seen.'",
        "'speaker_4': 'That's somewhat of a difficult conversation. I think it's much easier to do in the daytime. It becomes much more difficult in the evening time as our system just is not currently funded to operate 24 seven. So just depending on time of the day, it can be really difficult to determine when a bed bed is available.'",
        "'speaker_4': 'We have a number of beds within our winter shelter program that are set aside for PD as well as we do engage in as somebody reaches out from enforcement or other community services looking for a bed for somebody at an off hours, we will typically work and try to coordinate, but it can be difficult outside of our'",
        "'speaker_4': 'working hours. And I do want to point out for the record that our homeless shelters are not full and we track that every single day. We're we're getting closer now. But throughout the pandemic, we've been at 60%. We have availability for motel vouchers.'",
        "'speaker_4': 'So when we are taking enforcement actions, we absolutely do have shelter beds available in our community. You know, the data we do wish sometimes we'd like to know exactly how many, but we definitely have them available when we take enforcement action.'",
        "'speaker_2': 'And that's thank you for clarifying that. I think that's really important because a lot of times the enforcement action is going to take place after hours because the law violation oftentimes is tied to it the hour of the day.'",
        "'speaker_2': 'So if they're at a particular public park or the public beach that's closed at a certain time, the enforcement action would be based on the municipal code, which would necessitate it being after hours. So as long as I think our officers have that information of what resources they have available to them so that we can make sure'",
        "'speaker_2': 'that we're compliant, I think that's fantastic. Thank you.'",
        "'speaker_0': 'Thank you. Let me just have a couple a couple of questions. Also, I think the comments have been really, really great. And I want to just start by thanking our health team. I think it's been obviously a great job.'",
        "'speaker_0': 'I know it's not just the health department, but it's all departments in the city are involved in the work of ensuring that we get as many people into housing as possible and really focus on ensuring that unhoused folks have all the resources they need.'",
        "'speaker_0': 'It is obviously a even more difficult situation that we're in because of the pandemic. And I was just wanted to ask and also just uplift a few items in the report. One is, I think that having this update was great to kind of go through and see.'",
        "'speaker_0': 'I know I've had a chance to see the update and I want to make sure that for a project and task force of this significance that went that we have updates around this issue, you know, as often as possible, whether it's every year, whether it's every other year.'",
        "'speaker_0': 'We need a check in. At least the council needs to on this particular report. My other suggestion is the the task force was made up of so many folks from across the community that I think would also be great.'",
        "'speaker_0': 'At some point, I know we have some restrictions because of the pandemic. But to bring that group together, whether it's virtually or whether it's at some point in person, and to have just to give them a direct update, but also get additional feedback as to how they think we are doing and the progress that we're making in'",
        "'speaker_0': 'the within this within this report. I want to just uplift, I think. Corby, I think you and the team have done and other members of the department have done a great job, particularly on Project Homekey. I think it's been a huge success not just to see our our project, but the county partnership projects also have been phenomenal'",
        "'speaker_0': 'and I've said I support more project homekey projects in development. I hope that we're able with this money coming down the pipeline right now from the state and the federal government, we need to add and purchase more hotels or motels and convert them to housing for people that are unhoused.'",
        "'speaker_0': 'And I think that that is something that is, in my opinion, the the biggest bang for our buck is to get a hold of these motels and hotels and convert them into housing. And so I'm really hoping that we're really putting our best foot forward.'",
        "'speaker_0': 'I know we have a list of maybe three or four other acquisitions that we would like, and I'm just very supportive of this and hope that we continue to to push on these on these new housing opportunities. Let me also just say that.'",
        "'speaker_0': 'The one. Well, there's a lot of success in the report and a lot of success in the progress where I think we we just have to do better. I know it's not for lack of trying, but I can't express how important it is to have detox and sobering centers available in our community.'",
        "'speaker_0': 'And I understand that sometimes it's a difficult conversation for some neighborhoods or some for. I've talked to community members who don't like the idea, and I unfortunately just disagree with that. And I can't tell you that. Giving. Having a safe space for people that are suffering, that are sick and that need help within our community is incredibly'",
        "'speaker_0': 'important. We are also also just it's a plain resource issue when we have paramedics or. Or folks for it from our city, having to take folks to a sobering center or a detox center that is in downtown Los Angeles.'",
        "'speaker_0': 'The amount of time that that takes. It is costing us valuable resources versus being able to take someone to a sobering center or detox bed within our within our city. And so I just want to know that we are kind of all hands on deck on on this issue and that we are working with our partners in'",
        "'speaker_0': 'the health care space to add to identify these detox beds and sobering centers. And and that we are a part of that acquisition. Is there. Is there any progress we are making here or anything that we can assist with in this area?'",
        "'speaker_7': 'I think that the easier of the two would be the sobering center. So it has far less restrictions, different funding mechanisms than others. And that is certainly something that we could be looking into more immediately in terms in terms of access, we have been looking at a number of different locations just for various service models, and that'",
        "'speaker_7': 'would be something to look at. Medical detox is a very is a much different conversation in terms of how it's funded, how it's funded through Medi-Cal, the systems that L.A. County has in place to find those systems, they're expensive.'",
        "'speaker_7': 'There are only three in all of L.A. County, and they're very, very difficult to access. So that is something that we've had multiple conversations but made no progress. They just basically have said about the funding doesn't work that way and that no one is interested in providing that.'",
        "'speaker_7': 'So I think the first place would be the sobering center. And then we continue to push on a detox conversation.'",
        "'speaker_0': 'Well, think I think we should look at look to our our all of our our hospital partners as well across the city or medical center partners, I think. Ms.. If you're looking at, what is it, 12 beds on the for the for the sobering center, is that right?'",
        "'speaker_7': 'It's the original conversations were told that, yes.'",
        "'speaker_0': 'I mean, even to start, it would be, you know, and so I just am hoping that we that we continue to push on that. So thank you for for for that. And then finally, I do hope at some point we can address the issue of services or access for, you know, 24, seven for people that need assistance'",
        "'speaker_0': 'and support. I know that we there are some challenges there, but folks that are that are expressing homelessness should be able to access the multi-service center. Every day of the week and past what are considered regular business hours.'",
        "'speaker_0': 'I know that is hard to do, but I just hope that we continue to push and that we open the services up and meet folks when they need the support. Not necessarily when our traditional work hours are. And so those are just things that I want to uplift.'",
        "'speaker_0': 'But overall, quite frankly, you guys are doing an incredible job. The whole team at the health department. Thank you for for this report and this work. We look forward to meeting all those other obstacles and challenges. Councilman Mongo.'",
        "'speaker_2': 'Thank you. The mayor brings up some excellent points. I know that alternate destinations have not been a popular thing at the state level. If we wanted to transport to a detox bed, that's. Is it my understanding that that's currently not an available option for our fire department?'",
        "'speaker_6': 'That's correct. That's not currently available to us. There have been pilot programs throughout the region.'",
        "'speaker_4': 'I don't know that there are any pilot programs going on at this point in time.'",
        "'speaker_2': 'So the County of Los Angeles currently has a pilot program. It started during COVID and on every EP, C.R., they have a tool where they can push a button and get a assessment from a medical doctor, whether it is either the medical director of the department, one of the two assistant doctors, or a physician's assistant that makes'",
        "'speaker_2': 'that assessment and then determines that that transport would be allowed. And so it may be something we want to explore. It wasn't an expensive system, and they pay by the minute. So you don't have to load up a bunch of cash to do it.'",
        "'speaker_2': 'Their foundation actually fronted the money to start the program, and during COVID, when they were trying to not transport to hospitals, it was tremendously a tremendous resource to be able to go to urgent care or any of those other things, because while it is outside the scope of a paramedic, having the availability to do a virtual consult'",
        "'speaker_2': 'with a doctor became an amazing resource. I don't know if the funding would be available for this to do that, but great tool and potentially mental health services or the County.'",
        "'speaker_3': 'Quality or.'",
        "'speaker_2': 'Productivity Commission would be interested in funding it, and I'd be happy to help.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_6': 'Definitely something we're going to look and do. I'll get together with our medical director and we'll get through that. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. There's a motion and a second. I don't believe there is public comment on this item. There's a motion any second to receive in favor of the report. And please cast your votes.'",
        "'speaker_1': 'Motion carry.'"
    ],
    "Budget Hearing for Health and Human Services and Police Departments.": [
        "'speaker_0': 'Thank you very much. We're now moving to the budget hearing. Continuation, please.'",
        "'speaker_1': 'Budget Hearing Item nine report from Financial Management Recommendation to conduct a budget hearing to receive and discuss an overview of the proposed fiscal year 2022 Budget for the Department of Health and Human Services and Police CDI.'",
        "'speaker_0': 'Thank you. I'll turn this over to Mr. Modica. Now we're getting the presentation set up.'",
        "'speaker_4': 'Yes. Thank you, Mr. Mayor, and members of the council. This is our third budget presentation. And as we enter budget season, you're going to hear from two really important and big departments today. You're going to hear from Health and Human Services and you're going to hear from police.'",
        "'speaker_4': 'And the next week you're going to hear from, I believe, economic development fire and I believe civil service, or that might be the following week. But I wanted to make some entry comments about what you're going to hear tonight.'",
        "'speaker_4': 'So you're going to hear a lot of accomplishments, a lot of opportunities and challenges and a number of things that have happened. But I want to take us back about one year. Almost one year. Exactly. Tomorrow is the one year anniversary of the racial reconciliation plan.'",
        "'speaker_4': 'That was a monumental vote that we took as a as a body. And it was a culmination of a number of of outreach that we heard from a variety of different groups about the importance of looking at things a little differently.'",
        "'speaker_4': 'Here we are one year later and we heard a lot. For example, we heard we should have an alternative response program for homelessness and mental health. We just talked about the REACH program that's been implemented. We heard a lot about health equity.'",
        "'speaker_4': 'You're hear about us hiring a health equity manager and putting aside money towards health equity. We heard about alternate responses for incarceration of individuals and we you'll hear about our homeless court system and working with our prosecutor. We heard about the need for investing in youth.'",
        "'speaker_4': 'And you're going to hear about measure us funding in youth. We heard about mental alternative mental health response models, and that effort is underway and funded by the Recovery Act that this Council put funding towards. We heard about a reentry coordinator that was funded last year and is included.'",
        "'speaker_4': 'We heard for the need to invest in our health department. We have done 250 new positions in our health department that are supporting COVID response. We heard about the need for PD to interact in not just an enforcement setting, but interact with our community.'",
        "'speaker_4': 'And you'll hear about our PD Neighborhood Walk program. We heard about the need to look at things differently from a from a reform perspective, from a policy perspective. And you'll hear about the department's policy around Police Department's Office of Constitutional Policing, their collaboration with the Office of Equity.'",
        "'speaker_4': 'We also heard about the need for an early intervention program for PD, and that is being implemented through a program called IPRO. You'll hear about tonight. We also heard about diversity, mentoring and how important that was and diversity hiring in our police department.'",
        "'speaker_4': 'And there's new enhancements there. And then, of course, civilian position in positions in police department and looking at non sworn positions to do certain jobs. That is also included in our budget and that was implemented last year. I just wanted to kind of pull some of those major themes together.'",
        "'speaker_4': 'Those are things we heard from the Council on, things we specifically talked about a year ago, and a lot of progress has been made. And with that, I will turn it over to Kelly Collopy, our director of Health and Human Services.'",
        "'speaker_7': 'Good evening, honorable mayor and council members. You'll probably be tired of my voice by the end of this evening. Thank you for this opportunity to present the many Health Department FBI 21 accomplishments and FBI to you. Opportunities and challenges.'",
        "'speaker_7': 'The Health Department, the Health and Human Services Department launched a strategic plan earlier this year. Instead of providing a long list of the services we provide. I wanted to share these goals because all of our work aligns with moving these goals forward over the next five years.'",
        "'speaker_7': 'We seek to ensure people have the culturally competent health care and social supports they need to be healthy, that we have sufficient behavioral health services citywide to prevent and reduce mental illness, substance misuse and trauma that we prevent the spread of communicable diseases in Long Beach, and that people engage in healthy behaviors and have access to healthy'",
        "'speaker_7': 'food as well as safe and affordable opportunities for physical activity. We are also working to ensure permanent housing for people in Long Beach who are precariously housed or experiencing homelessness. That social and economic conditions are improved for people in Long Beach across their life spans.'",
        "'speaker_7': 'The preventable deaths and injuries are reduced, that communities are safe from violence, and that people live in safe environments and are prepared for emergencies. We know this is not possible without a department workforce that is strong, resilient and valued and a center of equity in trauma informed practices.'",
        "'speaker_7': 'If why 22 was even more busy than FBI 21, which is hard, is going to be even busier. And if I 21, which is hard to believe. The department puts forward important plans, technology and services while also distributing more than 10 million it CARES Act funding to support communities and responding to a massive COVID surge and vaccine'",
        "'speaker_7': 'implementation. And I think around us all, and the fact that we've been working through the largest public health crisis of our time and the pandemic, as well as the declaration of racism as a public health crisis. Through all of this, your Health and Human Services Department, in partnership with our sister departments and community members, have been required'",
        "'speaker_7': 'to take on many roles and accomplish so much. I'd like to focus first on the COVID response. We began this work with a team of ten people focused on public health, emergency management and communicable disease response. We hired and trained more than 250 employees in the response so far.'",
        "'speaker_7': 'That in itself was a huge lift. Reestablish nationally recognized testing and vaccine infrastructures, providing more than 4000 tests in one day during the height of the surge and 6000 vaccines in a day at the convention center. These efforts continue and expand and contract based on demand and COVID transmission to create the greatest access to vaccine.'",
        "'speaker_7': 'We launched the mobile vaccine teams, which have now done more than 450 community clinics. We just moved into an expanded permanent distribution site to ensure the city and region have access to PPE and medical countermeasures. Reestablish a beach research line and a COVID vaccine line.'",
        "'speaker_7': 'All in all, more than 30,000 calls have been answered and more than 60,000 emails. Environmental Health joined the Vendor Task Force and educated more than 22,000 businesses and responded to 600 complaints related to COVID and reestablished an internationally recognized vaccination program at the port were coming for incoming international cargo ships.'",
        "'speaker_7': 'This program is ongoing. In the past year, we have launched a number of initiatives and plans as well as a flavored tobacco ban. We launched an internal integrated system of care, which is a common intake and referral system to strengthen services for people engaging with the health department to ensure a single intake to any of our programs'",
        "'speaker_7': ', as well as connections to other services. We also launched the Unite US platform as a basis for referrals from the resource line to the community. Relaunch the Department Strategic Plan and the Strategic Plan for youth and emerging adults.'",
        "'speaker_7': 'And with that launched the Office of Youth Development and strengthened our violence prevention efforts. We also launched the Long Beach Advancing Peace Initiative, which envisions the city of Long Beach, where everyone lives in safe communities, attend safe schools and are contributing neighbors or contributor connecting to their community.'",
        "'speaker_7': 'They're working to develop and strengthen a community safety collaborative, a community led steering committee and neighborhood mobilization focused on neighborhood capacity, collaboration and alignment of resources and services. They're holding for block by block neighborhood parties. And the first in Washington neighborhood had more than 200 people from organizations and the community.'",
        "'speaker_7': 'And then earlier this year, we passed the tobacco to flavor tobacco ban, which is a strong stand. And I'm very proud of the city for moving that forward. Through all of this, we maintain an expanded many services across our department, including but certainly not limited to HIV infested testing and treatment risk and black infant health.'",
        "'speaker_7': 'Older adult supports health, education and environmental health inspections and approximately 30 other programs. The COVID pandemic certainly made meeting the needs of homeless people experiencing homelessness more difficult. We just had a long conversation about homelessness, and so I wanted to just to share with you that that has been a big accomplishment for the city.'",
        "'speaker_7': 'We've continued to see MSD operations and outreach with more than 7000 visits. We've already discussed the housing authority vouchers and the news and the new sites. We were able to permanently house 637 people even within the pandemic. And then supported housing for 6900 households through the Housing Choice voucher program.'",
        "'speaker_7': 'We've committed innovative models for homelessness as well, including the REACH program that we've just recently discussed. We're also partnering with UCLA to offer a mobile opioid treatment and HIV testing, testing and treatment in Long Beach hotspots to address the intersection of homelessness and housing, insecurity, energy, business, drug use and HIV and FTD infection.'",
        "'speaker_7': 'This is a very, very cool opportunity, and we're looking forward to increasing opportunity and cruising different locations with this model. And then as earlier discussed, we've launched the homeless drug court at the NSA in partnership with the city prosecutor.'",
        "'speaker_7': 'The CARES Act funding brought an incredible opportunity to support our communities most impacted by COVID. The department personnel had to be nimble and creative to find the best way to use these resources for maximum benefit. Through the Health Department portion of the funding, we fed thousands of people through meals and food distribution.'",
        "'speaker_7': 'Supported families with young children through developmental and physical activity kits, labor and formula supplies and subsidized care. We launched a mental health awareness campaign where you can see the posters all throughout Long Beach, and we provided approximately $1,000,000 of services to both our Latino and black communities for health, education and outreach.'",
        "'speaker_7': 'Mental health care care packages. Food distribution, and early childhood supplies. And we were able to provide services for more than 21,000 older adults through the resource line through distribution, transportation and care kits. We also fund a peer navigation for ages ten through 24, which focused on mentorship, peer to peer learning and connection to mental health services.'",
        "'speaker_7': 'Direct services to 484 domestic violence survivors. We remediated 65 properties for hazards that exacerbate COVID and provided operational supports for 102 local non-business nonprofits. That was a very busy six months. Our focus for Fy22 continues to remain on pandemic response as we work to increase the number of people who are vaccinated and to ensure safety for our'",
        "'speaker_7': 'city, particularly in the face of the Delta variant induced surge currently taking place. We're also focusing on strengthening our department staffing and administrative capacity technology and building infrastructure. Increase in funding. Staffing and programing in the past year has put serious pressure on all of our systems and we are working to ensure we can continue to prepare and'",
        "'speaker_7': 'respond to Long Beach Recovery Act brings significant opportunity to engage with our community and to expand opportunities for youth development, violence prevention, basic needs, housing, food security, mental health, early childhood and older adult services as well as people experiencing homelessness.'",
        "'speaker_7': 'Measure us also becomes available this year, providing approximately $900,000 for youth, including a youth fund to support community organizations. Structural funding to support an older adult coordinator and some grant writing and data support. Much needed a department that survives primarily off of grants.'",
        "'speaker_7': 'The various new funding opportunities also allow us to strengthen our health equity work, to work closely with our communities, to build health and wellness. We are hiring a health equity manager as well as a number of coordinators to work specifically with communities most impacted by COVID.'",
        "'speaker_7': 'As well as launching a Multicultural Health Council to bring communities together, develop integrated collective approaches to health and wellness. We know that the COVID 19 pandemic had the greatest impacts on our Latino and black populations in terms of cases, hospitalizations and deaths, as well as economic impacts.'",
        "'speaker_7': 'We will invest in the Vida Quinta Black Health Equity Collaborative Partners, as well as services and services, as well as focus on communities living in census tracts with the highest cases and lowest vaccine uptake. This health equity focus was called out in the Racial Equity and Reconciliation Report.'",
        "'speaker_7': 'In addition, we continue to focus on our goals outlined in that report. We're opening the Health Equity Center on North Long Beach in the next month. We're investing in black health and Latino health equity. We're completing a strategic we've completed the strategic plan and are opening the Office of Youth Development.'",
        "'speaker_7': 'We are strengthening violence prevention and reentry efforts through a number of programs and launching the REACH program, a model for alternative mental health response as we further develop alternative response models outside of the homeless population. The challenge is focused primarily on funding and capacity at this time.'",
        "'speaker_7': 'You hear about significant resources coming to the Health Department for pandemic response and community support. It is truly amazing what it is allowing us to do. However, these funds are only 2 to 3 year opportunities. Ongoing Sustainable Corps public health funding has not yet been made available through city, state or federal channels.'",
        "'speaker_7': 'Our core public health services in Long Beach are currently grant funded. Funding for programs outside of the pandemic response remain underfunded as need increases. Health Department fund balance was depleted in the early days of COVID. It has not been backfilled by other funding and we are not sure how FEMA will reimburse and buy one.'",
        "'speaker_7': 'We continue to need a comprehensive public health infrastructure in Long Beach to focus on health promotion and disease prevention post-pandemic. The fragmented funding has made it difficult to sustain even highly effective programs past the initial grant funded, often pilot stages.'",
        "'speaker_7': 'The demands this year have been extraordinary and exponential. The capacity to respond to meet expectation has truly been challenging as well as the ability of our internal finance and h.r. Systems to manage the grants and to hire quickly and maintain staff to meet the needs.'",
        "'speaker_7': 'We also are concerned because the social and health needs in our community continue to grow in this ongoing pandemic and these needs and challenges. All of us in the city. The challenges I discuss, however, have brought incredible opportunities in the past year and continue into this year.'",
        "'speaker_7': 'The new funding provides unprecedented opportunity to engage with our communities in planning and services, strengthening relationships, services and outcomes. We have hired more than 250 people to support the COVID response, nearly doubling the size of the Health Department's staff.'",
        "'speaker_7': 'We've strengthened health equity, provided much needed service to the community, and so much more. They've all jumped in and become strong. Stands for Public Health in our city, a significantly increase homeless services funding, which will allow for new programs such as our mobile messages, increase outreach and case management and additional housing opportunities, including the modular housing and'",
        "'speaker_7': 'our resource and referral platforms will allow for a better understanding of service availability and strengthen our ability to connect people to services they need. And finally, the opportunities for mental health campaigns to address stigma. The REACH team and partnering with the county to support alternative mental health response brings a new level of focus on mental health and'",
        "'speaker_7': 'access to care in our city. It has been truly been an extraordinary year for public health in Long Beach and across our nation. I am so, so proud of our health department team and all they've accomplished and continue to accomplish as an organization and as partners.'",
        "'speaker_7': 'To all of you in our work together to continue to push and achieve every day, even as they have experienced long days, uncomfortable jobs, staffing challenges, fear, family losses and ongoing change. Thank you for your support and understanding as we meet each new challenge and create new opportunities.'",
        "'speaker_7': 'With that, I conclude my presentation and I'm open for questions.'",
        "'speaker_0': 'Thank you. We're actually gonna do that for presentation first for all the departments, and then we'll go to the council.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Police Department is on their way out. Would you like to do both presentations and questions? Okay, we will do that. Our police department will now present.'",
        "'speaker_6': 'Thank you, Mr. Modica and Ms.. Tatum. Good evening, Honorable Mayor and members of the City Council. Tonight, Assistant Chief Hbert and I will be providing our proposed FY 22 budget presentation. As you are aware, the last year and a half has been tumultuous, not just in Long Beach, but across our country.'",
        "'speaker_6': 'We have focused on supporting the health and safety of our communities from the menace of COVID 19. The city has done a tremendous job of providing an unprecedented level of economic and community support to those most impacted. The men and women of the Long Beach Police Department are committed to serving our community and have demonstrated this commitment'",
        "'speaker_6': 'despite the risk to their own personal safety and well-being. In addition to the pandemic, we've also experienced unprecedented polarization and animosity towards law enforcement personnel. It is not easy to be a police officer, but the last year and a half has been particularly trying for our officers.'",
        "'speaker_6': 'I am proud to say that the men and women of the Long Beach Police Department did not avoid their duty to our community during this once in a lifetime pandemic event. At great risk to their health. Our employees reported to work every day supporting the city wide response efforts, working with persons experiencing homelessness, which we've heard a'",
        "'speaker_6': 'lot about in the last hour or so, and mental illness and addressing spikes in violent crime. I cannot say enough about the dedication, resilience and adaptability of our employees. We have made advancements over the past several years towards becoming more transparent and data driven, and we will continue to pursue this goal with unwavering focus, integrity and fortitude'",
        "'speaker_6': '. Our department is committed to increased engagement, a sensible review of our practices and culture to ensure our principles reflect those of our community and proactively re-envisioning processes that would benefit from change. These practices will ensure good policing that is professional, empathetic and constitutional.'",
        "'speaker_6': 'That is what our community wants and deserves. And we will provide it. Before I jump into the budget discussion, I want to take a moment to thank you, the mayor. You, the city council and our city manager for their prudent use of the Federal Safety Recovery Funds to provide for a pause from budget reductions in fy22 and'",
        "'speaker_6': 'for the measure of funding that continues to support our community. Although there are no major budget reductions in FY 22, the police department will not become complacent. We will address the many upstream factors that have created an environment ripe for increased crime and gun violence, specifically by prohibitive possessors.'",
        "'speaker_6': 'I'd now like to turn some of this presentation over to Assistant Chief Wally Ibish to go over our core services and accomplishments.'",
        "'speaker_8': 'Thank you, Chief.'",
        "'speaker_0': 'And thank you, honorable mayor and council members. The police department provides a variety of public safety services in our community. Our core services include responding to 911 emergencies and calls for service 24 hours a day and seven days a week, conducting criminal investigations and providing victim support.'",
        "'speaker_0': 'Working with local, state and federal partners on Homeland Security, which includes protecting major critical infrastructure throughout our city. Contracting in services with the Port Airport Metro Line and Long Beach Transit. In collaborating with multiple city departments and other partners to address violent crime.'",
        "'speaker_0': 'Support city efforts and assist with persons experiencing homelessness or mental illness through various alternative response models such as our met. Detail or quality of life teams and an integrated medical response. We also continue providing current services while the city and county explore alternative response models for persons experiencing homelessness and alternatives to incarceration.'",
        "'speaker_0': 'We spent count. We spent countless service hours focused on issues associated with homelessness. As mentioned, we also provide investigative services and resource information for victims of crime. Our detectives receive specialized training in trauma informed and victim centered investigations, enhancing their ability to serve as victim advocates.'",
        "'speaker_0': 'In addition, we work very closely with our nonprofit partners, and we're collaborating. And we're currently onboarding the trauma intervention program known as TIP, to provide support to emotionally traumatized community members after critical incidents. I'd also like to mention that none of this work would be possible without the support of our amazing professional staff.'",
        "'speaker_0': 'This next slide highlights some statistics that exemplify the great work of our employees. Our officers average over 1600 contacts per day, which includes responding to an average of 590 calls for service daily. While modifying our operations. In response to recent challenges, we still managed to keep our response time to priority one.'",
        "'speaker_0': 'Calls for service is one of the best in the nation. At less than 5 minutes. However, our priority two and three response times have increased. Like many major cities, Long Beach began 2021 with a significant increase in violent crime.'",
        "'speaker_0': 'In January of this year, firearm assaults increased 280% compared to January of 2020. Here you see the results of the hard work our employees have been doing. Although firearm assaults are up 53% citywide year to date, we are now seeing a downward trend in firearm assaults.'",
        "'speaker_0': 'July data shows a 33% reduction in shootings as compared to January of this year. Our offers. Our officers have worked tirelessly to impact the illegal possession of firearms and have already seized over 631 guns. 105. Those are known as ghost guns.'",
        "'speaker_0': 'Self-Assembled firearms often made by parts ordered online. We've made over 352 firearm related arrests. 209 of those have been for prohibited possessors. That's a 62% increase compared to the same time last year. As we continue into the second half of 2021, we're committed to working to prevent nationwide trends and violence from becoming normalized.'",
        "'speaker_0': 'Here's an example of some of our social media posts highlighting the neighborhood watch program and our coordinated response team. Two initiatives which have been designed to help us work with our community to impact violent crime. Both programs require community engagement and neighborhood awareness regarding our public safety efforts.'",
        "'speaker_0': 'EARNEST. Community engagement builds trust and legitimacy. This is fundamental to strengthening the connection between officers and the community we serve. In FY 21, we created the Office of Constitutional Policing, OCP. This office ensures the department meets community public safety concerns through a forward looking analysis of current policies, procedures and training.'",
        "'speaker_0': 'OCP works collaboratively with the Office of Equity on initiatives associated with building greater public trust and strengthening relationships through increased responsiveness, transparency and accountability. It's part of the department's ongoing commitment to community engagement. We created a community advisory committee to assist in policy review and creation.'",
        "'speaker_0': 'This committee provides input on department policies that impact community police interactions. Through OCP. We've also conducted training on the use of our early intervention program known as the Pro. All sworn supervisors are able to use pro to enhance the recognition of behavior patterns when employees have been involved in a higher than average number of key performance indicators'",
        "'speaker_0': '. Supervisors are trained to conduct detailed reviews in mentoring sessions to modify behavior and improve performance. You'll also see here on this slide the many institutions we are partnering with to ensure we are in line with best practices and community expectations.'",
        "'speaker_0': 'These partnerships include the Center for Policing Equity, Harvard USC brand, Georgetown University and Long Beach State. In addition, ensuring we are delivering on our promise of constitutional policing. We need to safeguard the physical and psychological well-being of our employees.'",
        "'speaker_0': 'With the assistance of Counseling Team International. We are doing just that. We're working to expand counseling services to include a peer support program for both our sworn and professional staff. And we've applied for grant funding to help with this effort.'",
        "'speaker_0': 'At this point, I'd like to turn the presentation back over to Chief Lynagh to talk about our FY 22 focus. Thank you for your time.'",
        "'speaker_6': 'Thank you, Assistant Chief. Although there were few budgetary changes for FY 22, there are still important things taking place within the police department. I will highlight only a few and then move on to the work that we will be doing with the Long Beach Safety Recovery Fund allocation in FY 22.'",
        "'speaker_6': 'We will continue to focus on onboarding civilian positions. In addition, we will be enhancing proactive, connection based recruitment, retention and advancement efforts by setting aside funds for a diversity, recruitment, mentorship and partnership program. With the help of our partners in the Civil Service Department, we hope to recruit for and hold to 50 person police academies in FY'",
        "'speaker_6': '22. Ideally, we would start the first academy sometime in the fall. Furthermore, we will continue our focus on technology in FY 22 with more efficient systems like a new records management system. E citations and recruitment and scheduling technology.'",
        "'speaker_6': 'In addition to programs funded through our operating budget, I am grateful for the additional investments in public safety and violence prevention, which is being provided through the Long Beach Safety Recovery Plan. These funds will provide for both upstream and downstream violence prevention and crime reduction activities.'",
        "'speaker_6': 'Here you will see some initiatives that will continue to impact violent crime and strengthen, strengthen relationships in our community throughout Fy22, including a new training program to support accountability. As a police chief, I am ever vigilant and aware of the challenges not only facing our department, but other police departments across our nation.'",
        "'speaker_6': 'Higher crime rates than we have seen in many years. Lower staffing due to prior budget reductions and higher attrition and recruitment challenges equate to fewer resources to respond to and investigate crime and homeless challenges. In addition, changes in the criminal justice system have led some habitual offenders not being held accountable for violent crimes or serious felony property'",
        "'speaker_6': 'crimes. To address these challenges, we are reprioritizing and taking positions from other areas of our department in attempt to reconcile the demand and community expectations with our current resources. Our department experienced high attrition of sworn personnel in FY 21 and will experience numerous retirements and separations this year as well.'",
        "'speaker_6': 'There is a lot of speculation as to the cause of the recent increases in the level of attrition. There are no simple answers. It's a tough job that is heavily scrutinized and criticized. The continuous disparagement of the police negatively impacts our ability to hire a workforce that accurately, accurately represents the demographics of our city.'",
        "'speaker_6': 'Unfunded legislative mandates pose additional challenges for law enforcement. I'm not opposed to making changes in our department to enhance transparency, accountability and trust. But there should be funding behind it. Most of our department budget is dedicated to sworn staffing who respond to the needs of our community, leaving limited staffing for administrative support, transparency and other accountability functions'",
        "'speaker_6': '. Even with all these challenges, I still believe that being a police officer is the greatest job in the world. I wouldn't trade a day of it, and I know that a career with the Long Beach Police Department will be just as rewarding for new officers.'",
        "'speaker_6': 'As it has been for me. Despite the many challenges we face today, our department is hopeful for new opportunities in FY 22. We are a nimble department that has been able to pivot and handle all the challenges thrown at us since FY 20, and I believe we will continue to do so in FY 22.'",
        "'speaker_6': 'Our proposed budget and the allocation from the Long Beach Safety Recovery Plan will allow us to continue to reduce crime while engaging our community through various programs. We will also continue to work with. Community organizations and youth at a level we have not had an opportunity to do so since the Great Recession.'",
        "'speaker_6': 'We look forward to developing new strategies that promote connections between patrol officers and the community that they serve. Again, I would like to thank the mayor and City Council for the measure. A funding to build a new training facility.'",
        "'speaker_6': 'We hope to break ground in FY 22. Lastly, we commit to the continuous hiring of diverse recruit classes and placing special emphasis on candidates who align with the values of our community. In closing, I want to thank the men and women of the Long Beach Police Department who I am proud to serve alongside every day because of'",
        "'speaker_6': 'their service and dedication. I am confident that we will build on our existing strengths and knowledge while continuing to learn and improve. We will continue to analyze data to identify root causes of crime and focus on community policing, sincere engagement, and community and officer wellness.'",
        "'speaker_6': 'Our dedication to fair, just and equitable policing will allow us to continue making advancements towards realizing our vision of a safe city for all by achieving our mission of public safety. Through partnerships. And with that, I thank you.'",
        "'speaker_6': 'I know we're going to answer questions between the health department and police department, but just we talk about diversity and we talk about all our efforts of diversity. And if you look at this table here in front of you, I'm the first Hispanic chief in the history of the police department.'",
        "'speaker_6': 'I have one of the highest ranking Muslim American police executives in the entire country of the United States and the assistant chief and sitting next to him as bureau chief. Julissa Jose Murray, who is our basically our our bureau manager, our finance chief.'",
        "'speaker_6': 'Look at our faces. When we talk about diversity. We're not just talking about it. We are diversity. We are the people who are making decisions for this police department. And that's counter to a narrative that's out there that we don't do that.'",
        "'speaker_6': 'So with that, we'll turn it over to all of you. And I look forward to all your questions.'",
        "'speaker_0': 'Thank you, Chief. I appreciate both presentations. Unless there's any objection, we're going to do public comment first. There's a significant amount of public comment. So we want to get through the public comment and then I'll turn it over to the Council for further comment.'",
        "'speaker_0': 'So, Madam Clerk.'",
        "'speaker_1': 'Can I have the first five speaker approach to the podium? Starting with Karen Resi. Maurice Coleman. Giovanna Ferrero. Maggi Collins and Audrina Redman. Please line up.'",
        "'speaker_2': 'Thank you for those detailed presentations, but listening to the presentations. Karen Reside I'm representing Long Beach, Gray Panthers. We do education and advocacy on older adult issues and we're part of the People's Budget Coalition. I have an 8420 2% of the population.'",
        "'speaker_2': 'That's ridiculous. This is what we're being given. Does our city really care about seniors? That's why we're asking for $2 million. Cynthia, how has done a phenomenal job in getting a group of us going on older adult issues.'",
        "'speaker_2': 'She has to have funding to update the plan for seniors. We don't really have a plan. It was done ten years ago. Does that include the baby boomers? I mean, are we really going to continue to ignore older adults?'",
        "'speaker_2': 'We took most of the death burdens during the pandemic. We're actually still under stay at home orders. There's a lot of us missing tonight because too many were afraid to go out because of the Delta variant. There's a lot of things moving in a positive direction.'",
        "'speaker_2': 'We just want to be included in the positive movement. I don't think that's too much to ask. We pay most of the taxes. We have most of the wealth in the city. And it's like we're not being paid attention to in the budget and for the police department.'",
        "'speaker_2': 'You're too expensive and you don't really do anything for older people. So it's time that we look at different ways and you need to address older adult needs and issues. I think.'",
        "'speaker_4': 'Hello. My name is Magic Collins. I'm part of B World Collaborative in Long Beach. And for me, I don't get the whole campaign on. We're nice guys. I understand. I see your humanity. No, we don't have to do the campaign.'",
        "'speaker_4': 'And for what we've gone through, the community has done nothing but show their strength as they've created food, drive the Fed to the public.'",
        "'speaker_6': 'They fought the house, the homeless.'",
        "'speaker_4': 'We don't have the campaign. We're we're kind. We know we're human beings. That's why we're here. Everybody here right now, we're not. We're here to fight for something that's real.'",
        "'speaker_6': 'We don't have the campaign that things are working in the streets.'",
        "'speaker_4': 'If we empower the leaders, they will tell the truth. They will tell everybody that it's working.'",
        "'speaker_6': 'We don't have to campaign on that.'",
        "'speaker_4': 'Disproportionately African-Americans are the most the homeless. The impact of violence. Violence has already been normalized. Sometimes addiction, spousal abuse, mental illness, trauma, watching. Loved ones paths. Foster care system. Food. Apartheid. Compounded medical issues. Militarized police force. The African-American community.'",
        "'speaker_4': 'This is a mental health emergency.'",
        "'speaker_1': 'Thank you. Your time is up.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Giovanna.'",
        "'speaker_2': 'Hi. Thank you all for being here. And I just want to make sure that one thing is discussed in these presentations. I understand you're giving us information. You're giving us statistical information. You're giving us the hope that you, you know, want to relay.'",
        "'speaker_2': 'You're not discussing racism. You're not discussing classism. This is the core. I don't know why that's not being talked about. I understand you need to give us information. Thank you for that. I'm not saying y'all aren't doing anything.'",
        "'speaker_2': 'It's not enough when it comes to this. It's just not you. You look at that budget. 1%, 1%. The smallest piece of the pie should be the biggest piece of the pie. It's not enough. You got people out here.'",
        "'speaker_2': 'These are your constituents. We don't we know what we're talking about because we have experiences with with you on this side, in your uniforms. And those experiences are very real. The accountability and lack of diversity. And Chief Luna.'",
        "'speaker_2': 'I can't get over the comment. The day of the protests and what happened in downtown. This poor man has his young girl on his shoulders. This black man. And your comment in quote is he should have been arrested for child endangerment.'",
        "'speaker_1': 'Thank you. Your time is up. We have Magic Collins. Adrina Redman. Pamela Fields. Tesla coal. Kenny Allan. Please line up at the pole. Maggie Collins. Adrienne Redman. Pamela Fields. Classical.'",
        "'speaker_2': 'Remember him?'",
        "'speaker_9': 'Chip Luna. My name is Pamela Fields. I'm the mother of Dante Jordan, who was killed by Long Beach Police Department on November 10th. 2013. This budget is ridiculous. What about mental health? What about putting their money into the communities?'",
        "'speaker_9': 'You guys don't live in our community. You don't see what? Go on. You go on back home where you live. Words are plush and everything, and you come on in our communities to rob, kill and destroy mostly. So where is the money going to go to?'",
        "'speaker_9': 'Why did you guys get a big chunk of the money? What about the aftermath? And you cannot charge here. Nobody offered me any counseling.'",
        "'speaker_2': 'Nothing.'",
        "'speaker_9': 'Nobody even told me my son was dead for a long time and it wasn't no police officer that taught me how to find out in the streets. And you guys ought to be ashamed of yourself. You shoot first, a line later.'",
        "'speaker_1': 'Please approach the podium.'",
        "'speaker_2': 'Hi. My name is Tessa. I'm a resident of District three. I'm here to express my support, along with all my friends here for the priorities outlined in the people's budget. I recognize that we have seen some marginal shifts in budget priorities, some of them hard won, but they are wildly insufficient.'",
        "'speaker_2': 'For the realities we're facing. I mean, we just heard so much today. Amount housing, reentry programs, health programs, and so much more. They could all use this funding. It's heartbreaking to hear our own health department leaders tell us that there isn't enough funding over and over again for these programs.'",
        "'speaker_2': 'And Longreach PD sits here with almost half the city budget. And we heard some great ideas mentioned here tonight. But. Our budget doesn't reflect what we need. Having the police continue to play roles way outside their job description and training is not part of the solution.'",
        "'speaker_2': 'It's part of the problem. If you want to prevent crime and you want to bring our city into a successful future, you need to embrace the priorities in the people's budget and support health and support care, not cops.'",
        "'speaker_2': 'Thank you. Thank.'",
        "'speaker_4': 'Good evening, Mr. Mayor, and city council members. My name is Kenny Allen. I live in the second district of Long Beach, and I'm here to echo the voice of the community in asking that you adopt the people's budget demands specifically to reduce the police department budget by 65 million and reinvest that in our community.'",
        "'speaker_4': 'The city manager prefaced this budget hearing by listing what he thinks are examples of the city listening and responding to community concerns. Clearly, you've misheard us. We have not been asking for better police training, more police diversity or more constitutional methods of policing.'",
        "'speaker_4': 'Those things are not the problem. The problem is the dramatic and unprecedented expansion and intensity of policing in the last 40 years a fundamental shift of the role of police in society. The problem is the police themselves. Here is your second chance to listen.'",
        "'speaker_4': 'We're not asking for more equitable policing. We are asking for our money back 65 million. That is what we are asking for it. Do not miss. Hear us again. Thank you, a.'",
        "'speaker_2': 'We have your age.'",
        "'speaker_1': 'Ms.. Dell Lora age and yeah. Led, please line up. As a reminder, please keep your mask on while speaking at podium.'",
        "'speaker_2': 'Hi everyone. My name is Jamilah and I'm a community organizer with the Long Beach Immigrants Rights Coalition. I want to slow down for just a minute and consider the fact that we are listening to a presentation by the very same department who will benefit in funding by using the scare tactics of crime.'",
        "'speaker_2': 'Unfortunately, ultimately, police are violence workers. Their response to violence is more violence or threat of violence. This means police contact and police resources automatically means violence because cops out of their own violence to them already what's happening in the mix?'",
        "'speaker_2': 'So as Tamara, an opera says, instead of being violence prevention, cops are violence promoters. The evidence that police stop people from killing each other is weaker than many people previously thought. While the evidence of police killing people is strong, the statistics presented by the Long Beach Police Department today consider shoplifting out of necessity to be a crime'",
        "'speaker_2': '. But what about the theft of funding from art communities that has been giving to policing? To me, that sounds like theft. We're asking for funding to be giving to community programs like the ones listed on the people's budgets demand.'",
        "'speaker_2': 'Defund the police by at least 25%. And give funding to the programs that meet our community needs.'",
        "'speaker_1': 'Thank you. Your time is up.'",
        "'speaker_10': 'Well, I want not just sorry. Pertaining to that immigrant lobby that as opposed to the limit of 20% and departamento policy are the technology over here, Nancy. You see when think policy in the service de nada program under the 13th and I don't know how many you funded Olivia de Miranda.'",
        "'speaker_10': 'Yes. Then we are fucked up or la pandemia. You could grow gas. You don't register the necessity. Don't know almost any grown up or your border patrol concealer is what is cool charming. Ethan Manning went down with Travel Company, The Immigrant Element.'",
        "'speaker_10': 'Okay, well, I want to start it. I mean.'",
        "'speaker_8': 'Hello. My name is Vanessa Ryder.'",
        "'speaker_10': 'Sleep quality in the immigrant.'",
        "'speaker_8': 'Amber from the Coalition of Immigrant Rights.'",
        "'speaker_10': 'Which is why I keep an unsolicited concealer.'",
        "'speaker_8': 'I'm here to request this council.'",
        "'speaker_10': 'As a pueblo.'",
        "'speaker_8': 'To accept the people's budget.'",
        "'speaker_10': 'In 2014 to Departamento de Policia.'",
        "'speaker_8': 'Asking for a reduction of a 25% from the police department.'",
        "'speaker_10': 'And 70% of this de nada.'",
        "'speaker_8': 'And 4.25% of the destined.'",
        "'speaker_10': 'This integral part of wholeness.'",
        "'speaker_8': 'For a global development for the.'",
        "'speaker_10': 'Youth, the money that.'",
        "'speaker_8': 'In our community.'",
        "'speaker_10': 'Even though the Olivia.'",
        "'speaker_8': 'And a relief budget or fund.'",
        "'speaker_10': 'Money that immigrant.'",
        "'speaker_8': 'For entire immigrant community.'",
        "'speaker_10': 'Based.'",
        "'speaker_8': 'In this city.'",
        "'speaker_10': 'Gets you the poorest. The Pandemia.'",
        "'speaker_8': 'Has been greatly affected by this pandemic.'",
        "'speaker_10': 'Then the management of the races.'",
        "'speaker_8': 'So thank you very much.'",
        "'speaker_10': 'For the money with that nice travel.'",
        "'speaker_8': 'For taking into account our voice.'",
        "'speaker_10': 'In this respect, this unit.'",
        "'speaker_8': 'And our.'",
        "'speaker_10': 'Requests. Yes.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'I have a public comment on behalf of a community member who had to leave because there is no childcare here available. Can I read her comment?'",
        "'speaker_0': 'It was someone that's already signed up. Yes. So who is it for?'",
        "'speaker_2': 'It's for Laura Ibarra.'",
        "'speaker_0': 'Okay. That's not how I was called.'",
        "'speaker_2': 'When I started this mine on Breslauer. I read. Is their interpretation.'",
        "'speaker_8': 'I would have to know. My name is Laura. A writer.'",
        "'speaker_10': 'Is so partizan a policy.'",
        "'speaker_2': 'On the that I chose the immigrants in Long Beach.'",
        "'speaker_8': 'I am part of the Coalition for Immigrant Rights of Language.'",
        "'speaker_2': 'Yes, they are keeper. I said escuchar that.'",
        "'speaker_10': 'Either my daughter Consuelo Lacerda.'",
        "'speaker_8': 'And I'm here to be heard and to demand, asked the council.'",
        "'speaker_10': 'Get back here and press a Western policy.'",
        "'speaker_2': 'But it'll be simple policy to bring.'",
        "'speaker_8': 'Down the police budget on a 25% reduction.'",
        "'speaker_10': 'And press of Western policy. I guess they'll sign this as follows.'",
        "'speaker_2': 'Gideon The technology has got to get closer because as.'",
        "'speaker_10': 'Part of your Rachel Gloss immigrants in Manila.'",
        "'speaker_8': 'The police is already using part of the budget to acquire technology. That is really something that is breaking all immigrant rights of all immigrant rights in this city.'",
        "'speaker_10': 'And start comparatively for my circle of the hemp.'",
        "'speaker_2': 'They were heavily.'",
        "'speaker_10': 'Supported this was.'",
        "'speaker_2': 'One of those but I embrace and Brazil Sara is that.'",
        "'speaker_10': 'Technology and competition for my skin.'",
        "'speaker_2': 'Color for hemp is the eyes where they don't really sa is those one.'",
        "'speaker_10': 'Those.'",
        "'speaker_2': 'Are you that unexplored. I must guess that must be the.'",
        "'speaker_8': 'So instead of using this technology to exchange information with eyes, they should use this funding in order to help you with programs that help help the immigrants in this city.'",
        "'speaker_10': 'But I implore you on this central cellular pattern.'",
        "'speaker_2': 'With the fancy anos and wireless app, where when are you that.'",
        "'speaker_8': 'For example, the creation of help centers for help for our elder.'",
        "'speaker_2': 'Apropos there of there are you there's an extent this I think almost Ambien within a.'",
        "'speaker_10': 'Rally side of the business activity that is paramount benefits is a level of.'",
        "'speaker_2': 'Physical mental are.'",
        "'speaker_8': 'To help their delivery to access the resources that already exist to promote activity that will help them get a better health and a better physical condition.'",
        "'speaker_2': 'Are you the most prolific para for there are you are as.'",
        "'speaker_10': 'One travelers.'",
        "'speaker_2': 'And as this the impulse.'",
        "'speaker_10': 'The la pandemia in bottles in Manila travels they can withstand the internet.'",
        "'speaker_2': 'Crisis, but a culture and authenticity that.'",
        "'speaker_10': 'Is its bedrock dominant consideration.'",
        "'speaker_8': 'And to help the entire community in order for them to be able to access all these resources during the pandemic on the Internet. And thank you for listening to all our voices.'",
        "'speaker_1': 'And I have the next five police lineup. Carina. Evelyn Garcia. Iris Rodriguez. Elizabeth and Griselda Soto. Carina Evelin Garcia. Iris Rodriguez. Elizabeth and Griselda Soto. Carina.'",
        "'speaker_2': 'Hello. Hi. Members of the council. My name is Karina. I'm a community organizer with the Long Beach Immigrant Rights Coalition. Last year, the upright last year during the uprisings, many cities, including Long Beach, vowed to implement structural changes and deemed racism a public health crisis.'",
        "'speaker_2': 'Today, I call on you, Mayor Garcia, and all you council members and the city manager to allocate funds towards programs that actually help communities recover from the pandemic. Instead of funding the police department with millions of dollars, additionally, police funding will only increase violence in our communities and fill up our jails and prisons with people of color'",
        "'speaker_2': '. Police don't stop violence no matter how big their budgets are. What the real question you should be asking is what are the root causes of these inequities, this inequality? And what can Long Beach do to help our community thrive?'",
        "'speaker_2': 'I urge you to please divest from police and invest in programs that establish rental housing divisions. Support youth recovery. Fully fund the right to counsel and language access.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_10': 'Allowing as much as they willing. Garcia.'",
        "'speaker_8': 'Good evening. My name is Evelyn Garcia.'",
        "'speaker_10': 'SOPA under the late Jose. Miranda's a long beach.'",
        "'speaker_8': 'I am part of the Coalition for Immigrant Rights of London.'",
        "'speaker_10': 'Yesteryear. Keep another man, Berkeley. Consider the Long Beach, Associated Press Questo Pueblo. I've assembled here La Policia.'",
        "'speaker_8': 'And I am here to urge the City Council here to support a reduction of the budget for the police.'",
        "'speaker_10': 'It can be improper. De la policia. They have emphatic no, no. Yes, but their fear ain't me. That money that immigrant.'",
        "'speaker_8': 'And also to reduce the budget for the police to stop using technology that is oppressing and harassing our immigrant community. In the city of Long Beach.'",
        "'speaker_10': 'Jacket by Rami Seguro in Como El Camino Por La Scala Sabian look la policia Mr. He Lando.'",
        "'speaker_8': 'For me, it's very unsafe and uncomfortable walking around Long Beach knowing that the police is keeping an eye on me.'",
        "'speaker_10': 'B The technology has come on the direction of Simian, but I feel the Tories have automatically the placards and they are truth.'",
        "'speaker_8': 'And I ask for the stoppage of the use of technology for facial recognition and also for a license plate reading technology.'",
        "'speaker_10': 'The symbol samosa la policia. Yeah, Podemos had nothing illegal. Fiancee the afectados por la pandemia.'",
        "'speaker_8': 'So defund the police and let's help the tenants that have been affected by the pandemic.'",
        "'speaker_10': 'You can stand up under the service and look for other Dinerral people. So they'll call it not within forever.'",
        "'speaker_8': 'And they are about to be in. Evicted due to the lack of money and because of COVID, they couldn't work it.'",
        "'speaker_10': 'Ambien appointments are different. This program as part of our business for our youth.'",
        "'speaker_8': 'And also let's work on more programs, different programs that will support our youth and better programs for them for their future.'",
        "'speaker_10': 'Muchas gracias. Por La Melo. The Academy commented your yes parochial comment and Quinta.'",
        "'speaker_8': 'So thank you very much for giving me the opportunity to offer my comment and for taking me into account jacket.'",
        "'speaker_10': 'But I'm me. As for some, I'm in the important proposal. You are La Comunidad in the coming documentary and.'",
        "'speaker_8': 'For me this is very important in order to support the documented community. Thank you very much. That's.'",
        "'speaker_10': 'We witness not just women on breast. It is also part of the ritual immigrants.'",
        "'speaker_8': 'My name is Iris and I am part of the Coalition for Immigrants Rights.'",
        "'speaker_10': 'If they keep it up ed concealer alone. Which ketamine? Gwen demi commentary? Yes. The samples are la policia.'",
        "'speaker_8': 'I am here to ask the City Council of Long Beach to define their beliefs and to listen to my comments.'",
        "'speaker_10': 'But okay. Say percentile, whether through southern fondos para programas, let alone peace.'",
        "'speaker_8': 'And for the funding to be able to be used for different programs inside the budget in the City of London.'",
        "'speaker_10': 'Let's be though, there have been artisanal letters, album articles of placards. Israel and Brazil sell an authentic story that grandma Spanish come here.'",
        "'speaker_8': 'I ask you to stop using the license plate readers instead of creating more safety, that creates more panic among the community members.'",
        "'speaker_10': 'Jackass Escovedo Color Policy Compartilhar infamously organized. Let's implement the end is Daniel.'",
        "'speaker_8': 'Since we know that the police have been sharing that information with eyes during this year.'",
        "'speaker_10': 'But experience appropriate me was no to an accident. They were estado.'",
        "'speaker_8': 'According to my own experience, a neighbor had an accident and he was arrested.'",
        "'speaker_10': 'Focusing on another Space Azteca supporter. Mostrando Informazioni Mas ona fotografia incorrect to commemorate inexplicably.'",
        "'speaker_8': 'So I knocked on his door showing information and the wrong picture. How can you how can you explain that to me.'",
        "'speaker_10': 'Is but I suck at them being ghetto because the Terminator satellite technology and the reconciliation of a cell it was but a mirror system.'",
        "'speaker_8': 'And that is also why I ask you to stop using facial recognition technology, because that is basically racist.'",
        "'speaker_10': 'Let's be, though, because it is key to look at this policy in thought. Elwin Burton and not as programmers, Cormac says solid humor. Yvonne Doyle Assistance. Financiera para los inmigrantes.'",
        "'speaker_8': 'And I ask you to defund the police on 25% to bring resources for a judicial system, for legal assistance, language assistance and other services in the city.'",
        "'speaker_10': 'Then to Mano, let's talk about this, which is an amalgam. Primitivo and Starkey Egan recommend that you get both an excellent A.J.'",
        "'speaker_8': 'I first of all, thank you very much for giving me the opportunity to speak to you and I wish you all have a very good evening. Thank you very much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_10': 'We are not just attorneys. My number is Elizabeth Gonzalez.'",
        "'speaker_8': 'Good evening, everyone. My name is Lisa marie Gonzalez.'",
        "'speaker_10': 'So residents of the Long Beach Street don't know.'",
        "'speaker_8': 'I am a resident, the neighbor from Long Beach and I belong to.'",
        "'speaker_10': 'My partner, local chocolate immigrant.'",
        "'speaker_8': 'I'm also a member of the Coalition for Immigrant Rights.'",
        "'speaker_10': 'A Starkey Papel concealer. The Long Beach Gazette puesto the Pueblo Idem us programa recursos, a la Comunidad immigrant.'",
        "'speaker_8': 'I am here to ask the City Council of Long Beach to accept the people's budget and to offer more resources and programs to the immigrant community.'",
        "'speaker_10': 'It assembles their la policia.'",
        "'speaker_8': 'And to defund the police.'",
        "'speaker_10': 'Yeah. Boyle Corporacion de la Renta.'",
        "'speaker_8': 'And to support the recovery of our youth.'",
        "'speaker_10': 'To reconsider L.A.. I see that as a lack of money that.'",
        "'speaker_8': 'Should reconsider the needs of the community.'",
        "'speaker_10': 'They are, for your part. But in Berthier and Programas.'",
        "'speaker_8': 'And to support investment in programs.'",
        "'speaker_10': 'Programs. And as we take a separate cask on technology and other.'",
        "'speaker_8': 'Programs in their public libraries with Advanced Technology.'",
        "'speaker_10': 'Center, the tutorials centers, community areas.'",
        "'speaker_8': 'Tutoring centers, community centers.'",
        "'speaker_10': 'Centers, they argue that therapy is allowed maintain.'",
        "'speaker_8': 'Mental health and therapy center.'",
        "'speaker_10': 'Central the rehabilitation, their drug addiction, the alcohol.'",
        "'speaker_8': 'Rehabilitation centers for drug addiction and alcoholism.'",
        "'speaker_10': 'But then they're you know, then they're like you don't see an important I stated migratoria.'",
        "'speaker_8': 'For everyone to obtain help regardless of their immigration status.'",
        "'speaker_10': 'Are you going to get ambito ez bueno e they gram provigil mccardell you're dependent on.'",
        "'speaker_8': 'And helping the youth is good at any level because on them realize our future.'",
        "'speaker_10': 'Get aimlessly in, start social and seahorse.'",
        "'speaker_8': 'We want social well-being of our children.'",
        "'speaker_10': 'Getting an opportunity other that's already visited added as L.A..'",
        "'speaker_8': 'We want them to have the opportunity to survive and thrive.'",
        "'speaker_10': 'Cannot send money to rehab those near criminal those delinquent this.'",
        "'speaker_8': 'Not to be monitored and harassed as criminals.'",
        "'speaker_10': 'Crazy vanilla boy la confianza de la policia 41.'",
        "'speaker_8': 'For them to receive receive the trust and support from the police equally.'",
        "'speaker_10': 'It can not discriminate pachuco lor or supporter or person response agnico.'",
        "'speaker_8': 'And not to be discriminated based on their ethnic initially or race.'",
        "'speaker_10': 'Queremos. When Apple's yahoos start seeing technology as observers get their Confianza can know that the more.'",
        "'speaker_8': 'We want to serve beliefs without complicated and sophisticated technology that gives us fear and mistrust.'",
        "'speaker_10': 'Confianza is a tamarin quint amico Mysterio Aguilar this Cueto. Why not? Not just hoping.'",
        "'speaker_8': 'That my comment is going to be taken into account. Thank you very much.'",
        "'speaker_10': 'Walla Walla Walla as much as they resell that easily see them. They barter under the riches in Miranda Salem's killer.'",
        "'speaker_8': 'What do you mean? I am Griselda and I am a resident and also a member of the Coalition for Immigrant Rights in Long Beach.'",
        "'speaker_10': 'Mr. Yaki presenter parody mandala concealer the longest.'",
        "'speaker_8': 'I am here to ask the City Council.'",
        "'speaker_10': 'I said. I thought they were all in the same boat. The La Policia.'",
        "'speaker_8': 'To accept the budget, the people's budget and defund the police.'",
        "'speaker_10': 'And stay in control. The man the that I mean.'",
        "'speaker_8': 'I am against the technology for facial recognition.'",
        "'speaker_10': 'That I mean they certainly dress automatic or the placards get certain money then we grant the amnesty and.'",
        "'speaker_8': 'Also to stop using the license plate readers that affect mostly our youth and our community.'",
        "'speaker_10': 'And still keep our abogado busy.'",
        "'speaker_8': 'I am here to advocate also for the Division of Housing for Rent.'",
        "'speaker_10': 'Jackie Autoimmunity for Tara Yao and Mark Vanessa Pandemia.'",
        "'speaker_8': 'Since I am also I been affected by that and I am also a victim of the pandemic.'",
        "'speaker_10': 'And some of the enormous reservoir of poverty, that of the rent that.'",
        "'speaker_8': 'We are losing our houses, our homes, because we cannot pay the rent.'",
        "'speaker_10': 'And this is it may be acceptable para money that.'",
        "'speaker_8': 'We need acceptable housing for our own communities.'",
        "'speaker_10': 'Guerrasio Fortescue Chairman, you broke a dominant Kwanza.'",
        "'speaker_8': 'And thanks for listening to me and for taking this into account. I hope.'",
        "'speaker_10': 'You have put your money there.'",
        "'speaker_8': 'And I hope you can support our community.'",
        "'speaker_10': 'Honorably.'",
        "'speaker_8': 'That is the most.'",
        "'speaker_10': 'Gracious, incredulous. Wendy Garcia.'",
        "'speaker_8': 'Thank you and God bless you all.'",
        "'speaker_1': 'And I have the next five police lineup. Lupita V. Jose Galarza. Danielle Renee. YOLO. Victor Sanchez. Camila Homes. Lupita. Jose. Danielle. Victor and Camila. Please approach the podium.'",
        "'speaker_10': 'Hmm. When I notice Menominee a little bit on eBay. So potentially community identity to the immigrant is the Long Beach.'",
        "'speaker_8': 'Hello. Good evening. My name is Lupita Rivera and I am a member of the Council for Immigrant Rights of Long Beach.'",
        "'speaker_10': 'And stocky, but a petite girl considered the long accepted Western in Pueblo. Inadmissible remarks come when the recognizing me into fashion or let automatically pluck us in three orders.'",
        "'speaker_8': 'I am here to request this honorable council of Language to accept the people's budget and also to stop using facial recognition software and also license plate recognition software. Among other things.'",
        "'speaker_10': 'Is the technology embedded in strip privacy that in resistant, informative and worthless community assembly levels.'",
        "'speaker_8': 'This kind of technology is an invasion of privacy. It is racist and it doesn't protect our communities.'",
        "'speaker_10': 'This embolden and Annapolis here is informed. Those have already amassed majorities.'",
        "'speaker_8': 'Defund the police and use these funding to for programs. Adult programs.'",
        "'speaker_10': 'Commercial for Mayotte missing the Arab immigrant study into the services but an assortment from Florida.'",
        "'speaker_8': 'And because I am an older adult, I feel vulnerable and many like me feel the same way. So we need more programs in this community.'",
        "'speaker_10': 'Can I just put Cochairman Espinoza itemized in Quantum me was he said to me, L.A. he borrowed pianos to come with which are the rascals went a notch.'",
        "'speaker_8': 'And thank you for listening me and listening to me and for allowing me to speak up. And I hope we move forward with these ideas. And thank you very much. I am a very good evening.'",
        "'speaker_0': 'Honorable Mayor, members of the city council. It's good to see you again. Victor Sanchez, the project director of the Language Coalition for Good Jobs in a Healthy Community. I just wanted to say, unfortunately, we had a few members of workers actually that were here who had to leave home early because they work very early.'",
        "'speaker_0': 'And I regret that this item was moved so late because of that.'",
        "'speaker_4': 'And there are a lot of members whose names have been called and have not been able.'",
        "'speaker_6': 'To give testimony that I.'",
        "'speaker_0': 'Wish they would have. So I just wanted to acknowledge that before I give my remarks, I will say that, you know, our coalition has had about 1200 conversations in the last three months with all renters in Long Beach.'",
        "'speaker_0': 'And two things really stood out. 98% of them believe that more is needed on behalf of the city with regards to rent relief and resources to fight illegal eviction notices that continue to make in front of in front of them.'",
        "'speaker_0': '97% of those respondents believe that there should be greater investment in social programs and direct relief for marginalized communities. Rather than increasing the budget.'",
        "'speaker_6': 'For the LAPD.'",
        "'speaker_0': 'In this pandemic has only worsened the pressure these families are facing. And so we're asking that you reallocate money from the LAPD to address the root causes.'",
        "'speaker_4': 'That a lot of these families are having to deal with during this.'",
        "'speaker_0': 'Time. And specifically, the housing needs that are mentioned in the people's budget, the community land trust investment, the full funding of the Right to counsel program, and the creation of a housing department specifically that can liaise.'",
        "'speaker_4': 'With landlords and tenants.'",
        "'speaker_0': 'So again, I ask that you adopt the people's budget.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_1': 'Danielle. Real little. Camilla Holmes. Magnolia. Pre. Pre. Ada. Jane. Alfonso. Mary. Joan.'",
        "'speaker_2': 'Good evening. My name is Camilla, and I have been a resident of Long Beach since 93 and a sixth District resident for about 20 years. The following is my assessment of some of some of the community needs and what I think should be prioritized in the budget over the Long Beach.'",
        "'speaker_9': 'Over Long Beach Police Department.'",
        "'speaker_2': 'Based on my own observations. Well, I do see. That there is that there is not enough housing services, mental health services and health services. And this has been.'",
        "'speaker_9': 'Mirrored in the previous presentations today.'",
        "'speaker_2': 'From downtown to north Long Beach, you can see a steady landscape that evidences an unreasonable or unreasonably large.'",
        "'speaker_9': 'Population of houseless people.'",
        "'speaker_2': 'Tents line the river and increasingly our streets. People are walking around often clearly in some sort of mental distress. We need resources for them. We need the health department to be fully funded. We need resources for our children.'",
        "'speaker_2': 'I was happy to see that Parks and Rec set up some mobile recreation programs some months ago. We need more of that. We need more resources for our libraries. The libraries play such a vital role in the city, especially in lower income neighborhoods.'",
        "'speaker_2': 'In normal times, they provide tutoring or just a place to go internet for those who don't have it job resources, other educational resources. And the list goes on and on. The library should not have to do private fundraising to run their stellar, beneficial programs.'",
        "'speaker_2': 'One police department.'",
        "'speaker_9': 'Must have had most of the city budget. There.'",
        "'speaker_1': 'Your time is up. Next picture.'",
        "'speaker_2': 'Please. I'm Jane Alfonso, and I'm chair of the Justice and Peace Committee at the South Coast Interfaith Council. And I represent hundreds of faith leaders in both the Interfaith Council and Clergy and Laity United for Economic Justice. And I'm asking.'",
        "'speaker_3': 'You to pass the.'",
        "'speaker_2': 'People's budget. Faith communities share the values.'",
        "'speaker_3': 'Of justice.'",
        "'speaker_2': 'Including economic justice.'",
        "'speaker_3': 'And peace.'",
        "'speaker_2': 'Love of neighbor and care of neighbor, and privileging the most vulnerable. Imagine a budget that prioritized people and not police and prioritized the most marginalized. You've seen that we need to invest in housing and health. Seniors and youth, not police.'",
        "'speaker_2': 'A budget is a moral document. It's a spiritual document. Long Beach can invest in equity and care, not fear and scarcity. The people's budget reflects the structural changes and economic justice that reallocate assets to black lives. Undocumented, other people of color and all march and marginalized communities.'",
        "'speaker_2': 'Mayor Eric Garcia suggested that Long Beach could be a model for housing policy. Why not pass a model budget? Faith Leaders. We will continue to pray for you as you deliberate on passing a people's budget. Thank you. Hmm.'",
        "'speaker_2': 'Hmm. Hmm.'",
        "'speaker_10': 'I'm not sure what you mean either. And so I keep an eye on the school channel and the silhouette of the black woman with other equal numbers.'",
        "'speaker_8': 'I am deliberate, and I am here for to tell you about the needs in the Long Beach community.'",
        "'speaker_0': 'Yeah, personally.'",
        "'speaker_10': 'I did not bring the necessity recourses, but I look at in massive capacity my muscle data. Well, on the carousel seahorse, they would only be just close around him.'",
        "'speaker_8': 'One thing that we need first is a safe place for our single parents to be able to drop their children while they are going to work.'",
        "'speaker_10': 'You can see an accessible asparagus.'",
        "'speaker_8': 'For them for those spaces to be affordable.'",
        "'speaker_10': 'It Zambian necessity. Amala you must tell you that perilous persona, the letters that are going on out them, I say what goes on. They just put on a stern pseudonym in the case of familiar travel or personas give you and soldiers.'",
        "'speaker_8': 'And also we need help for places for the elderly to feel safe while their children are working.'",
        "'speaker_10': 'Getting entry and thus accessible is precarious. But look, look, use commodious boy, then begin.'",
        "'speaker_8': 'To have affordable rent in order for them to be able to live anywhere they really can leave.'",
        "'speaker_10': 'But again, not all. And they're going to go there be.'",
        "'speaker_8': 'Because not everyone can get access to government help.'",
        "'speaker_10': 'It does mean precarious, turbulent animosity with others. But alas, foreigners in the news notwithstanding luxuries like Leandro Paredes will see another August.'",
        "'speaker_8': 'And also to have more activities for children and the youth to keep them away from the street, from doing graffiti and getting into trouble.'",
        "'speaker_10': 'With soil area. So an unfortunate surprise.'",
        "'speaker_8': 'That the future of this country.'",
        "'speaker_10': 'Ever ultimate Syria movie. When Musk Inarritu called Marcel persona la la policia capable, they are confronting Neos in not the Netherlands meu guan are you not Americans in Gaza and start to say what does get banal? You got other inaugurals, but I love persona comprar lima and all the other organs.'",
        "'speaker_8': 'And also to train the police department to teach them so we can trust them and not have fear. Every time there is an emergency, we should be able to trust them and not have fear that they are going to come with violence and shoot people even people with mental issues.'",
        "'speaker_10': 'There in the do Carlos Spaghetti Newcastle welcome to actor article so Scousers who can do the mask on a problem.'",
        "'speaker_8': 'So they want to be better trained in order to learn and know what to do in those cases when they face that kind of situation.'",
        "'speaker_10': 'But I can say I'm patella solution in moment that I problem.'",
        "'speaker_8': 'For them to be part of the solution and not to increase. The problem.'",
        "'speaker_10': 'Is that people punto a mysterious burial of the men in children as yes.'",
        "'speaker_8': 'That is my point of view and I hope you are taking into account. Thank you very much.'",
        "'speaker_2': 'You know since.'",
        "'speaker_4': 'The nursing.'",
        "'speaker_1': 'Good evening, Mayor Garcia and council members.'",
        "'speaker_2': 'Good to see you all.'",
        "'speaker_1': 'My name is Mary you. I am a pastor and a faith rooted organizer.'",
        "'speaker_2': 'With Clergy and Laity.'",
        "'speaker_1': 'United for Economic Justice, also known as CLU. And today I represent hundreds of faith leaders connected through Crewe.'",
        "'speaker_2': 'To ask our City Council and Mayor to adopt the people's budget to ensure safety and health for our community in Long Beach. We want our city to be safe and free from violence. Then we need to stop using violence to end violence.'",
        "'speaker_1': 'Because we cannot.'",
        "'speaker_2': 'Expect to stop the fire by using more fire. And so we need more resources of.'",
        "'speaker_1': 'Care if we want a healthy.'",
        "'speaker_2': 'City. And I know that all of you want that for our community. And I love Long Beach because our community here is strong and compassionate. We take care of one another and you see that through this pandemic year.'",
        "'speaker_2': 'So if our city gives more resources to our community by divesting funding from the police department, our community can protect and take care of one another. Well. So this is a sustainable way to ensure public safety and public health.'",
        "'speaker_2': 'In particular, we need more investment to address the housing crisis in Long Beach as we talk about this tonight. Just a 2% cut in the police budget could fully fund a ten and right to council program that could provide legal defense and protection for 1700 families, which would prevent homelessness.'",
        "'speaker_2': 'So this is a great opportunity for our city council to take bold leadership and to lead with the values of care and equity.'",
        "'speaker_1': 'Thank you. Margarita Valenzuela City. Gabby.'",
        "'speaker_2': 'Vicky.'",
        "'speaker_1': 'Tanisha. NAB. Christianson.'",
        "'speaker_2': 'Good evening, Mayor and council members, city manager and city staff.'",
        "'speaker_1': 'My name is.'",
        "'speaker_10': 'Margarita.'",
        "'speaker_2': 'Valenzuela and I'm an organizer with the Long Beach Coalition for Good Jobs and Healthy Community. We are calling on Mayor Garcia and all nine city council members and the city manager to adopt the people's budget for fiscal year 2022 and structurally reform the city budget process to enable earlier and deeper participation for marginalized communities who are most'",
        "'speaker_2': 'impacted by budget decisions. We believe Black Lives Matter and all our communities cannot wait any longer. We demand support, legal representation for immigrants by boosting funding to be through the Long Beach.'",
        "'speaker_10': 'Justice Fund.'",
        "'speaker_1': 'To provide.'",
        "'speaker_2': 'Free, universal legal representation to immigrant residents facing deportation. I have personally spoken to community who continue to struggle to find the resources they need to stay in Long Beach. Expanding the justice fund will only help more families who are struggling because of the pandemic.'",
        "'speaker_2': 'We ask you to support the demands of the people's budget. Thank you.'",
        "'speaker_9': 'First off, I want to thank you, Mayor Garcia, and council members, for your time. My name is City Men and I am part of the Long Beach Immigrant Rights Coalition. I'm here to express to the Lonely City Council members why it's important to defund the police and adopt the people's budget.'",
        "'speaker_9': 'Does the police department really need more money? No. I heard one of the reason to build a more diverse police force, and that is not in keeping our communities healthy. To keep our community healthy, we need to invest in it.'",
        "'speaker_9': 'We need to invest in the community. We need to defund the police for no less than 25% and give it to programs that will keep the community healthy. Adopt the people's budget, which is needed. There are other programs like housing assistance, providing legal counsel and providing funds for immigrant communities.'",
        "'speaker_9': 'I am impacted immigrant and I'm letting you know right now that the community needs the fund, not the police. So let us defund the police department and use it for the people budget. Use it to reinvest in the communities, the marginalized communities, the communities of color.'",
        "'speaker_9': 'Thank you for listening. And I hope and pray that you would take steps to support our community. Thank you.'",
        "'speaker_2': 'Good evening. My name is.'",
        "'speaker_1': 'Gordon Anders, and I'm the executive.'",
        "'speaker_2': 'Director for the Long Beach Immigrants Coalition, a member organization of the People's Budget, Long Beach. First, I want to thank the Council for Investing in the Justice Fund, allocating additional money from the American Rescue Plan to make this program better.'",
        "'speaker_2': 'The immigrant community in Long Beach deserve this. However, I also want to express my frustration and disappointment in seeing the proposed increase in funding for the police department. This now means we're spending over $700,000 a year a day in policing again, 700,000 a day in policing.'",
        "'speaker_2': 'Rather than focusing on the root causes of increased violence and economic crisis, skyrocketing gun sales and an increased pressure on communities already pushed to the brink of survival. The systems, the symptoms being used to justify pouring more money and more resources into policing, policing instead of community based safety strategies.'",
        "'speaker_2': 'Cops do not keep us safe, nor do they stop violence. The best way to reduce violence and increase safety is to increase access to health care, housing, mental health care, education, sustainable and living wages and community care, connection and programs.'",
        "'speaker_2': 'It's time to recognize that decades of pouring more money, resources and legitimacy into policing and effort to increase safety have failed because policing is functioning as it is intended to do, which is to contain control and criminalize black and brown communities right near them.'",
        "'speaker_2': 'Thank you. Hello. My name is Vicky and I am the rapid response coordinator for the Long Beach Immigrant Rights Coalition. I'm here today alongside my community, to demand that the city council defund the proposed police budget by at least 25% and invest those funds back into the people's budget.'",
        "'speaker_2': '25% of the police budget is $65 million. Imagine what this money can do for a community. Imagine this money invested into affordable housing as the rapid response coordinator. I wish I had the opportunity to coordinate and fund a fund made up of private donations.'",
        "'speaker_2': 'Not federal, not state and not city, but private donations. Do you want to know what the biggest need from those applicants were? Rent. I ask how in the middle of a pandemic did the city offer so little rent relief to our communities?'",
        "'speaker_2': 'Who needed it most? Again, imagine the support the city can provide to families if we defund the police and reallocate those funds to community. I also heard today that there is a concern about communities that are about community members that are chronically homeless.'",
        "'speaker_2': 'I want to ask how many council members members have actually talked to members of our community that are unhoused? If you had, you'd understand that it's not just about getting a roof over someone's head or placing someone in a hotel room as Project Homekey does.'",
        "'speaker_2': 'If you've ever spoken to an unhoused community member, you know that they're just trying to survive the day. So we need to invest in programs like mental health care, detox food and direct cash assistance. Again. Least by at least 20.'",
        "'speaker_1': 'Station. NAB Christianson. Alia. Ramirez. Jessie. Alka. Abraham Zavala and Juan and Vanessa, please line up. Elliot. Jesse Abraham. And I'm Vanessa.'",
        "'speaker_2': 'Hello. Good evening. My name's Vanessa, and I am part of the Long Beach Immigrant Rights Coalition to damn.'",
        "'speaker_10': 'Demanding that the Long Beach.'",
        "'speaker_2': 'City Council defund the police and adopt the people's budget. The police department does not need any more money. Instead, we should be investing in the community. Investing in the community hubs, decreased crime, investing in the police department creates fear in our community.'",
        "'speaker_2': 'They use technology that targets minority communities, although the police department says that they do not share information with Immigration Customs Enforcement.'",
        "'speaker_10': 'We know that the.'",
        "'speaker_2': 'Contractors carry license plate readers and facial recognition that is shared with them. I asked that police. I ask why the police need such a huge chunk of.'",
        "'speaker_10': 'Funding for tools that have been proven.'",
        "'speaker_2': 'To be racist, abusive, invasive and efficient. Long Beach is a wonderful city that prides itself on being friendly and diverse, and let's invest more into our communities to create a safe and welcome welcoming place for everyone by investing in education, childcare, and affordable housing by defunding the police.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_8': 'Good evening.'",
        "'speaker_4': 'My name is Abrams, Apollo organizer with Long Beach. Residents Empowered. We're part of the people's budget as well, the People's Budget Coalition. Just to talk a little bit more about what we're asking, why we're asking the reallocation of funds to already overly funded department, to put that into a lot of the things that we need in the'",
        "'speaker_4': 'communities. So just to give a picture, right, when we say to meet the gap of what it's being proposed already for the rental housing division. Right. To meet those gaps. It would it would be the not invest in 1111 more cops on the street right to think about one we would take to meet the gap for right'",
        "'speaker_4': 'to council the right for tenants to have someone to defend them in eviction court and things like that. Not investing in 33 more police officers would help you meet that gap to fully fund the right to council program.'",
        "'speaker_4': 'And lastly, the idea of lack of ownership, right ownership in our communities, community land trusts, the ability to create permanently affordable housing while allowing low income residents to build generational wealth as homeowners not investing in 27 parks and investing fully right in TLT, that's the amount we're talking for.'",
        "'speaker_4': 'So it's possible, it's possible to reimagine how we allocate wealth, money into our communities. And on those three points, I want to just speak on that as as myself. I always like to make comment on behalf of Jesse whenever possible.'",
        "'speaker_4': 'Should I do that now or. Yes, Bear, should I just tell callers in here? But I want to say something on his behalf as well.'",
        "'speaker_0': 'Okay. I'm going to go ahead and do it. Typically, the council of people have to be here, but I'm going to do it to just please.'",
        "'speaker_4': 'Be sure it'll be two people off the list, Jesse and Eli. So Eli is a street vendor. He also wanted to be here tonight to talk about the idea of law enforcement. Right. Recently, street vendors have been given misdemeanors.'",
        "'speaker_4': 'And as you all might know, SB 946 has been in politics. A state law expressly prohibits the criminalization of street vendors, yet the health department and the Long Beach Police Department have threatened street vendors with with misdemeanors. So he wanted to talk about that, his ability to feel fear, to go out and strip and knowing that that'",
        "'speaker_4': 'would cost him the ability to pay rent. Which leads back to the idea of we're talking about now, right, the idea of rental defense and all these things. So I just want to illustrate, there are so many things that when we talk about reallocation of money, right.'",
        "'speaker_4': 'Giving folks opportunity to have a legal counsel could make such a huge impact. So he wanted to come here today and also talk about that and general comment and also for this piece. So thank you.'",
        "'speaker_1': 'We have eaten. Elsa Tom James was on. Kevin, Georgia. Tina True and Marlene Alvarado.'",
        "'speaker_4': 'Good evening to everyone in attendance. My name is Irene and I'm a community member here to support the people's budget. Heavily policing our communities does not prevent crime. Healing and care prevents crime. And as a city, we have to invest in the betterment of our community, not fund more policing to lock up our community members.'",
        "'speaker_4': 'We must move forward today to make sure that we create stronger, productive and safer communities. And this begins by funding the request of the people and not law enforcement. My first interaction with law enforcement occurred when I was eight years old.'",
        "'speaker_4': 'My pregnant mother and I, alongside my family, were removed from our home at gunpoint. My second and third interaction occurred when I was ten and then 11 years old. And just like the first one, me and my family were removed from our homes at gunpoint, all on a mistaken identity and all before the age of 12.'",
        "'speaker_4': 'For the last 17 years of my life to present day to day, I have been on some kind of police supervision. And it's absurd to see that we'd rather fund law enforcement than to actually allocate some of the money to our underserved communities to things like housing, mental health and social workers.'",
        "'speaker_4': 'It is also disappointing that as a teenager I had more contact with police officers than I did with youth centers and resources. And this will be the norm when we continue to allocate majority of our funding to policing.'",
        "'speaker_4': 'I urge you today to adopt the people's budget and I asked the lines of law enforcement and the police departments to really serve. But I mean, really serve and protect.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Good evening, honorable mayor and council members. You are being distributed. The people's budget that has been referred to so many times tonight. My name is Ailsa Chang, seventh district resident member of the People's Budget Coalition. So we know that 83% of DPD budget goes towards compensating the the city's more than 850 cops.'",
        "'speaker_2': 'We know that according to our analysis of transparent California data, the average total compensation for an LBE PD officers about 250 $215,000 a year. So knowing all this, let's do some simple math. Removing just 33 cops would fully fund the tenant right to council program.'",
        "'speaker_2': 'Removing just 27 cops would fully fund the establishment of a community land trust for permanently affordable housing. Removing just 20 cops would fully fund youth recovery, especially for transitional aged and disengaged youth. Removing just 15 cops would fully fund the city's language access policy.'",
        "'speaker_2': 'Removing just 11 cops would fully fund a rental housing division. Removing just ten cops would fully fund the Health and Aging Center in the Health Department. Removing cops would allow for the exponential expansion of the Health Department's reach team we all heard about earlier tonight.'",
        "'speaker_2': 'Council members like Long Beach needs care, not cops. Let's divest from harm. Invest in healing. Defund LAPD by at least 25%. And adopt the people's budget. Thank you. Hi. My name is Running Alvarado. I'm with District One. I'm here to support the people's budget.'",
        "'speaker_2': 'I know you guys have tried to do a lot of stuff in social programing. I saw what you told us about, but you're always crying about your. I said there's not enough money. I really do think and believe and know that we need to divest the money from the police in order to reinvest in our communities.'",
        "'speaker_2': 'It will really increase better. It will really increase the access and help that people need. And once again, when the majority of our our police, our money goes to police departments, like 42%. Let's look at it. It is basically a police state.'",
        "'speaker_2': 'We are paying more money to the police and it really is a police state when you're not putting enough money into social programs and education and all that. So please fund the people's budget. Thank you very much.'",
        "'speaker_4': 'Hi. I'm Kevin Yeager, District one resident here to support.'",
        "'speaker_6': 'The people's budget.'",
        "'speaker_4': 'Like others have said, cops don't stop crime. Repeated analysis fails to find any connection between the number of police officers and crime rates because cops are violence. Workers showing up after harm has already been done to punish and incarcerate.'",
        "'speaker_4': 'Instead, we can respond to violence without police terror by funding the community led alternative emergency response teams called for in the Race and Reconciliation Report. We can fund public safety by addressing root causes of violence, funding, affordable housing, education, jobs programs, health care, youth programs actually addressing poverty.'",
        "'speaker_4': 'And that 26.2 or twice 262 million figure doesn't even include money. Our city pays out in lawsuits over lbe PD uses of excessive force and shootings every single year 32 million since 2014. There's not enough.'",
        "'speaker_6': 'Time to touch on all the ways LAPD avoids accountability from Tiger text, turning off body cams, implementing drone.'",
        "'speaker_4': 'And facial recognition surveillance technology without any policy governing its use. Sharing license plate data with ICE, destroying records, shooting at protesters and journalists.'",
        "'speaker_6': 'Alvi plays stranglehold over city politics on and on.'",
        "'speaker_4': 'Defund LAPD start with 25%.'",
        "'speaker_9': 'Good evening, Mayor. Members of the city council. My name is James Watson pronounced I'm his and I'm a resident of the third district. And speaking on behalf tonight of Long Beach Forward, I was talking with a neighbor of mine the other day about how people respond to a pandemic primarily in three different ways avoidance, denying that it'",
        "'speaker_9': 'exists at all. Scapegoating, often blaming people who are different than us or fixing it. Accepting a pandemic for what it is. And actually getting to solutions. So I'm proud to be part of the Long Beach community that is fixing it, not just the people behind me, but all of us who are doing our part to get people'",
        "'speaker_9': 'vaccinated and talk about community led solutions. The Council has also accepted this for what it is the Recovery Act, hero pay, tenant protections, all of that. So to be honest, I'm lost hearing and wondering and hearing these presentations why a year and a half into the global pandemic?'",
        "'speaker_9': 'And we still haven't structurally invested in our highly regarded city run health department that is actively fixing our public health crisis and increasing funds to the police department that refuse to even acknowledge the severity of a global pandemic and actually get vaccinated.'",
        "'speaker_9': 'So if we're in a public health crisis, we must have a public health response. And as it currently stands, the biggest threat to public health in Long Beach apparently is public safety. So this is why I'm proud to be part of the fixers, like so many of the community who are behind me here tonight, advocating for bold'",
        "'speaker_9': 'solutions like the people's budget and asking you to divest from the police department and invest in departments and programs that actually keep people safe, can empower people out of poverty and into opportunity. So please support the people's budget.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Is China transgender?'",
        "'speaker_1': 'Tina True. That concludes the public comments.'",
        "'speaker_0': 'Thank you, Madam Cook, and thank you to all the members of the public. We're going to go ahead now and turn to the Lombard City Council. This is a hearing. So this is a continuation of the of the budget hearing.'",
        "'speaker_0': 'There is a motion in the second to continue the budget hearing, as we do at these meetings. I want to start off with Councilman Brosnan.'",
        "'speaker_4': 'Thank you, Mayor. I'm going to pass right now Councilman Mongo.'",
        "'speaker_2': 'Thank you. I want to thank the community for showing up tonight and sharing your ideas, bringing in additional materials. I know I've met with some individuals and received many of your emails. We appreciate the input and there's a lot of work still to be done in Long Beach.'",
        "'speaker_2': 'And I think you should celebrate many of the successes and continue to provide the pressure because there is more work to do. So thank you for taking the time to bring thoughtful comments. I know the council meetings can be long and we appreciate you sharing with us.'",
        "'speaker_2': 'There's a lot of important things that try to get done at this dyas and. Your input and support is appreciated to our police department. It's been a it's been a long year and a lot of changes and a lot of growth.'",
        "'speaker_2': 'And we appreciate the work that you continue to do. We know that there is a difficult. Road ahead in terms of resources and needs. I think that there are tools that have been discussed by this council that really provide a different methodology for supporting.'",
        "'speaker_2': 'The community and our officers. And I know that this council has talked a lot about our body worn camera program, but we've also talked a lot about our Arabs division and other divisions that really support safety differently and more effectively.'",
        "'speaker_2': 'And so I look forward to hearing how those partnerships and transitions impact and support our police. I think that it is important to note that. A lot of our violent crime happens in our most disadvantaged communities. And working through the creative programs that and Day House has partnered with in terms of the the police officers walking in'",
        "'speaker_2': ', getting to know the community. I've seen. And I heard amazing things. And I look forward to seeing how the new programs that you've brought forward with the additional funding will develop. But we also have to train the next generation of police officers to be in alignment, to replace and really change the culture.'",
        "'speaker_2': 'And to do that means funding an academy and ensuring that our officers are not overtired and making big mistakes and saying the wrong thing in the community because they're exhausted. And in a position to do something that's not good for them or the community.'",
        "'speaker_2': 'And so I look forward to hearing our solution for how we make sure that we're not leaving our officers in a position where they're working. Double overtime shifts because that the person that I am when I work would exert a large amount of overtime is not the person that this community can partnership effectively.'",
        "'speaker_2': 'So I'll just continue to say that we need to find that funding needs to be available. And I don't I don't see any way around that. That's for our health department. Thank you for an exemplary presentation. You guys continue to do a lot with very, very little.'",
        "'speaker_2': 'I appreciate the work that you've done and expanding a lot of our grant programs, and I really look forward to a day where we do a better job partnering with the major foundations for more consistent ongoing support. I know that.'",
        "'speaker_2': 'Taxes can't pay for everything. And we've gotten creative with some different funds that are available and made those investments. But we need more money. And I think that we need to work together to find where those can be and if there's a department that goes after grants, effectively.'",
        "'speaker_2': 'Yours has been a lead. And then. Theresa, I know you're out in the field, in the community area, and the work that you're doing is phenomenal and you should be recognized. You've really changed the face of how we interact with the community, and I want you to be appreciated and I want you to know how much your'",
        "'speaker_2': 'heart we hear and how we really we try to meet with as many community members as we can. We know you meet with more. And I think you do an excellent job of bringing forward and consolidating those ideas into solutions in a meaningful way.'",
        "'speaker_2': 'Thank you for all that you've done. You've been an amazing, amazing leader through this year, and I look forward to seeing what you do next as long as it's here in Long Beach.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_3': 'Yes, thank you, Mayor, and thank you, chief and Assistant Chief, for your presentation. And I just want to say thank you to all the speakers and the faith leaders that came out. I know many of you personally, and I know we have a lot of work to do.'",
        "'speaker_3': 'And there's a there's a lot of programs that are important that we need to continue to work on. I'm to the police department. I just want to thank you and the officers or all the work that you have done in the past year.'",
        "'speaker_3': 'I know it's been tough. You know, for those of you don't know, I was a police officer here for many years and I was seriously injured in the line of duty. I have rides and pins and other people's bones in my back.'",
        "'speaker_3': 'And I can imagine being a police officer today in this environment. I felt the pain of having a coworker. Friend murdered in the line of duty. I felt the pain of having a classmate and a friend kill himself.'",
        "'speaker_3': 'This is a tough this is a tough job mentally, physically and spiritually. Definitely don't have to tell me how tough the job is because I know. I am really concerned about the mental health of officers. The sheer. And I sure hope that we are doing everything that we can do to address that.'",
        "'speaker_3': 'One of the things that you talked about, Chief, that I was. You know, I know that we need to continue to expand. Our visibility and our presence. We've got work to do in the community. We need sincere engagement.'",
        "'speaker_3': 'Getting back. We need diversity. One of the things that I like to say is I was raised you know, I was born here and I went to Poly Am from the community. And being a police officer here really helped.'",
        "'speaker_3': 'And I think it's important when we look at diversity and local hire because we have to mend a lot of bridges and and relationships and and and we just have to continue to be to focus on, you know, transparency and accountability.'",
        "'speaker_3': 'One of the things that we have seen is, you know, the crime rate has continued to increase in our neighborhoods. And we see that in the data. I know that your coordinator response teams have done an excellent job with the gun violence, and I've definitely seen seen a increased presence, you know, and in our district.'",
        "'speaker_3': 'I don't think that it's a good idea for us to live with any fewer officers. It's just putting more strain on the officers that are currently out there. So I, I know that Councilwoman Margo did talk about recruitment for for 2020.'",
        "'speaker_3': 'So I definitely would like to hear more about that. And I do want to speak when I have a minute and a half left about the councilman.'",
        "'speaker_0': 'There was a had a couple suggestions from a couple of members because it's a budget hearing and there's two departments to extend the time for council members for questions or comments. And so instead of queuing up, if you want to extend your time, feel free to do so.'",
        "'speaker_0': 'Just we'll try to stay as close to post 5 minutes as possible. Will extend it.'",
        "'speaker_3': 'Okay. And I'll I'll be I'll be brief. One of the things that I you know, I am a huge advocate for the for the helicopter. And. You know, as a as a policewoman out there, there was nothing better than hearing the blades up above knowing that they were coming.'",
        "'speaker_3': 'I worked a one person Unit one Adam six for a lot of my career and and I can tell you the the police helicopter is really important for de-escalation. There were times even when police pursuits we could call those off, which is, you know, safer for the community having that that resource.'",
        "'speaker_3': 'I definitely didn't. I think putting a civilian up in a helicopter, replacing a police officer is absolutely crazy to me. It's like it's like asking Uber or Lyft driver to drive you around. You know, it just it doesn't make any sense to me.'",
        "'speaker_3': 'And so I just want you to really consider that, you know, an officer has somewhere and you can correct me, but, you know, 3000 hours of training, they understand tactics. You understand police procedures. They can give really good direction to officers on the ground.'",
        "'speaker_3': 'And I think that's really important.'",
        "'speaker_0': 'Excuse me. And so it's actually time that we've extended the time. We're fine, thank you. Great, councilman.'",
        "'speaker_3': 'And so I think that that is it's it's just, you know, the good direction on down the ground is really important. And so I just want to leave you with I think experience matters. And I'm just not a fan of considering any civilian to do that job.'",
        "'speaker_3': 'So I'm going to go back to a question that I had on. Can we talk a little bit about what's the estimate for recruitment in 22?'",
        "'speaker_6': 'Mayor and members of the city council. We're working with the Civil Service Department. I think most of you are aware that civil service is the department that takes the lead in doing recruitment and promotional testing for all the city departments, not just the police department.'",
        "'speaker_6': 'We currently have a list of interested police recruits and we're working with them on looking at that list. We are pushing for a new list to come out. What we find is every time we go out and recruit, as time goes on, we evolve.'",
        "'speaker_6': 'The community demands more. As you've heard tonight and and honestly, as we look at putting together a new list, even the list of demands that we're asking for, for our new police recruits change and which I think makes a better police officer that serves this entire community.'",
        "'speaker_6': 'So those are the things we're working out with civil service right now. We're putting a lot of demand on civil service, as other departments are. And that's why I'm pushing we are pushing for a class sometime in the fall, maybe early winter.'",
        "'speaker_6': 'So it is on the top of our priority list. But having officers that match the values of our community, all of you and the diversity that we all seek is a very top priority when we're looking for police officers for the city of Long Beach.'",
        "'speaker_3': 'Okay. All right. Thank you again, Chief, for all that you do.'",
        "'speaker_0': 'Thank you, Councilwoman Vice Mayor Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And first, I think that was a good call. This is dense, dense stuff. It's, you know, two departments. I'm going to try to get this all in in 5 minutes, no more than seven. But this is an instance of.'",
        "'speaker_4': 'Thank you, Mr. Mayor, following that for flexibility to Councilwoman Allen. So first I had to step out earlier, but I heard the introduction. And to step out and call the kids and tell them. Night. But I heard it on TV.'",
        "'speaker_4': 'Mr. Murdoch, I think the way that you help frame this, I think is important. You said we heard from the community last year that is enshrined in a document, the reconciliation initiative. And here's the progress that we've made on many of these priorities that were not priorities prior to hearing it from the community.'",
        "'speaker_4': 'The REACH, innovation, this strategy, the community came out early and said, Hey, we want to see something similar to cahoots. It doesn't have to be cahoots. Make it your own Long Beach model. That's in its budget today. The Office of Youth Development was called out in the reconciliation plan.'",
        "'speaker_4': 'That is an action that is funded through reconciliation hours that is here today. The youth fund made possible by Measure USA that is here today. The violence prevention were incredibly important to many members of this council, a great plan that did not have funding.'",
        "'speaker_4': 'It is here today in this budget. It's in the recovery budget. And it was in last year's budget. The Health Equity Center called out in the in the reconciliation plan. It is here. It's funding early intervention strategies. A big theme.'",
        "'speaker_4': 'It's here. Alternative response models. It's here. Lots of discussion on diversity. I tend to agree. I think one of the best things we can do is make sure that our police officers and all of our city employees come from our local community.'",
        "'speaker_4': 'That takes investment, that takes focus to place that as a priority in our academies. And the best way you can build relationships with the communities, making sure that our new recruits that are coming in are from our local community.'",
        "'speaker_4': 'That's important. That's key. All of that is in that in this budget, all while managing 250 additional staff on COVID in our health department. I remember I was joking a bit earlier. I remember when the Health Department had to ask to do a budget presentation that council had to request it.'",
        "'speaker_4': 'Tonight, the budget for tonight's budget presentation, the health department is giving a presentation alongside the police department. That is an incredible change. And I've watched every budget process since 2010 without any request. And this is I'm seeing a dramatic, dramatic shift here from asking to hear about it to receiving this information in a in a healthy report'",
        "'speaker_4': 'on what's happening. I'll tell you, I read the people's budget every year and I try to attend. You know, the people stay in the city and hear the words every year. And we make strides to hit every category in many, many categories every year.'",
        "'speaker_4': 'And and we try to do that this year. We look at it, we meet with the community. I think the major difference and and I think it's it's clear a major difference isn't that that the categories lifted up aren't are ignored because they are reflected.'",
        "'speaker_4': 'And we talk about what the levels are. But, you know, there is a justice fund, there is, you know, strategies around language access, there's a youth fund. These are things that have been priorities for many, many years. I think the difference is the request in a budget this year is $65 million.'",
        "'speaker_4': 'And. It makes it very difficult to achieve the scale of the investment that people are looking at. And I think we have to be honest about what long term investment looks like for the sake of actually being able to deliver a budget that's reflective of of, you know, our diverse interests within our city.'",
        "'speaker_4': 'And so $65 million is dramatically higher than any other people's budget request in the past. And I think that is needed to be said, I think, in terms of our health department. And thank you. I see everybody is up here.'",
        "'speaker_4': 'A great presentation, a lot there. A few things I want to give some input on. First, thank you for including the conversation on Measure US. We're excited that that's here. That's a significant enhancement. I'm glad to see some focus on older adults in the health department.'",
        "'speaker_4': 'That's been a priority the council for many years, but we have not had funding to implement that and it was great to see that there. Secondly, you know, there's a lot of conversation with the youth in the community.'",
        "'speaker_4': 'They've been advocating a youth fund for many, many years, and I'm a big proponent of this from the very beginning. But what I see in the youth fund is about 26% of that funding going out to the community, about 74% of that.'",
        "'speaker_4': 'He retained, you know, being retained by city staff. And I think we have to invert that. I think we want to see, you know, 20% retain 20, 20, 25% retained, but the great majority going out to community based organizations to use serving organizations and allow them allow the youth the way in through a process.'",
        "'speaker_4': 'And we'll continue talking with youth, but we really want to see that are youth. Finally, we can stand up, put out to the community and actually support, you know, youth serving organizations. You know, let's say starting elementary school is doing their play and they need a micro grant to buy programs.'",
        "'speaker_4': 'We should be able to provide that. Let's say it's something like the Jordan High School Math Collaborative, a great program that struggles for funding every year. That's proven. Those are the types of things we'd like to see. Let's say it's youth sports.'",
        "'speaker_4': 'Let's say it's Pop Warner. Let's say it's midnight basketball. Youth organizations will tell you what it is that they need, and we need to invert that. The youth funds should be going out to the community, not being retained by city staff.'",
        "'speaker_4': 'And I feel and I'm sure more recommendations come out, but I really feel strongly about that. A good solid, you know, around the million dollars for youth is a great start for our youth fund. With, with, with. In terms of the police presentation, first, thank you for highlighting the response time issue.'",
        "'speaker_4': 'When I talk to my residents, a lot of times I hear as it relates to city services from street sweeping to trash collection. And I want the same level of service that other people are receiving in every part of town.'",
        "'speaker_4': 'And we've seen historically our response times in North Long Beach have been slower than other parts of town, particularly with fire, when we didn't have rescue 12. Now, I think we've maintained our overall response time. Can you speak to the response times?'",
        "'speaker_4': 'The PD, you know, Category one response times in North Long Beach, is that an average across town or is there a slower response time in North Miami? It's a real question that I receive from our residents that I would love to hear you address.'",
        "'speaker_6': 'Good evening, Vice Mayor. Thank you for the question. And I'm looking up on my form here. My stats reflect this. And this is from July of 2021, because our numbers are about two or three weeks behind always. So for July, for priority one calls in North Division, I show 5.1 minutes for priority one calls.'",
        "'speaker_6': 'Was that your specific question just for.'",
        "'speaker_4': 'And how does that compare to the three whatever? It's 5.1 in north real power. Well, the citywide average.'",
        "'speaker_6': 'East division, as an example, is 5.2. So it's a little bit higher. And you have to account for geography because the area is a little bit bigger, bigger, and it takes just a little bit more time to get there.'",
        "'speaker_6': 'So for example, in South Division, which is the smallest division but busiest in regards to calls for service, their priority one time is down to 3.9 and that's an average. These are all on the way.'",
        "'speaker_4': 'So North East may have a slower response time than maybe in the middle of the city.'",
        "'speaker_6': 'Yes, sir.'",
        "'speaker_4': 'Okay. That's good. That's good to understand. When I talk about this with our residents, proximity is important. Thank you so much. Just a couple of things I would say I love the discussion about making sure we're doing recruitment in our local community.'",
        "'speaker_4': 'I know we're talking about academies coming up. Can you speak just briefly about what efforts or what support you need to make sure that this upcoming class of recruits has a healthy amount of people from our local Long Beach community?'",
        "'speaker_6': 'Again, an excellent question. It takes every single person in this room between not only members of the city, employee, family, all of you as policymakers, our audiences, even the people who have very different opinions of the police. If if we go into a room and we're talking negatively about the police all the time, people of color, people'",
        "'speaker_6': 'we want from this city are going to say, why do you want to join them? And yes, the police department has the number one responsibility to make sure that we attract the right people for the right reasons. But I think all of us collectively as a community have to say, you know what, we want the best police'",
        "'speaker_6': 'department. We want a diverse police department. Let's try and work on our kids. And for us in the police department, we tell everyone, every police officer recruiting is everybody's job. Every time you talk to somebody, it's like an athlete, right?'",
        "'speaker_6': 'You're looking through the fence at somebody playing football. Somebody says, I want to be just like that. Same thing happened to me as a five year old. You know, not everybody like the police, but I wanted to serve our community and here I am.'",
        "'speaker_4': 'Well, we'll pick up that converse, that one final thing, because I want to wrap this. I want to wrap this up. We'll pick up that conversation line. The follow the the final thing I just want to say is that what I hear the common thread from public comment from my neighbors, from our city team, we want a'",
        "'speaker_4': 'healthy city. I hope the city has health department capacity. Not many cities have a health department. We do. I hope the city also means that we have a healthy police department. That means that means making sure that they're from our local communities.'",
        "'speaker_4': 'It means make sure that mental health is in a good place. There's a functioning relationship between community and public servants, from police to fire to health workers. And a healthy city means that we need to really make sure that we acknowledge we're all one city team in that city team.'",
        "'speaker_4': 'We need to be concerned about the mental health of our team members. We need to have one mission to deploy services. And so I want to take a moment to just, you know, thank our health care workers for this past year.'",
        "'speaker_4': 'I want to thank our police rank and file police officers for their work, because we're all one part of this effort to have a healthy city and a safe city. We all have a place, a role here. So let's keep working together for a healthy city.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilman, sir.'",
        "'speaker_2': 'Thank you, Mayor. So I just want to start off by thanking all of those who came to make public comment and, you know, just sharing your thoughts. I also want to share that this is this has been one of the toughest years of all of our lives.'",
        "'speaker_2': 'And I do agree with many of those comments saying that we do need healing. And I heard a member from Long Beach Immigrant Rights Coalition that we need to build trust. And I think that the other part is accountability as well.'",
        "'speaker_2': 'That I heard thread it through as far as and, you know, actions that are taken and what is the result of that to ensure that wrongs are right. And so and that we really need to work towards equity healing and renewing and restoring.'",
        "'speaker_2': 'Right. And investments needs to be made. I'm going to make some more comments before I ask my question for our police with our chief and then and with Kelly as well. But I really want to go back to building trust.'",
        "'speaker_2': 'I think that we need to continue to have the communication we do between all of us to ensure that we're able to address the hurt and the pain that's resulted in various ways from the past years. And the dialog does need to continue, and I hope we can do more of that in person.'",
        "'speaker_2': 'While the budget has brought us together in this way, I hope that it's not only the budget that brings us together in these conversations and that also accountability is really important and that we hope that we're taking the steps to showing you in the way that we're doing alternative response through reach, also in that we're going through'",
        "'speaker_2': 'a process to redesigning our Citizen Police Complaint Commission and that, you know, significant investment do need to be made into our community and a health department. And I believe that that is really what Gabby from Long Beach Immigrant Rights Coalition said earlier, that we have to invest in community base.'",
        "'speaker_2': 'I'm sorry. In my notes here, safety strategies. And I want to hear later on from the department, you know, how much money has been invested so far and how much is going into the community. But I really do think that, you know, this isn't going to be the only dialog we have and that we should continue to'",
        "'speaker_2': 'do so in different forms and more in person. The other thing I want to share that investments are being made is around, as the vice mayor shared earlier, around Office of Youth Development, also violence prevention funds as also distributed into our communities and Kami based organization.'",
        "'speaker_2': 'I also want to thank the Mayor for the guaranteed income pilot program that's going to be launching in the fall, that millions of dollars are going to the 90813, where it has the highest number of people living in poverty, particularly single parents.'",
        "'speaker_2': 'Right. So I do understand that we still need to go through this process in how do we continue to right the wrongs. But that also we don't also, you know, not see all of this investment being made. So my question kind of circles back to Chief Luna again.'",
        "'speaker_2': 'You know what? What is the police department doing to to build trust and ensure there is accountability in the actions of the police department? And then my question for Kelly, too, is how much how much money has been invested in the police department in this past year and how much of that is going into our community based'",
        "'speaker_2': 'organization? So first question is for a police department. Chief Luna, you know, what is the department? I think you shared some of it, but I think lifting it back again. What is the department doing to build trust in the community?'",
        "'speaker_2': 'Ensure there's accountability. And for Miss Canopy, how much has been invested from the recovery funds and how much of that is going directly into the community based organizations?'",
        "'speaker_6': 'A Council member sorrow in regard to the police department and trust. Simple answer. Actually, it's about relationships. It's about partnerships. Every day that our officers are out there and it's 24 seven. Every contact they make is built on trying to garner that trust because it doesn't work.'",
        "'speaker_6': 'And I believe based on surveys that we take, we're not a perfect department, but the majority of this community does trust us. There are incidences, of course, that have an impact on it. And then we have to come out and be as honest as we possibly can within the law and say, this is what happened.'",
        "'speaker_6': 'If it's a there's a problem, we're going to fix it. As far as accountability. If you look at every government agency, whether it's in this city or abroad, I don't know what other department holds themselves more accountable than your police department.'",
        "'speaker_6': 'The mechanisms that we have, whether it's internal internal affairs, every time we get involved in a use of force or an officer involved shooting the the critiques that take place internally, the level of, for example, just looking at stats coming in here, we're getting an average of 180 praise a month.'",
        "'speaker_6': 'Which, you know, in a way that's a good thing. And there are some people who are abusing the system. But for the most part, putting out information for us, our policies out on the Internet. And there's a whole list of things that we're doing today that we weren't doing, say, five years ago, and just trying to put'",
        "'speaker_6': 'out more information about who we are and what we do every day and really get to know our people on an everyday basis that we're no different than anyone else who's out there.'",
        "'speaker_2': 'You, Chief. Ms.. Kalb my question again are do you have the question? I just want to make sure I know you're sorting through it.'",
        "'speaker_7': 'So I think there there have been multiple funding streams in the past year. And so I think that, you know, the the first funding stream is around the racial equity and reconciliation funding, which came to the health department about 1.5 million of that approximately this year.'",
        "'speaker_7': 'I want to say about 400,000, just over 400 or $500,000 will be in the community by the end of by the end of this year, partially because we are you know, we have some delays in hiring and there's more resource available for the community.'",
        "'speaker_7': 'Generally, we're planning on $300,000 of that approximately going into the community each year. We also have the CARES Act funding, which we were able to do. If we look at all of the health equity and food security and early child and all those different pieces was approximately $10 million that went out in the past year.'",
        "'speaker_7': 'And then we are planning through the Recovery Act funding for about 1.5 million for youth development of violence prevention. And if we look at overall youth, it's 3.2 million going out, but there's approximately just over $3 million going out for around health equity from insurance and investments within the movie The Quinta and the Black Health Equity Collaborative'",
        "'speaker_7': 'and others. So there's there's different pots of money and that are all short term. They're all there are they're all 2 to 3 years old. The CARES Act was six months, but the Recovery Act is 2 to 3 years to be able to engage and invest in our communities.'",
        "'speaker_2': 'Thank you. And, you know, just last thing I want to add is that, you know, a lot of many of the items that are in the people's budget is, you know, we have been having those discussion and I want to make sure we do work, continue to work at ensuring we fund these different requests more and more'",
        "'speaker_2': '. But some of these are new that we've just funded, like the Camille Land Trust and that, you know, if it's not coming, there are alternate alternative ways to find funding for that through state, you know, ensuring that and then also language access and digital inclusion as well.'",
        "'speaker_2': 'There's a commitment to continue to have dialog, but we also have a deficit coming up. So I think that there's I think there is an understanding this is important and that we're committed and we have, you know, started the process in funding.'",
        "'speaker_2': 'And I think that it does it, you know, that there is a commitment to continue to do so. Thank you.'",
        "'speaker_0': 'Thank you. Next up, I have Councilman Austin.'",
        "'speaker_4': 'Thank you. I'm ready now. And thank you for indulging me. I was was paying attention to the public comment and and just kind of forgot that it was my turn to go. But I do appreciate all of the comment this evening and the presentation from staff on two very important departments.'",
        "'speaker_4': 'Pivotal department on critical departments for our city. I'm. And I want to appreciate my colleagues for for for pointing out, particularly in the people's budget, the fact that we as a council, as a city, have been taking into account all that we've heard over the last couple of years in terms of moving this city in and being'",
        "'speaker_4': 'more. More equitable and intentional. With what? Our service. I think. My biggest challenge and I'll just be be straightforward with our health department, with so much resources coming into the city. And I think every city is dealing with this as well, ramping up and having a capacity to be able to deliver the service that we want to'",
        "'speaker_4': 'deliver is going to be a real challenge not only for the city, but also for the community based organizations that we're going to be. Asking you to partner with us. Right. And I'd like to see a lot more energy being put into planning on how to deliver and deliver well for the city of Long Beach.'",
        "'speaker_4': 'Bottom line, all parties involved. I did have some some very specific questions regarding the budget. And so I'm going to get into that a little bit. And first, I want to talk to Ms.. Collopy and the.'",
        "'speaker_9': 'Health Department budget.'",
        "'speaker_4': 'Specifically related to. The administrative budget. In the executive office. Sorry about that. I'm in 520. There was 75 full time position, 75.6. That was adjusted in 21 and then in 20. There's a budget of 65 positions. But the the actual.'",
        "'speaker_4': 'The actual world budget is much different. Can you can you explain the variation? I think I'm on my way. May have the wrong one here.'",
        "'speaker_7': 'Give me. I come from? Are you. Are you looking at the difference between our f y 20 proposed?'",
        "'speaker_4': 'Sorry. I'm sorry. The Homeless Services Bureau.'",
        "'speaker_2': 'Oh, okay. So I was.'",
        "'speaker_7': 'Like, I.'",
        "'speaker_2': 'Executive Officer. Okay. Right. Right.'",
        "'speaker_4': 'Oh, so that there was a huge variation. It looks like we got probably an influx in 21 probably from. Take care that I guess.'",
        "'speaker_2': 'Uh huh.'",
        "'speaker_4': 'Um. But the budget positions from 20. From employee 22. Employee 22 or ten less. So the question is, do we that we lose positions or we're the positions that we're budget in and apply 20 not field.'",
        "'speaker_7': 'We certainly went through and during our fy20, we certainly went through a phase where we were we were having we had unfilled positions in FY 20. Um, although once it. In Fy20 we had unfilled positions. And so there and then in this area 21, we have significant increases in the number of positions through all of the grants'",
        "'speaker_7': 'and opportunities. So we've been hiring, you know, like a special project officer, the mental health services, the public health nurses and many more.'",
        "'speaker_4': 'Okay. I may want to dig in a little bit later on on that, just to understand then how we're funding positions and whether or not the positions are filled. I'm going to be really paying attention to that. And Councilmember, if I may, we do have our budget staff here.'",
        "'speaker_4': 'We record questions and then we can get at some of those back in writing. So if we don't have it tonight, just ask it and we'll make sure we get that to you. Thank you. And I'm not wearing my glasses because they're following up on me here.'",
        "'speaker_4': 'And then on to Councilmember Blackmon Richardson's point regarding the youth fund. I think he makes some great points about, you know, moving those funds into the community. And but I want to make sure that we are supporting community services and and organizations that are delivering in our city.'",
        "'speaker_4': 'Right. Programs that we know are working that that that have the capacity to deliver. We're not taking a chance on anyone. And I'm specifically call out, you know, the YMCA, the Boys and Girls Club. Um, I think he mentioned the math collaborative and I'm sure each and every council member can think of youth led organizations and youth'",
        "'speaker_4': 'organizations in their districts that are that are delivering and making a difference. I wanted to just get that in there. I think for El PD, complacency is not an option in any way and we have to continue to be innovative and engaging in the community.'",
        "'speaker_4': 'And I want to just. Thank you, Chief, for for your flexibility. I want to thank the department because you guys have been through quite a bit over the last year. Crime is is is I mean, if we this is a council that prides itself on making their data informed decisions.'",
        "'speaker_4': 'The data is not headed in the right direction right now. And what a lot of what I've heard this evening, it just would not, in my opinion, be smart or responsible for this council to entertain cutting our public safety budget at this point.'",
        "'speaker_4': 'So I want to be very clear that I'm paying attention. I'm looking at data, but I'm also hearing from constituents all over the district and all over the city. That might not be the best decision right now for for this council to move forward with it.'",
        "'speaker_4': 'So with that, we have made some decisions over the last year that have been impactful. I guess my question is to the city manager, to the chief, where are we at with our helicopter operations? As it currently stands today.'",
        "'speaker_6': 'Council member, Austin, thank you for the question. We have helicopter service up. It is vital to providing the best service that we can to our community. The force for our force multiplier it creates and the confidence it gives the officers on the ground.'",
        "'speaker_6': 'Not to mention to the vice mayor's point earlier about response time, that helicopter could be anywhere in the city within minutes over an incident directing units in and that is extremely helpful due to the reductions that the police department had last year.'",
        "'speaker_6': 'We did cut 51 police officer positions and part of those reductions was in that helicopter unit. So the staffing there was reduced. We did have to reduce a shift so there's less coverage in the city, unfortunately. We currently have two sworn police pilots that are in that unit and we have two tactical flight officers that are also'",
        "'speaker_6': 'in that unit. But we're looking at the budgets. Several of the council members have showed a lot of interest in and making modifications to that. So we are working with financial management in the city manager's office, looking at all of our options to potentially bring that service.'",
        "'speaker_6': 'I don't know if would be back to where it was, that would be optimal, but at least put it in a place where it's we're maximizing it as a community because it is an amazing tool.'",
        "'speaker_4': 'I think I'm looking for what's manageable. To maximizing. Not necessarily. I want to know what's manageable was immediate.'",
        "'speaker_6': 'When when we had six individuals in the unit. That was it wasn't 24 seven coverage. And optimally we'd like to have that thing in the air, 24 seven that provides the best service to the community. We can afford to do that.'",
        "'speaker_6': 'I understand that it puts all of you in a very difficult position. We're trying to maintain what we have now, which is most of that's unbudgeted. We're pulling from different places because as a police chief, I have to make decisions of where this department could be most effective with the resources that we have.'",
        "'speaker_6': 'So right now, having the two police pilots and the two tactical flight officers is basic, because beyond that, I'm really hurting us. If I take that out of the air.'",
        "'speaker_4': 'If I can add we did make a change last year. The original proposal was to go from six officers to two civilians and we started getting into the meet and confer. We did not change any service models until we've gone through meeting Converse and we're still at our old service model.'",
        "'speaker_4': 'But we determined that that was not a feasible approach. So we ended up adding that two police officers and PD cut other funding out of their fleet in order to to do that. And so that's all outlined kind of in the memo.'",
        "'speaker_4': 'So we're back to four officers I'm sorry, two officers, two civilians. And what's under debate right now is, do we keep the two civilians? Do we convert those two officers? Does the council want to go beyond that? It's probably about 120,000 to convert the officers or civilians to officers and go to four total sworn.'",
        "'speaker_4': 'If we're adding back two more positions, that's probably in the $580,000 range as an addition. I have a few questions as the mayor. You know, Mark, so I heard you talk about the recruiting class and and the academy and and making changes and new recruits are going to be asked to be different types of officers.'",
        "'speaker_4': 'Has the has the job description for for for the police department and for new police officers changed at all in the last year?'",
        "'speaker_6': 'Absolutely. Yes. And and it's because we listen we listen to our community. We listen to each and every one of you as what our expectations are of a police officer. The world evolves. We have to pay attention to what's happening not only in Long Beach, but across this country.'",
        "'speaker_6': 'We listen, we're evolving and we're going in the right direction.'",
        "'speaker_4': 'And to that point, there are can you explain that the BEREC, the Recruitment and Advancement Committee, and who is that comprised of and recruitment advancement will will will help interview potential new officers in the academy. Is that correct?'",
        "'speaker_0': 'Thank you, Councilmember. So there's a couple of things there. The, um, the recruitment group, working group takes a look at they work with civil service. So it's two part because civil service is part of the recruitment initiative. But the recruitment working group looks at its internal to the department, but it looks at ways to improve the diversity'",
        "'speaker_0': 'within our organization, how to reach areas that traditionally and historically we haven't been able to reach and increase recruiting that way. So there's a couple of things that will take some time to move forward. We're operating off of a current list with civil service, so we'll try to select the best candidates possible off of that list with'",
        "'speaker_0': 'today's criteria that that the chief was just talking about. So the recruitment group will be looking at diversity, mentoring, leadership internally and externally.'",
        "'speaker_4': 'Thank you so much. And my final question and thank you for indulging me related to your budget. I do see a. An ad or an upgrade from a lieutenant position to a commander to serve as chief of staff could explain how and what we're doing there.'",
        "'speaker_0': 'Thanks, Councilmember. The the upgrade for that position was we were operating off of an old program where we tried to change the staffing model within the chief's office to a lieutenant as chief of staff and realized that that was not a feasible option based on the scope of the duties and the requirement for that particular position.'",
        "'speaker_0': 'So we used some cost savings to create, um, a, to bring back a commander.'",
        "'speaker_4': 'Position as the chief.'",
        "'speaker_0': 'Of staff move it from. We were using an Internal Affairs Commander to cover both Internal Affairs and the Chief of Staff responsibilities in the interim. And so we have now our Chief of staff back at a commander position.'",
        "'speaker_4': 'Thank you for that explanation.'",
        "'speaker_6': 'And I just wanted to add and it goes back to Councilwoman Sorrels question about accountability. Accountability. The demand for accountability has never been higher. And some of these upgraded positions were putting people in positions and at rinks where we can.'",
        "'speaker_6': 'Absolutely there's more oversight, more accountability, more transparency. And these positions help us to increase that.'",
        "'speaker_4': 'And looking forward to having more conversation. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor, and thank you to both departments for your presentations this evening. I thought they were very informative, and I think the conversation that we've had and are continuing to have is is going to help inform some good decisions.'",
        "'speaker_2': 'I think we can all agree as a council and I think the majority of constituents, that it's important for us to have balance when we're talking about public safety. There's a whole aspect to preemptive efforts to help shape public safety and opportunity and access and those kinds of decisions, especially for our youth.'",
        "'speaker_2': 'But we also have a reactive need for public safety that's also essential and important. And I think everybody everybody would agree with that. In terms of preemptive, you know, I want to commend our health department for really leading and a lot of the new initiatives that we have initiated over the past year to three the last 1'",
        "'speaker_2': 'to 3 years. In terms of our youth, we've we've initiated a lot of violence prevention initiatives, which I think are great and programs I would like to see moving forward some more youth mental health initiatives. As someone whose son's best friend committed suicide three weeks ago in purple states, who was suffering from mental health issues that were'",
        "'speaker_2': 'exasperated by the. Isolation experience during COVID. I think we need to be having more conversations about mental health. And I also think we need to be having more youth opportunities to have conversations about substance abuse every single day.'",
        "'speaker_2': 'In the line of work that I'm in, I see people get involved with substance abuse in a way that that they don't think it's going to affect their life or grab a hold of their life. And it does.'",
        "'speaker_2': 'And sometimes it does so very quickly, depending on what it is they're using. And the prevalence of fat now that we're seeing being used today recreationally and the fentanyl that we're seeing being mixed with other drugs is is is.'",
        "'speaker_2': 'Absolutely. Unbelievable. When we were talking with all these conversations about homelessness and transient activity, the the opioid use and the fentanyl use that we're starting to see locally and regionally is it's very concerning. So I would love to see some preemptive programs that address mental health and substance abuse as part of our, you know, initiatives for reallocating'",
        "'speaker_2': 'money. I think those I absolutely agree with a lot of the public comment. We need to pour money, more money into mental health, substance abuse and treatment, preventative. But I also think on the other side that we need to also be prepared with some of the reactive public safety necessities, like when people call the police, they do'",
        "'speaker_2': 'expect the police to arrive within a reasonable period of time. Every single one of our residents wants that. And I'll tell you today. I had no intention of doing this. I had a full day of meetings, but I spent from 9 a.m. to 12:00 today with a victim who is the DOCA applicant, and I helped her apply'",
        "'speaker_2': 'for a U visa this morning and I walked her down to court and I helped her apply for a civil restraining order because she is the victim of domestic violence. And her frustration is that when she calls the police, don't do anything.'",
        "'speaker_2': 'The police don't come. This is not in the city of Long Beach. But the point is those people deserve public safety protections as well. They are residents of our city. And when they when they are victims of crime and they call, they have no one else to call when they feel like they're going to be attacked or'",
        "'speaker_2': 'assaulted. And when they call 911, they should expect that the police are going to arrive in a reasonable period of time. And for me, you know, it's it's one thing for us to make assumptions about response times throughout the city.'",
        "'speaker_2': 'But what I'd like to know is who's doing better response times than Long Beach and what can Long Beach as a city together, not district by district, but together. How could we get better response times for the whole city?'",
        "'speaker_2': 'For me. I'll tell you, most of my residents are paying prices for their homes that are equivalent to the city that's 1.8 miles away, SEAL Beach. There, their housing prices are very similar. They want response times like SEAL Beach.'",
        "'speaker_2': 'That's who they're comparing themselves to. I know that's not realistic. The cities are different. The demographics are different. But I think whether it's north, east, southwest, it doesn't matter. Every district, every division wants better response times, because although we don't want this to happen, I think everybody, even the folks that want to route money away from the'",
        "'speaker_2': 'police department also want to be able to look at people in the face and say when you feel like you're in danger and you feel you're about to get attacked and you have nowhere to go and you have nowhere to turn, you should be able to call the police and they're going to come and help you.'",
        "'speaker_2': 'That's that's the number one defense. To have losing their lives or being injured. And so I think that's really important. And I think we just we need to have that balance. And for me, that idea, when I hear people say, let's route money away from the police department, what I hear is we need to invest more in'",
        "'speaker_2': 'mental health and youth programing and helping people have opportunities and access so that they don't get on that criminal justice pipeline. And I think that's really important. We need to do everything we can to root as many resources as we can to that.'",
        "'speaker_2': 'I'm 100% on board, but not as a punitive sanction to the police department, because from everything I know, our police department doesn't deserve as a whole as an entity to be punished, especially for the actions that were done elsewhere.'",
        "'speaker_2': 'We'll address things case by case in our city. And of course, where there are lessons to be learned, liability to be had, and accountability for police officers that that don't do the right thing. That has to happen on a case by case basis.'",
        "'speaker_2': 'But on an overall broad street scheme, we shouldn't be punishing any department as an entire department because our residents are going to be the ones that suffer. So for me, I want to make sure that we have that balance.'",
        "'speaker_2': 'And I'm going to support everything we can do to support both the parameter of. Preventative measures as well as the reactionary measures. I think that's important. I am a huge. Proponent of. Sworn police officers flying helicopters, because I can tell you, you do not want a civilian coming into court and testifying on a trial that involved a'",
        "'speaker_2': 'police helicopter pursuit. You just don't that that's as a prosecutor, that's the worst kind of witness in the world you want. Like Councilwoman Allen said, it's like the Uber driver coming in. Maybe that's the trend and that's where the world is going.'",
        "'speaker_2': 'And maybe I'm a little old fashioned, but I believe that you should have police officers driving police vehicles and police officers flying police air support. That's just my belief. And I think it's really important for us to think about how important that value, that asset is.'",
        "'speaker_2': 'You know, we don't see a lot of crimes that are single handedly solved by air support, but certainly air support is providing assistance to officers that are on the ground. And their testimony, depending on the case, it is maybe essential for for any prosecution.'",
        "'speaker_2': 'And so I want to make sure that we're we're conscious about that. And and I understand that basically the the low level cost of the program to maintain it is in the mid hundreds. If the money was there, if we could find it, I would support it at full recovery.'",
        "'speaker_2': 'That's that's how important I think that particular item is. I also think traffic safety is very important. There is a lot of data out there that shows that enforcement, proactive enforcement is effective in reducing traffic fatalities. And we simply don't have enough proactive enforcement.'",
        "'speaker_2': 'I want to recognize Commander Ellis in the East Division. Who realize this traffic safety is a major issue and it is doing the best that he can with one time resources to fill those needs. But our traffic bureau for a city of our size is not where it needs to be.'",
        "'speaker_2': 'That's just my personal opinion, because I think a traffic fatality is just as tragic for the family members of the deceased as a shooting, as they've still lost their loved one and they've still lost their loved one as a result of a collision that could perhaps have been avoided if someone had been deterred by having been stopped'",
        "'speaker_2': 'and educated earlier. And I just I don't think we have the resources to do that as much as we need to. We need to be issuing more traffic tickets so that people have the opportunity to go to classes and learn about the importance and what can happen if they're drinking and driving and someone dies.'",
        "'speaker_2': 'That's very important. Those are lessons that I think people learn, unfortunately, by coming into contact with officers in a traffic enforcement setting. So I support more traffic enforcement, and I wish there was a way that we could find more money for it in this budget.'",
        "'speaker_2': 'With that, I just I want to thank everybody for the work that you're all doing. It's really important work. And just because we want to support. You know, active patrols and good response time does not mean nor should anyone ever conclude that we don't want to and aren't fully committed to supporting all the other front end mitigation'",
        "'speaker_2': 'methods that are available to help our youth and help them give a chance. Get a chance. So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Vice Mayor Richardson.'",
        "'speaker_4': 'Thanks, Mr. Mayor. Just one thing I heard one of the drilling on. A little bit more. Chief, did you say that you have your funding, these four positions, the two sworn pilots and the two support officers, without it being budget?'",
        "'speaker_4': 'You're doing it because you see that it's needed. That what I heard.'",
        "'speaker_6': 'Yes, sir. That's exactly what you heard. I have no budgeted I have two budgeted civilian pilots in the air support unit currently, but I am taking from other places in the police department and I'm filling it with four police officers right now because I believe it's that important.'",
        "'speaker_4': 'Okay. Mr. City Manager, you mentioned a bit earlier that the recommendation last year on the two civilians, operationally that's not working. Yeah. So the chief's talking about operationally right now how he's filling it with bodies. I'm talking more about budget.'",
        "'speaker_4': 'So we cut from 6 to 2 and then as we went through the meeting confer, it was clear you have to have the helicopter observers and so we needed to add back those two positions. Police department basically recommended cutting in their fleet budget to add two police officers.'",
        "'speaker_4': 'I did that as a current year enhancement and I let the council know in a memo and then that's in the budget in front of you now. So now we're back to four our two civilians, two police officer positions and some of the concepts are talking about is do you upgrade those other two civilians to have four'",
        "'speaker_4': 'police officers or do you then restored back to six, which that would be the $580,000 increase to go back up to six? I think the four sworn here's what I would say. I've heard a lot, you know, a lot.'",
        "'speaker_4': 'I heard that raised a lot today. So if the if a budget oversight committee or staff makes it makes them whole by by having the two sworn officers and two sworn observers operationally, I think the case has been made.'",
        "'speaker_4': 'And so if we can figure out a way to make that make that work as if it adds operationally what we think it does in order to be effective in the community, that's something I can support. And then the second thing I would just say, so I, you know, I would love to see from a process standpoint'",
        "'speaker_4': 'how that comes back. The second thing I would say is, you know, a lot of a lot of conversation about all the things that we should do as a city. But I think we have to get to the basic desire of someone who lives in your city and is dependent on our services.'",
        "'speaker_4': 'If you and we've heard this a lot as it relates to response times. People just want to know because I do get complaints in every department and a lot of it is because some of my neighborhoods are very, very far away.'",
        "'speaker_4': 'Hey, we didn't get a street sweep in this week. It didn't, you know, they didn't show up again or attracting you picked up or my response times and we dealt with this with fire was 3 minutes later because we were so far away how far north we are.'",
        "'speaker_4': 'And I think some of this is on all the extremes of the city, the Far East, the far north. I think we need to be able to, you know, make a commitment if some areas of town at 3 minutes and some are five.'",
        "'speaker_4': 'That's not good enough, I think. And I say that's something we have to address now, but we have to be able to make a reasonable commitment to no matter where you are in the city, your trash will be picked up.'",
        "'speaker_4': 'Your response time is is is fair. It's not a 2/2 difference or disparity across the city. We have to be thinking about that. And I know that's not something that can be addressed in one budget, but that is something that we should be making a commitment to, to everybody who is in a city, no matter if you'",
        "'speaker_4': 'live in the middle or on the outside. That's just a comment of mine. Thank you. And back on the helicopter, we'll make sure an hour or two before we give you the actual numbers, what it would take to get back to four, which I agree is a very reasonable approach.'",
        "'speaker_4': 'And then what it would take to get back to six, you have both those numbers.'",
        "'speaker_0': 'Thank you. I'm gonna make some remarks as well. And then I think we will be moving on to the rest of the agenda, which is of a full agenda. Let me just just begin by thanking again the budget staff, and I know the BBC and Councilman Orson is the bosses working through its meetings as well to get'",
        "'speaker_0': 'us through the budget process. I want to just let me start with the health department and then move on to the police department. Just I want to just to say to thank the entire health department for really, first and foremost, this a very difficult year and doing an amazing job with the resources that it has.'",
        "'speaker_0': 'I'm grateful that at every level of government, the county level, the state level, the federal level, we have received a significant resources to grow our health department, I think, by maybe 200 bodies. And so I'm hearing a lot about supporting our health department tonight.'",
        "'speaker_0': 'And we are. The health department has never been larger as far as I remember it, and it's robust and it's doing a lot of great work. And that's going to continue. And I think that we want to make sure that the health department continues to have the resources it needs to protect us from future pandemics, but also'",
        "'speaker_0': 'to take care of the community recovery programs right now that are so important and working with our community organizations to do that work. So just think of the entire team, particularly Dr. Davis and the entire infectious disease unit that's doing wonderful with the vaccines and everything else.'",
        "'speaker_0': 'So a huge thank you. And part of the recovery is also working on making sure that when I heard a lot tonight and from council members is that obviously for for true community safety you have to have also the preventative work.'",
        "'speaker_0': 'It has to happen consistently and thoroughly and that's something the health department is very involved in. So I just want to thank you for that to just the chief and to the leadership that's here. Part of recovery and we've talked about this a lot is also the safety recovery, and it's ensuring that we continue to make sure'",
        "'speaker_0': 'our community is safe. I've said it many times at Long Beach today. By every. Any way you look at the data is safer than it was 20 and 30 and 40 years ago. Doesn't mean we don't have challenges.'",
        "'speaker_0': 'It doesn't mean that. That guns have not become a source of. Of increase in shootings. And if there isn't a gun epidemic. Because there is and we still have incredibly tragic incidents in inner city that happen. But we are and have and have continued to ensure.'",
        "'speaker_0': 'I believe that the police department I look at what 21st century policing actually really means and how we change and improve moving forward. And I think you guys have and continue to do that. I want to thank you, Chief, and your entire team.'",
        "'speaker_0': 'It has been a very, very hard year for everyone, for all of you. I mean, I told you this, of course, privately. But I think it's important also that we look at where the resources are today and what the community is looking for.'",
        "'speaker_0': 'And I agree with some of the comments here. At the end of the day, folks want to know when they call 911 that some are going to be there to help them and if they're going to be there when they need them.'",
        "'speaker_0': 'And that's something that the service that we provide every single day. And I also know and one of the reasons why I'm proud of where we are headed in many in many ways is we're also recognizing as a city and quite frankly, as a country, that there are some 91 calls that could be handled by other folks'",
        "'speaker_0': 'as well. And police. Police officers today are expected to be police officers and social workers and medical workers and do a variety of things. And I think we and I want to make sure that we provide you the support to focus on policing and the important work that has to happen in our community.'",
        "'speaker_0': 'I agree with some of the comments we have to ensure. I appreciate the police department has never been more diverse. Under your leadership. It's more diverse today than it's ever has been. When I when I attend the and I attend every single graduation that your department has, and I look at these young officers, what I see back'",
        "'speaker_0': 'are folks that want to serve their community and that look like our city and that more and more we have women serving and more people of color and folks that want to want to give back. And I think that's something that.'",
        "'speaker_0': 'We'll continue to grow with within our city. And I also see. Particularly with the younger officers, a real call to to to service. And and I believe that the training and the investments we're going to make in projects like the training facility and the are going to be are really important investments that that this council is going'",
        "'speaker_0': 'to make. Finally, let me just say, on the helicopter issue, which has been brought up repeatedly, I also support what's been said. It is important, I think, for police officers to fly police helicopters and particularly those that are sworn and that have that experience.'",
        "'speaker_0': 'And so I think we've asked I know that the BBC, I think looking at this issue and hopefully will incorporate it as we move forward in the next few weeks to make sure that that piece of the budget gets adjusted.'",
        "'speaker_0': 'And I look forward to working with the other members that are interested in making that change. And and let me just say in conclusion that. What to me, what's important moving forward is that we're focused on a complete recovery.'",
        "'speaker_0': 'And that is not just the health piece, that's not just the economic piece, but also the people in this community deserve also to feel safe. And I'm hearing from folks is they also want to make sure that there are enough police to take care of their needs, that police are there at an adequate amount of time.'",
        "'speaker_0': 'And so the response time piece is really important and which I know that we're working on to ensure that we are modeling a true community police department. And all of those things I think are really important. So thank you all for the presentation.'",
        "'speaker_0': 'I appreciate hearing from both the health department and the police department and Alicia's any objection. We have a motion in a second to receive and file the report until the next meeting. And so please cast your votes on that.'"
    ],
    "Report on Expanding Parking Options in Alamitos Beach Area.": [
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. And with that, we will go here. Item number 13, please.'",
        "'speaker_1': 'Item 13. Communication from Councilman Allen. Recommendation two requires city manager to prepare a report exploring the cost and feasibility of expanding the Alamitos Beach parking lot and adding additional parking on Shoreline Drive and surrounding areas.'",
        "'speaker_0': 'Councilman Allen.'",
        "'speaker_3': 'Yes. Thank you, Mayor. I'm sure that we all know that parking is a major issue, especially in my district. And boy, did I hear a lot about that when I was knocking on doors and campaigning. I do want to thank Director Eric Lopez and his team for their insights and for working with me and the team and'",
        "'speaker_3': 'staff. This is a really big deal. As you know, parking is difficult for residents, businesses, visitors throughout the second District and the pandemic has further contributed to the reduction in available parking. And as the city continues to grow and we emerge from the pandemic and as businesses, events and community organizations begin resuming their normal operations, adding additional'",
        "'speaker_3': 'parking is going to be imperative. The Alamitos Beach neighborhood is especially impacted with the completion of the Caf concession stands and the upcoming proposed installation of the We Built Water feature, which I'm really excited about. And the 2028 Olympics is on the horizon.'",
        "'speaker_3': 'We are anticipating more tourist and people visiting Long Beach for events and recreational activities. This this item today would significantly expand both the parking lot and public access to the waterfront areas. I think it's also important to look at transportation issues holistically, and therefore I've asked public works to look into expanding alternative options, which include secured bike'",
        "'speaker_3': 'parking, destination scooter parking zones, storage lockers for pedestrians and bus riders, electric vehicle charging zones, and any and all other creative solutions that can be deployed that are have been deployed in other cities. I'd also like to see in the future some kind of outreach to our residents and see what their appetite is for creating a parking'",
        "'speaker_3': 'improvement district, possibly buying parking lots or creating shuttle systems. I just think it's important that we look at all of these these options. So this will be the first of many items that I will be introducing to tackle this issue.'",
        "'speaker_3': 'And I look forward to seeing what public works will bring back and find solutions that improve our parking and transit capabilities. Thank you. I do have a quick question. I have heard from residents at the Villa Riviera about late night noise and activity in the parking lot.'",
        "'speaker_3': 'What are our options for securing that that lot at night and. Is a gate or any other physical barrier possible.'",
        "'speaker_4': 'Council member. The we are installing some security features. We're actually working right now to install some security cameras in that area. And there is infrastructure in place for a potential gate arm. We just need to do additional evaluation with any regulatory permit restrictions that we may have from either Coastal Commission or others.'",
        "'speaker_4': 'So that is an item we can look at and we're happy to see what we can do in order to help with what the issue.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_4': 'Thank you. Seeing no further council comments. Any public comment on this of comment? Okay. Thank you. Members, please cast your vote.'"
    ],
    "Resolution in Support of Security Officers at Commonspirit/Dignity Health.": [
        "'speaker_1': 'Bush and Kerry, 21 police. I'm 21. Communication from City Attorney Recommendation to Adobe resolution in support of the right of security officers that the common spirit dignity, health to a free and fair election and representation by service employees.'",
        "'speaker_1': 'International. United Healthcare Workers. West City Way.'",
        "'speaker_4': 'Thank you, Councilwoman. Sorry, you speak on this.'",
        "'speaker_2': 'Yes. I just want to thank my colleagues for their support to standing with the security officers to join SEIU. UAW. Thank you.'",
        "'speaker_4': 'Okay, Councilman Price, anything. Okay. Any public comment on this?'",
        "'speaker_1': 'No. Public comments and.'",
        "'speaker_4': 'Nonmembers. Please cast your vote.'",
        "'speaker_1': 'Bush and Kerry.'",
        "'speaker_4': 'Thank you, Mr. Mayor. That satisfies the agenda if you want to.'",
        "'speaker_0': 'Is there any publicly significant period?'",
        "'speaker_1': 'We have five signed up. So, Christine, Jim. Anybody else. Cameron Coody, Kimberly Allen, Amanda Nordquist and Laura Roberts.'",
        "'speaker_0': 'I think we just have one person from that group. Please come forward.'"
    ]
}