{
    "Amendment to MOU with AES Alamitos for Alamitos Bay Water Quality Enhancement Project.": [
        "'speaker_0': 'Two. Thank you. Item 16, please. On the consent calendar.'",
        "'speaker_1': 'Item 16 is a report from Public Works recommendation to authorize city manager to execute an amendment to the MRU and and any subsequent amendments between the City of Long Beach and 80 Alamitos LLC to extend the term except a one time cash payment of $150,000 and amend Section five term and renegotiation to support the Alimentos Bay Water'",
        "'speaker_1': 'Quality Enhancement Project and increase the appropriation in the Thailand Operating Fund Group. In the public works department by $150,000, offset by an employee cash payment from the AEC Alamitos LLC for the Engineering and Due Diligence Effort District three.'",
        "'speaker_0': 'Councilman Premiere Pro comments.'",
        "'speaker_4': 'Thank you, Mr. Mayor. If it's if it's all right with you, I'd like to have a short staff report. I see Josh Hickman here. And this is a really important project for the water quality in Alamitos Bay. And I would like just a brief staff report, please.'",
        "'speaker_2': 'Thank you very much. Absolutely. So this is a huge project and it really is an important one to really address the water quality issues that will we expect to come when A ceases to do their current pumping. And so Eric Lopez is actually on the phone with us today.'",
        "'speaker_2': 'So he will get part of it. And Josh is here to answer questions as well. So, Eric. Thanks. And we have the PowerPoint on the screen and we can go to the next slide. So the Alamitos Bay Water Quality Enhancement Project.'",
        "'speaker_2': 'We've made some progress since. In the last ten years, though, we've we've had the opportunity to refine our engineering design concept and really lay the foundation for the additional engineering and technical analysis of of water quality data that will help inform our, our proposed design as it is well known the as and at h g as our'",
        "'speaker_2': 'power plants have been pumping water through through cooling pumps for over 55 years and that the water flow and the circulation patterns within the bay have grown accustomed to this activity there. There is a phase out of the current pumping systems are in place at both A and each test.'",
        "'speaker_2': 'And so this project is meant to find ways to for us to maintain our good water quality in and throughout Alamitos Bay, we're looking at a pumping system that's more fish friendly, that's more environmentally friendly, and that helps us achieve our main goals of maintaining our water quality.'",
        "'speaker_2': 'Our next slide. We. There is currently a series of pumps and outfall structures that are shown on this slide. The there are different different pumps are operate at different times and at different rates. But overall, the pumps and the gas pumps do provide a substantial pool of water and assist with with that with circulation.'",
        "'speaker_2': 'Next slide. They were out of focus area for for this project this is the south and take us to now it's near six which as a has retired they've actually retired punch one two and six and the are other three pumps are still operational.'",
        "'speaker_2': 'The current date that we have for when those will be retired is around December 2023. That is subject to change. And where we're just we're we're following that very, very closely. There are some additional pumps that will continue working throughout that time and that would be retired later this decade.'",
        "'speaker_2': 'And but right now, we're focused in the area of I retired a number six next like. So for the last couple of years, we've looked at a couple of conceptual designs and we've looked at different alternatives out four to be exact, and really trying to come up with a with a system around at this unit six, we'",
        "'speaker_2': 'were initially looking at using the existing structures there. But then have you can we go to the next slide? As you can see in this next slide, we found some some substantial deterioration. And our engineers are recommending a new structure as part of this effort.'",
        "'speaker_2': 'So we've been focused and kind of what that new structure could look like. And we've come up with a concept that would allow us to achieve the original goals of the project. And, you know, while continuing to use the the same area the unit takes existing and take area and achieve the project goals next line.'",
        "'speaker_2': 'What we're looking at is maintaining the existing intake canal, using the existing underground pipes that exist, potentially constructing a new pump house with fish friendly pumps and then using the existing outdoor structure. So the water will continue to circulate through through the bay to the San Diego River and continues that similar pattern.'",
        "'speaker_2': 'To help maintain water clarity, water quality. Next line. And this this is just a site plan that shows where the plants will be located. The electrical services are the discharge pipes and then the existing outfalls into the San Diego River.'",
        "'speaker_2': 'Next slide. Our tentative schedule is to complete our 30% design this year. That will allow us to go through the environmental entitlements process and to take our regulatory permitting. And then we are going to be fine tuning the financial and operational needs so that we have a really clear sense of what this project is going to require'",
        "'speaker_2': 'and what the budget, what the what the target budgets are going to be, the budget requirements we next line. The conceptual design process estimated. We don't have the funding in place. The proposed contribution from A is going to be a big help in allowing us to continue the engineering and cycle force that is required for this project'",
        "'speaker_2': '. It is early to put a budget or a cost number to this effort, but it is expected to be substantial and we will be providing that as part of the next phase of this project. And same with the operations, maintenance and monitoring costs, ongoing cost.'",
        "'speaker_2': 'That's something that we're we're trying to solidify. Next slide. And that concludes that presentation, and we're happy to answer any questions.'",
        "'speaker_0': 'Gentlemen.'",
        "'speaker_4': 'Thank you. I have no additional questions other than just some hopefully direction to staff that. We are looking forward to the funding gap and identifying ways to meet that. It's going to be a huge financial burden for us and I think this item shows that ACE is the willing partner.'",
        "'speaker_4': 'And hopefully that partnership continues to the next phase of this project with us. But this is a major priority project for the city of Long Beach. To to scale down that entire presentation into the following, I think would be accurate.'",
        "'speaker_4': 'If we do not replace those pumps, that water will collect bacteria and will not provide an opportunity for recreation and swimming as it does currently. And it will become a source of liability and blight for the city as opposed to an opportunity for recreation and outdoor enjoyment of a city asset.'",
        "'speaker_4': 'So it's imperative and I think it's a critical environmental project and I think staff are being involved in and I know it's a highly technical project and I think you're doing a great job having recently got it back on track.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Councilman. Also, any comments? As public comment, I believe.'",
        "'speaker_1': 'Elizabeth LAMB and Dave Chappelle.'",
        "'speaker_5': 'Thank you, council members. My name is Elizabeth LAMB and I'm executive.'",
        "'speaker_6': 'Director of the Low.'",
        "'speaker_5': 'Street US Wetlands Land Trust, and I appreciate this opportunity to comment. We completely agree there are problems with pollution in.'",
        "'speaker_6': 'Alamitos Bay that need to be resolved.'",
        "'speaker_5': 'We just want to make sure that the solution is consistent with the ongoing efforts to restore low cerritos wetlands. We do thank Mr. Modica and Mr. Lopez for providing us with several studies that were prepared by Moffitt and Nicole about the project.'",
        "'speaker_5': 'And on its face, it does seem reasonable that the continued operation of the pumps would help to maintain.'",
        "'speaker_6': 'Water quality in the bay. But experts that we have reviewed these studies.'",
        "'speaker_5': 'With raised concerns about some of the baselines and assumptions used to support the conclusions about the fact that there would be no significant impacts to marine biology. Because of that, we are glad to see that the latest report does include mention of environmental review.'",
        "'speaker_5': 'Our concern right now is that the project is moving into agreements about access to the.'",
        "'speaker_6': 'Property and final.'",
        "'speaker_5': 'Construction design. We are concerned there is so much momentum behind the city's preferred.'",
        "'speaker_6': 'Alternative that the city has.'",
        "'speaker_5': 'Already precluded an objective discussion.'",
        "'speaker_6': 'Of alternatives that would come through something.'",
        "'speaker_5': 'Like a square review. We want to suggest to you that the city engage in something similar to a secure scoping process.'",
        "'speaker_6': 'Before going any further with planning and expenditures for the bay pumping.'",
        "'speaker_5': 'Plan. The process that would include interesting interest in interested parties like the Lowe's through the Wetlands Land Trust and the Low Street.'",
        "'speaker_6': 'US Wetlands Authority, who are the restoration planners for the area, and of course state.'",
        "'speaker_5': 'And local agencies.'",
        "'speaker_6': 'Council members. I know we.'",
        "'speaker_5': 'Want the same thing. We want water quality in the bay that protects recreational uses and is consistent with wetlands restoration. And we understand that that is a complex problem.'",
        "'speaker_6': 'But perhaps there is more than one way to resolve that problem.'",
        "'speaker_5': 'So we hope the city will share with us that they have fully conceived and investigated all the alternatives and share that.'",
        "'speaker_6': 'Specific information.'",
        "'speaker_5': 'With us. I hope you can see how getting input from public, from the public and the several agencies with expertize on water pollution would not only ensure a thorough consideration of potential alternatives, it would pave the.'",
        "'speaker_6': 'Way.'",
        "'speaker_5': 'For a smoother adoption of the permits required. I thank you for your time.'",
        "'speaker_2': 'Dave Shukla Third District and in specific, I grew up and my house is directly across the street from this project, from the water intakes one, two, three and four. First of all, the energy content necessary to run the pumps does not necessitate continuing to keep the power plant open.'",
        "'speaker_2': 'The basic argument that this facility has made over time has been that, well, you know, bad things will happen, you won't have reliability, you won't have, you know, water quality, you won't have all the good things if you don't have us.'",
        "'speaker_2': 'And the fact of the matter is, you don't need to burn gas at that facility to charge up and run the pumping stations. Moreover, there's a lot about this facility that we just don't really talk about. Like, for instance, it's one of the facilities in the coastal zone that is literally over time changed the actual line of'",
        "'speaker_2': 'the coastal zone. The coastal zone line is going to have to be increased, you know, more inland because of the climate change that this facility over time has created. Uh, according to Energy Information Agency data from 1968 to 2000, uh, this was the third most polluting facility by electricity generation in North America.'",
        "'speaker_2': 'And, you know, the combined point source right across the street from my from my backyard, it's chiffonade. Yes. These are both kind of legacy facilities. And they're two of maybe four or five of the last holdouts in the state.'",
        "'speaker_2': 'Um, the state has a commitment not only to water quality, but also to ensuring a livable future. And we know per the carbon scoping plan that a lot of people have disagreements about where, where, what direction that may be.'",
        "'speaker_2': 'Um, it's been proposed that three or more of these facilities need to be created to meet our energy needs at a time when solar, wind, geothermal or oil cheaper, when the offshore wind permits for the entire West Coast are about to go live, it's an industry that is holding on with a death grasp.'",
        "'speaker_2': 'And, you know, we may not be able to escape it. It may be one of the reasons why, you know, our family leaves before things get too bad, you know, I mean, we have this on our conscience. Well, I'd be continuing to be.'",
        "'speaker_2': 'I mean, I come here every week trying to see if there's any possibility of getting out from under the system of dirty energy and a lot of the, uh, economies of dependency created. And I honestly, you know, I don't think there has been concrete proof that the water quality issue in specific, let alone the more general issue'",
        "'speaker_2': 'of burning natural gas to meet our energy needs, has ever been shown that, you know, we need that specific facility or we need the city's preferred alternative. I think it needs to go through sequent. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion and a second by Councilman Austin, and Pryce comes from Pryce and an Austin. I just this is that was up on the board, but I think that was from the last one. Did you just clear the.'",
        "'speaker_0': 'We have the same the same.'",
        "'speaker_1': 'The same motions and the same mover in secondary.'",
        "'speaker_0': 'Okay, great. So then it got clear to my board for whatever reason. Could you put those back in, please? Yeah. Just. Just put the motion back in. It wasn't. It wasn't on mine for whatever reason, so. Okay, great.'",
        "'speaker_2': 'Now it's gone again.'",
        "'speaker_0': 'Okay, that's okay. So we have a motion in a second. Members, please go and cast your votes.'",
        "'speaker_1': 'Castleman said he has. The motion is.'",
        "'speaker_4': 'Carried.'"
    ],
    "Contribution to Long Beach Lesbian & Gay Pride Inc. for 2022 Pride Parade and Festival.": [
        "'speaker_0': 'Thank you. We're going to do we have we have two presentations and some items we need to get to pretty quickly. And so unless there's any objection on the funds transfer, hopefully get through this very, very quickly. Let's read those into the record and just get these voted on, please.'",
        "'speaker_0': 'And the front transfer items.'",
        "'speaker_1': 'Item 26 for fun transfers communication from Councilwoman Allen. Recommendation to increase appropriations by $1,570 to parade a contribution to Kalo Creative LLC to support the Long Beach Proud Weekend events. Item 27 is a communication from Councilwoman Price recommendation to increase appropriations by $332 to provide a contribution to Liben Institute of Movement Studies for the Embodying Water or'",
        "'speaker_1': 'for Well-Being event. Item 28 is a communication from Councilman Super. Recommendation to increase appropriation by $500 to provide a contribution to the Long Beach camera singers for their summer concert in the fourth District. Item 42 is a communication from Councilman Alston.'",
        "'speaker_1': 'Recommendation to increase appropriation by 20 $500 to provide a donation to the Long Beach Lesbian and Gay Pride Inc to support the 2022 Long Beach Pride Parade and Festival. Item 43 is communication from Councilwoman Sara recommendation to increase appropriation by 20 $500 to provide a contribution to the Long Beach Lesbian and Gay Pride Inc.'",
        "'speaker_1': 'To support the 2022 Pride Parade and Festival. Item 44 is communication from councilmen. Councilwoman Allen Councilmember Ranga recommendation to increase appropriation by a total of $5,000 to provide a contribution to the Long Beach Lesbian and Gay Pride Inc to support the 2022 Pride Parade and Festival.'",
        "'speaker_1': 'General public comment.'",
        "'speaker_0': 'No public comment. Okay, we have a motion in a second. Please cast your votes.'",
        "'speaker_6': 'Emotions carry.'",
        "'speaker_0': 'Thank you. We have two presentations where we go ahead and do both of those and we've got each one time for 5 minutes and so we'll try to get through those fairly quickly. Let's start with the first one over a couple remarks and then we will transition to the second one.'"
    ],
    "Community Vision for LGBTQ+ Cultural District.": [
        "'speaker_0': 'Yes, we'll do that for sure, sir. Is Lissa Bishop here? Okay, then word concluded from a comment. And we're going to go ahead and go on to the remainder of the agenda. We're going to begin with item number 25, please.'",
        "'speaker_1': 'Item 25 is a communication from Mayor Robert Garcia and Councilwoman Allen. Recommendation two requires city manager to work with local stakeholders to create a cultural district recognizing and supporting the historic contributions of the LGBTQ community.'",
        "'speaker_0': 'Thank you very much. I'm going to go out and just make a few comments and I'll turn this over to Councilwoman Allen. I think it's no surprise that Long Beach has a large and really proud LGBTQ plus community.'",
        "'speaker_0': 'We have had it for four decades. One of the things that makes Long Beach unique is organizations across the country will tell you that the density of LGBTQ plus people in the city is actually one of the highest in the state of California and certainly for a city of our size.'",
        "'speaker_0': 'When you think about Long Beach and the heart of the broader gay community, that really is the Broadway corridor. Our LGBTQ plus community is has developed, has grown, has come out, has invested all up along this corridor for many, many decades.'",
        "'speaker_0': 'It's also one of the most politically active communities in the city and has been for a very long time fighting for rights at Pride, making sure that that employees had equal but equal employee benefits, and ensuring that, particularly during the AIDS crisis, that there was attention brought to this important and critical issue for many gay people and'",
        "'speaker_0': 'members of the community, myself included. Many of the spaces along Broadway, particularly in Alameda Speech and the bars and and the businesses, were the one place that you would go to, where you could be open, where you would come out, where you would meet friends, where you would share stories.'",
        "'speaker_0': 'And so the the the corridor along Broadway is a very significant place for the community and I think for the broader language community here in the city. For many years, there's been discussions within the community about creating a historic or cultural district that would encompass the historic gay neighborhoods in Alameda Speech along Broadway.'",
        "'speaker_0': 'These are spaces that are incredibly important to the community. It is currently there are numerous small businesses, LGBTQ plus own businesses, bars, nonprofits, restaurants, spaces that celebrate the community as well as, of course, other other businesses. We also know that this is an area that is a great neighborhood, a neighborhood that is incredibly inclusive, broadly across the'",
        "'speaker_0': 'city as well. Over the years, there's been improvements made, whether it's been the crosswalks, whether it's been ensuring that the infrastructure for mobility gets, gets, gets installed. But this is an opportunity to think about the broader history and to involve the broader community.'",
        "'speaker_0': 'The recommendation is to ask staff to come back with a a plan after, of course, working with the community. And we'd like the team to work with our local historians, neighbors, the LGBTQ plus business owners, of course, not the nonprofit organizations, to really begin creating a cultural district along the Broadway corridor.'",
        "'speaker_0': 'It is something that can be created with and through the community. And most importantly, it's a process that is going to respect the businesses that are already there. Ensure that we don't that we don't lose the history of the of the street and make sure that we are working with small business owners to try to maintain that'",
        "'speaker_0': 'as a culturally significant portion of the city for the community. I will also add that over the years we have lost some businesses, some of the bars, but many remain that you find most of them there along that stretch of Broadway.'",
        "'speaker_0': 'You talk to most gay folks in this community, most LGBTQ folks in this community, and they all have stories about Broadway and how important it was to them as it was and has been to me personally, in my experience coming out in the city and and meeting other people that were like me and like folks from our'",
        "'speaker_0': 'community, across the community. This is creating and designating LGBTQ plus historic districts is not uncommon, and it's happened in other communities across the country that have large gay populations or that have significant areas that are that are historic.'",
        "'speaker_0': 'And so this is something that we have been talking about for a significant amount of time. And I'm really proud, particularly as we celebrate pride, to be able to bring this forward and get approval and support from the council to begin this really important process for the community.'",
        "'speaker_0': 'And so with that, I'll turn it over to Councilwoman Allen.'",
        "'speaker_6': 'Thank you, Mayor, for your leadership. And I'm excited to work on this vision with you. I'm also proud to represent this area. These bars and businesses have been safe spaces for people in need for many, many years. They are homes away from home community centers and gather.'",
        "'speaker_6': 'The wrong places. They make people feel safe in our community when so many other communities do not feel safe. Long Beach has no nationwide is welcoming and inclusive. And the Broadway corridor is a central part of this history.'",
        "'speaker_6': 'As councilwoman representing this area and its history, I am so proud of what our city has accomplished, and I'm proud of how inclusive we are. I think that we must be committed to working on even be a more welcoming, welcoming and more inclusive.'",
        "'speaker_6': 'I'm proud to have supported the gender inclusive language policy for the city to be supporting the placemaking and events at the restored Pride Tower and to support the LGBTQ plus community building events and cultural affirming programing. I'm also excited to hear from constituents about what boundaries and vision for this district should be.'",
        "'speaker_6': 'I look forward to how we recognize and preserve this history that makes our community so very special. I want my children to be able to talk to to take their future children here and learn more about the resilience and the accomplishments of our LGBTQ community.'",
        "'speaker_6': 'So I look forward to starting this process and definitely want to thank you again, Mayor Garcia, for your leadership and vision on this. Thank you.'",
        "'speaker_0': 'Thank you. Commissioner Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And now I'll voice my support for this idea, this concept. You know, I didn't know that it wasn't already. I always assumed it was already a historically historical district, because everyone in lobbies knows that that's sort of a historic corridor there on Broadway.'",
        "'speaker_7': 'I think it's important context for the entire city. Landmarking is an important process that recognizes local, local culture, local diversity, local history. But it's also smart economic development policy. The more you can add value and recognize the existing assets and see people and see their culture as an asset, you attract more interest in the area which supports'",
        "'speaker_7': 'those small businesses that certainly need more support and more help. So this this makes a whole lot of sense and I'm happy to support it. I think this will underscore what is truly a strength of our community, our diversity.'",
        "'speaker_7': 'But also I think it acknowledges history and it brings broader understanding as well. And so I'm happy to support this motion today.'",
        "'speaker_0': 'Vicki Vice Mayor, Councilwoman Sara.'",
        "'speaker_4': 'Thank you, Mayor. What a great item to bring forward during June, which is Pride Month. And I am just so proud of our LGBTQ plus community and what they have all accomplished to come to this I think point and as far as continuing to uplift the struggle but also the accomplishment and to continue to celebrate what the'",
        "'speaker_4': 'community have have done. And, you know, it's just I'm just really happy to be able to support it and to continue to lift the LGBTQ community forward in and and have it continue to be recognized nationally. Because I think that whenever people think about Long Beach, it's much more than obviously our Cambodian community that's well known, but'",
        "'speaker_4': 'also our LGBT.'",
        "'speaker_5': 'Uh.'",
        "'speaker_4': 'LGBTQ plus community as well. So happy to support that item.'",
        "'speaker_0': 'Thank you. Thank you. Councilman Sunday House.'",
        "'speaker_4': 'Thank you, Mayor. Thank you for this very, very important item. This is a very, very important step for our city. So thank you, Councilwoman Allen, also for for supporting this and bringing this forward, actually. One of the things that I will also agree with is that I've always thought that it was already a district.'",
        "'speaker_4': 'So it's so encouraging and so beautiful to actually make it official. Long Beach is known for being welcoming to all, and that's very important. I think that, you know, the reason for that being is because we take great pride in our rich diversity.'",
        "'speaker_4': 'Cultural districts highlight and celebrate our diversity through artwork, foods, businesses and spaces that are tailored specifically to create safe spaces for for our communities to enjoy. I look forward to initiating this process and to establishing a vibrant LGBTQ place district in Long Beach.'",
        "'speaker_4': 'Congratulations.'",
        "'speaker_0': 'Thank you. And I just want to before we go, I think there's a member of the public here to to speak before we go. I just want to I also think the center, Long Beach, I think they're going to play a key role in the key role in helping us bring the community together.'",
        "'speaker_0': 'And I know we've asked the staff to work with directly with the center to help us guide this process. And then the other piece, which I think is important, is that throughout this process, the a historic district can be a lot of things.'",
        "'speaker_0': 'It could be obviously ensuring that the history is preserved that could be working with businesses. Its its economic development is historic preservation, it's infrastructure, it could be infrastructure improvements. And so there are a lot of pieces that can really make this a really special corridor more special than it already is as we continue to preserve our LGBTQ'",
        "'speaker_0': 'history in the city of Long Beach. And so with that, I'm going to open it up to the public. I think we have a member of the public, Madam Clerk.'",
        "'speaker_1': 'We have Josh Newell almost.'",
        "'speaker_2': 'Good evening, Mayor. Good evening. City council people. I'm so glad to hear those wonderful comments, especially since we are right coming to the end of Pride season. So happy pride to all of you. Happy pride to the city of Long Beach.'",
        "'speaker_2': 'My name is John Newell, and today I'm representing the LGBTQ center here in Long Beach. And the LGBTQ center advances equity for LGBTQ plus people through culturally responsive advocacy, education and programs. Long Beach has made a tremendous, tremendous and huge advances in the last 30 years.'",
        "'speaker_2': 'And a portion of that success is due to the strong LGBTQ community here in our city. As a community, we're very proud to see these items come up on the agenda today and to formalize that the Broadway corridor is part of our culture and part of our history here in Long Beach.'",
        "'speaker_2': 'The Broadway corridor is filled as as many of you know, with gay and queer owned businesses, gay and queer friendly businesses. Many of these businesses have open storefronts. The nearby homes have been rejuvenated along the corridor, and residents can visit a plethora of coffeehouses, bars, stores, thrift stores, restaurants, all selling art, clothing, furniture that definitely help the'",
        "'speaker_2': 'economy here in Long Beach. One thing that we do need that I do want to recognize is this area has our very first LGBTQ rainbow crosswalks. Thank you to the council and the city and public works for putting those in.'",
        "'speaker_2': 'So I again urge the city to and the Council to fully support this item. And the LGBTQ center is here ready to support this item and work with the city to make sure that this cultural district becomes a becomes a reality.'",
        "'speaker_2': 'So, again, thank you, Councilwoman Allen. Mayor Garcia, the entire council, we appreciate you. And this is a perfect way for us to recognize pride. So happy pride, everyone.'",
        "'speaker_0': 'Thank you so much. And thanks to the center and the entire board. And with that, we have a motion and a second. Let's go ahead and please cast your votes.'",
        "'speaker_1': 'The motion is carried.'"
    ],
    "Resolution to Change Parking Meter Days, Hours and Rates for Zones 1 and 1A.": [
        "'speaker_0': 'Thank you. We're moving on to item 40.'",
        "'speaker_1': 'Item follows report from public works. Public. Public Works Recommendation to request City Attorney to prepare resolution to set operating days and hours for parking meters Zone one and one A to Monday through Sunday, excluding holidays during the hours of 10 a.m. to 7 p.m. for a maximum of 2 hours at a rate of $1.50 per hour.'",
        "'speaker_1': 'District three.'",
        "'speaker_0': 'Tom Price.'",
        "'speaker_4': 'Thank you. And this item comes to us by way of the Belmont Shore Parking Improvement District.'",
        "'speaker_6': 'And they the Belmont Shore Parking Improvement District, they.'",
        "'speaker_4': 'Went through a process to vet this proposal. They considered all their finances. They opened it up for public comment. And it's the recommendation tonight that we adopt the street change. And I would ask my colleagues to support it.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_3': 'I support the city.'",
        "'speaker_0': 'There's a motion any second. Is your public comment on this?'",
        "'speaker_1': 'No public comment.'",
        "'speaker_0': 'Team members, please go. Ancaster votes.'",
        "'speaker_1': 'Emotions carry.'"
    ],
    "General Plan Amendment for Open Space PlaceType for Parks.": [
        "'speaker_0': 'Thank you. We are now going back to our hearings. So we have our first our first hearing up, which will be item 21.'",
        "'speaker_1': 'Item 21. It requires four votes. It's a report from Development Services recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt negative declaration. Adobe resolutions amending the place type map of the land use element of the general plan.'",
        "'speaker_1': 'Declare ordinance setting aside and dedicating certain lands owned by the City of Long Beach for public park purposes and uses declare ordinance amending table 30 5-22 at 11 subject parks and declare ordinance amending the use district map to change the zoning districts of the subject parks and remove foreign and 56 square foot remnant parks located at the'",
        "'speaker_1': 'southwest corner of East 14th Street and North or Zaba Avenue from the area dedicated as or as a Park City y.'",
        "'speaker_0': 'Thank you. I'm going to go into this over first, over to our city team.'",
        "'speaker_6': 'Mr. Mayor, Mayor and members of the council. I'd like to introduce Alison Spindler, our acting planning manager. She'll give a presentation on this item. Good evening, Mayor, and members of the Council. The item before you this evening is a request to approve a variety of land use and zoning actions associated with 11 existing parks to ensure appropriate'",
        "'speaker_6': 'protections for those parks in perpetuity. The Department of Development Services and the Department of Parks, Recreation and Marine have been working collaboratively for more than five years to ensure land records, zoning dedications and the general plan designations of the parks within the city are accurate, up to date and consistent across multiple regulatory instruments and documents.'",
        "'speaker_6': 'This has involved researching land records and identifying the legal boundaries of city owned parks for the purposes of ensuring that they have the appropriate land designation and zoning and are formally dedicated as park land to ensure proper protection and preservation of public open space in perpetuity.'",
        "'speaker_6': 'On June 20th, 2019 and November 18, 2021, the Parks Recreation Commission recommended the designation or dedication of 29 existing owned parks, including any other land use actions needed, such as central plan amendments, zoning code amendments and zoning changes.'",
        "'speaker_6': 'This current batch of cleanups associated with 11 existing parks represents ongoing efforts and progress towards updating and modernizing those appropriate designations. The remaining 18 parks recommended by the Parks, Recreation and Marine Commission will be brought forward for dedication and necessary land.'",
        "'speaker_6': 'These actions at a future date. Most of the remaining parks have been identified to have more complex boundary and land use issues that required additional resources and land surveys before action can be taken. Dedication is the process that applies to city owned parkland.'",
        "'speaker_6': 'To protect a park in perpetuity for public open space use. The City Charter specifies that the Council shall adopt zoning and other regulations for the purpose of protecting parkland. Both the Charter and the general plan, open space and Recreation Element provide that if a dedicated park is sold or used for an on park use and it must'",
        "'speaker_6': 'be replaced at a ratio of at least 2 to 1. Protections provided through dedication help implement the goals and policies of the general plan, including the land development and open space element, to ensure that all residents have access to open space and recreational facilities.'",
        "'speaker_6': 'Therefore, typically, city owned parks are designated with an open space general plan, place type, are zoned park and dedicated in perpetuity. The last park designation was in 2006, though other minor land, minor parkland designation cleanups have occurred. Citywide Park inventory was completed in 2019 by Planning and Parks, Recreation and Marine.'",
        "'speaker_6': 'Many of the properties being proposed for dedication and land use designations this evening are properties that were owned by the city's former redevelopment agency. Again, this represents a first batch of proposed dedications and cleanups. Additional parks with additional issues to be addressed will be brought forward at a future date, as provided in the City Charter.'",
        "'speaker_6': 'The powers and duties of the Parks and Recreation Commission include recommending to the City Manager and council the dedication of public land for public parks. Again, as a history, in 2019, the Commission recommended the Council dedicate 29 existing city owned parks, and in July 2021, the Planning Commission recommended to the City Council dedication and associated land use'",
        "'speaker_6': 'actions for 12 parks. In September of 2021, the Council moved to continue this item due to needed additional research on Willow Springs and Tanaka Parks research, which is still underway. Therefore, 11 of the 12 parks that were contemplated at that time are moving forward today.'",
        "'speaker_6': 'You can see on the map here the 11 parks that are being proposed for dedication, that designation, including a list on the left hand side and a map on the right. But Slide summarizes which parks require general plan amendments to change the general plan from whatever existing place type may exist on the park to the open space'",
        "'speaker_6': 'place type as appropriate. Similarly, zone changes are proposed for ten parks listed on the slide. For each of the ten parks, the proposed zone change is to change the zoning from a variety of existing zoning districts to the park zoning district, which will provide for consistency with the open space place type and with the existing park uses'",
        "'speaker_6': '. Again, it's a clean up. The zone changes are reflective of what's on the ground. All are being read zone to park except for one 450 square foot noncontiguous remnant parcel at the southeast corner of or is of a park which is proposed to be zoned from P to AL.'",
        "'speaker_6': 'It was dedicated in 2003. Many years back, a community organization was to improve and maintain the remnant parcel. However, over time, this responsibility fell to the Parks Department, which presented some challenges. Meanwhile, economic development staff has been exploring the possible sale of the parcel to the abutting industrial property owner.'",
        "'speaker_6': 'As a result, this area is proposed to be zoned from park to light industrial consistent with the abutting private property. The proposed zone change and removing that small area will allow the parcel to have appropriate oversight and be better maintained.'",
        "'speaker_6': 'This action does remove that small square footage. However, the other dedications proposed as part of the project more than fulfill the 2 to 1 requirement. This project proposes a zoning code amendment, a text amendment to add the 11 parks to the dedicated parklets in the municipal code again that supports formal dedication of the parks.'",
        "'speaker_6': 'Finally, Willow Springs Park was included in the original submittal. However, it was removed due to additional investigation needed, including preparing a legal description and clarifying boundary information. It's anticipated to come forward towards the end of the year and to Minorca Park was purchased by the city after the first batch of parks was considered by the Planning Commission'",
        "'speaker_6': '. It's anticipated to be heard by the Planning Commission in July and with the Council in August. The remainder of the parks with more complex boundary and land use issues will be brought forward for dedication and necessary actions at a future date when that work can be completed.'",
        "'speaker_6': 'Public hearing notices were published as required and shown on the side. With that staff recommends approval of the dedication and associated land use actions to designate these existing parks with the proper zoning and land use designations and to protect these 11 parks in perpetuity.'",
        "'speaker_6': 'With that, staff is happy to answer any questions you might have.'",
        "'speaker_0': 'Thank you. Can I get a motion in a second, please? I also believe there's going to be four votes required on this. Yeah. For whatever reason, it's not appearing on my vote counter. But it needs. Yeah, it's not appearing on mine.'",
        "'speaker_0': 'So the. For some reason, Madam Clerk, the. Those that are coming in are not appearing on the main screen or going to the. Top of the screen. So it's a little tech I should be going to fix. Thank you.'",
        "'speaker_0': 'So there's a motion and a second. Let's go ahead and first go to public comment. Is your public comment on this?'",
        "'speaker_1': 'Yes, we have five Dave Shukla, David Sonata, Anna Christiansen, Lynnette Firenze and Mike Le Quatre.'",
        "'speaker_0': 'No, I know, but.'",
        "'speaker_1': 'Dave Sugar. David Sonata. Please approach to the podium. And Christianson. Annette Firenze and my love. David Sonata. Please approach to podium.'",
        "'speaker_2': 'Good evening, Mayor Garcia, Council City Manager Tom Modica. I came tonight to really sincerely thank you for the support that you give to Parks, and particularly to create open space in our park, poorer areas of Long Beach and communities of color.'",
        "'speaker_2': 'Tonight's actions are very important and I support them completely. As the last major park dedication took place in 2006. I do want to bring your attention, though, to the comments about Willow Springs. It is my favorite park in our city.'",
        "'speaker_2': 'And as we move forward to the December date that we discussed as they look into Willow Springs, I am hoping that council will keep attention to keeping these parks in total in whole. Because I have been told that there is a tension to plan and remove park acreage from Willow Springs Park to make it available for sale'",
        "'speaker_2': 'or swap. That would be a tragedy, especially on the West Side where we need open space and park accessibility. It also is not consistent with the park. Park's Commission and Planning Commission recommendations, nor with the city councils adopted in the global master specific plan.'",
        "'speaker_2': 'Again, our parks need to be in perpetuity. All of them taking any more properties from our parks will only cause us to lose access for our citizens. But with all that said, I think you already saw the quality of the Parks Department with Brant and his team.'",
        "'speaker_2': 'Durbin do an excellent job and I'm sure you'll keep attention to keeping our parks whole across our city. But most important, Willow Springs, because it is one of our different parks. Thank you very much for your attention.'",
        "'speaker_5': 'Anna Kristensen loads through this Wetlands Task Force. I came because I was at the Parks and Rec meeting and the former speaker did not introduce himself as the former chair of the Parks and Rec Commission, which he has been for many, many years.'",
        "'speaker_5': 'And he was highly honored at that meeting last week. And and there was a concern about Willow Springs Park. And and I think Willow Springs Park is a particularly special place because it it once had a spring. It was the original source of water for the city.'",
        "'speaker_5': 'And that spring and that source of water, it could could maybe the spring can't be active. But they are trying to rebuild the wetlands there. And in the middle of an urban area to have a space, we have soccer fields.'",
        "'speaker_5': 'You know, we have not maybe not enough, maybe we don't have enough basketball courts. But other than the nature center, we don't have a place like this. And that's the way it's being developed. It's being developed with native plants and and in honor, really, of tribal people and and the way they could teach us how to live'",
        "'speaker_5': 'and sustain the land. So I agree that to chip away at it, we've we've seen this too often, in fact, in front of the Coastal Commission meeting when we were trying to get better protection for our coastal birds, we were told, well, well, urban birds are just they just adjust.'",
        "'speaker_5': 'But if they adjusted, where the hell are they then? Because because we're losing, you know, we're losing this. And our parks are for people like like that, the Parks Department says, but they're also for wildlife, which I think we've we've taken so much for granted.'",
        "'speaker_5': 'And the way we we the way we treat those residents and the way we allow spaces for them. Yeah, we know we can't we can't have it. We need, we need those playing fields and we need the picnic benches and stuff.'",
        "'speaker_5': 'But Willow Springs is different, you know, and and money isn't everything. I mean, taking that little piece of land away and putting a little mall on it, there's a spot I'm probably going to go over. Oh, not quite.'",
        "'speaker_5': 'Oh, there's a there's a city park. It has the city of Los Angeles City Art Museum there, Barnsdall Park. I don't know if any of you've ever been there, but Elaine Barnsdall had a home there surrounded by farmland.'",
        "'speaker_5': 'She was a great radical and she left that land to the city on the condition that children have a museum there and children's art classes would be there. Her home was designed by Frank Lloyd Wright. It's quite an elegant place, but somebody decided at some point to take the city, took a chunk out of that to build'",
        "'speaker_5': 'a strip mall, and it's really ugly. And so that's what we see. We see it sometimes on our public schools, in our universities. Even so, we have to be careful because our our public open space is priceless. It really is.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Okay. Um, good evening, Mayor and City Council. My name is going out, and I'm also here concerning that Willow Springs Park is again excluded from this with when the park dedication was last heard at City Council on September 14th, 2021, the dedication was for.'",
        "'speaker_6': '11 parks.'",
        "'speaker_5': 'Instead of 12 has approved by the Planning Commission since Willow Springs has been removed from the list. The motion was to continue to an unspecified date. City manager Tom Monaco spoke on this item and said that there were letters of concern regarding Willow Springs Park.'",
        "'speaker_5': 'It has been removed from the list of parks shortly before the item went to City Council, although it had previously been approved by both the Planning Commission in 2021 and Parks Recreation Commission in 2019, and it was included on the same list of the 12 other parks.'",
        "'speaker_5': 'He said the city was fully intending to bring Willow Springs back to be dedicated as a park. But there were very technical issues regarding lot lines and you have to be very specific on boundaries as well. Once it is dedicated, it cannot be undone.'",
        "'speaker_5': 'He went on to say that the city intends to bring Willow Springs back and have it dedicated as a park. Once that work is done, he did state that the city will look at that in all parks and will bring them back all at once to see that they would be dedicated in perpetuity.'",
        "'speaker_5': 'However, once again, this is not happening. This process has been going on for at least three years. The map for Willow Springs Park dedication from the Parks Commission was approved on May 21st, 2019. I checked with the Planning Department today and was told there have not.'",
        "'speaker_6': 'Been any applications to alter.'",
        "'speaker_5': 'The boundaries in the last ten years. The boundaries have already been approved by two city commissions. The community feels that these actions are a stall tactic and are very concerned that the park size may be reduced. This is an area of the city that has an extreme lack of open space.'",
        "'speaker_5': 'The city's new Long Beach Strategic Park plan has one of its goals a commitment to end parking equity and systematic racial inequality. Without the dedication approved by city council, the park is unprotected from sale or reduction in size.'",
        "'speaker_5': 'Unfortunately, the community is in the exact same situation we were nine months ago, with 11 parks being proposed for dedication in Willow Springs left off. I hope the city manager will simply honor his own words from last September and continue this item until Willow Springs as part of the 12 Park dedication has promised to the community.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Thank you. Next picture, please.'",
        "'speaker_2': 'My name is Mike Quatre, and I'm also here to speak concerning Willow Springs. I'll keep this brief since many of my points have already been covered, but I am pleased whenever we gain a dedicated park space. But I am concerned about whether Park Springs Park not being on the list again for a year or more.'",
        "'speaker_2': 'We've been told they would all be dedicated together. Yet Willow Springs remains the odd person out, so to speak. Repeated calls and emails to various council districts. Parks and Rec, city manager's office and other involved entities have failed to yield a concrete answer for this.'",
        "'speaker_2': 'Instead, we can continue to get vague responses, citing questions about long lines and boundaries. Central and West Long Beach are underserved in regards to parks. And since Pacific Place and soon, Baker Street properties are going to be marked for development.'",
        "'speaker_2': 'Willow Springs appears to be our last chance to gain open space, since there seems to be no definitive reason as to why this park is being treated differently. I fear that in the face of a looming budget deficit due to the recent court ruling overturning Measure M, the city might be considering selling part of the land currently'",
        "'speaker_2': 'included in Willow Springs Park prior to the final dedication. I hope that I'll be proven wrong, but the continued failure to dedicate this park space leads me to this conclusion. Therefore, I am asking that you follow through on the city manager's previous promise to dedicate all 12 of these proposed parks as a group.'",
        "'speaker_2': 'Thank you. Dave Chappelle, third district. I'm not here to speak in support of Willow Springs, except to say that I grew up skateboarding down that road, and it would be great for there to be a park there. I haven't heard any good reasons yet why it shouldn't be included for perpetuity scale, but specifically on the removing of'",
        "'speaker_2': 'the 456 square foot noncontiguous remnant parcel located at the southwest corner of East 14th Street, North or Rizal Avenue. That was, uh, originally part of the dedication of words of a park. I think that's kind of a harbinger of what's to come.'",
        "'speaker_2': 'More generally, throughout the city, which is kind of carving off and selling off parcels where one can, uh, to generate revenue, uh, when we should be doing the opposite. We should be trying to take over the properties where we can and just use the city authority to make it, uh, something better than it is now.'",
        "'speaker_2': 'And specifically with that, uh, noncontiguous remnant parcel that was part of the Pacific Electric wide right of way, as well as with all the other parts. I'd like to ask on the record. Um, has, when you, when you do things like a equity analysis, do we do it?'",
        "'speaker_2': 'Do you ever think about like grid reliability, like where these parts are located in the city is important. Where we have parks, resource rich areas also happen to be certain areas where electricity needs water needs, different needs are either met or not.'",
        "'speaker_2': 'And parks are interesting because they kind of have everything that like an institution or city hall building a school, for instance, would have in the way of services, utilities, buildout, etc.. So I'd like to know specifically just how deep is the equity analysis.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'That concludes the public comment.'",
        "'speaker_7': 'Fantastic. Thank you. Is there I don't see any any individuals queued up because anyone want to speak on this? Councilman Austin.'",
        "'speaker_3': 'Thank you so much. I appreciate the public comment and I certainly am supportive of this land use general plan change to declare these parks in perpetuity. I always assumed that they were. That was the case anyway. I know it's also I do have a couple of questions just to clarify.'",
        "'speaker_3': 'So when we outlined our 169 parks, that was actually part of the presentation earlier. Are these parks included in that that scheme? In terms of actual parks and in acreage parking acreage in the city, are we accounting that already these parks?'",
        "'speaker_6': 'Councilmember I believe all of them are included in the 169. They're on the park's website. They're considered part of our park system. It's really more of like a a cleaned up set of actions to ensure that they have all the proper designations that should go with parks to ensure they're dedicated in perpetuity and that nothing in the'",
        "'speaker_6': 'future would be a problem for that.'",
        "'speaker_3': 'Great. And also, I'd like to just just piggyback on many much of the public comment that we've already heard. I think it's completely in the city's interest to have as many parks in green greenspace in our city as possible.'",
        "'speaker_3': 'I think it's all I think we all endeavor to have more parks, space and acreage in terms of the details. But since we last went through this exercise as a city council, I believe it was 2006, we're going to have to wait another six years to make that happen.'",
        "'speaker_3': 'Or.'",
        "'speaker_2': 'You know, no one at this table, council member, can perfectly predict the future. We'd probably be working somewhere else, but our commitment to this council is to keep our general plan, our zoning, all of those documents in in better order than than has maybe always transpired in the past.'",
        "'speaker_2': 'And part of that commitment is not waiting until you need to do a major update, but just keeping things up to date constantly and sort of looking at everything at a minimum every five years, if not more frequently.'",
        "'speaker_2': 'So this is a down payment. This is most of the parks and most of the fixes that need to be done. But there are ten more that need to be done. So there's a lot of public testimony about one of those, but there's more work to be done.'",
        "'speaker_2': 'But we don't want the perfect to get in the way of the good. So we're getting done today in front of this council what was ready to go. And the other parks have to be surveyed by the city's land surveyor.'",
        "'speaker_2': 'At one point that position was vacant. For about a year or so. We've had some slowdowns on the other parks. What we wanted to bring you was what's ready to go today and then to keep things up to date better going forward and into the future.'",
        "'speaker_3': 'And then my final question, what if we don't do this with what were the consequences or impacts of not actually declaring this park space parks in perpetuity?'",
        "'speaker_2': 'Perpetuity. So Don can build on my answer here. But it when a park is not a park in perpetuity. A future council could consider a transaction regarding that piece of real property. It doesn't mean that will happen. It doesn't mean it would happen automatically.'",
        "'speaker_2': 'But it it allows for that possibility in the incredibly unlikely event of some kind of dispute between the city and a creditor. It's an asset that could be considered by a court or other judicial officer. But once the park is recorded as park in perpetuity, cannot be sold, at least not without a two for one replacement.'",
        "'speaker_2': 'And it generally can't be seized by a creditor.'",
        "'speaker_6': 'And this is John.'",
        "'speaker_4': 'I'll just add that this is really a cleanup measure. So this isn't changing anything that is currently in existence with the parks. It's just making sure the land use designations are consistent and are all in keeping with the general plan.'",
        "'speaker_2': 'And operationally, nothing changes. All of our parks or that are parks today are all going to continue parks until they're, you know, parks in perpetuity. So from a realistic perspective of the use of those, they all stay exactly the same.'",
        "'speaker_3': 'Well, I appreciate the clarification for myself and the public as well. I certainly hope that we all can support this. Thank you.'",
        "'speaker_7': 'Thank you. So with no further comment, members, please cast your vote. We have a number of votes on this. That correct. How many?'",
        "'speaker_4': 'There's four.'",
        "'speaker_7': 'Votes. Right. Let's have skip the first vote.'",
        "'speaker_1': 'The motion is carry.'",
        "'speaker_7': 'Thank you. In another motion. And second.'",
        "'speaker_1': 'As their second vote is to declare ordinance setting aside and dedicating certain lands owned by the City of Long Beach for public park purposes and uses.'",
        "'speaker_7': 'Thank you. Members, please cast your vote.'",
        "'speaker_1': 'The motion is carry.'",
        "'speaker_7': 'Thank you. Next.'",
        "'speaker_1': 'Next photos for declare ordinance amending table 35 does to to add 11 subject parks.'",
        "'speaker_7': 'Thank you, members. Please cast your vote.'",
        "'speaker_1': 'The motion is.'",
        "'speaker_2': 'Carried.'",
        "'speaker_7': 'Thank you. That's the final motion, correct?'",
        "'speaker_1': 'Correct. Declared ordinance amending the use district map to change the zoning districts of the subject parks and remove the 1456 square foot road in park. So located at the southwest corner of East 14th Street and North or Zeba Avenue from the area dedicated as or Zaba Park City Way.'",
        "'speaker_7': 'All right, members, please cast your vote.'",
        "'speaker_1': 'The motion is carried.'",
        "'speaker_7': 'Thank you. All right. So that satisfies that item. Let's now move on to item number 22, please.'",
        "'speaker_1': 'Item 22 is a report from financial management and it does require an old recommendation to receive supporting documentation into the record. Conclude the public hearing and grant an entertainment permit with conditions for entertainment with a dancing to house, a painting debate the board at 1253 East Fourth Street, District two.'",
        "'speaker_1': 'Please stand for those that are here to testify on this item. Raise your hand. You and each of you do solemnly state that that that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_2': 'I do.'",
        "'speaker_7': 'They do. Great. Let's go ahead and start with the staff presentation.'",
        "'speaker_5': 'I'd like to introduce.'",
        "'speaker_6': 'Tara martinson, our business operations manager, and she'll give a brief presentation on this item. Thank you and good evening, honorable mayor and members of city council. Before you tonight is an application for entertainment with Dancing for House of Pain Inc DBA, The Bird, which is located at 1253 East Fourth Street in the second Council District.'",
        "'speaker_6': 'This establish operates as a bar tavern lounge. The business has a valid ABC license. It's a type 48 for on sale general public premises. This license authorizes the sale of beer, wine and distilled spirits for consumption on the licensed premises.'"
    ],
    "Entertainment Permit with Dancing for The Bird at 1253 East 4th Street.": [
        "'speaker_6': 'The business met the Long Beach Municipal Code requirements to be eligible for a temporary entertainment permit and was issued one in November of 2021. All of the appropriate departments, including the Health and Human Services Department, Development Services Department, Police Department and the Financial Management Department have reviewed the application and have provided their recommended conditions as contained in'",
        "'speaker_6': 'the hearing packet. The following recommended condition conditions on attachment A should be noted from section two of the Additional Conditions Section. Entertainment activities shall be restricted to no later than 11 p.m. Monday through Wednesday and 12 a.m. Thursday through Sunday.'",
        "'speaker_6': 'Entertainment can begin at 6 p.m. every day of the week, Monday through Sunday. The business originally applied, requesting entertainment to be permitted from 10 a.m. to 2 a.m. seven days a week, and allow each police department recommended the restricted conditions to balance community concerns with the business's needs.'",
        "'speaker_6': 'Within the additional conditions section. Item number four is the permanent has requested was requested to develop and maintain a plan to address neighborhood concerns related to the operation of the business. Some of those ideas have in the past included things like a newsletter, meetings and other communication material.'",
        "'speaker_6': 'I, along with the Long Beach Police Department and Art Sanchez, deputy city attorney, are available to answer any questions that you may have. This concludes my staff report.'",
        "'speaker_7': 'Thank you. Now we'll take it back behind the rail and we actually will go to public comment. Is there any public comment on this hearing?'",
        "'speaker_1': 'There's no public comment.'",
        "'speaker_7': 'Okay, great. So we'll take it back behind the rail. Councilwoman Allen. Yes.'",
        "'speaker_6': 'Thank you, Vice Mayor. The bird and that location has been a long standing bar in the second district. And it's definitely a popular spot for for all the locals. I know there has been some concern with regards to noise and loitering, so I would just ask that the operators be really good neighbors and honor the conditions of'",
        "'speaker_6': 'that permit. Other than that, I don't think there's any reason not to move forward with this license. Thank you.'",
        "'speaker_7': 'Thank you. It's been moved and seconded. Let's go ahead and move to our roll call. Vote, please. No, not not a roll call vote. Castro. Castro wrote.'",
        "'speaker_1': 'The motion is carried.'",
        "'speaker_7': 'Fantastic. Thank you. 23, please.'"
    ],
    "Entertainment Permit for El Barrio Cantina at 1731 East 4th Street.": [
        "'speaker_1': '23 report from financial management. It does require an oath as well. Recommendation to receive the supporting documentation into the record. Conclude the public hearing and grant an entertainment permit with conditions for entertainment without dancing to El Barrio Neighborhood Bar LLC DBA El Barrio Cantina at 1731 East Fourth Street District two.'",
        "'speaker_7': 'Looks like an oath is required.'",
        "'speaker_1': 'Yes. Please raise your right hand. Those who are here to testify on this item you in each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_1': 'So help you, God.'",
        "'speaker_2': 'And you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'Thank you. Let's go ahead with the staff report.'",
        "'speaker_4': 'Ms.. Martinson will make the presentation of staff presentation on this item as well.'",
        "'speaker_6': 'Again. Good evening, mayor and members of city council. Before you tonight as an application for entertainment without dancing for El Barrio Neighborhood Bar LLC, DBA El Barrio Cantina, which is located at 1731 East Fourth Street. This establishment operates as a restaurant bar.'",
        "'speaker_6': 'The business has valid ABC license as follows Type 47 on sale, general eating place and Type 58 Catering per caterer. Permit these license. Authorize the sale of beer, wine and distilled spirits for consumption on the licensed premises. Among other things, the business met the Long Beach Municipal Code requirements to be eligible for a temporary entertainment permit and'",
        "'speaker_6': 'was issued one in November of 2021. All of the appropriate departments, Health and Human Services, Development Services, Police, Financial Management and Financial Management have reviewed the application and have provided their recommended conditions as contained in the hearing packet.'",
        "'speaker_6': 'The following recommended conditions on attachment A are of note from section two of the additional conditions. Section number one in that section is entertainment activities shall be restricted to no later than 11 p.m., Monday through Thursday and midnight Friday through Sunday.'",
        "'speaker_6': 'Entertainment can begin at 12 noon daily. The business applied, requesting entertainment to be permitted from nine or 10 a.m. to 2 a.m. seven days a week. And the Long Beach Police Department recommended the restricted conditions to balance community concerns and the businesses needs.'",
        "'speaker_6': 'Section number six or item number six. The committee has been requested to develop and maintain a plan to address neighborhood concerns related to the operation of the business. In addition, the Department of Financial Management is requesting a change to the enclosed conditions Section one.'",
        "'speaker_6': 'Item four, with the removal of the last sentence of the first paragraph. Hours of sales. Hours of sales of alcohol shall be limited to the hours when meals are available. In this particular situation, this condition was found to be too restricted after additional consideration of the communications from the business owner.'",
        "'speaker_6': 'Although this does not remove the requirement to continue to operate a bona fide restaurant. I, along with the Miami-Dade Police Department, as well as Art Sanchez, deputy city attorney, are available to answer any questions that you may have.'",
        "'speaker_6': 'This concludes my staff report.'",
        "'speaker_7': 'Thank you. Let's go to public comment there. Any public comment on number 23?'",
        "'speaker_4': 'Chou Lin.'",
        "'speaker_1': 'Julian, please approach the podium.'",
        "'speaker_2': 'Um, I, everyone actually submitted on that. And when the owner of the business, I didn't know I was not supposed to submit the comment. So I just wanted to, I just didn't know I was supposed to pretend that I needed to come or not.'",
        "'speaker_2': 'But here I am. Um, so I don't really have any comments to this other than I'm for it since I'm a business owner. Um, and you guys are welcome to dine at the restaurant anytime.'",
        "'speaker_7': 'Thank you. Tastic. Thank you. All right, back behind the rail, councilman Alan Atherton.'",
        "'speaker_6': 'Thank you, Vice Mayor. Also. Thank you, Joe, for for coming out. It's great to great to see you. I just want to say that the Fourth Street and the Retro Row is one of the highlights of the second district.'",
        "'speaker_6': 'The bid and all the businesses there do a great job managing the area. And I know Al Barrio is a very popular a spot and Joe and Jesse have done a fantastic job with the property. If you haven't been there, the food is excellent.'",
        "'speaker_6': 'It's great ambiance and just a big upgrade on Fourth Street. So I support this entertainment permit. I do understand that some folks have some concerns about noise or congregating, you know, out there from the business. So we just ask that you kindly keep an eye on that for all of our neighbors.'",
        "'speaker_6': 'And I just want to say that El Barrio is just a welcome addition to our fourth Street restaurant community. And I know that that Joe, you and Jesse are great operators and that you'll comply with all the conditions listed and make every effort just to be a good neighbor.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_7': 'All right. Thank you. It's been moved in. Seconded members, please cast your vote.'",
        "'speaker_1': 'The motion is.'",
        "'speaker_4': 'Carried.'",
        "'speaker_7': 'Thank you. 24, please.'"
    ],
    "Resolution to Order the Vacation of Streets and Alleys within Seaport Village Complex. (District 8)": [
        "'speaker_1': 'Adam 24 is report from Public Works recommendation to receive supporting documentation into the record. Conclude the public hearing. Find that the streets and alleys within the seaport the Seaport Village Complex, located at 560 on Paramount Boulevard to be vacated, are not needed for present or prospective public use and Adobe resolution ordering the location District eight.'",
        "'speaker_7': 'All right. It's been moved and seconded. There's no oath required. Staff report, please.'",
        "'speaker_6': 'We'll have a staff report by Josh Hickman, our public works manager for this project.'",
        "'speaker_2': 'Good evening, Vice Mayor and members of the City Council. What's before you tonight is a.'",
        "'speaker_9': 'Item to vacate public right away within the Seaport Village apartment complex. The right of way is predominantly used by the complex patrons themselves and therefore not needed for a public thoroughfare. That concludes staff. Presentation available to answer any questions.'",
        "'speaker_7': 'Thank you. Was there any public comment on this item?'",
        "'speaker_1': 'No public comment.'",
        "'speaker_7': 'Thank you. Back behind the rail, councilman. Them anything?'",
        "'speaker_3': 'Yes. I'm glad to make the motion for the residents of the Seaport Village and the management makes a lot of sense for security and quality of life for the residents in that community. We've been working on this project for for a few years now.'",
        "'speaker_3': 'Glad to see it funded before us. I speak support.'",
        "'speaker_7': 'Thank you. Members, please cast your vote.'",
        "'speaker_1': 'The motion is carried.'",
        "'speaker_7': 'All right. That satisfies all of our hearings. Now back to the regular agenda. We'll take item 29, please.'"
    ],
    "Feasibility of a Safe Passage Plan for Long Beach Schools.": [
        "'speaker_1': 'Item 29 is a communication from Councilman Austin. Recommendation two requires city manager to investigate the feasibility of establishing a safe passage plan and report back to the city council in 60 days.'",
        "'speaker_7': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you so much. So, as many of you may know, last month, one of our local high school students in north London, Long Beach, was brutally attacked while walking home from Jordan High School in route to Colin Powell Elementary School.'",
        "'speaker_3': 'Our children, as we all know, our most valuable and vulnerable members of our community, and they should not have to endure violence or intimidation walking to and from school. Safe Passage programs are interventions designed to keep students from harm and ensure that they arrive safely to their schools and to their homes.'",
        "'speaker_3': 'Safe passages are also linked to decreased violence, decreased criminal activity, bullying and increased attendance among students who've been served such programs as has actually existed here in the city of Long Beach before, but most neither no longer operate or exist or on hiatus or have been on hiatus due to the COVID 19 pandemic.'",
        "'speaker_3': 'Our Long Beach Recovery Act dollars have been set aside some to implement some version of Safe Passage this summer. But these funds will only serve areas near Cabrillo Poly and Milliken High schools. I'd like to see this expanded, obviously, and I like to see a plan that utilizes the best practices of previous programs, along with input from'",
        "'speaker_3': 'our community members, local schools, obviously our police department and others to devise a manual outlining how neighborhood associations can also establish their own safe passages within their communities. Not only will this activate our communities, but it will also offer a more equitable approach to safety for middle and high school students citywide.'",
        "'speaker_3': 'Today, I'm asking for a feasibility study on safe passage and creating a Safe Passage plan in hopes that we can get it in our communities as soon as possible, hopefully before the start of the new school year. And in closing, I'd like to thank the community members who come out and support, as well as ask from our'",
        "'speaker_3': 'council colleagues and would like to open it up also for public.'",
        "'speaker_7': 'Comment as well. Absolutely. We can go to public comment. I mean, public comment on this.'",
        "'speaker_1': 'We have eight. Patricia Long. Dave San Jose. Charmaine SIM. Sydney. Ken Faye. Franklin SIM. Please approach the podium. Julie Jones. Carlos Valdes and Rene Ruiz. Patricia Long.'",
        "'speaker_5': 'I'm Patricia.'",
        "'speaker_6': 'Lang from College.'",
        "'speaker_5': 'Triangle Neighborhood Association. And I want to really thank.'",
        "'speaker_6': 'Councilman, our.'",
        "'speaker_5': 'Councilman, Mr. Austin, for bringing this to the council and also to the city. This event that occurred about one month ago has really devastated our neighborhood. That and the issues that our younger students have when they walk to Colin Powell on Long Beach Boulevard, where they're approached by sex workers on a regular basis.'",
        "'speaker_5': 'So we really appreciate the fact and I understand that there might be some money involved with this, but this issue is paramount to trying to make safety for our neighborhood. Coolidge Triangle and also Longwood. We have the support of Teresa Gomez.'",
        "'speaker_5': 'She has come to our neighborhood.'",
        "'speaker_6': 'Meeting.'",
        "'speaker_5': 'And she has inspired us to reach out to the city council and also to the city of Long Beach to help us with these issues. We also have support from College Square, that's north.'",
        "'speaker_6': 'Of us and.'",
        "'speaker_5': 'Also neighborhood that would like to be involved in this for us. Thank you very much.'",
        "'speaker_7': 'Thank you. Next picture, please.'",
        "'speaker_2': 'Yes. I'm Dave San Jose. I want to thank you, Alison, for bringing this forward. This is probably one of the most important things we can do in the city. The children are our future of Long Beach. And so if there's any ways that we can figure out to make children safe, we live in different times now and'",
        "'speaker_2': 'the times we live in. I've been here since 1940. I've never seen it like this. I've seen the good, the bad and the ugly. So before anything serious happens, I'm sure you can figure out ways to make it safer for our children because they are our future.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'Thank you. Next week, your police.'",
        "'speaker_2': 'So I can face extensive criticism. First, I want to thank Councilman Austin for bringing this opportunity for the city to engage in the Safe Passage plan. I'm very familiar with it. Due to the work that I've done with LAUSD and as well as with the Chicago Public School System.'",
        "'speaker_2': 'Um, we're in both cases, um, a lot of the racial tension in LAUSD, the example would be in Watts and in Chicago would be the South Side. It dropped a lot of the activity over 20%. So it's obviously over respect to best practices.'",
        "'speaker_2': 'It's a it's a method that works. I think that it's it's very tragic that, you know, a young girl leaving school, I think, and unfortunately has to, you know, have someone try to abduct them and and do God knows what with them.'",
        "'speaker_2': 'I think it speaks to the previous gentleman's sentiment about where the times are going. I know for a fact, just two months ago, my two nephews who go to school at a charter school on Long Beach Boulevard and 16th Street, they were there along with a few of the other black male students.'",
        "'speaker_2': 'They were attacked because of an incident with someone from a different ethnic group and where gang members walked onto the campus and just attacked the young black male students on the on the campus. So I think for will respect the safe passage plan.'",
        "'speaker_2': 'Um, you know we really have to engage with the community and not just in the sense of us that are active and, you know, come down to city hall and come to, uh, you know, speak on these things.'",
        "'speaker_2': 'But really, um, you know, these young men who are committing these activities that make it unsafe in the space, they are participants and, you know, organizations that don't have representatives that come down here to speak. And I think that in order for us to really facilitate a more safe requirement, I know with respect to the Safe Spaces'",
        "'speaker_2': 'plan and the Watts example, they hired ex-gang members to stand on guard and post within the corridors around lock in other schools. They were having a lot of these flare ups. And I think that for us to really want to see the tension to decrease, we would have to do something similar.'",
        "'speaker_2': 'And that involves engaging with the street culture, both on the African-American side and on the Latino side, because these are the two prime, uh, groups that a lot of these, uh, unfortunate moments are happening with. So we'll have to facilitate.'",
        "'speaker_2': 'I'm engaged with a group called Long Reset that was engaged in a lot of intervention work. So would love to support and thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi. I'd like to thank all of you for considering this item, because it's very important for our children and our neighborhood, not just the schools that you mentioned earlier, but all of the schools need programs like this. And if there's funding involved, please try to find money for this.'",
        "'speaker_5': 'I know we as a community can come together and try to motivate our members to volunteer. I know it's going to take coordination with lots of organizations the police, the schools, the public, the neighborhood associations. But I think working together, it takes a village to save our community and we can come together as a village.'",
        "'speaker_5': 'If you as a city council can, please give us the opportunity. Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Hello, City Council. My name is Umar Joy, a fourth desert district resident. Darrell Supernova is my councilperson. Thank you. Councilmember Al asked him for this agenda item. Safe passage for students like me is critical. I'm a seventh grader at Stamper Middle School.'",
        "'speaker_4': 'My community is pretty safe, but not all students in Long Beach are that lucky. My hope is that the city manager will find solutions or find solutions in the coming weeks for all Lumbee kids to be more safe.'",
        "'speaker_4': 'What happened to a teenage girl in North Long Beach is unacceptable and is very frightening. One problem I would like the city manager to look at is the moms in Bear.'",
        "'speaker_5': 'Bay.'",
        "'speaker_4': 'At Edison Middle School. A group of moms saw a problem with gangs and drug selling sells near and indecent, so they brought walkie talkies from Circuit City, not Amazon lets and stood out on the corners with walkie talkies helping the students near.'",
        "'speaker_4': 'Let's find ways to bring families and communities together to fix our problems. Thank you again. Council member Austin for for bringing this agenda item. I hope all council members please approve this agenda item for students like me.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, counsel.'",
        "'speaker_5': 'Thank you. Also to councilman and council member Al Austin for bringing this agenda item and for the community members that came out. I really. I, too, like my mom or dad, live in the fourth district. But I've gained an affinity for the residents in North Long Beach and what they're going through there.'",
        "'speaker_5': 'And I want us, if we can, to imagine, you know, the street where the robbery or abduction happened. It's actually a nice street. It's tree lined. And a lot of good people live there. And just to imagine someone coming up in a sedan getting out and grabbing your daughter.'",
        "'speaker_5': 'That's a tough thing. And. Some have mentioned.'",
        "'speaker_2': 'The moms brigade and.'",
        "'speaker_5': 'I learned about the moms brigade from a ninth District resident who came who came to Edison Middle School, which is really first district. And they were having an issue with drug sales there and with gangs. So the moms got these walkie talkies donated by Circuit City, and they would stand out and they would stand at different corners'",
        "'speaker_5': '. And what it did was it created something where they didn't have to have have to engage, but they could provide as witnesses for what was happening. And they were on a radio frequency so police officers could hear what was going on.'",
        "'speaker_5': 'And one mom might say, oh, I saw this happening. Did you see it? And then another would say, Yes, I saw that, too. Well, now you have a coordination with officers, but it also is involving families inside of that process.'",
        "'speaker_5': 'And I would like Tom and the team, if they could, to look into that and see if that's something that we can do. What I loved.'",
        "'speaker_2': 'About it is that.'",
        "'speaker_5': 'It was at no cost to the city. And that's important because we've got we've got budget talks coming up soon. What's also great is it puts more eyes on the street. If you go to North Long Beach.'",
        "'speaker_2': 'Or Long Beach Boulevard, what's happening with the human.'",
        "'speaker_5': 'Trafficking and prostitution? There's not all eyes on the street. I went there recently with my wife and we were doing trying to.'",
        "'speaker_2': 'Inform the community what was going.'",
        "'speaker_5': 'On so they could see it. And you should have seen the cars stop and pull over and just and gawking. There's a real problem there. And we've got to we've got to get our arms around it. And I just really appreciate, again, you bringing this agenda item forth.'",
        "'speaker_5': 'And I really want to thank the community for coming out. Want to inspire you guys to stay engaged. And thank you so much.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hi. Carlos Valdes, College Triangle. I would like to begin by thanking Councilman Al Lofton for listening to residents longstanding concerns about safety and security, and most importantly, bringing your children's safety front and center. By now, all of our council members are aware that the community is west of the 710 Freeway, and North Long Beach has been plagued'",
        "'speaker_2': 'by human trafficking, exposing children to the realities of what happens between prostitutes and johns. They see them in the act. They see the youth condoms left in the streets. They've been approached both by pimps and johns on the way to school and prom.'",
        "'speaker_2': 'And most recently, the teenager was assaulted in the failed kidnaped attempt both Coolidge Triangle and Longwood Neighborhood Associations. Choose to be proactive and not reactive. And we need your active participation. Establishing a safe passage plan built on the city's commitment to maintaining a network of strong, sustainable neighborhoods and will bring families, local partners and stakeholders together to'",
        "'speaker_2': 'keep our community safe. Our hope is the Safe Passage plan will focus on soliciting public participation to deter criminal activity and ensure that all children are able to walk to and from school safely as we continuously reinforce our community meetings throughout the year.'",
        "'speaker_2': 'The safety of our neighborhood is a collaborative effort between law enforcement and residents. By putting the power in the residents hands, we hope to increase engagement of our residents who share in vision of bringing safer neighborhoods North Long Beach or Long Beach Boulevard.'",
        "'speaker_2': 'Establishing a Safe Passage plan will provide an opportunity for community dialog that will continue to foster a culture of safety along the Long Beach Boulevard corridor. As our new councilman, I'd like to thank you, Austin, for your leadership championing action that is long overdue.'",
        "'speaker_2': 'And thank you, council members, for your consideration and partnership. And thank you to the gentleman from Long Beach. The Long Beach reset that I get that correct for serving something greater than yourself. That's all I have to say.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Renee Real, along with Neighborhood Association President. Last Monday, over 25 to 30 leaders from the North Lawn meet from the eighth district and the ninth district met with commander, police commanders, the bell. We had a long discussion about how we want our communities to be safe.'",
        "'speaker_4': 'We talked about policing, and one of the ideas that was discussed was safe.'",
        "'speaker_5': 'Passage for.'",
        "'speaker_4': 'Our children walking to and from school. And we also had over we submitted what actually I submitted to Austin a or a petition from a resident that has about over 100 signatures requesting for safety. And so, again, we're here to support this agenda item, the Narnia, the North Long Beach leaders, the resident and European Council member asked'",
        "'speaker_4': 'him for bringing this item on to the city council. Thank you.'",
        "'speaker_7': 'Thank you. Any further public comment?'",
        "'speaker_1': 'That concludes the public comments.'",
        "'speaker_7': 'Great. I'll I'll just you know, I'm happy to second this motion. Thank you, Councilman Austin, for bringing this forward. Just a few. I would say, number one, that was a tragic set of circumstances with the young lady. I had a chance to talk with her, talk with her family afterwards.'",
        "'speaker_7': 'And I agree. More needs to happen. I think we should also sort of highlight some of the good things that the city is doing in terms of the safe passages. And I want to ask the city manager if you can just update, because we funded a new Safe Passage program, our Jordan High School Recovery Funds.'",
        "'speaker_7': 'And I know that there's a LIMBERG program, but I don't know about Colin Colin Powell, if that was included. Could you could we give some updates on where we are?'",
        "'speaker_2': 'So Kelly Collopy is here to talk through a little bit of what's currently there. And then we also have our deputy city manager, Meredith Reynolds, who can talk to some of the Recovery Act programs. Thank you.'",
        "'speaker_6': 'Good evening, council members.'",
        "'speaker_5': 'So we currently have a Safe Passage program at Washington Middle School through Calvert. We just received a $3.9 million grant to extend Calvert, which will include the, um, which will include the Lindbergh Middle School. Yeah. The overall grant does cover 13 different communities, of which College Triangle is one of those.'",
        "'speaker_5': 'And so we are looking at different opportunities to support the many communities within that space. And then the Jordan High School is funded through the Recovery Act. At this time, I'm not aware of the additional space.'",
        "'speaker_7': 'Great. So let's make sure, you know, we get a good report on where all those sources of funding funding is. I know when we did last year, there was sort of in response to some of the crime that we saw increasing right at the height of the pandemic.'",
        "'speaker_7': 'We asked to identify funding sources to expand the Washington program to other neighborhoods. So what were the neighborhoods we were able to expand into? And we got we received this grant right last. Last week, correct?'",
        "'speaker_5': 'Yeah.'",
        "'speaker_7': 'So that give us just a general update on what are the types of activities we're going to be able to see and what are the neighborhoods included in this $3.9 million grant?'",
        "'speaker_5': 'Yeah. So the, um, the different neighborhoods are Adams, Carmelita Coolidge, the Crow's Triangle, um, the Forest Park, uh, grant area, grant Community, Highland Park and Lindbergh and North Long Beach. And then in Central Long Beach shall be central in Rose Park, St Mary's and uh.'",
        "'speaker_5': 'Zafar Yeah. So lots of different, lots of different areas, lots of different communities. But the council districts are in one, two, six, eight and nine, so they are pretty spread out across the central north, um, north areas and some of the west.'",
        "'speaker_5': 'So the key things that will be happening is we have developed a gun violence response protocol in partnership with the police department. So if there is a violent action, then the police department will respond and then they will call our team out to respond and work in wraparound services to those impacted by the gun violence, as well'",
        "'speaker_5': 'as to engage and bring to do work with peacekeepers. So those peacekeepers are trained in interventions and to really those peacekeepers will be available with those within those communities, um, to support the communities after, after something, you know, some sort of violent, um, event happens and then so there will be trained intervention this.'",
        "'speaker_5': 'And then from there we're also going to be doing a lot of community work together. So you'll find in the Washington neighborhood right now that there are a lot of community activation. The community, the community members are very engaged in the Safe Passages program as well as a lot of other activation activities.'",
        "'speaker_5': 'So those are all part of this grant that is forthcoming.'",
        "'speaker_7': 'All right. So so I'll just I'll just say it. Certainly, you know, the pandemic is hard to show sometimes all the work that's happening, but it doesn't happen overnight. You know, this was 2020 when we began talking about expanding the program in North Palm Beach.'",
        "'speaker_7': '2021 was the city council gave direction to make it happen. We went through the grant application process. We received recovery dollars. That was one part of it, and that was 3.9 million we last we announced last week. The good news is, for all the programs and the violence prevention, we want to do the funding's there.'",
        "'speaker_7': 'That's the big part. And and if you want to see a reference, just look at watch the neighborhood or do the event the event we did at Coolidge Triangle at Coolidge Park maybe a year ago. So more of that activity can come.'",
        "'speaker_7': 'So I certainly support this. I think one thing that one gap that I do see is Colin Powell. So I know Jordan is funded. I know Lindbergh is funded, but Colin Powell certainly needs to be. So we have to figure out how to either, you know, include it in recovery funds or some other way.'",
        "'speaker_7': 'But that area needs to be included. Okay. All right. Thank you. Next is Councilman Juvenile. Thank you. And I'd like to thank all the speakers here tonight and especially my enjoy. I'm already getting text messages and what a great.'",
        "'speaker_2': 'Job you did. So congratulations.'",
        "'speaker_7': 'Thank you, Councilman Austin, for bringing this very important item forward.'",
        "'speaker_2': 'And I stand in support. I do have some comments. I've been asked to read.'",
        "'speaker_7': 'On behalf of Councilwoman.'",
        "'speaker_2': 'Price. I fully support this item and.'",
        "'speaker_7': 'Thank Councilman Austin for bringing it forth. For over.'",
        "'speaker_2': 'Ten years, I've been involved in a Safe Passage.'",
        "'speaker_7': 'Program and activation program. I run an elementary school that is located in a high.'",
        "'speaker_2': 'Gang activity area. I found the program to be very effective in activating the area, increasing community presence and allowing children to have a safe pathway to and from school. I think the key to the programs like this is working with local community based organizations and parents group groups to ensure that the community is represented along the pathways'",
        "'speaker_2': '. Engaging the community in these efforts is critical to the success of the programs, and I encourage our city's health department. Who's overseeing this and other violence prevention prevention programs. To look for more ways to incorporate the local community based organizations.'",
        "'speaker_2': 'End of quote. I'd just like to add something else here, and that is our school just.'",
        "'speaker_7': 'Ended in Long Beach Unified last week.'",
        "'speaker_2': 'Parents have already.'",
        "'speaker_7': 'Reached out.'",
        "'speaker_2': 'To me about school security issues. So I'd just like to encourage any community based organization.'",
        "'speaker_7': 'Or individuals to go ahead and.'",
        "'speaker_2': 'Reach out to your.'",
        "'speaker_7': 'To your council office.'",
        "'speaker_2': 'If you don't.'",
        "'speaker_7': 'Know that school board member and whatnot. And we can certainly connect you. Thank you. All right. Thank you, Councilman Sorrell.'",
        "'speaker_4': 'Yes, thank you, Vice Mayor. Yes. I want to thank Councilmember Austin for bringing this forward and amplifying the ongoing concern around safety. I think that it was thank you for all of the public comments that were made today.'",
        "'speaker_4': 'And I think that I wanted to also make sure to share that it's something that builds upon what was brought forward back in 2021, February of 2021, and how we're able to accelerate violence prevention in addition to safe passage, but generally in our communities.'",
        "'speaker_4': 'And that was the, I think, request. Part of that was to look for additional funding, which was mentioned earlier. And that's where we're able to capture the additional need that was, I think, mentioned earlier. I think as well as requested.'",
        "'speaker_4': 'So I appreciate the conversation that happens at the neighborhood level as well as the community level for ongoing conversation and exploration to make sure that we're working to make everyone in addition to our youth, safe as well. And, you know, one of the things that I also wanted to see if we can hear a little bit more'",
        "'speaker_4': 'is I do hear there is concern around how do we ensure there the program is working collaboratively. Can you share again, Miss Colby, how this program, as far as this grant I think you mentioned, is it the CAO VIP?'",
        "'speaker_4': 'Can you share a little bit more about how that would work? You mentioned peacemakers or peace civilians. That would be key peacekeepers. Excuse me.'",
        "'speaker_5': 'And so this is a partnership with many of our departments across the city, as well as the community members. And so, you know, included in this is workforce and the connection to employment opportunities for our youth parks and activating spaces and, you know, the library and activating those spaces as well as the response and engagement with the'",
        "'speaker_5': 'police department. So there are many different opportunities in the Washington neighborhood. The community members are very engaged as well in the planning in terms of, you know, the activation of spaces as well as, you know, as well as the Safe Passage program.'",
        "'speaker_5': 'So there are we have a strong connection and the grant is all of these are listed. And in terms of the types of those activities.'",
        "'speaker_4': 'Can you mentioned the central Long Beach areas that you'll be also expanding to, in addition to what was mentioned in North Long Beach as well.'",
        "'speaker_5': 'Yeah, so Center Hellmann Rose Park, Saint Mary's and Sophia Green.'",
        "'speaker_4': 'And I just want to mention how how proud I am to have brought this item forward with Vice Mayor Richardson, as well as councilmembers and Diaz and Councilmember Allen last year, in order for us to explore the funding that the Health and Human Services Department worked hard in achieving.'",
        "'speaker_4': 'So I'm really grateful for all the work the department staff have done with your leadership, Ms.. Calliope in receiving that $3.9 million grant to the Health Department for us to do the violence prevention in addition to the safe passage work.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_7': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you again. I want to thank the community for coming out. We've been listening and looking at creative ways to address your concerns. But obviously there's a void and a real need to address safe passage in our our communities.'",
        "'speaker_3': 'I want to be really clear. It was mentioned on a couple of occasions. This actually item builds upon, you know, our violence prevention plan or healthy and safe communities. Tonight's agenda item specifies safe passage for students coming to and from school.'",
        "'speaker_3': 'I want to be very, very clear on that. I know our healthy communities, safe and healthy communities plan through our Recovery Act specified three high schools, Cabrillo High School, Millikan High School and Long Beach Poly High School. It did not mention Jordan.'",
        "'speaker_3': 'It didn't mention, you know, some of the other areas in North Long Beach. And so the item tonight, it was really to build upon the Safe and Healthy Communities Act, but to specify safe passages to and from school for our students.'",
        "'speaker_3': 'And I think I want to make sure that we distinguish that and be clear. I heard from public comment. It does take a village is going to take us all and everybody every adult should take on the responsibility to to defend and protect our children in the city.'",
        "'speaker_3': 'And so I certainly am encouraged seeing that community organizations want to be involved and engaged. And this doesn't necessarily mean that everybody's going to get paid. We can create a volunteer brigade throughout our city to ensure safe passages for our children.'",
        "'speaker_3': 'And so, again, one of to clarify some some points here, but again, thank you to the community for coming out and support and the support of comments from my colleagues. I look forward to getting a report back very soon from staff.'",
        "'speaker_7': 'Thank you. Thank you, Councilman Sunday House.'",
        "'speaker_4': 'Thank you. Thank you, Councilmember Orson, for this item. I think it's very important that we really, really take into consideration the preventative measures that we can put into place. I think that, you know, that's something that's very important.'",
        "'speaker_4': 'I'm so sorry about this incident that happened to this young lady. It was just heartbreaking. I'm I'm so happy that besides the fact that I do believe she's will forever be traumatized by it, because I will be I you know, I'm really glad that there was an even more severe outcome to this.'",
        "'speaker_4': 'But when things like this happen, they teach their teachable moments. And I think that that's when, you know, we are able to come together as a community and try to prevent further things from happening like this. So I think that it's very important.'",
        "'speaker_4': 'I know to me, my community is as I mentioned before, we have been working on preventative measures with with county on being able to make a safe passage to to our schools, because that's mostly where our our youth go to is, you know, to and from school.'",
        "'speaker_4': 'So thank you to all the incredible work, Kelly, that you and your team have done and can. He needed to do, not only in my district, but citywide. And I think that that's what we need to continue working on and protecting our children as best we can.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_7': 'All right. Thank you. Before we go to the vote, just again, we certainly hear you and there's a lot of activity happening and we hear very clearly safe passages is what they're looking for. Can we clarify, is Jordan included in the recovery funds?'",
        "'speaker_5': 'Jordan is currently included.'",
        "'speaker_2': 'In the recovery fund. Okay.'",
        "'speaker_7': 'And Lindbergh is in the new grant, red Corvette grant. And we want to explore adding Colin Powell.'",
        "'speaker_5': 'Yes. And so we do have within the recovery fund the opportunity for at least one other middle school.'",
        "'speaker_2': 'That has yet to be assigned.'",
        "'speaker_5': 'So we can be working at those different middle.'",
        "'speaker_2': 'Schools.'",
        "'speaker_7': 'Fantastic. And there may be some economies of scale because Jordan high students and the Colin Powell students, sometimes it's the same household, so the same route in some ways. So we just need to make sure a lot of these boulevard is covered.'",
        "'speaker_7': 'Okay. Thank you so much, members. Please cast your vote.'",
        "'speaker_1': 'The motion is carried.'"
    ],
    "Green Shipping Corridor and Decarbonization of Maritime Shipping Industry.": [
        "'speaker_7': 'Thank you. Item 30, please.'",
        "'speaker_1': 'Item 30 is a communication from Councilwoman Allen, Chair of the Climate Action and Environmental Committee, recommendation to inform the Harbor Department of the following City Council recommendations with the intentions of creating a green shipping corridor at support for legislation to rapidly decarbonize the maritime shipping industry and to create green shipping corridors to the cities 2022 through 2023'",
        "'speaker_1': '. State and federal legislative agendas require city attorney to draft resolution, calling on top maritime importers to Long Beach to adopt existing emissions reducing technologies and take steps toward making port calls to the San Pedro Port Complex on zero carbon ships by 2030 and pursue all the above items with a focus on incentives and provide input on incentive'",
        "'speaker_1': 'types.'",
        "'speaker_7': 'All right. Great. Councilman Allen.'",
        "'speaker_6': 'Thank you. Vice Mayor, can I kind of request that we go to public comments first?'",
        "'speaker_7': 'Great. Is there any public comment on item 30?'",
        "'speaker_1': 'Yes. Dave Shukla. Patricia Chen. Grace Lawrenson. Do Denuncia hinder. Anna Kristiansen, please approach podium.'",
        "'speaker_7': 'All right, come on down. Who's first? Dave Shukla. All of you. Okay, well.'",
        "'speaker_2': 'Every one of them first.'",
        "'speaker_7': 'Okay, fine. Whoever is in front.'",
        "'speaker_1': 'Chen Grace.'",
        "'speaker_5': 'Good evening. I'm Patricia Chen, and I'm a member of the Unitarian Universalist Church of Long Beach. And I am here to support or to express my strong support for item number 30. Um, our faith centers around eight principles, and I'm just going to tell you, the seventh and the eighth are about focusing on respect for the environment'",
        "'speaker_5': 'and responsibly dismantling racism in ourselves and in our institutions. Um, I see supporting the proposed resolution and the item in general as an opportunity to support our principles in improving environmental quality and addressing harm to the many people of color who in the past had very little choice in their housing, and thus they have been in close'",
        "'speaker_5': 'proximity to uh, harmful emissions from the port area. And particularly, I've seen maps of cancer in the city of Long Beach and they're very tightly clustered around the port, and that makes me feel very strongly on these issues and just really want to express support for, um, asking our large major retailers to please insist on clean shipping'",
        "'speaker_5': ', uh, for the goods that they're importing to sell here in Long Beach.'",
        "'speaker_7': 'Thank you. We'll let you finish. But we I don't think we have quorum right now. When we pause. When we pause for a moment, we establish quorum. Is that councilman super over there. Does that count for quorum? Nope.'",
        "'speaker_7': 'No. Okay. Councilman Suber. No. We're going to need you to come back behind the rail. Sorry, buddy.'",
        "'speaker_2': 'All right. I think we're going.'",
        "'speaker_5': 'To end with a thank you to you for bringing this item forward. And it's very important. Thank you.'",
        "'speaker_7': 'Certainly. Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi, I'm Bruce Lawrenson and I'm from the seventh District. And I do appreciate everything that the city has been doing to combat climate change. And the, uh, the, the part is a particularly difficult issue and it every little bit helps and decarbonizing shipping will be a big step in creating clean air and preventing disease in West Long'",
        "'speaker_5': 'Beach and will also help to stop global warming. Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hello, Mr. Vice Mayor and members of City Council. My name is Daniel Heydari, and I am the Sheppard Zero Campaign Lead with Pacific Environment, which is a global climate NGO that focuses on serving poor communities and advocating for zero emissions ocean shipping.'",
        "'speaker_2': 'We possess rare consultative status at the United Nations International Maritime Organization, and I am based here in Long Beach. Pacific Environment. Cyber Monday 2021. Report Shady Root How big retail and their carriers pollute along key ocean shipping corridors can target an Amazon to be top big retail contributors to Long Beach ship congestion and pollution crisis.'",
        "'speaker_2': 'And these companies reliance on the dirtiest fuel in the market for ocean shipping. Heavy fuel oil is causing high rates of asthma, cancer and premature death in West Long Beach, where residents experience up to eight years shorter life expectancy than the Los Angeles County average, according to the city of Long Beach is 2019 Community Health Assessment.'",
        "'speaker_2': 'Indeed, Black Long Beach residents are hospitalized with asthma at eight times the rate and Latinx residents are twice the rate as white Long Beach residents. The problem has only worsened during the pandemic. In 2021, cargo ship congestion at the San Pedro Bay ports caused an increase in nitrogen oxide emissions, equivalent to adding 5.8 million passenger cars to'",
        "'speaker_2': 'the region and an increase in particulate matter emissions equivalent to 100,000 big rig trucks per day. Both pollutants are associated with higher risk of premature death. The global shipping industry accounts for 3% of global climate emissions, more than global air travel.'",
        "'speaker_2': 'If shipping were a country, it would be the world's sixth largest polluter, about the same emissions as the entirety of Germany. On its current trajectory, ocean trade is projected to grow as much as 130% by 2050. Over today's trade volume.'",
        "'speaker_2': 'If ships remain on fossil fuels, they will represent 17% of global carbon dioxide emissions by mid-century, as the most recent United Nations Intergovernmental Panel on Climate Change report warns. If we hope to limit global warming to 2.7 degrees Fahrenheit and save our home on Earth, we must have our greenhouse gas emissions from 2019 levels by 2030.'",
        "'speaker_2': 'This includes demand, including industries like cargo, cargo shipping work alongside ports, governments and retailers to transition to 100% zero emission shipping this decade. Otherwise, we risk frequent power outages, deadly heat waves and uncontrollable wildfires. All life as we know it is on the line.'",
        "'speaker_2': 'We must do everything in our power to save everything we can before it's too late. Thank you so much.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'And a kristensen. He had me at all. Life as we know it is on the line. Just saying. I really want to thank Cindy Allen for this, introducing this item as well as the next one, which has a lot of lines crossing it out because apparently our city attorney needs to take a harder look at it.'",
        "'speaker_5': 'But I think we're coming to the point here where our city, our city council, our city manager are all of our staff. We need to pull together to realize that it's racism. Environmental racism and environmental justice and environment, period are all, you know, needing an awful lot of attention here.'",
        "'speaker_5': 'And it's really weird how when you think like growing up, how Signal Hill got separated precisely because the oil industry didn't want to have to contribute to the well-being of all the people whose oil that they were drilling.'",
        "'speaker_5': 'And now we have a port that's a very wealthy port. I mean, it just grows and grows and grows. And we have the president making special effort to keep the cargo moving. Right. But what about the quality of life?'",
        "'speaker_5': 'It's kind of stunning that you can't it doesn't make sense. Why should Wilmington be so, so poor when the port is creating so much wealth? So this disconnect, I'm not saying anything new here. Not like the guy behind me.'",
        "'speaker_5': 'I mean, there is your expert. When the city outsources and looks for experts, hire that guy. I mean, pay him because this is an NGO. An NGO appeared before you today that that is government standing he government his organization has government standing before the United Nations.'",
        "'speaker_5': 'He knows a lot about this. You know, my son did tell me this week that one cargo ship generates an incredible amount of pollution, more than so many cars. So it's good that we try to drive electric cars and conserve and do all of that.'",
        "'speaker_5': 'But these are the big polluters. They're are also the big job creators. And the unions back them. And that's our other issue with workers. Workers whose lives are at risk, whose own family's lives are at risk, are showing up to support big pollution.'",
        "'speaker_5': 'And that's something also quite unfortunate. I just came here to say that we know in the world when the oil terminal issue came up, the room had a lot of people from out of town. I don't think we are SEAL Beach.'",
        "'speaker_5': 'I don't think we are suspicious of someone who didn't grow up in Long Beach. That were bigger than that. We're the largest city in California. But but I do think we should pay attention when people bother when these and I know probably a lot of people were planning on coming tonight for the next agenda item as well'",
        "'speaker_5': '. I saw the list of people supporting or taking a hard look at what we're doing right here in town when it comes to ending our own pollution creators, our own oil industry. So thank you for this opportunity to speak.'",
        "'speaker_7': 'Thank you. David, your last speaker.'",
        "'speaker_2': 'It's okay for me to speak last. Gave me time to caught the world, so to speak. Thank you for letting me speak last. It gave me time to look up my comments on Earth Day that are not part of the comment on legislative.'",
        "'speaker_2': 'But it doesn't matter. Very briefly, Councilwoman Allen, thank you for bringing this forward from Earth Day to today. The issue of green shipping corridors isn't just an environmental one. It's an economic one. Being able to control these shipping corridors, being able to control where the ships are charging up, especially about 200 mile marker where we were just'",
        "'speaker_2': 'breathing in all that pollution over these past month. That's going to matter for competitiveness for our port. As I've explained to Director Cordero and others there, it's an important item, and it may well be that the Port of Los Angeles is as much a frenemy and competitor as it is as a partner, specifically on this issue of'",
        "'speaker_2': 'the offshore wind leases, because that's where you can get all the juice you need to cool down the ships. I would love to see what the incentives and some of the details are of a detailed guide. Sure. But overall, thank you so much.'",
        "'speaker_2': 'It's a really great idea. Happy to support it.'",
        "'speaker_7': 'Thank you. That satisfies public comment. Take it back behind the real councilwoman Allen.'",
        "'speaker_6': 'Yes. I just want to say thank you to all the members of the public that came here and commented and thank you to Daniel Heydari from ship at the zero four. You said it all. I agree with everything that you said.'",
        "'speaker_6': 'I appreciate the advocacy of all of our allies. We're fighting the good fight. So I appreciate you showing up and speaking. This is a great item that signals our city's alignment with the green shipping goals. And I want to thank the Port of Long Beach for joining the ally Shanghai Green Shipping Corridor.'",
        "'speaker_6': 'This was absolutely great news. And I know that we heard this in committee and it hadn't happened yet. So. So just. Thank you. It's just positive news, you know, all around. Once this agreement is finalized, I would love to see it become a playbook to work with other ports to create more green shipping corridors.'",
        "'speaker_6': 'The city of Los Angeles passed a green shipping resolution on October 9th, 2021. And tonight, I hope that Long Beach will do the same and approve this kit, this committee recommendation. Our two ports, one beach and alley, both represent much economic activity and also incredible opportunity to improve our local air quality.'",
        "'speaker_6': 'So by working together to clean up our regional air quality. Long Beach and L.A. will continue to make a very significant and big impact. So thank you all for being here.'",
        "'speaker_7': 'And tastic. Thank you, Councilman Zoro.'",
        "'speaker_4': 'Yes. I want to thank Councilwoman Allen for her leadership on this item. You know, I think that it's important that we really look into all avenues of ways that we can reduce climate change. And I think this is a really important item that we begin to work on.'",
        "'speaker_4': 'So I support this item.'",
        "'speaker_7': 'Fantastic. I also want to just say great work to Councilwoman Allen and your committee. I've been briefed by this group and I'm happy to support the resolution today. I, I understand. Is the staff have any comments or the.'",
        "'speaker_2': 'From a staff perspective, I think this really is something that we'd be asking the port to take the lead on, as they're kind of the experts. We would certainly added in to our legislative agenda and be able to support the concepts and we haven't had a chance yet to really have that discussion with the port yet.'",
        "'speaker_2': 'But it's my understanding they're prepared to start looking at this.'",
        "'speaker_7': 'Okay, great members, please cast your vote.'",
        "'speaker_1': 'The motion is carried.'",
        "'speaker_7': 'Thank you. Item 32, please.'",
        "'speaker_1': 'Item 32 is reported from Economic Development and Public Works recommendation to execute a Supplemental Agreement to Management Agreement with ASEM Global to complete various capital improvements at the Long Beach Convention and Entertainment Center in the amount of 1.4 million.'",
        "'speaker_1': 'District one.'",
        "'speaker_6': 'Mayor Can I just say something? I mean, I'm sorry, Vice Mayor.'",
        "'speaker_7': 'Let's just get the motion cleared up. I just want to go through it, Councilman. Alan, 1/2.'",
        "'speaker_6': 'I know I have to recuse myself because I do own two properties that are within the the FT 500 feet of the convention center. But does that lose quorum? Okay.'",
        "'speaker_7': 'Great. All right. Is there a staff report here?'",
        "'speaker_2': 'Yes. Johnny Vallejo can give a very brief staff report.'"
    ],
    "Supplemental Agreement for Capital Improvements at Long Beach Convention and Entertainment Center.": [
        "'speaker_9': 'Yes. Good evening. Vice Mayor and city council decided is for a supplement supplemental agreement with ASM Global to complete various capital improvements to the Long Beach Convention Entertainment Center. These improvements would include improvements to the areas of the Beverly O'Neill Theater, Terrace, Theater, Terrace, Plaza and Promenade, among others.'",
        "'speaker_9': 'So this is a typical in arrangement with the city and some global to complete capital improvement projects on behalf of the Public Works Department.'",
        "'speaker_7': 'Right. Pretty straightforward. Any public comment on this item?'",
        "'speaker_1': 'No public.'",
        "'speaker_7': 'Comment numbers. Please cast your vote.'",
        "'speaker_1': 'Councilwoman Sarah. Motion is carried.'",
        "'speaker_7': 'Thank you. Item 33, please.'",
        "'speaker_1': 'Item 33 is reported from Economic Development and Public Works recommendation to execute a hotel management agreement with Evolution Hospitality LLC for the reopening and operation of the Queen Mary District one.'",
        "'speaker_7': 'Councilman Hassouna. Okay, great. Is there a staff report here?'",
        "'speaker_2': 'Yes. Vice Mayor So this is a very significant item. We've been for months working on a negotiation to bring this item to you to be able to reopen the Queen Mary. It's been a strategic priority of this council is to get the ship back open again and generating revenue so we can put those revenues back into the'",
        "'speaker_2': 'asset. So we've worked very closely with the port, with the Harbor Commission on this item. They've been part of it, as we've been contemplating, of course, a future transaction where they would would take over this asset. And I'd like Johnny Boy here to kind of walk us through the concept here, how it would work, what some of'",
        "'speaker_2': 'our obligations are, and also some of the upside revenue projections that we expect to realize from this from this item. Thank you, Johnny.'",
        "'speaker_9': 'Thank you. As Tom mentioned, this item is a recommendation for hotel management agreement with evolution, hospitality for Operations Queen Mary. I thought a really brief history of management of Queen Mary would be helpful. So as noted here, the Queen Mary was purchased by the city in 1967, opened to the public in 1972, and was operated by the'",
        "'speaker_9': 'city for five years. Oversight of the ship was in passing the Port of Long Beach in 1978, whereas operated by Rather Corporation, then Disney under long term lease. Disney terminated their agreement in 1992. And in that same year, the Board of Commissioners transferred control back to the city.'",
        "'speaker_9': 'Under city control, there have been a series of lessees, including USDA, Save the Queen, Jefferson and Urban Commons, all struggling under the long term lease structure and the debt incurred acquiring the lease. In 2020, the Queen Mary was closed due to COVID, and after several notices of default, the lessee ultimately filed for bankruptcy.'",
        "'speaker_9': 'Upon notification of bankruptcy by the master lessee, the city engaged evolution hospitality under a caretaker agreement to maintain the ship and former leasehold area. This agreement was minimal in scope, was only meant to provide core maintenance and security of the site.'",
        "'speaker_9': 'Additional. Additionally, evolution provided support for the Public Works Department and Economic Development Department through the ongoing implementation of critical projects previously approved by City Council. Evolution is also work along the fire department, developing an updated emergency response plan for the Queen Mary and implementing repairs.'",
        "'speaker_9': 'Improvements to the fire life safety systems. Instructed by the city council, the city the city began negotiating with evolution, hospitality for a broader hotel management agreement. Besides extensive experience with Queen Mary and its unique challenges, evolution together with their parent company, Anchorage Hospitality, is the largest hotel operator in the country.'",
        "'speaker_9': 'Economic Development staff have worked with staff from Public Works, Hybrid Department and the Office of Special Events and filming to develop a more comprehensive hotel management agreement. We also engage consulting services of Kaiser Master Associates to review aspects of the proposed agreement.'",
        "'speaker_9': 'It's important to note this is a management agreement as opposed to the former lease structure. So the city retains significantly more responsibility for the asset, such as major capital, such as major capital improvements. But the city also is entitled to a majority of net profits generated at the site.'",
        "'speaker_9': 'We feel we have developed a comprehensive yet flexible agreement and evolution has made concessions which reflect their commitment to the asset and belief in the viability of the Queen Mary as a hotel and attraction. To that end, we have negotiated five major terms and conditions.'",
        "'speaker_9': 'This agreement is for an initial five year term with two successive one year options at the discretion of the city. Evolution will be responsible for the former Queen Mary leasehold area, including the Queen Mary and adjacent parking. They will operate and manage the Queen Mary hotel attractions, retail, food and beverage parking and ship based special events.'",
        "'speaker_9': 'The city will reimburse evolution for reimbursable expenses in the course of the reopening and evolution as their base fee will be paid 2.5% of total operating revenue in year one and 2% in year two and beyond. This is a reduction in their standard 3% base fee.'",
        "'speaker_9': 'He said he will pay evolution $9,000 a month for centralized accounting and marketing support. As a performance incentive. Evolution may earn 10% of earnings before interest depreciation and amortization in excess of 7.5 million. Please note a slight change in this term as described in the written staff report.'",
        "'speaker_9': 'Instead, Citi would pay evolution based on an undated financials and reconcile against added financials if needed. We've obviously set a performance threshold whereby the city would have the right to terminate the agreement without penalty if certain performance measures are not met.'",
        "'speaker_9': 'If, though the city decides to terminate the agreement for the sale or lease of the asset or otherwise defaults within the first two years, the city would be required to pay a termination fee, which is calculated based on previous base fee and monthly operations.'",
        "'speaker_9': 'For reference, a simple calculation based on a second year termination would result in approximately $500,000 termination fee. For the period prior to reopening. The city will pay evolution $25,000 a month and cover documented reimbursable evolution will proceed. We'll provide a reopening budget, setting forth the proposed costs and expenses anticipated to be incurred during this reopening period.'",
        "'speaker_9': 'This is currently estimated at approximately 1.6 million. Also to safely reopen in limited hotel attraction and visitor services services. Approximately $1 million in improvements are needed for such items as those noted here. Boilers, piggyback repairs, elevators, etc.. All funds received by evolution in the operation of the Queen Mary, including working capital furnished by the city, will be'",
        "'speaker_9': 'deposited into an operating account. To the extent funds are available in the operating account, evolution shall pay all operating expenses as part of its audit rights. The city will have the right to inspect this operating account at any time.'",
        "'speaker_9': 'At the end of the fiscal year, evolution will distribute to the city all sums, all sums in the operating account in excess of the working capital requirements. To ensure the ability to pay for eligible operating expenses and in accordance with industry norms.'",
        "'speaker_9': 'The city will provide $1.5 million in working capital to be placed in the offering account upon execution of the agreement. Please note for accounting purposes, this will be booked as prepaid expense does not affect the city's net position of the City Fund and does not represent any additional compensation or expense other than that already contemplated in the'",
        "'speaker_9': 'agreement. Its working capital level will be maintained and anticipated to be supported by revenue generated upon reopening of the ship. 4% of total operating revenues shall be allocated and paid monthly to an FINI reserve for replacement substitution and additions to furniture, fixtures and equipment.'",
        "'speaker_9': 'Any funds remaining in the FFP nine reserve at the end of the fiscal year will be rolled over to the next fiscal year, and upon expiration or term termination of this agreement, evolution shall remit all remaining amounts in the FFP reserve to the city.'",
        "'speaker_9': 'Evolution will also be required to produce monthly financial reports and annual audited financial reports showing the results of operations of the asset throughout the fiscal year. Evolution will keep full and accurate books of account and other records reflecting the operation of the Queen Mary.'",
        "'speaker_9': 'And those records will be available to the city and its representatives for examination, audit and inspection. Evolution will provide an annual operating budget and capital budget prior to the beginning of each fiscal year. The capital budget will set forth in reasonable line item detail proposed capital projects and expenditures, including planned FMA opening expenditures.'",
        "'speaker_9': 'The city will provide approval or disapproval of these budgets within 30 days. City will be responsible for the cost of larger capital improvements to the ship and for restoration and preservation of historic items beyond maintenance of those items.'",
        "'speaker_9': 'Evolution will continue to engage the services of a historic resource advisor, so evolution can probably maintain and manage historic assets and identify priority projects prior to the hotel's closure in 2020. Evolution How Labor Agreements with Seafarers, International Union and International Brotherhood of Teamsters for All Hourly Associates that totaled approximately 300 staff.'",
        "'speaker_9': 'Evolution will continue to honor these agreements upon the hotel's reopening. Evolution will also make every effort to provide employment opportunities for those that were previously employed on the ship. Insurance Liability Terms. The proposed agreement have been reviewed by Citi's risk manager.'",
        "'speaker_9': 'I will note that the indemnity provisions for hotel management agreements per industry norms are unique in that the city retains much of the liability associated with operation of the ship, although this liability is typically covered by insurance. The rationale being that operator fees are relatively low and the owner in this case the city, retain a vast majority'",
        "'speaker_9': 'of net operating profits. His recommended. The recommended action will result in approximately $2,870,500 in estimated pre-opening and reopening costs in Foyer 22 in the Thailand Area Fund Group. This estimate includes 1.6 million, pre-opening costs for staffing and other approved costs.'",
        "'speaker_9': '1 million of pre-opening improvements for priority visitors serving project needed to safely reopen the ship, an 8.5% contingency and reopening service fees. These expenses will be offset to the extent possible by revenue generated from the Queen Mary. Harry Bridges Special Events Park and leases in the vicinity of the former Queen Mary leasehold.'",
        "'speaker_9': 'Any expense is not offset within the title injury fund group may need to be covered by Title Thailand's Operating Fund. Evolution and staff projections anticipate the ship's operations can fully offset expenses for FY 23, with net revenue to the city approaching $1,000,000.'",
        "'speaker_9': 'After all costs are settled for FY 24 and beyond, the net revenue projections to the city may exceed $7 million annually. This does not even include revenue generated at Harry Bridges Special Events Park or from leases in the vicinity of the Queen Mary, such as Carnival Island Express helicopters or Catalina Express.'",
        "'speaker_9': 'This concludes my staff report. Thank you.'"
    ],
    "Hotel Management Agreement with Evolution Hospitality for the Queen Mary.": [
        "'speaker_7': 'All right. Thank you. Is there any public comment on this item?'",
        "'speaker_1': 'Yes, we have two. Julian G and Anna Christiansen's.'",
        "'speaker_7': 'Okay, let's handle that now.'",
        "'speaker_6': 'Good evening. My name is Juliana. I'm a resident and small business owner in the city of Long Beach. My wedding was originally scheduled to be on the Queen Mary on March 28th of 2020, the week after COVID shutdowns had begun.'",
        "'speaker_6': 'It was then rescheduled for August 8th, 2020, and eventually canceled. The onset of the global pandemic was obviously disruptive to every person and business around the world, and I consider the rescheduling and canceling of my wedding to be a wrong place at the wrong time type of scenario.'",
        "'speaker_6': 'It's unfortunate, but there was no one to blame. However, for the Queen Mary, it forces and ultimately the owner of the boat. The city of Long Beach. The repercussions of the pandemic included shedding light on various malpractise handling of the ship's assets, including the mishandling of funds for numerous local citizens, such as myself and my husband.'",
        "'speaker_6': 'By mid-June of 2020, it was clear that our rescheduled date of August eight would not be able to happen. The manager of the boat inform us that their owners were in a, quote, deep financial situation and advise us to postpone until 2021.'",
        "'speaker_6': 'He told us that if we submitted a request for a refund for the $15,600 we had already deposited, we would likely never receive our friends back. But if we waited, he guaranteed he would. They would honor our deposits and host the wedding as originally planned.'",
        "'speaker_6': 'Over the last two years, I have struggled to get any information or guidance from the city. The last response I received from the city, a city employee, was in July of 2021, saying the city would notify me if any relevant information became available.'",
        "'speaker_6': 'After numerous attempts to follow up over the last year, I have not received another reply. Since then, after diligent research has been shared publicly by the Long Beach Post and the Long Beach Reform Coalition, it's abundantly clear that the city of Long Beach was not only negligent in managing the lease of their property, but also knowingly continued'",
        "'speaker_6': 'business with the leaseholder who was failing to care for the ship, its employees, or many of the patrons like me.'",
        "'speaker_5': 'That trusted them with tens of thousands.'",
        "'speaker_6': 'Of dollars. It was also recently informed that Councilwoman Cindy Allen enjoyed a private stay there overnight during the closure. And I just have to say that really felt like a punch to the gut. On top of everything else we've been going through and having been basically stonewalled from the city in getting any kind of response or support'",
        "'speaker_6': '. So today I'm formally asking that before the city enters into yet another multimillion dollar business deal, it first pay back the debts that occurred due to their mismanagement of the historical site.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Anna Kristensen loads through Wetlands Task Force. I gave you a couple of pieces of paper here, a couple of documents to review at your leisure. This is a little bit not so direct, but it does involve the iconic Queen Mary as.'",
        "'speaker_5': 'What do you think of when you think of the Queen Mary? You think of fireworks. Fireworks on all summer, fireworks on every holiday. And once again this year, we are being told there will be fireworks downtown from the Queen Mary.'",
        "'speaker_5': 'We're not quite sure. So I think when we're looking at costs in this contract and who's going to pay for what, we should understand that these two agencies, the Coastal Commission and the L.A. Regional Water Board, are now looking more seriously at fireworks as a polluter.'",
        "'speaker_5': 'So when you look at the Regional Water Board, what they are requesting of one businessman for his fireworks show, the costs are adding up if they start requiring NPD as permits like they do for other major polluters. Fireworks show will cost you $20,000 for that one permit alone.'",
        "'speaker_5': 'And I think this is not a bad thing, because what we have now is private businessmen, whether they're Harbor Cruises or a nonprofit. I don't know. We thought it was the convention center, but it's just a convention area group or something.'",
        "'speaker_5': 'And then one other businessman in in Alameda say for multiple years they're not being held accountable for so much of the pollution that the water board is talking about here in our water. So we want to keep our children safe as they go to school.'",
        "'speaker_5': 'We want to also keep them safe where they swim. And we're adding more attractions for especially for children on our beach front, whether it's a jungle gym or out in the water itself, even in the bay, a brand new thing.'",
        "'speaker_5': 'And yet this pollution isn't going anywhere and neither are fireworks as far as we can tell. So we're hoping it was this gentleman who left earlier for the head of the park said, why don't we think about making Long Beach historic in another way?'",
        "'speaker_5': 'Why don't we be the first city to host a laser light show for the 4th of July? That Disney is doing it, other cities are doing it, but no port city has ever done it. And I think we could we could think about that.'",
        "'speaker_5': 'And as as for this year, we're trying to work with staff, with special event staff. And obviously, it's not so much on the downtown show, but I really hope that this year we could get some of the reduction in plastic waste that is being required of Mr. Morris this year as this fireworks show goes forward.'",
        "'speaker_5': 'And I'm hoping that we could meet with First District well and speak with them because they've been really helpful on this. Oh, 25 seconds left. So, you know, we've made a lot of bad deals in Long Beach and we've made a lot of great deals throughout to show what those are.'",
        "'speaker_5': 'But but as far as the bad deals goes, the Queen Mary, there it is. And you can't just snap your fingers and make it go away. That turns out to be more expensive than keeping it cheaper to keep her.'",
        "'speaker_5': 'You've heard that. It's cheaper to keep her. So but that's so it's still not cheap. It's still expensive. So before we spend tens and tens of thousands of dollars on fireworks, let's maybe think we don't need to do that.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Is that concludes the public comment.'",
        "'speaker_7': 'Thank you. We'll take it back behind the rail. Councilwoman Zendejas.'",
        "'speaker_4': 'Thank you. Thank you for the comments that were given here today. I know that we're moving forward now, and this is a very exciting next step in the operation of our beloved Queen Mary. I know many of the residents here are excited to see more activity and events come back to life in our Queen Mary.'",
        "'speaker_4': 'With this item, we are one step away, closer to the grand reopening of our Queen Mary and hoping that we can re re invigorate our Queen Mary and what it brings to our city. I know I'm very, very thankful for all the detail that went into this contract.'",
        "'speaker_4': 'So city staff, I just want to say thank you because I know that we we were went through a very hard time with the Queen Mary. And so I just want to say thank you for taking the extra steps of being extra careful and implementing all the things that will eventually result in a successful transition into reviving'",
        "'speaker_4': 'the Queen Mary. And so thank you for that. And I look, I really like also the the shortened lease time. I think that that's important as well. And I think that that's going to be, you know, very, very telling as we move forward.'",
        "'speaker_4': 'And, you know, it, the Queen Mary is a great iconic venue. And I'm hoping that one day we can one day, you know, name it for what it really is, which it's a historical property and such a great, great property they have here and our in the city of Long Beach.'",
        "'speaker_4': 'And it's so iconic. I hope one day we can get there. But for now, I'm really proud of the work and the due diligence that went into this planning. So thank you for that.'",
        "'speaker_7': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Yes, I'm happy to speak at this motion. I do have a couple of questions on to start with with a comment. You know, the there's a lot of, you know, differing differing opinions about the direction that we should go in with the Queen Mary.'",
        "'speaker_3': 'Obviously, this is a decisive moment for the council to to enter into a new agreement with the with the evolution. This is city manager for for those listening and those critical of this decision. How does this agreement differ from the previous agreement and how would the city be protected?'",
        "'speaker_3': 'You know, moving forward?'",
        "'speaker_2': 'Yes. So it is very, very different. So before in the past 40 years, we've really tried to manage this asset by shifting all the requirements, all the responsibilities, but also all the benefit to a private company. They normally had to pay for that, right?'",
        "'speaker_2': 'They were buying it from somebody else. And so they were carrying a lot of debt to do that. And so that that proved really not to be a model that was successful. It happened to several different companies. What we're doing now is basically cutting out that middle a partner.'",
        "'speaker_2': 'It is still a city asset. We now have increased responsibilities where before we were not responsible for any of the any of the operating expenses, any of the capital that was all shifted to a private partner. We retain that now.'",
        "'speaker_2': 'So we do are required to put in capital money. You heard some of that that Mr. Vallejo talked about today. But now we also are able to get some of the benefit as well. So this company is essentially a caretaker.'",
        "'speaker_2': 'They are running the hotel. This is what almost anyone does who owns a hotel property. They then bring on someone who is a hotel expert. And these are one of the best experts in the nation. And so they do it for a percent of the gross revenue so that they're sharing in that cost or of that of'",
        "'speaker_2': 'the revenues. And that's what pays for it. And then we are expecting, if history is any indication, this property all made money for the hotel itself. So about seven and a half million in that range. So hopefully we'll we'll get back to that point.'",
        "'speaker_2': 'And they're incentivized in this agreement to actually earn more than that. So the company has an incentive. The more they earn, the better they're going to do it, the better we're going to do.'",
        "'speaker_3': 'Thank you for explaining that. So it sounds like there's a shared risk in this year potentially with this agreement, and I'm supportive of it. One of the public commenters did raise a point that I think is as important to address, and that is debts and previous contracts.'",
        "'speaker_3': 'Have we looked into that? Do we know what the exposure is? And is there a plan to to kind of rectify any of that?'",
        "'speaker_2': 'Yes. So we're all very, very sympathetic to that. This council has been incredibly sympathetic to that. That came up in our study session. It's also tricky for us because that was not a response. That was not money that came to the city of Long Beach.'",
        "'speaker_2': 'That's not moneys that we held. Those were all in a private company that went bankrupt. And so there were claims through bankruptcy court for people to try to recover that Long Beach. It was in the same boat where we were trying to recover our assets as well.'",
        "'speaker_2': 'That said, we are looking once we get open to work with our city attorney to see how can we, you know, honor that, how can we create some, you know, value there for people that lost money? We're still working on that part of it to make sure it's legal and not to give to public funds.'",
        "'speaker_2': 'But we do believe once we're open and we can start looking at how do we get these those that lost money through the previous operator get some kind of benefit to be able to come back and hold their events here in Long Beach.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_7': 'All right. Fantastic. Thank you. Just add my comments here supportive of the agreement we discussed at length in closed session. So I understand those points. I think some of the questions Councilman Austin raised were good. The public needs to hear that this is very different than what we've had in the past and we stand to economically benefit'",
        "'speaker_7': '. And to be clear, the $7 million projection is conservative. It doesn't include the events and the other potential activities are correct.'",
        "'speaker_2': 'Yes, that's correct. And Johnny can expand on that if he wants.'",
        "'speaker_7': 'To go a little bit deeper on that point. I think it's important for people to understand.'",
        "'speaker_9': 'Yes, that's that's a that's a fair assessment.'",
        "'speaker_7': 'Sure. Okay, great. And I saw that you had a slide both on auditing standards and performance standards, which I think is incredibly important, that we we have access to the operation fund to to help manage that operation fund to audit.'",
        "'speaker_7': 'We have access to that. The performance standards, I think, are good that there is an incentive to do well, do better as a hotel because they benefit. So I think that's good. The reopening budget, I know that you mentioned that some of that you're going to look at year end savings.'",
        "'speaker_7': 'You know, the more that we can make sure that it comes from funds generated from, you know, in the future, revenues generated from the Queen Mary, I think is a good story that it was able to fund its own start up eventually.'",
        "'speaker_7': 'Right. And sometimes we've done that when we need to figure out a project that's ultimately going to bring more revenue to the city was figured out how to leverage that. So let's be creative so that I think folks can understand that, you know, it pays for itself.'",
        "'speaker_7': 'And I think people want to see and understand that the Queen Mary has the ability to pay for its own operations. I think that's important. I would also say I don't want to not acknowledge the fact that there are 300 employees we're talking about here.'",
        "'speaker_7': 'Now, what efforts have we done to make sure that previous employees have the ability to get their jobs back or what's been retained? Do we have any data on the retention rate?'",
        "'speaker_9': 'So that's that's one of the benefits of engaging with evolution hospitality because of their previous role in managing the Queen Mary for the previous operator. They have access to all of that, our contact information. So they've actually stayed in communication with those employees and have a program already in place to reach out to those employees to get'",
        "'speaker_9': 'as many of them that would like to return to work on the ship. They will be afforded that opportunity.'",
        "'speaker_7': 'And interesting, I think and whatever the differences of folks who, you know, are going to be new employees, I think we should do all we can to make sure we're hiring local and encouraging lobbies, residents, you know, who are seeking work to have an opportunity on the ship.'",
        "'speaker_7': 'And so I certainly support this. I know that there's a lot of discussions around public trust and confidence, all of that. But I think you all have done a very good job in terms of the city management team, city attorney's team, economic development, and doing the diligence and walking us through the important viewpoints so it has my'",
        "'speaker_7': 'support. Members, please cast your vote.'",
        "'speaker_1': 'The motion is carried.'",
        "'speaker_7': 'Thank you. All right. Item 34, please.'",
        "'speaker_1': 'Item 34 is a report from Health and Human Services. Recommendation to amend contracts with Interval Health for providing homeless prevention and rapid rehousing services for a revised total aggregated amount not to exceed 2.5 million citywide.'"
    ]
}