{
    "Approval of Long Beach Tourism Business Improvement Area Program and Agreement with Convention and Visitors Bureau.": [
        "'speaker_1': 'Great. Well, thank you very much again, guys, and thanks for coming down. Thank you. Okay. We're moving on to Madam Cook to hearing one.'",
        "'speaker_2': 'A report from Economic and Property Development. Recommendation to receive supporting documentation into the record. Conclude the hearing and adopt resolution approving the Long Beach Tourism Business Improvement Area Program. An assessment for the period of October 1st, 2015 through September 30th, 2016, and authorize the City Manager to execute an agreement with the Long Beach Area Convention Visitors Bureau'",
        "'speaker_2': 'for one year term districts one, two, four and five.'",
        "'speaker_1': 'Thank you. I'm going to turn this over to city staff.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Members of the city council. I believe Steve's going to have a very exciting presentation for us today about all the great work that our CVB does and his partners here in the audience. But first, I'd like to turn it to my Conway to give the staff report for the hearing.'",
        "'speaker_0': 'Mayor Garcia, members of City Council, the Long Beach Area Convention and Visitors Bureau promotes and markets the city of Long Beach as a tourism destination, using funds generated through self-assessment of hotel properties located in Long Beach Tourism Business Improvement Area.'",
        "'speaker_0': 'The Self-Assessment District was established June 21st, 2005. City Council action this evening request approval of the continuation of the program in assessment and to authorize the city manager execute an agreement with the CVB for an additional one year term.'",
        "'speaker_0': 'The CVB continues to promote and market the city of Long Beach at an unparalleled level of excellence at its helm as its President and Chief Operating Officer. It is my pleasure to introduce Mr. Steve Goodling.'",
        "'speaker_1': 'All right.'",
        "'speaker_9': 'Thank you, Mike. Hi, Mr. Mayor. Thank you. Council members, city management. We appreciate the opportunity to be here this evening and present to you an update of what's been happening in the last 12 months. Also, honestly, I think it's the best private public partnership that I've had the privilege of being part of.'",
        "'speaker_9': 'It's between the business improvement district and the moneys from the city. It truly has helped us create a really strong economic environment within our city. That economic environment is over $300 million impact out of the top five industries in Long Beach.'",
        "'speaker_9': 'Tourism is the second. Manufacturing, which includes the port is the first. In addition, this last year, another benchmark is over 23. Almost $24 million was collected in bed tax. This is Council Member Andrews favorite favorite number four. For every $1 that we receive in the city contract, we generate $6 in return and we're really pleased with that'",
        "'speaker_9': 'number because I think it shows the efficiency and and the effect of what we're able to accomplish. If you look at the last five years, in 2011, it was 17 million, then 18 million, then 19 million. Last year, 21 million.'",
        "'speaker_9': 'This year, 23, almost 24. In five years. That has been a $6 million increase in total collections or a 35% increase as a city. And with our hotel partners and our entire hospitality community, we could not have achieved those successes without a really strong, dynamic relationship with our partners in the city.'",
        "'speaker_9': 'But also the economy has been extremely strong as well, and we've all benefited as a city and as individual businesses because of that. One of the key marks that helped us, that helped separate us from the competition was the opening of the Pacific Rim.'",
        "'speaker_9': 'This occurred roughly 18 months ago. Since that room opened, we've booked an additional $100 million in economic conventions. And basically what we're hearing from the clients is this room separates us from the competition. They can come in. It's turnkey.'",
        "'speaker_9': 'They don't have to spend a lot of money for extra rigging, lighting, sound. It's all they have to do is tell us what colors they want. And $100 million is a really, really significant number in terms of our overall outreach when you think 300 million a year.'",
        "'speaker_9': 'So that room has done a significant, significant job for us. In addition, on a smaller scale this year in our city, we will have four holiday events, corporate holiday events that normally actually never met in our city. They were outside of our city because we didn't have the facilities large enough to accommodate from 1200 to 2000 and'",
        "'speaker_9': 'more people. But the Pacific Room is making a huge headway into into this other segment, which is bringing additional people from the Southland into Long Beach and seeing all the transformations. At this time, I'd like to show you a video and you can hear from some of our other clients what exactly the Pacific Room is doing within'",
        "'speaker_9': 'our niche.'",
        "'speaker_0': 'Long Beach is on the map in a way that it never.'",
        "'speaker_3': 'Has been before. Amazing. Breathtaking.'",
        "'speaker_6': 'I love this space.'",
        "'speaker_3': 'It was one of the.'",
        "'speaker_0': 'Most diverse, flexible meeting spaces I believe we've ever seen. An incredible array of different types of venues and options of flexibility. Astonishing. I've never seen anything like it. The wow factor was throughout the entire night.'",
        "'speaker_3': 'They've made lighting a turnkey event that you can change your mind in just a few minutes to change the whole design.'",
        "'speaker_12': 'Literally, there are millions of colors and combinations and all the things that you could do with a light.'",
        "'speaker_3': '180 pin point light. So you're going to have 180 tables and it could cover the whole table or we can make it too small enough to cover the center.'",
        "'speaker_0': 'There's a particular color for your brand, your association, your conference, ask for it and you shall receive it.'",
        "'speaker_12': 'I was completely blown away. The functionality, the production equipment.'",
        "'speaker_11': 'There, there's nothing like it that I have seen so far.'",
        "'speaker_3': 'The group with any budget can impress in.'",
        "'speaker_11': 'This room such a.'",
        "'speaker_6': 'Great venue. You can use it for.'",
        "'speaker_12': 'Just about anything from a general session to your.'",
        "'speaker_6': 'Closing night party. You can use it for a concert.'",
        "'speaker_12': 'Or even a welcome reception where you're just doing.'",
        "'speaker_6': 'Cocktails, great food and networking.'",
        "'speaker_11': 'I was talking to colleagues in the UK about it before I came and showing them the video and they were all gathered around the computer going, Oh my.'",
        "'speaker_3': 'God, this is huge. We have a lot of members of our association that are Hollywood studios, TV companies, other creative companies from around the world. So it gives them a chance to show off their creativity.'",
        "'speaker_0': 'Using it, using the facilities here.'",
        "'speaker_6': 'It's going to save the meeting planners a ton of money to the fact that they have all the rigging and lighting that's going to be included.'",
        "'speaker_0': 'What is innovative about this space is the ability to transform the environment into an immersive media based space.'",
        "'speaker_3': 'The way they can drop the drapes and the lighting and the ceiling that they put in is just incredible. What we've created is essentially a technical ceiling, so it's a large metal structure and then a surrounding curtain wall essentially comes around and creates the sidewalks.'",
        "'speaker_3': 'The graphic ability of the curtains with projection is really unless you can walk in there and feel you're in a fish tank if you wanted to. I was here earlier when it was just a bare arena, and then when I came back it was like I stepped into another world.'",
        "'speaker_3': 'A planner can craft an event with very little effort now and totally cost effectively. Can really wow and not have to worry about thousands and hundreds of thousands of surprise dollars. It is a big palette to tell a big immersive story.'",
        "'speaker_3': 'It's an event planner, event producer.'",
        "'speaker_0': 'Event promoters dream come true.'",
        "'speaker_3': 'And an attendee a dream.'",
        "'speaker_0': 'Come true to experience all that.'",
        "'speaker_9': 'Mayor Garcia, Vice Mayor Lowenthal, also Councilmember Andrews, you were three that were on the council at the time. Your vote helped us achieve $100 million economic impact. So thank you for that support and will continue to deliver on that.'",
        "'speaker_9': 'In addition, this past June, we were in Washington, D.C. The mayor cleared his schedule. Mayor Garcia, we appreciate that there is no mayor of any city that actually goes back to Washington to meet with clients. They usually meet with everyone else but clients.'",
        "'speaker_9': 'Right. And so for Mayor Garcia to be with us, it made a large impact. And we had at that time over eight customer events, 300 customers and 28 partners from Long Beach. Traveling with us to D.C. recognized it.'",
        "'speaker_9': 'It was a flutter in both social media and also on the ground. In addition, last week we had a site inspection. The mayor had a chance to spend time at one of our events with a meeting planner and her son and mayor.'",
        "'speaker_9': 'We're pleased to report that as of today, we're about 95% probability of booking an 8000 room night convention because of your efforts. And and it really did your your dialog with the planner and her son at that time meant a lot, and it actually made the city more personal for them.'",
        "'speaker_9': 'And then when they came out and saw the city, they felt everything was the perfect fit. So thank you for blocking that time. In addition, another great community event this past year was we had the opportunity to host the World Games for Special Olympics, and Jane Netherton is a board member of Special Olympics in Southern California, also'",
        "'speaker_9': 'a board member of the CVB. And our past chair and Jane reached out and asked all of us if we would be glad to host the athletes coming in from China. And as you can tell from these pictures, we had a full community turnout.'",
        "'speaker_9': 'There is Councilmember Urahn shuffling in a little bit and Lew and Bynum and then. DH I'm sorry, but somehow the Chinese got the things behind the ears. But anyway, but we really, really appreciate all of you coming out this summer and welcoming the contingency from China.'",
        "'speaker_9': 'They had a blast. They had a phenomenal experience. And they left going back to China with a really, really warm spot of Long Beach. And that went a long way, especially considering they're one of our major trading partners.'",
        "'speaker_9': 'Jane Netherton on our farewell. It was a tearful farewell morning, but Jane also has a few words to share on Special Olympics and the event itself. Jane.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_12': 'Steve. Mayor Garcia, council members. I would like to also add my personal thanks to all of you. The city, the city departments, Parks and Rec was amazing. They came out and one of our days was in Eldorado Park and it was just outstanding.'",
        "'speaker_12': 'Fire and Belize, we had so much cooperation. It was it was really great. There was an issue on transportation. I'm not sure many of you heard about it. But on that Tuesday night when our athletes were supposed to be delivered to us, that did not happen.'",
        "'speaker_12': 'And so about 230, 330 in the morning, we managed to get taxicabs and I wonder how we did that. And some shuttles and we brought our athletes to Long Beach to where they were able to sleep in the beds in the university that we had arranged.'",
        "'speaker_12': 'The next day, the Chinese consulate came out to Long Beach personally with his staff to say thank you to Long.'",
        "'speaker_11': 'Beach for making.'",
        "'speaker_12': 'That extra effort so that their contingency from China did not sleep on the floor in a gymnasium. And he was very grateful for that, but made that personal trip out, which I thought was a big step and just, I think Long Beach and said, if we ever need to get older of and we have cards and he'",
        "'speaker_12': 'would look forward to helping us any way that he could. Also, the Council of Council Member, we have a commendation from the county for a Long Beach as being a host town. They had us at their meeting the host town chairs and presented the accommodation for the city of Long Beach, which belongs with you, Mayor Garcia.'",
        "'speaker_12': 'And it just shows that they are they acknowledge we were we were the top of the top when it came down to what we ended up doing for three days. It was all about Long Beach and how well they were received here.'",
        "'speaker_12': 'So thank you all for making that happen.'",
        "'speaker_9': 'In addition to Special Olympics and host town. And thank you, Jane. Jane's heart and soul was in that and it was evident throughout the entire time. And it really was a complete community effort. The Queen Mary, the aquarium, everyone everyone came came to the table and actually helped make it just a memorable time.'",
        "'speaker_9': 'This past week, our hotel community also came together as another community initiative, and the police department came to us. And they had also spoke with Jane earlier about the special victims, those of domestic abuse, sexual abuse and elderly and children crimes.'",
        "'speaker_9': 'And when these things occur, they need a place for safe haven, sometimes immediately, because they're trying to extricate them out of an environment. And so they wanted some place that they could put them with budgets being constrained as they are.'",
        "'speaker_9': 'They had asked if there could be help in our hotels, have stepped up to the plate, all of them. There hasn't been one that said no. And they have said that they would provide complimentary vouchers for our police department to use so that when there are experiences and we have to find a safe home for an evening'",
        "'speaker_9': 'until they can relocate these victims into a better environment, they have accommodations in our hotels here in Long Beach, so we'd like to thank our hotels for doing that as well and for the police department for reaching out on that issue.'",
        "'speaker_9': 'I in other community. Yeah, it's. Another community effort which which we really like. Everyone understands social and how social media has really changed everything that we're doing. And so we wanted to reach out to the community and say, Hey, show us your Long Beach.'",
        "'speaker_9': 'How do you see Long Beach? And so we, to our surprise, had 38 submissions for a video contest. This video contest last spring culminated in a social media reach of over 15 million. And what does that exactly mean?'",
        "'speaker_9': 'Let me give you one example. Chaz Curry, who's a gentleman sitting here. Chaz was our award winning video for the entire contest. And Justin Rudd told me that Chaz, his video was the quickest viral upload he's ever seen in his history.'",
        "'speaker_9': 'And he had over a half million views of his video and 15,000 shares and look at all the likes he had. I mean, it was an amazing success. And and Chaz brought that into our contest. There were others, too, like Charles Whitehead.'",
        "'speaker_9': 'And Charles also came to council not too long ago, presented this great song. And of course, many of you said, go talk to the CVB. He did add. And we liked we liked what we heard and we liked where Charles was going with it.'",
        "'speaker_9': 'So so we encouraged Charles to enter into this video contest. Well, long story short, the videos were so phenomenal and the quality was so phenomenal. We had asked everyone, do we have the rights to your material? And they all, of course, said yes.'",
        "'speaker_9': 'And so we amalgamated all these different videos into one community video, which we took with us to Washington, D.C. to showcase Long Beach. At this time, we'd like to share with you are what we consider to be our community.'",
        "'speaker_9': 'Video of Long Beach.'",
        "'speaker_10': 'This place just south of L.A., where the people.'",
        "'speaker_11': 'So I mean, it's up for you to see.'",
        "'speaker_0': 'You could take the family tree like the Queen.'",
        "'speaker_10': 'Membership and the Aquarian. Once a year you'll see.'",
        "'speaker_0': 'Cars, racing, industry, people come.'",
        "'speaker_11': 'From everywhere. Check it out the way.'",
        "'speaker_10': 'You go to see the show.'",
        "'speaker_0': 'The place you want to go. A lot of people want to be here in.'",
        "'speaker_10': 'Down in the water. Here. You can see the skyline. You can even see the.'",
        "'speaker_0': 'That's been all the time. From the shoreline could take off on.'",
        "'speaker_10': 'Oh. Hang out with me.'",
        "'speaker_0': 'People seem to be in this way.'",
        "'speaker_12': 'The market.'",
        "'speaker_10': 'The people want for me. Just see something's always going on. Be. Be understanding that we're way downtown with our town. I go in. Downtown.'",
        "'speaker_0': 'You might.'",
        "'speaker_10': 'Long Beach. You might just be in Long Beach.'",
        "'speaker_0': 'You might be in Long Beach. You might just be in Long Beach. You might.'",
        "'speaker_9': 'Thank you. And also, could we thank Charles White add again and Charles Curry for these great, great templates. They gave us the opportunity to create this great city video. So, Charles. This year is also an exciting year of new firsts.'",
        "'speaker_9': 'The first was the Formula E race. Formula E is coming back again. We are the only city in North America this year. Monte Carlo, Beijing, Long Beach. Nice combination. And so. So with Formula E, we also had another new event this year and it was called Powell.'",
        "'speaker_9': 'And Powell hit the seat, hit the streets and hit the scene rather quickly. And we like to thank Pat West and city management for helping us work through this very quickly and getting all the permits done. And John Hall is here as well.'",
        "'speaker_9': 'John and Julia Wang and also Ron Nelsen from Long Beach Museum of Art. They brought this concept to us. We fell in love with it. We said, okay, how do we run with it? And so we worked with them and won the permitting and everything else.'",
        "'speaker_9': 'And then we we also took ads out in the Los Angeles magazine. We wanted the folks in Los Angeles to know that actually, we, too, have our own vibe and our own in our own hipness. And quite honestly, it was quite fun because L.A. came down afterwards and wanted to meet with Powell and see if they could'",
        "'speaker_9': 'expand beyond Long Beach. And and the reality is, is they're very happy in Long Beach. And so.'",
        "'speaker_1': 'I told them now.'",
        "'speaker_9': 'And and Jasper Wong, who is the founder of Powell, actually said he felt more at home here than in his hometown in Hawaii. So, Mayor, you, Mark Taylor, our city management team, everyone made him feel welcome. But you saw all the great artwork that was left and they're coming back again next year.'",
        "'speaker_9': 'In addition to the ads that we took out in L.A. magazine for the summertime, promoting promoting Long Beach and encouraging people to come down to Long Beach and see these ads. We also worked a collaborative effort with the Queen Mary and the aquarium this year.'",
        "'speaker_9': 'And for the first time, we had four pages in the Sunset Magazine and in triple j's West Ways Magazine, promoting Long Beach as a destination with the aquarium and the queen. So there were a lot of firsts this year, and those were all wonderful.'",
        "'speaker_9': 'I add at this time, I just would like to to conclude by saying what we keep hearing from our customers. And I just heard it again last week. We had, you know, we had the Unitarian Church here, and they were blown away at how this community espouses a lot of what they espouse.'",
        "'speaker_9': 'And they've never seen a community work together between elected city officials, city management and also the private sector. And I hear that weekly. And so one, we'd like to thank all of you for helping us in our effort to sell and promote Long Beach.'",
        "'speaker_9': 'Pat, Tom, we'd like to thank you as well. And SMG, the operator of our convention center, has been a wonderful partner as well, making our jobs a lot easier and also all of our hotel partners if our board could stand and just be recognized.'",
        "'speaker_9': 'And if the board could stay standing and if staff could stand. Please. And lastly, with over 400 business members and the second largest industry in our city, could all of our partners stand? Be. I will share with you together.'",
        "'speaker_9': 'And I hear this constantly. It's this. It's this grouping that makes it insurmountable and hands down, we continue to win because of it. So anyway, I'd like to share our customers comments with you. And again, thank you for your support this year.'",
        "'speaker_9': 'We really appreciate it.'",
        "'speaker_3': 'All that you may have heard about Long Beach in the past, that's out the door. That's pass. Long Beach is a real gem, one of the best kept secrets in the convention business.'",
        "'speaker_12': 'A little mini paradise.'",
        "'speaker_3': 'Long Beach is Southern California personified.'",
        "'speaker_11': 'Talk about a great package. Have all the big city.'",
        "'speaker_6': 'Services and amenities that you need. But you have this wonderful small town charm.'",
        "'speaker_3': 'There in a resort location. But at a convention center.'",
        "'speaker_12': 'The nicest thing is that it's a wonderful city. Two steps out. The convention center. You're right down.'",
        "'speaker_2': 'On the water. Everything is close enough, you know, within two, three, four.'",
        "'speaker_12': 'Blocks to find anything you could possibly need.'",
        "'speaker_3': 'There are hotels are so close to each other, it's almost like a campus. There's so much to do here. You just walk out the front door and take a look. Are we going to go there or they're there?'",
        "'speaker_3': 'Everything's at your fingertips. The aquarium, the Queen Mary.'",
        "'speaker_11': 'There's music. There's arts.'",
        "'speaker_12': 'There's places to go and dance.'",
        "'speaker_3': 'The hundreds of restaurants.'",
        "'speaker_12': 'And everything from your basic and expensive restaurant to.'",
        "'speaker_0': 'You know, your beautiful four or.'",
        "'speaker_11': 'Five star type dining.'",
        "'speaker_3': 'Restaurants. Long Beach is the only city where you actually leave your blinds open in night because of the lighting. Transportation in and out of out of the city is very, very important to us. There are three.'",
        "'speaker_12': 'Different airports that attendees can plan to from first tier, second tier, third tier and little itty bitty country towns.'",
        "'speaker_3': 'Which had great access to all parts of the world. When you experience the center, you'll recognize right away that it's not your typical normal brick and mortar convention center. I have two conferences in most convention centers in the United States.'",
        "'speaker_3': 'This is the only one that has this much versatility within the center already built. And there are so.'",
        "'speaker_12': 'Many great spaces, whether you're looking for something inside or outside. Small, medium, large.'",
        "'speaker_6': 'You can find it here. People love.'",
        "'speaker_12': 'The space. They come here and they love the casualness of it, and people just want to hang out here. The layout of the center is very easy.'",
        "'speaker_3': 'A lots of little, almost cozy little places for people to gather and can be. I saw more people networking within the convention center and not within the hotels. Our people loved it. We had all kinds of tables set up outside.'",
        "'speaker_3': 'The weather was gorgeous. The weather's always gorgeous here. We had to do a party for, you know, 10,000 people. And it turned out to be one of the most successful parties in our company's history. What attracted us to Long Beach was, number one, the people.'",
        "'speaker_11': 'Everyone was super happy to have us and they knew us and people.'",
        "'speaker_3': 'Who are working in the restaurants and working in the hotels all the way up to the mayor of Long Beach from top to bottom. Long Beach is a unique venue that people will enjoy and want to come back to if you want to be assured of sunshine.'",
        "'speaker_3': 'Of happy people, of great service and a variety of things to do before and after your meeting. One which is for you. On a scale of 1 to 10, I give Long Beach a ten. If it weren't a ten, we wouldn't be coming to Long Beach.'",
        "'speaker_12': 'I think Long Beach really is the total package. I wish I could put every convention I ever planned in Long Beach.'",
        "'speaker_9': 'And if. And if you if you couldn't read that last meeting, planners from the National Retail Federation. Right. What great clients to have in our city. So anyway, thank you again for your support. We've appreciated it greatly and thank you for your time this evening.'",
        "'speaker_1': 'Thank you. Thank you, Steve. We have a couple comments and I'll close. Close us out, Vice Mayor Lowenthal.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And we could not have a better cheerleader for our city. I know that the mayor and I talk often about what a great job you do, Steve. And so earlier when we walked in, we thought, oh, my gosh, what's on the agenda?'",
        "'speaker_4': 'Why are all these people here? So I'm glad it's for a good thing and nothing that caught us by surprise. No one can turn people out the way you can as well. But I wanted to thank you for all your hard work, your board, your staff.'",
        "'speaker_4': 'You have a very hardworking board. Of course you have a hardworking staff. But a lot of times board members are there to give you advice. But you have a very active board, and I see how hard Jane works and Bill and others.'",
        "'speaker_4': 'And so there is something to be said about your leadership that you're able to draw that out of your board as well as your staff. And we get a lot of high praise. I know Steve said quite a bit about the high praise we get in other cities in our ability to host conferences, but we are quite'",
        "'speaker_4': 'unique here, you know, saying that we might be a boutique conference culture conference community might be appropriate. This is a place where conferences can come and feel like the star of the show. And because they're not paired with two and three other conferences happening in the West Wing, in the East Wing, it's just them.'",
        "'speaker_4': 'And so I think that's something very special and you're able to capture that and all of the renovations that have taken place at the Convention Center with the city's partnership and this council and previous councils, really my entire nearly ten years here, I think we have delivered a beautiful project, a beautiful gem.'",
        "'speaker_4': 'And I want to thank you for showcasing it, taking the show on the road and bringing more and more people to come here. I do want to thank you. You didn't mention it, but it is our next big thing that your ongoing support for our soon to be constructed pedestrian bridge, which would link the performing arts theater'",
        "'speaker_4': 'and the convention center. And that's something that's much needed. Of course, people find their way around, but for us to be able to make this easier, that connectivity easier, is going to be something magnificent. And I think it will open up other demographics of conferences, visitors and users just because we added that amenity.'",
        "'speaker_4': 'So thank you and keep reminding us that we need to keep investing in our CVB.'",
        "'speaker_1': 'Thank you, Vice Mayor. Councilwoman Mongo.'",
        "'speaker_2': 'I really want to thank our hotel partners for what you're doing for the victims of crimes here in Long Beach. That's really remarkable and first rate. And it's it's not often found in local areas. And so to have that partnership with you is amazing.'",
        "'speaker_2': 'Thank you. To our cab partners and supporting the Special Olympics. I remember the morning that I heard on the news that all those other cities were sleeping on gym floors. And I was really proud to know that our convention and visitors bureau, our team of people, comes together to find solutions.'",
        "'speaker_2': 'We never let bureaucracy get in the way of finding solutions that make sure that people feel welcome here in Long Beach. And then finally to the staff of the CVB for taking my endless calls and questions, ensuring that any policy we make here doesn't impact our convention business, and that any potential convention or meeting I ever attend'",
        "'speaker_2': '. I always solicit them to come here. And I know you've done a lot of packages and many of them have resulted in great bookings and some of them haven't yet developed yet. And I look forward to each and every one of those organizations finding the right time to come here and saying, You know what?'",
        "'speaker_2': 'Long Beach is the best place I'm going to fall in love with Long Beach. Thank you, everyone.'",
        "'speaker_1': 'Thank you, Councilwoman Price.'",
        "'speaker_6': 'Thank you. I want to echo the comments of my colleagues. It's a real pleasure to have all of you here tonight. So thank you. You do turn out in large numbers. And I did say to the vice mayor when I walked out.'",
        "'speaker_6': 'I think I'm missing some big item on the agenda or something. What is happening. So thank you very much for being such a positive energy to our council chambers this evening. You do amazing work and you do amazing work as a team.'",
        "'speaker_6': 'Certainly you're led by Steve and he does an excellent job setting the tone for the organization and everyone who's associated with it. But really, the commitment that you all have to providing the best service experience for those who visit and those who do business here is it's just infectious every time you come and speak to us and'",
        "'speaker_6': 'every time any one of us experiences one of your events or program. So thank you very much for making us look good. And I know I've said to Steve many times that I speak for my colleagues when I say that we're here to be ambassadors for you and everything that you're trying to do and we support what'",
        "'speaker_6': 'you're trying to do for the city. I think it's it's fantastic. I will say, Mr. Whitehead, the next time I would like to see Belmont Shore, Long Beach, you know, something like that, aquatics, capital, you know, something like that.'",
        "'speaker_6': 'Maybe we can do a different video focusing on our love for sailing in the third district. But I think that is such a catchy song. My kids actually sing it because they watch council meeting on occasion, and the last time we played it they were so excited that they were singing it for a few days.'",
        "'speaker_6': 'And so I love that. I love the local energy and that that the heart that comes from what you guys are doing. So thank you very much for being here and for starting our meeting off on such a positive light.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Gringa.'",
        "'speaker_9': 'I guess you should also include a town. Long Beach town. Long Beach. Westside. Long Beach.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_9': 'I mean, we have, I think more than anything else, it's an expression of how what a great community we have in Long Beach in regards to not only the people who live here, but the people who work here.'",
        "'speaker_9': 'And, of course, the CVB and the great work that you do in being able to market. Long Beach is all about branding and marketing, and if there's any one thing that I want to say is that we've done this with a measure that we passed in 2012 measure and that raise the salaries of hotel workers.'",
        "'speaker_9': 'And the sky did not fall on the opposite. It grew and it's looking better all the time. And we have people who love Long Beach, who want to come here, want to spend their money here. I have the Coastal Commission here.'",
        "'speaker_9': 'They're going to spend their money up all this week here. But it's it's it's it's a measure of how resilient Long Beach really is and how the business community, the hotels, can really step up and deliver. And it's and it's all because Steve Gooding is just a great cheerleader.'",
        "'speaker_9': 'And I'm looking forward to a result of our minimum wage study because I know we're going to step up again and we're going to do just as well, if not even better and greater, for the community of Long Beach.'",
        "'speaker_9': 'And I want to congratulate you on the job well done. Looking forward to having the National League of Cities in Long Beach. Thank you.'",
        "'speaker_1': 'Thank you very much, Councilman Andrew.'",
        "'speaker_8': 'Yeah. Oh, thank you, Vice Mayor. I'm getting the same comment that I council vice mayor got when a councilman asked and I was walking in the door and he looked up and saw a guy with a crowd and I said, Oh, it's a Steve Goodman show.'",
        "'speaker_8': 'So you have to understand, when this young man goes places, Steve, you and your staff, it was a dollar. Now we're going to put two and and we won't be able to get in here next year. But again, you and your staff, you guys are just fantastic.'",
        "'speaker_8': 'And I just I couldn't believe, you know, we get a large crowd when there's a lot of madness going on. But tonight, this is joy, you know, and everyone that's here, you'll enjoy this. And if you get a chance, please go to some of our convention centers, go around to the hotels, support the city of Long Beach'",
        "'speaker_8': ', because this guy Guillen, hey, I tell you, he's the best. Thank you. And your staff again. Good luck, big guy.'",
        "'speaker_1': 'Thank you, Councilman Richardson.'",
        "'speaker_5': 'Thank you. I just wanted to chime in and say, Steve, where there is Steve, this is this is fantastic. You come here every year. I see all the support you have. It's broad, it's diverse, it's Long Beach. And we we had a chance to see and listen to Mr. Charles's video before, and we enjoyed it.'",
        "'speaker_5': 'Right. And we did say take at the CVB. So we're I'm really pleased to see that not only did you watch the video, you embraced it and turned it into something else. Right. And and that was really cool.'",
        "'speaker_5': 'So thank you so much for that. And Charles, you know, I would say that I think we got our own song up in Uptown. What do you think? We think our Uptown Funk. Uptown Funk. I think we got our own song.'",
        "'speaker_5': 'Thanks a lot.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'What do they get ready for? For their for their comment and the singing councilman Ringo, that was nice. Just just to wrap up for let me just start by thanking just the whole crew that's here from. I see so many of our games from our hotels that are here and our convention related business leaders, a lot of'",
        "'speaker_1': 'workers here from from a lot of our hotels. And of course, Steve and the whole CVB team and the board, you know, we have a world class like tourism team that I think everyone kind of knows that. You hear it when you travel, you hear from other convention folks, you hear from other cities.'",
        "'speaker_1': 'And we're just really lucky to have all of you just kind of promoting Long Beach every single day. And I you know, I've said this before, but like, you know, I have officially, you know, deputized all of you as ambassadors for the city of Long Beach because there's nobody in the city.'",
        "'speaker_1': 'I said I've said this many times. There's nobody in the city that is promoting the city more than you guys. You guys are promoting the city every single day. And that's a great thing. That's something we're very, very thankful for.'",
        "'speaker_1': 'It's an honor for me to help lead, you know, that that promotion and that and that ambassadorship. And you're all a really important part of what we do. And, of course, Steve is I would say is, you know, he's in the show business.'",
        "'speaker_1': 'This is your you're the best show man in the show business because you do a great job of selling Long Beach everywhere. Let me close by saying what's really exciting to me is, you know, a few years from now, three or four years from now, when you show that video, you know, downtown Long Beach is going to'",
        "'speaker_1': 'look pretty different. And it's already looking different, but you're going to see a very different skyline when you show this video three or four years from now. And I think that's something very exciting for our hotels and for the community and for those of us that live in the neighborhood.'",
        "'speaker_1': 'So it's a very, very evolving downtown. And you'll be able to add some more lyrics as we as we do some different venues. All right. Good. Well, thank you all again for coming out, Steve. Thank you. The board really appreciate that.'",
        "'speaker_1': 'We have a motion in an hour and a second on this. This is a hearing. I know. So if there is, I'm going to close the hearing, if there's any public comment on the hearing. Great. With that, if I can just please cast the vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'The companion item to this is item 24. If you can just read 24 quickly.'"
    ],
    "Harbor Department Salary Resolution for Fiscal Year 2016.": [
        "'speaker_1': 'And I'll let all of you exit before we hear out of 29.'",
        "'speaker_0': 'Wait. It's been.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'It's here in. But I just.'",
        "'speaker_11': 'He is very. Yeah. I hear the thing.'",
        "'speaker_2': 'I'm just saying I love this.'",
        "'speaker_6': 'You know what? You're expecting to have to be the candy.'",
        "'speaker_12': 'Yeah, I'm looking for some variety.'",
        "'speaker_11': 'You know.'",
        "'speaker_5': 'I think, you know.'",
        "'speaker_11': 'I just feel that.'",
        "'speaker_6': 'There's nothing you can.'",
        "'speaker_12': 'Do.'",
        "'speaker_0': 'Oh, God, that scared me.'",
        "'speaker_12': 'Oh.'",
        "'speaker_0': 'Okay, good. I don't know. What would you feel like?'",
        "'speaker_11': 'You wouldn't be.'",
        "'speaker_0': 'Open about.'",
        "'speaker_2': '80% of that.'",
        "'speaker_11': 'Oh, my God.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'We're back.'",
        "'speaker_1': 'If I can have everyone. Just. We're going to go and keep continue on to the next item and see if I can have our clerk. Please read. Item number 29.'",
        "'speaker_2': 'Report from Harbor Recommendation to adopt resolution approving the proposed fiscal year 2016 Harbor Department Salary Resolution.'",
        "'speaker_1': 'Thank you. I'm going to turn this over. Mr. West is there. Presentation for the Harvard.'",
        "'speaker_0': 'I'm. No, there's not. I don't.'",
        "'speaker_1': 'Believe. Okay, well, I know that they're here, but I don't. I know we didn't plan a presentation. I wasn't sure if there was going to be one, but. Can I get a motion in a second on this? Okay, there's a motion, and it's like any public comment on this resolution.'",
        "'speaker_1': 'Seeing none. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Entertainment Permit with Conditions for Mineshaft, Inc.": [
        "'speaker_1': 'Okay, great. That was easy. Thank you, John. Good to see you guys. Moving on to back to the agenda here. So we have are we going to continue back on the hearing? So we have hearing item number two.'",
        "'speaker_2': 'Hearing two requires an oath.'",
        "'speaker_1': 'Anyone that's going to participate, please stand.'",
        "'speaker_2': 'You and each of you do solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you very much. With that, I'm turning this over to staff.'",
        "'speaker_0': 'Thank you, Mr. Mayor. The staff report will be handled by Jason McDonald, purchasing and business services manager. Thank you, Mayor. Council Members. Jason McDonald for financial management. Tonight you have in front of you the application for entertainment with Dancing for Mineshaft, doing business as Mineshaft at 1720 Broadway in District two, all of the necessary departments have reviewed'",
        "'speaker_0': 'the application. The application and proposed conditions are contained in the packet that was provided. We are prepared to address any questions or concerns along with the police department regarding the application of those conditions. That concludes our report or available for questions.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. With that, I have a motion and as I'm sure that's over to Vice Mayor Lowenthal.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I wanted to just clarify a couple of things with our city staff.'",
        "'speaker_1': 'And vice mayor. Also, just because there was a hearing, we're also able to hear public comment before you make the motion, if you'd like.'",
        "'speaker_4': 'Oh, yes, can we do that?'",
        "'speaker_1': 'Okay. So if anyone wants to comment on the hearing, now would be a good time. Please come down.'",
        "'speaker_0': 'Hi. My name is Tom Herzog, 1725 Second Street on the property owner that goes through next door to the mine shaft at 1724 East Broadway. My partner and I have lived in the home for 20 years. The wall of the mine shaft is actually the property line with my property and knowing their mine shaft is there when'",
        "'speaker_0': 'I moved in. So we knew that we've raised our two sons, adopted sons, and we've actually been able to do it. Last time I was here was for the same issue noise, public disturbance, smoking affecting the neighborhood, trying to figure out the balance between the commercial and the residents.'",
        "'speaker_0': 'So I've talked to Brock. He does a great job of responding to the planning inquiry. You know, that didn't really do too much and brought me to this point. He said that this is a normal evolution of a business, but our school board sued the city for the normal evolution of a business, which was the Long Beach'",
        "'speaker_0': 'Airport expansion. That very noise complaint destructing a neighborhood and going against the general plan, which is to create a healthier, quieter environment. Have you seen the onerous and lengthy noise complaint? It takes weeks and months to actually do a noise complaint, and that's what you are putting on the city residents.'",
        "'speaker_0': 'People are paying a tax dollars. People expecting you to do your jobs. I've called a number of the officers I've talked to Brock and to his office. Does a great job. I understand. I understand the bars there, but I have defecation, urination, drugs, sex in my parking lot.'",
        "'speaker_0': 'We have people picking up, people yelling and screaming. The cigaret butts out on the sidewalk, the pollution, just the trash in general. Something has to be done. I don't think extending a dancing permit, extending the louder pay system for an older building to a company where those people don't even live in Long Beach.'",
        "'speaker_0': 'You're up in Redding, California. I'm really not invested. Number of neighbors. Number of people trying to make community. But yes, it is an apartment. It is transient. It is not a normal residence. We don't have the support that someplace against like talk of circuits where you get a whole bunch of residents coming in and actually lobbying and'",
        "'speaker_0': 'actually getting results. So we're left to make complaints. File complaints with the Long Beach City police take their time to complain to noise. And if we don't log each call and the city police department last time didn't have any record no record for any complaints of the year.'",
        "'speaker_0': 'Just that didn't happen. So we're left to look like, oh, I'm a liar. But no, I know we what my noise or I'm not trying to be a gadfly, not trying to sit there and call time. But when I was in my front room, living room of a 100 year old house, it just turned this year trying'",
        "'speaker_0': 'to improve my neighborhood, spend my money in my hometown, that small town charm. But yet, all here's boom, boom, boom. Or people screaming or having to go out and talk to my my neighbor, who's actually has a little using a place and had to clean off defecation from the parking lot or, you know, vomit.'",
        "'speaker_0': 'That's ridiculous. Something has to change. And really love Long Beach, but it makes me feel like moving. I don't feel that small town charm right now. So I hope you vote against this.'",
        "'speaker_1': 'Thanks. Thank you, sir. Next speaker, please.'",
        "'speaker_0': 'Mr. Mayor and council members. My name is Gerry Cochrane. I'm the owner of an apartment building that runs 1732 through 1738 East Broadway. My building is right between the Brit. And the mine shaft. Earlier this year, we acquiesced to allow the Brit to.'",
        "'speaker_0': 'Have entertainment in their open patio with limited time. What you're looking to do right now is to get all of these people to go to bars for the same thing all night long. As my previous person mentioned. We have to clean up the bomb.'",
        "'speaker_0': 'We have to clean up the cigaret butts. We have to clean up the defecation every day. So let's keep in mind that this is also a residential area, as well as a major thoroughfare to the inside of the city.'",
        "'speaker_0': 'So. Adding entertainment. To the mineshaft. He's just going to get the people to move back and forth between the two bars constantly. So that the neighbors, the people who live in that building are going to have to deal with all the noise and all the trash and all the cigaret butts.'",
        "'speaker_0': 'That is constant. I might add that recently over the last 30 days, I know after this permit was focused that all of a sudden the place was getting a little bit cleaner. Things were looking a little bit better.'",
        "'speaker_0': 'Let me tell you, if you go back 30 days and I'll be more than happy to take pictures for you and provide to the city council how many hundreds of cigaret butts and defecation and gum and things that I had to clean up in front of my building every single day to try and keep tenants in the'",
        "'speaker_0': 'building. The owners of the of the permit, we agreed to allow them to to have music there. They said they were going to try and cover the open patio to contain the noise. They didn't do anything. So I know they posted somebody out front to try and keep the traffic or keep the noise down.'",
        "'speaker_0': 'But, um, my tenants every particularly Saturday and Sunday, particularly as we've had extreme weather recently, had to close their windows in the afternoon. So that they can just hear themselves or enjoy their own peace and quiet. So I just ask this council to consider this is not just a commercial area.'",
        "'speaker_0': 'This is also a residential area. I'm trying to keep tenants in my building. I'm spending an average of 15 to $20000 per unit trying to get tenants or stay. But it's very difficult based on the noise. And if you offer them to move with music and noise, that'll expand between two units.'",
        "'speaker_1': 'Thank you, sir. Thank you. Time's up. And then we have our last speaker, please.'",
        "'speaker_0': 'Thank you for hearing me. I'm Jeff, darling. I am representing the owners of the mineshaft. We also owned the Brett Bar. This is a family owned business. Our uncle started these bars 32 years ago and has owned them continuously.'",
        "'speaker_0': 'When he passed away in 2003, it became part of our family bar. We do live in Redding, California. This year I've spent three months of my time down in Long Beach living here. We have an apartment downtown. We own a condo in a historic building.'",
        "'speaker_0': 'I feel like we're very much part of the community. Some of our employees have worked for the bar for over 25 to 30 years. So we have a long standing history here. The things that we're asking to do in this permit are specifically to have a deejay and entertainment dancers, something that's happened continuously for the history of'",
        "'speaker_0': 'the whole bar. So we're not really asking for something that's uniquely different, like the Brit bar that has a large patio and does have more noise issues. We made some concessions and we settled it peacefully here in this council meeting to close the patio at 10:00.'",
        "'speaker_0': 'And it has greatly affected our business. But I'm not going to be bitter. I'm going to move on. We have to do business and take care of our employees. Our employees are part of our family also. They work here.'",
        "'speaker_0': 'They live here. We've made several attempts to alleviate some of the concerns that was recommended by the city. We had the police department come out. It's really difficult to speak to some of the specific things that they talk about, like defecation.'",
        "'speaker_0': 'Cigaret Butts is an urban area. It's very close to Bixby Park. We do have it's a thoroughfare there on East Broadway. Some of the people there spoke tonight. They have homeless people sleep in their doorways. They leave trash.'",
        "'speaker_0': 'It's very difficult for a bar that polices and does custodial every single day in their property and takes care of their particular space, too. To worry about the whole urban environment and some of the things that we've done this year.'",
        "'speaker_0': 'We made a new solid back door for noise to keep the noise at a minimum. We had a uniformed security guard that pulls patrols the street between both bars to keep the patrons quiet during the evening hours. We've installed security cameras to monitor the front entrance with the ability for the police department to have its own username'",
        "'speaker_0': 'and log in so they can monitor that at expense to us. All bartenders have taken leads, training as asked, so they are more aware of not serving intoxicated people. Um. All of our security wear clearly identified staff shirts.'",
        "'speaker_0': 'We've updated all the building to the current ADA requirements. As for that building, we just have gone to several measures. We contribute $71,000 in taxes.'",
        "'speaker_1': 'Thank you for your time. Thank you very much, sir. Thank you very much. Mr. Goodhew.'",
        "'speaker_0': 'It's very good. You click as the address. It's listening to this. Here's how I see this. You've already got a problem. A way to partially address this is for any person who votes to approve this. Would agree to this.'",
        "'speaker_0': 'Number one, you will provide your 24 hour seven cell phone number. Two of the two gentlemen that spoke opposing this that are neighbors. Allowing them to call you at whatever hour. The noise. Wakes them up or disturbs the neighborhood.'",
        "'speaker_0': 'Number two. You will underwrite the cost of having. Someone first thing in the morning. Check the sidewalks, sweep up any feces, cigaret, butts or whatever junk is there. And transport that to your council office. The first thing the next day.'",
        "'speaker_0': 'And after a year. Or after six months, bring this back. Based upon the number of your feelings, based upon the number of calls that you will gladly take at two or 3:00 in the morning. And the amount of feces.'",
        "'speaker_0': 'The amount of cigaret butts and other litter that the people had to go out and clean up because their custodians had done. Thank you.'",
        "'speaker_1': 'Thank you. Back to the hearing, Vice Mayor Lowenthal.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I wanted to thank our speakers and follow up with staff on some of the questions that I had. Okay. I think I see stuff there. If you could clarify for us, this was mentioned by one of the speakers, actually, I think the owner's representative, that the dancing component of the permit is for performers'",
        "'speaker_4': 'and not for the patrons. Is that correct?'",
        "'speaker_0': 'Vice Mayor That's correct. The council letter is that it seems to have indicated patrons it was intended to say performers as per their application.'",
        "'speaker_4': 'Okay. So it is performers and not patrons. I appreciate that. And that the entertainment is only for Friday and Saturday until 1 a.m. and Sunday between 3 p.m. and 7 p.m..'",
        "'speaker_0': 'Correct. That is their application and as recommended by the police department.'",
        "'speaker_4': 'Okay. And then there is discussion about the breezeway and Mr. Herzog brought that up, I believe, if we could know, are the patrons using the breezeway behind the establishment as a makeshift patio or smoking area? Are you aware of that?'",
        "'speaker_0': 'Our office is not aware.'",
        "'speaker_4': 'I think we've had concerns from residents that that, in fact, is taking place. It's a physical space that's available. So I'd like to alert you to that and make sure that that's part of any monitoring or compliance that we're looking for.'",
        "'speaker_4': 'Because if that is happening, we have to ensure that the conditions that arise in the condition that it be closed attend. And so that's my concern. It might not be a physical space that we recognize because we're not aware of it, but it is a space that people are using.'",
        "'speaker_4': 'And so we have to include that as part of the 10 p.m. cutoff. For noise and other things in the smoking and all of that that sort of permeates beyond the property. And I appreciate the gentleman that came to speak on behalf of the family property.'",
        "'speaker_4': 'I'm not sure where he went that you are. I'm sorry. And. You're right. It is an urban environment and. You know, not a secret. I'm an urban planner, but nowhere in my experience do we accept that defecation and everything else is part of the urban experience.'",
        "'speaker_4': 'It's. It's a consequence of. Poor behavior. Poor management throughout. It's a combination. It's not just the business owners responsibility or the city's responsibility. It is what happens. And when we have establishments that that bring in a lot of customers, which thankfully you have a successful business.'",
        "'speaker_4': 'You do. And and we're thankful for the balance that we try to strike on Broadway. Broadway was purposely many, many years ago zoned in this multiple zoning type effort with residential and commercial and business. And and whether that's good or bad, you know, you'll have to ask the residents and the businesses.'",
        "'speaker_4': 'It is a tough balance to strike. But just as we do with our homes, we clean up the area out in front of our homes. It does little to say that it's not our patrons or it's not something.'",
        "'speaker_4': 'It's in front of your home, so we have to clean it up. And so I thank you for doing that, but I want to ask staff I have seen in permits where that is actually conditioned, where, you know, the property owner is required to maintain cleanliness outside.'",
        "'speaker_4': 'And that's something that I would like to be sure is I know they do it voluntarily, but I do think that that has to be a part of our monitoring effort. And whether it's code that gets involved, any part of Broadway is not a part that we can risk having mean not maintained to a livable standard, a'",
        "'speaker_4': 'sustainable standard and a standard where patrons do want to keep coming back. We have daytime patrons that should want to find it appealing to walk on Broadway. And we're making many efforts to make adjustments, some infrastructure adjustments to the street, to the public right of way so that it can be more appealing.'",
        "'speaker_4': 'And it's not a thoroughfare. And you're right, it kind of is a thoroughfare. And we are you know, through our planning efforts, we are trying to slow that down. And so but that has to be matched with what we ensure the business owners and patrons do.'",
        "'speaker_4': 'And if I could also ask staff. Actually, if I can have a response to. The part about the cleanliness. I know we're both talking to you and but you're good at this.'",
        "'speaker_0': 'I think the discussion was, is where is the appropriate enforcement activity coming from? And I think that's a determination we'd have to make in cooperation with the police department and code enforcement as well as in the ABC conditions.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'I don't know that the area being discussed is specifically under the control for the purposes of the entertainment permit, but it could be added as a condition potentially. And we'll review that with the attorney's office as well.'",
        "'speaker_4': 'Okay. And I would appreciate that and ask that we do that well. And certainly with the loitering and cigaret butts yelling and loud noises late at night, these are the types of activities that I know your security team is probably aware of and very conscious of keeping an eye on.'",
        "'speaker_4': 'But we have to not just be aware of it and sort of the observant of it. We have to have that controlled as part of your conditions and more importantly, just just being a good neighbor. I know you can't control human behavior, but if they are patrons, we do expect that.'",
        "'speaker_4': 'We expect that kind of management. We expect that kind of crowd management and behavior management. Whether it's for the neighbors that live right next door or really other patrons are trying to enjoy themselves on the street as well.'",
        "'speaker_4': 'So those are the requirements that I am asking you to ensure is worked into the conditions and and follow up in enforcement. I don't want to leave our community represented by the few people that have come here, but they do represent that entire community.'",
        "'speaker_4': 'I know this. I don't want to leave them with this expectation that these are the things that will change unless we can actually follow up and enforce them. So if there's any changes to that, I'd like to know directly through my office.'",
        "'speaker_4': 'But for now that is my request and my belief that we will move forward with that. With that, Mr. Mayor, I'd like to make the motion to conclude the hearing and grant an entertainment permit with conditions for the mineshaft, including closure of the patio or the makeshift patio that could potentially be the breezeway by 10 p.m..'",
        "'speaker_1': 'Thank you. There's a motion and a second. We've done public comment. Members, please cast your votes on the motion.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Entertainment Permit Application for SMG Taverns, Inc., dba Iguana Kelleys.": [
        "'speaker_1': 'Thank you very much. Moving on to the next hearing, please. The next hearing is, I believe, hearing three.'",
        "'speaker_2': 'It's a report from Financial Management Recommendation to receive supporting documentation into the record, conclude the hearing and grant an entertainment permit with conditions on the application of Iguana Kelly's for entertainment without dancing district for this item requires an oath.'",
        "'speaker_1': 'Thank you. I'm not trying to. Refers to the oath. Anyone here going to do an oath? Please stand.'",
        "'speaker_2': 'You and each of you do solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you. I want to turn this over to staff now for the report.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Members of the council, the staff report will again be given by James McDonald, our purchasing and business services manager. Mayor council members tonight you have in front of you the application for entertainment for SMG taverns doing business as IGUANA Kelly's at 4306 East Anaheim in District four.'",
        "'speaker_0': 'All of the necessary departments have reviewed the application. The application and the proposed conditions are contained in the packet that was provided. We are prepared to address any questions or concerns along with the police department. That concludes our report and we're available as needed.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you very much. I'll turn this over at Councilman Don.'",
        "'speaker_0': 'Okay. Thank you, Mr. Mayor. I'm supporting this hearing and. And asked my colleagues to join me. Steve and Melissa are in the audience tonight. Thank you for being here and for waiting so long. They are very active, involved owners and are going to Kelleys on the Anaheim corridor.'",
        "'speaker_0': 'Members of the East Anaheim Street Business Alliance and and Steve, I believe, served on the board at East Bay at one time. My office has not received a single complaint about the establishment. Establishment? Excuse me, since I've been here.'",
        "'speaker_0': 'My first night was thinking to my. You think I would have heard something then? So I have. Okay. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'In addition to being great language business owners, they're also Long Beach residents. They really care about the community. I always hear accolades from their neighbors in the community and see them out eating in Long Beach restaurants. I really appreciate that you really believe in the local spirit.'",
        "'speaker_2': 'So congratulations. And I'll also be supporting this. Thank you.'",
        "'speaker_11': 'To City Councilmember.'",
        "'speaker_2': 'Super.'",
        "'speaker_1': 'Any public comment on the item? Case seeing none. Please go and capture capture votes. And guys, congratulations. You guys are obviously have a great Long Beach Long Beach people, but also a great Long Beach business. So thank you for.'",
        "'speaker_1': 'For everything. Motion carries. Thank you. Congratulations. Thank you, Councilmember. Now we will be going on quickly to two consent calendar, if I can get a motion, please. Public comment four consent items not on consent. Okay. Please cast your vote.'"
    ],
    "Start-Up in a Day Prize Competition Grant and Appropriation Increase. ": [
        "'speaker_0': 'We'd like Mr. John Keisler to make those comments for us. The innovation team leader.'",
        "'speaker_11': 'Mayor and members of the city council. Thanks so much. The Innovation Week is actually 20 days of activities. It goes from October the second through the 22nd. And this is a partnership with the Los Angeles Economic Development Corporation, L.A., EDC, the first innovation.'",
        "'speaker_1': 'Hold on 1/2. I think that's a different item. I said I have number ten, which was the US small business start up problem.'",
        "'speaker_0': 'My apologies.'",
        "'speaker_11': 'I'm looking at the wrong notes. My apologies. Startup in a day. I'm going back to the content item.'",
        "'speaker_0': 'It's very.'",
        "'speaker_11': 'Fast. My apologies. Mr. Mayor, members of the City Council hit the reset button. Started the U.S. Small Business Administration issued a competition nationally to to come up with a tool to help small businesses start up in a day.'",
        "'speaker_11': 'And there were there are 26 cities selected nationwide to receive prizes of $50,000 and one prize, which was received by the city of Los Angeles in the amount of $250,000 to develop a online business tool. And essentially the purpose of this is to make the application process for small businesses easier and to to bring city process online'",
        "'speaker_11': 'so that people may access it any time of the day. And so we we submitted and won an award, and we are now asking for the city council to to accept the award so that we can proceed with the project.'",
        "'speaker_11': 'I'm happy to answer any questions. And thank you so much for for allowing me to speak on this.'",
        "'speaker_0': 'I apologize for the confusion.'",
        "'speaker_1': 'No worries. I think there was a there's a confusion about consent as well. So any public comment on the item? See nonmembers. Please, Gordon, cast your vote there.'",
        "'speaker_0': 'Maybe they've already.'",
        "'speaker_1': 'Oh, that's right. We were going to pull it, and I thought I had gotten told, and it clearly did not. So. Yeah. So it's been voted on already. So, John, great job with that report.'",
        "'speaker_0': 'Great.'",
        "'speaker_1': 'Moving on to item number 22.'",
        "'speaker_0': '22. Okay. Thank you.'"
    ],
    "Resolution to Participate in Los Angeles County Innovation Weeks.": [
        "'speaker_1': 'Let's let's just let's do item 21 since John has already started.'",
        "'speaker_2': 'John Gravity Communication for Mayor Garcia. A recommendation to adopt the recommended resolution from the Technology and Innovation Commission in support of the City of Long Beach, participating in Los Angeles County Innovation Weeks hosted by the L.A. EBC.'",
        "'speaker_1': 'Mr. Kessler.'",
        "'speaker_0': 'Honorable Mayor and members of the city council. If you would.'",
        "'speaker_11': 'Like to if you'd like to add anything to the previous report, I'd.'",
        "'speaker_0': 'Be happy to.'",
        "'speaker_11': 'Thank you so much for supporting Innovation Week. What I didn't add earlier or that we're up to about 20 events locally in the city of Long Beach. And what's really neat about this is that these events are hosted by local innovators, entrepreneurs, local businesses to showcase entrepreneurship and innovation that's going on in our city.'",
        "'speaker_11': 'So the events range from food to Cal State, Long Beach, art college to industry manufacturing really across the board. And it's been a really interesting groundswell of support from the community who have volunteered their spaces. They actually pay for the programing and the Los Angeles Economic Development Corporation in partnership with the City of Long Beach.'",
        "'speaker_11': 'We we aggregate those events and market and promote them. But this is really a neat community showing. So if there are any other questions, they're there. All of these events are available online and you can register for the events and almost all of them are free to the public.'",
        "'speaker_11': 'That will conclude my report on this and I'm happy to answer any questions.'",
        "'speaker_1': 'Thank you very much. Good report. Let me let me just also add real briefly, this is the first innovation week that we've had that we've done. It's a great collaboration with the lady there, with her innovation team. And I know our innovation team is working really hard on this.'",
        "'speaker_1': 'And this is the kind of stuff that's really exciting that's happening that wasn't happening a year ago. All these connections that are being made, the partnerships, all of the innovators out there, they're all talking to each other now.'",
        "'speaker_1': 'And it's because of not just the work that John and the Bloomberg team are doing, but also the work of our new Technology and Innovation Department and Brian and his whole crew. It's just a really great partnership. So everyone's doing really great work and it's good to support this important event.'",
        "'speaker_1': 'Councilman actually, Councilman Richardson, you made the motion. Any comments now? Councilman Mongo. Any comments?'",
        "'speaker_2': 'I just am excited that everything is going on and the community is really embracing this. So thank you for all the work that you and your team are doing.'",
        "'speaker_1': 'And Councilman Austin.'",
        "'speaker_7': 'Yes. I just wanted to thank Mr. Keisler and the innovation team for coming out to First Fridays. And because we know last Friday and brought the whole team out, it was it was exciting. They got a chance to meet many of the residents locally and talk to them about some of the work that they're doing and where'",
        "'speaker_7': 'we're going as a city in terms of becoming greater innovative thinkers. And so I just wanted to let my support as well. Thank you.'",
        "'speaker_1': 'Q Councilman Franco.'",
        "'speaker_9': 'Thank you, Barry. I, too, want to add my voice to in appreciation of what's going on with the innovation team. Curiously enough, they joined me on my seventh District Harbor tour. They were a captive audience. They had a captive audience there and provided an update as to what they're all about, brought the whole team out, introduced them'",
        "'speaker_9': ', and they had an opportunity to engage the community and ask questions about We appreciate the community had an opportunity to ask them questions regarding what's what their job is and what they're doing. And and everybody felt very, very informed in terms of what's going on with the city.'",
        "'speaker_9': 'So I want to again, thank you for joining us.'",
        "'speaker_1': 'Thank you. MCHUGH Any public comment on the item? CNN members, please cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Update on Long Beach Strategic Plan for Older Adults and Office on Aging.": [
        "'speaker_1': 'Thank you. 22. Yeah.'",
        "'speaker_0': 'It's okay. All right.'",
        "'speaker_1': 'I know. Madam Clerk.'",
        "'speaker_2': 'Communication from Councilman Andrews, Vice Mayor Lowenthal, Council Member, Supervisor, Councilmember Muranga recommendation to direct the Department of Health and Human Services to update the Long Beach strategic plan for older adults and create an action plan to address priority areas, as well as the feasibility of creating the City of Long Beach.'",
        "'speaker_2': 'Office of on Aging and report back to City Council within six months.'",
        "'speaker_1': 'Thank you very much. Turn it over to Councilman Andrews.'",
        "'speaker_8': 'Yes, thank you, Mayor. You know, there's been over 65,000 senior citizens in Long Beach, which is the largest aging population within the city, borders yet the most underserved. As a senior myself, I know the difficulties that are faced and it's time to address these issues and to get help that is deserve.'",
        "'speaker_8': 'So at this time, I would like to ask my chief of staff, John Edmunds, to present a special presentation on this item. Thank you.'",
        "'speaker_0': 'Good evening. I'm bill mayor, vice mayor, council members city manager in the public and hope to keep this brief but it's background information for your deliberation.'",
        "'speaker_9': 'This plan was created in 2005 to identify the.'",
        "'speaker_0': 'Issues and recommendations solutions for our aging community. The Long Beach Health Department, under the direction of former department director Ron Ears and Health Department manager Teresa marano, spearheaded a Long Beach strategic.'",
        "'speaker_9': 'Plan for.'",
        "'speaker_0': 'Older adults. Task Force. This task force was made up of valued partnerships.'",
        "'speaker_9': 'That involved more than 60 representatives and stakeholders from the neighborhood and older adult service community and as well as various cities departments who participated in over two years. During the plan, the.'",
        "'speaker_0': 'Research and development stage. The purpose of the plan was to address the needs of the elderly, including safety, transportation, housing, health and improving their quality of life. The vision for the plan is one that still holds true today.'",
        "'speaker_0': 'Long Beach, the best city to live in for a lifetime, just by way of background. Long Beach is currently home to over 65,000 seniors, which is the largest age population within the city borders. We need to champion this population by providing all of the resources available to them.'",
        "'speaker_9': 'Each year are seniors and their.'",
        "'speaker_0': 'Families are faced with difficult situations from in-home in-home assistance, elderly abuse, transportation, housing and all of these can be difficult.'",
        "'speaker_9': 'Without the proper assistance. 60% of the seniors in our city are under the national poverty level, and one third of our seniors do not speak English.'",
        "'speaker_0': 'Updating the Long Beach Strategic Plan for older adults, the original plan is very comprehensive and very thorough. After reading the plan in its.'",
        "'speaker_9': 'Entirety, one would be left with the.'",
        "'speaker_0': 'Impression that not much should be changed. We do think, however, there are a few.'",
        "'speaker_9': 'Possible gaps to bring the document up.'",
        "'speaker_0': 'To date, and there should be new availability.'",
        "'speaker_9': 'In terms of services, education and technology.'",
        "'speaker_0': 'Many of our seniors are more active than ever.'",
        "'speaker_9': 'As I can attest to my mom. She puts things up on Facebook, Twitter, and everyone in Scotland messages her back. The plan was.'",
        "'speaker_0': 'Introduced to the.'",
        "'speaker_9': 'City plan in 2010. However, a few of the action items have been implemented since the plan was created. We need to demonstrate our commitment to this community.'",
        "'speaker_0': 'Through action, execution and the plan of implementation for this policy and support for the community that we are directly either part of or soon to be part of. Creating the City of Long Beach Office of Aging helps to achieve that.'",
        "'speaker_0': 'The City of Long Beach is fortunate to have many.'",
        "'speaker_9': 'Organizations services in our aging community. This includes Park Recreation, a in Marine Department Health Department, senior advisory committee, Long Beach Senior Police Partners, Long Beach Fire.'",
        "'speaker_0': 'Ambassadors, as well as other key.'",
        "'speaker_9': 'Senior partners like housing facilities, medical centers and foundations alike. Each entity carries its wealth of information and resources.'",
        "'speaker_0': 'But the information does not have a central hub for the community to draw upon its services.'",
        "'speaker_9': 'And therefore, many of our seniors are missing out.'",
        "'speaker_0': 'On key quality of life services that are, in some cases, could be lifesaving. Having an office of Aging within our city would be a central hub to providing much of the needed information and services, as well as being a conduit for future services and funding opportunities.'",
        "'speaker_0': 'The City of Long Beach Office of Aging would be under the Department of Health and Human Services to coordinate.'",
        "'speaker_9': 'Senior programs across all cross functional department lines, including tho county, state.'",
        "'speaker_0': 'And other agencies to address the.'",
        "'speaker_9': 'Priorities in service of the Long Beach Strategic Plan for older adults.'",
        "'speaker_0': 'The Office of Aging would also reflect the diversity of Long Beach by offering services that have specific needs to their cultural.'",
        "'speaker_9': 'Ethnic.'",
        "'speaker_0': 'Identity. Throughout California, many cities such as Los Angeles, San Francisco, Berkeley, San Jose, Fremont have realized the need for an office of Aging to further their support of the increase aging populations in their communities. It is suggested that we look at this city, our city, to examine funding sources, possible seed money from general fund as well as'",
        "'speaker_0': 'exploring additional revenues. The City of Long Beach is the best city to live in for a lifetime. Our city's senior population is ever growing as well as their needs. In updating the implementation of the Lumbee Strategic Plan and creating the opening of the Long Beach, aging within the city will reflect our commitment we have for our.'",
        "'speaker_9': 'Seniors in our community.'",
        "'speaker_0': 'And that concludes the presentation.'",
        "'speaker_1': 'Thank you very much, Councilman. Your anger.'",
        "'speaker_9': 'Thank you, Mayor. I'm very glad to have co-sponsored this resolution with the. Can't remember. Jesus Christ.'",
        "'speaker_0': 'Andrew.'",
        "'speaker_9': 'Andrew, don't say.'",
        "'speaker_0': 'That. Look, don't say that again.'",
        "'speaker_9': 'I'm not saying nothing. You don't say anything.'",
        "'speaker_0': 'Okay. Rex got Rex off my bed.'",
        "'speaker_9': 'And I'm very happy to say this item because I know I was a planet long, long in the making. I recall when I first started at Long Beach State as a freshman and I traveled Long Beach, I saw a wealth of aging citizens here.'",
        "'speaker_9': 'I think it was I thought it was a senior citizen city back in the day because there were there were that many there, of course, with the influx of myself and young people at the time who changed the face of Long Beach and helped it grow.'",
        "'speaker_9': 'Now, here I am on the edge, on the verge, on the cusp of being a senior citizen. And it's something that I think we need to address, obviously, with the aging population of the boomers. You know, I'm part I'm part of that boomer generation.'",
        "'speaker_9': 'And where we're getting we're getting there. And our services have not kept up with where we're getting that, where we're getting to. I had the honor also of working in the health department where there were some services there.'",
        "'speaker_9': 'Granted, it was not specific. They were not directly related to senior services and they were not supported. The only way that we can do anything meaningful is we're going to have to put some money behind it. I would propose that we create some kind of fee structure if we can, or some kind of financing that would be'",
        "'speaker_9': 'consistent and sustainable that will keep senior services available for all ages, not only mine and those behind me, but for those that are behind them as well. Because it's a travesty that we would have 65,000 senior citizens in Long Beach today who are not receiving any kind of services officially or unofficially.'",
        "'speaker_9': 'It was also an opportunity for me when I was a trustee along with City College, and we had the unfortunate incident of having to eliminate senior programs along with City College. I would like to see those returned as well.'",
        "'speaker_9': 'Senior citizens who were enrolled in. Well, it doesn't sound good, but it was a good program basket weaving in in computer, Facebook, how to how to use your computer to have a Facebook page, how to how to grow flowers, a plant and your horticulture.'",
        "'speaker_9': 'Those programs are gone and we need them back. And I totally support this. This I had them here and we should put some money behind it. Thank you.'",
        "'speaker_1': 'Thank you, Vice Mayor Lowenthal.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I wanted to thank Councilmember Andrews for bringing this item forward and for the presentation that came out of his office. I think it was excellent and necessary and really thank the coauthors as well for raising this issue to the council level.'",
        "'speaker_4': 'Council District two, as many of you know, has a large senior population. And as a result, we have a very, very busy senior center on Fourth Street. Our seniors, they range in capabilities from living active, independent lives to requiring 24 hour care in some of our private facilities.'",
        "'speaker_4': 'However, with a growing senior population, I know my colleagues share my concerns that many older adults may become shut ins with little contact to the larger community. Perhaps they've lost a significant other, or they're living in the same home for decades.'",
        "'speaker_4': 'That's filled with trip and fall hazards. Or, like many who have parents can attest, they may not be seeing a doctor on a regular basis because it is too much of a fuss or too difficult to get to.'",
        "'speaker_4': 'I believe an Office of Aging would be beneficial to helping us achieve the goals and the imperatives detailed in the strategic plan. By focusing on the gaps in service that our group of older adults that don't have assisted care or visit our senior centers.'",
        "'speaker_4': 'I know of Councilmember Gonzalez were here tonight. She would agree with us that this need was never more real than during our recent set of power outages. I think that really highlighted where our vulnerabilities were with our most vulnerable community members.'",
        "'speaker_4': 'Once we realized that there wasn't going to be a quick fix, the city's attention turned to the most at risk populations, which included our seniors. My first professional role out of undergraduate was working for the City of Los Angeles Department of Aging and learned very quickly how critical that department was and continues to be for its very'",
        "'speaker_4': 'large senior population. We witnessed story after story during the power outage of infirmed or sudden seniors that couldn't or would not get out of their homes. There's a lot of fear involved. A lot. And whom do you trust when someone comes to your door to help you?'",
        "'speaker_4': 'We had a list of seniors, senior facilities provided by the health department. But again, how do we connect services and communicate with that growing population of seniors? I think this is a good start. Councilmember Andrews, I want to thank you for bringing this forward.'",
        "'speaker_1': 'Thank you, Councilwoman Pryce.'",
        "'speaker_6': 'Thank you very much. I want to thank my colleagues for bringing this forward. And I want to acknowledge we have some commissioners here from our senior commission. So I want to thank them who are here. Two of them are third district residents.'",
        "'speaker_6': 'So thank you for being here and for all the work that you do. I think this is a great item and definitely something that we as a city should be tuned into. On our team, we have been working with our Parks Rec and Marine Department to extend senior services and senior citizen activities to other areas in the'",
        "'speaker_6': 'city. Currently, we do not have a senior center in the third district and we have actually set aside some money in our one time funds with the hope that we might be able to find a proper venue to be able to host some activities for our seniors.'",
        "'speaker_6': 'Also, one of the issues that comes up a lot in our district and I think it's probably a city wide issue and very relevant to people in my demographic is working with our Development Services Bureau, which we hope to do to review our granny flat ordinance and to think about future housing options for our seniors.'",
        "'speaker_6': 'I know that I'm one of those people who is in a situation very close relationship with with my mother. And as she continues to get older, we want to have options in terms of her housing and her quality of life as she grows in this city.'",
        "'speaker_6': 'So we do have an aging population and we need to make sure that we have adequate services and resources to give them all the wonderful benefits of this city and make sure that they feel supported. I know that I've worked with several community members on coming up with programs that might help engage the seniors and give them'",
        "'speaker_6': 'a meaningful opportunity to have civic engagement, artistic outlets and other opportunities available to them specifically for their target population. So again, I commend you for bringing this forward. Excellent job by John Edman on the presentation tonight and Councilman Andres for leading the charge on this.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_1': 'Thank you, Councilman Orson.'",
        "'speaker_7': 'Thank you. And I want to thank the council members and especially Councilmember Andrews, our elder statesman here on the city council, for bringing this good idea forward. I was had an opportunity to review this plan, the strategic plan.'",
        "'speaker_7': 'And I got to say, most of what's here is very, very applicable and relevant today. I mean, change out a few signatures from the mayor and department heads and update the data. But this is a great framework to work from.'",
        "'speaker_7': 'And to be quite honest with you, I didn't know it was was even done already. So thank you so much for for this bringing this item forward. This this also helps us provide key services and engage a key constituency, meaning our seniors in the eighth district.'",
        "'speaker_7': 'We are about a year ago put together a senior advisory committee of active and engaged seniors in my district with the idea of actually doing this, accomplishing much of what this strategic plan seeks to do for older adults.'",
        "'speaker_7': 'And so I'm proud that we're headed in the right direction in that regard. In fact, next week, our seniors will our senior advisory committee will kick off their inaugural event and have free services for four seniors at the Expo Art Center.'",
        "'speaker_7': 'Two night, two days a week. That's a grassroots effort. It's all volunteer. It doesn't cost our city anything yet, but it is it shows us that that we are growing and poised to grow in terms of engaging. And that, like I said, is very key constituency, particularly on the district level.'",
        "'speaker_7': 'And so Mr. Andrews and council members, I fully support this and look forward to doing a lot more for our seniors moving forward.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'Thank you, Councilman Andrews. What a what a wonderful item to bring before us. Having worked extensively with the area agency on Aging in L.A. County. I know how important it is that housing, transportation, nutrition, our partnerships with our local providers to ensure that our seniors are receiving the fair share of the allocations coming down from the federal'",
        "'speaker_2': 'government and from the state to make sure that we are meeting the requirements in our deliveries to our seniors and what that means to us as a community. And I think one of the things that Long Beach is excellent at as a whole, but L.A. County has really had some challenges in its transportation and our ability to'",
        "'speaker_2': 'move seniors around our city. As you look at the demographics or the topography of our city, there's ups and downs. And a lot of the communities were built where you need to have stairs to get into households. And what does that mean for our transportation when we pick up a senior from the household?'",
        "'speaker_2': 'We can't just do curbside services. We have to do other, more extensive engagements. Additionally, how does that fit into the new health care model of the ACA and what that means in terms of our opportunities when our seniors are released from our hospitals and or rehabilitation centers?'",
        "'speaker_2': 'What is that follow up and follow through look like and ensuring that we don't have that recidivism back into our health care system. So I look forward to ensuring that the program proposed maintains at least level of funding, if not greater funding if we are to separate from another area agency on aging and hopefully that we can'",
        "'speaker_2': 'demonstrate through the numbers and partnerships with the providers in place that we would be able to warrant greater funding for the Long Beach community because we really do always perform because we are so innovative. It's a great theme for the night.'",
        "'speaker_2': 'Thank you, Councilmember Andrews.'",
        "'speaker_1': 'Thank you, Councilman Richardson.'",
        "'speaker_5': 'Thank you. So so as the youngest to the most senior member of the council, I want to say great work on leading on this. And and as chair of the Fed large, I think it's great when we can align our efforts and our realignment in the city with some strategic plan.'",
        "'speaker_5': 'We're more effective when we bring down resources. We're doing the same thing with violence prevention. Great work in our development services department. We're doing the same thing with My Brother's Keeper, with our boys and young men of color.'",
        "'speaker_5': 'Our health department does this a lot. So I think it's fantastic that now we're we're reaching back to work that already been done in making it current and placing a greater focus. I'd like to just make sure that some real, tangible recommendations make it into the Fed agenda so that when we go to DC and an advocate'",
        "'speaker_5': ', we know what the priorities are of the strategic plan. So those are my comments.'",
        "'speaker_1': 'Thank you. Let me just make a couple closing comments. Open it up for public comment after this. First, I just want to thank the commissioners that are here, because I think you guys are just such great advocates. And it was great to see a couple of you guys a couple of weeks ago at the senior Congress, which'",
        "'speaker_1': 'was which was wonderful. And I also want to make a request as the council moves forward and to Councilman Andrews and certainly to staff that, I really think that I would like to see our commissioners be kind of like some of the community drivers of this process.'",
        "'speaker_1': 'And I think as we move forward, I think the commission is really well situated in a place where they can help, really provide some good impact and feedback on on the plan as it moves forward and I think be a great project for them to to be involved with as well as the rest of the community, of'",
        "'speaker_1': 'course. And so I think that would be great to see. And so I, I think this is a great step for the city and I look forward to seeing it develop. With that, we'll open it up to public comment.'",
        "'speaker_1': 'Any public comment on the item?'",
        "'speaker_12': 'Good evening, Mayor. Good evening, Mayor. Councilwoman. Were women and councilmen and also seniors. I'm Mary Alice to you. I'm a resident here and I'm also the chairperson for the Senior Citizens Advisory Commission here.'",
        "'speaker_1': 'Would you mind putting that Mike just a little bit closer to you? Thank you.'",
        "'speaker_12': 'I was selected chair for the Senior Advisory Commission in May, and from that time we've been working, working very actively to come up with plans and to be able to serve our seniors. And I'm here to respond to a letter that I received from Councilman Andrews asking for us to look at his plan with the feasibility study'",
        "'speaker_12': 'that he wants from the Department of Health and Human Services in regards to the senior issues and whether we should develop a Department of Aging. I just attended a summit today with the Department of Health, and it was hosted by our councilman Al Houston and the Art Stone Foundation and also a consultant from Cal State, Long Beach'",
        "'speaker_12': '. We need to develop a system to be able to reach out to our seniors and to help them with assessments so that we can fulfill their needs. There is a lot of gaps to be filled, and we also need a website to link everything together.'",
        "'speaker_12': 'We could also develop the senior program on MLB.TV. I watched that senior program on TV all day Sunday to see, but there's absolutely nothing about seniors there. And we could give out a lot of information to our seniors because a lot of them do watch TV.'",
        "'speaker_12': 'My recommendation is that the Department of Aging is a necessity. It's not a luxury. We have 65,000 seniors. They deserve to be served. They've served our country. Now it's time. It's our time to serve them. And they are the fastest growing population.'",
        "'speaker_12': 'The issues pertain to housing, transportation, nutrition, medical, health, and also their quality of life. I want to thank you, Councilman de Andrews, for bringing this forth. And I hope that we can work together on it and find a solution for our seniors.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_0': 'Please.'",
        "'speaker_6': 'Hello. Good evening. My name is Dr. Jane Galloway. I'm presenting as a resident of the third district, and I'm also very proud to be serving on the commission for senior citizens. I wanted to I'm very supportive of this department.'",
        "'speaker_6': 'I think what MaryAlice just said was fantastic. So I would just say ditto to that for the rest of my time. I want to plant a new idea because this isn't just about getting older. This is about creating a whole new configuration of our culture.'",
        "'speaker_6': 'So I'm going to read something from a book called Prime Time. It's not just about getting older, but about adding a whole new category to life. As we've understood it, a revolution has occurred within the last century, a longevity revolution.'",
        "'speaker_6': 'Studies show that on average, 34 years have been added to human life expectancy, moving it from an average of 46 years to 80. This addition represents an entire second lifetime, adult lifetime. And whether we choose to confront it or not, it changes everything, including what it means to be human.'",
        "'speaker_6': 'The social anthropologist Mary Katherine Bates and she's Margaret Mead.'",
        "'speaker_12': 'Started.'",
        "'speaker_6': 'As a metaphor for living with this longer life span in view, she writes in her recent book, Composing a Further Life The Age of Wisdom. We have not added decades to a life expectancy by simply extending old age.'",
        "'speaker_6': 'Instead, we've opened up a new space partway through the life course, a second and different kind of adulthood that precedes old age. And as a result, every stage of life is undergoing change. BATES And uses the identifiable metaphor of what happens when a new room is added to your home.'",
        "'speaker_6': 'It isn't just the new room that is different. Every other part of the house and how it's used is altered a bit by the addition of this room in the house. That is our life. Things such as planning, marriage, love, finances, parenting, travel, education, physical fitness, work, retirement, our very identities, even all take on new meaning now'",
        "'speaker_6': 'that we can expect to be vital into our eighties and nineties or longer.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_1': 'Thank you, Speaker, please.'",
        "'speaker_12': 'Good evening, city council mayors, city council members and thank you, council member Andrews and thank you council member Durango and all of you for supporting this. My name is Teresa marino. I am retired from the city of Long Beach Department of Health and Human Services, and I was the lead staff on the strategic plan for older adults'",
        "'speaker_12': ', and we started it in February of 2001. It was brought to the council in June of 2005. We did a redo of it in about 2007, 2008, and it has sat on a shelf since then. So it just gives us great pride and honor to see that it's being brought to light again, that all of the time'",
        "'speaker_12': 'and energy and partnerships from we used to call it the cast of thousands because there were so many partners, resources, organizations, experts. Just ordinary, extraordinary seniors that helped and contributed to this. Many of them have passed away. We just lost Diane Johnson, who was a prime mover of this document and an author of it.'",
        "'speaker_12': 'So thank you. You're making dreams come true. I think it's long overdue. An Office on aging. Thank you for putting it in the Department of Health and Human Services, because I think that's a good home. It'll be a good marriage with the partnership with the Parks and Recreation and input from the commissions.'",
        "'speaker_12': 'There was a summit today put on by the Department of Health and Human Services, and it was like dja vu all over again because so many, so many of some of the original partners and many of the groups that contributed to this first document were there, and they were excited to hear that this was on the agenda'",
        "'speaker_12': 'tonight. And it's going to be exciting. Many of us pledged that we will be a part of the trying to gather data coming up with new with new ideas and and looking at what has happened in the past ten years where we need to move forward and to see that many of us are now part of that'",
        "'speaker_12': 'aging population. And and.'",
        "'speaker_11': 'And this is, you know, self-serving in some.'",
        "'speaker_12': 'Respects. But again, it's a great thing for our city. Thank you so much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Thank you again, Mr. Mayor. Gary Shelton's my name and I live at 240 Chestnut. That's Plymouth West. It's a building of 200 senior citizens living in affordable housing. We have a residents advocacy network. Betty Chambers, if you could say hi, she's up there.'",
        "'speaker_0': 'She's the president of the Resident Advocacy Network. And I'm its sort of neighborhood. I'm the guy that brings things in from outside. So that's why we know this is going on. So I appreciate the time. I looked over the 25 to, I guess, 2007 strategic plan and notice that it had five basic categories.'",
        "'speaker_0': 'They've all been mentioned already. They were safety, transportation, housing, health and quality of life as the key element of interest. And I was thinking, well, what else could there be? Now Councilmember Yarrawonga was kind enough to mention technology should be a highlight.'",
        "'speaker_0': 'And I want to point out that as as Dr. Lowenthal said, we had issues during the power outage where no amount of technology was helping us, particularly the senior citizens, which were in such we were in such trouble over there.'",
        "'speaker_0': 'We needed low technology actually. So the the sense that and what by that what I mean but I mean what I mean by that is that if there had been police cars with loudspeakers going through the streets telling us what was going on instead of text messages and Nixon, which weren't working for us, it could have improved'",
        "'speaker_0': 'our understanding of what was happening. So there's, there's always a couple of sides to each coin. Council Member Price You mentioned entertainment, and I think access to entertainment for senior citizens is always something that needs attention. I know once or twice a year we're invited as guests of the of the theater back here.'",
        "'speaker_0': 'I guess it's that way. I never know what direction anything is from in this room. And those presentations are wonderful at the at the Beverly O'Neil Theater. Those are terrific presentations every year. Council Vice Mayor Lowenthal, you mentioned mobility is important.'",
        "'speaker_0': 'And I wanted to stress also that ADA compliant because so many senior citizens end up being disabled. But, you know, there's not such a thing as senior disability. Actually, we need disability accessibility to disabled help. But we unless you become disabled before you're retired, you don't really become disabled.'",
        "'speaker_0': 'But specifically and realistically, mental health is something that I think needs to be on the list. The whole idea of PTSD for our soldiers who have come back from now from Korea and Vietnam, for folks who are experiencing depression and folks who realistically are entering into years of dementia or perhaps Alzheimer's.'",
        "'speaker_0': 'And I think that's a category that's going to need special attention. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_11': 'Good evening. My name is Dr. Cheryl. Mathew and I have a business in Long Beach. I'm a geriatric care manager for about ten years, a member of the for a resident in the fourth District. And I'm kind of in shock.'",
        "'speaker_11': 'I'm here because I just heard that this was going to be presented last night. We got an email, uh, through the some way that it found its way to me. And that's sort of like how our senior services have been up until now.'",
        "'speaker_11': 'It's siloed. There's lots of great people out there doing amazing work, but we don't know each other and we don't know what each other is doing. So what's nice is that this is not reinventing the wheel, just taking what we have and organizing it into a single place that can drive it forward.'",
        "'speaker_11': 'Um. Yeah, that's that's the bottom line. And I really see it. It's not just about frail, low income seniors. They are very important as well. But as a care manager, I've been into the multimillion dollar homes in Naples, and they have the same issues as the low income seniors and their caregivers have the same stress levels as'",
        "'speaker_11': 'everybody else. So they all we all need to know that information. We talked today in the summit about. And you touch on it a little bit too, creating intergenerational programs. So we all know about this. There's my eight year old, my eight year old daughter.'",
        "'speaker_11': 'She's been with me and dementia care community since she was an infant. And I see the difference that children make with the seniors and that we can all have fun together so that it's not just, oh, it's time to be a senior over here.'",
        "'speaker_11': 'It's it's our it's our whole life span. One of the things I saw on the summit vote today that got the most one of the most votes is creating fund with the seniors, but also the gift of aging.'",
        "'speaker_11': 'So it's not like, oh, we're going to bring the seniors to the Playhouse tonight or we're going to go sing at the nursing home for Christmas. It we embody this all year long. Justin Rudd does a great job with the Community Action Team in Bel Mature and I see myself as someone whose has wanted to take this'",
        "'speaker_11': 'to the senior community and older adults. And now at 50 I am one of them. I got my card for it in the mail. So here we go. And it was it was ten years ago that I was here presenting on the Long Beach Strategic Plan.'",
        "'speaker_11': 'I was here at the end when these amazing people spent two years to get it together. The economy took a tank and the council people weren't old enough yet to get it. So I'm just grateful that we're here.'",
        "'speaker_11': 'Thank you all for your consideration. And I look forward to playing a part in this and making a difference in our city. And together we are brilliant. So thank you very much.'",
        "'speaker_1': 'Thank you. Thank you for having a business here in Long Beach as well. Thank you.'",
        "'speaker_12': 'Excuse me.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_12': 'How are you? Laura Clarendon. I'm also a member of the third district or resident of the third district, and I'm also a member of the Senior Citizens Commission.'",
        "'speaker_1': 'And you have a lovely home.'",
        "'speaker_12': 'Thank you. And I must say that I'm just very delighted to be here. But I must also point out, and would like to thank Councilman Andrews and Ranga for sponsoring this motion of this. Agenda item so that we can move forward and create a Department of Aging.'",
        "'speaker_12': 'I think that it's I'm not going to repeat everything that the commissioners have said. I think that is not a luxury, is an absolute necessity that is long overdue. And the previous speaker pointed out some of the issues that we as a commission have also faced this lack of integration or communication between a lot of the city'",
        "'speaker_12': 'agencies in regards to the needs of senior citizens. So I think this this agency will be wonderful to establish and make sure that there is a follow through and there is a process by which we can unify all those resources.'",
        "'speaker_12': 'And secondly, I can assure you that the members of the Senior Citizens Commission are committed to making sure that we improve the lifestyles of the senior citizens of this city, as well as all of the citizens in general.'",
        "'speaker_12': 'So I'm happy to be here, and I just wanted to thank you and support the rest of the commissioners.'",
        "'speaker_1': 'Thank you so much. Next speaker. Another whenever a great commissioners.'",
        "'speaker_12': 'I'm Diane McInnis and I'm from the second district and you've got such wonderful faces at 8:00 at night and you're all alive and energetic. So why did I come for just two or three things? As a Long Beach resident, I wish to commend the entire council, the vice.'",
        "'speaker_6': 'There, and the mayor for.'",
        "'speaker_12': 'Realizing the importance of older adults. You don't have to necessarily call them senior citizens. We're just a little bit older and I'm going to celebrate my 70th in a few weeks. So I wanted to say that the most important thing is that we are a city of innovative thinkers.'",
        "'speaker_12': 'We are a city of wonderful, innovative thinkers. And I am confident that you as leaders and we as the community can work together to solve this problem. Go Long Beach.'",
        "'speaker_1': 'Thank you, Diane. I saw your other half earlier today.'",
        "'speaker_12': 'Good evening. My name is Maria Bezerra and I'm the senior organizer with Central Asia. I have a we have a group of 25 from Autodesk. I salute you. They are the promoters of aging and well-being. Thank you. Thank you very much for presenting this.'",
        "'speaker_12': 'Uh, Councilman Austin and also my long term colleague. We will Roberto and I go back from quite the college years, so I wouldn't say that I'm not even a senior. And he's trying to say he's almost there, but he we know better.'",
        "'speaker_12': 'I was also one of the part of the committee that was part of the part of the Committee for the Strategic Plan way back when I used to be involved a lot with the Health Department, and at that time we were kind of sad because we did all the work and then it kind of it got put'",
        "'speaker_12': 'on a shelf. So now it's the time when this baby is coming alive. And again, thank you for doing it. One of the things I just want to indicate is that out of those 65,000 seniors that are here in Long Beach, 42% happened to be Latino.'",
        "'speaker_12': 'And a lot of them are Spanish speaking. And so that's the reason why I decided to come up here to to be their voice and to kind of let you know that whatever services are out there, that we really need to take that into consideration because seniors do face that the need for the need for having company'",
        "'speaker_12': ', for having caregiving, for being involved, because isolation is one of the biggest needs that they have with Latinos. It's even bigger even though we have even though they have families, some of them that are that are physically not able to get out.'",
        "'speaker_12': 'And and many of them are also being they're providing caregiving to their family as well. The families out there keeping to jobs to make make needs met. So, again, I just wanted to let you know to please not forget our Latino seniors and please include us in there as well.'",
        "'speaker_12': 'And I would like to be part of that agenda item for the group. Thank you. Have a good evening.'",
        "'speaker_1': 'Thank you for all the work you do. Great work with the promoters. Thank you. Next speaker.'",
        "'speaker_12': 'Good evening.'",
        "'speaker_2': 'Ladies and gentlemen.'",
        "'speaker_12': 'And thank you, Congressman. Council member Andrews. I just promoted you. I worked with Diane Johnson for many years. I'm trying to get in the office of an Aging, and unfortunately, she passed away. She was one of my best friends, and one of her dreams was Office on Aging.'",
        "'speaker_12': 'Theresa marino. Um. Dr. Cheryl MATTHEWS. Dr. Jean Bader. And Dr.. Barbara White and. California State University, Long Beach. She has worked many years. So I think all total it's been about 30 years that we've been asking please for an office on aging.'",
        "'speaker_12': 'We truly need it. I work with seniors. I'm retired now, but I work with seniors. I'm on the elder abuse prevention team and older adult transportation team agencies and programs on aging and part of IDA. And the most I hear from our senior population is all the services in Long Beach are fragmented for seniors.'",
        "'speaker_12': 'There is no one place to go for it. And they search and they get very frustrated. So if you can help bring this. In the forefront. It would help our senior population. At the present and going forward for the city of Long Beach.'",
        "'speaker_12': 'And by the way, I'm not a Long Beach residents. I'm located in Lakewood, but I support Long Beach. The elder abuse prevention team is Long Beach. I, I really respect the city and I truly do believe it deserves it for its community and senior population.'",
        "'speaker_12': 'Please don't let it be another 30 years that we wait for it. Thank you.'",
        "'speaker_1': 'Thank you. I have. Oh. It's only 1/2. Oh, come on for real quick. Just cause I'm going to get. I'm going to get married.'",
        "'speaker_12': 'So I completely forgot I had a senior moment. No, I just like to let you know that, you know, our friend Lou Wall, who was running the Latino club at the senior center on Fourth Street, also passed away.'",
        "'speaker_12': 'She was also one of the members of the strategic planning, and they're actually having the city alone, which police department is having a celebration of life for her tomorrow from 1 to 4 and everyone is invited. Thank you.'",
        "'speaker_1': 'No, thank you very much. Good and good. Important announcement. Vice Mayor Lowenthal.'",
        "'speaker_4': 'Thank you. I wanted to follow Councilwoman Price's gratitude, expressed gratitude for all of your service, those of you that serve on our commission. I know Rita is here and has served as the second district representative for a long time.'",
        "'speaker_4': 'And I want to thank you, Rita Elmer, for doing that and all of you who serve. And you can't keep using the senior moment excuse. That isn't. Some of our councilmembers use it it doesn't work but thank you.'",
        "'speaker_1': 'And Pat West almost.'",
        "'speaker_4': 'And.'",
        "'speaker_1': 'Soon to be.'",
        "'speaker_0': 'Just plain.'",
        "'speaker_1': 'We're going to we're going to go we have a motion on the floor. We've done public comment. I just something I was just thinking of, you know, vice mayor and I we like to talk about those good public policy moments.'",
        "'speaker_1': 'And I think this is a really good public policy moment. And I just want to thank everyone that signed on to do this. Councilman Andrews, vice mayor, councilman, superstar and councilmember your during this is a really, really good thing.'",
        "'speaker_1': 'I'm really glad you guys do this. And so we have a motion because.'",
        "'speaker_8': 'I did make the motion.'",
        "'speaker_1': 'Yes, go ahead, sir.'",
        "'speaker_8': 'Okay, fine. I would like to move this motion. But before I'd even do that is that I want to thank all the young ladies who came up and spoke on aging. So when you do get to be that age, then you can come back and we will accept it.'",
        "'speaker_8': 'So now I'm just moving this motion and I like all my colleagues to pass that and thank everyone for that.'",
        "'speaker_1': 'All right. Thank you very much. There's a motion and.'",
        "'speaker_8': 'I know that your my young ladies and.'",
        "'speaker_1': 'I've heard stories about you. Yes. Please cast your ballot.'",
        "'speaker_2': 'Councilman Andrews.'",
        "'speaker_0': 'And then they go.'",
        "'speaker_2': 'Yes. Yeah.'",
        "'speaker_1': 'He says he's 75. He doesn't have to vote if he doesn't want to get out. You know, he's voting.'",
        "'speaker_2': 'That motion carries.'"
    ],
    "Status Update on Rapid Medic Deployment Program Termination.": [
        "'speaker_1': 'Great. Thank you. Thank you all for coming. And of course, no big surprise being led by women. Of course. Oh, it's always the women. Always the women. I swear. It's just amazing. Next item is 23.'",
        "'speaker_2': 'Communication from Council Member Richardson. Council Member Super Non Council Member Ranga. Council Member Austin. Recommendation to request the City Manager to provide a status update on the termination of the Rapid Medic Deployment Program.'",
        "'speaker_1': 'Thank you. Mr. Richardson, a joy to go to Stanford with you. Okay, turn it over to staff. Thanks. Mayor council.'",
        "'speaker_0': 'Members. We can have a quick report by our fire chief, mike. Good evening, mayor garcia and members of the council. As you were aware, on August 26th of 2015, the Los Angeles County Emergency Medical Services Agency or EMS agency, notified the Long Beach Fire Department that they were terminating the rapid medic deployment or RMD pilot project, and'",
        "'speaker_0': 'that by October 3rd, 2015, the Department must return to the previous staffing model of two paramedics on all advanced life support or A+ ambulances. In our September 1st presentation to the City Council, the city manager and I advised the City Council that we would comply with the direction provided by the EMS agency and revert to our prescribed'",
        "'speaker_0': 'staffing configuration. Also at the September 1st City Council meeting, the City Council directed the fire department to provide weekly updates on the status of returning to our pre armed staffing configuration. Since September 1st, the fire department has worked diligently to accomplish all tasks necessary to return to priority staffing, and these have been detailed in the five weekly'",
        "'speaker_0': 'memoranda that we have provided the City Council. In summary, we have done the following with support from human resources. We conducted the required meet and confer sessions with the Firefighters Association and the IAM to discuss the impacts of the staffing change.'",
        "'speaker_0': 'We have completed analysis on the impact of the return to the previous staffing model would have on the number of positions needed in all ranks on a daily basis. We've evaluated the need for a fire academy in fiscal year 2016 as well as the future need to send firefighters to paramedic school.'",
        "'speaker_0': 'We have convened a paramedic committee comprised of paramedics and other frontline personnel, representatives from the Firefighters Association and Management to discuss the return to pre-formed staffing and other related issues. We've reassigned firefighters, paramedics and ambulance operators based on seniority to different apparatus under the RMD staffing configuration.'",
        "'speaker_0': 'As a result of the rebuilding process, we've reconfigured the Fire Communication Center's dispatch system and processes to correlate with new apparatus locations. And we've completed all the logistics required to move apparatus and equipment. On October 3rd, when we return to our previous staffing model, I want to thank all of the fire department staff who are responsible for'",
        "'speaker_0': 'this planning and implementation process. And I'm pleased to report that we had an uneventful transition on the morning of October 3rd. As you know, upon receiving notification from the EMS agency that they were terminating the RMD program, we began to work with representatives from Deccan, which is our apparatus deployment information system, to conduct data analysis in order'",
        "'speaker_0': 'to determine the best locations of resources when we return to the RMD system on October 3rd. The Deccan program is a predictive modeling tool which helps us make apparatus deployment decisions based on historical data. The objective of this analysis was to determine the most effective placement of our emergency response apparatus to respond to emergency medical calls.'",
        "'speaker_0': 'This is the same system we have used over the past decade to make resource reduction determinations. This evaluation of data is very complex process and is best described as a system wide analysis of three years of data involving 180,000 calls for service.'",
        "'speaker_0': 'This analysis involves all call types, not just calls for emergency medical services, and recommendations are provided based on the most effective apparatus locations throughout the city. Additionally, there are a number of factors that go into the analysis included, including historical call volumes, response times, overlapping coverage, secondary coverage and automatic into and out of the city automatic aid'",
        "'speaker_0': '. The fire department used the above criteria and using the 180,000 calls for service ran scenarios of the system in multiple configurations to determine if the deployment model we had immediately preceding armed was the best utilization of our resources, or if there was some compelling new information that would cause us to shift resources.'",
        "'speaker_0': 'Based on this professional analysis and the supporting deck and software analysis, the fire department determined that there was not conclusive evidence enough to move resources to locations different than the prescribed locations. Put another way, the prescribed model is the most effective model currently given the available resources that we have.'",
        "'speaker_0': 'Therefore, on October 3rd, 2015, we placed paramedic ambulances and paramedic assessment units at their respective prior M.D. or July nine, 2014 locations. Which was an effective and proven deployment model prior to the implementation of R&D and we believe is currently the best model to ensure protection to the entire city as resources are constantly moved around the system'",
        "'speaker_0': 'to ensure protection for all our residents and visitors. The fire department will continue to evaluate the data over the course of the next year and ensure that apparatus are placed in locations that will have the greatest impact on our overall response times.'",
        "'speaker_0': 'Mr. Mayor, council members, that concludes my report, and I'm available to answer any questions you may have.'",
        "'speaker_5': 'Well, thank you, Mr. Mayor. And thank you, Chief, for for diligently facilitating this whole process. I know it's been difficult over this past month, but I also want to just thank you for the way that you've reported out over the course of the last month weekly as the council requested.'",
        "'speaker_5': 'I want to thank the residents. I know that, you know, you're spending a Tuesday night doing what we do, but this is democracy. I know that you guys dig this stuff. So I'm glad that you spent tonight with this is really important to our community.'",
        "'speaker_5': 'So so, chief, as you stated in the last in the last time you were update providing update to city council, we did direct you to to do an analysis over the course of this last month to provide weekly status updates so that we can sort of track and participate in this process along the way.'",
        "'speaker_5': 'So thank you for for complying with those requests. And I've personally had the opportunity to follow these updates. Over the past month and track your work in unwinding the R&D program. And despite the way that people might have felt about R&D, I know that you and your staff and your leadership worked very hard to implement it, and'",
        "'speaker_5': 'the fact that you worked so hard is something that definitely needs to be recognized. And in the third weekly update, you listed the proposed deployment schedule, which outlines paramedic resources that will and will not be placed in service on October one.'",
        "'speaker_5': 'And what stood out to me as particular about this with about this memo, a peculiar about this memo was the line that stated the evaluation of data is very complex process, and the data provided thus far has been inconclusive as to the optimum location of each paramedic, ambulance and paramedic assessment unit.'",
        "'speaker_5': 'So the fact that it was inconclusive was a bit vague and difficult for me to grasp. I can either interpret it as given the resources in place. Eight Rescues data doesn't allow us to conclude that one deployment model is or schedule is safer than the other.'",
        "'speaker_5': 'Therefore, we're going reverting back to the old schedule, which is what we know. Or it can mean that we actually don't have enough recent data post R&D and that if we had that data, it would be conclusive. So I would ask you to just take a moment, elaborate.'",
        "'speaker_5': 'What did you mean by the data is inconclusive. What actually happens when you run the deck in software and look at those different models?'",
        "'speaker_0': 'Councilmember The in order for us to run our software analysis, to take those 180,000 calls for service and run them in the system as a predictive modeling tool, we first have to establish a baseline system so we couldn't use the RMD deployment model because we knew that was going away.'",
        "'speaker_0': 'So what we did was we went into our deck in software and put the pieces in place that were in place on July 9th, 2014. So exactly preceding R&D. And then we ran the system based on our historical calls and then we took the time through a number of different configurations.'",
        "'speaker_0': 'We moved resources around the city. If we moved an ambulance here, an ambulance, their engine here engine, their assessment units, and we ran the system and then we would run secondary calls in an automatic eight in, automatic eight out and and different types of calls.'",
        "'speaker_0': 'And when we say that the data was inconclusive, what we're saying is there was nothing there was no sort of compelling evidence or no sort of conclusive data set in a different configuration other than what was in place just prior to our M.D. that would lead us to make a shift of resources from one place to another'",
        "'speaker_0': '. Bottom line is, if we had a hole in our system, we would be shifting that hole in our system from one place in the city to another place in the city. And we believe that the deployment model we put in place today, given the resources we have, is the very best thing we can do for the city'",
        "'speaker_0': 'today.'",
        "'speaker_5': 'And I think it's important that you break that down the way that you did, because it sounds to me and let me articulate what I just heard. Since the system citywide, the placement really doesn't matter where you place it.'",
        "'speaker_5': 'Either way, you spin it with limited resources. There's. There will be a hole somewhere in town.'",
        "'speaker_0': 'Yes, sir. Okay.'",
        "'speaker_5': 'So it seems like since like I've done work at City Hall in the last five years, we've we've sort of spoken about this paramedic issue. And, you know, although it's an issue that does impact the whole city, I know that, you know, people feel good about having a rescue in their particular area and particularly around the fringes'",
        "'speaker_5': 'of town, the edges of town like east and north. I particularly remember it was 2010 when we made the shift from nine resources, from nine rescues down to eight. There was a lot of confusion then and one example stands out to me in particular, there was a minor accident on Atlantic and Artesia was a a school bus'",
        "'speaker_5': 'and there was a during that accident was a a student, a special needs student that had a seizure. And in the same moment, there was a emergency call at Jordan High School directly across the street where there was a heart attack or something like that.'",
        "'speaker_5': 'And so at that, this was three months after 12 was eliminated. And so rescue nine in Bixby Knowles responded to Jordan High School and then Rescue one in downtown responded to the the car accident with the child, with the seizure.'",
        "'speaker_5': 'And I remember 17 minutes later that we did get a response from L.A. County Fire Department. And what this story sort of reminds me of is that even though the response was from downtown, you could very well find find a downtown rescue in uptown, you can find East Rescue in Central.'",
        "'speaker_5': 'It's really a city wide system. And by taking out and not having really those resources, it really puts a strain on the whole system. And my concern is that if we go back to eight rescues, we will experience similar issues.'",
        "'speaker_5': 'So I would. Want to get your your opinion on this. Can you describe is there a distinction in the system response when you have nine rescues in our city instead of eight? Is there does a nine? Does the value added with a knife rescue provide a more stable system?'",
        "'speaker_0': 'Well, Councilmember, certainly, because as you mentioned, it is a citywide system. The system is dependent on a sum of all the parts. If you add more resources into the system, it would create more stability within the system. I just want to make sure that everybody understands that we do the very best we can do.'",
        "'speaker_0': 'Our people are very good at doing what they do with the resources that we've got. But certainly, yes, adding adding more resources into our system would make the system better.'",
        "'speaker_5': 'So. So and I get that I know that that we you do as best as you can with the resources you see fit. And that's why I think it's our job to really have a conversation about the system and those resources.'",
        "'speaker_5': 'So so specifically, what does it actually cost to place a rescue, a ninth rescue into service?'",
        "'speaker_0': 'COUNCILMEMBER The the annualized cost for a rescue ambulance. PARAMEDIC Rescue ambulances, $1.1 million.'",
        "'speaker_5': 'Okay. Roughly. I know these are sort of off the cuff emotions, but I know that I know that we've had conversations I've heard this term about scalable resources. Can you explain what that is as well?'",
        "'speaker_0': 'Councilmember Scalable. The term scalable as a as applied to resources would be something that is not permanent, something that's put in for peak load. Peak load periods over there has a sunset at the beginning and an end. So it wouldn't be a permanent thing.'",
        "'speaker_0': 'It would be something you do as just kind of a scalable asset. Put it in for a little while. Take it out.'",
        "'speaker_5': 'Great. So if so, if the city council were to help to identify extra resources to help support our paramedic response, would you use the priority list that was submitted to council in the past year, or would you use them last out first, first in methodology?'",
        "'speaker_5': 'How would you approach this?'",
        "'speaker_0': 'Councilmember We the fire department sent a memo to City Council in 2013 and they can't remember the exact month, but I can find out for you. But that outlines was in August of 2013. Outlines our restoration list, if you will, and it lists them in order.'",
        "'speaker_0': 'And so we would follow that memo that we had sent to the council.'",
        "'speaker_5': 'I think that's smart. Was that and that. So I'm familiar with that because we followed that for a number of years, even before the R&D program. So that's great. So so Chief, I want to thank you for this report.'",
        "'speaker_5': 'I want to thank you for the hard work that your staff has done. And I want to thank the hardworking firefighters for their service as well. I personally believe that we're in a moment where folks, whether it's pundits, whether it's the media, maybe people who have watched the city council for a long time, they expect us to'",
        "'speaker_5': 'divert to the dark ages of debate, where in order for my community to win, your community has to lose. And I believe that we were elected to really think bigger, think broader about our city, and rather, rather than have the conversation about who's community loses.'",
        "'speaker_5': 'I'd rather have a smart conversation about how all communities can win. So the chief you know, the chief just mentioned that this with the circumstances, you guys based on eight rescues. You can't identify any alternative model unless there's some other chess piece on the board or on the table.'",
        "'speaker_5': 'And I take that very seriously. So if he had additional resources, he'd be able to fill gaps and have a more stable system to collect data over the next year. We all know that next year we're going to have budget circumstances and budget challenges.'",
        "'speaker_5': 'We're going to have to have make some tough decisions. I'd rather go into that with a stable year of data so that when we do have a conversation about city wide resources based on a stable year, you know, with with with a better staffed program than we have today.'",
        "'speaker_5': 'So so I want to make sure that we're also looking at other opportunities and we're proactive as we go into next year's budget. So I want to ask the chief a question. When's the last time that we've actually looked at or evaluated opportunities for us to expand our services to surrounding communities?'",
        "'speaker_5': 'And if we were to evaluate that, what would that look like and what were the things you would need to do over the course of the year to figure out if we can expand services to surrounding cities?'",
        "'speaker_0': 'Councilmember I in my tenure in management on the fire department and even even coming up through the ranks, I don't know. I know there's been a couple discussions during my career about possibly expanding or providing service in other local jurisdictions, but we haven't.'",
        "'speaker_0': 'Since I've been in management, engaged in any sort of that activity. But I certainly would be I would not be opposed to the idea, of course, if a surrounding community wanted to have a conversation with us about augmenting their system or providing a service someplace else, we would certainly be open to it.'",
        "'speaker_5': 'Sure. I know that other cities around us have have looked into perhaps counteracting with the county. And I don't know that we've ever that we were part of those conversations. We have a fantastic fire department and and we should at least explore that feasibility.'",
        "'speaker_5': 'Does it help our system? Does it hurt our system if we expand and look at coverage in other cities? So that's something I like for us to look at. So so I'd like to make a motion. So given this conversation and given where we are today, I move that city staff report back to city council in 30'",
        "'speaker_5': 'days on the feasibility and options to place an additional rescue into service in the course of the fiscal year this current fiscal year. This could include a restoration or scalable options. We want you to evaluate the use of an adjusted return rate on our first responder fee potential one time resources as they become available or other potential'",
        "'speaker_5': 'funding sources. And then secondly, the second part of this motion is to evaluate our ability to provide fire services to surrounding cities on a contract basis and make a recommendation over the course sometime between now and the next year on a recommendation of city council.'",
        "'speaker_5': 'That's my motion. Thank you.'",
        "'speaker_1': 'Councilmember Yeah, one quick question about that, just to make sure and I think it's great to get to go back and get the info. Is 30 days enough time? 45 days?'",
        "'speaker_5': 'Question What do you think?'",
        "'speaker_1': 'Chief Just seems very tight for me, but we could do.'",
        "'speaker_0': 'Something like that in 60 days.'",
        "'speaker_1': 'Is that okay with you? Councilman, I'm comfortable. Okay, great. So we have a motion in a second council in Austin. We're okay there. Let me go to the public comment and then we'll take it back to the council.'",
        "'speaker_1': 'So if any members of the public want to comment on this, we have a motion on the floor to go get some additional information from the fire chief and bring it back in the next 60 days.'",
        "'speaker_2': 'Good evening. Mayor Garcia and city council members. My name is Eileen Iron and I live at 3421 St Francis Place. I'm the president of the Saint Francis Neighborhood Association, and I'm here to.'",
        "'speaker_12': 'Voice my support.'",
        "'speaker_2': 'For comprehensive.'",
        "'speaker_11': 'Fire services.'",
        "'speaker_12': 'And encourage that you all.'",
        "'speaker_2': 'Do the same. To me, one of.'",
        "'speaker_12': 'The most important services.'",
        "'speaker_2': 'In our community is our fire department, who responds to various emergencies across the city within a month and a half. We've had three times.'",
        "'speaker_11': 'Just on my street alone. The fire department respond to four senior citizens.'",
        "'speaker_12': 'Of which I am one. But they weren't responding for me. We also.'",
        "'speaker_2': 'Because of our particular street, is a kind of a.'",
        "'speaker_12': 'Curvy street.'",
        "'speaker_2': 'Where the others aren't in the rest of the neighborhood. Some young people like to see how fast they can take their cars.'",
        "'speaker_12': 'And manipulate the curves.'",
        "'speaker_11': 'Two young men did so two weeks ago and.'",
        "'speaker_2': 'Their car.'",
        "'speaker_12': 'Went nose to artery.'",
        "'speaker_11': 'And.'",
        "'speaker_2': 'One of them ended up with.'",
        "'speaker_11': 'Several bones broken.'",
        "'speaker_2': 'In his neck. The last I heard he is doing much better.'",
        "'speaker_12': 'In is at home. So I want to thank the City Council for listening to our community.'",
        "'speaker_2': 'And what is important to us. I especially want to thank Councilman Richardson. Councilman Orson, council member, supervisor and Councilman Turanga for bringing this. And we have some other residents from the ninth District who have have come to support it as well.'",
        "'speaker_2': 'Would you please stand? Thank you.'",
        "'speaker_1': 'Thank you and thank you all for coming out. We really appreciate that. Next speaker. How are you doing?'",
        "'speaker_11': 'I'm great. How are you? Good. I was going to ask you to.'",
        "'speaker_12': 'Do an exercise, but as late as you may fall asleep. So I won't ask you. I was going to ask you to just close your eyes during this presentation, but I won't do that. You might fall asleep. So we'll move on.'",
        "'speaker_11': 'What I want to talk about tonight is some personal situations where we needed.'",
        "'speaker_12': 'To utilize emergency services. And one had to do with my spouse. In my neighborhood, there's a lot of aging as well going on.'",
        "'speaker_2': 'I won't count.'",
        "'speaker_11': 'Myself as one of the older.'",
        "'speaker_2': 'Ones yet, but I am there.'",
        "'speaker_11': 'And we have.'",
        "'speaker_2': 'A lot in our neighborhood and in.'",
        "'speaker_12': 'Our association area.'",
        "'speaker_11': 'If you just think about it, you close your eyes for.'",
        "'speaker_2': '3 minutes and think about. Coming up on someone who needs emergency services.'",
        "'speaker_11': 'Very badly, urgently in the time it takes for you to make the decision, I need to make the call. And even though the call is answered quickly, explaining the situation. And waiting for that sound to come up your street that says Help is almost here.'",
        "'speaker_11': 'And waiting for those individuals, those professionals, to walk through your door and place their equipment down. And the sigh that now awaits you.'",
        "'speaker_12': 'For what has felt like.'",
        "'speaker_11': 'An eternity or.'",
        "'speaker_12': 'Two lifetimes. And many of us have experienced that.'",
        "'speaker_11': 'So I will professionals are very vital to all of us, not only the seniors. If there's a.'",
        "'speaker_2': 'Child who swallowed something.'",
        "'speaker_12': 'And you can't get it out.'",
        "'speaker_11': 'It's critical that the emergency.'",
        "'speaker_2': 'Services be there. And if they have to come from across town as opposed to.'",
        "'speaker_12': 'Being close by the amount of time that it might take for them to actually for you to hear that sound.'",
        "'speaker_11': 'For them to come through your door, place their equipment.'",
        "'speaker_2': 'And actually.'",
        "'speaker_11': 'Start the work. This is what's before you tonight. Alternatives. Additional resources. We know that the budgets are tight, but we need to find a way. We need to find a way of being able to address emergency services.'",
        "'speaker_12': 'For all of our citizens.'",
        "'speaker_11': 'Be they the senior citizens or the.'",
        "'speaker_12': 'Young children.'",
        "'speaker_11': 'Or anyone who has come into our city for whatever reason, they the events that go on here. We need to have emergency services.'",
        "'speaker_2': 'And so with that in mind, I'd just like to say thank you for.'",
        "'speaker_11': 'Listening to us tonight. Thank you for your most urgent considerations. For the needs of this city.'",
        "'speaker_12': 'And go uptown. Go. Top of the tail and go. Long Beach. Thank you.'",
        "'speaker_1': 'Thank you. I love that everyone says go Long Beach now. All right. Thanks, Speaker.'",
        "'speaker_0': 'Good evening, Mayor. City Council. My name is Calvin Mack Guidry, and I am a resident of the ninth district. I've come to the council tonight to voice my support for comprehensive services, to to make sure that we're were being served adequately based upon the needs.'",
        "'speaker_0': 'I have a senior in my home.'",
        "'speaker_1': 'That I.'",
        "'speaker_3': 'Would like to make.'",
        "'speaker_0': 'Sure that coverages is and response time is really, really short. But recently I've had a chance to see our response happened when my mother was having a situation. And the the amount of services that showed up was, was really good.'",
        "'speaker_0': 'This was in the Los Angeles area.'",
        "'speaker_1': 'And the amount.'",
        "'speaker_0': 'Of. Service. People that showed up. It really was a great thing to see them to come in and handle the situation where they had to secure a good work space, which get her out of her bedroom and into the living room where they were able to work and do their job.'",
        "'speaker_0': 'I'd like to see that for Long Beach. I'd like to see that for our area. And. Make everything a little bit better for the north, north and Long Beach. Thank you to Councilman Richardson, Austin, your anger and super now for bringing this motion to the forefront.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_12': 'Good evening, Mayor. Council members. My name's you've been my partner and I are homeowners in North District. And as most of you know, the ninth district is one of the most populated district in the city. So any services taken away will put a strain on the rest of the city.'",
        "'speaker_12': 'And as we've heard, they're expecting this winter to be the worst winter in history. And we've seen in the news reports.'",
        "'speaker_0': 'How.'",
        "'speaker_12': 'You make that phone call and there is no services available. So. We don't want to be caught unprepared. So I'm asking that you save our services. Thank you. Go. Long Beach.'",
        "'speaker_1': 'All right. I know we're going to get to go along with Jerry.'",
        "'speaker_0': 'You start with a goal on which. Thank you, mayor council Joel Davis, vice president at Long Beach Firefighters Association. Thank you to the residents of the ninth district for showing up this evening in support. I'd like to start by saying we do have a very strong EMS foundation in place today.'",
        "'speaker_0': 'It can be improved, however. One thing that resonated to me that Councilman Richardson said, as well as our our fire chief. We have a black hole in our system. The ninth rescue would definitely feel that it's a good start.'",
        "'speaker_0': 'It's not the end of what we need. But I think today to fill that hole, to fill the the paramedic response times, to provide the services to these residents that have showed up tonight is something that we need to focus on and it's something that we need to do.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you very much. Thank you all. I know we're going to go to a to a vote. Just just briefly. First, I want to thank all the rises for coming out. I think it's great that you you came out, you're advocating for something that's important to the community and you're here all night with a very long agenda'",
        "'speaker_1': '. I think it shows a lot about your commitment to your neighborhood and to the city of Long Beach. And so thank you all for coming out. And I also want to thank I know that Councilman Richardson does a very good job of organizing the community and getting people out to turn out for stuff.'",
        "'speaker_1': 'And so I want to thank him for I mean, he's obviously looking I know he's looking out for you guys. One thing I do want to say that I believe and believe this is true, I think everyone on this council wants to improve and have a more comprehensive fire and paramedic service.'",
        "'speaker_1': 'There's no question about it. And so it's it's a very complex issue. But we're going to look at it. We continue to look at it. And we know there's a big need and we know that there is. We'd love to make really you know, we'd love to make additional investments, obviously, in the system.'",
        "'speaker_1': 'And we're going to look at that and continue to look at that. And so thank you all for for coming tonight and advocating for that. There's a motion on the floor and a second. Please cast your votes on the item.'",
        "'speaker_1': 'And it will be back in 60 days for a report for more data information on this.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Mills Act Contracts for Historic Landmark Properties.": [
        "'speaker_1': 'Okay. Thank you. Now on to item 25.'",
        "'speaker_2': 'Report from Development Services Recommendation to Execute Mills Act Historic Property Contracts with owners of historic landmark properties for the preservation and rehabilitation of eight properties districts one, two, three and eight.'",
        "'speaker_1': 'Thank you. I'm Jenny Silver Staff.'",
        "'speaker_0': 'We have a report from Development Services Director Amy Barak and also Chris Coons.'",
        "'speaker_6': 'Mr. Mayor, and members of the City Council. First, I would like to formally introduce you to Christopher Coons, our advance planning officer. He also serves as our historic preservation officer. And the report that we're going to be giving tonight is largely the result of his efforts since he's been on staff.'",
        "'speaker_6': 'So I want to publicly acknowledge his involvement in moving the historic preservation program for this city forward. We are pleased to present to you tonight the First Mills Act contracts that have been adopted by the city since at least 2007.'",
        "'speaker_6': 'We are presenting to you a number of contracts that.'",
        "'speaker_2': 'Cover.'",
        "'speaker_6': 'Our residential and commercial buildings. This, as you know, was the first year that we.'",
        "'speaker_2': 'Instituted the Mills Act.'",
        "'speaker_6': 'And we went through a very extensive screening and education process with members of our historic community who may qualify for a Mills Act contract. This year, we were a little bit selective in only choosing to work with those properties who have already been landmarked within the city of Long Beach.'",
        "'speaker_2': 'And offered the Mills Act process to.'",
        "'speaker_6': 'Those existing homeowners or property owners. We hope to expand the program to a larger audience next year, and for those property owners who do have properties who are interested in Mills.'",
        "'speaker_2': 'Act but may not be historic landmark.'",
        "'speaker_6': 'Designated. We would do a combination process of we as we have detailed to you in the past. So I believe we have nine different contracts that we would ask you to consider entering into. This is a ten year contract with each of these individual property owners.'",
        "'speaker_6': 'There is a detailed contract that spells out what their requirements are. There is an obligation for the city to provide regular inspections to make sure that the contracts are being adhered to. There is a continued process that we will be involved in in the regular monitoring of these properties.'",
        "'speaker_6': 'I would say.'",
        "'speaker_2': 'Without hesitation that these nine properties.'",
        "'speaker_6': 'Represent the entire spectrum of the historic properties that are landmarked within the city. They do cover very unique single-family residential homes, and then they do cover some of our commercial buildings that are also landmarked. And you probably know most of these just by looking at their name and address, which which should point to their notoriety.'",
        "'speaker_2': 'If you've got specific.'",
        "'speaker_6': 'Questions about any of the applications, we are here to answer any questions. But that does conclude our initial staff report.'",
        "'speaker_1': 'Thank you. We have a motion in a second on this on this item. Councilman Austin.'",
        "'speaker_7': 'So moved.'",
        "'speaker_1': 'Councilman Price, your comments. Vice Mayor Lowenthal Thank you.'",
        "'speaker_4': 'I wanted to thank Ms.. Burdick for all the hard work that she and her department has put into this. And for the presentation tonight, and also John Thomas, who's been patiently waiting in the audience for us to hear this item, I'd like to congratulate and thank the property owners for buying these historic gems and being interested in'",
        "'speaker_4': 'preserving them. And again, my thank you to development staff services and our Cultural Heritage Commission for delivering this program to us.'",
        "'speaker_1': 'Thank you. Is there any public comment on the item? CNN. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Language Access Policy Update and Amendment. ": [
        "'speaker_1': 'Okay. Next item.'",
        "'speaker_2': 'Report from Development Services recommendation. To receive and file a status update on the implementation of the language access policy and adopt resolution amending and restating the language access policy city wide.'",
        "'speaker_1': 'There's a motion in the second. Mr. Senate Majority Manager.'",
        "'speaker_0': 'Mayor Councilmembers. This is a regular update that we're providing you on language access. It'll be provided by Development Services Deputy Director Angela Reynolds and also Tracy Calandra.'",
        "'speaker_11': 'Good evening. Mayor and council members. I'm about to introduce Tracy Kalinga, who actually does all the heavy lifting on the language access policy. We've in the last six months and the last year and a half about we've been working diligently to institutionalize multiple languages, called out in this language access program policy into this diverse community.'",
        "'speaker_11': 'It's as I've said to you in the past, there's it's somewhat complex. There's very many moving parts. And any time you start a new policy, there are some ups and downs. However, since we've been funded by the City Council, we've been able to do a lot of things.'",
        "'speaker_11': 'And Tracy will tell you all about them.'",
        "'speaker_6': 'Honor Roll. Mayor and members of the City Council on August 13th is when City Council actually adopted the language access policy, just to give you some historical points. And so as part of the policy, we come back every six months, as Angela mentioned, to provide an update to Council Fiscal Year 2015, council allocated about 250,000 to implement'",
        "'speaker_6': 'the lap. And since then, we've had a number of initiatives that have been successful in the implementation of the policy. First off, we've developed a directory of all the staff receiving bilingual skill pay in the lap languages that is now available on the city's intranet for easy accessibility.'",
        "'speaker_6': 'We do update that directory every six months. Also, Development Services has selected vendors to provide court certified translation and interpretation services to implement LAP. Thanks to the Technology and Innovation Department. The Google Translate feature is now available on every Web page.'",
        "'speaker_6': 'And moving forward, we're encouraging all departments to upload the previously translated documents onto their respective department web pages. In addition, oral interpretation and document translation continue to be available upon request for City Council and Charter Commission meetings. You can see that noted on agendas and minutes.'",
        "'speaker_6': 'The Technology and Innovation Department has also recorded outgoing messages in the lap languages for the most frequently used phone lines in our city departments, as well as the designated city staff who receive those phone calls. They do have access to the language line for interpretation services, and we're proud to say that language line is now available citywide'",
        "'speaker_6': '. Development Services worked with the water department to notify our city residents about the language access policy. We sent out 150,000 newsletters to the households in coordination with the water department to notify about the lap the lap policy, and that was provided in all four LEP languages.'",
        "'speaker_6': 'In addition, staff receiving bilingual skills pay have received training on appropriate techniques and ethics with respect to interpretation and translation. And lastly, staff worked with the City Attorney's Office and the Public Safety Departments, and we crafted the attached resolution updating the lap to address the use of children as interpreters.'",
        "'speaker_6': 'That concludes my report.'",
        "'speaker_1': 'Thank you. Let me do any public comment first on this item.'",
        "'speaker_0': 'Thanks again, Mr. Mayor. Gary Shelton speaking. I have a I believe it's a one page handout going across you. The one thing that I'm going to continue to come down here speaking about is the value of Google Translate as a usable and reliable and humanistic failure.'",
        "'speaker_0': 'It involves consistent errors in gender and number agreement. That means in Spanish anyway, they have masculine and feminine nouns and they have singular and plural. It makes mistakes in making those agree. It has errors in syntax, which is sentence structure.'",
        "'speaker_0': 'So you understand what's being said. It has errors in vocabulary words that are used incorrectly without the proper meaning. It has errors in accuracy, so you simply cannot tell what's being said. What I've handed out to you is very plain.'",
        "'speaker_0': 'It's a, it's a screenshot from today. And there's two of them. There's, there's one at the top and one at the bottom. The vertical pink bars are because I was running out of ink. I was going to say it.'",
        "'speaker_0': 'So you can tell that it's not actually on your computer screen, but it's on a piece of paper. But mine doesn't have the vertical bars. But I want to draw your attention to where it says select language. I think I circled that in the upper right hand corner, more or less.'",
        "'speaker_0': 'And I want to draw your attention to the word right below that where it says jobs. This is on page one. This is the entry page of the city's website. And where it says jobs and if you opt for Combi, which is what the Bannerman is.'",
        "'speaker_0': 'Notice what it says for the translation of jobs. It says Steve Jobs. That's how insulting Google Translate is. I didn't bother with a screencap on the Spanish language of the same page, but when you switch notice right next to where jobs is in the top row, it's a department that has all the various city departments, including development'",
        "'speaker_0': 'services. And when you switched to Spanish, that had completely disappeared. It's not available. Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, Honorable Mayor and City Council. My name is Maribel Cruz and I'm a resident of the fourth District. I am here today on behalf of the Long Beach Language Access Coalition and the Long Beach Immigrant Rights Coalition, because this issue deeply affects people in my community.'",
        "'speaker_2': 'The city is now entering its third year of implementing the Language Access Policy, which was adopted back in 2013 and is now going on its second year of implementation. While our coalition recognizes the great strides that have taken place since this policy's initiation, we also recognize more work needs to be done to ensure the successful implementation of'",
        "'speaker_2': 'this policy. The Language Access Coalition has identified the following areas of focus. First, the city needs to improve its direct contact with limited English proficient residents. This includes public displays and signage in AP languages, which are Spanish, Combi and Tagalog.'",
        "'speaker_2': 'I have provided an example used by the offices of the Legal Aid Foundation of Los Angeles, which indicates how one can request translation services. The city needs to complete translated for lines and voicemails, use language lines for walk ins and callers of all languages.'",
        "'speaker_2': 'Make the city's single phone line accessible in all AP languages and have adequate front desk staffing. Second, the city should train all staff regarding how to work with sleep residents and interpreting should include the new restrictions on the use of children, family members and friends as interpreters.'",
        "'speaker_2': 'Third, in the future and ensure all departments fund language access as a line item in their budget. And finally, complete translation of vital documents in key city web. Translation Not just Google Translate. There was a time as a young child, I was my parents interpreter.'",
        "'speaker_2': 'I saw them struggle. And to this day, I see my neighbors and friends struggle to find adequate interpreters. This is why our vision is of a city that is both fully language accessible and welcoming to historically disenfranchized community members so that they can both receive necessary services and participate in their government.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Good evening, city council members. My name is John Victor and I am with the Long Beach Language Access Coalition. Tonight I'm reading a testimony by a Filipino community member I work with in West Long Beach. So I'm going to say another name.'",
        "'speaker_0': 'So that's not me, but this is him. My name is Julius Clark. Son and I reside in the seventh.'",
        "'speaker_12': 'District to begin.'",
        "'speaker_0': 'Not many people know how to access the city's resources. In addition, Long Beach has a huge population of people who possess English as a second language. Both of these reasons, but many people of color are at a disadvantage in participating in key decision making processes in Long Beach.'",
        "'speaker_0': 'This is why I highly support the continued implementation and need for language and access to be available through all city departments, not just City Hall. Thank you. So Julia shares the importance of language access for many limited English proficiency speakers not only accessing services in city hall, but across city services, from libraries to parks and recreation.'",
        "'speaker_12': 'And so many.'",
        "'speaker_0': 'More.'",
        "'speaker_12': 'With almost over 44% of the city's population speaking a.'",
        "'speaker_0': 'Language other than English, it is important to begin to delve into where there.'",
        "'speaker_12': 'Are gaps.'",
        "'speaker_0': 'In language access into city services. As the Long Beach Language Access Coalition, we are here tonight.'",
        "'speaker_12': 'Because.'",
        "'speaker_0': 'We hope that the city not only looks.'",
        "'speaker_12': 'To ensuring.'",
        "'speaker_0': 'The sustainability of language access.'",
        "'speaker_12': 'In City Hall, but across all city departments. I'd like to share a story.'",
        "'speaker_0': 'From my own experience as an immigrant Filipino. I moved to the Philippines.'",
        "'speaker_12': 'I moved to Long Beach from the.'",
        "'speaker_0': 'Philippines in.'",
        "'speaker_12': '1997. And one of the things that in reflecting.'",
        "'speaker_0': 'In this whole process of even language access they remember is.'",
        "'speaker_12': 'I never understood a lot of the signs. I would look up at the streets.'",
        "'speaker_0': 'I would look up. This was the first year when I came to the U.S..'",
        "'speaker_12': 'And I didn't know what they meant. I just saw letters and.'",
        "'speaker_0': 'I would say to my Tagalog accent and didn't make sense.'",
        "'speaker_12': 'And now I'm here and you can speak fluently, but I know that there are many other residents.'",
        "'speaker_0': 'That don't have the ability or have had the privilege to come at a young age and learn the language. And when they come to a door, when they come to the street, they are unsure of what the sign is.'",
        "'speaker_0': 'They're not sure when they're at a park, when they're at city hall, when they're at the library.'",
        "'speaker_12': 'And and that's unfair. And as the Long Beach Language Access Coalition, we hope that that experience.'",
        "'speaker_0': 'Doesn't happen to other residents. And we hope that the city.'",
        "'speaker_12': 'Can support residents that come from all walks of life, from all.'",
        "'speaker_0': 'Backgrounds, so that they can access not just the source.'",
        "'speaker_12': 'Services.'",
        "'speaker_0': 'But also the resources that people deserve to have. Thank you for your time.'",
        "'speaker_1': 'Thank you very much. Thank you all for coming out. Take this back behind the rail now so we can go through the council comments. Councilwoman Price.'",
        "'speaker_6': 'Thank you. Thank you very much to staff for that excellent report and thanks to the members of the public who came out to express some concerns. It's my understanding that staff continues to try to find ways to enhance and and meet the spirit of the the policy and all the different things that we've asked.'",
        "'speaker_1': 'Councilman, I'm sorry I made a mistake. I need to go to the maker of the motion to speak first. Who hasn't? And then I'll go to you.'",
        "'speaker_6': 'So I'll sentence Alvin to remember where I was.'",
        "'speaker_0': 'We'll come.'",
        "'speaker_5': 'Right back.'",
        "'speaker_0': 'To, you know, he's.'",
        "'speaker_1': 'He reminded me. So I'm going to go to Councilman Richardson. I make the motion and then I'll go.'",
        "'speaker_0': 'Go, go. Thanks.'",
        "'speaker_5': 'Thanks. And I know it's going late, so I want to you know, and we know this routine because we do it every six months. So we're just going to kind of bang through some of these. First of all, I know that our staff does a does a great job.'",
        "'speaker_5': 'They're doing a lot. I mean, from this My Brother's Keeper, violence prevention. But all of it's really important. And it gets us to a space where we have a more accessible, more equitable city. So I just want to start by just acknowledging staff on their hard work every six months on this.'",
        "'speaker_5': 'So. So I wanted to I got the handout and I just shared it with staff because I just want to talk through some of these, you know, and I marked up some of them as Met as well. And I want to talk through these, see where we are, see if there are any changes that might need to'",
        "'speaker_5': 'be made that I can incorporate into this motion. And then I want to hear from the council if there's any, you know, anything else that they might want to incorporate. So I want to start from the bottom of this list.'",
        "'speaker_5': 'It asks for completion of vital document translation in key city web pages, not just Google Translate. And I remember I remember in the budget we did fund, I think it was like the top 25 pages of our new website.'",
        "'speaker_5': 'So can we get just have an update to just address the top 25 pages? We're going to have like a real translation, but not and everything else would have Google translate as I remember it. How, how how's that coming.'",
        "'speaker_11': 'Councilman Richardson? What we did not include in our report, which I would like to actually add right now, is we had about a $70,000 carryover from last year. We had we incurred budget savings that we were very happy about.'",
        "'speaker_11': 'And so with that and the $80,000 that was appropriated to language access policy for FY 16, we are going to continue to translate documents, utilize language line more throughout the city program, the remaining 16 frequently called phone lines.'",
        "'speaker_11': 'And that is a very expensive proposition and it's very time consuming as well. Make interpretation services available for public meetings. Conduct annual staff trainings on best practices for translating post notices about lap around the city and about lip services in the public areas of city facilities.'",
        "'speaker_11': 'I think that's on their list, including evacuation routes. And yes, I think you're correct. We talked about translating top access Web pages and it can be as many as, you know, we will will begin doing that and see how far the budget takes us with that.'",
        "'speaker_11': 'So those are all the things that we are planning to do and FY16 with the budget that we do have.'",
        "'speaker_5': 'Fantastic. So everything you listed, I would just assume that the timelines f y 16. Correct. Great. I'm satisfied with that. Next. So you mentioned that you are conducting training. I see a number of these items that the coalition is asking for reference training to, in particular one about how to how staff are training on how staff works'",
        "'speaker_5': 'with interpreters. And I know that that is a skill to develop. So I and so based on your response, we do have that. We are doing that.'",
        "'speaker_11': 'Yes. We've been working with a vendor to prepare a video that can train staff at their desk about that. And we will be rolling that out very soon.'",
        "'speaker_5': 'Perfect. And then the training on use of on it was a win when we got the chow interpreter restriction in there. Is that a part of that video as well.'",
        "'speaker_11': 'No, not at this particular moment, but it is incorporated into the policy.'",
        "'speaker_5': 'Okay. So I know it's in the past. How do we what I.'",
        "'speaker_11': 'Will say is, in order to develop that language, we met with all the public safety folks. Fire, police, who else? City attorney, city prosecutor, people that come in contact with the public a lot. So that's how we did that.'",
        "'speaker_11': 'I'm thinking you're asking about accountability for that. We can we can actually add that or do it as a separate piece of the video. I think we definitely.'",
        "'speaker_5': 'That would be good if we just made sure we check the box. So the what we do is in alignment with the policy and then under sort of making sure that all points of contact have access to it.'",
        "'speaker_5': 'I know that we just mentioned exits, entrance, entryways. This was just shared with us. This thing that says, hey, just point to the language. So you want to just elaborate on what we're doing in terms of our sign program.'",
        "'speaker_6': 'Councilman Richardson, what we've done is we we've averaged that we have about 180 public counters within the city. That includes all the floors in city hall, but also our parks and recreation sites, libraries, etc.. And so what we'd like to do is develop a quick and easy, almost like they do at Kaiser Permanente, where you have the'",
        "'speaker_6': 'four languages, English, Spanish, combined, Tagalog. And it explains that we have assistance in those particular languages, point to the language, and we'll find either a bilingual staff member who can assist you or another alternative, like we mentioned earlier in terms of language line.'",
        "'speaker_0': 'Great.'",
        "'speaker_5': 'And then in terms of the the fall, I know that in this recent budget and this might be a question for Mr. Mayor, the in the recent budget, we talked about going and having one phone number for the whole city.'",
        "'speaker_5': 'Are we are we going to make sure that that has the four languages accessibility as well?'",
        "'speaker_1': 'You know, that project is very, very early, so I'm not even sure where that project is, but I'm sure that this is as part of our policy. I'm sure that every kind of communication is somehow we're trying to incorporate language access when possible.'",
        "'speaker_0': 'Right.'",
        "'speaker_5': 'Based on these responses, everything on this list and with the exception of number four, which which I don't know that that's you know, I want to talk about this right now, but everything else on this item has been responded to.'",
        "'speaker_5': 'So my motion is to accept it, you know, accept this update and just to include the one provision about updating the video with the child and interpreters. So thank you so much, everyone, for this. And and that's my motion.'",
        "'speaker_1': 'Councilman Andrews.'",
        "'speaker_8': 'Yes, thank you, Mayor. You know, first of all, I'd like to thank, you know, our deputy director and that's Angela Reynolds and her staff, Tracy Calandra, for their hard work on this policy because at last, you know, our council meeting, I have to see more emphasis on the implementation of these items within the next four or five'",
        "'speaker_8': 'months, and you got to meet that goal. So when I wrote the assignment back in 211, I knew that it would take, you know, a little time to implement. And I really, really excited to see the new additions to this.'",
        "'speaker_8': 'So I am also seeing the positive changes and I see the communications. It has instilled a new confidence in our community and I'm very, very grateful to be able to reach out to more of our sixth district, you know, a diverse community.'",
        "'speaker_8': 'And thank you again.'",
        "'speaker_1': 'Thank you very much. Now back to Councilman Pryce.'",
        "'speaker_6': 'Thank you. I'm not sure where I was, but thank you to staff and I'm glad we're moving forward. I'm just curious, maybe I would offer this as a friendly to Councilman Councilmember Richardson. The staff has done a nice job of updating us.'",
        "'speaker_6': 'Would you be open to having their council updates occur on an annual basis with maybe a written update to be provided to Council members and Language Access Coalition at the six month interval so that they are not making the presentation at council?'",
        "'speaker_5': 'I think it's a I think it's a fair ask what I would say, you know, if there was a big work plan initially and it looks like it's starting to become more narrow, it's fair. What I would say is I'd like to just I see a number of people queued up.'",
        "'speaker_5': 'I want to hear sort of some consensus so that the motion that we put out is, you know, a supported motion. So let's hear what the rest of the council wants to say on that topic.'",
        "'speaker_1': 'Councilman Durango.'",
        "'speaker_9': 'Thank you, Mayor. Good point, Gary. Know, Mr. Sheldon brought up a point that I was going to actually address, and that is the overuse of overreliance on Google translation. It's horrible. I've used to before. I've had people come to me and say, you know, this is this is a great product to use.'",
        "'speaker_9': 'And what I used it and I saw it, it was just totally in disarray. So I'm hoping that staff monitors that in a way that it doesn't get the message isn't lost in the translation. It certainly can happen.'",
        "'speaker_9': 'And and an overreliance on such a program would would do more harm than good in the community. And in regard to that, I heard a good thing I heard Mr. Reynolds say that they're looking towards the institutionalization of this program.'",
        "'speaker_9': 'And I think Councilmember Richardson I think that addresses item number four in that there's going to be institutionalization, there's going to be some funding behind it. And I would hope that every department would. Implement a program that goes towards that in the sense that.'",
        "'speaker_9': 'What was that? Okay. Okay. Stacy, that. As we go towards institutionalizing this program that departments will, in fact set aside some funds so that it can happen eventually. I think that's what you might have met maybe with some clarification on that.'",
        "'speaker_9': 'But I think we should we should have we should include it in there. I think.'",
        "'speaker_5': 'So. Just to respond, um, I know that a while back they did articulate like, you know, what is the total amount we spend across the city on, on language access. They had to break down on all of our.'",
        "'speaker_0': 'All of our.'",
        "'speaker_5': 'You know, what was it? Was it the skill pays and all that stuff? So if I'm okay with seeing it broken down by my department, like what people do, I just don't know what it requires in terms of staff time.'",
        "'speaker_5': 'So I'm okay putting that into my motion to evaluate it. So next time we hear back, we see if that's if that's possible.'",
        "'speaker_9': 'Yeah, I think it's important that mainly because it takes staff, it takes recruiting, it takes job announcements and testing to ensure that the people that we are hiring to provide these services do in fact possess those skills. And having been an English teacher back in the day and having been an assessor of Spanish and English language skills'",
        "'speaker_9': ', I know that it is a skill. And you mentioned it. It is a skill. It is important skill. And unless you really know what you're doing, it's like I again, the the the message gets lost in the translation and we want to ensure that that does not happen to.'",
        "'speaker_1': 'Thank you. Vice President Joe.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And I wanted to thank the staff for the presentation and Councilmember Richardson for his comments and support. I wanted to also share that I would be in support of having the written report and then a formal presentation annually.'",
        "'speaker_4': 'And as you said, unless there is a large item that needs to come forward, that that would be that would be something that I would be amenable to as well.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Mongo.'",
        "'speaker_2': 'I think that we've made great progress. I'm glad you're still interested in the single phone number of access. I think that as we talk about seniors and aging and a third of our seniors not speaking English, that that's really a key thing that I look forward to a report on.'",
        "'speaker_2': 'I'm also in support of Councilmember Price's idea behind moving this to a written report that I think has a lot of of value to the community.'",
        "'speaker_1': 'Thank you. Councilwoman Price.'",
        "'speaker_6': 'So I just want to follow up with Councilman Richardson. I mean, I think certainly if there's issues or ideas brought to the table, we can agenda visit and ask staff to come back. But since this is something that we we think about in terms of funding on an annual basis, I think it would make sense to do'",
        "'speaker_6': 'so.'",
        "'speaker_5': 'I want to I want to recognize and thank you for the tone and how you how we came to this. And I see that there is clear support for this. I think there I think we need to make sure that, you know, we have we had a larger work plan.'",
        "'speaker_5': 'It has narrowed. You know, I think we can maintain this focus. I think we're asking for a reasonable semiannual. Every six months we get an update. One of them is in writing. One of them's in at the city council.'",
        "'speaker_5': 'I think that's fair given the workload on staff. So I'm okay with that. Thank you.'",
        "'speaker_1': 'Okay. So the friendly is that the language access report would come once a year to the council in a in a public format. And then of course, six months would be a two from four from the from the city manager.'",
        "'speaker_1': 'There's a motion in a second on the floor, please. Member please go and cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Contract Award for Professional Project Labor Agreement Administration Services.": [
        "'speaker_1': 'Thank you. Next item, please.'",
        "'speaker_2': 'Report from financial management. Recommendation to award a contract to Parsons constructors for as needed professional play administration services in an annual amount not to exceed $280,000 citywide.'",
        "'speaker_1': 'Mr. West as the in a second face merely talking to get a second please. Can I get a second? Okay. There's a there's a motion and a second. Mr. West, do you have a quick update on this? I have a.'",
        "'speaker_0': 'Quick update by our purchasing manager, Jason McDonald. Mayor Council members. The item in front of you is for a ward of a contract to support the staff administration of the project labor agreement to Parsons constructors of Pasadena. Following a request for proposals, Parsons response was reviewed by an evaluation panel and determined to have met the required criteria'",
        "'speaker_0': '. Additionally, Parsons has prior experience working with the city as well as the building trades and has served as the play administrator for the Port of Long Beach. The team, proposed by Parsons, has extensive experience in working with plays in Los Angeles County.'",
        "'speaker_0': 'That concludes my comments. I'm available to answer any questions. Thank you.'",
        "'speaker_1': 'Thank you. Any public comment on the item? CNN members is going to cast your votes. You're not kidding. Do you want a Cuban? Okay. Go ahead, Councilman Ringa.'",
        "'speaker_9': 'Thank you, Mayor, for regulating me. What? My own. In reviewing the report, I see that there were a number of businesses, women, business owned entities, disadvantaged entities and minority enterprises as well. What is Parsons? Where does it fit?'",
        "'speaker_9': 'In those categories.'",
        "'speaker_0': 'Councilmember. I don't I don't know. Off the top of my head, I can look it up here. We probably have it in the report. But I don't know.'",
        "'speaker_9': 'Because one of the things I want to I've said it before and I want to encourage it again is that we need to be sensitive to minority owned businesses when we do our contracting out. We don't have enough.'",
        "'speaker_9': 'I don't think we're even close to even 5% or 10% of contractors that do business with the city. And it's a it's going to be an ongoing issue for me as I review these that we make sure that we are addressing our need to hire and contract with women owned businesses, minority owned businesses and enterprises as well'",
        "'speaker_9': 'as disadvantaged enterprises. So I'm hoping that with this number of applicants that we're there and this one one out. We need to create a better way of being able to identify that we get enough minority women on and disadvantaged businesses into our contract cycle.'",
        "'speaker_9': 'I'm more like on a pedestal. I'm not one of those.'",
        "'speaker_1': 'Think accounts. Remember, we had the motion to approve the motion in the second. If I can just please cast your vote on that.'",
        "'speaker_2': 'Oh. Motion carries.'"
    ],
    "Public Walkways Occupancy Permit for Working Class Kitchen. ": [
        "'speaker_2': 'The motion carries. Item 33 Report from Public Works Recommendation to execute and a public walkway occupancy permit with a sidewalk extension Parklet for sidewalk dining at the working class kitchen located at 1322 Coronado Avenue, District four.'",
        "'speaker_1': 'Thank you. Councilmember Supernova.'",
        "'speaker_0': 'We look forward to this project and urge my council members to join me in voting for it.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Excited to have the outdoor opportunity. I hope that they'll allow dogs.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_6': 'I have no comment.'",
        "'speaker_1': 'Okay. I just wanted to say, if you've not been a working class kitchen yet, you're missing out on one of the best Long Beach spots in the entire city. So, so good food. So any public comment on this?'",
        "'speaker_1': 'Nope. Please cast your.'",
        "'speaker_2': 'Councilwoman Pryce. Vice Mayor Lowenthal. Motion carries.'"
    ],
    "Resolution to Install Angled Parking and Expand Parking Meter Zone on Shoreline Drive.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': '35.'",
        "'speaker_2': 'Report from Public Works. Economic and Property Development. Recommendation to adopt resolution to allow the installation of angled parking on Shoreline Drive. Approve the expansion of parking meters Zone 20 and request the city attorney to prepare an amendment to the Long Beach Municipal Municipal Code relating to parking meter zones, District two.'",
        "'speaker_1': 'Thank you. Vice Mayor Bill Giovanni comments.'",
        "'speaker_4': 'I to just briefly, I wanted to just share that the existing angled parking on Shoreline Drive has been a big hit so far. So I'd like to thank our public works team for making this change. Not only are we increasing the capacity for restaurants, we're making the area more pedestrian friendly by taking less lanes away from shoreline'",
        "'speaker_4': 'and reducing the overall vehicle speed. So, Ira and your staff, thank you.'",
        "'speaker_1': 'Thank you. Any public comment on the item saying that? Please cast your vote.'"
    ],
    "Contract Award for Improvements of 10th Street and Atherton Street. ": [
        "'speaker_2': 'Council. Motion carries.'",
        "'speaker_1': 'Thank you. Next item, please.'",
        "'speaker_2': 'Report from Public Works. Financial Management Recommendation to award a contract to school contractors for the improvements of 10th Street for a total contract amount not to exceed $1 million district for.'",
        "'speaker_1': 'Right think there's emotion and a second countenance you provide. You want to get in comments or.'",
        "'speaker_0': 'Just one that I believe 10th Street was paved a couple of years ago. And so this.'",
        "'speaker_3': 'Is a continuation of that project moving.'",
        "'speaker_0': 'West.'",
        "'speaker_1': 'Can someone, is that correct?'",
        "'speaker_3': 'Yes. I thought. I thought you saw me shaking my head, so. I'm sorry. No, it's late. Yes, it's continuation of our projects.'",
        "'speaker_0': 'On 10th Street.'",
        "'speaker_1': 'Councilman. Is that.'",
        "'speaker_0': 'Okay? That's fine. Thank you.'",
        "'speaker_1': 'Okay, great. And much needed. So this is actually these are these are great improvements here. Any public comment saying none. Please cast your votes.'",
        "'speaker_2': 'Emotion carries.'"
    ],
    "Ordinance for Left Curb Parking Pilot Program. (District 3)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': '38.'",
        "'speaker_2': 'Report from Public Works Recommendation to declare ordinance amending the Long Beach Municipal Code regarding the establishment of a pilot program to permit left curb parking in designated areas for the first time and laid over to the next regular meeting of the City Council for Final Reading District three.'",
        "'speaker_1': 'Thank you. There's a motion and a second. Councilman Price.'",
        "'speaker_6': 'Thank you. In February of 2009, then State Assembly member Alan Lowenthal amended the state vehicle parking code to allow for left curb parking on the peninsula. The city did not amend the Long Beach Municipal Code to establish this pilot program, and that was recently brought to our attention by a resident.'",
        "'speaker_6': 'Thank you. Public works for bringing this item forward. It will help alleviate some of the parking challenges that we currently have on the peninsula.'",
        "'speaker_1': 'Thank you. Any public comments on this item? CNN, Please cast your votes.'",
        "'speaker_2': 'Councilwoman Pryce. Motion carries.'",
        "'speaker_1': 'Thank you. We're going to need business and announcements. I have one I'd like us to adjourn tonight. In the memory of Long Beach Fire Captain Ryan Thornton, who, as we all know, passed away. Really, sadly and unfortunately last week at the age of 46, Ryan was an 18 year veteran of the Long Beach Fire Department and a'"
    ]
}