{
    "Cancellation of the March 15, 2016 City Council Meeting.": [
        "'speaker_1': 'Thank you, Miss Brassard. That concludes public comment. So thank you very much. Moving on to the agenda item 11, please. Thank you, sir. It could be a motion in a second. Any public comment on the item? Casey, no public comment.'",
        "'speaker_1': 'Please cast your votes. Sir. Are you? Hold on a second. Do you have a comment on this item? This is item 11.'",
        "'speaker_3': 'I think I do, yes.'",
        "'speaker_1': 'Okay. Please come forward.'",
        "'speaker_3': 'What is the justification? I'm sorry. Because it the it it's not posted. What's the justification for council canceling the meeting on the Ides of March?'",
        "'speaker_1': 'The meeting is being canceled because the council's added to meetings and so we're removing one in March. So we added one at both of the dark Tuesdays of the last two months.'",
        "'speaker_3': 'So the Ides of March, I. Reminds me what that always brings back Roman history. And one of the things I'm always conscious of that because I travel every day, as many people do on something called the Appian Way.'",
        "'speaker_3': 'Which, if you've done your history, was. One of the first roads in what was the greatest empire on the face of the planet. For generations. For years. For centuries. Until. Until. It started traveling down paths such as this council and quite frankly.'",
        "'speaker_3': 'Many portions of the state and the country are traveling. Which will, in the final analysis, as I pointed out, render this republic something. If you want to know what your grandchildren's children. We'll be living in. I would suggest you go down to Guatemala or Honduras.'",
        "'speaker_3': 'Because this is what's going to be. Their future. Our future here. Is again, it's on a downward spiral. I remember about five years ago, I, Bob Foster, didn't want to look at the clip I brought up from the Titanic, that iconic scene where the owners, the captain and the ship's architect were gathered in the ship's architects office'",
        "'speaker_3': 'on the ship. It was pointing out what the realities were when this whole world gets filled with water. We're all right. When this one. It's filled, we're all right. But when it gets here. It's over. We're going down.'",
        "'speaker_3': 'We've passed that point. Now the only thing we can do is make it a little bit better for ourselves. And I. Think that it would be inappropriate to cancel. The meeting of the Ides of March, but rather come back and give some reflection.'",
        "'speaker_3': 'To what you've done and where you want to go and what will be visited upon this city. In the coming. Years as a result of some of the buffoonery we've seen here tonight and other nights. Thank you.'",
        "'speaker_1': 'Thank you. Okay. Members, please cast your votes.'",
        "'speaker_0': 'Motion carries. Okay.'"
    ],
    "Resolution for General Tax and Budget Stabilization Fund Measures for June 7, 2016 Election.": [
        "'speaker_1': 'Next up is item 12. Item 12 is actually four items. And so this is the resolution work that the city attorney prepared after last week's vote on the June measure. So there'll be four different votes. Madam Court, do you want to read the first item, please?'",
        "'speaker_0': 'Communication from City Attorney Recommendation to adopt resolution calling for the placement of a general tax measure on the ballot of the June seven, 2016 regular election to adopt a transaction and use tax for a period of ten years.'",
        "'speaker_0': 'And also calling for the placement of another measure on the same ballot, establishing a budget stabilization fund.'",
        "'speaker_1': 'Before I turn this over to the city attorney also, are we can we take public comment for all these in one or do you want to separate those out?'",
        "'speaker_6': 'You can do public comment for all four items at one time.'",
        "'speaker_1': 'Okay. Did you have a mr. City attorney general comment, if I.'",
        "'speaker_6': 'May, may or members of the City Council pursuant to your request on February 16th, this office has prepared the following documents before you this evening. The resolution, as introduced by the clerk, calls for the placement of two items or questions on the June seven, 2016 ballot as part of that resolution attached, or to ordinances that must be'",
        "'speaker_6': 'approved this evening by a minimum of six votes by the Council. And the ordinances will return next week for a second reading as requested. The first item is a temporary transaction and use tax on the sale and use of all tangible personal property sold at retail in the city.'",
        "'speaker_6': 'The t, u t as it's called, will be for general purposes at a rate of 1% for six years, declining to one half of 1% for four years. The tax will sunset after ten years. The ordinance requires the establishment of a citizens advisory committee consisting of five members nominated by the mayor and confirmed by the City Council'",
        "'speaker_6': '. A Draft to you. The draft ordinance has been reviewed by the State Board of Equalization, which will collect the sales tax if it's approved by the voters on behalf of Long Beach. Pursuant to Proposition 218, a majority vote of the electorate is required for the passage of this measure.'",
        "'speaker_6': 'Attachment B to the resolution is an ordinance which creates a budget stabilization fund or a rainy day fund. If approved by the voters. This rainy day fund would require 1% of any new general tax revenues to be placed into this fund to offset the impact of future recessions or financial hardships faced by the city.'",
        "'speaker_6': 'It also governs the expenditures from and the administration of this fund. The second item that you will be asked to vote on tonight is a resolution indicating the Council's priorities for the use of the t u t funds for infrastructure repairs and the restoration of public safety resources.'",
        "'speaker_6': 'The third item that you'll be asked to adopt is a resolution calling for the ballot arguments pursuant to the election code. And then the fourth item would be the resolution requesting the county consolidate these items for the city's election with the state primary election on June 7th of 2016.'",
        "'speaker_6': 'So to recap, the first item before you this evening is to adopt the resolution calling for the placement of the two items on the ballot, approve the language of the two ordinances, and adopt the ordinance requesting that t u t be administered by the body.'",
        "'speaker_6': 'The Board of Equalization. Thank you.'",
        "'speaker_1': 'Thank you. So want to go and do public comment on these items? Is there any public comment? Please come down. Please.'",
        "'speaker_0': 'Hello, everyone. Laurie Angel, Eighth Council District. I've come out pretty publicly on this and I did speak last time. My concern is that this measure came forward very quickly. First of all, there was infrastructure needs. I know that there's like a $2.3 billion backlog.'",
        "'speaker_0': 'It's been growing over the years. It's substantial. I understand that we don't have enough police services. Then we came up with a list of a laundry list of possible revenue changes. And then the next thing I know, we're doing a sales tax increase, which if I had my choice about what kind of tax to do, this would'",
        "'speaker_0': 'probably be the last one on the list, mainly because it adversely impacts business, it adversely impacts the economy. I would think that a measure like this that will impact business would have come before your Economic Development Commission first.'",
        "'speaker_0': 'This is a pretty serious problem and it's not very well thought out in terms of accountability. I appreciate that. Council member Mungo suggested a an oversight board, but it looks like an oversight in the language. It's supposed to look at revenues only appointments by the mayor.'",
        "'speaker_0': 'It doesn't really have any teeth. It isn't as though there is a distinctly outlying list of things to be done, and this is how we'll do them. It's going to be very difficult for the taxpayers to accept what you have on the table.'",
        "'speaker_0': 'I would like for something to be successful, but they need to see due diligence first. And I think it's unfortunate because just as with the last tax measure, it came too quickly that the public was not engaged. And I'm afraid that there are too many issues with it for to be successful.'",
        "'speaker_0': 'Rather than rush to get this on the ballot in June, it would be a much better idea to engage the public and find out what they would be, what they would more likely to support. Because I'm not quite sure that a sales tax is the answer.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, John. Each 3600 Pacific Avenue. After last week's meeting, a call to question, call into question your claims of having done polling that showed strong support for this. I'd like to know more about the details of that polling.'",
        "'speaker_4': 'I did some polling during the whole of this whole past week, polling my neighbors walking around the neighborhood asking people I could not find a single household that had any support for this sales tax measure. None whatsoever. And they all threatened to flee with their dollars if it does pass.'",
        "'speaker_4': 'So I think you're off the mark there. The other thing that came up was why are we not seeking parity with Signal Hill on our oil extraction tax? It's nuts not to be there. We're barely at half of what Signal Hills will attract and taxes.'",
        "'speaker_4': 'I found 100% support for that. People volunteered that idea to me. Did you pull that? Or did you try to sell them on a sales tax measure? A push poll. There are 95 million people permanently out of work in this country in the aftermath of the Great Recession.'",
        "'speaker_4': 'Well, certainly no huge percentage of those live in Long Beach, but I'm sure there are a ton of families here that are still smarting from the Great Recession. There's a good many families that are now single income families that used to be two income families.'",
        "'speaker_4': 'How do you think you're going to pay for this if they choose to spend their money in Long Beach? Not everyone in Long Beach. Has a lot of money left over to give to you. I also am concerned, as is Laurie Angel, about an exodus of Long Beach sales tax dollars to other cities, most especially Carson with'",
        "'speaker_4': 'its new mall. They didn't get a football stadium, but they had a plan B. They're going to have a freeway centric shopping mall that'll probably rival South Coast Plaza. Now, people who live on the east side of town where my sister lives are already flee with her money to South Coast Plaza.'",
        "'speaker_4': 'People on my side of town, I guess, are going to be welcomed and herded into the new mall in Carson. How is that going to work for you? Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Good evening. Tom Stout. The last proposal that it was brought up this evening was a measure on poorly written, poorly implemented, didn't pass. And I guess, you know, you guys did learn something which was surprising that you can fool a lot of the people, but not 66% of the.'",
        "'speaker_7': 'So now you're down to 50.1, and there's a lot of people that can be fooled out there. Just look who's been elected to sit on the council. This is a this council represents less than 20% of the actual voters in the city.'",
        "'speaker_7': 'That's pretty sad. Now with regard to. The 1% sales tax, you know, get off the thing only saying $0.01 tell the truth. That's going to be 10%. If the state puts some attacks on there, they want 2%. The county wants a half percent.'",
        "'speaker_7': 'The college wants 800 million more. This unit, Long Beach Unified, wants more money. Where is it all going to come from? Do you ever look at the add ons on your tax bill? It's amazing. It's truly amazing. There's never, ever going to be enough money to feed this machine.'",
        "'speaker_7': 'You added something to this wording and maintain service and maintain general services. That's a free pass to spend my money on. Anything you want. That's pretty pathetic on your part. Not unusual, but pathetic. And it just cost too much money to run the city.'",
        "'speaker_7': 'Compensation is always going up. CalPERS says they want 10% a year starting, I don't know, this year or next year for five or six years. That's about $150 million at the end. Plus we got an $8 million a year pension bond.'",
        "'speaker_7': 'So that's even more. So we're looking at probably close to 150 million. And that's not even given any raises away, which I'm sure coming or there wouldn't be this 1% sales tax on the agenda. You know, we talked about community centers.'",
        "'speaker_7': 'The Kroc Foundation wanted to give us a world class facility in the Andrews District. Yet he and his staff and the people sitting over here dropped the ball. $15 million. At the bottom line was what we needed to come up with.'",
        "'speaker_7': 'We couldn't. Yet we came up with $24 million to subsidize the families pensions. 1983, that subsidy started and it went on for 30 years.'",
        "'speaker_1': 'Thank you, Mr. Stout.'",
        "'speaker_7': 'You know, talking. I don't talk to you. I just come up because somebody sees it on TV. I know you guys don't give a crap.'",
        "'speaker_1': 'Thank you, Mr. Stout. Next speaker, please.'",
        "'speaker_3': 'I echo and embrace what the previous speakers have said. I haven't listened to anybody I've talked to and listened for their feedback. All of them are opposed to this. We are in a very we're surrounded by other opportunities where people will spend their money.'",
        "'speaker_3': 'We'll miss those taxes. We'll miss those dollars. The only possibility that you can exist. In my view, passing this tax is to make it abundantly clear that 100% of the money will go for r0atis and streets. Nothing else?'",
        "'speaker_3': 'No. Rainy day fund. Period. And it really nail it down. You will promise to fire the city manager. Put those two things together and that would pass overwhelmingly. Period. And that's a good beginning to start with. I don't what proposing this.'",
        "'speaker_3': 'I'm not sure you people understand where your city lies and what is beckoning on the borders. Only a fool. Would make a major purchase within Long Beach when 5 minutes away they can make significant standing and a significant savings period.'",
        "'speaker_3': 'So reword it. Put it. Make it very clear that it goes for a-roads streets only. Period. Or highway roadways. Period. No. Rainy day fund. Fire. The city manager. And I'd even raised the specter of saying, if people want to reduce the number of council seats.'",
        "'speaker_3': 'I think we may be faced with something within the Mr. in his district that may have to close shut down. He may have to fire himself. Using the same logic that he fired. The Coastal Commissioner director. Now. He, of course, can blame it on previous council people in that district, but that would be an interesting conversation.'",
        "'speaker_3': 'So again, if you want to paston limit it to roads and highways via the city manager. At the basic minimum, you'll find no support for anything else. Thank you.'",
        "'speaker_1': 'Thank you. See no other public comment? Well, take this back behind to the council and close public comment. Councilman Gonzalez.'",
        "'speaker_2': 'Yes. I just wanted to reiterate my support for this item. I know that I've said this before, but I know it's a it's a little bit scary of a thought for many people. But I truly do believe that this is something that we need to do and allow our voters to be able to make that decision as'",
        "'speaker_2': 'to whether they'd like to go forward with this. I want to thank our city attorney for drafting this material and this information. I think it goes step by step as to what we are able to do with these funds.'",
        "'speaker_2': 'Should we get them? I do this for all of our city residents, especially those in as many people know. I like to advocate for areas that certainly need it the most. I have the historic neighborhoods. I also have areas that have very high crime rates, and we need this opportunity.'",
        "'speaker_2': 'And so I will just continue to read or write my support. I want to thank the city management team and city attorney for drafting this again. So thank you.'",
        "'speaker_1': 'Thank you, Councilman Richardson.'",
        "'speaker_4': 'Thank you. So I've said it before, and I've and I'm going to reiterate it now. I think this proposal is modest. It's reasonable. I think that, you know, I don't know what the voters are going to do, you know, but I think they should have an opportunity to help determine their fate.'",
        "'speaker_4': 'There's no question that, you know, our infrastructure is failing. There's no question that we need to double down on core sort of core public safety services and, you know, our emergency response times. But I don't know that there's any solution is the perfect solution.'",
        "'speaker_4': 'So I think this is modest. I think it's reasonable. I think it does have so far, it's it's demonstrated there is sort of broad support for this. So that said, I think we need to send this to the voters.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_1': 'Thank you. Councilmember Supernova.'",
        "'speaker_4': 'Thank you, Mayor Garcia. How? First of all, I'd like to say I don't disagree with the speakers on many of their points. To Laurie Angell, if you went back and watch the videos several weeks ago, I made the very point you did.'",
        "'speaker_4': 'I asked staff, do we have enough time to educate the voters? They couldn't answer that. That's not within their purview. But. But here we are tonight. Here before us tonight. Politically, the easiest thing I could do is stand on a minority vote, go down in flames on a minority vote and grandstand on that.'",
        "'speaker_4': 'And a week ago, I just didn't have a good feeling about that. I don't sleep better at night if I'm on the wrong side of an eight one vote. So I read in the Longreach Business Journal and the Press Telegram the idea of an oversight committee.'",
        "'speaker_4': 'And so I spent the Monday holiday and all day last Tuesday working on that. And Councilmember Mungo brought it forward. And then after that was. Read. I asked the city attorney what would the next step be? And he said, it's going to I'll have to write that up and bring it back tonight.'",
        "'speaker_4': 'And that's where we are in terms of a need. I've said it many times before. There's no question in the Fourth Council District, we're the only district without a fire engine. We've had just anecdotally three houses that were total losses in my district due to fire.'",
        "'speaker_4': 'In terms of infrastructure. I have an entire western side of my district where only one street has been paved in 12 years. So we have some tremendous needs. But then the folks are cynical. They're not sure if we'll get this money, if they all get done anyway.'",
        "'speaker_4': 'All I can say to my constituents is new sheriff in town. We're going to address these things on an ad needed basis, not geographically. I really appreciate what the city attorney did. I think he's got a good proposal here.'",
        "'speaker_4': 'But I would just like to beef it up a little bit with a friendly amendment. And I'd like to read that now. This initiative will include a requirement that a citizen advisory committee will be formed to support the oversight of the expenditures from the proposed sales tax revenue.'",
        "'speaker_4': 'In addition, the Citizens Advisory Committee to have the Committee, the intent of the Council action shall be considered in any future expenditure of these moneys to ensure that expenditures are consistent with the intent of this body. Any budget recommendations regarding expenditures associated with the sales tax shall be presented to a financial to financial management for analysis and'",
        "'speaker_4': 'review. Financial management shall then prepare a report to the Budget Oversight Committee discussing the recommendations and their alignment with the legislative action that has been taken, by the way, of this motion. Further financial management will provide council with a quarterly report outlining the work of the Citizen Advisory Committee, as well as any approved budget expenditures.'",
        "'speaker_4': 'Although the action of this Council Mayor cannot bind these actions of future councils or mayors in regards to the expenditures of the proposed sales tax increase, this Council can state very clearly the intent of this action and expect that the public should hold accountable all future legislators in in regards to expenditures associated with these proposed sales tax'",
        "'speaker_4': 'increase revenues. And with that kind of language, I just think that's stronger than maybe we'd have with a different type of attack tack. So that's my motion.'",
        "'speaker_1': 'And Councilwoman Gonzales, would you be willing to accept that friendly, please?'",
        "'speaker_2': 'Yes, absolutely. I'll accept the friendly. Thank you.'",
        "'speaker_1': 'Councilmember Supernova and Councilman Richardson, you're okay with that as well. Thank you, Mr. City. Attorney.'",
        "'speaker_6': 'Mayor, members of council, Councilmember Cooper and all the I believe what you've added as the amendment would be included in the duties of the Citizens Advisory Commission, and I know that there's additional requests from staff in there to how we would address that is should this motion pass tonight?'",
        "'speaker_6': 'Our office would bring back a resolution, as we do with all commissions, establishing the Commission, and we would include your friendly amendments and requirements in that resolution.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_1': 'Great. Thank you. And and customer support. I'm very supportive of that. I want to thank you for for strengthening that. Councilwoman Pryce.'",
        "'speaker_2': 'Thank you. I have and I agree with the amendment that was just made. I do have a question that's come up quite a bit in the last week or two, and I don't know who the best person to answer this would be, but what is the difference?'",
        "'speaker_2': 'Or can you explain the 1% versus the $0.01 issue?'",
        "'speaker_1': 'Mr. City, Terry?'",
        "'speaker_6': 'Yes, it depends on how you read it. It's $0.01 on every dollar or 1% of the sales. So you see it written both ways or either way. And so it in in the way we've presented it, it's the $0.01 when we have in parentheses 1%.'",
        "'speaker_6': 'And we've run that language by the Bowie, the Board of Equalization, and they're fine with that language. But it is it's one way or the other is a 1% increase.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Mongo.'",
        "'speaker_0': 'Yes. I want to thank Councilmembers Hooper not for strengthening the language. I think that our intent last week was to ensure that the voters have the say and the oversight that is necessary. I know that we're working really hard to be more transparent in terms of providing details to our council items in advance.'",
        "'speaker_0': 'And I think that seeing the detail of the budgets and expenditures in advance is a big component of that. And I think that another component of that is ensuring that once the money is spent, that it was spent on the things that we said that it would be and that there are components of that that taxpayers have'",
        "'speaker_0': 'control over because they shouldn't need to get their information through a public records request. Many know that if you ask of certain things from our office, we put a lot of staff time in responding to those. But this actually puts that on the city staff, which relieves us at the council office level for providing the constituent services'",
        "'speaker_0': 'in the district better. So I appreciate the strengthening of the language. I think it's an important part of our ability to grow our transparency and accountability to residents and the citizens. So thank you for that. Thank you, Charlie, for doing the best practices.'",
        "'speaker_0': 'I know we talked about a a couple of different scenarios and I'm looking forward to that coming back with Councilmember Supernova's added language. Thank you.'",
        "'speaker_1': 'Thank you. Councilor Casper Castro votes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Okay. Thank you. Item two, Madam Clerk.'"
    ],
    "Resolution to Consolidate General Municipal Election with Statewide Primary Election.": [
        "'speaker_1': 'Item four Police.'",
        "'speaker_0': 'Adopt a resolution requesting the Board of Supervisors of the County of Los Angeles to consolidate a general municipal election for two local initiative measures to be held with the statewide primary election.'",
        "'speaker_1': 'Thank you. Please cast your votes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you very much. I'm going to just make a brief comment before we go on to the next item. I just want to begin just by thinking I think it's important that we think our finance staff and they've been working very, very hard on this issue, as well as our city attorney staff.'",
        "'speaker_1': 'And I just want to thank you both for doing this. And I want to say one other thing. I think it's important to be very clear. What the councilors voted on tonight and the night before is to give voters the opportunity to make their voices heard at the ballot box.'",
        "'speaker_1': 'It's not an endorsement of going in this direction. They will all have an opportunity on their own to make those decisions. But it's giving the voters the option. This is now in the hands of the Long Beach voters.'",
        "'speaker_1': 'And over the course of the next few weeks and months ahead, there'll be a robust city wide conversation. So I want to thank everyone for working hard on this particularly want to thank Mayor Foster and Mayor Beverley O'Neill, who have both advocating to give voters a choice to put this measure on the ballot.'",
        "'speaker_1': 'And I want to thank the Council for their diligence. Good questions. And in particular, I want to thank those that advocated in to adding the Citizen's Oversight Commission and strengthening its ability to monitor these funds as well. So thank you all the way around and of course, to our city attorney and finance staff as well.'"
    ],
    "Grant Funding and Contract Amendment for Bicycle Master Plan Update.": [
        "'speaker_1': 'And with that, we can move to the next item. Madam Clerk.'",
        "'speaker_0': 'Report from Development Services and Public Works recommendation to receive and expend $25,000 dollars in grant funding from the Knight Foundation Fund to prepare a comprehensive update to the existing Bicycle Master Plan and execute an amendment to contract with ALTA Planning and design for the Bicycle Master Plan update for a total amount not to exceed $500,000 citywide.'",
        "'speaker_1': 'Mr. City Manager. And we have a small attic.'",
        "'speaker_6': 'Yes, this is all part of our city livability initiatives. The bicycle masterplan is part of our circulation element with the general plan. I'm going to turn this over to Development Services Staff. Lisa Fallon. Linda Tatum.'",
        "'speaker_0': 'Thank you. Mr. West. Mayor and City Council. The item before you is to accept a 25,000 grant from the Community Foundation to amend a contract with ALTA planning and design and to increase appropriations of development services. This is to allow us to update the Bicycle Master Plan.'",
        "'speaker_0': 'Alta has a good scope of services provided with a large community outreach service outreach program to a number of different groups. And a lot of strategies will be included in the master plan. Thank you.'",
        "'speaker_1': 'Thank you. There's a motion and a second itinerary. Public comment on this. CNN. Please cast your votes. Oh, I'm sorry. Vice Admiral Lowenthal, I'm sorry about that.'",
        "'speaker_0': 'That's okay. I just wanted to compliment our staff for all the work that they've done on this. I know it's it's been a very, very long narrative, and every bit of work that goes into it is something that's a source of pride for me.'",
        "'speaker_0': 'We continue to be proactive in our efforts to help our city to be recognized as one of the nation's most bicycle friendly cities. And this new master plan will continue to serve as a guide to developing and maintaining our bikeways and bicycle friendly roadways.'",
        "'speaker_0': 'I, I don't get tired of saying this, but our city is an example of our ability to connect our urban communities with our suburbs, suburban communities. And this updated plan will only increase those possibilities for us. So for me, as I wrap up my tenure here this summer, our commitment, our continued commitment to adding on to our'",
        "'speaker_0': 'bicycle infrastructure is a constant source of pride for me. So for that, I thank you.'",
        "'speaker_1': 'Thank you. Can I get emotional? Okay. There's emotion any second on this. Councilor Richardson's. You have any comments or. No? Okay. I see no public comment on this, right? No public comment. Please cast your vote.'"
    ],
    "First Amendment to Agreement with Long Beach Public Transportation Company for Belmont Shore Employee Rider Pass Program. ": [
        "'speaker_0': 'Motion carries. Excited Report from Economic and property development. Recommendation to execute a First Amendment to agreement with Long Beach Transit. To extend the agreement for six months to provide sufficient time to optimize the Belmont Shore Employee Rider Pass Program City District three.'",
        "'speaker_1': 'There's a motion and a second. Councilman Price, did you have any comments or.'",
        "'speaker_2': 'I do. Thank you. The Belmont Shore Employee Rider Pass program is a very successful program that was started in March of 2013 and modeled after the Cal State Long Beach program, which provides free transit to All Long Beach State.'",
        "'speaker_2': 'I'm sorry, all Long Beach Transit busses to eligible students, faculty and staff at Long Beach State with the Belmont Shore Employee Rider Pass program, employers in Belmont Shore provide a free bus pass to all employees in order to encourage transit ridership.'",
        "'speaker_2': 'Currently, we have over 500 Belmont Shore employees taking advantage of this program, which reduces pollution and most importantly, given the area helps ease the parking challenges we face in the shore. I appreciate staff extending this program for an additional six months as we work out a long term agreement with Long Beach Transit to continue providing bus service'",
        "'speaker_2': 'for our Belmont Shore employees. Thank you.'",
        "'speaker_1': 'Thank you. Is there any public comment on this item? Please cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Grant Agreement with The California Endowment for the Promising Adults, Tomorrow's Hope Program.": [
        "'speaker_1': 'Thank you. Next item, please.'",
        "'speaker_0': 'Report from economic and property development. Recommendation to execute all necessary documents with the California Endowment to accept funds totaling $75,000 to implement the PATH program citywide.'",
        "'speaker_1': 'Councilman Richardson.'",
        "'speaker_4': 'Thanks, Mayor. Let's start with the staff report.'",
        "'speaker_6': 'We have Nick Shultz, who will present this staff report. Good evening. Honorable Mayor and council members will come before you tonight. Promising adults tomorrow's hope or path is a first of its kind diversion program, focusing on young adults aged 16 to 24.'",
        "'speaker_6': 'Cities large enough to have a high volume of misdemeanor crimes in all cases are handled by relatively few prosecutors. The number of youth with contact with the justice system is problematic as the status exacerbates young people's access to quality employment or distracts them from focus on educational and training pathways or access to other resources.'",
        "'speaker_6': 'The Long Beach City Prosecutor City Prosecutor's Office is already a leader in developing and implementing diversion programs. Our Regional Workforce Development Board is positioned with industry, employers and well-connected to both community organization and education and training institution with the capacity to serve these youth.'",
        "'speaker_6': 'This place is the program's leadership team in a new, in a unique position of being able to harness public resources and affect life impacting decisions for youth. And with PATH, we look we look forward to being able to demonstrate results related to program entry and completion for young adults skill games, work readiness, job attainment, retention, wage gain'",
        "'speaker_6': ', and reduction in recidivism for path participants, as well as program adoption and replication in other California municipalities. Mayor, Mayor, Councilmembers. I also want to introduce our city prosecutor, Doug Halbert, who's been very, very key in this initiative as well.'",
        "'speaker_6': 'I just wanted to, on behalf of my department, thank the the mayor and the city council, as well as Pacific Gateway for helping to make this diversion program a reality. I think it was mentioned last time I spoke about this that this is the first workforce development focused court diversion program of which we know of in the'",
        "'speaker_6': 'United States. So Long Beach is doing something that is creative and innovative and hopefully becomes a pilot project that other communities can look at. But I wanted to thank all the council members, especially Rex Richardson, who has been very focused on helping make this successful.'",
        "'speaker_6': 'And with that, I thank you for your support.'",
        "'speaker_1': 'Thank you. Councilwoman Gonzales. Sorry, Captain Richard.'",
        "'speaker_4': 'Thanks, Mr. Mayor. So I want to thank Nick and Doug for their hard work in bringing this forward. It was. It's been about a year when we pitched this. We didn't know how we would pay for it, but we knew this was this that we wanted to figure out how to connect young people to a career or'",
        "'speaker_4': 'to an educational opportunity to place them on the right track when they make a mistake. And specifically, folks under 24 who we acknowledge in science acknowledges that their brains aren't fully developed. So so a full year has come, come and gone.'",
        "'speaker_4': 'And we've finally gotten to a place where we've found a financing solution for this. And thank you so much to our city prosecutor, Doug Halbert, for finding the resources. Thank you to Nick Schultz for corralling the write the Right Workforce programs with this.'",
        "'speaker_4': 'But we noticed that there was a gap in terms of how we divert people in education programs. So today is really about the California Endowment stepping up and helping to fill that gap and providing much needed resources to make sure that this is a comprehensive program that uses both workforce and education as a means for for diversion'",
        "'speaker_4': '. So so I wanted to just chime in and thank all the partners we're really proud of of this program and where and how it's come together. And we look forward to doing more great work and innovative work like this in the future.'",
        "'speaker_1': 'Thank you, Councilman Andrew. I'm so sorry. All right. Yeah, I.'",
        "'speaker_2': 'Think that's the second time.'",
        "'speaker_1': 'I have. I've done it to a few of you guys.'",
        "'speaker_2': 'Tonight, so I just. I just really briefly wanted to say thank you for all of your hard work, both Doug and Nick. I know each of you work to the best of your ability to find ways and find opportunities for us, especially when many of us on the council have really advocated for for job growth, and especially'",
        "'speaker_2': 'with adults that certainly need it the most. And I want to thank Councilman Richardson as well for his leadership on that. So thank you.'",
        "'speaker_1': 'Thank you. Councilman?'",
        "'speaker_5': 'Yes. I also think you might also want to think and you can talk about this, because I'm very happy to see this item, you know, on the agenda. But I really want to thank the California Endowment for their donation to this commit to the commitment to the Long Beach community.'",
        "'speaker_5': 'You know, the Petrograd will give our youth in the Delta training, you know, experience that they need to succeed. And I would like to request the names of the organizations that are recruiting, as well as how to for people to this program.'",
        "'speaker_5': 'Because a lot of individuals will be coming through my office wanting to know some of this. So I want to thank you guys very much for bringing this to the diocese. And I thank you.'",
        "'speaker_1': 'Thank you. And Councilwoman Mango.'",
        "'speaker_0': 'Yes, Nick, you know that I'm constantly impressed by what you're able to do. You squeeze money out of a rock. And I think that that is one of the things that is so impressive about what you've been able to do with workforce development since you've been on board.'",
        "'speaker_0': 'I'd like to ask that information and documentation on what you're doing and how we can advocate for this at the federal level in our Fed committees in D.C. in April is possible because I think that $75,000 is a a start.'",
        "'speaker_0': 'But we are really going to need significantly more funding if we're going to take this seriously and take it to the next level where other cities will start modeling after us. So I'd like to see us up the ante and get some more private partnerships involved and how we can make that happen.'",
        "'speaker_0': 'So I appreciate the head nods over there. I think that we're on the same page that to really do something meaningful, we need to even push harder because this could be game changing for a Long Beach. Thank you.'",
        "'speaker_1': 'Thank you. Any public comment on this item? Seeing that, please cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Funding Agreement for Beach Water Quality Monitoring.": [
        "'speaker_1': 'Next item.'",
        "'speaker_0': 'Report from Health and Human Services recommendation to execute all necessary documents with the State Water Resource Control Board to receive funding in the amount of $100,000 to provide beach water quality monitoring citywide.'",
        "'speaker_1': 'Thank you. Your income.'",
        "'speaker_0': 'I don't know.'",
        "'speaker_1': 'Councilman Andrews. Any public comment on the item? Seeing Nazis cast your votes. Well.'",
        "'speaker_0': 'We do have a question.'",
        "'speaker_1': 'Oh, sure, Councilman Price.'",
        "'speaker_2': 'Sure. I just wanted to thank staff for this great effort. You know, our city has done such an amazing job in terms of making sure that we have.'",
        "'speaker_0': 'Hmm.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_0': 'Since we deal with this issue a lot.'",
        "'speaker_2': 'To make sure that we have that water quality is such an important part of our story here in Long Beach and what we have to be proud of. So I want to thank staff and thank my colleagues in advance for supporting this.'",
        "'speaker_1': 'Vice Mayor, did you have any comments?'",
        "'speaker_0': 'I just had a question. Is this the same monitoring that we had developed and expanded in conjunction with Heal the Bay and their report and all of that?'",
        "'speaker_6': 'Nelson Kerr, our bureau manager from Health Services.'",
        "'speaker_4': 'Yes, honorable mayor, members of the City Council. Yes. This is the same hill. The Bay uses our test results to calculate their grade, so they're using our data.'",
        "'speaker_0': 'I appreciate that. Thank you. And I appreciate the continued work.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Sorry. One more thing. Would this be a good time to report that in 2015 we got a ratings and all of our waterways as opposed to 2008 when we had a bunch of FS.'",
        "'speaker_6': 'This is a great time to report that.'",
        "'speaker_2': 'Was it is it 2008 we had to write these.'",
        "'speaker_6': 'Yes. And dry weather. Yes.'",
        "'speaker_2': 'Yeah. And then 26 vice mayor was saying. So for a long time we had bad grades and we're doing really well.'",
        "'speaker_6': 'This city council has spent millions and worked diligently over the past ten years with its own city council committee to clean the water. The City Council has worked diligently with Heal the Bay so that we have independent third party people that are evaluating our water.'",
        "'speaker_6': 'Mr. Kerr Behind us, he has health experts that collect samples. They have scientists that test the samples. So these are legit. And again, they're supported by Heal the Bay.'",
        "'speaker_2': 'Mr. Ker, did you want to say anything?'",
        "'speaker_4': 'I concur with what the city manager said.'",
        "'speaker_2': 'You know, we just had an interview regarding Colorado Lagoon and the water quality there. And we were talking about the great.'",
        "'speaker_0': 'Work of the.'",
        "'speaker_2': 'The residents who live in the area and instead of a grassroots effort. So we're going to call it the eel grassroots efforts because the water quality at that body of water is so amazing and a lot of people don't know and they're still not going in.'",
        "'speaker_2': 'So we're hoping that Mr. West's concept of swim ability really takes flight in 2016.'",
        "'speaker_4': 'So think Colorado Lagoon is our shining star. That used to be a perennial.'",
        "'speaker_6': 'Beach bummer.'",
        "'speaker_4': 'For years and years, and now it is actually our best water quality in the city and has been since the project's been almost completed. Okay.'",
        "'speaker_1': 'Councilman Fischer, you will read the. Yes. Councilman Mungo.'",
        "'speaker_0': 'I just wanted to remind everyone that Councilman Price did such an excellent job reminding us how clean it was by having that water dumped on her head for ALS. And we really appreciate her showing us the cleanliness of the water.'",
        "'speaker_0': 'And I'd be willing to find another charity to have this same experience again.'",
        "'speaker_1': 'Swimming in it.'",
        "'speaker_0': 'We could do a swim.'",
        "'speaker_1': 'Thank you. Any public comment on this item? Vice Mayor Lowenthal You know.'",
        "'speaker_0': 'Right. So Councilmember Price reminded me I know we take this for granted now because of how far we've come, but at the same time, there are a couple of things that I think we should at least share with the public.'",
        "'speaker_0': 'And one is something that Councilman Price just mentioned off the mic, which is we will be posting these grades at our beaches. Is that correct, Mr. Kerr? Just say yes. Yes. Okay. And so it's similar to our restaurant grades.'",
        "'speaker_0': 'Where is it? By flags. Will the grades be posted using a flag? Mr. Modica.'",
        "'speaker_6': 'Yes. We going to post at four beaches where we'll give the grades? Well, actually, I'll be in colors so it'll be safe to swim or rain advisory or don't swim in red. So green, yellow and red. Occasionally we do have a sewer spill or something and we'll have to put that out there.'",
        "'speaker_6': 'But normally in dry weather, we'll have greens out there. We'll also have the water temperature and we'll also have a QR statement. If you have a smartphone and if you want to get into how the sciences of how we test our water, you can run your smartphone over that and go straight to Mr. Kerr's website and health'",
        "'speaker_6': 'services to determine all that. And these will be at Mother's Beach, at Colorado Lagoon, at Bay Shore Beach, and also at Kite Beach.'",
        "'speaker_0': 'I appreciate that. I think just separate in and of itself, it's a very significant thing. But when you start looking at what makes the city attractive, whether it's for cycling or for tourism, these are all things that get widely publicized.'",
        "'speaker_0': 'I've been on the Hill, the bay board for almost ten years now, and it is something that's widely publicized and which we should be proud of. They're proud of where we came from and how far we've come, actually, and it is a big deal.'",
        "'speaker_0': 'So I'm looking forward to announcing those grades and and that will keep us motivated. There are some things that we cannot control. We just were reminded that we probably have not knock on wood had a spill in quite some time, but there are effluent issues that we aren't able to control, but we are on top of what'",
        "'speaker_0': 'we can and at least being able to alert our residents and visitors when it's not quite. Safe and pristine. I think it's a good thing. Thank you. Correct.'",
        "'speaker_6': 'We'll be very, very honest about it. And also, we want to shout from the rooftops so much so that we're going to be placing shortly 17 swim ladders at all of our public docks throughout Alameda space to just encourage people to be in the water.'",
        "'speaker_1': 'Thank you. See no other public comment. Please cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ]
}