{
    "Cash Flow Loan from Tidelands Oil Revenue Fund to Aquarium of the Pacific Corporation.": [
        "'speaker_0': 'Thank you. We're going to go ahead and move on to the regular agenda. Item 12, please.'",
        "'speaker_1': 'Report from financial management a recommendation to implement a cash flow loan to the Aquarium of the Pacific Corporation for up to 5 million and terminate the previous authorization for a loan for October 2020. Rent District two.'",
        "'speaker_0': 'A promotion from Councilor Allen. Can I get a second, please? Second by Councilwoman Price IV. Mr. Walker, did you have an update on this? I know we've read the report.'",
        "'speaker_6': 'We have John GROSS prepared to give a staff report. But essentially, this is a city facility. They've worked really hard over the past year to manage all of their expenses, but there's clearly uptake or up maintenance that needs to happen on a for keep the building up and keep all the animals safe.'",
        "'speaker_6': 'And so they're asking for a short term loan that wouldn't have any impact on the general fund. It would be a tidelands loan that specified in front of you. So we're recommending approval.'",
        "'speaker_0': 'Thank you, Councilwoman Allen. Any comments?'",
        "'speaker_4': 'Yes, thank you, Mayor. I just want to say, you know, the Aquarium of the Pacific is a major asset in our city. This is our asset. It's a city asset. And millions of people from all over the region visit the aquarium annually.'",
        "'speaker_4': 'And I definitely don't want the aquarium to default on any of their expenses. They will pay the city back over a maximum of 13 years. And in fact, we're likely to be paid ahead of time and they'll pay us a little interest to so that so that's good.'",
        "'speaker_4': 'When I first got elected, I spoke with the CEO, Peter Correia, the new president, and he explained the need for consistent operations by key experienced staff that are caring for the endangered species. And even without visitors, the animals and the ecosystems must be maintained.'",
        "'speaker_4': 'And while I know the commitments and concerns surrounding the health of the Tidelands Fund, I trust that this short term loan will keep the aquarium operating and will preserve and protect this incredible institution and our city. And I also trust that it will be repaid once the aquarium is allowed to fully reopen.'",
        "'speaker_0': 'Thank you, Councilwoman Brice.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I am going to be voting in support of this item tonight as well. I do have some serious concerns regarding regarding the Tidelands Fund, and I want to make sure that those concerns are are noted and are on the record, so to speak.'",
        "'speaker_4': 'Specifically in reading the staff memo on this item, in looking at page four, I think staff did a very good job of outlining the stress that the Children's Fund is under in general, the future vulnerability of the Children's Fund.'",
        "'speaker_4': 'And I want to be very mindful of our future obligations when it comes to any commitments that we make in the Tidelands area. I do believe, and I shared this with the aquarium team that that they are a very reliable partner in terms of operating this facility.'",
        "'speaker_4': 'We have a track record with the aquarium that has been very positive in terms of repayment of of of loans and other financial assistance. I think they take that commitment very seriously, but they are not our only city asset in the tidelands area and we have not had as positive of an experience with other partnerships in the'",
        "'speaker_4': 'Tidelands area and that has resulted in the Tidelands funds being further leveraged and ultimately that fund being very vulnerable in terms of future use and future programing. I think for many years there was a belief that the Tidelands Fund was.'",
        "'speaker_4': 'Positive and secure and a stable and a reliable source to fund a lot of the infrastructure that we have along the ocean, including our major city assets, like the convention center, like the Queen Mary, like the aquarium, and of course, all of our concession stands and other infrastructure along the tidelands area, that is no longer the case'",
        "'speaker_4': '. And as we look forward to our obligations in the Tidelands area and we factor in the liabilities that we have to now fund as a result of some realities that we have as a city, I think it's important for us to be mindful every time we leverage this fund, our efforts to provide equity and access to the'",
        "'speaker_4': 'coast, our ability to program for those opportunities will be significantly limited if the Tidelands Fund continues to experience stress. And I know that that is a priority for the city and the council is figuring out how to use tidelands dollars to bring people to the coast.'",
        "'speaker_4': 'Most of. Allow for access. Citywide and regional each of the use of types in infrastructure and the operational budget. So I just want to make sure that that is very clear. I wholeheartedly support the Aquarium's efforts and want to make sure that I'm acknowledging and commending them on the progress that they've made in light of the COVID'",
        "'speaker_4': 'limitations. And I wish them the very best as we move forward with this item and and and supporting their operations. So thank you very much, Mr. Mayor.'",
        "'speaker_0': 'Councilwoman Vice Mayor Richardson.'",
        "'speaker_3': 'And if you had just cued up 2 seconds before, but I see it's all covered, so I'm happy to vote in support of this.'",
        "'speaker_0': 'And thank you, Councilwoman and Day House.'",
        "'speaker_4': 'Thank you. Thank you, Mayor. I just wanted to say that I'm also very much in support of this item. I know that the Aquarium of the Pacific now got some really remarkable programs to our city and outside of our city, especially the Festival for Human Abilities that I always look forward to, which highlights the talents and skills'",
        "'speaker_4': 'of people with disabilities and people all throughout come to visit our aquarium. And so that, you know, the aquarium is very near and dear to my heart. I'm very confident that they will do good on this loan and that they will, I'm sure, like Councilmember Allen said, that they'll even probably pay it back, you know, even earlier'",
        "'speaker_4': 'than anticipated. So I look forward to supporting this item and I want to thank the aquarium for all that they're doing in spite of everything happening and such a hard year without having, you know, the ability to show off our beautiful aquarium.'",
        "'speaker_4': 'So I look forward again to supporting the site. And thank you.'",
        "'speaker_0': 'Thank you. There is no public comment signed up. So although.'",
        "'speaker_1': 'District one, high district two. I District three.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. My District six.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District seven. By District eight.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Ocean cares.'"
    ],
    "FY 2021 First Budget Appropriation Adjustments. (Citywide)": [
        "'speaker_0': 'Item 13 Please.'",
        "'speaker_1': 'Report from Financial Management Recommendation to approve the fiscal year 2021 first departmental and one budget appropriation adjustments citywide.'",
        "'speaker_0': 'Can I get a motion in a second, please? Got a motion by Vice Mayor Richardson and a second by Councilmember Ringo. There is no public comment on this item. So, members, please go ahead and cast your vote.'",
        "'speaker_1': 'District one.'",
        "'speaker_3': 'That's.'",
        "'speaker_1': 'District one.'",
        "'speaker_4': 'Can you hear me?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'District two.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_4': 'This for me. I said.'",
        "'speaker_1': 'I. Yes, thank you. District for.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'District eight. By District nine.'"
    ],
    "COVID-19 Relief Measures and Payment Plan Program for Taxes, Fees and Citations.": [
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Item 14, please.'",
        "'speaker_1': 'Report from Financial Management Recommendation to extend the deferral of payment for business license, taxes and fees and the street sweeping relief program through June 30th, 2021, to establish a citywide COVID 19 Relief Payment Plan Program citywide.'",
        "'speaker_0': 'Thank you. There's a motion any second by Vice Mayor Richardson and second by Councilmember Ringo. I don't see any public comment on item 14, so we'll.'",
        "'speaker_3': 'Probably.'",
        "'speaker_1': 'District one.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'District to. I. District three.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five. I. District six. I. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'II.'"
    ],
    "Smart City Initiative Strategy and Data Privacy Guidelines Approval.": [
        "'speaker_1': 'District nine. My motion carries.'",
        "'speaker_0': 'Thank you. Moving on to item number 15, please.'",
        "'speaker_1': 'Report from Technology and Innovation recommendation to approve the City Smart City Initiative Strategy and Data Privacy Guidelines Citywide.'",
        "'speaker_0': 'I have a motion by Vice Mayor Richardson. Can I get a second, please?'",
        "'speaker_3': 'Yes, ma'am. It's not a motion. I'm going to I'm going to go ahead and had an abundance of caution. I work in the fiber optics space on an abundance of caution to log off or recuse myself here. Thank you.'",
        "'speaker_0': 'Got it. I have a motion by Councilwoman Mongo and a second by Councilmember Ringa, I. Let's do. Let's go ahead and go. I do we have a short presentation, Mr. Modica?'",
        "'speaker_6': 'Yes, we do. This is a strategic plan that the Council asks us to put together back in October of 2019. So we'd like to walk through what that effort has been. And I will turn it over to Leah ERICKSEN to walk us through the presentation.'",
        "'speaker_4': 'Good evening, Mayor. And members of the City Council, the Technology and Innovation Department is pleased to.'",
        "'speaker_2': 'Provide an overview.'",
        "'speaker_4': 'Of the proposed Smart City Initiative Strategy and data privacy guidelines for your overview and discussion.'",
        "'speaker_2': 'Go to the next slide.'",
        "'speaker_4': 'To provide background and context. In October 2019, McCarthy and the one page council directed city staff to develop a smart city strategic.'",
        "'speaker_2': 'Initiative to create a coordinated, coordinated approach to using technology to solve city challenges. We defined.'",
        "'speaker_4': 'A smart city as one that uses.'",
        "'speaker_2': 'Emerging technology and data to enhance city operations, improve the quality of life for our residents.'",
        "'speaker_4': 'And protect residents privacy. The city manager tasked to coordinate this directive. We recognize.'",
        "'speaker_1': 'That the city has.'",
        "'speaker_2': 'Already completed many projects.'",
        "'speaker_4': 'Using new and smart technology over the last several years, such as our automated utility meters and our E-SCOOTER program. So the intent of the Smart for the initiative is to engage in a collaborative effort to build our foundations that are already in place, expand our capacity and use resources efficiently.'",
        "'speaker_4': 'I will now turn the presentation over to Ryan Kurtzman, who is our Smart Cities program manager, to continue the presentations.'",
        "'speaker_3': 'Thank you, Leah, and good evening, Mayor, and members of the City Council. I will provide additional context for the Smart City Initiative and discuss the proposed vision, guiding principles, strategies and objectives. Next slide, please. From day one. I'd idealism to the Long Beach community members and local stakeholders to inform the Smart City strategy.'",
        "'speaker_3': 'We held 13 community meetings in addition to workshops, interviews and online outreach. We approach this unique lens and intentionally uplifted the voices of community groups that represent individuals left behind by the digital divide. We also spoke with technology, industry partners and city staff and launched a multilingual paper and online survey.'",
        "'speaker_3': 'We acknowledge that reach was not exhaustive and was limited due to the COVID 19 pandemic and the inequities associated with the digital divide. Many community groups that we reached out to let us know that they did not have the capacity to participate due to other priorities during the pandemic.'",
        "'speaker_3': 'However, we are committed to continuing community engagement citywide every step of this initiatives. Throughout this process, TIME collaborated closely with the Technology and Innovation Commission. On January 27th of this year, the Commission voted unanimously to approve the Smart City Initiative strategy and recommended bringing it to the full City Council for approval today.'",
        "'speaker_3': 'Exide. Before we present to you the proposed Smart City strategy, we must acknowledge that smart city technologies, if not regulated, have the potential to infringe upon residents personal privacy. In our community survey, we heard that although residents believe smart tools are essential, they are strongly concerned that this could mean less personal privacy.'",
        "'speaker_3': 'This is why city staff is proposing data privacy guidelines. In addition to the Smart City initiative for your review and approval this evening, the data privacy guidelines are contained in attachment to the staff report and address transparency and accountability.'",
        "'speaker_3': 'Participatory feedback channels, digital equity, ethics and nondiscrimination. Next slide. What follows is an overview of the Long Beach Smart City Initiative, vision, guiding principles and objectives. The Smart City Initiative advances solutions to civic challenges next time. By engaging the community staff and the private sector.'",
        "'speaker_3': 'Next slide. To explore and implement emerging technology. Next slide. It is important to note that this vision is rooted in collaboration and meeting real city challenges. The Smart City Initiative will strive to provide solutions to the needs already identified in the city's framework for racial reconciliation.'",
        "'speaker_3': 'Digital Inclusion Initiative, 2030 Strategic Vision and the recently proposed Long Beach Recovery Act. Next slide. Next, the Smart City Initiative proposes four guiding principles that will provide a framework to align the city's portfolio of technology projects. These principles have been adapted to address challenges following the COVID 19 pandemic and echo what we heard from the Long Beach'",
        "'speaker_3': 'community, which can be found in Appendix A of the final Smart City Initiative report. The first principle is to design for equity. Smart city technologies must reduce historic inequities, be accessible to all, and improve the quality of life for underserved communities.'",
        "'speaker_3': 'Second, the city's use of emerging technologies must build public trust by championing excellence in data privacy and transparency. Third, the Smart City Initiative will cultivate local expertize by promoting economic inclusion, supporting local businesses, improving workforce job readiness, and strengthening local partnership networks.'",
        "'speaker_3': 'And finally, our smart city technologies must build civic resilience. We must prioritize new technologies that improve our ability to meet resident needs and respond to the most pressing civic challenges. Next slide. The Smart City Initiative proposes four interconnected strategies and 11 objectives that align with these guiding principles and together create a roadmap through FY 2022.'",
        "'speaker_3': 'Guide staff will continue to lead this work in collaboration with other city departments, local stakeholders and community members. To start, the city needs to lay a strong foundation. While smart city projects will take many different forms, much of their underlying infrastructure must be shared across departments.'",
        "'speaker_3': 'The first strategy is for the city to assess the needed infrastructure for smart city projects. This includes conducting an inventory of physical infrastructure such as our fiber network and streetlights, and also our policy infrastructure, such as our purchasing guidelines and data sharing agreements.'",
        "'speaker_3': 'Upon evaluating the infrastructure, we will develop a high level public facing road map for smart city priorities. This will again align with the Framework for Racial Reconciliation, Digital Inclusion Initiative, 2030 Strategic Vision and proposed Long Beach Recovery Plan, and will continually be assessed based on what's working and what isn't.'",
        "'speaker_3': 'Next slide. To ensure the Smart City Initiative uplifts diverse Long Beach perspectives. The second strategy is to build a broad stakeholder network connecting industry experts, community members and city staff. We will invite collaboration from tech industry leaders to generate ideas and identify viable partnership opportunities.'",
        "'speaker_3': 'We will also work to create opportunities for Long Beach residents and other local stakeholders to co-design city technology solutions with a particular emphasis on including low income communities and communities of color who stand to benefit the most from gains in digital literacy and participation in the smart city economy.'",
        "'speaker_3': 'Next slide. The third strategy is focus on developing a lean operating model so that the Smart City Initiative can succeed with limited resources in the near term, while also setting a vision for what a more robust organization may look like in the future.'",
        "'speaker_3': 'In the short term, it will utilize its currently assigned 1.5 FTE to manage the Smart City Initiative and will leverage available city department funds based on department interest in technology projects in order to fund longer term or cross-departmental smart city technology projects.'",
        "'speaker_3': 'We will also seek outside funding sources, including philanthropic grants and revenue sharing models with private partners. Next slide. The fourth and final strategy is to develop flexible pilot models, to advance smart city technology projects that originate from three different sources the private sector, city staff and Long Beach residents and businesses.'",
        "'speaker_3': 'The unsolicited private pilot model would provide a framework for funneling unsolicited vendor proposals from tech companies to a single point of contact. Evaluating them with with a transparent criteria and implementing those that offer promising solutions to legitimate city needs.'",
        "'speaker_3': 'The city solicited. The model would prioritize challenges developed by city departments and issue a call for solutions to solicit private partners. And lastly, through the community led pilot model, the city would engage community members and solicit solicit their neighborhood specific ideas and concerns.'",
        "'speaker_3': 'Community members would have the power to define pilot goals and objectives, propose a prototype and select potential solutions, test and evaluate implemented solutions and make recommendations for scaling the project beyond the initial pilot phase. Next slide. I will now turn it back over to Lia to finish the presentation.'",
        "'speaker_4': 'Thank you, Brian. If the Smart City Initiative strategy is approved by the City Council, it will work with city staff from other departments, local stakeholders and community members to implement the strategies, objectives and pilot.'",
        "'speaker_2': 'Project models discussed in the previous.'",
        "'speaker_4': 'Slides. We will provide regular updates to the Long Beach community and will leverage the Smart City website to report on progress in meeting the key objectives. To protect residents privacy. City staff will also develop a work plan to.'",
        "'speaker_2': 'Operationalize the data privacy.'",
        "'speaker_4': 'Guidelines within city policies.'",
        "'speaker_2': 'Educational campaigns and procedures as appropriate.'",
        "'speaker_4': 'Finally, we will continue to advocate only for smart city solutions that meet city challenges, medical needs, and the priorities of the mayor and the Long Beach City Council. Next slide. With that, we conclude our staff report and we are available for any questions or feedback that you may have on the Smart City Strategic Initiative.'",
        "'speaker_2': 'Or the Data Privacy Guidelines.'",
        "'speaker_0': 'Thank you for that. Why don't we. Public comment. I think we've got two members of the public and then we'll go back to the council.'",
        "'speaker_5': 'Yes, we have three speakers. The first speaker is Dave Shukla.'",
        "'speaker_3': 'I agree with the. I'd like to speak in support of the data privacy guidelines as currently drafted by city staff. These guidelines are best understood as a public living kind of document that can and will be updated as technologies and opportunities emerge and mature.'",
        "'speaker_3': 'As you consider the Smart Cities initiative, I urge the City Council and city staff to adopt privacy by design principles and practice privacy by design refers to specific measures that can be taken so that smart city initiatives don't devolve into surveillance or data mining program.'",
        "'speaker_3': 'These measures include setting contractor or California Consumer Privacy Act compliance, refusing to grant contracts to vendors who reserve the right to change or alter their terms of use or data collection policies. Also, working with municipal purchasing and procurement at all stages of product development or data utilization by a third party to implement privacy safeguard into these technologies'",
        "'speaker_3': '. Another privacy by design practice would be for the City of Long Beach to continue what it's doing, building an in-house capacity, staff capacity for a lot of the privacy and data protection issues that arise from a lot of smart city infrastructure kind of development deployment.'",
        "'speaker_3': 'We must recognize that private companies, for instance, digital solutions, don't have the same privacy or data protection goals as. No Roadmap for Smart City Initiative in Long Beach should proceed without first recognizing that the city, in this instance and in many other, find a contract with a vendor with a defined field for data collection.'",
        "'speaker_3': 'In this instance, license plate reading that. Actually it loads tremendous potential abuse and particularly when combined with other routine data, location data, time of use data can be used to build behavioral profiles of people and those behavioral profile can be sold third party vendors.'",
        "'speaker_3': 'So having stronger, first of all, having defined policies at all, that's a good first step. But having stronger policies specifically defined and how the city relates to vendors in these contracts is. Something I hope you all support and consider implementing some of these practices, specifically privacy by design that other things are already kind of.'",
        "'speaker_5': 'Do you think your next speaker is Gwen SCHIEFFER?'",
        "'speaker_2': 'Good evening. They are garcia and members of City Council. My name is Gwen Schaefer. I'm on faculty at Cal State Long Beach and I chair the city of Long Beach Technology and Innovation Commission. As Leah mentioned, in October 2019, Mayor Garcia directed staff to develop a smart city strategic initiative and guiding priorities.'",
        "'speaker_2': 'Clearly, Mayor Garcia recognizes the potential for technology to spur economic development, to make Long Beach safer, to develop a resilient workforce, and generally to improve quality of life. But you could not create a smart city without data collection and artificial intelligence.'",
        "'speaker_2': 'A majority of Americans responding to a recent Pew Research poll reported that they are, quote, concerned, confused and feel a lack of control over their personal information. Even so, Congress has failed to enact a comprehensive privacy law to combat the data aggregation, profiling and selective targeting that dominate our online activities.'",
        "'speaker_2': 'While the CFPA went into effect more than a year ago, municipal governments are exempt from complying, even though nearly 80% of Americans responding to that same Pew Research survey reported feeling very or somewhat concerned about how companies and the government use their personal data.'",
        "'speaker_2': 'Between November 2019 and April 2020, Ryan and I co facilitated focus group discussions with 82 Long Beach residents from all across the city ranging ranging in age from teens to seniors. We presented them with three specific smart technologies currently deployed in Long Beach.'",
        "'speaker_2': 'The first scenario centered around the passport parking mobile app used for beach plots owned by the city. The second scenario presented study participants told them about ring security cameras, which collect surveillance footage that residents may voluntarily share with the police department.'",
        "'speaker_2': 'Finally, we asked study participants about their attitudes towards Internet connected water meters that capture usage in real time. The findings reveal that privacy concerns transcend data collection practices. In fact, Long Beach residents are equally concerned about which government agencies or corporations collect their personal information and how it may be used in the future.'",
        "'speaker_2': 'Furthermore, through agreements for third party vendors, data generated by smart city technologies may end up serving private interests and leaving residents feeling exploited and distrustful. This underscores the need for the city of Long Beach to incorporate data privacy language into third party vendor contracts that explicitly prohibits partners from reselling personal data or using it for non stated'",
        "'speaker_2': 'purposes. This evening I urge City Council to approve both the Smart City Initiative and the data privacy guidelines developed by the Department of Technology and Innovation. Without such protections, Long Beach residents may ultimately determine that compromised privacy is simply too high a price to pay for the privacy.'",
        "'speaker_5': 'Your next speaker is Myron Rolle Wallen.'",
        "'speaker_3': 'Thank you, Mayor.'",
        "'speaker_2': 'Garcia.'",
        "'speaker_3': 'And members of the.'",
        "'speaker_2': 'City.'",
        "'speaker_3': 'Council. I am Myron Walden, president of the Long Beach Gray Panthers. The Gray Panthers.'",
        "'speaker_2': 'Are in favor of the Smart City initiative that aims to explore.'",
        "'speaker_3': 'And implement emerging technology. It is a notable goal in this current era, and Long Beach seniors are in dire need of a new technology. We were one.'",
        "'speaker_2': 'Of the groups that participated.'",
        "'speaker_3': 'In the community.'",
        "'speaker_2': 'Engagement outreach efforts.'",
        "'speaker_3': 'At the Long.'",
        "'speaker_2': 'Beach Technology and Innovation Department. We participated in two focus.'",
        "'speaker_3': 'Groups selected surveys from low income residents and encouraged.'",
        "'speaker_2': 'Our members and partners to complete the digital.'",
        "'speaker_3': 'Survey. The Long Beach Gray Panthers applaud the Smarts.'",
        "'speaker_2': 'Initiative.'",
        "'speaker_3': 'For including older adults as one of the.'",
        "'speaker_2': 'Groups that.'",
        "'speaker_3': 'Need help with today's new technology. During the pandemic, older.'",
        "'speaker_2': 'Adults have been isolated at home with little social contact. They would like to contact their family, their grandchildren, their friends. They have been depressed.'",
        "'speaker_3': 'We are grateful.'",
        "'speaker_2': 'With the city's limited ability to.'",
        "'speaker_3': 'Provide hardware.'",
        "'speaker_2': 'We have participated in distributing.'",
        "'speaker_3': 'This to worthy older adults in Long Beach.'",
        "'speaker_2': 'Then they need to learn how to use them.'",
        "'speaker_3': 'We have partnered with Long.'",
        "'speaker_2': 'Beach City.'",
        "'speaker_3': 'College to provide the instruction for this. In addition.'",
        "'speaker_2': 'We have received a grant from Spectrum.'",
        "'speaker_3': 'To set up a computer lab.'",
        "'speaker_2': 'In the Fourth Street Senior Center. The 20 or so computers just set up this month have already been used to help seniors fill out their income tax.'",
        "'speaker_3': 'Which has been a big hit. See, we are all well aware of how the digital revolution is a necessity for us.'",
        "'speaker_2': 'As older adults are frequent targets for scammers and criminals. They must be kept safe in their online privacy, protected as they.'",
        "'speaker_3': 'Learn to bank.'",
        "'speaker_2': 'Shop, pay.'",
        "'speaker_3': 'Bills, visit remotely to prevent.'",
        "'speaker_2': 'Social isolation with.'",
        "'speaker_3': 'Friends and family and if remote.'",
        "'speaker_2': 'Doctor visits.'",
        "'speaker_3': 'It is important.'",
        "'speaker_2': 'That city policy consider the needs.'",
        "'speaker_3': 'Of older adults and.'",
        "'speaker_2': 'Ensure.'",
        "'speaker_3': 'They have all have.'",
        "'speaker_2': 'Access to technology and the equipment and education.'",
        "'speaker_3': 'To use it effectively, as well as keep current and new technology. We need more hardware.'",
        "'speaker_2': 'Learning instruction, access.'",
        "'speaker_3': 'To the Internet. We applaud.'",
        "'speaker_2': 'The efforts of the city to help provide access to the Internet in some high rise.'",
        "'speaker_3': 'Buildings with the technology from a private company.'",
        "'speaker_2': 'Sorry. This needs to be expanded to more buildings.'",
        "'speaker_3': 'Free public Wi-Fi and wide areas.'",
        "'speaker_2': 'In town and.'",
        "'speaker_3': 'On Long Beach is also a necessity. We look forward to the implementation of the Smart Cities Initiative. We urge you to support this initiative. Thank you.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Thank you. I have a motion in a second by councilman mango and Councilman Ringa. Councilman Mongo.'",
        "'speaker_4': 'Thank you. I'm so pleased that we're moving in this direction. This is the second time I got to see this excellent presentation and thank you to the community and the commission for all their work. And thank you to the staff in I.T. for your great leadership.'",
        "'speaker_4': 'I look forward to this. I'm leading us through many exciting projects ahead, including the Long Beach Passport or whatever we'll call it, to link all residents up and break the digital divide so they can access city resources from the palm of their hand 24 hours a day.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. From Ringa.'",
        "'speaker_3': 'I too have very supportive of this item. I think it's important that we all detect our personal data and information in the smart cities. This is a long time coming. It's been basically adopted in many cities throughout the country.'",
        "'speaker_3': 'And Long Beach is now going to be one of those smart cities. So be included in that to appreciate everyone's forward thinking.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_4': 'Thank you, Emir. I'm also happy to see this report tonight from Director Ericsson, and I'm very supportive. I've heard from many of my constituents about the importance of this item tonight. New technologies present existing possibilities. And I absolutely love that we are engaging the private sector and the community to help harness this emerging tech.'",
        "'speaker_4': 'I look forward to seeing how it's built out and continue in your work with our commissioners and the community. I do have a quick question for you, Director Ericsson. What is the one high potential emerging technology that you are most excited about?'",
        "'speaker_4': 'I thank you, Councilwoman Allen. In addition to what Councilwoman Mongo was mentioning, our password initiative.'",
        "'speaker_2': 'That.'",
        "'speaker_4': 'Makes services easier to access. There's there's actually quite a few interesting things that we're looking at, including extremely excited by the use of AI and chat fonts to make city hall services more accessible, less bureaucratic. We're using sensors on trash trucks to detect graffiti dumped.'",
        "'speaker_2': 'Items of trouble.'",
        "'speaker_4': 'But, you know, as some of our residents mentioned, we also really need to make sure that we are also focusing on the digital divide, that that the technology investments that we're making are accessible to all. So I look forward to.'",
        "'speaker_2': 'Approval of.'",
        "'speaker_4': 'This item today. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_4': 'Thank you. I want to thank staff for the report tonight as well. And I'm excited about the possibilities. I will say, although it was not directly on point, I can't really let this item tonight go without reminding somebody.'",
        "'speaker_4': 'I hope somebody out there is listening. But I have brought a couple of different items to explore how we can utilize technology in our city currently to advance some of our goals. And unfortunately, we've really not heard too much about those technologies that other cities are using.'",
        "'speaker_4': 'One of them was the street sweeping app. When we brought that item, we asked whether we had the technology for our because we have GPS on the street streets, we bring vehicles to alert residents when the truck had passed their home so that for parking impacted areas, they could go ahead and park on the side of the'",
        "'speaker_4': 'street once the street sweeping truck has passed. That is a technology that's been utilized in other cities. I'd love to see that incorporated in the city of Long Beach. I think we brought that item maybe a year and a half ago or so, maybe to another item that we brought probably maybe three years ago was the app'",
        "'speaker_4': 'for homelessness, and it's the real time bed availability app that would allow first responders to see what beds are available in the region in terms of detox beds, mental health beds, substance abuse beds or co-occurring disorder facilities. So that if we do have an individual who wants to accept a service seven days a week, our first responders'",
        "'speaker_4': 'would be able to take them to a facility that would be willing and available to receive them. So those are two technologies that I know other cities have been utilizing, and I feel like we can't really call ourselves a smart city until we are at least using some of the technology that's already out there being used by'",
        "'speaker_4': 'others. And then we can build upon that. But I think our technology team is fantastic and I know that those items that I brought, we did not bring specifically to the technology team. We we brought them as general items.'",
        "'speaker_4': 'So I'm not sure where they ended up, but those are examples of technologies that I hope that in the future we're able to utilize because there are cities and municipalities that are using both of those technologies that I mentioned and probably a whole bunch of others that I did to advance their goals.'",
        "'speaker_4': 'And I'm certainly hoping that we can use it. And then I do also want to say that until we're at the place where we have closed the digital divide, our libraries are doing a tremendous job in providing digital access.'",
        "'speaker_4': 'And certainly they do not have sufficient resources to be able to serve all the residents. So I think that's really important and I think this report is very positive. And the possibilities in terms of where the city can go, in my opinion, are endless.'",
        "'speaker_4': 'And until then, we have institutions like our libraries around to help everyone have access. So thank you for that.'",
        "'speaker_0': 'Is in the house.'",
        "'speaker_4': 'Thank you. I'm very excited about this item coming before us. This is very near and dear to my heart as well, especially because it will affect a lot of a lot of seniors, people with disabilities. It will affect the Latino community and our neighborhoods here on the west side and central Long Beach in in ways of accessing'",
        "'speaker_4': 'technology. I know that during COVID, we have we have realized that there is a huge digital divide. And I'm just so happy to see something like this moving forward. I encourage us to look at would my colleague just stated these technologies that Councilmember Price stated and that we look into that and that we start looking in that'",
        "'speaker_4': 'direction. I think that would be very, very helpful for our city. And also, I wanted to say a big congratulations to our Great Panthers, who got a big a big grant from Spectrum, a $25,000 grant to provide our seniors who had been affected by the digital divide throughout our city and to provide them with with tablets.'",
        "'speaker_4': 'And I think that that's a huge, huge thing. And I'm so happy that so many seniors are were able to take advantage of that. And so I'm just really excited to see us moving in this direction. Congratulations, Mr. Erikson, for this great work to to the commission.'",
        "'speaker_4': 'Thank you. Keep up the good work. And I'm looking forward to seeing what else you bring to us in the future.'",
        "'speaker_0': 'Thank you. Great work. Roll Call the.'",
        "'speaker_1': 'District one.'",
        "'speaker_4': 'And.'",
        "'speaker_1': 'District two.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_4': 'I. II.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'District five.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District six. I. District seven. By District eight.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Application for 2020 SAFER Grant for 12 FTE Firefighters.": [
        "'speaker_3': '16, please.'",
        "'speaker_1': 'Communication from Councilman Super not Councilman Allen. Councilman Price, Councilwoman Sara Recommendation to direct City Manager to prepare an application for the 2020 Safer grant for submission by the March 12th, 2021 deadline.'",
        "'speaker_0': 'Citywide Construction Grants.'",
        "'speaker_3': 'Thank you, Mayor Garcia, and I always appreciate the opportunity to extoll the virtues of Fire Engine 17. First, I'd like to thank my council colleagues for joining me on this agenda item Cyndi Allen, Susie Price and Sally Sara.'",
        "'speaker_3': 'As the clerk just read, the recommendation is pretty narrow in focus. We're simply directing the city manager to prepare the application for submission to FEMA next week. If there, I'm open to a further discussion on funding, but tonight the urgency is to get this vote accomplished so the application can be submitted.'",
        "'speaker_3': 'Following in the agenda item. Within the discussion, we included what the grant is. It's a grant of $4.8 million over a three year period, and that actually cuts in half the cost of operating engine 17 over that three year period.'",
        "'speaker_3': 'So it's a significant grant under background in the agenda item. We kind of explained the response zones for four engine 17, a very wide area squarely in the center of District four, also directly impacting Districts five and three, also measuring it diagonally from the north west.'",
        "'speaker_3': 'It spans from the Redondo Avenue in the 405 all the way southeast to seventh in Bellflower, a huge, huge area and but citywide. Having engine 17 in place cuts those response times citywide by a huge amount. And within Seventeen's area, it's up to a minute and a half that it cuts down with it with it in inaction'",
        "'speaker_3': '. We also look through an equity lens at the item and we mentioned that. Engine 17 response areas includes a zip code of 90804 and 9081590804 is the most densely populated zip code in Long Beach and Engine 17 response area also abuts the response area of Engine ten.'",
        "'speaker_3': 'Engine ten is located in District six in central Long Beach, and it is one of the busiest engine companies in the city. And when I say that, that that's an historical statement also, I think probably for over 50 years, Engine ten has been either one or two in total number of calls in the area.'",
        "'speaker_3': 'It's critically important because twofold when Engine 17 is not in place. Engine ten is responsible for calling on parts of Engine 17 area. So that takes that very busy fire engine out of central Long Beach out of their area of response.'",
        "'speaker_3': 'The statement of urgency I already mentioned, and that was that this application has to be submitted next week. I also didn't mention in the agenda item, but I'd like to make a statement about the intangibles not measurable, but I think they're very, very important.'",
        "'speaker_3': 'And Station 17 is located right next to the Captain David Rosa Training Center. So every recruit that trains that are training center gets to watch Station 17 on a daily basis. And I think it's critically important that these recruits, these rookies, see a fully functioning fire station, one that includes a fire engine.'",
        "'speaker_3': 'And just as a side note, there are training center. This is a second training center we've had in the city of Long Beach, and it's been there since 1964. The first training center in the city was located right next to Engine Hour Station ten, where those recruits got to see that busy fire engine functioning on a daily'",
        "'speaker_3': 'basis. I'm not going to take my first 5 minutes. I'd like to reserve some time for any type of discussion after and emergency. If you'd like to go to public comment that that works for me.'",
        "'speaker_0': 'That's great. Let's do that. Let's do is there I think we do have one member of the public and then we'll go back to the council.'",
        "'speaker_5': 'Yes, we have Rex Pritchard.'",
        "'speaker_3': 'Yes. Rex Pritchard, president of Long Beach Firefighters. I too want to thank council members, supervisor Alan Price and Turrell for bringing this item forward. It is urgent as the date for submission is this Friday, and this is an urgent action that, again, I'm going to just keep my comments brief.'",
        "'speaker_3': 'Council member Super nine made very good points and our ability to bring nearly $5.2 million to help fund resources. The International Association of Firefighters work diligently with the Biden administration in making the 2020 Safer program even better than it was in 2018.'",
        "'speaker_3': 'And we appreciate everything the Biden administration did in allowing the no cost sharing aspect coming forward so we can support and encourage council members to support this item. Thank you.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'We have a motion that comes from a supernova and it's a second by Councilwoman Price. Councilwoman Price.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I want to support Councilmember Superdog in this item and in supporting this motion. Engine 17 has been a priority for Councilman Superdog for really since since he started his service on the Long Beach City Council.'",
        "'speaker_4': 'And as he mentioned, it services multiple different districts, a number of different diverse communities that have different response needs from the fire department throughout the city. And I think that having a plan for Engine 17 on a short term plan and a long term plan is obviously in the best interests of the city, but also in the'",
        "'speaker_4': 'best interest of our fire department and our residents, because having Engine 17 there will take the stress off of the nearby stations that are now doing a lot of the responding and have been for some time. And the response times, although they've gotten better, certainly need to be a focus and a priority for our fire department.'",
        "'speaker_4': 'So I do know that District three among other districts would be a beneficiary of a long term restoration plan for Engine 17, and therefore I support that item on behalf of my district and of course, on behalf of the city.'",
        "'speaker_0': 'Councilman's in the house. Thank you.'",
        "'speaker_4': 'I really want to thank Council member Steve Bernoff for championing this item. I know that this is something he's very passionate about and I really admire his commitment to maintaining these emergency services in this community. I know that we are really going through a difficult financial situation as a city, but I'm certainly hoping that this grant funding'",
        "'speaker_4': 'will help to address these issues, that we can explore this as an option in providing these services to our residents in the fourth District and the surrounding communities. Thank you again, Mr. Cooper. Now, council members are not for championing this item.'",
        "'speaker_0': 'Thank you for asking.'",
        "'speaker_3': 'Thank you, Mr. Mayor, and to Councilmember Supernova for bringing this item forward. As you all know, in our budget, our discussions in the last year, we had a considerable amount of conversation about super grants in our past super grants and the potential for future super grants.'",
        "'speaker_3': 'We know that this grant comes with some some level of risk. But at the same time, we do value and pride ourselves as being a city who puts public safety as a high priority, and particularly our fire department, as they seek to save lives and be heroes every day in our communities.'",
        "'speaker_3': 'We went through a period of time, I would say ten years ago or so, where they were cuts. We lost an engine 17, we lost engine 12 and rescues as well. In this council, previous council worked through Measure A to restore of many of those services.'",
        "'speaker_3': 'We do not want to reverse course. We want to continue to provide the excellent public safety services that we promised our constituents. Now, this the safer ground is, I understand, a little bit different than the one in 2018.'",
        "'speaker_3': 'I wanted to give the city manager an opportunity to explain the differences between the 2018 SAFER Grant and the 2012, and specifically where we're both the flexibility of how is this 2020 Saber grant more or less flexible than the 2018 Super Grant?'",
        "'speaker_3': 'And, and then allow you to answer that question. But I also want to just make a statement that I think. It is certainly worthwhile to apply for this grant as an option to consider. This is I mean, it doesn't hurt to apply for especially for money from from the federal government.'",
        "'speaker_3': 'We do know that there are strings attached. But this is this is a prudent move, I believe, to to help us outline a strategy moving forward for our fire services. I'm a city manager. Can you answer the question?'",
        "'speaker_6': 'Yes, it does have slightly different scenarios compared to the 2018 grant. It is a little bit more flexible. We've outlined a lot of that in our memo, but I'll have Lynda Tatum talk about the specific comparison between those two.'",
        "'speaker_1': 'Good evening. Council Member Austin and other members of Council. Probably the the two most significant differences in this grant is that it it gives the city more flexibility. As you recall, the last grant had a very specific timeline for performance.'",
        "'speaker_1': 'And in this case, while it does have that same three year timeline for performance, there is the ability for the city to request an extension of the grant without any penalties. The current grant establish essentially says that if you can't perform, you'd have to return the money.'",
        "'speaker_1': 'So that's one significant difference. The other difference is that with the staffing, the staffing level requires you to add in, in this case, the 12 positions. We're asking for it, ask you to add those 12. In addition to whatever the budget positions are, the 2020 grant says it's the the 12 in addition to whatever the staffing level'",
        "'speaker_1': 'that is in place at the time of the grant application. So that again is, is, is, is significantly that's a significant benefit to the city and requires us to add fewer staffing. So those are probably the two most significant components that differ from the grant.'",
        "'speaker_1': 'But overall, we feel that it's a lot more flexible than the 2020 grant provisions.'",
        "'speaker_3': 'Well, thank you for that clarification. And yeah, I have no further questions. So my comments. Thank you.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_4': 'Yes. I thank you, Mayor, and also thank you, Councilmember Supernova, for bringing this forward. And I agree with all of your comments. I'd like to see us apply for this 2020 Safer grant. It's more flexible and it has fewer requirements than previous grants.'",
        "'speaker_4': 'And if we were awarded the ground, it's almost $5 million, which is a lot of money. I do understand some of the risks, given our fiscal position and future uncertainly uncertainties. But nevertheless, I think this grant is a huge opportunity and I am confident that our city staff can find fiscal opportunities to ensure that we can take'",
        "'speaker_4': 'full advantage of this funding opportunity. I know that there's an urgency to get this application done because we have a deadline just right around the corner. But just because we're applying for the grant doesn't necessarily mean that we're going to get it.'",
        "'speaker_4': 'So in the event that we do get it and it gets approved, does that mean that we have to accept the grant?'",
        "'speaker_6': 'Let's remember, this is America. No. So this is an application process. We would then, if awarded, bring it back to the council and you would take a second vote to decide whether or not you're in a fiscal position to accept the grant.'",
        "'speaker_6': 'And we expect that if they stay on schedule to happen in September.'",
        "'speaker_4': 'Okay. Awesome. Thank you very much. I look forward to supporting this.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Happy to support this application. I certainly want to lift up the improvements to the program. I remember, you know, we've we've had this discussion probably over the last decade about the safer grants, the fire safer grants and the challenge that they provide.'",
        "'speaker_3': 'Glad to hear from Mrs. Tatum about some of those improvements. And we want to continue to work with the federal government to continue to improve the program. But I think this is the right thing to do. And Councilmember Supernormal, good job on the tap on the equity lands.'",
        "'speaker_3': 'I really appreciate seeing that your item as a well thought out item and I love the way that you presented it. So I'm happy to support this thing. Thank you.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Thank you, Mr. Super. Nice council member, Superhot. As you know, I've been a champion for the Safer grants since I've been added to the Council. I think it's a great source of revenue to support our first responders and a way to expand.'",
        "'speaker_4': 'I appreciate that we're going for 4.8 million. But if you look at the SAFER website, there are entities and cities that have received significantly more than that. And so if we're going to go in, make sure we know that we're going all in, that some cities get upwards of 8 to 13 million.'",
        "'speaker_4': 'And I know size does matter, but if there is a need that fits in the grant and we're going for it, let's just be sure that we have a really great write up and ask for as much as we actually need and can use.'",
        "'speaker_4': 'And we have a lot of need right now. So thank you. Super not for bringing it forward and I look forward to finding out the outcome.'",
        "'speaker_0': 'Thank you. Councilman Ciro.'",
        "'speaker_4': 'Thank you, Mayor. And I want to thank council member Superman for bringing this item forward. And I'm happy to sign on to support this application to the SAFER Grant. Given the equity lens and its impact in District six without Engine 17, it takes Engine ten, which is as Council member Superman shared earlier out of a very already'",
        "'speaker_4': 'busy and high need area. And so I also just think it's great to explore grant opportunities and to address increasing needs given our current situation with the pandemic. And I really look forward to making sure we meet the deadline and and hearing that we received guidance so that it can come back before council for us to do'",
        "'speaker_4': 'another look at it. So thank you so much.'",
        "'speaker_0': 'Thank you. That concludes council comment. And we have a motion on the second controversy for now. Please, let's catch the votes.'",
        "'speaker_1': 'District one.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District three. I. Catwoman price. I thank you district for.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five. I. District six.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District seven. I District eight.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'District nine. I'm ocean cares.'"
    ],
    "Resolution to Recognize SEIU 2015 Campaign for COVID-19 Vaccination.": [
        "'speaker_0': 'Thank you. Every time certain item 18.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, Councilwoman Zendaya's, Councilwoman Allen, Councilwoman Sara recommendation to request city attorney to draft a resolution recognizing that Carmen the caregiver we can do it campaign.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. So today I wanted to take a moment. We're in a virtual format. We traditionally have a format for presentations and things like that. But I wanted to take a moment. This week, as we're celebrating International Women's Day and recognize an incredible group of hardworking women who are in the frontline of this pandemic, doing'",
        "'speaker_3': 'that essential work necessary to move our communities forward. And their contributions are too often unrecognized, not appreciated. I have the honor of being a father to girls and serve on a city council with with a woman majority. And I believe that's great for our city.'",
        "'speaker_3': 'But with this particular group, you know, I think about my mother, who spent time as a home care worker while my sister and I were going to college and their contributions to society and they have an incredible campaign called We Can Do It.'",
        "'speaker_3': 'That, I think is worth recognition today. Let's go ahead and get started. Okay. So SEIU 2015, its women led union, a diverse group made up of primarily women of color. They're dedicated to unleashing the power of long term care with their families in their communities.'",
        "'speaker_3': 'It's one of the largest groups in the state representing 400,000 central workers. They have a footprint right here in the ninth Council District in North Long Beach. And and they're a great organization in long term care givers of work throughout this pandemic to support our most vulnerable population, particularly individuals with disabilities.'",
        "'speaker_3': 'Now that our vaccine is available to all individuals with disabilities, that we continue to protect our frontline workers that act as a lifeline for these homebound Californians. Let's go to the next. So here's a short video highlighting how this group on Morning America broke three members of the largest long term care union in the country document women'",
        "'speaker_3': 'of color and include over 400,000 essential workers in nursing homes and assisted living centers in California.'",
        "'speaker_4': 'So how are these front line?'",
        "'speaker_3': 'How are you going to be able to hear the audio at all times?'",
        "'speaker_4': 'With us now is the president of the Service Employees International Union Local 2015. April for it. April, thank you so much for being with us. And and our hats off to these caregivers who are going in each and every day truly risking their lives.'",
        "'speaker_4': 'They're up close and personal with their patients.'",
        "'speaker_3': 'They great. So it doesn't seem like we're going to be able to get on.'",
        "'speaker_4': 'From a safe distance.'",
        "'speaker_1': 'So Councilmember Richard, from the audio.'",
        "'speaker_4': 'Trying to do it as safely as possible.'",
        "'speaker_7': 'Thanks so much for having me. It's an honor to be here.'",
        "'speaker_3': 'Our yeah, it's hard for me.'",
        "'speaker_7': 'To you're bearing through this pandemic, just like all of all other Americans. It's been extremely hard. But as you said, our members cannot socially distance. They do close personal, hard work. They touch people for a living, they give care.'",
        "'speaker_7': 'And so for them, they have continued to risk their lives every single day to do the work that they are called to do to care for our most vulnerable people with disabilities, our elders. And they are they are caring love givers.'",
        "'speaker_7': 'And this pandemic has been hard. But we're ready to move on. We're over being victim to this pandemic. It's time for a real fight, a real plan to fight this pandemic, to break the back of this pandemic. And together we can do it.'",
        "'speaker_3': 'Well, a new CDC report is telling us that 62% of nursing home workers still have not gotten the vaccine. Why is that the case? Is there still some hesitation there in getting the vaccine?'",
        "'speaker_7': 'There's a lot of hesitation to get the vaccine. But the story here for me is not about the hesitation. It's about what are the solutions we're going to bring forward to move past that hesitation. I don't believe that we have invested the adequate amount of resources and time to be able to move people past whatever is stopping'",
        "'speaker_7': 'them from getting that shot in their arm. So let's spend the time educating people, talking through their fears and their concerns, having people who are really trusted. Here's something that is not a secret to me. People don't necessarily trust their employers, so we need people who are trusted, respected that are a part of spreading the word about'",
        "'speaker_7': 'this vaccine and getting people over their hesitancy is time for real solutions.'",
        "'speaker_4': 'And April, so you have a vaccination normalization program underway. I see they're behind you, Rosie the Riveter. We can do it. Tell us about this campaign and why you chose Rosie the Riveter.'",
        "'speaker_7': 'Absolutely. Rosie the Riveter, as we know, has been an icon for labor and icon for women like the women in my union. Back in 1942, during World War Two, Rosie was an image of bringing people together, of uniting, to fight during a time that our country needed to come together.'",
        "'speaker_7': 'And for us, we're in a similar moment. And so we are introducing Carmen, the caregiver, and Carmen and her coworkers are standing up to say, we can do it, we can get vaccinated, we can get our communities vaccinated.'",
        "'speaker_7': 'And but most importantly, we are going to move past this COVID moment and say, how are we strengthening our long term care system to make sure we are never this vulnerable again?'",
        "'speaker_3': 'The new administration is still in its infancy. Right. Just getting going a month in here. But how are you seeing things already? Or do you hope to see something very soon just with the new administration that will make a difference and to help that long term health care workers are getting.'",
        "'speaker_7': 'Absolutely. Our members are so proud to have stood beside now President Biden and our very own Kamala Harris from right here in California. It's been a breath of fresh air ever since they came onto the scene because they actually talked to Americans.'",
        "'speaker_7': 'They tell us the truth. They are compassionate and we know they have a plan. From the very beginning, this administration has talked about what we're going to do to come together, to end this virus, to end this pandemic.'",
        "'speaker_7': 'And we're going to unite and we're going to do it together. So we're really proud at the promising signs that we're seeing from the administration, and we're ready to roll up our sleeves and get to work. Our president and vice president cannot do this alone.'",
        "'speaker_7': 'It's going to take all Americans and the 400,000 members of SEIU Local 2015. We're ready for the fight. It's our moment.'",
        "'speaker_3': 'It's been you all's moment and you all have been. And doing it quite admirably over this past year or so. Thank you so much to all your members for what you all are doing. April, the president of SEIU Local 2015, thanks so much.'",
        "'speaker_3': 'We'll see you again. All right.'",
        "'speaker_7': 'Thank you. Bye bye.'",
        "'speaker_3': 'All right. And I know that folks could hear it on TV and our grandkids hear it on WebEx. And I understand we're going to make sure we correct that for the future. But I wanted to take a moment to recognize this campaign of Carmen, the caregiver.'",
        "'speaker_3': 'And this recognizes it pays homage to Rosie the Riveter World War Two icon that we lifted up in here in the city of Long Beach, who symbolized American women, who went to work in factories and shipyards to replace men who had joined the military.'",
        "'speaker_3': 'And so when working women of America then and now find themselves at the center of an existential crisis facing our country and are called upon to be heroes, to help our nation survive. And this campaign is really about vaccine normalization, particularly within our communities, our diverse communities and vaccine equity.'",
        "'speaker_3': 'Let's go on to the next line. And so these are the images of Carmen, the caregiver. She's strong. She's the first you see that sticker on her arm. And she is really encouraging people to make sure that, you know, we we bring in some confidence and public trust in our public vaccination process, but also calling on, you'",
        "'speaker_3': 'know, calling our institutions to make sure that we promote mass vaccination the right way to ensure that our our country is strong and our communities can recover. Let's go to the next part. It's also the high level goals.'",
        "'speaker_3': 'Target Cogat impact the communities on establishing network of distribution and preparing Long Beach. We're already doing a number of these things, and these are things that that SEIU 2015 is encouraging all communities to do and organize and facilitate distribution in a way that utmost confidence in the vaccine process.'",
        "'speaker_3': 'And these are these are great values. The lobbies is upholding a number of these things. We can always do better, particularly as we get into further phases of the vaccination process. And let's go on to the last part.'",
        "'speaker_3': 'And so and so this is a great slide. This is how we can do it means we can beat the virus. We can do it means we can repair and improve the long term care system we can do it means we can honor the essential workers in the nation's frontline heroes of the pandemic.'",
        "'speaker_3': 'Great, great. So we can do it together. We can take down the presentation. And so I wanted to just take a moment to recognize this group. And and as the city council passed a resolution in support of this, incredible, we can do it initiative.'",
        "'speaker_3': 'And so I think I know that we have a number of folks here to speak on. And so I think we'll we'll go through some public comment and we'll go through council comment and then we'll go and hear from the public.'",
        "'speaker_3': 'And so I'm looking to Mayor Garcia. Are you still here? Do you believe are you still here? Do you have the Q? Okay. We're going to just have the council. So I'm going to make this motion for a second.'",
        "'speaker_3': 'We're going to do both.'",
        "'speaker_4': 'I I this is councilwoman Sunday. Has that cued up to second. But I don't know.'",
        "'speaker_3': 'Okay. They recognize the second. Do you want to go ahead and get your comments now?'",
        "'speaker_4': 'Yes. Thank you. Vice Mayor, I just wanted to thank you friend from the very bottom of my heart for bringing this item forward tonight. And also to everyone. Happy International Women's Day. I'm so excited to be signed on to this item that is so important to me personally, but also to the disability community as well.'",
        "'speaker_4': 'And the work of these home caregivers is absolutely essential. And and and is is being done for so many of our most vulnerable residents that rely on them for their everyday health and safety. And I know they have been.'",
        "'speaker_4': 'In, you know, risking their life for over almost a year now through this pandemic, not only feeling can't, you know, contracting the virus, but also exposing their families to them. And on top of that, exposing their clients to them, because I think that that would be so, so hard on them, because these are persons that they care'",
        "'speaker_4': 'for and that have so many, so many underlying conditions. I know that personally my caregivers have teased with me saying, You know what, Mary? Maybe I, maybe I should work from home next week. And I just look at them like, okay, you know, because that's not an option for them.'",
        "'speaker_4': 'They really have their clients lives in their hands and people really, really rely on them, and it is our duty to protect them. I'm so excited for this idea and I'm hoping that we'll be successful in passing this resolution because I think it'll go a very, very long way and we will be able to save so many'",
        "'speaker_4': 'lives in our community alone. So thank you again, Vice Mayor Richardson, for bringing this item up.'",
        "'speaker_3': 'Fantastic. Thank you. Council member Next we have council member Sara.'",
        "'speaker_4': 'Thank you, Vice Mayor. I just want to thank you for bringing this item forward so that we can acknowledge the very hard working, front line in-home care providers and our nursing home workers who have been really just the hardest and most passionate, compassionate people of knows that they have to go in every day regardless of the dangers'",
        "'speaker_4': 'that they face. And they appreciate us lifting up many of the women as well as men in the front line, and that we're doing this in honor of International Women's Day. And I just want to thank SEIU 2015 for their amazing work that they do.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Thank you. Next, we have council member Urunga. But you HMRC have accused you of. First of all, I want to thank you for bringing this forward. I mean, it's a great acknowledgment that the long term care facility workers were in the frontline of the whole the pandemic.'",
        "'speaker_3': 'It was the long term care facility that were first hit the hardest with this pandemic. And these workers are heroes, and no question about that. They're warriors. And they really feel proud that this pandemic straight on and being that it is International Women's Day.'",
        "'speaker_3': 'And let's keep in mind that there are many women all over the world who are not only sacrificing themselves, but sacrificing their families as well when it comes to civil rights and human rights. So thank you again for bringing this forward and happy, happy International Women's Day.'",
        "'speaker_3': 'Thank you, Councilmember. Next, we have Councilman Alston. Thank you. And I want to thank you for bringing this item forward. I want to salute the women, but the members of SEIU Local 2015 with a courageous work day in and day out, providing care and dignity to those who often can't care for themselves.'",
        "'speaker_3': 'You know, on a personal note, I have a close family member who is cared for by a SEIU 2013 member. And my, my, my, my, my cousin is developmentally, developmentally disabled and his caregivers have for his entire life have been part of our family.'",
        "'speaker_3': 'And I have the distinct honor of actually had the opportunity to work with real Rosie the Riveter back in, you know, 25, 30 years ago in the Carl Douglas. And it's ironic that during World War Two, Rosie the Riveter really helped us, you know, boost up our manufacturing base.'",
        "'speaker_3': 'A lot of that was based here, right here in Long Beach. And without that workforce, you know, we may not have prevailed the way we did as a country. That was a major crisis in our country. In the US, today's crisis is a world crisis.'",
        "'speaker_3': 'But the pandemic of COVID 19 and and the frontline workers, being those caregivers in long term care facilities and individual homes, really helped get people through. And so these are heroes and they should be saluted. And and I really like the irony of this.'",
        "'speaker_3': 'Just saw this item coming to an end. Women's History Month celebrating, but it's Carmen, the care giver. Thanks. Thank you, Councilmember. Next, we have council member Alan.'",
        "'speaker_4': 'Yes. Thank you, vice mayor. I just really appreciate your work on this and just thank you for bringing this forward. I'm just so happy to co-sponsor this item that promotes mass vaccinations. And so we just must continue to encourage support and normalize mass vaccinations in every way.'",
        "'speaker_4': 'And I, too, want to thank SEIU 2015 for their work on this. So happy to support this effort that will protect women and happy International Women's Day. And just one last thing. We can do it.'",
        "'speaker_3': 'Thank you. Council member. Next, we have council member Mungo.'",
        "'speaker_4': 'Thank you. I want to thank SEIU and the women that have really served us so well over the last year. They show up every day and they do the great work. And I think this is an amazing campaign and great work.'",
        "'speaker_3': 'Thank you. That's not a side council comment. And can we go to. Now, can we go to public comment?'",
        "'speaker_5': 'Yes. Our first speaker is Sally Inder. Okay. Sally? Yes. Please begin.'",
        "'speaker_2': 'Hi. Um, so in my home, we've been waiting and hoping for more Long Beach residents to be vaccinated as a care provider to my child. Although in-person school hasn't offered, we have had to decline because we do understand the seriousness of the virus.'",
        "'speaker_2': 'And if that means that my child has to stay home and we have issues keeping him online, that's what it means, because this past December, my immediate entire family had been infected with the coronavirus. And they have very severe symptoms because because they live together, because they are low income, they have to live with my grandmother.'",
        "'speaker_2': 'She's been a long time local business owner in Long Beach, and she had to remain open when possible. So she have brought the corona virus to the rest of the family. Luckily, I don't live with them. My child doesn't live with them, so we were the only ones who didn't get it.'",
        "'speaker_2': 'But we definitely understand the severity of it. And I'm currently working as a health screener and I'm hoping that as we get more vaccinations in Long Beach that we'll see a turn of results that makes it safe for people to return to work, return to school and live their lives in person, and giving people the choice to'",
        "'speaker_2': 'go back in person. Fluff is. Hello? Is everybody still there?'",
        "'speaker_5': 'Yes. Your time is concluded. Thank you.'",
        "'speaker_3': 'Oh, I.'",
        "'speaker_5': 'Our next speaker is Kelly Ellis.'",
        "'speaker_2': 'Yes, I'm here.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'This is Kelly Ellis. Did you call me?'",
        "'speaker_5': 'Yes. Kelly. To my name, please begin.'",
        "'speaker_2': 'Yes. Um. I already have the corona vaccination. I just completed my second one this past Saturday. And I was leery about giving it at first, however.'",
        "'speaker_3': 'I figured, you know.'",
        "'speaker_2': 'What can I do? Just go in here and get the vaccination.'",
        "'speaker_3': 'The first one I have. I didn't have any. Side effects.'",
        "'speaker_2': 'But the second one, my arm was. It was about maybe the following day. My arm was a little sore and there was a chin. And then, you know, I felt like I had like some flu symptoms. Now I felt better now, which I'm glad I.'",
        "'speaker_2': 'Got it. Because I also.'",
        "'speaker_3': 'Do other things outside.'",
        "'speaker_2': 'The house. Besides, you not allowed to go to the grocery store and do other things for my client who I live with and want to bring.'",
        "'speaker_3': 'Home anything to her. I always wore.'",
        "'speaker_2': 'My mask, my gloves. I still think as caregivers, we should also be supplies. Those are disposable gowns, which will help a lot, especially we go out and do like, you know, washing the clothes and grocery shopping.'",
        "'speaker_3': 'Even though.'",
        "'speaker_5': 'Think your next speaker is Martha Vila.'",
        "'speaker_2': 'Hi. Good evening. I am a member of SEIU 2015. I have been a home care provider for almost 13 years now due to the pandemic. I lost three family members within a period of 22 days. I lost my mother.'",
        "'speaker_2': 'My brother and his wife, which now they have left behind. Eight their only 15 year old son for whom I'm seeking legal guardianship as he has no more relative family close to him. And I am thrilled to see my city supporting the work I have done through this pandemic.'",
        "'speaker_2': 'My fellow caregivers and I have worked recently, mostly over the last year in the face of this virus, and the vaccine is our only hope for a return to safety and normalcy. Knowing that the city is supportive of this need to protect us is a relief after a year of living in fear.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Wendy Duchin.'",
        "'speaker_2': 'Hello?'",
        "'speaker_5': 'Yes, please.'",
        "'speaker_2': 'Begin. Hello. Thank you. Thank you. My name is Wendy Duchin. I'm with SEIU 2015. And I would like to thank you, Vice Mayor Richardson and the entire city council and the city of Long Beach for really taking this step in, in taking this decision, in adopting and supporting a resolution that as a testimony that you have heard'",
        "'speaker_2': 'or you're going to hear the life changing situations for many of our caregivers and their families. So we want to thank you on behalf of thousands and thousands of members in the city of one, because we like to thank you for supporting and really treating us like essential workers, but also heroes of this community.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. Give us a moment when we transition to the Spanish portion of public. Our first speaker is Claudia Horace.'",
        "'speaker_3': 'Gloria Juarez.'",
        "'speaker_5': 'Claudia Juarez.'",
        "'speaker_2': 'Can you hear me? Yes.'",
        "'speaker_3': 'Begin. Put up as evidence.'",
        "'speaker_2': 'See mucho. You ask me. No worries. Claudia Juarez professional, the local SEIU been picking. So you get all that. Let's get Gracias. As we sell their recs for support, you are recognized and supported from whatever reason. Socialists and Democrats get most of our phone and collect.'",
        "'speaker_2': 'You get all good ideas that, for example, Europe and the mechanisms by which I got here.'",
        "'speaker_3': 'And yes, thank you very much. My name is Claudia Juarez. I am a member of SEIU, the 2015. And thanks to the vice mayor for his recognition and this entire group, because these workers are really angels, are true angels, and they are supporting our society.'",
        "'speaker_3': 'So thank you very much for all your support from the bottom of my heart. Thank you.'",
        "'speaker_5': 'Our next speaker is Gabriela Gutierrez.'",
        "'speaker_3': 'Areola with the rest of the London.'",
        "'speaker_2': 'See. Also want to start of this year, April, I hope I don't indicate to you guys there are going to be sweaters which are in certain circles e but are so simple yet amplification is fun. These La la canal Kobe at La Quinta but at the near massive rally that ensues here that if that are established they'",
        "'speaker_2': 'don't have record economy to go into in because it will be Muskogee. I will just reallocate a vignette you left me for, but then you can set it up. A cuatro is an embargo theme so it could open soon for you're for.'",
        "'speaker_3': 'Hello. My name is Gabriela Gutierrez and I am a member of SEIU and I want my voice to be heard before this council meeting. And I appreciate this opportunity and I really would like to see an increment and having a more aggressive COVID vaccine vaccination for everyone to increase the safety in this society and also to stimulate'",
        "'speaker_3': 'the economy again to get the economy moving. In my home, everyone had COVID, even though we were all trying to protect ourselves and I was going out with protection all the time. And my father was a victim of cancer at the same.'",
        "'speaker_3': 'Time continues and you're out the virus.'",
        "'speaker_2': 'The cookies from the lemonade was so good. But I could tell those investors the evolve. Some of my strong kilos are in the supermarket. C'est la vie. Superar. But also to stick with Amazon a lot better. Saw nothing to look at.'",
        "'speaker_3': 'I believe that vaccination will be the safest and will be the best way for the society to relaxed, for people to go to the store, to go to the market, particularly us that would take care of people. We must go to the market to provide for them.'",
        "'speaker_3': 'Continue. What?'",
        "'speaker_2': 'See. Yeah. So yeah so gay in study animals in law and police in Sudan. Massive good are better certainly important to me but I thought the people that were honest.'",
        "'speaker_3': 'And these we are going to have a safe city and we're going to have a safer nation. And I think that this is important that we vaccinate everyone in this city.'",
        "'speaker_5': 'Thank you. Which addresses our next speaker is Maryellen DeRose.'",
        "'speaker_3': 'Marylanders.'",
        "'speaker_2': 'When I start this, I mean this material, and it'll save me. I'm glad to see you got making it.'",
        "'speaker_3': 'When I thought of this man on my good afternoon. My name is Maryland Theros. I am a member of SEIU 2015.'",
        "'speaker_2': 'Continue what Iris said in the last few days, a lot of which in proposito the ME participant is put up with evil in my favor.'",
        "'speaker_3': 'And I am a resident of the city of Long Beach. I am a neighbor. And the reason why I'm here is to ask you, please, for a massive vaccination against COVID 19.'",
        "'speaker_2': 'Again, we stress you that you're aggressive. Obviously, we made up the whole family.'",
        "'speaker_3': 'And here in this city dance, God, I received the first dose of the vaccine, but my children did not yet.'",
        "'speaker_2': 'In my opinion. Goodell de la Vacunacion must see the city a positive to improve this area. Familia is complete.'",
        "'speaker_3': 'And I believe in my opinion that massive vaccination will protect the entire family and the entire city.'",
        "'speaker_2': 'But it seems I meant they were always able to give this award to another man. There are no poodle dresses with La Vacuna.'",
        "'speaker_3': 'Fortunately, today we buried an acquaintance of ours and he would not receive the vaccine on time.'",
        "'speaker_2': 'Still we're still waiting for these young, supportive service.'",
        "'speaker_3': 'Perhaps his life could have been saved, but we're not going to know that.'",
        "'speaker_2': 'But if our business had domain considered us to do so.'",
        "'speaker_3': 'Please, I take. I ask you to take into consideration massive vaccination.'",
        "'speaker_2': 'Moto graphics for full attention.'",
        "'speaker_3': 'Thank you very much for your attention.'",
        "'speaker_5': 'Thank you. Your next speaker is Aurelia Mendez.'",
        "'speaker_3': 'Aurlien mendez.'",
        "'speaker_2': 'Yeah. We invest. We want to meet. So we have already this in the Sindicato Azteca. Eat those milking.'",
        "'speaker_3': 'And I would have to know. My name is Aurelia Menendez and I am a resident and neighbor of Long Beach. And I am a caregiver. I am a member of SEIU 2015 continuing.'",
        "'speaker_2': 'In itself. I think it's a miracle opportunity that we have left here beneath the total aspersions on us for that interactive concert of coronavirus in a facility at the corner of they more about taking a look here.'",
        "'speaker_3': 'And in this location in which I am the opportunity to speak up, I ask if we have vaccination available for all and especially for those that do not have the knowledge to access technology.'",
        "'speaker_2': 'You silly person. If you consider you don't see the point of supporting them for not being the Pope of the course of the pandemia. And the government recommended a canonical.'",
        "'speaker_3': 'And this group of people usually is the people that have has a very difficult time trying to access the Internet or even using the telephone. And there at the same time, people with very low income and they're the victims of the pandemic in the most part.'",
        "'speaker_3': 'Go ahead.'",
        "'speaker_2': 'You get kids to go Muslim in the UK, citizens and other organisms, radical forces, they will see impressionable. Mr. Maxim with caution. Mr. Laborde. But are you there on as good as you have? Possibly.'",
        "'speaker_3': 'And I ask you to keep on supporting us the way you are supporting us all the time. Our job is not an easy job, but we do it with love, with dedication, and we always need your support. So thank you very much for this opportunity.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. And we're going to go ahead and go for our roll call vote now. District one.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'District two.'",
        "'speaker_3': 'I saw three.'",
        "'speaker_5': 'High District for.'",
        "'speaker_3': 'I District five.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'District six.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'District seven.'"
    ],
    "Presentation on Care Closet LBC by Duke Givens.": [
        "'speaker_3': 'I. District eight. All right. District nine. I know she cares. Thank you. Number 17, please. Communication from Vice Mayor Richardson, Councilwoman Allen, Councilwoman Sato. Councilman Austin. Recommendation to receive and file a presentation on Care Closet LBC. Thank you.'",
        "'speaker_3': 'This this this is a presentation. And like we said, in this virtual moment, it's hard to do recognitions, but when someone steps up and does something important, I think it needs to be deserved to be recognized. This pandemic has been difficult for our entire community.'",
        "'speaker_3': 'We've seen impacts on our city. We have to do more with less. And we've seen the impacts from Caltrans and trash piling up in different areas. We've seen this pandemic exacerbate our homeless crisis. We've seen a lot of, you know, individuals with a lot of.'",
        "'speaker_3': 'With with a lot of pain. And so Duke Gibbons is a community leader who saw me sprung into action. And and and from that simple standpoint, you know, he's really inspired a lot of people to step up, clean up their own communities and to help be more compassionate with individuals experiencing homelessness.'",
        "'speaker_3': 'And so I'm going to introduce a video and then I'm going to have the brief, brief comments from Duke at Duke Gibbons. But really, the point here is this is a grassroots effort. The grassroots effort. And we're we're acknowledging the spirit of this effort to step up and create a wave.'",
        "'speaker_3': 'And we see it. We want to embrace it, help formalize this structure in our experience. Let's go ahead. We shouldn't have. Hello, everybody. To those of you who do not know me, my name is Duke Gibbons, and I'd like to say thank you for allowing me to present this small little video to you.'",
        "'speaker_3': 'Over the past few months. I have gotten with some of our homeless brothers and sisters in our riverbeds and other communities, and we started doing a major cleanup. COVID 19 really hit us hard. And in this season right now, we're working diligently to clean up our river beds and other locations in our city.'",
        "'speaker_3': 'I would like to share with you this small video. Thank you. Enjoy. Somebody burned his whole camper actually up at. Hear about another friend of mine named Ziggy. Somebody burned his as well. Hey, Long Beach. The question is posed.'",
        "'speaker_3': 'Ask not what Lambie's can do for you, but what you can do for Long Beach. Over the past few months, myself and a few other amazing people that live in our community that are homeless have been getting together and working with the issue of trash in our riverbed and on our entrances and exits of freeway.'",
        "'speaker_3': 'With that said, I'd just like to thank our city council, our mayor, our city manager, all those who are diligently putting up the effort to fight homelessness first and foremost, and secondly, working on comprehensive housing solutions. With that said, your brother has been out there right now, boots on the ground working to clean up our streets in'",
        "'speaker_3': 'a major way. To date, we've collected over 4,000 of trash out of our riverbeds and other locations. That's what we can do for Long Beach to help her bring her back to the beauty that this town deserves and what she represents.'",
        "'speaker_3': 'All right. Thank you. And at this point, I want to be recognized to do our bit of time to honor you and get your comments. You got. I'm sorry. I'll try again to. You don't. That's out on my left hand side.'",
        "'speaker_3': 'It seems like the audio is working, but we got four comments in the video and we just wanted to receive this presentation. Again, this is really a gesture to acknowledge the effort. I know it's a volunteer grassroots effort.'",
        "'speaker_3': 'I know that, you know, there is more that we can do to formalize this structure. I think it sends a good message to the city to step up and be a part of the solution. You know, help do what you can to keep our community together and help support those who are hurting.'",
        "'speaker_3': 'And that's really why we want to lift up and recognize you. So at this point, I'm going to have comments from the city council and I'm going to make the motion and I'm the first person shooter is council member uranium.'",
        "'speaker_3': 'Thank you, Vice Chair Richardson and I had the opportunity to visit with Duke over the weekend, and we went to a couple of the camps, to the homeless encampments that were along the L.A. River and the freeway. And I got to tell you, it is a experience.'",
        "'speaker_3': 'One of the most impressive parts of that little tour that I took with him is that we had these preconceived ideas as to who are the people where a lot of these river beds we think about people with.'",
        "'speaker_3': 'Or have mental issues or other addictions. And I'll tell you, the people that I met were so kind. We're so friendly or so accommodating. We are able to greet and talk to you and tell you about what's going on with them and their lives under the bridges or along the river here and the freeways.'",
        "'speaker_3': 'But as Duke is doing God's work, he has communicated with these individuals. He has built trust among them, and they see him become the boss of it because he is not only offering opportunities for them to clean up their vacations and their places, but he's offering them some some compensation for it as well.'",
        "'speaker_3': 'They're looking forward. They look forward to work. They look forward to helping clean up the river, clean up the freeway. And it was one of those enlightening experiences that just gives me a different perspective as to what he's doing.'",
        "'speaker_3': 'And I want to thank you for allowing me that opportunity to enjoy him. And if there's any way that the city can provide him with support and help, I. He asks for it. Trash cans. Yes, for the porta potties to clean up.'",
        "'speaker_3': 'And I wish we could. And perhaps one day we came out of that where it would be part of our infrastructure to provide assistance, to continue the ritual. So perhaps we can also look at our mercy and how we can improve services there as well.'",
        "'speaker_3': 'That did come up in our conversation. So do hats off and congratulations and excellent job doing and you know that are there you will be before and I'll be worried having to put my jeans on backwards and that's why I feel good work.'",
        "'speaker_3': 'Thank you so much, sir. Thank you. Thank you so much. Thank you. Duke Now that the audio is here, do you want to give your comments now? Yes. I'd just like to thank you all for giving me this small time.'",
        "'speaker_3': 'I'm a long beach rather than born and bred. Went to poly. Went to the Air Force. Went to lobby City College, worked for Long Beach, tried for over 20 years, and I've had a chance to work with some of you all as well.'",
        "'speaker_3': 'And that tagline, asked about what lobbies can do for us that we can do for Long Beach, is truly something that is true in my heart. And being able to get some experience and some form of structure from you all to help me with this endeavor, I think would be a great move forward to assist our brothers'",
        "'speaker_3': 'and sisters in these communities. Thank you. All right. We have a few more council members. Next in line is council member thoro.'",
        "'speaker_4': 'Thank you, vice mayor, for bringing this item forward to acknowledge and showcase the work that care closet LBC does. And thank you to you for your just hard work and commitment and passion to serving and finding solution and empowering our our most overlooked members of the community.'",
        "'speaker_4': 'You know, my office recently made a contribution to the organization and hopes that it continues to further the work that that is being done to lift up and empower our houseless community members and to help make this what you use as a tagline that that I love to is little by little, because I think you are a'",
        "'speaker_4': 'person who sees no effort is too small and that all of these little efforts together does make a huge difference. And I look forward and continue to find ways to work with you and and, you know, and however we can make sure we're doing little by little to do a lot together.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'And thank you so much as well. Thank you. Next in queue is council members and they are.'",
        "'speaker_4': 'Thank you, Vice Mayor Duke, I just wanted to give you a huge thank you for all that you're doing for our community. I think that this is so humbling of you and also, you know, thinking about our neighbors who are houseless right now and giving them the opportunity to feel empowered and giving them the opportunity to to'",
        "'speaker_4': 'just, you know, social while at the same time doing a good deed is something that is very respectable. I think that the work that you are doing is incredible. Keep up the good work and I look forward to being able to support you and your organization in any way that I can.'",
        "'speaker_4': 'I know that I am continuously committed to making sure that we find permanent homes for our houseless neighbors. You know, that is one of my greatest goals. And and even though things are not done overnight, I wish they could be.'",
        "'speaker_4': 'I think that what you're doing is something that is very commendable. And again, I look forward to working with you and continuing your your efforts. So thank you again.'",
        "'speaker_3': 'You're welcome. And that's our new mission will be for all of us, little by little. Thank you so much.'",
        "'speaker_4': 'Little by little, I love.'",
        "'speaker_3': 'Thank you. Next, we have council member Austin. Thank you. And this presentation actually hit really close to home. Duke is a personal friend. He is a awesome photo artist. Is that tell you every time you meet him that you graduated from poly?'",
        "'speaker_3': 'So he loves this city and he can add to his list of accomplishments. Now, as a humanitarian, somebody who's actually doing the work, rolling up his sleeves and making a difference every day in our community. Duke accompanied me several months ago as we were doing some homeless outreach along the railroad tracks on Union Pacific Railroad.'",
        "'speaker_3': 'And I have, you know, just over the last couple of months, witnessed firsthand the clean ups and the just amazing efforts happening in our grassroots happening efforts happening in our city. You know, Duke has really, really inspired trust from a community that doesn't let too many people in.'",
        "'speaker_3': 'He has extended dignity and hope to a group of folks who have been forgotten in many respects. And I just want to mention that the care closet was has not been in existence very long. This is a very, very young nonprofit, but one that is effective.'",
        "'speaker_3': 'And and if you just weigh the volume of the work, he's doing the work in the short period of time, in two or three months, that many organizations and many resources haven't been able to match in years. And so, you know, the amazing community efforts that have had an opportunity to witness at the expo where the sleeping'",
        "'speaker_3': 'bag drive and and supplies that are coming in, it's just breathtaking when you see the amount of community support behind this effort. Duke, you you you met your colleague. And I think on behalf of the residents of the district, I know we all are talking about meeting your accolades right now, but I want to extend my appreciation'",
        "'speaker_3': 'and encourage you to continue on your mission. I know that you know from. Programs like this are not sustainable unless other people get involved, unless we are able to put structural resources behind them to to to continue. This is a model that is that is a new model.'",
        "'speaker_3': 'That is a necessary model. But one thing that I can say about it, it is clearly an effective model because it's visible, it's clear our freeway, our ramps are are cleaner, our underpriced passes are cleaner. And the people engaged in this are individuals who have been on the streets and understand the and understand the the culture of'",
        "'speaker_3': 'of of of homelessness. And so to work is something that I certainly support. I would ask that my colleagues support and I look forward to working with you on do for many months and years to come. All right.'",
        "'speaker_3': 'Next, we have council member Alan.'",
        "'speaker_4': 'Thank you. Will Vice Mayor Richardson, for putting this item forward. And one thing I have to say is do given it's just an inspirational leader in our community and he has been doing amazing work for a long time.'",
        "'speaker_4': 'And I and Duke, I still have the lobby's pollie hat that you gave me years ago. And it's hanging in my council office right now. And I know, just like me, I think we loved graduating from from Polly.'",
        "'speaker_4': 'But but you know, Duke, you just been are a role model. You've been an incredible advocate for the homeless community. Just thank you for all you have done in Long Beach and for all the opportunities that you have created for people that really need it.'",
        "'speaker_4': 'And like Councilwoman Sara said, helping people that are so often overlooked. Just great work, my friend. Just much appreciation for all that you do.'",
        "'speaker_3': 'Fantastic. The you heard it. No doubt, my love here on this council, we certainly all recognize vice mayor. Yes.'",
        "'speaker_2': 'This is Councilwoman Price. I queued up.'",
        "'speaker_3': 'About 40 minutes.'",
        "'speaker_2': 'Ago.'",
        "'speaker_3': 'Okay. It wasn't set to go forward. Councilmember.'",
        "'speaker_2': 'Thank you. So I want to thank you for coming and presenting to council this evening as well. I did have the opportunity to go out and visit him as well, like my colleagues did, and I know that he and so many others, I know there are residents in my own neighborhood.'",
        "'speaker_2': 'My neighbor is very, very involved in these efforts as well. And I think, you know, the more the merrier in terms of responsible and structured programs to help us get to where we want to be as a city where we're providing opportunities and cleaning up these, well, visible corridors.'",
        "'speaker_2': 'I know that my office worked with Duke to get him registered as a city vendor, and I know that there's other some other formalities that Duke would have to go through. And I think any nonprofit that's doing work like this should definitely reach out to the city so that we can figure out how to combine the efforts'",
        "'speaker_2': 'of our nonprofits with some of the goals that we've set in the city. I know one of the programs that we have and I could talk to Duke about this that I feel very passionately about and I presented to council was our homeless work program that got started and then got a little bit of a pause because'",
        "'speaker_2': 'of COVID, but that's starting up real soon. So I think my question would be to city management. Would it be possible to connect Duke with our once work program so that they can provide who can help provide some jobs to people who might be interested in those opportunities as he goes through accomplishing the goals of the nonprofit'",
        "'speaker_6': '? Yes, absolutely. That RFP is getting finished pretty soon, should be out and we would love do to apply for that. And we've actually done some outreach to realize and there is a newer nonprofit just to help give him a little bit of assistance too on the kinds of things that we would need to have somebody award a'",
        "'speaker_6': 'city contract to so he can get prepared for that. So, yes, I think it'd be a great opportunity for him to apply.'",
        "'speaker_2': 'That's great. Thank you. And so, Duke, I know you and I have talked and I know you're going to pursue that. And I just want to thank Lisa West from my team, because she really worked hard to make sure that all the paperwork and everything was processed to become a city vendor.'",
        "'speaker_2': 'But I think the type of work that you're doing is amazing. And I applaud you and so many others in the city that are doing this kind of work. And we are here. I think I can speak for all of us to say we're here to utilize whatever resources we have in the city to help people structure'",
        "'speaker_2': 'nonprofit so that we can utilize public resources to effectuate some of the goals that we share in common. And I'm grateful for the work that you're doing, and I thank you for inviting me out to see your work and sharing a little bit about it with me.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Right. Thank you. I see no further comments from the council. I just wanted to close by saying, you know, there's you know, every once in a while you need to lift up those who inspire others of what you've done to hopefully serves as an inspiration.'",
        "'speaker_3': 'Everyone can make a difference. You clearly from the comments here, you've heard that you've inspired the council, you've received a lot of comments here. But this is you know, this is recognition of what one person can do to help create a ripple effect, to multiply the impact that we have on the community.'",
        "'speaker_3': 'So we all just thank you for your friendship and for your service to our community. Let's go ahead to public comment now.'",
        "'speaker_5': 'There is no public comment for this item.'",
        "'speaker_3': 'Fantastic. All right. Let's go to a roll call vote.'",
        "'speaker_1': 'District one by district two.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'District II.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. I. District six. I. District seven. By District eight.'",
        "'speaker_3': 'Right.'"
    ],
    "Resolution in Support of Harassment Complaints Against Metropolitan Water District Southern California.": [
        "'speaker_1': 'District nine. I know. Curious.'",
        "'speaker_3': 'Thank you. Let's have item number 19 to.'",
        "'speaker_1': 'Communication from City Attorney recommendation to adopt a resolution in support of employees who have filed complaints of harassment by various employees of the Metropolitan Water District, Southern California, and supports the call for a joint legislative audit committee citywide.'",
        "'speaker_3': 'Thank you I think we're going to have a motion from counsel disagrees that correct. Okay. I'm interpreting this as a motion for Council District three in the second by Council District. A very public, public comment here. Councilmember Price, you want to speak on this?'",
        "'speaker_2': 'No, thanks.'",
        "'speaker_3': 'Okay, great. All right. So let's go ahead. The roll call vote with.'",
        "'speaker_1': 'District one, district two. I District three. High District for.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'District five.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District six. I. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District nine, i motion carries.'",
        "'speaker_3': 'Fantastic. Well, that satisfies our agenda and will go to any closing comments from the members of the council. Council member Sara.'"
    ]
}