{
    "WITHDRAWN Adoption of Fiscal Year 2015 Budget. ": [
        "'speaker_1': 'We're going to vote on on if the tonight's the first night the council is able to vote on any of the budget resolutions if if they would like. And on that, I'm going to turn this over to Mr. West so we can continue.'",
        "'speaker_1': 'I believe we're hearing also some from the port as well as financial management tonight. So. Mr. West.'",
        "'speaker_3': 'Yes, Mayor, council members tonight we're going to hear budget reports from the harbor. That's the director, John Slinger up. And then that'll be followed by our finance director giving the finance department report. John GROSS So, Mr. Slinger.'",
        "'speaker_1': 'You're up. Thank you. Good afternoon. Mayor Garcia and members of the city council. I'm John Slinger, chief executive of the harbor department. Pleased to be here. And with me is Steve Rubin, who is our head of finance and administration, as well as Noelle Hasegawa, who runs our trade and communications organization.'",
        "'speaker_1': 'I'd also like to introduce Samira Ashley, who.'",
        "'speaker_4': 'Serves on.'",
        "'speaker_1': 'Our. Government Relations group. Thank you very much for the opportunity to present the Harvard Department's fiscal year 2015 budget. We are proposing a budget of nearly $858,000,000 million for the coming year. Our proposed spending plan is down about 16% from last year's budget, and this is largely due to the pace of our capital spending, which has slowed'",
        "'speaker_1': 'slightly from the pace of last year's record capital program. Still, the proposed budget is among our biggest ever. Approximately two thirds of the budget is comprised of capital improvement programs. And to remain competitive, the Port of Long Beach needs to continually reinvest in major facility upgrades.'",
        "'speaker_1': 'Our capital program leads the U.S. port industry totaling more than $4 billion this decade alone. In the process, we're creating thousands of much needed jobs in Long Beach and throughout Southern California. This is a summary of how we spend or how we plan to fund our fiscal 2015 expenditures.'",
        "'speaker_1': 'There's five categories that I'm going to be going through in detail, slide by slide. The largest source of funding is our operating revenue, which comes from the leases and fees we charge for use of our facilities. We expect our operating revenues to remain on par with what we forecast for this year.'",
        "'speaker_1': 'Vessel operators are still struggling to rebound from the 28 recession. And this is especially true with the container cargo business that accounts for the majority of our revenue. Several major shipping lines are forming new alliances that could move calls from one port to another.'",
        "'speaker_1': 'These evolving conditions create both market uncertainty and potential opportunity for the harbor department. Based on these unknowns, however, we've made a very conservative forecast projecting flat revenue growth for fiscal 2015. Our second largest source of funding is NONOPERATING revenues.'",
        "'speaker_1': 'These are generally grants from state and federal agencies, and in the coming year, the largest grants will be for the ongoing construction of a replacement for the Gerald Desmond Bridge. Of the projected $1.3 billion total cost of the bridge project approx.'",
        "'speaker_1': 'Approximately 800 million will come from grants in the near future. We'll be hosting an event to celebrate the next major milestone of the bridge project, the construction of the foundation upon which the bridge will stand. It's going to be a very exciting event to host.'",
        "'speaker_1': 'Other remaining sources of funds. 53 million will come from the state. I'm sorry, from the sale of the last of the port own gantry trains. And with this transaction, all of the ship to shore cranes will be owned by our terminal operators throughout the port.'",
        "'speaker_1': 'In addition to help pay for our capital programs. We're planning to borrow $115 million through revenue bonds. Given our financial strength, we have maintained a Double-A credit rating, which is among the highest for U.S. ports. This comes from a disciplined approach to managing our finances.'",
        "'speaker_1': 'For example, we maintain more than 600 days of operating cash on hand at all times. We also maintain a minimum of a 2 to 1 revenue to debt ratio, which exceeds 1.25 to 1 ratio required by our bondholders.'",
        "'speaker_1': 'The final funding source of 52 million will come from our existing port fund balances. Now let me shift to our expenditures. Personnel services represent our staffing expenses. Non personnel is for our operations, interdepartmental charges, new equipment and the cash transfer to the Tidelands Fund.'",
        "'speaker_1': 'Then there's the repayment of our debt, followed by our largest cash outlay, our capital investments. I'll discuss each of these categories in detail as we go forward. But as you can see, we're spending about 16% less in total than last year, primarily due to reduced capital spending.'",
        "'speaker_1': 'And again, our capital outlay is far and away the biggest share of our budget, about two thirds of our total spending. This capital budget represents our ongoing commitment to investing in the future of our harbor department and the economic development of our city and the region.'",
        "'speaker_1': 'Currently, these projects support thousands of construction jobs, including employment for several hundred Long Beach residents. Regarding the Desmond Bridge replacement project this year. We've cleared the path for construction and now we commenced actual construction of the bridge bridge foundations.'",
        "'speaker_1': 'So we're very, very exciting that the bridge is actually starting to take shape. At Little Harbor. Some of the world's biggest and most technically advanced cranes are now being installed and tested. Phase one of this key project will go live next year in 2015.'",
        "'speaker_1': 'This project is creating the world's greenest terminal operation and is doubling its capacity and cutting emissions.'",
        "'speaker_4': 'By more than half.'",
        "'speaker_1': 'Among our other environmental projects are more shore power, plug in berths and community grants for air quality related improvements. Also in the coming year, we're taking delivery of two new fire boats, which are much bigger and more powerful to deal with today's largest ships being built.'",
        "'speaker_1': 'We're increasing our personnel services spending to satisfy step increases in negotiated salary increases. In addition, we're adding positions to support additional construction activity. We continue to expand our engineering staff with 20 more positions, and one of our key objectives is to reduce dependency on outside consultants to ensure that core knowledge is transferred to and retained by our'",
        "'speaker_1': 'team. We're also creating an in-house construction and maintenance dove team to reduce construction, construction and contracting costs. And we're adding security staff in large part to help with the traffic that has been been increasing around many of our construction sites.'",
        "'speaker_1': 'Our operating expenses. Are increasing to accommodate critical projects. Most of the spending is for maintenance of roads and utilities, but these costs also include $1.5 million to support the testing of a clean air barge under development as the alternative maritime maritime emissions control system.'",
        "'speaker_1': 'This this system. Hooks up to the exhaust stack of a ship which captures the exhaust, then cleans the emissions and effectively produces a near zero emission operation. If approved by state regulators, these barges could be deployed in the very near future, providing another way for us to eliminate emissions from vessels of birth and those vessels that otherwise'",
        "'speaker_1': 'can't have electrical ship to shore capabilities. We're also spending $1.8 million on the development of a hybrid electric truck system that will operate with overhead electric wires, which will allow zero emission truck operations within the port. And we're planning to spend nearly 1 million to support Long Beach's signature civic events, such as the Grand Prix, the municipal'",
        "'speaker_1': 'band, many festivals, parades, educational programs and other activities that make this city a true community. Our inter-departmental changes or charges, I'm sorry, are increasing by nearly 18%, largely reflecting the Harbor Department's share of various city operations. This includes the cost of a new city financial and information system.'",
        "'speaker_1': 'It also includes police services, which are up 3%, reflecting a recent reorganization, as well as fire services, which are up substantially to support the operations of the two new fire boats also are transferred to the Tidelands Tidelands Fund, which supports Beach and Marina projects, is estimated to be about $17 million and and it may be adjusted to'",
        "'speaker_1': 'reflect.'",
        "'speaker_4': 'Actual year end revenues.'",
        "'speaker_1': 'In summary, our proposed spending plan for the coming year is very robust, one of our biggest budgets ever. Because of the evolving alliances and competition among vessel operators, we're forecasting flat growth in operating revenues. But to gain a competitive edge.'",
        "'speaker_1': 'We're moving ahead with a very aggressive capital program, although a smaller investment than last year. We are proposing to add 28 positions in total, mainly in engineering and security, to support ongoing capital projects. Our spending continues to improve, and greenport operations in creating thousands of much needed jobs and economic activity in this region are really the focus'",
        "'speaker_1': 'of this budget. Finally, we are proud that the Port of Long Beach remains financially strong and we continue to work on making the port even stronger. That concludes my presentation and I will look forward to answering questions at the appropriate time.'",
        "'speaker_1': 'Thank you, Mr. Schlanger. Up. And now we're going to be moving on to financial management, and then we'll come back for questions.'",
        "'speaker_3': 'Director John GROSS.'",
        "'speaker_5': 'Thank you for them for the opportunity, mayor and Council members to present information about the Department of Financial Management. Many of the functions of this department are behind the scenes, but the functions are critical to the provision of services to our citizens.'",
        "'speaker_5': 'The title of the department describes many of its functions financial management the department helps plan for and helps set policy for how money will be both used and how it will be saved. Department tracks money in the department accounts for it.'",
        "'speaker_5': 'The department is also involved in identifying sources of money and in collecting money, and it has major roles in defining and implementing controls to make sure the money is properly managed and spent. Financial management also directs a number of important functions that are outside of traditional financial areas.'",
        "'speaker_5': 'And I'm going to talk about a number of core services that the department provides. Accounting, financial reporting, accounts payable, call bill paying and payroll or traditional finance areas. We have complex accounting requirements in the city. We're not only large, we also have unusual complexities due to our enterprise in grant operations.'",
        "'speaker_5': 'Payroll is also very complex because we have employees who work 24 hour shifts, over 500 types of pay, and about a hundred different types of payroll deductions. Financial planning and budget development and management are the flashiest part of the department and they are very important.'",
        "'speaker_5': 'Developing a good financial plan, having a financially sound budget and good budget management are all keys to long term provision of quality services for our citizens. Long Beach has over $1.5 billion in investments outstanding at any time and a $2.3 billion in outstanding debt issues.'",
        "'speaker_5': 'These are large portfolios for any city. The existing debt portfolio is complex and require significant ongoing management. But on top of managing the current portfolio, we are almost always working on at least one new debt issue or major financing issue.'",
        "'speaker_5': 'In addition, financial management not only makes many of the city's purchases, it monitors compliance with city requirements, as well as encouraging local businesses, minority and small businesses to participate in the city purchasing. The department registers businesses after ensuring that they have the necessary approvals and it collects the associated business licensing tax.'",
        "'speaker_5': 'Financial management also manages the entertainment process in the city, including hearings, review and revocations, financial management bills, and collects all utility bills, all parking citations, ambulance bills. We also handle delinquent bill collections. Financial management plays a role in the city's financial controls, in financial emergency preparedness, and in designing and maintaining the operations of the city's financial systems'",
        "'speaker_5': '. Customer service is very important to us in this whole realm, whether we have internal customers or customers that are residents, businesses or visitors outside of the normal financial area. The department is responsible for fleet acquisitions, fleet maintenance and towing and line sales.'",
        "'speaker_5': 'With fleet operations part of the financial management department, there is substantial emphasis on financial aspects of these operations and a high degree of emphasis on customer service due to the department's inherent emphasis on customers and its independence from any department that uses fleet services.'",
        "'speaker_5': 'We have a number of accomplishments. I wanted to mention at least a few. Our annual financial report has received a national award for a number of years. This award by the Government Finance Officers Association is a nice recognition of quality accounting and reporting.'",
        "'speaker_5': 'Financial management has recently implemented the decentralization of accounts payable. Again, that's our bill paying process that decentralization improves controls and oversight improves efficiency, improves relations with vendors, and helps prepare for our new financial system. That part went through the Budget Office.'",
        "'speaker_5': 'It's constantly looking at revenues and revenue sources, both to project the amount we will receive and to identify revenue areas that may need to be addressed. However, in general, maximizing revenues is a massive undertaking and impacted by many factors.'",
        "'speaker_5': 'Our debt issuance function has done very well. We not only provide the city with financing for projects that may need complex finance funding, but we have saved millions of dollars in interest costs by finding ways for the city to take advantage of low interest rates on previously issued debt.'",
        "'speaker_5': 'The city also has a very good credit rating, an AA rating from the Fitch rating agency and similar ratings from other agencies. This is a testament to both the city's good practices and more importantly, an indication, as stated by the rating agencies themselves of good financial management decisions by the City Council.'",
        "'speaker_5': 'Over the years, the consistent, ongoing and successful installation of new major systems is another accomplishment, but it is also a source of some concern because of the major diversion that these system, major diversion of staff that these system implementations cause.'",
        "'speaker_5': 'The systems implemented or being implemented include utility billing, business licensing, parking, citation processing, fleet management systems, debt management and the citywide financial H.R. Systems. Whoops. Going in the wrong direction. In terms of our budget summary, the budget is $65 million, 241 full time equivalent positions, but two thirds of that budget and almost half staff are for fleet'",
        "'speaker_5': 'and towing operations. These operations charge for the services and the costs are reimbursed. The total general fund budget on the financial side is about $8 million. Budgeted costs for the department are higher than that, but other funds reimburse the general fund for services provided.'",
        "'speaker_5': 'Most of the significant changes in the department's budget are in fleet services. Spending for the city's fleet vehicles has been unusually low for the last few years. This year we are proposing an increase of 4.1 million to restore annual purchases to a normal level.'",
        "'speaker_5': 'To begin to keep the city's fleet reliable and cost effective. To maintain the funding comes from dedicated from a dedicated fleet acquisition account, not the general fund. The age of the fleet and repair costs have significantly increased over the last few years.'",
        "'speaker_5': 'This year we expect to replace 160 to 200 vehicles with this funding, including police patrol vehicles. In other words, our black and whites street sweepers refuse trucks and utility trucks. This is out of a fleet of about 1900 vehicles.'",
        "'speaker_5': 'The actual vehicles to be replaced will be identified based on a study now underway that will determine what vehicles to replace. And that determination will be what minimizes the city's overall cost with respect to those vehicles. We're also proposing some maintenance work on the Temple and Willow Fleet facilities building.'",
        "'speaker_5': 'This building has not had significant major maintenance since it was built about 15 years ago. The pros work on the heating system. Roof repairs and exterior painting and ceiling will help preserve the facility. Jeep's, more known as telematics in the fleet industry, will be put on all vehicles where there is benefit to the city.'",
        "'speaker_5': 'GPS systems have tremendously improved in capability and provide both real time and passive monitoring of the vehicle's health and driver and vehicle behavior. This is a best practices, best business practice and includes real time reporting of vehicle malfunctions, excessive idling vehicle location and poor and unsafe driving behavior.'",
        "'speaker_5': 'We're going to have about 1500 vehicles so equipped when we're done. Terms of significant issues and opportunities. We have a few big one being the new Financial Human Resources System project. It's a huge but necessary undertaking. The project will bring modern capabilities to our management systems and end the serious risk of major system problems in the future'",
        "'speaker_5': '. This type of citywide system replacement is the single biggest computer project a city can undertake. These huge private projects can be problematic. It is the goal of this project to avoid major problems. Staff assigned to the project will need to be immersed in the implementation of the new systems to understand them at the most detailed level.'",
        "'speaker_5': 'And they will need to know the city's detailed processes and procedures to be able to design how the new systems will be configured and programed. In addition, many of the city's financial and human resources, processes and policies will need to be redesigned either because they are antiquated already or because they do not work efficiently, or sometimes even'",
        "'speaker_5': 'at all. With new systems, key staff will need to be dedicated to the project for an extended period of time. The impact will be felt most strongly beginning next year and for at least a year after that. While the goal of the project will be to minimize the impact as much as possible, the project will need to'",
        "'speaker_5': 'be a top priority for finance, human resources and the Technology Services Department. The Civic Center, if City Council chooses to move forward, is an extraordinarily complex financial transaction. It will also require a major effort. Labor negotiations over the next year will also occur and require substantial effort.'",
        "'speaker_5': 'As I previously mentioned, we're making changes in the way we determine which vehicles to replace and when we are conducting a study to improve our approach to vehicle replacements, not replacing vehicles too soon or too late, but rather at the point that minimizes total cost.'",
        "'speaker_5': 'At the same time, we are constantly working to make the fleet greener. Whether it is through the use of alternative fuels, fleet reduction or reducing the size of vehicles themselves to get better mileage. And I guess in conclusion, the department in all its operations, including Fleet, Fleet and Towing, has many dedicated employees.'",
        "'speaker_5': 'These are people who put a lot of effort into their jobs and have a desire to do a good job for the city and improve the city for its residents and businesses. Other departments, including the city auditor, have also had a substantial role in financial management and control and in budget development and management.'",
        "'speaker_5': 'They are all part of the citywide team that provides these financial services to the city and I very much want to express my appreciation for the work and dedication of the financial management employees and the employees throughout the city who work in similar functions.'",
        "'speaker_5': 'That concludes my presentation.'",
        "'speaker_1': 'Q We're going to begin with council questions and Mr. Off with Councilmember Price.'",
        "'speaker_0': 'Thank you. Mr. GROSS, first of all, thank you for all the work that you do for the city and all the insight that you give us on our budget. As we move ahead, I really appreciate it. I wanted to talk with you specifically about the $4.1 million, roughly $4.1 million one time adjustment for the Fleet Acquisition Fund'",
        "'speaker_0': '. You mentioned that that money is coming from a Fleet acquisition fund, not the general fund. Is that correct?'",
        "'speaker_5': 'That is correct.'",
        "'speaker_0': 'And so does that mean that that $4.1 million is earmarked specifically and limited to use of fleet acquisition?'",
        "'speaker_5': 'Yes, it is. In one more comment. It really probably isn't one time. The the the Fleet Fund has had a ignore abnormally low expenditures last year. It would probably normally be our recommendation to spend around the amount you're seeing in this FY15 budget.'",
        "'speaker_5': 'We are very far behind. That is really just a normal level.'",
        "'speaker_0': 'And the Fleet Acquisition Fund, how is that fund created?'",
        "'speaker_5': 'The fleet acquisitions operation looks at each vehicle, identifies how long its that vehicle lasts and then charges let's say it lasts for five years. I'm simplifying things. That would be the case of a police vehicle. The police department has just basically charged one fifth of that cost each year so that in the fifth year the money has'",
        "'speaker_5': 'been accumulated. That's done for each department on a vehicle by vehicle basis.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Was that it comes from reprice or. Okay.'",
        "'speaker_0': 'Thank you. That's.'",
        "'speaker_1': 'Thank you, Councilmember Austin.'",
        "'speaker_5': 'Thank you very much. I just had a couple of questions. And first, I want to thank Mr. Slater up and Mr. GROSS for for their great reports. In last year's budget, a new bureau was actually created in financial management called financial controls.'",
        "'speaker_5': 'And Mr. GROSS, can you describe what this what role this bureau is currently providing for your department? Yes, this is a small bureau, has three FTE that is intended to generally improve financial controls and management in the city.'",
        "'speaker_5': 'Our financial controls and processes are not as good as they should be. That's something that became evident when I came to the city. The causes include antiquated financial systems in there and in the cities, and it's many. It's really a good thing, but it's a relentless focus on productivity and services to residents and cost cutting.'",
        "'speaker_5': 'Those are very good things. But what often happens in an organization is when you do that, you are unintentionally weakened controls. That has happened here and it's happened in innumerable other governments and organizations whenever budget cost cutting and efficiency improvements occur.'",
        "'speaker_5': 'So this this bureau is intended to help improve controls throughout the city. There are two specific areas that that we're going to be focusing on. The new financial systems, which will be a major effort and a major opportunity to improve controls.'",
        "'speaker_5': 'They will be this group will be focused on that next year and also on financial controls and processes in emergency situations. This is what happens in the event of an earthquake or something similar to that. That's an area in which our financial controls and processes really badly need work.'",
        "'speaker_5': 'So those are two areas of emphasis. Sometimes it's asked of me, Well, how is that operation different from our city auditor? And I describe it as a symbiotic relationship. They work in synergy. The Financial Controls Bureau does not do audits.'",
        "'speaker_5': 'The city auditor does audits. On the other hand, the city auditor does not develop financial controls and processes. And this financial control bureau, that is its primary function. So they work together to try to improve financial controls and management in the city.'",
        "'speaker_5': 'So let me answer your question. Yeah, that you quite you did. And I thank you for for going into detail. And this is the first time that I actually heard that we there was a symbiotic relationship between that bureau and the city auditor's office.'",
        "'speaker_5': 'So so thank you. So you you forecast that being a long term bureau or D, do you see yourself in the next couple of years reorganizing in any way? That's a good question. I think in the next I don't think in the next couple of years its focus will be on our financial system and the emergency financial'",
        "'speaker_5': 'control procedures. Those are the areas that most badly need the work on the financial systems because we're putting in brand new systems and this is the way, best and fastest way to improve controls. And as I said before, our emergency procedures badly need work.'",
        "'speaker_5': 'The Bureau will not go away. The need for improving controls and revising them is a pretty big task. What will happen, and I think what you're referring to is what it works on will change somewhat. They will move to different emphases.'",
        "'speaker_5': 'As time moves on, we get something improved. We will move to change it so that the effort, what they will work on specifically will change. The overall goals will not. Okay, I guess it sounds like it's working. I also noticed that the projected revenues from the business licenses is down from f y 13 and you're actually projecting'",
        "'speaker_5': 'lower revenues in FY 15. Do you have any explanations as to why we're experiencing such a downward trend in that that area revenues? We're not really expecting a downward trend in business revenues. I think what is happening is that we're doing extremely well this year and and that we're not necessarily suggesting that it's going to be that'",
        "'speaker_5': '. Well, it could be. It could be as well next year. But there's been a change in the we don't expect a decrease. And then my last question, I guess, would be for the city manager, because it's just been something that has been bugging me.'",
        "'speaker_5': 'I notice that Fleet Services is under financial management. Can you explain why organizationally that is the case?'",
        "'speaker_3': 'Councilmember Fleet Services is in financial management in many organizations. It's also in public works. It recently was in public works. We basically took it took fleet services out of public works. Public purse was growing so much and wanted to have a little bit more control in operation.'",
        "'speaker_3': 'So we put it to finance under Mr. GROSS. We also have a brand new fleet manager, Mr. Dan Berlin, who's with us tonight as well. And he works in finance managing this Fleet Department.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And Mr. GROSS, thank you so much for that riveting presentation. I know I only have questions for Mr. Slager up. But I thank you for the presentation. Mr. Slinger up first of all, your PowerPoint was much more colorful, colorful than the others.'",
        "'speaker_4': 'And and so whatever you're doing, keep it up, because I was able to so pay attention to read the whole thing. I just want to I just wanted to chime in on one slide in particular, operating expenses. I noticed a couple of things, the clean air barges and and I know that's a program that that is it's'",
        "'speaker_4': 'new technology and it's taken us in the direction to have a zero emissions port. Can you expand on that? My question is, when can when, by your estimation, if we keep heading down this direction, investing, making investments like this, how soon can we say we'll have a zero emissions port as it relates to providing options for every'",
        "'speaker_4': 'single container ship that that comes in the Amex's?'",
        "'speaker_1': 'Service in the Amex.'",
        "'speaker_2': 'System.'",
        "'speaker_1': 'Is being tested and.'",
        "'speaker_2': 'Demonstrated as part of its commissioning and approval process. In other words, the the various regulators and in the city have to approve. I mean, in the state have to prove the viability of the system.'",
        "'speaker_4': 'An actual demonstration is occurring tomorrow morning, which is one of the final demonstrations that we're going to see before certification takes place.'",
        "'speaker_1': 'And once certification does take place.'",
        "'speaker_2': 'Then the the next effort is, of course, is going to be to purchase and and and build and then deploy numerous of these image systems across the port. Now, what it does specifically.'",
        "'speaker_1': 'Is that the technology itself and.'",
        "'speaker_2': 'This is this is a company that's been working on this for many, many years. But the technology itself in isolation is not new. These are known technologies. The what's what's been done that's.'",
        "'speaker_4': 'Unique is the integration of these various technologies into one.'",
        "'speaker_2': 'Comprehensive system that basically.'",
        "'speaker_4': 'Takes exhausts from diesel engines.'",
        "'speaker_2': 'And scrubs all of the bad pollutants out of it, basically delivering an inert exhaust.'",
        "'speaker_4': 'Free of things like NOx and Sox and all the bad things we want to eliminate out of emissions. It's like a gigantic catalytic converter on a car, rendering it very, very clean. In this case, more than half of the.'",
        "'speaker_2': 'Ships that visit the port do not have the the means to electrify their vessels and take advantage of of ship to shore electrical connections.'",
        "'speaker_1': 'And that's because these ships are infrequent.'",
        "'speaker_4': 'Visitors, but work or contracted by shippers, and therefore they have not.'",
        "'speaker_2': 'Or will not make the investment necessary to ship electrical plug in with this system with a assuming it's going to be certified. And we have.'",
        "'speaker_4': 'High.'",
        "'speaker_2': 'Confidence it will it will, in fact, change the the entire nature of our green program, because 100% of our ships at berth, as well as those that are being anchored offshore, could, in fact be subject to this type of technology.'",
        "'speaker_2': 'And therefore, we would have a dramatic impact on emissions profile for the port. And it's part of our objective for attaining the Air Resources Board.'",
        "'speaker_4': 'Standards for the next generation of clean emissions, and that's in 2023.'",
        "'speaker_2': 'So we've achieved all of this. We've achieved the 2014 attainment, and we're our eye now is on the 2023 attainment. So these are the types of technologies we're going to employ to do that very thing.'",
        "'speaker_4': 'I just want to applaud you in and just point out that it's really special that we in the near future will be able to see 100% of the ships that come and dock with us to take care of it, manage all of their emissions.'",
        "'speaker_4': 'I think that's impressive. And, and and I want to see that in future budgets, you continue to make these investments and to boards now and the community outreach you folks do a great job your team here and your your report does a great job with supporting the community festivals and things like that.'",
        "'speaker_4': 'I specifically want to call out the educational programs you guys have with your scholarships. Many folks might not know that you have a great scholarship program. That's something I'd like to see you expand in the future. Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Any other questions? Seeing them there. I mean. Any other council questions? Let me just say first also to our two presentations tonight, and I know this concludes all of our our presentations from our departments and that have come forward.'",
        "'speaker_1': 'So thank you all. You all done a great job of presenting and putting together a great budget and budget presentations. And so, Patt, also make sure you communicate to your staff that we're appreciative of all these discussions and a lot of exciting stuff happening across across the city department.'",
        "'speaker_1': 'So thank you for that. And with that, I'm going to turn this going back to I think Vice Mayor Lowenthal is going to make a few comments and then I'm going to open it up for public comment and then we'll begin some of the budget resolutions.'",
        "'speaker_6': 'Thank you, Mr. Mayor. I wanted to go ahead and thank staff for their presentations and also really the finance staff for all the homework that they've done to support the BRC in their deliberation and consideration of these items.'",
        "'speaker_6': 'On on hearing item one. If we could take up council members the initial items, 1.1 to 1.9. These are administrative budget items, which also include the budget for harbor and and the water department. And if we can go ahead and take up the motion to adopt fiscal year 15 budget items 1.1 through 1.9.'",
        "'speaker_1': 'I want to make sure also, Mr. Schilling, I mean, I need to do public comment as well, so.'",
        "'speaker_3': 'That's correct. And if we could take the items. Individual, individual, please.'",
        "'speaker_6': 'Thank you. Absolutely. I appreciate that. We can do that.'",
        "'speaker_1': 'Vice Mayor. What I'm going to do is I'm going to go to public comment, but did you want to make a few more comments in the public comment?'",
        "'speaker_6': 'I do. So we'll go ahead and take them individually after our comments. So the Budget Oversight Committee has met a few times in the start of this budget process, and I wanted to thank all the members of the community that's come out to speak on these items.'",
        "'speaker_6': 'We've heard community priorities from public safety, which is always a community priority. We've heard priorities for park rangers, we've heard priorities for language access. And earlier in the Budget Oversight Committee, the recommendation was to receive and file the staff recommendation for language access, which I believe amounts to just over $149,000.'",
        "'speaker_6': 'However, in further consideration, I will be making an amended motion and hoping to receive support to find an additional $100,000 for language access. In order to bring that up to a rough estimate of about $250,000, I just wanted to provide that caveat because I know just about an hour and a half ago, we left the meeting with'",
        "'speaker_6': 'a different with a different motion, and that is the box motion. But we will make it in an amended motion here and hope to receive support from the Council on the Park Rangers item. I do believe each council member supports the concept of greater security at parks, but when we consider what council members have have spoken to'",
        "'speaker_6': 'and supported, we we would like to support greater security through our police department. Our police department does a phenomenal job here in the city of Long Beach. And what we would like to do is ensure that the parks are really considered as part of their their territory as well to provide greater public safety for our residents and'",
        "'speaker_6': 'our visitors. The Parks Department director has provided us an update on his park security program, the pilot program, we we believe, through Budget Oversight Committee, and will make this recommendation, certainly to give that program an opportunity to be successful, to launch initially and then be successful.'",
        "'speaker_6': 'And we'll also make a recommendation to shift the cost center of the park rangers to police so that they are reporting to police as opposed to a non sworn director of Parks Recreation Marine, which he's a fabulous director, but we don't know that park rangers should be reporting to them.'",
        "'speaker_6': 'And so our recommendation is not to expand the park ranger program, but it will be at the time that we make the recommendation, certainly will be to ensure that the cost center of our existing park rangers get shifted to police and that we would support the Director of Parks, Recreation and Marine in his proposal for the pilot'",
        "'speaker_6': 'security program. And those are the comments I have for right now, Mr. Mayor, and I'll wait for the remainder comments when we make the motions.'",
        "'speaker_1': 'Okay. So what we do now is open up for public comment on on the budget and then we will begin going through all the different I believe there's a total of 16 resolutions that we have to go through tonight.'",
        "'speaker_1': 'So public comment, please come forward if there's a comment. Okay. See, see? No public comment.'",
        "'speaker_6': 'You can do that through the circles of the. Oh, I'm sorry. I just. I know.'",
        "'speaker_5': 'Sorry about.'",
        "'speaker_1': 'That. No problem. It's okay.'",
        "'speaker_2': 'Good evening, Mr. Mayor. Members of the Council. My name is Renee Castro, and I live at 6.6 Grand Avenue in the third district. I just want to start by thanking Councilmember or Vice Mayor Susilo at all who contributed another $100,000 to the language access policy.'",
        "'speaker_2': 'I mean, that's incredible. It's it's an incredible sign. There's been a lot of community engagement on this. We've been doing large visits with you, Mr. Mayor, members of the council. It's it's been an incredible discussion. I really also want to appreciate staff's work on this.'",
        "'speaker_2': 'I do, though, along with the coalition, really want to emphasize that, you know, to fund the full policy, again, is 360,000. There would be 150 plus the 209,000. I feel like the full policy is 1.2 million, as you all know.'",
        "'speaker_2': 'And, you know, we continue to talk about costs. But, I mean, there's there's really efficiencies that we could create when we focus on greater language access and democratic engagement. And I'm not smart enough to do those to do that kind of analysis.'",
        "'speaker_2': 'But, you know, hopefully at some point we can continue to talk about efficiencies. I think this is just a really unique opportunity for the council. And you, Mr. Mayor, in your in your first term, what I hope is your first term, you know, to really demonstrate some bold leadership.'",
        "'speaker_2': 'I realize it's it's a tough ask right now, especially for one time funds. But again, we really plead with the council and you, Mr. Mayor, to thank you so much. A couple of weeks ago, you lifted the cap and you said, I think this is reasonable.'",
        "'speaker_2': '$360,000 to support people who are monolingual like yourself. Mr. Mayor, growing up in this city, I think I think is a is a reasonable investment. And I thank you so much for your leadership. I think this is a great start.'",
        "'speaker_2': 'But tonight, again, we're hoping that the council supports us with the full 360,000. Thank you so much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Hello. My name's Madison with the Long Beach Immigrant Rights Coalition and the Language Access Coalition. And just to add to what our partner Vinny said, while we appreciate the potential over 100,000 added to the already 150 allocated, we do want to reiterate why this additional money of 10 to 210000 is important.'",
        "'speaker_7': 'There have been some issues raised at the B or C, but we would like to address the importance of, again, the translation of documents that 30,000 documents translated into garlic for documents that already exist in Spanish for an additional 7000 automated voice mails in languages in three languages at 1000 907,000, the translation of 25 most commonly used'",
        "'speaker_7': 'web pages. The training of staff acting as interpreters at 56,000. The notice of policy for the use of outreach for the community at 13 K. And then the use of a citywide language learning not just public works at 50 K.'",
        "'speaker_7': 'So again, while we appreciate the work that has been done. We do feel it's important to fully implement this policy at the 210,000 key that we ask for to have a real meaningful startup up for our community. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening. My name's Laura Merrifield.'",
        "'speaker_7': 'I'm with Building Healthy Communities Long Beach. I wanted to I wanted to say that if it feels like there's a lot of numbers that have been going around, it's because there are a lot of different numbers that are going around.'",
        "'speaker_7': 'And part of that is the hard work, right, both on our staff side, on us as advocates looking at these different reports. And so, you know, I know it's been just a lot that's been floating around. And just one thing I did want to just reiterate is that the last week council directed staff to look at something'",
        "'speaker_7': 'beyond, you know, to look at additional funding without a cap. And so I really appreciate the additional 100,000 suggested. And that brings us very close to what we've been asking for, which is, as Rene said, you know, about 360,000 in total.'",
        "'speaker_7': 'So we're really only asking now 100, 110 above those basic recommendations. And, you know, it's taken us a long time to get here and those numbers keep moving. But we know that the more resources we have, we can really fund this policy.'",
        "'speaker_7': 'You know, we're asking for additional telephonic lines, not just I believe it'd be about 67 covered under these new recommendations. We want to make sure that, you know, we have 25 Web pages, not just ten. We want to do this in full and not just our as full as we can with the resources we have.'",
        "'speaker_7': 'Council Member Mungo earlier mentioned a potential 311 line to direct phone calls, which we think is a great idea. But again, that phone line only is as useful as the language access behind it once people are referred. And so we just want to be very clear, you know, that we're here.'",
        "'speaker_7': 'We're going to we really we feel like we've made some compromises, but we're here to ask for full funding at 360,000 and to consider that funding from these one time oil revenues and other sources. Thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_8': 'Good evening. My name is Jonathan McGregor.'",
        "'speaker_5': 'I live at nine four Redondo Avenue, and I'm here with Alex in Long Beach. First, we want to thank you, Mayor Garcia, for a meeting with those earlier today.'",
        "'speaker_8': 'We are hopeful. City Council follows your lead.'",
        "'speaker_5': 'And addresses their concerns.'",
        "'speaker_8': 'Remain hopeful that we will be able to.'",
        "'speaker_5': 'Work together to find meaningful and comprehensive solutions to the housing crisis here in Long Beach. At the same.'",
        "'speaker_8': 'Time, this budget process has been a frustrating.'",
        "'speaker_5': 'One for community members who have come in support.'",
        "'speaker_8': 'Of affordable housing and the use of and funds housing. Long Beach Staff Board and resident leaders.'",
        "'speaker_5': 'Have attended every public budget meeting to date and have received no recognition.'",
        "'speaker_8': 'Or support from the City Council regarding their concerns. A basic tenet of healthy democracy is open dialog between the people and their leaders when they go out to talk to my neighbors and friends to encourage them to engage in the local democratic process.'",
        "'speaker_8': 'Time after time I hear from them.'",
        "'speaker_5': 'That is a waste of time and why.'",
        "'speaker_8': 'Vote when nothing changes? But I still go out and we still attend these meetings and stay late. Stay late to express their concerns, because we believe that the only way to find meaningful solutions is by working together. We house in Long Beach and the residents who make up our community base.'",
        "'speaker_2': 'Understand that the budgets are difficult and that they're allocating. The property tax.'",
        "'speaker_8': 'Revenues to housing can be a.'",
        "'speaker_2': 'Politically challenging task. However, for the past weeks we have felt ignored and began.'",
        "'speaker_8': 'To understand why people must feel discouraged to share their concerns at city council meetings. See, it is not simply the lack of support on this issue, but the silence. The silence from.'",
        "'speaker_2': 'You.'",
        "'speaker_8': 'Earlier. That concerns us. The silence and lack of support is not something we expect. It's something we expect from a city council members. Your obligation as city council members is to address residents and their concerns. We share this because we still very much desire to have a healthy working relationship with you.'",
        "'speaker_8': 'Beyond government. There will be many opportunities that we will have to work together to increase affordable housing and improve the stock of existing housing. Healthy working relationships are building respect and communication, and our desire from here on out is to build this with you.'",
        "'speaker_8': 'We do this work because we know that housing has a significant impact on the wellbeing of self, in the experiences of families across our city struggling to provide for their families and have a healthy life.'",
        "'speaker_5': 'If we make housing a priority, we can work together to alleviate the housing crisis in our city. Thank you so much. And we look forward to working with all of you.'",
        "'speaker_1': 'Thank you. Won't you hold up right there one sec. I wanted to say something to you guys real quick, so I know that you guys have been here for for many weeks and others that are that are in the audience as well.'",
        "'speaker_1': 'And I appreciate the meeting that I had today and that we've had continuously. So what I just want to say to all of you is I'm fairly certain in my conversations with other members of this council that everyone understands that affordable housing and the discussion around it is important and that we're going to have.'",
        "'speaker_1': 'And so what I would say is I know that even though we've been in office for a short amount of time or most of us, you've all been advocating for a very long time, longer than most of us have been on the council.'",
        "'speaker_1': 'And so I understand that frustration. But I will say that we think collectively and I speak, I think, for for for the council. And if not, a people can chime in. We understand there's a there's a need. And over the next few months, I personally plan to engage on discussions.'",
        "'speaker_1': 'I know others will as well. There's a lot of opportunity at the state level, next year's budget discussions that we're going to have about this issue. And the issue is much broader than $2.5 million, $2.5 million is going to build this.'",
        "'speaker_1': 'How many units? A handful of new units. The the issue is a much larger issue if we're really going to look at building significant amounts of affordable housing at all levels, low income workforce, we've talked about teacher housing, all the other things that are out there that's going to take a lot of heavy lifting from from all'",
        "'speaker_1': 'of you, but also from us. And I think I think we have we hear that this is a budget that is being implemented not just by us, but being recommended also by by a former body. And so I think that I'll just say we're doing the best we can with what we have.'",
        "'speaker_1': 'But I think this is this discussion is going to be elevated. And so you have my commitment. I'm not I don't I haven't been announcing, you know, initiatives or things that are important just to throw them out there.'",
        "'speaker_1': 'But they are going to be discussed in a meaningful way. And I think at the end of the next year, you're going to see significant progress in the discussion. Okay. All right. Thank you. Thank you. Any other public comment?'",
        "'speaker_1': 'Okay. So I'm going to go ahead and turn this back over to Councilmember Price.'",
        "'speaker_0': 'I apologize. I hit that. Oh.'",
        "'speaker_1': 'Okay. Councilmember Gonzalez.'",
        "'speaker_0': 'I just wanted to I just wanted to say thank you to the housing advocates. I know you guys have worked so hard. And like the mayor said, you know, we we certainly all agree that, you know, this is certainly important.'",
        "'speaker_0': 'And I know that our office has been working with other organizations like Habitat for Humanity in obtaining, you know, affordable housing. So this is still going to continue on our radar. It's one of our priorities, the fact that it's not the amount, you know, that we we can we can do now.'",
        "'speaker_0': 'Does it mean that it's fallen off the radar? So I also assure you that will be committed to this as well.'",
        "'speaker_1': 'Okay. And with that, I'm going to go and turn this over to two to walk us through some of the items and trips over to the bossy chair to go over the budget resolution items.'",
        "'speaker_6': 'Thank you, Mr. Mayor. And I, too, want to thank the Housing Coalition for their advocacy and firmly believe in what the mayor is saying about us having a larger conversation, a citywide conversation about the need for housing. And I'm thankful that you mentioned that tonight and made that commitment on our behalf.'",
        "'speaker_6': 'I do appreciate that. Mr. City Attorney, you'd like to see us go through items 1.1 through 1.9 individually, correct?'",
        "'speaker_8': 'That is correct.'"
    ],
    "Resolution to Approve Long Beach Harbor Department Budget for FY 15.": [
        "'speaker_6': 'Okay. So council members, if. If I may, item 1.1, I move to recommend to adopt resolution approving the fiscal year 15 budget for the Long Beach Harbor Department as adopted by the Board of Harbor Commissioners on July 14, 2014.'",
        "'speaker_3': 'Also on each item, if we could ask for any public comment between the items.'",
        "'speaker_6': 'Yes, I will do that. And there's been a motion and a second by Councilmember Austin. Are there any members of the public that wish to address us on that item?'",
        "'speaker_1': 'Okay. But if you want to just walk us through all these and that's that's.'",
        "'speaker_6': 'When we can do that. Thank you. I appreciate that. All those in favor.'",
        "'speaker_0': 'I. I.'",
        "'speaker_6': 'I. Do you want a recording?'",
        "'speaker_1': 'So I think we'll do recorded. I think we'll do on budget. I think we'll just do recording.'",
        "'speaker_6': 'This recorded both.'",
        "'speaker_0': 'Councilmember O'Donnell. Councilmember Andrews. Motion carries seven zero.'",
        "'speaker_6': 'Thank you. Hearing item one point to make the motion to recommend to declare an emergency to exist. Sir. Second case. Been in motion in a second. Is there any member of the public that wishes to address Council on item 1.2?'"
    ],
    "Adoption of the Mayor's Amended Budget Recommendations for FY 15.": [
        "'speaker_6': 'Okay. Council members from the block committee, we made a recommendation. It was a unanimous recommendation from the Budget Oversight Committee to adopt the mayor's proposed budget recommendations as amended to fiscal year 15 proposed budget. Councilmember one go. Once SEC.'",
        "'speaker_0': 'They won't get a chance to say it.'",
        "'speaker_8': 'But don't.'",
        "'speaker_6': 'It's my mistake. It is as recommended by the mayor.'",
        "'speaker_2': 'And.'",
        "'speaker_6': 'Version in a second. So this is to and I'm sorry for the confusion. This is true. Adopt the mayor's proposed budget recommendations to the fiscal year 15 proposed budget as proposed by the mayor. There's been a motion and a second.'",
        "'speaker_6': 'Is there any member of the public that wish to address the Council on this item? Seeing none. Members cast your vote.'",
        "'speaker_0': 'This motion carries eight zero.'"
    ],
    "Budget Oversight Committee's Funding Recommendations for FY 15.": [
        "'speaker_6': 'Thank you, Mr. City Attorney. I have a procedural question, Charlie, on the language access item, the budget oversight committees recommendation was received in file. Am I able to make an amendment to that.'",
        "'speaker_3': 'As part of that? As part of the budget process and the approval process? The action by the B or C was to receive and file. However your your recommended change would not be from the B or C would be from you as an individual council person for the budget for consideration by the body as a whole.'",
        "'speaker_3': 'So no, you can't change the recommendation of the B or C, but you can make your own motion to amend the budget concerning that item.'",
        "'speaker_6': 'Okay. I appreciate that.'",
        "'speaker_1': 'And Mr. City Attorney, just for clarification, I think that would happen that that would happen could happen later at a later later item or in the same item later, later, I believe, when we actually passed the rest of the budget.'",
        "'speaker_1': 'Is that correct? That's correct. So you can we can pass the B or C and then address language access at a later item.'",
        "'speaker_6': 'And with so from these items, if it's not under item 1.11, which item would that be?'",
        "'speaker_3': 'When you get to item 1.14, adopt amending the proposed recommendation to adopt the motion, amending the fiscal year budget and or item six where you are adopting the appropriations ordinance. Either one of those items, you could make a motion to amend everything else that's already been approved at that time.'",
        "'speaker_6': 'Okay, so either an item 1.14 or 1.16, we can make that amendment.'",
        "'speaker_3': 'And Mr. GROSS points out he's correct. You could also at this point make an amendment to the box recommendations by yourself or one of the other council members could discuss it. But the box recommendation sits as submitted.'",
        "'speaker_8': 'Right?'",
        "'speaker_3': 'You are a former councilman, so I would amend it. I'm sorry I misunderstood you.'",
        "'speaker_6': 'No, that's okay. Then I was not articulate when I asked that question. So that was the question, which is we can make the Bossie recommendations and make an amendment to one of them for the council's consideration.'",
        "'speaker_1': 'Okay. I also have a couple of people that have queued up. Okay. So just for clarification, Vice Mayor, you well, we have the motion we have as before for the Budget Oversight Committee. Was there a motion that was made on this yet?'",
        "'speaker_6': 'No, there has not been a motion made. There are a few items from the Budget Oversight Committee that I that we'd like to bring forward to this council. Great. And then. So if councilmembers want to speak before then, we're out.'",
        "'speaker_1': 'What I was hoping is perhaps you could review all the items on the Budget Oversight Committee, what the recommendations are, and then I'll. I'll open it up for the the members that want to speak on the item. Is that possible?'",
        "'speaker_6': 'Yes.'",
        "'speaker_7': 'At the other end of the spectrum.'",
        "'speaker_6': 'I apologize.'",
        "'speaker_0': 'For.'",
        "'speaker_6': 'The shuffling around. As you can see, as paperless as we try to be, we have mounds of paper and and it's little difficult to find things. So if I can, Mr. Mayor, go over the B or C recommended items we have recommended to the boss.'",
        "'speaker_6': 'He recommends the mayor's proposed budget recommendations and also recommends the following for from the Infrastructure Systems Replacement and Technology Reserve. There is $1,000,000 in that. In that account that has been designated. The BOC recommends to reprogram this for infrastructure divide by $9, and any exceptions to infrastructure can be proposed by individual council members to the City Council'",
        "'speaker_6': 'for approval on a case by case basis, which is how it has been done before. And so if I can go through the list of the divide by $9, I will do that. So the first item is $1,000,000 from infrastructure systems replacement and technology reserve.'",
        "'speaker_6': 'The second item is $1 million from supplemental funds for streets. The third item is $1 million from the supplemental funds for sidewalks. The fourth item is $800,000 funds set aside for stormwater compliance. We have an assurance from staff that the $200,000 that we need to meet our obligations for the next fiscal year, we have and we have'",
        "'speaker_6': 'that available. And so this would be over that. And so we're recommending the $800,000 be reprogramed and there's a remaining amount of $50,000 from the VAC fund, 250 of the 300 the mayor had recommended in his proposed budget.'",
        "'speaker_6': 'That leaves 50,000. So we're recommending that all these items totaling 3.83 $3,850,000 be reprogramed for infrastructure divide by $9. That was the first item the city prosecutor had come forward and made a recommendation for $58,280, $37,500 for the truancy intervention program, and $20,780 for high speed copying and scanning equipment.'",
        "'speaker_6': 'The BAEZ'S recommendation is to have this these resources available to the city prosecutor, however, make them available through his year end surplus and have a reassignment of his year end surplus to pay for this $58,280. Those are the items coming out of the EEOC.'",
        "'speaker_1': 'And then also just for clarification and then I have a couple of members questions. It's my understanding of the vice mayor that the the infrastructure dollars are being divided for council specific projects include could be street sidewalk infrastructure could it be park infrastructure could go to various types of project needs in in the district, is that correct'",
        "'speaker_6': '? Yes. Okay.'",
        "'speaker_1': 'Councilmember Richardson.'",
        "'speaker_4': 'Thank you. So in the box recommendation, I know that you took up language access. Were you planning to speak on that item later?'",
        "'speaker_6': 'Yes. So according to the city attorney's recommendation, we would we made a recommendation. You're right. We made a recommendation to receive and file. And so we'll make an amended recommendation to add $100,000. And we can do it at this time with the box recommendation.'",
        "'speaker_6': 'So I'll go ahead and make that motion now or make that statement now.'",
        "'speaker_4': 'So that so you're amending your your so I'll second that. And I would just add that staff took the additional step in their report to the EEOC. I thought they were very clear about the motion that was made in the direction that was sent to the EEOC.'",
        "'speaker_4': 'I think that, Vice Mayor, you were very clear on it and you reinforced those specific deliverables that were in my motion. And furthermore, it articulated how an additional additional funds would be spent. So I want to ensure that, you know, with this recommendation that staff is going to follow what the recommendation recommendation was to allocate that additional'",
        "'speaker_4': 'funds to additional web pages and voicemails.'",
        "'speaker_6': 'Right. So the discretion would still be with staff. Correct. And they did do a great job, as you noted, in reassigning as you had instructed and hoped for from the last council meeting, reassigning some of the line items to make a more efficient strike at those those outcomes.'",
        "'speaker_4': 'So sure. So I will second that. But the other thing I wanted to chime in on, I think it's incredible that, you know, a number of council members expressed interest in more divide by nine funds to meet needs, infrastructure needs of their district.'",
        "'speaker_4': 'I notice that it says that on a case by case basis, program dollars would come back to city council. How is that different than what we do today?'",
        "'speaker_6': 'That's not that's how we do it today. Okay.'",
        "'speaker_4': 'So I remember when we initially funded the BSA program we carved out, and I know it can be tricky at times to ensure that infrastructure dollars are spent on infrastructure, but the Council at that point did take a step and say and they allocated a small portion to in case a circumstance like a Be Safe Park program'",
        "'speaker_4': 'and things like that did come up and we handled it all in one fell swoop instead of wasting time, bringing case by case by case to the city council. So the funding for it was in Parks and Rec infrastructure.'",
        "'speaker_4': 'They allocated a portion of it to additional park programs that year should the council members choose to utilize it. So the question is, have that come up in your discussions and and maybe I'll just put it out there just for general consensus.'",
        "'speaker_4': 'How does the Council generally feel about if we were to say, you know, we want to reserve 20%, 10% in case a council member chooses to support a park program like the Great Be Safe program that's gone two years, two years citywide.'",
        "'speaker_4': 'What what do you what do you think?'",
        "'speaker_6': 'Yeah. So our history has not been a designated percentage of that amount. I think in the past when it's come forward, council members bring that forward. It serves a couple of purposes. One, really to illuminate us on the different uses.'",
        "'speaker_6': 'I think we certainly learn from each other in the creative ways that you've been able to use infrastructure dollars to really support safety, but also it has infrastructure aspect to it as well. So hearing it and making that recommendation to the full council I think is instructive.'",
        "'speaker_6': 'It's not so much to diminish the individual council members discretion, but really to be more instructive on how these dollars are used. But in the past, my my recollection is that it had not been set aside.'",
        "'speaker_3': 'Mr. WEST Mayor, Vice Mayor, the count the last time we did this, the divide by around on the council specifically set aside for the be safe for the.'",
        "'speaker_6': 'Safe.'",
        "'speaker_3': 'Programs list was used for the be safe program that that was that just could go forward and wouldn't have to come back to the council.'",
        "'speaker_5': 'The make clarification the last time we did this I believe it was a $200,000 each to each council district. And the and I actually made the motion half of it went toward programs. If the council member desired to do so and so be safe was part of that.'",
        "'speaker_5': 'But we also did other things in our district recreation related to to with that with those funds and so with.'",
        "'speaker_1': 'Who we are. Just give it one sec. So actually I don't remember the exact phrasing of the motion, but I think the motion allowed for some of the infrastructure part dollars to be programmatic.'",
        "'speaker_4': 'An example example is, you know, some of it were still materials and supplies that went to the parks like a soccer ball or replace a thing at the park that really need to be replaced that isn't necessarily bolted down in infrastructure, but they do support the programs that are there in the material, you know, material costs.'",
        "'speaker_4': 'And just another thing, note, in Council District nine, even though we have the ability to spend 50% of that 200,000, we only spent maybe 15,000 of it to support programs. We didn't spend close to that much. Right? So it was more so having the flexibility to make that decision.'",
        "'speaker_1': 'So let me let me take this back to Vice Mayor Lowenthal, and I have some additional comments after after this. And then if staff wants to do an A clarification, they can. Vice Mayor.'",
        "'speaker_6': 'I appreciate Mr. West's clarification. You're absolutely right. For be safe. There was that specific carve out. And if that's the interest of the council, certainly you can you can make that determination in your own district. I mean, these are not very high dollar amounts there.'",
        "'speaker_1': 'Well, so let me maybe I can bring some clarity to this. And if we're on the same page, so what we have in front of us is discretionary infrastructure, dollars for for infrastructure and or parks per district. Within that, there could be some discretionary part programmatic dollars that you could use for park programing, as you know, as'",
        "'speaker_1': 'that is being worked and discussed with with the parks the Parks Department as an end to move US dollars forward. We in the last time we we broke up the programmatic dollars I believe the the programmatic dollars didn't exceed a certain amount.'",
        "'speaker_1': 'So they were ensuring that infrastructure was being done. I think the last round I think it was $100,000. That's not correct. So I don't know for do we want to just leave, put a number one, two up to $100,000 on the programmatic side by summer.'",
        "'speaker_6': 'Per district.'",
        "'speaker_1': 'Per district, yes. Okay. So that's that's what we have. So that will allow everyone to add additional park programs. They'll be safe if those are if that's the need.'",
        "'speaker_2': 'Okay.'",
        "'speaker_6': 'And Mr. West, do you recall or the our finance bureau, how much of of infrastructure dollars were actually programed for for park programing?'",
        "'speaker_3': 'I'm going to give that to George Chapman.'",
        "'speaker_2': 'Vice mayor, members of the city council two years ago was $100,000. And some of that money did roll over last year. It was for Be Safe and it was 200,000 total for the programs.'",
        "'speaker_6': 'So it wasn't 100,000 per district?'",
        "'speaker_2': 'I believe it was. It was it was the district's discretion to use that up to that amount.'",
        "'speaker_8': 'But each.'",
        "'speaker_6': 'District did not, for instance, the council district to use $17,000, 17.'",
        "'speaker_2': 'Five. The maximum was 100,000 yet.'",
        "'speaker_1': 'And in fact, you didn't have to use any of it for programmatic dollars. You can put all of it just to streets and sidewalks, if you if I recall.'",
        "'speaker_6': 'And that's at the discretion of the council.'",
        "'speaker_2': 'Correct?'",
        "'speaker_6': 'Were there any other.'",
        "'speaker_1': 'I have some additional questions or comment from counsel or should we go through those right now? Yes. Okay. So we have what we have. Those were all the book recommendations, correct? Vice Mayor?'",
        "'speaker_6': 'No, we have the language access.'",
        "'speaker_1': 'Okay. And we still have the language access.'",
        "'speaker_6': 'We have language access. And then we have a recommendation that I think we'll take up with 1.14 on shifting Park Ranger Course Center.'",
        "'speaker_1': 'Okay. Did you want to finish up all the recommendations for for for B or C? I'm sorry. And then we'll get to these comments.'",
        "'speaker_6': 'We can do that.'",
        "'speaker_1': 'Okay. Could continue.'",
        "'speaker_6': 'We can certainly do that. So we dispensed with items comprising $3,850,000 for our infrastructure divide by $9. This as recommended by Bossi and also the city prosecutors request of $58,280 under language access. What we would like to do if we look at staff's.'",
        "'speaker_6': 'Recommendation.'",
        "'speaker_8': 'Exhibit A?'",
        "'speaker_6': 'Exhibit A, thank you. No, I have it. And I don't know if everyone has a staff has a chart. Thank you. I think it plays it out. So we'd like to go ahead and revise the PSC recommendation from Receive and File.'",
        "'speaker_6': 'And that was a received file of $149,704. And we'd like to go ahead and revise it in this way with the total being an additional $100,000 to the staff recommendation. And so what we'd like to recommend is to approve $97,000 of the staff's recommendation, holding back 52,000, itemized for recorded telephonic messages, and then taking the 52 that's'",
        "'speaker_6': 'held back from the staff recommendation, along with adding $100,000 from the. Bear with me 1/2. I want to call the fund by its correct name. My left side. Here we are. Artificial turf conversion. Take $100,000 from the artificial turf conversion, which currently is $1,369,000, and assign that to language access.'",
        "'speaker_6': 'And so this will allow set aside to allow staff to determine the allocation of $150,000 for phone line translation and moving toward a single line access where there's no wrong door. As Councilmember Mongo had put it earlier, instead of 91 lines, let's move toward a single line.'",
        "'speaker_6': 'And then based on the staff's assessment of needs, so this is still the $149,000 IT staff recommended with an additional $100,000 from the Artificial Turf Conversion Fund, which staff has assured us that the turf conversion will take place even with $100,000 less.'",
        "'speaker_6': 'And that's our recommendation.'",
        "'speaker_1': 'Okay. And those are all the bills we went through, all the PSC.'",
        "'speaker_6': 'And the Ranger item. They're not a B or C item, but they would be an amendment that Councilmember Mongo and I would like to make to the 1.14 item.'",
        "'speaker_1': 'Would you want to wait a 1.1 for or.'",
        "'speaker_6': 'I can mention it now.'",
        "'speaker_8': 'Okay.'",
        "'speaker_6': 'So Park Rangers has been an item that members of the community has raised with us. I think there is consensus among our council toward public safety. I've mentioned this before. We find that it's a little odd that they report to Parks, Recreation and Marine, even though they are park rangers.'",
        "'speaker_6': 'And we'd like to recommend that we transfer the existing cost center to Chief McDonald to the police department. And then at that time, I think the Chief will have flexibility to to incorporate the park rangers into the police program, have a better ability to assess what additional needs might exist in the parks, but also have a coordinated'",
        "'speaker_6': 'effort with Mr. Sharpton's pilot program for park security.'",
        "'speaker_1': 'Right. Excellent. Thank you. Okay. So those are the recommendations. I have a couple council comments on this item. And just as a reminder, there will be other there's a few other items are there there are opportunities for a larger council discussion, if so, need be.'",
        "'speaker_1': 'Councilmember Price.'",
        "'speaker_0': 'Thank you. I appreciate the recommendations that I was just handed from the PSC and appreciate the work that went into formulating these recommendations. I will say I speak for myself when I say I'm not ready to vote on this item.'",
        "'speaker_0': 'And the reason for that is, as I have indicated in the past, it would be my intent to see if some one time dollars can be allocated to public safety, specifically to address the issue of residential burglaries and beefing up that detail and working with residents to develop a strategic, comprehensive plan for how we can tackle those'",
        "'speaker_0': 'as a city. I have talked with the chief about it and I know that there will be a presentation to the Public Safety Committee on Friday regarding, you know, how money would be used in regards to that particular goal.'",
        "'speaker_0': 'Where would that money be spent? What type of impact do we believe it would make for the city? As I've indicated on many occasions, the issue of crime as it is, is an issue citywide. The issue of residential burglaries is an issue citywide.'",
        "'speaker_0': 'And although it doesn't qualify under some definitions as a violent crime, residential burglaries are in fact violent and can be very violent. And so I would like to see some recommendations in terms of our use of one time dollars towards over time to address the specific issue of residential burglaries.'",
        "'speaker_0': 'I also heard the recommendation regarding the park ranger program. I think that it makes a lot of sense to have the park rangers report to the police chief and come originate from that department. I am in favor of exploring the possibility of having a park ranger program or enhancing our park ranger program.'",
        "'speaker_0': 'I am looking forward to learning what some of our options might be in that regard, and that's why I think it's premature at this time, at least speaking for myself to adopt the BRC recommendations, because they don't as presented now include any allocation of funding for public any additional allocation of funding for public safety.'",
        "'speaker_0': 'So thank.'",
        "'speaker_1': 'You. Thank you. Councilmember Mongo.'",
        "'speaker_7': 'So two comments, one comment in conjunction with my colleague who isn't here at this time. Earlier in the body, there was a discussion about the infrastructure funds and the. Insistence that they are maintained as infrastructure funds. I think if you had any or Councilmember Lowenthal had any other comments, but he was specific that his intent in making'",
        "'speaker_7': 'that recommendation and being the second on that recommendation was that they would stay for infrastructure and that any non infrastructure item would be brought back to the full council. Because it's important that at our this was me speaking at our retreat, we talked about infrastructure as a citywide issue that impacts every single constituent business owner and visitor'",
        "'speaker_7': '. And so we need to ensure that each and every decision to pull from infrastructure funds is itemized and will fit, while 100,000 each doesn't sound like much. That's $1,000,000 rounds up to $1,000,000. So we need to be very careful about that.'",
        "'speaker_7': 'And then specifically, I'm in agreement with Councilmember Price and we do need to look at public safety. I think one of the reasons that I made the recommendation to move the park rangers over to PD is also that we are setting aside $2.2 million of discretionary funds for the chief to be able to evaluate and assess and'",
        "'speaker_7': 'potentially ramp up in the hotspot areas or more appropriately, depending on the level of hotspot, apply overtime of police hours for that and or residential burglaries.'",
        "'speaker_1': 'Great. Thank you, Councilmember you Ringa.'",
        "'speaker_9': 'Thank you, Mayor. Knowing that one size does not fit all. I'm wondering if when these discretionary funds are allocated, some areas are larger than others. Districts are larger. More are issues with infrastructure, more sidewalks, more streets than other areas.'",
        "'speaker_9': 'Is there a a process by which if all the money tonight expended in some districts, or if I choose not to expend all that all the money in one year, is there a carry over that? Is that possible?'",
        "'speaker_1': 'So there's the process right now. And please correct me if I'm wrong on this. Is it depending what part of money we're looking at, so our general infrastructure dollars that we have. So we have a system where a percentage of the funds that we have within the budget, not separate of this fund, but the general money that's'",
        "'speaker_1': 'in the budget right now. There is a piece of that is done by by needs, a percentage of it actually done by citywide need. And then there's a piece of it that gets broken up so that each district has a floor of money, but then the need goes citywide.'",
        "'speaker_1': 'And so that is divided up in the budget. Currently, that's been a policy. Is that correct, Mr. West?'",
        "'speaker_3': 'Correct. We have money in the budget for streets and sidewalks for that prop C, measure R, prop A, but the one time money would not be helped.'",
        "'speaker_1': 'Those standards and any I believe any additional money that would not spent would just be rolled over like we do all the time into the budget.'",
        "'speaker_3': 'This is something we work with the Bossie the the latest policy the bossy was to at least if not expend the money allocate that money within the 12 month period. So it's allocated because many times it can't be spent within that 12 month period depending on the project, but certainly to allocate it so you know where it's'",
        "'speaker_3': 'going.'",
        "'speaker_1': 'Councilor Austin.'",
        "'speaker_5': 'Thank you very much. I wanted to just address a couple of of the comments that were made here. Councilmember Price mentioned the theme, the need to invest more into public safety on top of the the allocation that we've already recommended in this budget.'",
        "'speaker_5': 'And I do support that. I'm not too sure that I support, you know, putting police officers unnecessarily in parks. I would I would I think we have a unique opportunity. And if we want to invest more, we need to be smarter with our resources and look at possibly putting cameras in our parks.'",
        "'speaker_5': 'That technology, I think, will go a long way to addressing public safety concerns of many of our residents. And so if there is a one time use I'd like to see put into it in addition to what we want to do, I'd like to see it go in that direction and identify some of our troubled parks and'",
        "'speaker_5': 'and address need specific and to the city. Councilmember Mango's point regarding infrastructure. When we decided as a council a year and a half ago to appropriate $200,000 per council district and then give Council members the discretion to use infrastructure dollars for park programs.'",
        "'speaker_5': 'We said that we were investing in human infrastructure as well. Are our children in some areas of the cities that does not have don't don't have the same opportunities as others to engage in youth sports because their park resources aren't there.'",
        "'speaker_5': 'And so we have to give the Parks and Recreation Department an understanding that every district is different. Not all of our districts are. This is not a cookie cutter approach necessarily understanding that that that we have to give our parks and recreation department some some resources to do after summer programs.'",
        "'speaker_5': 'I think that went a long way toward addressing some of our public safety concerns, to be quite honest with you. In some areas of our city and work, I can tell you Wonder's in my district it's something that that our youth obviously support of but for many of our residents as well because they saw the benefit.'",
        "'speaker_5': 'We also programed a peace basketball program which targeted 18 to 25 year olds. That's a demographic that's actually left out in terms of a lot of programing. And it went a long way. And this this hundred thousand dollars was actually rolled over two years.'",
        "'speaker_5': 'And I think we spent maybe $60,000 in total doing summer programs at two parks as well as as that. And so the the investment was minimal and we got a big return for it. And so I understand the point regarding infrastructure.'",
        "'speaker_5': 'It's a priority for me as well because, you know, I have one of the larger geographic districts this this this particular budget may or may not be as as equitable as as it could be, but it's something that I'm willing to support if if we put it to the vote tonight.'",
        "'speaker_1': 'Thank you. Councilmember Gonzalez.'",
        "'speaker_0': 'Yes. So I want to say to that thank you to the BBC for putting this together because I think it's great. I know personally the infrastructure dollars have been well used in the First District, so much so that my predecessor has spent all of our money.'",
        "'speaker_0': 'So I have to. We added security cameras at Drake Park. I'm looking forward to adding them at Washington neighborhood, the Be Safe program and two parks, which is wonderful. So I really see the value in the 3.8 million being divided by nine.'",
        "'speaker_0': 'And I know that the I think we're going to talk a little bit more about the park plan versus just the park ranger. I don't know if Vice Mayor Lowenthal was going to go into that a little bit more, just so we can get some clarity as to what that entailed.'",
        "'speaker_6': 'Exactly, because.'",
        "'speaker_0': 'The park plan.'",
        "'speaker_6': 'Mr. Chapman, is here, I believe, you know. Yes. He'll be.'",
        "'speaker_2': 'Here soon.'",
        "'speaker_6': 'He'll be retrieved. So while he's coming, there were two programs that our director of parks had proposed. One was more like an ambassador program and this pilot project. Mr. Chaplin, if I can have you describe it, what the security proposal is and how they would be different from what our current staffing is now.'",
        "'speaker_2': 'Yes, I'm sorry. I was out of the room for a second, but the Park Patrol, it's a pilot project that we're currently instituting at Bixby Park. And these are young adults who have been working for our department, probably on an average of five or six years 23, 24, 25 year olds.'",
        "'speaker_2': 'They were chosen because they are assertive. They're not shy about engaging with people. So their job is to engage with residents, with patrons of the park, inform them about park programs in a positive way, and also look for behaviors.'",
        "'speaker_2': 'They were trained by the police department to look for specific behaviors that are unlawful and report those to the police. They can either engage people such as if they find someone smoking, they will walk up to that person and tell them that smoking is not allowed in the park.'",
        "'speaker_2': 'It's it's illegal to smoke in a park. Most times people will will cease that behavior. If not, then the park patrol folks or staff are trained to call PD and the police department come out and stop that behavior, whether it's an arrest or a citation.'",
        "'speaker_2': 'So well-trained. We have a follow up, another follow up session with the police department for more training. But in essence, they they're trained to engage.'",
        "'speaker_6': 'How many individuals do you have again?'",
        "'speaker_2': 'We had about 12 to 13 people that were trained by the police department. So we're rotating and they are at the parks right now. They're at Bixby Park and should be seven days a week weekdays from 430 to about nine or eight 4430 to 830, and then weekends from 10 to 6 every day.'",
        "'speaker_6': 'Mr. Mayor, can we have Chief Learner describe the relationship between the security group? I want to call them security detail, but they're not part of our patrol. And how it's working with PD.'",
        "'speaker_1': 'Absolutely. Deputy Chief. Yes, mayor. Vice Mayor.'",
        "'speaker_2': 'Thank you for the question. We based the program based on our downtown guides. As you know, with the DPA, the downtown.'",
        "'speaker_5': 'Guides has.'",
        "'speaker_2': 'Been an outstanding program for us. They're our eyes and ears, and they've been very successful in dealing with.'",
        "'speaker_5': 'Not only crime issues, but specifically.'",
        "'speaker_2': 'Quality of life issues. And if you look at the the challenges that we face both at Bixby Park and a lot of the parks that we get complaints from our constituency, from the majority of them are quality of life issues.'",
        "'speaker_2': 'So we are working with Parks and Rec.'",
        "'speaker_5': 'We developed this program, as Mr. Champion said, we train them.'",
        "'speaker_1': 'We're going to continue to.'",
        "'speaker_5': 'Train with them. Communication and coordination is the key.'",
        "'speaker_2': 'And I think although the program hasn't been around very long, I think thus far it's been very successful and I'm really looking forward.'",
        "'speaker_5': 'To seeing how.'",
        "'speaker_2': 'Successful it is and maybe move it to other parks in the city and in vice. Mayor, if I may add, these are staff people that are walking the park 8 hours a day on a Saturday and 8 hours a day on a Sunday.'",
        "'speaker_2': 'They are literally getting to know all the patrons, the regular patrons that come in. And again, like I said, they're informing them about recreation programs, about programs in the city. If it's a homeless person, they refer to the homeless coordinator for services and they are recognizing some of the trouble area, like the drinking and where that drinking'",
        "'speaker_2': 'is coming from, which potentially which liquor store. And we're working with the police department to address those kind of things. So it's really I think it's it's it's so far successful.'",
        "'speaker_0': 'Thank you. Those are the questions I had. Appreciate it. Thank you.'",
        "'speaker_1': 'Okay. And then I have Constable Mongeau up next.'",
        "'speaker_7': 'So I just want to make a couple of quick comments. Coming before this council in several weeks will be a street infrastructure plan brought to us by our parks and our public works director. And one of the things that the plan will show is which.'",
        "'speaker_7': 'Historical districts have had the amount of money necessary to invest in infrastructure, and those districts will be allocated less funding than districts who have taken care of themselves, which theoretically would have less need. And so one of the challenges we have here, when we start taking infrastructure, money and spending it on program, is that then it creates'",
        "'speaker_7': 'a false need in certain districts where they then would theoretically get a larger share of the annual 18 million of ongoing funds. So whether the 18 millions emergency funds, measure C funds, all of that, there's 8 million citywide and with the streets plan, it will be proposed based on need.'",
        "'speaker_7': 'And the districts that are going to have the highest need are the districts that have been less invested in. And I'm not saying that your districts are less invested in. I'm saying that there are five of us who are inheriting districts along with a lot of other components.'",
        "'speaker_7': 'Summer programs are a high priority for me. I was a sports director at the Long Beach YMCA for many years. I feel that these programs are the best thing to keep people out of the back of our black and whites.'",
        "'speaker_7': 'And so I'm invested in those things. I just feel that 25% of our one times is probably too high to set aside for programing by district. That's my comment on that. And I have the most streets and sidewalks, so I definitely identify with you.'",
        "'speaker_7': 'You're right up there with me and we're both in a tough position that we're both going to have a lot of need coming in this next round. So. With relation to Mrs. Price. Do we want to make a friendly announcement regarding the.'",
        "'speaker_7': 'Okay. So earlier today we made a recommendation from the BSE that states that should the city prosecutor's office come in with some savings, that they would be able to set that money aside for up to $50,000 in expenditures for their need.'",
        "'speaker_7': 'So what I think Councilmember Price and I would like to do is if the Long Beach PD is going to be able to come in under budget, the under budget amount would be approximately 2% to fund what he would need for the $350,000 residential.'",
        "'speaker_7': 'Gwen, help me out here.'",
        "'speaker_0': 'Sure. Residential burglaries. Detail and strategic plan.'",
        "'speaker_7': 'So should that money come in at year end? Closing in September. And we'd like to first reserve up to $350,000 for this program as a friendly amendment. Would that be something you'd accept?'",
        "'speaker_6': 'Could we go ahead and wait for item 1.1 for. Yes, and take it up at that time.'",
        "'speaker_1': 'And just also, as a as a side note, I think that Councilmember Austin, the amount I know that we that right now the amount is $100,000, but the amount spent is actually usually no more than about $25,000. And so they're very comfortable bringing that 100,000 down to, you know, 25, 50, let's say 50,000, which is half the'",
        "'speaker_1': 'amount, I think that takes care of some of the concerns and will certainly cover the BSA program in some of those neighborhood park districts that need the money. So there's no disagreement with that. We'll move on to Councilmember Andrews.'",
        "'speaker_2': 'Yes, thank you, Amir. You know, I'm really I want first of all, I'd like to think the B or C, you know, for working very, very hard with this budget. And I'm really I'm overly excited about, you know, park rangers because the fact that by having those park rangers, I don't know of any individual ever go out'",
        "'speaker_2': 'of those parks. And a lot of people are crying about the, you know, the danger and some of the problems that we have in our parks. And I think with these park rangers, they are which Mr. Champion has really put a good program together.'",
        "'speaker_2': 'This would be great because these individuals, they do not engage. And from that seen into the police, I don't really think we need to have policemen, you know, in the parks themselves. But I think this new program, Mrs. Champion, is speaking about these individuals who are being trained by the police so they will know how to get'",
        "'speaker_2': 'things done. I think this is a great idea and I would totally support something of this type. And I, I really see that this is going to help our parks for our safety. And when we talk about, you know, home invasion, which is probably one of the number one crimes we have today, this would relieve a lot'",
        "'speaker_2': 'of our policemen from being in the parks. At least they can work on the situation where we're having most of our problems and that's home invasion. So I think these things will work out themselves if we do it in the right way.'",
        "'speaker_2': 'And I want to thank Mr. Jabu and the police department for working together to make these things work.'",
        "'speaker_1': 'Thank you. Okay, let's get to a vote on this item. I think I may have another comment. Are you still up upcountry, Richardson? Okay, go ahead.'",
        "'speaker_4': 'Thanks. So just wanted to chime in again on. Thank you, Councilmember Gonzalez, for asking more clarity on the ambassador's program. I was unclear as well on what it was. So so my my question is, how much does that how much does that cost?'",
        "'speaker_4': 'A year to run the Park Ambassadors program.'",
        "'speaker_2': 'For permanent council councilmember members of the City Council. It's part security. It costs about $58,000 year round. Now, there's there's another model where we can scale it back during the winter months. Yeah. And just do you know, weekends in the winter months and full time during the summer months.'",
        "'speaker_2': 'And that's about 36,000%.'",
        "'speaker_4': 'And so that that pilot was funded in this past year.'",
        "'speaker_2': 'Well, it wasn't funded. It was we have a vacancy. And the one site, a supervisor vacancy. So we're using money from that vacancy right now.'",
        "'speaker_4': 'Great. I'd like to ask that. So the the business district not hurt. I heard someone mention I think it was Deputy Chief Luna mentioned the guides downtown, the business district in uptown that Highland Park is actually a part of their launching in ambassador program in a month.'",
        "'speaker_4': 'That's essentially what you just described. And considering Highland Park is a member of that district. I wonder if there's a way that you can partner to leverage the dollars that help in part with the assessment dollars to see if they can work together on on this ambassador program this year.'",
        "'speaker_4': 'That that's something that we can look into.'",
        "'speaker_2': 'But I think we certainly can look into it.'",
        "'speaker_4': 'Great. Thank you. That's all I have.'",
        "'speaker_1': 'Okay. And then last comment and we're going to go to a vote. Councilman Mango.'",
        "'speaker_7': 'So earlier, I believe it was, Councilmember Durango made a comment related to not being able to allocate all the funds of the one time by the end of the year. What happens to those? I'd like to make a friendly amendment that any funding from 514 that isn't allocated by September 30th be allowed to roll over so that'",
        "'speaker_7': 'the new council members that have those concerns are been able to be met.'",
        "'speaker_1': 'Okay. Make that motion. We're okay with that.'",
        "'speaker_3': 'That that does cause issues for us financially to roll money over like that.'",
        "'speaker_6': 'Can we. Councilmember Mongo, can you restate that?'",
        "'speaker_7': 'So Councilmember at Durango earlier we were discussing that there were funds divide by nine from last year that may have been allocated for something that's either not doable or when we do find out what of that is doable, then it may not come in at that price.'",
        "'speaker_7': 'So let's say, for instance, a council member inherits $100,000 project which is allocated to a particular street, and that street's not available to be done. But when it is completed, it's only 75,000. So that 25 would roll over and still be allowable for the councilmember in any of those areas.'",
        "'speaker_7': 'So any one time not finished by September 30th yet becomes available, would then carryover? Is that what we need?'",
        "'speaker_3': 'Okay. Under that scenario, I retract what I just said. That would be no issues at all.'",
        "'speaker_1': 'Okay. Okay. And Councilman Price.'",
        "'speaker_7': 'He motioned in, seconded.'",
        "'speaker_8': 'Yep.'",
        "'speaker_1': 'Got to replace.'",
        "'speaker_0': 'That. Thank you. Yes. I would like to make an amendment to the motion to reduce the PSC recommendation of 3,850,000 by 300,000 for that remaining 300,000 to go to the Long Beach Police Department for overtime for residential burglary detail.'",
        "'speaker_2': 'Second.'",
        "'speaker_1': 'There's been a motion and a second.'",
        "'speaker_2': 'So in essence is a substitute, correct? Because we already have a motion. And so.'",
        "'speaker_1': 'There's a motion on the floor and this is a substitute.'",
        "'speaker_2': 'Unless this is considered a friendly amount.'",
        "'speaker_1': 'I believe would be used to do this would be a substitute.'",
        "'speaker_2': 'So so unless.'",
        "'speaker_4': 'The author of the original.'",
        "'speaker_2': 'Desires is to be a friendly amendment.'",
        "'speaker_1': 'Right now right now we have a substitute on the floor. So and I'll review what the actual what the motion is in a minute. So Vice Mayor Lowenthal and then I want to review what the substitute is and where the vote is.'",
        "'speaker_6': 'Vice Mayor I might actually like to make a substitute substitute motion. So we had extensive conversation about councilmembers interest in infrastructure divide by $9. I don't believe it's this council, the majority of this council's interest to reduce that by 350,000.'",
        "'speaker_6': 'Prior to your coming in, Councilmember O'Donnell, Councilmember Mungo had made a recommendation which we will take up in item 1.14 to allow the Chief to utilize his year end surplus when his budget to actuals are calculated, his year end surplus to be designated for residential burglary.'",
        "'speaker_6': 'And I do believe that that is a better way to go. And so my substitute substitute would be to revert back to the language of the original motion and work in Councilmember Mungo's recommendation at this point to allow the chief of police to utilize his surplus for for the purpose of residential burglary.'",
        "'speaker_1': 'Okay. Okay. That's been seconded that that's the motion on the floor. I have one last council comment and then we're going to move to I think we have one comment and then the vote. Councilor O'Donnell.'",
        "'speaker_2': 'So what you're saying is if they have a surplus, they would be able to use this money. We're not sure if they will have a surplus. Correct.'",
        "'speaker_6': 'Let me amend it for the. You're absolutely right. So they may not have a surplus. The other alternative is for the chief to utilize some of his existing resources and then wait until January when we do our year end totals for, ah, one time oil revenues.'",
        "'speaker_5': 'That's your.'",
        "'speaker_6': 'Motion. That's my motion, right.'",
        "'speaker_2': 'Yep. And what I'm saying is he doesn't, he doesn't know if he'll have a surplus.'",
        "'speaker_6': 'In his own budget, but we I will, I'm willing to add to that to go ahead and have this council consider during our January year and total of our one time dollars under oil that those revenues be designated as the 350,000 be designated for residential burglaries.'",
        "'speaker_2': 'I guess my my my concern is residential burglaries a problem today? And my concern is that we get funding to it today and not that the chief hopes he has funding for it in the future. So we differ.'",
        "'speaker_2': 'I mean.'",
        "'speaker_6': 'Right. And that's why he would have the opportunity to frontload his need today with the 2.2 million under police over time and then backfill that in January when those resources do come in, which we do project to have some surplus.'",
        "'speaker_2': 'But we have the opportunity to fund it right now and address this issue right now. Today, because I have neighbors who are calling me and I are quite concerned about the uptick in residential burglaries. I'm I want to address it in mind.'",
        "'speaker_6': 'If I might ask the city manager to allow the chief of police to come up to answer just one question for me, I'd like to know from him what his projections are. My understanding from speaking with our finance folks is that they would come.'",
        "'speaker_0': 'Under.'",
        "'speaker_2': 'My only concern with us now we're budgeting. You know, you're kind of guessing that you're going to have.'",
        "'speaker_3': 'A see if I could make just.'",
        "'speaker_2': 'One, I just holler. I'd like to deal with actuals and what's going on today, not what might happen.'",
        "'speaker_1': 'And now the vice mayor has made a question of the chief. And so if the chief wants to respond and then we're going to go and go to a vote, a public comment and a vote.'",
        "'speaker_2': 'Yeah. Just to just to be able to address that. As of right.'",
        "'speaker_5': 'Now, we're projected to come in to about come.'",
        "'speaker_2': 'In under about 400,000. But as you know, 400,000 and the size of our budget, that that could change tomorrow with.'",
        "'speaker_5': 'One unusual occurrence. So to to be able.'",
        "'speaker_2': 'To to count on that, I think is.'",
        "'speaker_5': 'Is a push.'",
        "'speaker_2': 'What about.'",
        "'speaker_1': 'Okay, Councilmember Austin?'",
        "'speaker_5': 'Yes. Thank you, Chief. No one is more and more supportive of public safety than myself. And I recognize the need to to address. Initial burglary. I'm not sure we do it with one time funds and with overtime. We haven't heard a plan in terms of how we address this one.'",
        "'speaker_5': 'With all due respect, when Chief McDonnell was here, given the PD budget overview, I mean, he just told you he's on he's over budget right now and he's expecting or projecting a surplus. But I heard that he had a he had what he needed to do with this and understanding that.'",
        "'speaker_5': 'And I'll just be very, very frank with you. I have a concern with with the budgeting and running our police department on overtime, purely overtime in every profession out there. When we we we people get stressed out if they're overworked and we're adding this means we're adding two more hours of overtime to a police officer, you know'",
        "'speaker_5': ', beat overtime. You know, I'm concerned that they're going to be stressed and make bad decisions and that's that's what any profession if you over overdo the overtime. And so I think we've we've we've actually been very generous and we've given our police department what they need in this this budget right now.'",
        "'speaker_5': 'And so I would actually have to speak against this this motion. It is not speaking against public safety. It is speaking against the use of $350,000 that that, I believe, can be made up during our mid-year adjustment.'",
        "'speaker_1': 'Okay. I'm going to go to Councilmember O'Donovan, going to public comment.'",
        "'speaker_2': 'I can talk. Thank you. Just a question. Would you be open to say right now we use the infrastructure money, then they come up with a surplus in January that we then divert that money back to to infrastructure and use the surplus money for the the services provided in the interim.'",
        "'speaker_2': 'Would you be open to that?'",
        "'speaker_3': 'COUNCILMEMBER Mayor, we were just talking about that myself in the budget manager that perhaps rather than dip into the infrastructure at this time, we do believe that in January when we come up with the uplands oil money, there will be $350,000 excess there.'",
        "'speaker_3': 'If the council could make a decision now to allocate that, that's the first expectation on that money would be $350,000 that we've got.'",
        "'speaker_6': 'That's the nature of the substitute substitute motion.'",
        "'speaker_3': 'And and then we could just tell the chief to begin this October 1st started acknowledging that he's going to get $350,000 from the uplands oil in January. Okay.'",
        "'speaker_1': 'So so the substitute substitute is, as mentioned by Vice Marie Lowenthal with the first 350,000 that we are going to get out of the out of the uplands oil that will go to the residents.'",
        "'speaker_2': 'Okay. Just just to clarify, though, so this means that the chief has the ability and the dollars to institute a very proactive program to address residential crime burglary across the city. We're talking about Dodge. So I want to ensure that there's going to be have the dollars.'",
        "'speaker_3': 'In the chief is consistent.'",
        "'speaker_2': 'With that desire.'",
        "'speaker_3': 'He can start October 1st. And if you're ready, he can he can tell you exactly what he's going to do.'",
        "'speaker_2': 'I don't need to know exactly. I just want to know that that's what we're going to do. That's the October 1st. Got it. Thank you.'",
        "'speaker_1': 'Thank you. Now, I'm going to go to any public comment on this. This particular item, I think there was somebody that was up here on the set, please come forward.'",
        "'speaker_3': 'Good evening, everyone. My name is Jan Victor Anderson and I'm with ECI Communities for Environmental Justice and also part of the Language Access Coalition. So thank you again tonight for discussing extensively this amazing budget that will make the city run amazing.'",
        "'speaker_3': 'Right? We truly appreciate biking here. Lowenthal added $100,000 to the language access policy. But that's not all we need. We need another 110,000 to fund a third of the original policy. So that's 100. Since there's a lot of numbers, I'm gonna repeat it.'",
        "'speaker_3': 'That's 110,000 extra that we need to fund just a third of the original policy that we asked for. Way back when, when it was approved. And so we need your leadership tonight to allocate that extra 110,000, because the community cannot wait.'",
        "'speaker_3': 'These are these are doors that are being closed to them, like you're talking about this open door because they can access the resources. And we need you, as our city council member, is to take action and represent the community so that they can not only access resources in our city, but also to fund their health and their'",
        "'speaker_3': 'well-being to be able to live in this city. That's that. And that should represent all of us. Thank you so much for your time and.'",
        "'speaker_8': 'Good luck with the budget.'",
        "'speaker_1': 'Thank you. There's a motion on the floor that's been made. Member Please cast your votes.'",
        "'speaker_8': 'Substitute.'",
        "'speaker_6': 'Substitute? Correct. Thank you.'",
        "'speaker_0': 'Motion passes nine zero.'",
        "'speaker_1': 'Okay. Next item, which I believe is 112 Vice Mayor.'"
    ],
    "Ordinance Amendment on Departmental Organization of the City of Long Beach.": [
        "'speaker_6': 'Yes, it is 112 item 1.12. I make the motion to declare ordinance amending the departmental organization ordinance. That makes no sense.'",
        "'speaker_8': 'What?'",
        "'speaker_6': 'I make the motion to declare an ordinance amending the departmental organization ordinance reading the first time and laid over to the next regular meeting to the City Council for final reading. Thank you. There's been a motion in a second, and I know that Miss Erickson would like to address this item, please.'",
        "'speaker_7': 'Thank you, Vice Mayor. This item before you, has been amended based on the mayor's recommendations that were passed just a few minutes ago as item 1.10 and specifically on page ten, online 11. We are renaming the Department of Technology Services to Technology and Innovation Department.'",
        "'speaker_7': 'So that is the change on this item.'",
        "'speaker_6': 'So I am in my motion to the recommended change that Ms.. Erickson just articulated. So second to that, there's been a motion and a second. Is there any member of the public that wants to address Council on item 1.1 to seeing nonmembers cast your vote?'",
        "'speaker_1': 'Okay. Actually, there is a a coming from customary ranga.'",
        "'speaker_6': 'I'm sorry.'",
        "'speaker_9': 'Thank you, Mary. I want to also I want to compliment the civil service department for its restructuring and reinstituting the recruitment division into its department, because recruitment obviously is very important when we come to looking at the diversity in the city.'",
        "'speaker_9': 'As I mentioned in the previous meeting, diversity is an important issue within the city in regards to how we address the needs of our community and the changing demographics that we have in the recruitment division will be one of those divisions that would address diversity in our employment and our representation as to better opportunity and access for'",
        "'speaker_9': 'people in the community to not only get jobs, but to service our individual residents. So I commend the civil service department for that as well. Thank you.'",
        "'speaker_1': 'Thank you. We have an item before us. We've done public comment. Any public comments to mayor?'",
        "'speaker_6': 'I think I think we have comments from Councilmember or at least questions. And I have a question to Mr. Ericson as well. The department change, the name change. Can you repeat that? From what to what?'",
        "'speaker_7': 'So, Vice Mayor, it's the Technology Services Department and it's actually on page eight and it's now going to be the Technology and Innovation Department.'",
        "'speaker_6': 'Okay. Thank you. Technology services to technology innovation, correct?'",
        "'speaker_1': 'Yeah. And then there was a quick ask a question about Councilmember Mongo. I know you didn't mention the director of Economic and Property Development change on 13. Is that part of this this motion as well, or no.'",
        "'speaker_7': 'Mr. Mayor, that's going to be the next item.'",
        "'speaker_6': '1.13. Thank you. So, members, please cast your vote.'",
        "'speaker_0': 'Motion carries nine zero.'",
        "'speaker_6': 'Thank you. Item 1.13. I moved to adopt the amended salary resolution for fiscal year 15, and I believe Ms.. Eriksen has an amendment to that.'"
    ],
    "Summary Report on Proposition H.": [
        "'speaker_0': 'Item 13. Communication from City Auditor Recommendation to receive and file the summary report on Proposition H for fiscal year 27 through 2013 code.'",
        "'speaker_1': 'It has been in motion and in the second. And with that, I'm going to turn this over to our city auditor, who is going to make some comments on the on the audit and her work on that.'",
        "'speaker_0': 'So thank you very much. Appreciate your time tonight. I just have a brief summary report to report to you this evening. I really appreciate your discussion earlier on the importance of public safety. This was a measure that was I have a little PowerPoint, I'll be moving along, but it wasn't supposed to be like little keyboard here.'",
        "'speaker_1': 'Madam Clerk, is there something for the auditor there?'",
        "'speaker_0': 'Okay. This was a measure that was passed in 2027. Four. For those of you that weren't here, maybe I can just give a little brief history. One of the first audits our office did was to review the oil production tax in Long Beach and doesn't really seem to be working.'",
        "'speaker_0': 'Okay. There we go. Thank you. And we found that the oil production tax was first established in 1990 here in Long Beach at $0.15 a barrel. When we reviewed it compared to other neighboring cities, we found that Long Beach was the lowest out of all the taxes.'",
        "'speaker_0': 'So we recommended to the council that it be increased by $0.25 per barrel to bring it in line with the neighboring cities. We collaborated with the council, with the mayor, with the oil production companies, and they agreed that $0.40 was fair and equitable.'",
        "'speaker_0': 'The council put that $0.25 increase on the ballot and allocated that to public safety. So I'm here tonight because seven years later we have information and data to show that this has been a consistent and reliable revenue stream and has benefited public safety greatly in the city of Long Beach.'",
        "'speaker_0': 'It was it was an overwhelming success as far as the vote. Over 70% of the vote of the people, the first time in the history of Long Beach that the tax increase had passed. And to report to you over the past seven years, the city of Long Beach has brought in $22 million through this oil production tax'",
        "'speaker_0': '. It has spent $19 million on personnel staffing, 12 police officers, 11 firefighters over the past seven years to improve and strengthen public safety throughout the city. The additional $2.8 million was spent on fire, truck acquisition, retrofit technology uniforms and other safety needs.'",
        "'speaker_0': 'And the ordinance also required our office to perform an annual financial audit to ensure that the city is in fact receiving and collecting all the revenue due from the oil producers and that the money is spent as intended according to the code.'",
        "'speaker_0': 'So our office has agenda is that item for the September 16th consent calendar. I'll be happy to answer to any questions at this time. But I did want to just briefly report tonight that this is a really positive revenue stream for the city, and it has produced $3.5 million annually for public safety specifically.'",
        "'speaker_0': 'And I really want to thank the mayor and the City Council for their collaboration and for what a great benefit this is tangible benefits for our community in strengthening public safety, as well as thanking the police chief and the fire chief for identifying the most beneficial ways of protecting our city by our use of this money.'",
        "'speaker_0': 'So that's my.'",
        "'speaker_1': 'Report. Thank you. And thank you. I'll just let me just add briefly, just I know they speak for most just thank you for all your hard work on on all the issues, particularly this one. I think you've done a great job and it was widely written about in the press, which I know we all have had a'",
        "'speaker_1': 'chance to read. It was great to see that, you know, that your work and the work of the council got the type of real good, thoughtful coverage that it did. Councilmember Andrews.'",
        "'speaker_2': 'Yes. Thank you, Mayor. I truly want to thank our city auntie, Mrs. Laura Dowd, you and her staff for that very, you know, informative report on Prop eight. You know what? While while I do appreciate the carryover funds and the interests that it attracts, I want to make sure that we are all supplying the police and the'",
        "'speaker_2': 'fire department with all the tools they need to continue to keep our city and street safe. And thank you very much, Mrs. Dowd.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_4': 'I also wanted to chime in and just say great work and thank you for showing this data. I think it really builds good faith with the voters to show that when they step out and make investments in our city, we do track it and we spend it the right way appropriately to provide the services that are much'",
        "'speaker_4': 'needed and they count on. So thank you for providing that transparency.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember O'Donnell.'",
        "'speaker_2': 'I just want to acknowledge the work of Brian Meneghini, my chief of staff, who actually led the ground effort on this campaign to get this passed. So that was how it was a collaboration, like you mentioned for sure.'",
        "'speaker_2': 'I just want to acknowledge him. Thank you. The people.'",
        "'speaker_4': 'Who actually run the campaign and do the do the.'",
        "'speaker_2': 'Groundwork don't often get acknowledged. So congratulations to him for helping get this passed as well. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Councilmember Ringa.'",
        "'speaker_9': 'I'm not sure if this update comes every year, but it certainly explains a lot of things for me in regards to how our moneys are spent with with the transfer of funds that go to it to to provide additional officers where police departments.'",
        "'speaker_9': 'I want to thank you for that as well.'",
        "'speaker_8': 'Thank you. Thank you.'",
        "'speaker_1': 'Thank you. And we have a motion on the floor if there's any public comment on the item. See none. Thanks again for the report. Members, please cast your vote.'",
        "'speaker_2': 'I think.'",
        "'speaker_0': 'Councilman Richardson. Motion carries nine zero.'",
        "'speaker_1': 'All right. Thank you. Now we're going to be going back to 1.15, which is it turned back to Vice Mayor Lowenthal, which is the first of the two final votes. And I believe that everyone has the recommendations as amended.'"
    ],
    "Ordinance to Approve and Adopt the City Budget for Fiscal Year 2014 - 2015.": [
        "'speaker_6': 'Item 1.16. I moved to declare the appropriations ordinance for fiscal year 15, creating and establishing the funds of the municipal government and appropriating money to and authorizing expenditures from said funds and force said fiscal year as an emergency ordinance read an adopted as read and laid over to the actually no, just read and adopted as read.'",
        "'speaker_6': 'Are we laying it over for? Yes, we are yet and laying it over to the next regular meeting of the City Council for final reading and council members. We have the hand out that's been passed out is. ERICKSEN Did you want to speak to it?'",
        "'speaker_7': 'Yes. Vice Mayor, you have at your desk three handouts. The first is the amended motion that includes both what was recommended by the U.S. and what was amended on the floor of council. So you this is the same as what you had before.'",
        "'speaker_7': 'But then there's a new section called Additional Changes on the floor of council, and there you'll have the $100,000 that goes to the language access plan from artificial turf conversion. And it makes note about the using money for the voice mail conversion to go towards L.A. P implementation to CUDA one phone number initiative and also includes the'",
        "'speaker_7': 'contingent appropriation for police overtime for residential burglary up to $350,000 from the FY 2014 up on surplus. And it also lastly includes the transfer of the park ranger program in parks to police and that is also subject to the meeting confer process.'",
        "'speaker_7': 'Also in front of you, you have exhibit A and Exhibit B, these are the appropriation ordinances, these appropriation ordinances with Exhibit A appropriate by fund the entire budget, and that includes the changes that were modified today. And then Exhibit B does the appropriation by department also includes the changes that were discussed today?'",
        "'speaker_7': 'And by approving this, you are approving and appropriating.'",
        "'speaker_0': 'The F 15 budget.'",
        "'speaker_6': 'Thank you. Ms.. ERICKSON And so council members, my motion is to include the amendments that we had agreed to, as well as both in Exhibit A and Exhibit B, the transfer amounts.'",
        "'speaker_1': 'There's been a there's been a motion and a second. Councilor Richardson.'",
        "'speaker_4': 'Just a point of clarification on the not exhibit A or Exhibit B, but the Bill C recommendations as amended on the floor. The use of the the use on the the one time council divided by nine funds, the description seems a little bit different.'",
        "'speaker_4': 'Is that a mistake?'",
        "'speaker_7': 'We're prepared this madam or councilmember. That actually wasn't amended. So that that should be noted that we did talk about was it up to $100,000 for 50 sorry, $50,000 per district for the park ranger program.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_6': 'Not park range.'",
        "'speaker_8': 'Programing for.'",
        "'speaker_2': 'Part programing. Part programing.'",
        "'speaker_7': 'Part programing.'",
        "'speaker_1': 'So excellent. So we have a motion on the floor. I would take any public comment.'",
        "'speaker_6': 'Good evening, Suzanne Brown, senior attorney with the Legal Aid Foundation.'",
        "'speaker_7': 'Here in Long Beach. Congratulations. You're almost there. It's been a long night. One thing we just want to point out with respect to the language access motion, there might be a little bit of confusion. I think there was discussion about the 311 phone line and how it's a really good idea, but that it's not actually part of'",
        "'speaker_7': 'the policy. It's something that would be done separately. And so we would ask that that language be removed from the proposal before you and that the 311 line be examined separately, because that's really about general access for the city.'",
        "'speaker_7': 'It's not the language access issue. It's no matter what your language is, if you want to have a a policy where the doors and shut on you. So we would ask that that please be removed in the hundred thousand.'",
        "'speaker_7': 'Be fully dedicated to language access. Thank you.'",
        "'speaker_1': 'Thank you. We have a motion on the floor. Closed public comment. Please cast your votes.'",
        "'speaker_0': 'Motion carries nine zero.'",
        "'speaker_1': 'Thank you. Just want to say just a few things. First, I want to congratulate the full City Council on passing a responsible, balanced and budget that really looks towards towards the future as far as putting my dollars aside.'",
        "'speaker_1': 'There's certainly always more need than there is resources. And I think that there are a lot of very credible programs, projects out there that were not as part of this budget that we all would like to see. And I think it's obviously up to us to move forward and work with the community and all of our and'",
        "'speaker_1': 'all of the stakeholders to ensure that we're able to meet the needs as far as we can afford that moving forward. So I wanted to congratulate the Council again on passing the budget early, which I think is says a lot about this new this new council coming in as well.'",
        "'speaker_1': 'They've been doing their work and it's been a thoughtful process. I also want to thank the members of the B or C, Vice Mayor Lowenthal, Councilmember Patrick O'Donnell and Councilmember Stacy Mongeau for their work, as well as all the the meetings that happened throughout the community.'",
        "'speaker_1': 'Vice Chair Patrick O'Donnell And just that and and also I think we owe a big thank you to staff and not just obviously financial management and the city manager, but all of the employees and all the budget officers.'",
        "'speaker_1': 'And we have a significant amount of reason this work happens all year. They're working on the budget. They will start working on the budget again tomorrow. And so this is this is the kind of work that happens at the city.'",
        "'speaker_1': 'And so I wanted to thank all the budget staff and everyone that's involved in putting this budget together. This is a responsible budget, and I think everyone did a great job. So let's give them a round of applause.'",
        "'speaker_1': 'Council for for their hard work. And and with that, we will move on to the rest of the City Council meeting. Madam Clerk.'"
    ],
    "Agreement with CDPH for Women, Infants and Children Nutrition Supplement Program.": [
        "'speaker_0': 'Item 14 Report from Health and Human Services Recommendation to authorize City Manager to execute all documents with the State of California Department of Public Health in the amount of 4,540,000 for the Women, Infant and Children Nutrition Supplemental Program Citywide.'",
        "'speaker_1': 'There's been a motion and a second count from customer your income.'",
        "'speaker_9': 'Thank you. And I just want to note that commend the Department of Health Human Services for bringing this forward and to the city manager for bringing this forward for us toward the documentation. I think it's an excellent program.'",
        "'speaker_9': 'It offers a 20,000, 26,000 families in Long Beach to receive these much needed services to increase access to healthier food that would otherwise be lacking. So I want to commend them for that. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Andrew.'",
        "'speaker_2': 'Yes, thank you, Mayor. And I also would like to echo that premise, Councilman, your anger, because I think programs, one of the most important programs offered in our city, and we have a few locations in our sixth district, you know, which are very, very busy.'",
        "'speaker_2': 'But all I'd just like to say that these programs do save lives and am very, very, you know, happy to support anything that they're concerned to do in any district in the city of Long Beach. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Austin.'",
        "'speaker_5': 'Yeah. I'd also like to just congratulate the Department of Health and Human Services on receiving this grant. It's a sizable grant, $4.5 million. It's going to touch a lot of lives. But more importantly, I think it's our conscious right now that there are a lot of families in poverty in our city that that that are in need'",
        "'speaker_5': '. And so this will go a long way to address that. Thanks.'",
        "'speaker_1': 'Thank you. Public comment on the item. Say nonmembers, please cast your votes.'",
        "'speaker_0': 'Motion carries nine zero.'",
        "'speaker_1': 'Next item.'",
        "'speaker_0': 'Item 14. I'm sorry. Item 15 Report from Long Beach Airport Financial Management and Public Works Recommendation to Award Contract to Kleinfeld or West for airport consulting services in the amount not to exceed 1,000,005 District five.'"
    ],
    "Expectations and Process for Confirming the Next Assistant City Manager.": [
        "'speaker_0': 'Item 19. Communication from Vice Mayor Lowenthal. Councilwoman. Councilwoman Gonzalez. Councilwoman Price. Councilwoman. Mongo. Recommendation to request that City Council communicated its expectations as a basis for confirming of the next assistant city manager.'",
        "'speaker_6': 'Thank you, Madam Clerk. I wanted to thank my co-sponsors, our co-sponsors on this item and really just to make a statement of the importance of getting the right candidate for assistant city manager. Our city manager and his team have done a tremendous job these last several years.'",
        "'speaker_6': 'We do, as a council, recognize the key role of assistant city manager and through this item, we wanted to reaffirm our desire to work closely with the city manager as a council, as a council, the whole body and the role of the city council to confirm the city manager's appointment and certainly the stakeholders of Long Beach.'",
        "'speaker_6': 'While there are only a couple of positions that the City Council has any direct input over, it is very important for us to keep in mind our stakeholders for the city who deserve a dynamic and professional and ethical and approachable assistant city manager who will help us reach our full potential as a city.'",
        "'speaker_6': 'I wanted to mention that while we cannot require that the assistant city manager live in the city of Long Beach, we all understand the value of it. It's been articulated in the motion, and so we're hoping to raise that priority to a top level for us in this process.'"
    ]
}