{
    "Entertainment Permit with Dancing for The Modern, LLC.": [
        "'speaker_9': 'So let's give her a big round of applause. Thank you. Thank you. We have a full agenda. We have three hearings tonight. So just as a reminder, the hearings go first. And so we'll have three hearings and then two items that have been asked to move up on the agenda.'",
        "'speaker_9': 'So let's start with the first hearing hearing item number one, which is if I can, please have the clerk read it and I believe an oath is required.'",
        "'speaker_3': 'Yes. Hearing item one is a report from Financial Management Recommendation to receive supporting documentation into the record, conclude the public hearing and grant an entertainment permit with conditions on the applications of the modern. Located at 2801 is Spring Street, Suite 300 for Entertainment with Dancing District five.'",
        "'speaker_3': 'And it does require an oath. Please raise your right hand. You and each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_3': 'So help you God.'",
        "'speaker_9': 'Thank you. I'll turn this over to Steph. Okay. Thank you, Mr. Mayor.'",
        "'speaker_4': 'The presentation tonight will be conducted by Bret Jockey's business services officer and Emily Armstrong, Business Licensing Division Specialist.'",
        "'speaker_6': 'Good evening, honorable mayor and members of the city council. Tonight you have before you an application.'",
        "'speaker_7': 'For entertainment with dancing for the Modern LLC.'",
        "'speaker_6': 'Located at 2801e Spring Street.'",
        "'speaker_7': 'Suite 300. Operating as a hall rental in Council District five. This application originally came before you on July 24th, 2018, and was continued to allow further discussion on the recommended conditions.'",
        "'speaker_3': 'Staff has amended the conditions.'",
        "'speaker_7': 'As included in the hearing packet and has met with the business owner. I, as well as the police department, stand ready to answer any questions council may have. And that concludes staff's report.'",
        "'speaker_9': 'Okay, thank you. Let me turn this over to Councilman Mongo. We have a motion and a second councilman mango.'",
        "'speaker_10': 'All the conditions on this property are in alignment with others that are significantly similar. I'm very supportive of the current outcome and I appreciate staff and all the work that they've done to date. Thank you.'",
        "'speaker_9': 'Councilman Austin. Any any public comment on this hearing seeing an obvious please come forward.'",
        "'speaker_7': 'Good evening, honorable mayor and city council members.'",
        "'speaker_1': 'My name is Mary.'",
        "'speaker_10': 'Leland 296 Granada Avenue.'",
        "'speaker_7': 'I am the owner.'",
        "'speaker_10': 'Of the Modern. I'd like to take a moment just to thank City Staff.'",
        "'speaker_7': 'Councilwoman Mongeau for taking the extra time to meet with us, to go over the conditions. And we look forward.'",
        "'speaker_10': 'To many fantastic celebrations and events at the modern. Thank you.'",
        "'speaker_9': 'Thank you. Seeing no other. Public comment. We'll go ahead and have a motion or a second. Members, please cast your vote.'"
    ],
    "Ordinance to Repeal and Amend Municipal Code Sections Related to Conditional Use Permits.": [
        "'speaker_3': 'Lucian Karis.'",
        "'speaker_9': 'Thank you. Hearing item two.'",
        "'speaker_3': 'Item Choose the report from Development Services Recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt negative declarations. Zero one Dash 18 declared ordinance amending various sections of Title 21 of the Land Beach Police Code, all relating to conditional use permit.'",
        "'speaker_3': 'Read the first time and lead over to the next regular meeting of the City Council for Final Reading and Adobe Resolution authorizing the Director of Development Services to submit amendment of the Long Beach zoning regulations and supporting materials to the California Coastal Commission for Approval and Certification Citywide.'",
        "'speaker_9': 'Thank you. Staff. Okay. Thank you, Mr. Mayor.'",
        "'speaker_4': 'Tonight's staff presentation will be done by current planning officer Kerry Tai.'",
        "'speaker_10': 'Thank you. Good evening, Mayor Garcia. Members of the city council. Tonight, staff is pleased to present to you proposed amendments pertaining to the city's use permit review process. Just a bit of background. In March of 2017, the city kicked off a city council initiated request to review the city's conditional use permit.'",
        "'speaker_10': 'As the council knows, there are uses in the city that are permitted by write in the city's zoning ordinance, and there are also uses that are subject to an extra process known as a use permit. Some are conditional use permits and some are administrative use permits.'",
        "'speaker_10': 'They're just sort of major and minor. But the request stemmed from feedback from city business owners who cited that the use permit process was hindering some of the creation or opening of new businesses, in particular aspects related to timeliness, predictability, efficiency and cost.'",
        "'speaker_10': 'So staff focused on these aspects and reviewed ways to maintain the ability of the community to address concerns, but also to try to improve on some of the aspects that the business owners were expressing concerns about. And so all of this really was done with the overarching goal of improving the city's image as a great place to'",
        "'speaker_10': 'do business. And so just an overview of the process. There are some dates on the screen, but I'll just quickly run through them. Since last spring, the staff did a multi-month engagement, along with a consultant with stakeholders and business associations in the community.'",
        "'speaker_10': 'The consultant that assisted the staff also did a thorough analysis of the city's zoning regulations and pointed out recommendations on how to make the process more clear and even how to make the zoning ordinance more clear. The engagement effort also included a study session with the Planning Commission, as well as the Economic Development Commission.'",
        "'speaker_10': 'And then staff also individually reached out to numerous business associations that, due to their staffing limitations, were not able to participate in some of the meetings. And so we did one one on one outreach prior to the Planning Commission hearing on June 7th.'",
        "'speaker_10': 'Staff also addressed inquiries from several resident groups pertaining to some of the changes which I'll go through in a bit. So after that extensive stakeholder effort in preparation of zoning recommendations, the Planning Commission did conduct a public hearing on this item on June 7th and recommended recommended approval that the City Council approve this application.'",
        "'speaker_10': 'So I'm going to go through just some more detail about some of the stakeholder issues. I'm going to categorize them. But generally, they fell under a several categories that I'm sure are familiar to many. Alcohol regulations, parking regulations, procedures and cost.'",
        "'speaker_10': 'And then the last aspect was the identification of the need for business assistance. In other words, the stakeholders mentioned that a lot of folks that appear before the city to start a business simply lacked the knowledge of what the process was and could have used better assistance to guide them through the process.'",
        "'speaker_10': 'In terms of the technical aspect of the zoning code, the consultant did an analysis and compared Long Beach to several other pier cities. The city's notification process for use permits, which right now is a 750 foot radius consisting of property owners and occupants, was found to be greater than pure cities.'",
        "'speaker_10': 'They also found the consultant also found that some cities do a much better job of providing information on business assistance and also sharing what what's going on in the process, what the steps are and what other applications are in the process.'",
        "'speaker_10': 'And lastly, the consultant noted that Long Beach's application costs seemed higher because the costs are bundled. The the cost to process the application, the notification costs and various surcharges are all bundled into one. And so they appear to be higher when in fact, when the numbers are actually broken down, they actually are pretty comparable in terms of'",
        "'speaker_10': 'the zoning code. The the assessment was that there were definitely definitions in the code that were outdated and and convoluted that made the code somewhat difficult to understand. There were missing references to certain issues, certain aspects relating to alcohol, so that the city's regulation of alcohol did not jive with the state alcohol and beverage controls regulations, and'",
        "'speaker_10': 'also that overall the code could use a better just just a better clarification. So one of the main recommendations, though, in terms of speeding up the process, was doing a review of uses and determining whether those uses in actuality needed use permits.'",
        "'speaker_10': 'The reason for that is the city's zoning ordinance was largely crafted in 1988 with intermittent amendments for the last 30 years, basically. And there are some regulations that could be deemed to be outdated given the there's new ways to do business and the new sort of marketplace and economy.'",
        "'speaker_10': 'So some of the uses that the that were identified as needing updated included included laundromats which currently require an administrative use permit, second hand stores. So reuse stores, thrift stores, those all require conditional I'm sorry, administrative use permits.'",
        "'speaker_10': 'Daycares in multifamily zones currently require conditional use permits. And yet the city's housing element identifies multifamily zones as areas needing daycares. The most live work units and commercial districts also require use permits when most other cities are not requiring use permits for that because adequate development standards can be put into place to regulate those.'",
        "'speaker_10': 'And so the there are basically there's a list of uses and their associated development standards, which also showed that there was a need to update the regulations based on kind of more modern way of doing business is one example is that for daycares the hours of operation were limited from 6:30 a.m. to 6:30 p.m..'",
        "'speaker_10': 'But today's longer work hours. Parents need to drop the kids off earlier and pick them up later. And so that was one of the changes that we are proposing. With regard to public notification, I did give a little background.'",
        "'speaker_10': 'The city's 750 foot notification does exceed what the state minimum is, which is 300. However, one thing that the staff took a look at was the effectiveness of that notification. We typically send out a couple of hundred, sometimes over a couple, sometimes over several thousand.'",
        "'speaker_10': 'If it's a project in the downtown, it's they're known to have over 4000 notices in a single mailing, and sometimes over 20% of them come back as returned mail. And also as a result of that, we've had public hearings where one or two people show up a result as a result of more than a thousand notices going'",
        "'speaker_10': 'out. So certainly staff observed the the lack of efficiency and effectiveness of that notification. So studied ways that other cities are providing notification of projects. The one recommendation that was that came down very strongly was digital notification. Clearly the movement of communication towards the Internet, the use of the website to the city's website, to post public notification'",
        "'speaker_10': 'as well as email email services like L.B. Link, where people are able to sign up for issues that they're interested in, as well as the thousands of people following the city on social media have been proven to be effective ways of getting the word out on projects that that are being proposed and also the state law, as'",
        "'speaker_10': 'well as many other cities allow for newspaper publication when the number of notices exceeds 1000 properties. That is a common occurrence in the projects that that Long Beach sees. And so one of the proposed changes is, is to incorporate that allowance into the zoning ordinance.'",
        "'speaker_10': 'And then the last part is in terms of a procedure, not necessarily notification, but creating a an administrative land use process to document uses that are by rights so that applicants can come in and sign and acknowledge that they understand the development regulations before they open a business so they can operate in accordance with city regulations.'",
        "'speaker_10': 'And they've indicated to the city that they understand that. So in your packet or there's an ordinance summarizing the changes that I've just summarized, and I want to go and just talk about a few next steps. So certainly the some of the stakeholder concerns related to some broader issues relating to, for example, alcohol sales and the changing'",
        "'speaker_10': 'nature of alcohol regulations, be it late night sales, late night sales of alcohol or change in alcohol products because it's sort of a moving target. Right now, the staff is acknowledging that there is a need to perform a continued study of improvements to to alcohol sales procedures.'",
        "'speaker_10': 'Also in the staff report, the the staff talks about the ease of use of the code after some of the changes are made. There are a couple of chapters in the zoning ordinance that are just very difficult to use.'",
        "'speaker_10': 'Things are not in order and things are difficult to find. And so the recommendation is to come back and reorganize some of the chapters without any content change just to improve the ease of use. And then lastly, the next step is to recommend enhancing the city's website to provide increased information about development proposals.'",
        "'speaker_10': 'And I and an example of that would be a map based software that shows what projects are going on so that people can easily relate what the what ongoing projects are in their neighborhood and what is most relevant to them.'",
        "'speaker_10': 'And so this process certainly is not over. I think this is step one of and of an effort to make it easier to do business in the city, to negotiate the city's use permit process. And the Planning Commission recommends that the City Council adopt the proposed changes in the attached ordinance.'",
        "'speaker_10': 'That concludes my presentation and I can answer any questions you have. Thank you.'",
        "'speaker_9': 'Thank you, Councilor Pearce.'",
        "'speaker_7': 'Yes. Thank you very much, staff. This has been a long time coming. So when I first started talking about even running to sit behind this dais, I talked to a lot of small business owners that said that they had a lot of challenges with the conditional use permits, the process, the amount of funds it took for them'",
        "'speaker_7': 'to get their doors open with the types of uses that they that they wanted and that the cost was much higher than other cities. And so I am really happy. I want to just give a little bit of context and then I'll ask a couple of questions.'",
        "'speaker_7': 'This item came forward in December of 2016 with my council colleagues Lena Gonzalez, Stacey Mango, Al Austin, and that we together, you know, set out to try to get Long Beach to be updated for our businesses. And so this conditional use process has been several years in the making and not only included an outside consultant to work'",
        "'speaker_7': 'on this, but we did make sure that we included COBA, that we included small businesses, large businesses and multiple types of businesses. So I want to applaud staff because I know when we've done community outreach in the past and when this first came up, it was difficult to get some of the other users to participate in the'",
        "'speaker_7': 'process and really understand the Laundromats and some of those other uses that might not be as engaged in our city like restaurants are, because we all eat all the time. And so I want to recognize that we had a roundtable that included COBR, all of our business associations within the city, as well as individual neighborhood associations, Rose'",
        "'speaker_7': 'Park, Alamitos Beach, Bluff Heights, and in our downtown area as well. And so what was that in West Side? So definitely West Side, but that those were part of a work group that the consultants worked with, that this didn't just come out of city staff, but city staff really did a great job picking it up and leading'",
        "'speaker_7': 'it and making sure that it came back with a complete overhaul that the city is really due to have. So I'm really happy to see it here. I know that we had some questions the last time we met with community members around the online process.'",
        "'speaker_7': 'Could you elaborate a little bit of how you're working with it? And we discussed cutting back some of the paper notifications, but how are we really going to trust that are online sources like social media is the right way?'",
        "'speaker_7': 'What cities have we seen do that before?'",
        "'speaker_10': 'Shura Council Member Pearce, thank you for the question. In the in the study of the peer cities, the consultant took a look at the cities of Oakland, Anaheim, West, Hollywood and Huntington Beach I'm sorry, and took a look at what they are doing and they are taking advantage of a lot of digital digital notification processes.'",
        "'speaker_10': 'And in terms of working with are it working to ensure that the digital notification that this proposal is going to be effective? One of the very specific performance criteria that we have incorporated into the digital notification requirement. So it's not going to be optional.'",
        "'speaker_10': 'It's going to be in addition to the mailing that's going to be starting at 300 feet with a couple of exceptions, but starting at 300 feet, it's going to be mandatory digital notification. It means we have to advertise those public notices in an electronic format.'",
        "'speaker_10': 'And not only that, the performance criteria is it's going to be based on what is currently the most effective. In other words, where do we have the most followers? Where do we have the most subscribers? And the reason for that was to provide a way for the code, which does not change very often to respond to digital'",
        "'speaker_10': 'internet usage, which does change, I mean, in every two or three years, you know, a new form of social media peaks or a new website peaks, and it's to allow our code to have the flexibility without having to change it time and time again.'",
        "'speaker_10': 'And that will be developed through a policy within the Department of Development Services to regularly track what is the most effective notification method, and then to use, at a minimum, two of those.'",
        "'speaker_7': 'Great and I don't recall you going through it necessarily in your presentation, but you mentioned that some of them will be 300 feet, some of them will. Some of the uses are required to be further distance. Can you recap that one more time for me?'",
        "'speaker_10': 'Absolutely. So, yeah, I'm happy to go over that. It's going to make it a little complicated with the numbers. So the state minimum is 300 feet. So staff is so staff is proposing to move the default notification to 300 feet.'",
        "'speaker_10': 'But that would include still both the property owners and the occupants, which is still above and beyond what the state requirement is. State only allows only requires property owners, but for users, for example, that have buffers for the massage users that have a 700 foot buffer or a tattoo use that has a 500 foot buffer, the any'",
        "'speaker_10': 'any of those uses that requires a use permit, that notification would automatically be extended to that buffer to ensure that we have added coverage. Also, any project that has any parking reduction, anything a variance for parking, parking, shared parking that would remain at the 750 foot notification.'",
        "'speaker_10': 'And that was because during our engagement with the residential stakeholders, that was that was at the top of the list in terms of concerns about businesses taking up parking into residential neighborhoods. And so they wanted to be aware of any instance where that where the potential for there was the potential for that to happen.'",
        "'speaker_10': 'So that stays at 750. And so those are some of the examples of how the default is 300. But there are there are tiered systems to account for specific situations.'",
        "'speaker_7': 'Great. Thank you for that. I will just close with I think you touched on it, it's a rare opportunity to sit here and and go through the code like this. I think you guys have done a great job on really not having a blanket policy, but really going line by line with all the different uses.'",
        "'speaker_7': 'And I encourage my my council colleagues to support this change. I also want to recognize the Economic Development Commission and the Planning Commission that also spent a lot of time with this as well. So thank you guys very, very much.'",
        "'speaker_9': 'Thank you, Councilman Gonzales.'",
        "'speaker_6': 'Yeah. I want to thank Councilmember Pearce for bringing it forward some time ago and really our staff for continuing to bring us to where we're at now. I think this is a great win for small business and I just want to ask a few things.'",
        "'speaker_6': 'How does that look like internally? It's got to be a lot easier now for you or is that are we going to have a little bit of a a road to overcome before this actually comes to fruition and we figure out what the streamlining will look like?'",
        "'speaker_10': 'Sure. Thank you, Councilmember Gonzales. That's a that's a great question. And we are we are undergoing the internal process improvements that will effectuate the changes at. So one thing that, you know, I, I didn't specifically talk about, but I think it's covered in terms of in the report is that the slight reduction in the notification will have'",
        "'speaker_10': 'a cost savings and staff will be bringing back a slight fee update which will basically it'll reduce the fee for anybody who isn't subject to the the full 750 foot notification. So that's one internal process that you will actually see.'",
        "'speaker_10': 'And in terms of other uses, we know very specifically which uses have what buffers. And so we'll know which tier to put them in and put them in the the appropriate cost bracket, if you will. Right now at the back of our application packet, we already have all the different uses that require use permits listed out.'",
        "'speaker_10': 'And so it's just a matter of whenever a certain use comes in that meets the criteria for an extended buffer, we will be able to identify that pretty easily and then note that buffer for their application processing accordingly.'",
        "'speaker_6': 'Great. Thank you. That's great to hear. And were there any other I know that we're still in the next steps. We're continuing the discussion on alcohol sale procedures. I know that's probably the number one thing that we hear, especially in downtown.'",
        "'speaker_6': 'Do we know do we have any in addition to that alcohol sales discussion, do we have any other alternatives scenarios that were brought up that may not be in this presentation that were just sort of other ideas that we're looking at as well?'",
        "'speaker_1': 'I one of the things that we heard from applicants or a number of the businesses was their interest in a business that was currently selling alcohol that desired to potentially move to a different location. They would very much like a process that allows an existing business who's a good operator, hasn't had any issues or troubles to open'",
        "'speaker_1': 'up a new location and have them go through a minimal process because of their good record at one property. And that is something we're exploring. It is a challenge because every neighborhood is different. Every community, every location is different.'",
        "'speaker_1': 'And right now, we haven't found a way to essentially get them there to to waive the set up process. But one of the things in Kerry's presentation, she mentioned that we are taking a deeper dove, looking at alcohol sales.'",
        "'speaker_1': 'So as a part of that process will be exploring whether or not there is some way to minimize that process. But we that was one of the alternatives that that was put forward that we considered but could not we couldn't get there in this process.'",
        "'speaker_1': 'But we all will still be exploring that as an option.'",
        "'speaker_6': 'Great, Will, thank you. And I look forward to seeing how that evolves. And then just last thing that I think that has been mentioned is the multiple methods of communication. I think especially when it comes to development, we've known that's been sort of an issue that community members have talked about and ensuring that specific community groups are'",
        "'speaker_6': 'included. I know that we do a radius, but there's some community groups that might be right outside the radius. So I know we're being a little bit more cautious and mindful of that, which is good. One last question.'",
        "'speaker_6': 'Is there are there any existing proposals in the pipeline that would be affected? I don't know if there's like an abundance of laundromats that want to come to the downtown by chance. I just want to ask that.'",
        "'speaker_10': 'Yeah. Thank you for the question. And, you know, I'll answer that question and then I'll follow up on the other point. But actually, no, coincidentally, right now we do not have any pending applications for thrift stores, laundromats, daycares or or live work units.'",
        "'speaker_10': 'So and then to the other point about the neighborhood groups, it is currently already a part of the development services process. They use permit process to notify neighborhood groups not only when the public notification goes out, but also when the application is received.'",
        "'speaker_10': 'So while that is not codified, it is already part of our process.'",
        "'speaker_6': 'Okay, wonderful. Thank you very much for the work. I appreciate it.'",
        "'speaker_9': 'Thank you, Councilman Mongo.'",
        "'speaker_10': 'I'm very familiar with the neighborhood notification process. I haven't been neighborhood president for six years, but I still receive notifications, so I know that it is alive and well and working. But I think that our work to ensure that those lists are updated and while I happen to still serve on my neighborhood board and keep them apprized'",
        "'speaker_10': ', that might not always happen, had something different happen to me than coming to the dais. So I think that we need to work really hard. I know that Neighborhood Services is always updating the list, but there has to be a process specifically as it pertains to each development.'",
        "'speaker_10': 'So the one in in my neighborhood recently was the Dorado. The Dorado received a notification to the neighborhood president email address, which came to me and I haven't been president for quite a bit of time, so we need to work on that a bit.'",
        "'speaker_10': 'I'm really excited. And while I appreciate Councilmember Pierce's excitement about this, this first came to the council in 2014 with Councilmember Richardson, Councilwoman Gonzalez and I when we first started talking about components of notification and the social media options related to digital advertising and geofencing around an area and ensuring that the ads for those areas are specific'",
        "'speaker_10': 'in nature. So, for instance, you can on a map put a box around a development project, and then anyone who looks at their browser for Google or any of the others would get an ad that this is happening in their community.'",
        "'speaker_10': 'And I don't know that I've. I hear that there's a social media component, but I don't know that that ad component that we kind of talked about back in 2014 has been included. Is that something that you guys are still considering?'",
        "'speaker_1': 'That is new information. But what I would say is that it's not currently a part of this process, but that is absolutely something we can explore. Christopher, do you have just for clarification, by adding in boosted post or.'",
        "'speaker_2': 'Or.'",
        "'speaker_1': 'ID using a different function?'",
        "'speaker_10': 'It's actually so at the time, the first project that was using this, I can't remember what it was, but there was a discussion around. Not. Not everyone's on social media. And so literally for a very small price. And I know that I've had talks.'",
        "'speaker_10': 'The person who brought this to my attention was Mr. Worthington. He uses this in the area quite well, where when you are a person who lives in 900808, no matter if you're on your phone. Anywhere. They can do it by two.'",
        "'speaker_10': 'Two paths. One, when you're near the dealership. If you're on a device, they can push forward an ad to you. And then the second is, if you live in this area, no matter what device you're on, let's say you're on an iPad in Pasadena, but you live in Long Beach.'",
        "'speaker_10': 'The ad could be pushed to you. There's lots of options, but it's actually targeting people, especially on my side of town, who may not participate in social media but go on the Internet to purchase things. And the but so you might be shopping on Amazon and the ad will pop up.'",
        "'speaker_10': 'There were even ads during this last campaign that would say vote for somebody for November right there in the Amazon screen. And so those are another very inexpensive way. I mean, they're so cheap ad buys, they would probably be less expensive and more effective than the mailings that are getting such.'",
        "'speaker_1': 'Low, low return. It would be very interested in looking at that. Yes.'",
        "'speaker_10': 'And there's people who know more about this than I do, obviously, that we can connect with the other component of this that I think came forward and I know Mr. Councilmember Richardson's. Up next is we talked about a phase two of this, which was first, let's look at the code and make it easier to get the copies'",
        "'speaker_10': '. But there were also discussions related to what are the tools that we can put online that once they're in that process? They can download specific measurable specs. So let's say, for instance, their barrier to entry is an ADA bathroom.'",
        "'speaker_10': 'Councilmember Richardson kind of talked at the dais and I'm really stretching here. This was five years ago, but about the ability to just log on and say, here are 12 ADA bathrooms that meet the requirement. You should be able to download one of them and have your contractor do it instead of going through the processes and procedures'",
        "'speaker_10': '. But like preapproved, here's what you need. To get done. And I know that was a part of the 2014 theory and Plan, which was a long time ago and several staff members ago. But I don't want it to get lost in the in the discussion.'",
        "'speaker_10': 'I think that this is a great first step, and I'm glad we're all on board. And I, I think the group of councilmembers who who brought this back in 2016 are very dedicated to getting this process to be streamlined.'",
        "'speaker_10': 'But I would also say that in my last three years, the number of businesses.'",
        "'speaker_7': 'That don't feel they fit.'",
        "'speaker_1': 'In the box.'",
        "'speaker_10': 'Has increased. So. A tiny, tiny gem of.'",
        "'speaker_7': 'Like six moms sitting around with six.'",
        "'speaker_10': 'Kids playing.'",
        "'speaker_7': 'Ball.'",
        "'speaker_10': 'It's not a gym, but they're being required to fit at the parking rate of a 24 hour fitness. And so finding those subcategories.'",
        "'speaker_1': 'I think, are.'",
        "'speaker_10': 'Going to be really important in the next five years. Thank you for all your work.'",
        "'speaker_9': 'Kathryn Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. So congratulations and thank you to Councilman Pearce and all the signers on this original item. And, you know, you know, to take it even further back, I think the council before us even had a view a couple, I think, to keep conversations going to continue to evolve as we move forward.'",
        "'speaker_2': 'A couple things. So. On the notification. I understand that that is one of the largest expenses of a CFP, but I do have concerns and I do agree that we need to be able to use a scalpel and be more strategic and save money.'",
        "'speaker_2': 'But at the same time, the concept of simply using a newspaper ad over a certain threshold, we just don't have circulation and newspaper circulation in entire areas of town, which I think that that's going to disproportionately disengage certain communities.'",
        "'speaker_2': 'And I think we have to think through that a little bit. I think we have to have a question. Does this conversation still does this ordinance still leave the conversation open to talk about the actual the notification process?'",
        "'speaker_2': 'So the way that we handle public notifications, are we still there's the doors that open to discuss this outside of this ordinance?'",
        "'speaker_1': 'Well, if this ordinance passes, it would be the ordinance that would govern how we do notices going forward until the council decides to amend it once again.'",
        "'speaker_2': 'So that but that's specific to caps. I mean, all public notices. I mean, there there needs to be a broader conversation in general about public notices sort of, you know, how do you simplify them, make use less legal language and simplify the syntax?'",
        "'speaker_2': 'So basic people, you know, basic folks can understand that context. So are we able to talk about, like the structure of the notice, what it looks like?'",
        "'speaker_0': 'Absolutely. Absolutely.'",
        "'speaker_2': 'Okay. Because I like to have a conversation outside of the S.U.V.. I like most of what's presented here, but I want to have a better conversation about making sure the public notices are simply just more effective and communicate the message better to all communities.'",
        "'speaker_2': 'Make sure we have a common denominator, a language that the common person can can comment on the language. Specifically on the laundromats. So we have a number of laundromats. And I I'm glad to know there isn't an, you know, a long line of laundromats waiting to get into the city.'",
        "'speaker_2': 'So that was that was good news. But laundromats, they do bring their 24 hours. And the nature of laundromat is loitering. People are washing their clothes and people need to wash their clothes. I get that. But certain hours a night, they require certain security standards or perhaps even hours of operation.'",
        "'speaker_2': 'The ability to to regulate the hours operation of laundromats, a new modern laundromat that's locating in the area. Does do the standards within this ordinance allow us to regulate operating hours on a laundromat?'",
        "'speaker_10': 'Thank you for your question, Councilmember Richardson. Yes. The purpose of development standards for these uses that we are proposing to allow by. Right. Rather than through a use permit, the purpose of those development standards is to ensure that those uses operate in a manner that does not create any potential for impacts of any kind.'",
        "'speaker_10': 'So that's absolutely acceptable here. And we are happy to hear your thoughts on that.'",
        "'speaker_2': 'So the ability to regulate time, hours operation is in this ordinance.'",
        "'speaker_10': 'The ability to correct it's not currently proposed.'",
        "'speaker_2': 'What would that process look like? So who would who would weigh in on that? Is it a an administrative officer or zoning officer? Who would who would apply that? It wouldn't be the city council. But who would it be?'",
        "'speaker_1': 'Typically what we've done is in in the interest of trying to simplify the process of getting these use permits, we've gone away from what we call the discretionary process, where it goes to the VA or goes to the planning commission.'",
        "'speaker_1': 'We've put in place an administrative process where it could go from whatever the time period was and the significant cost of going to the Planning Commission or the CAA. We've reduced the costs, but we've put in place what we call an administrative permit process, which takes a few days and it's a couple of hundred dollars rather than'",
        "'speaker_1': 'the long, drawn out process that costs thousands of dollars. But to protect the integrity and the compatibility of these uses that are no longer going to be a part of a public hearing process, we are adopting what we call operational standards or performance standards for each one of those and each one of those.'",
        "'speaker_1': 'Depending upon the nature of the use, we will craft a set of standards such as they may affect the operating hours, it may affect the opening and close times, it may affect signage, a number of different things that affect how it could potentially affect the neighbors.'",
        "'speaker_1': 'And that would be adopted and included as a part of this ordinance.'",
        "'speaker_8': 'So the.'",
        "'speaker_2': 'Standard. So you're saying the standard those standards would not be on a project by project basis. We would need to adopt them in these.'",
        "'speaker_1': 'That's correct. They would be put in place as a part of this ordinance. And we have standards now for the myriad of different types of projects like. And I'm going to just give you an example, a trucking use.'",
        "'speaker_1': 'When a trucking use comes down through a C, you p process there, the code contains very specific standards that that particular use has to comply with. And that's just one example. There are a myriad of other types of uses that are subject to a C up process where the code literally calls out very specifically what those standards'",
        "'speaker_1': 'be. They set back B they are as of Operation B, they landscaping and that is what would be incorporated with this action, those what we call special development standards.'",
        "'speaker_2': 'So what are what are the hours of operations proposed in this ordinance for laundromats?'",
        "'speaker_1': 'They currently are not. And that's why we made the comment earlier. If you have specific suggestions, we could certainly include that in this ordinance.'",
        "'speaker_8': 'Well.'",
        "'speaker_2': 'I think we should have our hours of operation. I haven't done any specific outreach to find out, like what are the what is palatable. I think they need to be on a project by project basis, I think.'",
        "'speaker_8': 'Councilman Yeah.'",
        "'speaker_1': 'That's something we couldn't do tonight because we didn't put anybody on notice that we might be restricting hours of operations. If this ordinance passes, we would have to bring it back to make that change, you know, and publicly notice it.'",
        "'speaker_1': 'But that said, there are a number of operational standards already in here. For instance, there's a 500 foot separation. So you don't get an overconcentration. There's a requirement that an attendant be on duty at all times and it's open.'",
        "'speaker_1': 'There's a requirement for the glazing, for the windows, how much are transparent so that people can see what's going on in and out. There's ten, 12, 15 standards of operation. Two kind of noise is one of the things that's covered in here, to keep the laundromat from becoming a nuisance.'",
        "'speaker_1': 'If you get a situation in the future where a particular one becomes a nuisance or you have a trend where they become a nuisance, we could always come back and amend this, or you could make a suggestion tonight, but we'd have to put that over to another date to.'",
        "'speaker_1': 'So that the public has notice of that that restriction might go into effect. And the Council I would just like to add that in considering the potential for this use to and what it might potentially impact, I think staff has been very diligent in crafting that set of specific development standards.'",
        "'speaker_1': 'I would just suggest that maybe a step that you could consider is to let this go forward. And if there are any problems, we can certainly monitor it, keep a close look at it, and we would certainly have the opportunity to come back and make additional revisions if if if we feel or you feel that is warranted'",
        "'speaker_1': '. If the council feels it's warranted.'",
        "'speaker_2': 'Well, I do. And I feel that the conversation around I think it needs a little bit more work on in terms of the laundromat conversation, but I don't want to hold up the ordinance on that. So what I'd like to do is, you know, once we move, once this moves forward, maybe we convene a conversation and look'",
        "'speaker_2': 'at look into what the standard operating hours are and do a little bit outreach and maybe do an amendment in six months. Once we've done a little bit of outreach, you're open to working.'",
        "'speaker_1': 'That's acceptable to staff.'",
        "'speaker_2': 'Okay. Good. And then? And then. So the noticing on the public outreach went from 750 feet to 300 feet. Correct.'",
        "'speaker_10': 'As a starting point, correct? Okay. Although there are many exceptions.'",
        "'speaker_2': 'And we notify separately neighborhood associations. Right?'",
        "'speaker_10': 'That's correct.'",
        "'speaker_2': 'Do we notify any other civic or affinity groups like churches? No. We notify schools within a radius. Do we notify churches or any other affinity groups in the area?'",
        "'speaker_10': 'The only additional noticing would be for any parties that have previously expressed interest in that particular project that we would notify them. So unless somebody has previously notified us, no, there's not any particular group that's in the additional bucket.'",
        "'speaker_2': 'At what point is city council notified?'",
        "'speaker_10': 'As part of the the Planning Bureau's notification process, a notice of public hearing is transmitted to the Council District Office in which the project is located.'",
        "'speaker_2': 'Okay, so so I think we need to I think we need to do we have the ability to open it up beyond neighborhood associations include churches and schools within a more or more broad radius. If we're not going to do direct mail and save money and we know newspaper circulation and let's be honest, there's a lot of'",
        "'speaker_2': 'conversation about the digital divide in the city. So we shouldn't just assume using a technological solution is be the answer. So if we're going to save money by not doing as much on a mailer, then we should take that extra step and do a little bit more broad outreach to the organizations in the area.'",
        "'speaker_2': 'So particularly churches, business improvement districts and schools, I think at least those organizations within a broader radius should be included. So that's something we already have provision for. Is that something we can include to make?'",
        "'speaker_1': 'I don't know that I can let the city attorney respond to that. But I think that your other suggestions about looking at the hours of operation, certainly we can look at some refinements to the noticing to expand that.'",
        "'speaker_1': 'But I I'd prefer that staff had some time to examine.'",
        "'speaker_6': 'That a little bit.'",
        "'speaker_1': 'More closely. So we're not doing something on the fly, but be thoughtful about it and bring something back for the Council to to consider. Mr. May I was just going to add that that noticing that we're talking about really isn't even and never has been part of the ordinance is something that staff is implemented to, you know'",
        "'speaker_1': ', get better transparency. So that's it's something we could change any time. So we could bring that back a recommendation back from the planning commission at the time. We bring back the further discussion about the laundromat, and they could do that.'",
        "'speaker_2': 'Absolutely. I think that I think that's smart. So we move forward. What we have now, we bring back a conversation about laundromats, but also about the broader conversation of how we know this, which is not specific, just two cups, but how we do public noticing in general the method, the means, all those things.'",
        "'speaker_2': 'They we have a broader conversation on that. But thank you. This is very good work. Again, Councilwoman Pearce, thanks for taking the lead on this. And it has my vote to make.'",
        "'speaker_9': 'From a super. Don.'",
        "'speaker_8': 'Thank you. I'm going to follow up on the council notification that Councilmember Richardson just brought up, and I had that as my number one priority anyway. So it's just coincidental that that was just discussed. So my greatest challenge over the last three years has been council notification.'",
        "'speaker_8': 'The reason it's so important is whether it's snail mail or however the public finds out about a project. Guess who they call first when they have questions and we should be notified as to what's going on. So I take it, and this might be a question for Mr. May, so we have policy and then we have something'",
        "'speaker_8': 'within the code. So could council notification be codified so that we make sure that it's an absolute that has to happen?'",
        "'speaker_1': 'It could be codified, but you could just as easily do it by policy and direct staff to notify you at a certain point in time with any application process, it wouldn't be necessary to have it. The code staff would still have to follow your directive.'",
        "'speaker_8': 'Okay, so that hasn't worked in the past. So it's just been spotty. And so I just I can't emphasize enough and I don't want to pick on development services because this is across the board. Back to Councilman Richardson's point.'",
        "'speaker_8': 'We have a fire training center in our district. They hand deliver notices to the public. Again, even with the fire training centers phone number on there, they will call the council office. So unless we have a copy of that notice, we have nothing to provide the public.'",
        "'speaker_8': 'So I just think in the spirit of Councilmember Richardson bringing this back, in terms of a general topic of notification, let's make sure we look at all those possible options. The other question, I think, is also for Mr. Mays, and that are there any legal limits to notification?'",
        "'speaker_8': 'That is, for instance, if if we wanted to put a notice out in our weekly email blast, would that be allowed legally?'",
        "'speaker_1': 'Sure you can always go above and beyond what the state law requires. And state law requires a minimum of three, a 300 foot mailing radius. So for the most part, the city's standards as projected insurgents are above what the state law requires.'",
        "'speaker_1': 'But you can always you can do as much.'",
        "'speaker_8': 'Okay. The next question I have sounds like it would it's a little too detailed or nit picking, but it's actually round one when the standard went from 300 to 750 feet. And I remember a lot of the questions back then.'",
        "'speaker_8': 'And one was, if you're dealing with a large property, where do you start the zero point? And it used to be in the center of that property. And I don't know if it's policy or code now, but the public asks that it be on the outer perimeters, the borders of that property.'",
        "'speaker_8': 'Is that the way it's measured now?'",
        "'speaker_10': 'Thank you for your question, Councilman. Super. And yes, the the radius is measured from the outer boundary of the property or properties. If they if the project site comprises multiple properties, it's not from the center point, it's from the to the property boundaries.'",
        "'speaker_8': 'Okay. And the last item I have would be and again, I think Councilmember Richardson was getting to this point, that we have residents who just aren't going to get the message electronically. How do we replicate that snail mail option if we're not going to do it anymore?'",
        "'speaker_8': 'Well, I mean, to the 750 feet, we're no longer doing it. Maybe I have that wrong. We're reducing the 750 to 300 for for hardcopy mailings.'",
        "'speaker_10': 'Yeah. That's so that's that's correct. Residents have a I think we listed a menu of options and certainly happy to take into consideration, you know, the not necessarily the the active electronic version but the the the passive version that Councilwoman Mongo mentioned.'",
        "'speaker_10': 'And we could take that into consideration. But yes, the one of the it's about balance and I think the 300 foot is is is continuing to be is going to continue on the mailing and that there's no change to that.'",
        "'speaker_10': 'And so the important part for for the staff was to identify the uses that were subject to the extended buffers as well as the sensitive topic uses like the parking and retain those extended buffers for that purpose. So, so I think it's about balancing how to improve the, the, the use permit cost in the process, but also'",
        "'speaker_10': 'trying to replicate as best as possible the existing notification. And you know, with, with the vast majority of people moving toward electronic, native electronic media, if you will, you know, I think also the outreach effort is to let everybody know that, you know, if you if you want to hear about all the agendas on all the items'",
        "'speaker_10': 'to sign up for those for those lists. But, yes, there there obviously will be a minor portion that that will have to make an effort to be notified.'",
        "'speaker_8': 'Okay. So this is just off the top of my head because we do an e-newsletter blast every Friday at 1:30 p.m.. We have request for hardcopy versions of that. So if if we look at this studying this whole issue, maybe you could sign up to request a hard copy version of notices?'",
        "'speaker_10': 'Sure. Absolutely. And there there we have had we had a past stakeholder effort where somebody it was it was a survey, but some small group of people requested the hard copy surveys. And we were we were happy to oblige.'",
        "'speaker_10': 'And also, the department keeps a permanent notification list for people who are interested and being notified on a wide range of projects. And that could also be a way for us to know who needs hard copies. Thank you for that.'",
        "'speaker_10': 'Thank you for that suggestion.'",
        "'speaker_8': 'Okay. I appreciate it. Thank you for all the hard work you've put in.'",
        "'speaker_9': 'Councilman, just to add in, you know where we're talking about the mailed.'",
        "'speaker_8': 'Notices for copies, but we didn't talk in this presentation about things that are changing. And we did survey both our customers and the folks that we hear from in the public.'",
        "'speaker_9': 'And the number.'",
        "'speaker_8': 'One way that people learn about a project is they heard from a neighbor who already knew. The number two way they learn about it is that giant sign that we put on the property itself. And that portion of the notification process is not changing whatsoever, and that's a very important part of our notification process.'",
        "'speaker_8': 'We didn't have an extended discussion of that this evening because it's not changing, but that is something that people appreciate and that will continue today. The other thing is we're here in front of you tonight on this narrow topic of the copy, but one of the instructions council gave when the land use element was in front of'",
        "'speaker_8': 'you was to do an update of outreach overall. And that effort is underway and we'll be able to give you an update towards the end of the calendar year. But that also means having better lines of communication between individuals and neighborhood groups and the department and the city so that there are those lines of communication.'",
        "'speaker_8': 'So when an individual project comes in, that's not the first time that the homeowner or resident has had some interaction with the department, that there's some existing relationship that they can draw upon to understand the process and participate in the process.'",
        "'speaker_8': 'I think. Thank you for that. And may the record show that Christopher Coons brought up the term land use element. I did not. So but that gets back to my earlier point. I'll just make one last point. Thank you for bringing up the large sign on the property.'",
        "'speaker_8': 'I never want to learn about a project in my district from one of those large signs. Thank you.'",
        "'speaker_9': 'Thank you, Councilmember Pierce.'",
        "'speaker_7': 'So a little fact about my first engagement in Long Beach was around the notification process. And those large signs came from some community activism work that we did. So sorry that they're so big, but they do help. I did what I wanted to follow up on the question around laundromats because I don't necessarily have a challenge with'",
        "'speaker_7': 'them being 24 hour in my district, but I understand the type of business that can operate in there. So can you clarify one more time on the process that we agreed to? We're going to pass it tonight. And then what are we going to do with the laundromat question?'",
        "'speaker_10': 'Okay. Thank you for the question. So what we agreed upon was to move forward with the proposed ordinance tonight. And based on the I mean, the list of development standards here to ensure that the laundromats operate, you know, in a in a neighbor friendly manner is extensive.'",
        "'speaker_10': 'And so what we'll do is take a look and study other maybe other cities, study any calls of service for laundromats and determine whether an hours of operation parameter would be appropriate and bring that back within six months can.'",
        "'speaker_7': 'Okay. Is there a way to bring that back? When's the next reading of this? In two weeks.'",
        "'speaker_0': 'We can.'",
        "'speaker_10': 'It's too soon. Yeah. For second reading. I can hear.'",
        "'speaker_7': 'You even though I can't see you. It's okay.'",
        "'speaker_9': 'For the second reading, I'm assuming I'll be back in a few weeks.'",
        "'speaker_10': 'Yeah. We would not have we would not have sufficient time to prepare any.'",
        "'speaker_7': 'Recommendations on that. Okay. I think that that that answers my question.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_9': 'Thank you. We're going to before we go to a vote, we're going to public comment. Any public comment on this hearing? Sing, Sing nun, please come forward if there is one. Any other public comment on this, seeing that this would be the only public comment.'",
        "'speaker_8': 'Thanks, Mayor. Good evening. Members of the City Council. Customer Pierce. Thank you very much for bringing this item to our attention and certainly engaging the business community. I think the opportunity for the business community.'",
        "'speaker_9': 'To have a say in really what their.'",
        "'speaker_8': 'Future looks like is very, very important. And having this opportunity really, really makes a difference to that business community. I want to thank the Planning Commission and staff for the work that they've done. Being able to reach out to you and making amendments and recommendations to the proposal really means a lot.'",
        "'speaker_8': 'And certainly appreciate the opportunity to work in a smarter and more efficient and effective manner really makes it more business friendly. I think that's really what we're trying to do.'",
        "'speaker_9': 'And really appreciate that, that gesture.'",
        "'speaker_8': 'Appreciate that and look forward to that support. Thanks.'",
        "'speaker_9': 'Thank you. With that, we're going to go to Councilman Richardson.'",
        "'speaker_2': 'Oh, thank you, Mr. Mayor. Mr. Mays, is it possible to move forward? The ordinance must separate and divide the laundromats from the ordinance until we've had that conversation over the course of the next six months.'",
        "'speaker_1': 'So we could. I was just looking at it. We could pull that whole section out. It would take some remembering and we would bring it back to you with the correct numbering for the various sections next week for second reading and hold the laundromat in abeyance.'",
        "'speaker_1': 'That would not be a problem.'",
        "'speaker_2': 'Sure. And out you know, Councilmember, you go with that. Okay. So that's our friendly amendment.'",
        "'speaker_1': 'So the friendly amendment would be removed to remove any amendments to the zoning ordinance related to laundromats, specifically section as it is currently styled. Section 21.5 2.239 would be removed for second reading when this comes back. So correct.'",
        "'speaker_9': 'Okay. Thank you very much. Please cast your votes.'"
    ],
    "Entertainment Permit Application for Muldoon's Saloon.": [
        "'speaker_3': 'Motion carries seven zero.'",
        "'speaker_9': 'Thank you. Hearing number three.'",
        "'speaker_3': 'Hearing Item Threes Report from financial management. Recommendation to receive supporting documentation into the record concluded the public hearing and grant an entertainment permit with conditions on the application of Muldoon Saloon, located at 5646 Paramount Boulevard for Entertainment Without Dancing.'",
        "'speaker_3': 'District eight. And it does require note.'",
        "'speaker_9': 'Thank you. Mr. Modica second reading.'",
        "'speaker_3': 'Please raise your right hand. You in each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_4': 'I do. Staff presentation will be done by Brett Jockeys and Emily Armstrong from the Business Licensing Division.'",
        "'speaker_7': 'Honorable mayor and members of the City Council tonight you have before you an application for Entertainment Without Dancing for Shamrock Hospitality Group LLC doing business.'",
        "'speaker_6': 'As Muldoon Saloon.'",
        "'speaker_7': 'Located at 5646 Paramount Boulevard operating as a bar tavern lounge in Council District eight. All of the necessary departments have reviewed the application and have provided their recommended.'",
        "'speaker_3': 'Conditions as contained in the hearing.'",
        "'speaker_7': 'Packet. I, as well as the police department, stand ready to answer any questions Council may have. And that concludes Stout's report.'",
        "'speaker_9': 'Thank you. Councilman Orson.'",
        "'speaker_2': 'I'd like to hear from the applicant first.'",
        "'speaker_9': 'Okay. We're opening up the option for the applicant to say a few words. See. I can hear. Please come forward. Thank you, counsel. My name is John English Modern Saloon, North Long Beach. But we're still here. We appreciate your consideration for our opportunity to provide a safe environment.'",
        "'speaker_1': 'For our.'",
        "'speaker_9': 'Mostly millennials up there that want a place to hang out. And we.'",
        "'speaker_0': 'Thank.'",
        "'speaker_9': 'All of the different departments of the recommendation and approval on their side. That being said.'",
        "'speaker_0': 'We look.'",
        "'speaker_8': 'Forward to.'",
        "'speaker_9': 'Many years of entertaining and servicing the community. Do you have any questions of me? That'll be okay. Just the comment is perfect. Thank you so much. Is there any other comment? And public comment as well. So if you have public comment, please line up right now.'",
        "'speaker_4': 'Although Council of the City of Long Beach. My name is Patrick Coughlin, co-owner of Muldoon Saloon. And yeah, we had a rough start at Muldoon Saloon, but I just want to let you guys know that we've been pretty concerned about the community.'",
        "'speaker_4': 'You know, we've been helping cleaning up the neighborhood in various ways. And I hope that's considering, you know, the goodwill that we've had in the community or the goodwill that we're building up in the community is taking in consideration for live entertainment.'",
        "'speaker_4': 'So, yeah, no further for the government.'",
        "'speaker_9': 'Thank you. And any other public comment on this. Sir, please come forward. Anybody? This is our last call. So. So we are last public comment on this hearing. Go ahead. Is a gentleman at City Hall? My name is Roger James Smart, and I've been living at 2712 East 56 way for 40 years.'",
        "'speaker_9': 'And I party that more, do it for 20 years. But they've changed owners in the last couple of years, in the last seven months. They started this live entertainment. Right. And they get three bands come that three man tonight, Wednesday, Thursday, Friday and Saturday right.'",
        "'speaker_9': 'From ten Sunday. They they set up out there right in front of my house, play the drums. Annoying right doorstep. Play loud music. They drink out. They hang out. The drinks turn to people. Every night they later they piss in the yard.'",
        "'speaker_9': 'They put down the block. Church, right? The music just bothered me. I've been going crazy. I have called the police many, numerous times on record. They came up there in module I kid I they picked me up so much, I throw the ball at him.'",
        "'speaker_9': 'I had a gun out of him. Well, sir, sir, sir. Okay, sir, I'm going to. I think that's not appropriate to say, sir. Okay. So that's a that's a threat. We're going to we're going to go ahead. And I think you're.'",
        "'speaker_9': 'Sir, look, finish up 200. They're not even there at nighttime. Can you address? You can address. Address me. And I'm right, sir. And I ask members of my family to come with me, but they're so embarrassing me, you know, being a.'",
        "'speaker_9': 'A maniac towards these people and I hate him nightly. And they hang out. They hang out to three or four in the morning in the bar parking lot right there, riding skateboarding stuff. Sure. I'm not judging you. It comes right in my window.'",
        "'speaker_9': 'Thank you very much, sir. My window. And I do not like it. Thank you. Big. Can't count on Austin.'",
        "'speaker_2': 'Yes. Well, I want to also get us we heard a staff report her from the public. And I want to just say to the the ownership, I appreciate their attempts to raise the standards of the bar. However, I do have some serious concerns about approving approving an entertainment permit at this time for a number of reasons.'",
        "'speaker_2': 'First of all, my staff reached out to the neighbors of Muldoon's this past week to see if they there were any thoughts about an entertainment permit. Our office spoke with it and heard back from several residents on 56 way and other blocks where well done is located.'",
        "'speaker_2': 'And of the residents we contacted, several of them were strongly opposed to the city approving the entertainment permit. One person had no opinion. One person was very supportive because they said their brother was a patron of those who were opposed.'",
        "'speaker_2': 'The concerns were consistent about the public nuisances that they'd have to deal with on a regular basis. These ranged from loud noises, trash bottles left in yards that they can hear music from the bar until late at night and other disturbances coming from the bar.'",
        "'speaker_2': 'Secondly, Muldoon's has really not shown a willingness to comply with the existing city laws and regulations to date. I'd just like to confirm before I go further with city staff with the question has more done Saloon received any temporary permits for live entertainment prior to tonight's hearing?'",
        "'speaker_1': 'No, they have not received any temporary entertainment permits.'",
        "'speaker_2': 'Have they requested any?'",
        "'speaker_8': 'Not that I'm aware of.'",
        "'speaker_2': 'Okay. In my staff, also check with special events the Office of Special Events, who also indicated that they have not issued any occasional event permits to models yet. Models has consistently hosted live bands at the bar without an entertainment permit.'",
        "'speaker_2': 'They even have a banner outside their building promoting live entertainment for several months. According to their Facebook page, they have had live bands perform on at least 26 different nights within the first nine months of 2018. In my opinion, this shows a complete disregard for our permit process.'",
        "'speaker_2': 'One that we just had a great big conversation about. Finally, I like to take into account the owner's own words about the conditions at his bar. He's contacting my office and Mr. Conlin, who's contacted my office on multiple occasions about bad elements in the neighborhood that he was having to deal with at his bar, which he's attributed'",
        "'speaker_2': 'to other businesses in the area. On May 2nd, 2017, just over a year ago, he came right here to city council and even addressed our council and spoke about the problems that he stated even his security could not handle at the bar.'",
        "'speaker_2': 'And I think we have a clip. Low technical difficulties.'",
        "'speaker_9': 'And you're speaking to. Come on, forward.'",
        "'speaker_10': 'Go ahead and take me. Well, yes.'",
        "'speaker_9': 'We are. This is not. This is incorrect that we fixing this tech textbooks call.'",
        "'speaker_0': 'Hello?'",
        "'speaker_4': 'Yeah, hi. My name is Patrick Common on a modern saloon in North Long Beach. And I took over modeling.'",
        "'speaker_8': 'Saloon.'",
        "'speaker_4': 'Last August, and we cleaned it up quite a bit since we were there. It was not really a notorious bar, which is low profile, but it had a lot of, you know, bad things happening there. Ever since I've taken over the Bible, I've always had this problem with a bar called Daly's cocktails across the street.'",
        "'speaker_4': 'And there was kind of a lull period where I didn't have as much of a problem with them. But for six months just because, you know, I just got there. CROWD Not to go in. But ever since it started getting warmer, the temperatures started getting warmer.'",
        "'speaker_4': 'I'm getting more and more of this crowd coming into my bar. And, you know, I never really needed security in the beginning and now I have security. But the problem is, you know, the problem is so bad that security's not going to solve it, where if you have like 20 guys that are packing heat, you know, rolling'",
        "'speaker_4': 'up to your bar sometimes, you know, for, you know, get out of prison party, you know, it's not, you know, I kept my security can't handle that. And, you know, I and I did some research on the dunes.'",
        "'speaker_4': 'I mean what happened was last.'",
        "'speaker_0': 'Thursday the incident on my.'",
        "'speaker_2': 'Well, I think you get the picture. And so so I'm not only her. And furthermore, I got an email just less than two months ago. He said he's trying to eliminate all of the drug fronts around the bar.'",
        "'speaker_2': 'This is problematic with issuing an entertainment permit. So I've only heard from this applicant applicant about the problems that he's having at his bar. And I've never actually heard from him about the application for entertainment permit, which is also concerning when and based on these factors.'",
        "'speaker_2': 'I would not I would be inclined not to support this application today, however, before making a final decision, I like to be fair and to allow some more time to give the owner an opportunity to become a better neighbor, to demonstrate an ability to comply with the city's laws and regulations, which includes not having unpermitted entertainment or'",
        "'speaker_2': 'other violations. And with that, I would like to make a motion that we continue the hearing and understand that we need to provide a date certain for the continued hearing. So I'm thinking about 120 days, which would put us on January 22nd, 2019.'",
        "'speaker_2': 'In the meantime, I will request the police department to monitor for any violations, and we'll check back with the neighbors before the next hearing and to see if the notices, if they notice improvements. And they would encourage the the bar proprietor to reach out to his neighbors and build some some goodwill, because there are some some serious'",
        "'speaker_2': 'concerns from those who live close by. Then at that time, we'll consider the entertainment permit as appropriate or if any conditions, additional conditions are necessary. So my motion is to continue this hearing to January 22nd, 2019, and I ask my colleagues for their support.'",
        "'speaker_9': 'That's the motion and the second members, please go ahead and cash for votes.'",
        "'speaker_3': 'Motion carries seven zero.'",
        "'speaker_9': 'Motion carries it's. The motion is continued. Next up is a consent calendar. Please think of motion in a second for the consent calendar. Was there any public comment on the consent calendar? CNN. Please cast your votes.'"
    ],
    "Review of Hiring, Training and Onboarding Practices for City Employees and Officials.": [
        "'speaker_9': 'Thank you. I've had I've had three requests for council items to be moved up on the regular agenda. So let me go ahead and do those first. First is item 24.'",
        "'speaker_3': 'Item 24 is a communication from Councilmember Peers. Councilwoman Price. Councilman Austin. Recommendation to direct City Auditor to partner with City Manager to conduct an audit of the knot of onboarding, process and policies for all new employees, including appointed and elected.'",
        "'speaker_3': 'Require City Manager to report on the city's efforts to able to review and improve the turnaround time for hiring new employees. And to work with human resources and Health and Human Services to report on current practices and trainings of trauma informed methods as it relates to employees.'",
        "'speaker_9': 'Gossamer appears.'",
        "'speaker_7': 'Thank you. I believe there's a presentation, but I recognize we have technical difficulties. All right, here we go. I am going to try to be brief. I want to thank everybody that has worked with me on this item city staff, city managers, department, city auditor in making sure that we put forward the best item.'",
        "'speaker_7': 'I need the clicker.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_7': 'Are you going to click for me? Awesome. So Long Beach City employees are the heart of our city. We have nearly 6000 city employees. And it's critically important to me as a council member and I think to our city as a whole, that when we talk about the health of our city, we look inwards first.'",
        "'speaker_7': 'I also think it's critically important that we know it's been a lot of changes at the state level, at the federal level and at the local level for employment practices, for human, for air practices. And so we want to make sure that we take a moment to ensure our is aligned with those practices, those policies and the'",
        "'speaker_7': 'values that the city has said that we care so much about. Thank you. We're going to point it out to us anyway. What's the right and. There we go. I didn't get a training on this. You know, our training doesn't include PowerPoint.'",
        "'speaker_7': 'So we've got 6000 employees and 11 employee unions. And in the last 12 months, our department did a wonderful job of negotiating with all of those city employee unions. And now for me is a good time to kind of look at what we've done and look at what's in place.'",
        "'speaker_7': 'And so you see the city. We have everything from lifeguards to people that are fixing our roads to management to city attorney's office. So we have a very diverse group of employees here. Human Resources Department is the core of any organization we in our department.'",
        "'speaker_7': 'It includes recruitment, orientation, training, leadership development, harassment claims and really in any organization kind of sets the tone for how that organization is outside of your first interview when you get hired. You often come in and you go through a process with h.r.'",
        "'speaker_7': 'That process is your very first look and feel about how an organization's culture is. Did you get a thorough orientation? Did you get trainings on the things that you needed to get trained on? Did you have a map for what it was going to look like after day one?'",
        "'speaker_7': 'This is part of the culture that we really in the city, I think, can spend some time honing in on and ensuring that while we ask employers in our city of a certain standard, that we do the same in-house with our 6000 employees.'",
        "'speaker_7': 'So this item is everything in one item. So I wanted to just put it out here. I know that you already read them through. Really? There are two parts. One is the part where we work with our city auditor to conduct an audit of the onboarding process for all new employees, including appointed and elected.'",
        "'speaker_7': 'And so as an elected official, you know, the onboarding process was pretty short. Making sure that process is thorough, that there is an orientation process attached to that that also includes but is not limited to an orientation process in the medical evaluation process, the city's evaluation of an individual's physical and behavioral health and or prior medical conditions'",
        "'speaker_7': '. So right now, the practice in the city is that we have to disclose any medication that a doctor assigns us, any mental health history, and that sometimes that might be a hindrance to getting the position that we want or it might change the type of job that we go into or it might say up to their their'",
        "'speaker_7': 'director on what type of employment or benefits they might get. And so we want to make sure that we're doing a full audit and that that's in alignment with our state practices and with the federal practices. We're also requesting the city auditor conduct an audit of the process for employees, interns, volunteers, commissioners and elected officials to be'",
        "'speaker_7': 'informed of their rights and responsibilities to discrimination, harassment and retaliation. And so this is really saying not just staff, but volunteers, our commissioners, our elected officials. So each of us are a different type of relationship with our h.r.'",
        "'speaker_7': 'Department and with our directors. The city of Los Angeles has a wonderful website that they've put together that is for everybody that there has any interaction with with the city of Los Angeles. They can go on and find out what their rights are.'",
        "'speaker_7': 'They can fill out a form. They can be anonymous. They can not be anonymous. But it walks them through a full process and gives them all the contact information that they need. And so I know that this is the second time we've had this conversation.'",
        "'speaker_7': 'And the council I know that Councilmember Al Austin had requested some information from H.R. and that now we have a process. I think it's further in my PowerPoint, but I want to make sure that this is clear, that it's for interns, volunteers, commissioners and elected officials as well.'",
        "'speaker_7': 'To that point. What's not listed in here in this request is from going through the process. We understand that nobody in the city has a number of how many volunteers we have, how many interns we have. And so making sure that as we go through this, we are also figuring out a tracking system.'",
        "'speaker_7': 'And that's in addition to. So we were able to find out how many commissioners we had. I know how many interns we had, but that number was not able to be provided to my office last week when we requested it.'",
        "'speaker_2': 'Of the city.'",
        "'speaker_7': 'The second part is not the auditor's office so much as it is working with the city manager and and his lead, making sure that we review the turnaround time for hiring new employees. We know that sometimes that time can be strenuously long.'",
        "'speaker_7': 'We also want to request that the city manager work with the Department of Human Resources and Health to request current practices and trainings of trauma informed methods as it relates to employees recommendations, enhanced use of trauma, informed practices with employees and constituents.'",
        "'speaker_7': 'So at the end all I'll go over changes, but it needs to also include constituents in the policy.'",
        "'speaker_0': 'So.'",
        "'speaker_7': 'So Long Beach Snapshot. Just to give you a little idea for administrators, 60% of our administrators are male for Non-Management got 39% are non male or male. So we understand that we definitely have a different dynamic in the city that while women represent roughly 50% of our population, that's not represented here.'",
        "'speaker_7': 'And we've talked about that. I know Councilmember Lena Gonzalez has led on trying to understand what demographics we have in the city, but recognizing that that dynamic might cause some tensions. Not saying that I've heard that it's caused tensions, but let's make sure that we're aware of it and that we're putting in practices in place so that'",
        "'speaker_7': 'we can address people being comfortable coming forward and talking about challenges that they might have. Okay. So 75% of all workplace harassment incidences go unreported altogether. I want to be clear that this slide is not about sexual harassment.'",
        "'speaker_7': 'This can be, you know, where you have a coworker that that speaks firmly to you, that you're uncomfortable with, that you've tried to address. It can be a look. It can be any type of harassment that makes you feel uncomfortable, but so uncomfortable that you likely don't feel like reporting that because you don't know what might happen'",
        "'speaker_7': '. And these are general numbers just for us to be aware. I know that sometimes we we talk about these things in, again, relationship to other entities, but we don't necessarily talk about them within our own workplace. So violence in the workplace, this just talks about all the different ways that violence in the workplace can can come forward'",
        "'speaker_7': '. And so we want to make sure that we're aware of these and that we're providing a process for people to feel safe in their workplace. And one statistic that I thought was really important is that absenteeism, 85% of victims reporting being absent from work or leaving early.'",
        "'speaker_7': 'So if you've been a victim of some type of workplace violence, your absenteeism rate is much higher than somebody else. And so I know sometimes we've had this conversation around harassment or filing harassment claims, and sometimes we say, well, they're absent a lot, so maybe they're using that as an excuse.'",
        "'speaker_7': 'That's not the case. We know that often whenever people are absent, it's because something's wrong at the workplace or something's wrong at home. So we want to make sure that the city of Long Beach, while we've passed a lot of great policies for employers within our city, that we are doing the best we can do so that'",
        "'speaker_7': 'people don't say this, you know, that people aren't afraid of losing their job because something happened to them and they're afraid to speak out. So this I want to give recognition. You know, the council had on that came before us.'",
        "'speaker_7': 'H.R. has done a good job on the fact that we've got a pilot program that's starting October four, 150 of our librarian staff to implement a harassment free workplace training. And it includes a detailed list of what that training will look like and an understanding that that training supposed to come back for all of the staff in'",
        "'speaker_7': 'January 2019. So I would ask as part of of this, that you're working with the health department and their trauma informed trainings as well as part of that so that we can make sure we're in alignment. So I wanted to give a snapshot of workplace situation training to Long Beach, but that we know these things happen.'",
        "'speaker_7': 'And so with that in mind, we want to make sure we do an audit that says, how is Long Beach going above and beyond? How are we meeting the standards? Because we haven't had an audit like this of the department, from my knowledge, for a while.'",
        "'speaker_7': 'The second part of this is that conversation around, okay, we have H.R. and now we have the lens in which we we have our conversations with our staff. And in the city of Long Beach, we have trauma informed trauma resiliency, we have safe Long Beach.'",
        "'speaker_7': 'And so I wanted to bring up Kelly Colby, our director, to give a presentation on what that means so that I'm not up here spewing things that doesn't that doesn't quite make sense in the world of H.R.. She's been an expert on this, and she's done a great job.'",
        "'speaker_7': 'So I just want to bring this to the next component. Yeah. You want it? And somebody.'",
        "'speaker_1': 'Good evening. Um, so just wanted to provide a little bit about what we're doing in terms of trauma informed work for the, for the city and then what is possible to be able to provide moving forward in terms of trainings and things.'",
        "'speaker_1': 'And so we have the Safe Line Beach Plan, which we passed in May of 2014. And really the focus of that is reducing all forms of violence in the city, including domestic abuse, child abuse, elder abuse, hate crimes, bullying, gang violence and violent crime.'",
        "'speaker_1': 'And what we realize is that is that understanding and addressing trauma is really essential to all of this work. And so through safe Long Beach, we brought forward a lot of different resources around trauma and resiliency informed work.'",
        "'speaker_1': 'So first I want to share a little bit with, you know, what does it mean when we talk about trauma informed? And so the Substance Abuse and Mental Health Service Administration says that trauma comes from experiences that cause intense physical and psychological stress reactions.'",
        "'speaker_1': 'And it could be like one single thing or it could be multiple ongoing things that start to have strong physical and mental. They can really affect you physically and mentally for quite a long time moving forward. So there's a lot of focus right now on children.'",
        "'speaker_1': 'And many of you may have heard the adverse childhood events, but they do really impact people's ability to deal in other levels of stressful situations. So it may not seem stressful at the moment, but if you've had a lot of stress in your life and you walk in the door and something sets that off again, it's very'",
        "'speaker_1': 'difficult. For the city. So far, what we've been able to do is we provide trauma informed training, which is a one hour training. Over 80 agencies across the city, agency wide trauma informed. We've had a four hour where Parks and Rec and the Health Department and a couple of other outside agencies had their entire staff trained around'",
        "'speaker_1': 'trauma informed work. And then we there was an eight hour training for mental health providers. It was really around assessment and other things and understanding of trauma. We were recently received a $300,000 grant. And so with that, we're leading trauma informed city efforts, really looking at what it means for organizational training, culture change and support as we're'",
        "'speaker_1': 'thinking about a trauma informed approach. And we're also working very closely with many of our nonprofit and other organizations who are involved. As in light for this space. What we realize is that that really if you're going to have a trauma informed organization, what you really need is sort of first, what is trauma and the ability to'",
        "'speaker_1': 'recognize that you want to have safety and stability, cultural humility and responsiveness, compassion and dependability, collaboration, empowerment, resiliency and recovery. And it really is a shift in culture. So training is the first part. But we would love, you know, as the health department and with this grant to help support the city in sort of looking at how'",
        "'speaker_1': 'do we overall do our work around work around trauma. And what it really means is that the organizations that communities are trained to identify trauma and respond in a trauma informed approach that our city really supports a trauma informed culture for employees working together and our employees working in the community.'",
        "'speaker_1': 'And they were building a support system for our employees. So if something does happen and it's true and it sets off trauma for them, whether it's something new or something that's in the past, that we have a system that that that supports and sort of supports our employees.'",
        "'speaker_1': 'So that the next steps really is to the possible next steps that we could be taking together across the city is to design and implement training, to build trauma informed understanding and response and skills, building best practices for trauma informed systems into our policies, and further exploring systems across the city for employees when incidents occur, that may'",
        "'speaker_1': 'cause trauma. Thank you.'",
        "'speaker_7': 'Thank you, Kelly. So we bring up the trauma piece because not only is it about supporting our employees and making sure that we have a trauma lens with them, but most importantly, sometimes for me as our constituents, we have so many constituents that call our office every day that we meet in the field, that might require a'",
        "'speaker_7': 'little bit of extra time. And that's not only for us on the 14th floor, as with other departments. And so making sure that our staff has some training available to them that has that trauma lens, I think is going to provide the entire city with the support that we need.'",
        "'speaker_7': 'And we've seen some great cities like Philadelphia and the county of which county was at, Kelly, we talked about earlier today, Northern California county that also has a trauma informed lens.'",
        "'speaker_1': 'Alameda County.'",
        "'speaker_7': 'Alameda County, thank you. So the outcome of both the audit and working with the trauma lens is hopefully that we will have a report of the findings that identify our strengths and our weaknesses and that that's uncovered during our audit that a comparison of the findings and our benchmarks that we're looking at, that we have suggestions to'",
        "'speaker_7': 'connect any of the issues and noncompliance that are found and that we're implementing some type of trauma lens and departments where we see there is additional stress or whether it's H.R., our city attorney's office, where we are coming in, those those tense moments.'",
        "'speaker_7': 'And for those on the 14th floor, anybody that's in relation to constituent services, I do want to say that this item was something that was really important to me, that I've been thinking of how to roll out for a long time.'",
        "'speaker_7': 'I'm really happy to say that I have two co-sponsors, Al Austin and Susie Price, on this item, and I know that probably everybody on this council dais has a lot of thoughts about about this item. So I really look forward to hearing from everybody.'",
        "'speaker_7': 'I hope that you all will support it, and I look forward to hearing if there's any additions that you'd like to make to this. So I also want to thank all those that engage with us. We had mental health America, the villages of Cabrillo are some of our unions that participate with the city and several others that'",
        "'speaker_7': 'helped us kind of craft this vision for what it would mean to have a trauma informed city. But first, starting with an audit so we know where we're at. So thank you, everybody, for your help.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Councilman Austin Thank you and thank you for that presentation. Councilmember Pearce. I'm happy to sign on in the spirit of, you know, better government, improving our operations here in the city, improving communication and obviously better overall management of our of our of our employees and employee employee processes with or without our human resources.'",
        "'speaker_2': 'I heard a comparison to the city of L.A. and I will just tell you that I worked many years in the. Well employee relations process with the city of L.A. and they still got a lot of issues. So I don't necessarily think that's the benchmark for for where we want to be.'",
        "'speaker_2': 'And I'm I, I think this this this reads pretty straightforward. However, there's still some terminology that is new to me. Right. And I do appreciate our Kelly giving some an overview. I think that was very good for you to talk more about trauma informed practices, because it's something I mean, even working in labor relations, as long as'",
        "'speaker_2': 'I have, this is something that is new, right? This is not something that is I don't think is prevalent in every city and every city is looking at this. And so this is a this is a certainly a new approach that we are we are going for.'",
        "'speaker_2': 'I signed on again under the the with the with the emphasis on on embedded in government and had an opportunity to talk to the city auditor prior to to signing on in support of this. And this is something that she felt that she could do.'",
        "'speaker_2': 'Her office could could handle. And in an effort to improve our processes here in the city of Long Beach. And so with that, I'm happy to support. I will just say that I think the the peace with the trauma informed.'",
        "'speaker_2': 'Component. The trauma piece, in turn, means terms of getting information and understanding what that means to every employee in the city, I think could get very, very complicated and could even open us up for some some some exposure that we may not be.'",
        "'speaker_2': 'Some unintended consequences. And so I'm a little concerned about that, that that component of this as it was explained. So I'm looking forward to hearing other comments from from colleagues. But that component of it, I think it may take we may need to take another look at that.'",
        "'speaker_2': 'Yes.'",
        "'speaker_7': 'Go through all the comments. Just to clarify, one of the reasons why I asked Kelly to come in and present is because just like there's the ad not to go backwards, but the Office of Equity and there's equity trainings that they have done with the directors.'",
        "'speaker_7': 'This is a very similar model that cities like Philadelphia, like the counties, have used. It is something new that's coming up, but it's part of that mental health support. So when we talk about our homeless populations, we talk about those that are struggling with housing.'",
        "'speaker_7': 'Those at our heart team is working with our, you know, quality of life officers. They all have this training. It might be called something different instead of trauma informed. It might be called trauma resiliency. It might be called Mental Health 101.'",
        "'speaker_7': 'It's kind of these buzzwords, come on, because Grantor's, you know, they they get their little buzzwords. But the idea is not to expose any vulnerabilities of the city in our staffing. It's to just make sure that our staff has some language and a lens which makes the H.R. process.'",
        "'speaker_7': 'If I'm coming forward and I say, You know what, I have an employee and this is happening to me and H.R., I'm calling on you for help. Right. I'm calling on you to help me walk through a process that our staff have the knowledge of what a trigger might be and what might trigger employees, that if it'",
        "'speaker_7': 'is a sexual assault complaint, that there are things that that can go very wrong. Right. And that that often is where we end up with liabilities. Whereas if we have a different training that Kelly has talked about, creating specific for our city would give us a tool.'",
        "'speaker_7': 'It would help us, not hurt us, and it wouldn't be something that would open us up to more risk but would benefit the city as a whole. I'm not sure if if Kelly wants to talk about that before we go through the rest of it, I just recognize that question and and appreciate it.'",
        "'speaker_7': 'So thank.'",
        "'speaker_2': 'You. I do appreciate the clarification. And, you know, certainly we have a very qualified H.R. department. They deal with scenarios every single day and advise managers as well as employees on how to how to navigate through through through those challenges.'",
        "'speaker_2': 'I think what you're asking for is is possibly some some some clarification, but are we trying to insert trauma informed or trauma resiliency into the H.R. process?'",
        "'speaker_7': 'So that's why it's step one is is the audit. And step two is working with the health department on looking at that out of the outcomes and saying, well, here are some areas where you could insert an hour training here or you could insert something here to help us do a little bit better than what we're doing'",
        "'speaker_7': 'in the in that realm. And again, it's not only within our staff, but it's so that we can provide that trauma informed lens when we're dealing with constituents.'",
        "'speaker_2': 'And when you when you say that training, would you say the training would would model some of the other trainings that we have, like online trainings where you can go to a module.'",
        "'speaker_7': 'So that that is up to the experts that do trauma informed trainings. And that is why I've put these together with with the health department.'",
        "'speaker_2': 'All right. Thank you for that clarification.'",
        "'speaker_1': 'If I can jump in as well, I think we're just being asked to start and take a look at this. There's a lot we don't know yet. There's a lot that we need to sit down and talk.'",
        "'speaker_4': 'If the council does pass.'",
        "'speaker_1': 'This, that's when we'll start really diving into this. What would trainings mean? What would this look like? H.R. has got to get involved, so there's still a lot of work that needs to be done.'",
        "'speaker_10': 'Councilman Mango So those specific questions are what I had hoped to get answered before we pass this item. I appreciate that this has been on your plate for longer than the policy that we passed three weeks ago. But we did pass the policy on this Council that when we do our staff to weigh in or do an'",
        "'speaker_10': 'audit or any of those things, that we would include a component of what we thought staff time commitment would be, whether it's 20 hours or 40 hours or 140 hours or 600 hours of staff time. And I'm not saying that this is any more or less important.'",
        "'speaker_10': 'I just don't know when we start implementing the process that the Budget Oversight Committee and the Council as a whole adopted, specifically stating that we have to start asking ourselves where things land. The other part of this that I'm not ready for yet is we have a few fellow who supposedly are going to be reporting out on'",
        "'speaker_10': 'H.R. and the processes and the challenges and the opportunities. And I don't know if this has been a component of her studies over the last. I don't know if she's been here a year or 18 months or how long she's been here, but I've expected that there's a report coming out, and I'm very interested in knowing how'",
        "'speaker_10': 'these could kind of like fold into each other, because I have heard some challenges with the process that a lot of what you're talking about could address. But I also know that. It's not the only challenge that could be addressed.'",
        "'speaker_10': 'And so figuring out where those all fit together is is kind of important as well. And then maybe you can answer that for us. When are we expecting that report back? What does that report look like?'",
        "'speaker_4': 'I'll take that, actually. So over the last year, we.'",
        "'speaker_1': 'Have been doing a very intense study of our hiring.'",
        "'speaker_4': 'Practice.'",
        "'speaker_1': 'We know that it is a major challenge for departments. It's something that touches everybody. And we're looking at it from a really soup to nuts perspective. So from the day that somebody wants to hire someone to the time that they actually come into the end of the seat.'",
        "'speaker_1': 'So we've been using a Fuze fellow who is actually wrapping up some work right now. We got as much done as we could within a year. We had some successes along the way. We've actually already implemented a number of really positive implementations.'",
        "'speaker_4': 'And we've got some recommendations for four more.'",
        "'speaker_8': 'And so that is a little bit of what we would do, as if we were requested to do this under number.'",
        "'speaker_1': 'Three is to be able to report back on a lot of that. We've been mapping the process.'",
        "'speaker_4': 'We can do some initial reporting back in the next month or two, most likely with some additional coming on. Further, we didn't get it as far as we would like. We still have more to go, but we're very much focused on improving the.'",
        "'speaker_8': 'Hiring practice.'",
        "'speaker_10': 'Because in the discussions that I've had with city staff about similar ideas about making some fixes, the consistent answer that I have is we can't really tell you what kind of staff time that would take until the Fuze fellow's done and we have a report.'",
        "'speaker_10': 'And so perhaps what we could ask, and I don't know if this would be a friendly or how it would work is. That this come in tandem with a presentation to the Council on what we've already found. There's a significant investment in this individual who has, from what I understand views, fellows come from like really high grade'",
        "'speaker_10': 'educations and really intense knowledge bases that exceed the expertize of a city staff member who's a generalist. And we recognize that we've had to move towards generalists as the changing work environment has happened. But in the discussions I've had about the challenges that I've heard from city employees, about the places that they feel that we need changes'",
        "'speaker_10': ', I really feel strongly that. Staff have been consistent in telling me that we're not ready to do that until we've had our report out. And so what I would like to see is two things. One is an analysis of the amount of staff time that would go into solving some of these things in terms of like how'",
        "'speaker_10': 'many hours of commitment are we asking the auditor to put behind it and or how many hours of commitment are we asking.'",
        "'speaker_7': 'For all these because.'",
        "'speaker_10': 'They're important and the number of hours could be appropriate? Or we could say staff do it within 100 hours or do it within 200 hours because I don't know what they're going to come back with. And I also don't know there's a pretty long list, and I think that we've consistently talked about this on the on the'",
        "'speaker_10': 'dais of reports back that are passed due from our city staff. And a lot of it isn't always their fault. Some of it is that we keep piling more on under shorter timelines. And so I don't know what the report back on this would look like.'",
        "'speaker_10': 'Maybe we approve step one and then have it come back with or after the Fuze Fellows presentation or if we're even getting a presentation on it. But I understand it was a huge investment.'",
        "'speaker_9': 'Thank you, Councilman Gonzales.'",
        "'speaker_6': 'Okay. Great. Thank you. I think this is a good discussion so far. I want to first say that this is a very positive item, I think, Councilmember Pearce, for bringing this forward. I have two lenses. So I'm a I was a city staffer for about five and a half years and now I'm in elected office.'",
        "'speaker_6': 'And seeing this from two lenses, I see the need for standardizing processes for anything that takes place. I think our employee groups for also being a part of this discussion as well. We did receive letters and communication, so that's wonderful from the Legislative Department.'",
        "'speaker_6': 'When I work there, everything from mental health training, I mean, I was a field representative in the first district. A lot of individuals experiencing homelessness. They would come into the office. I didn't even know how to handle that.'",
        "'speaker_6': 'I had to call security twice. I mean, there are things that I think our staff, we often overlook and we don't actually add additional support for these very, very important issues. And then everything from, like I said, legislative to mental health on the elected side.'",
        "'speaker_6': 'I would like to identify and clarify clear processes for appointed officials and the governing body city council. You know, we we have active shooter training for our staff, but we haven't even received active shooter training, which is probably directed at us, unfortunately.'",
        "'speaker_6': 'I hate to say that, but in this day and age, we have to think about those things. And you know, my staff, I'm glad they got that, but we did not receive that. And so I think that, you know, things like that, I think we need to be very cognizant of as well as our staff members and'",
        "'speaker_6': 'rank and file that are out in the field. You know, we've had incidents before and we don't we want to prevent that. And then lastly, I will say the on the elected side, I know that our city attorney deals with many of our issues.'",
        "'speaker_6': 'And I don't know the clear process because sometimes we go to h.r. Sometimes we go to the city attorney. So i'd like to include the city. The friendly amendment would be to include the city and attorney in this process and ensure that we have clear understanding as an elected body of who we go to, that the department'",
        "'speaker_6': '. Is it the city attorney when issues arrive in the workplace, whatever happens, i'm not sure what that processes. And so if we can include that, that would be great, or the city attorney would like to say anything. I think both him and his office should be included in that.'",
        "'speaker_4': 'Yes, Councilmember, we'd be happy to be included in that.'",
        "'speaker_9': 'Just kind of a.'",
        "'speaker_4': 'Background on some of the issues. If it deals with a.'",
        "'speaker_9': 'Personnel issue that doesn't fall within the jurisdiction of the city manager departments, for example, a personnel issue in one of the.'",
        "'speaker_4': 'Elected offices that would generally be referred to the city attorney's office.'",
        "'speaker_9': 'It's a problem for H.R. to be investigating their.'",
        "'speaker_4': 'Bosses boss type situation.'",
        "'speaker_9': 'So and then there are.'",
        "'speaker_4': 'Other areas where we.'",
        "'speaker_9': 'Would get involved if.'",
        "'speaker_4': 'If it is beyond the scope of the department and we need an outside attorney.'",
        "'speaker_9': 'To do the investigation that would be hired through my office so we could certainly participate and help clear up any confusion on when an investigation is handled internally.'",
        "'speaker_4': 'Or we go outside.'",
        "'speaker_6': 'So yeah, and the process as well, how it's handled. So I would love for for you to be included in that in your office, to be included in that. And I think that would clarify, I think from from our end on what to do.'",
        "'speaker_6': 'I mean, there's a lot of issues I've gone to H.R. in some cases have gone to city attorney. And I just think on the elected side, we need to be a little bit more clear on that. So I think, Councilmember Pierce for bringing that up again, those are my thoughts and I think again, our employee groups for'",
        "'speaker_6': 'being a part of this.'",
        "'speaker_9': 'Thank you, Councilmember Ringo.'",
        "'speaker_4': 'Thank you, Mayor. And that, like Councilmember Gonzalez said to have. We are two separate lengthy. A little longer. You know I retired from the city after 28 years of working in the city. Long Beach has started with a civil service.'",
        "'speaker_4': 'And then I went there. That was I became the superintendent manager police compounds where he did a lot of hiring. And then I ended up my my career with the Department of Health as the administrative officer there. And each one of those points, I had a touch in the employment process there with employees.'",
        "'speaker_4': 'When I was in the civil service, I was obviously doing exam examinations for employment. A good portion of my career with the civil service was recruitment, and that's where I have a lot of concerns and issues regarding diversity and helping improve the diversity of our city and making sure that we get people at the front end that'",
        "'speaker_4': 'are reflective of our communities and not at the back end. So it's beginning. It's one of those issues that is very important and very dear to me that we make sure that we are expanding our umbrella as far as we can and looking at every nook and cranny to get that qualified individuals to apply for city positions'",
        "'speaker_4': 'and that we hire them if they meet the qualifications. Also, when I was at civil service and various other times during my career, I was the Department's Equal Employment Representative, which meant that I had to deal with not only issues of harassment or workplace harassment and or sexual harassment, but I had to deal with any of the'",
        "'speaker_4': 'other issues that are involved with employee to employee relations, as well as with employee and supervisor issues as well. So I had that experience when I was working with the towing operations. I was the manager there. I did the hiring and firing, the supervision and the training, and I had several incidents while I was there talking related'",
        "'speaker_4': 'to not only workplace harassment with employer and employee, but also harassment with a manager, with their employees and as well as inappropriate relationships. And I just leave it at that. But that that has come up through my experience.'",
        "'speaker_4': 'It is way too far. And then as the administrative officer with our department, I sat in a number of hearings, skelly hearings, as well as the Looby hearings, and understand what a skelly hearing is. A scary is when a classified employee is going to be terminated from his or her position.'",
        "'speaker_4': 'They go through a hearing and then they go to civil service of the appellate. And then the Civil Service Department Commission determines the fate of that employee, whether it upholds the discipline that the city that the city has imposed on it or rescinds it or sends it back to to do some other kind of discipline in a'",
        "'speaker_4': 'Looby hearing. It's basically a Looby hearing is conducted for employees who are unclassified, who aren't under the jurisdiction of the court or the charter for the civil service, for civil service rules or regulations which dictates how an employee moves or or is promoted and disciplined in the classified service.'",
        "'speaker_4': 'People who take an exam get all this and get hired. And in those hearings as well, it was interesting to hear some of the the issues that he had to deal with there in terms of employees who misbehave.'",
        "'speaker_4': 'And it's not only in terms of employees misbehaving, but also managers misbehaving as well. And that's an area that I think is not as well known or talked about as perhaps it can be or should be, because there are managers who who can be managers, who are managers and might not have received any kind of training about'",
        "'speaker_4': 'how to be managers. And I would say in all of this to to to the point of saying that, you know, any and all training that we are able to provide and give to individuals is good. It's good training.'",
        "'speaker_4': 'You learn something from it. If you didn't learn anything from it all, then so be it. And the discipline that comes forward is is deserved. But one of the most important things about all of this is that you have to make sure that if we are providing training, we have to make sure that it's documented.'",
        "'speaker_4': 'Because I'm parents of what I see here is an opportunity for the city to, I guess, not indemnify itself, but at least provide itself with with some safeguards that would say, I received training on sexual harassment. I receive training on how to handle a traumatized employee who see who got a who was intimidated by his or her'",
        "'speaker_4': 'manager. And we need to have those kinds of safeguards so that if and when it ever goes to a a jury or a trial or a court, we have the opportunity to prove that that we did provide that training along with my career.'",
        "'speaker_4': 'We also I also used to participate in what we call the employee orientation, new employee orientation. And the latter part of my career, I didn't see those anymore. I don't know if they were discontinued. Maybe staffing was an issue.'",
        "'speaker_4': 'Could have been. But I think that we need to bring something like that back to let new employees know what their rights are, where to go, if they encounter any kind of situation or their put in place of any type of situation that would put them in jeopardy of losing their jobs.'",
        "'speaker_4': 'Personally, I was I was one of those guys. I was put in a situation where, like, either if I if I said anything, I was going to be fired. If I punched the guy back, I was going to get fired or if I resigned, I was going to resign peacefully.'",
        "'speaker_4': 'I was going to be I was going to blow the whistle left and right everywhere. So those are the choices sometimes that employees are left with. You know, it is frustrating. So where do they go? And I also had an employee come to me who was sexually harassed.'",
        "'speaker_4': 'And while I was more trained, perhaps more experienced than other ales or administrative officers in that in that area, I still felt inadequate to be able to address this employee's issues with her manager. So I did what most managers would do, I hope would do, and that's to call H.R. and have H.R. be the the the conduit'",
        "'speaker_4': ', if you will, between the the department and the employee to help him or her address their issues. So there's a lot of training that we need to do. And I and I'm very supportive of this item because I think it's important that we get it.'",
        "'speaker_4': 'Get not only start in the beginning to the where are we now, but where do we need to go and where do we want to end up? And we need we need to know that and some of those, you know, so some of these items that we're looking at, we don't need to reinvent the wheel, some of'",
        "'speaker_4': 'them, but some or maybe we need to bring them back like an employee orientation, especially dealing with an employee orientation that deals with these very specific items in in regards to employer employee relations or supervisor supervisor subordinate relations, what to do and where to go and and how to recognize.'",
        "'speaker_4': 'A lot of people might not recognize the fact that they're that they're being exposed to a workplace issue where maybe there's some just innocent joke telling being told and it's inappropriate. And she reported and and one of the most important parts of that is retaliation.'",
        "'speaker_4': 'We've got to make sure that that we tell our employees that retaliation. Retaliation is unacceptable. At all levels. So I know I was long winded on this, but, you know, also it could go on for 28 more years on dealing with this issue.'",
        "'speaker_4': 'But I supportive of it. It's it's a good item that we move forward with it. And I think that some bought some real positive results. I'm expecting that some real positive results will come as a result from ISM.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_9': 'And Mr.. Thank you very much, Mr. American.'",
        "'speaker_1': 'I had one point of clarification.'",
        "'speaker_9': 'Why then?'",
        "'speaker_1': 'Kinsmen of Virunga? You're correct. For a while we did discontinue the orientation as we went through the Great Recession. One of the things that Alex Basque was did as the new director is institute those. So we have them about what, every two months now.'",
        "'speaker_8': '2 to 3 months.'",
        "'speaker_1': 'And we go and we present.'",
        "'speaker_4': 'To that everyone goes through a full day or a half day orientation and get all that stuff. I have hired two new employees within the last year and they haven't gone to an orientation. So let's get them signed up as we require everyone.'",
        "'speaker_1': 'In our end city managed department. We get a lot of others from other departments too. We'd love to have them.'",
        "'speaker_9': 'Thank you. Customer support now.'",
        "'speaker_8': 'Thank you. This this would apply to electeds. And just for my own case, in a normal election after the election, you would take office in like 90 to 100 days. If there's a runoff, it's half or maybe a little less than that.'",
        "'speaker_8': 'I took office after a special election in 2015, and after the election I took office eight days later. And so the terms on boarding and orientation are very foreign to me, but thank you for bringing up that topic.'",
        "'speaker_8': 'My challenge with this item would be two of the four items start off with requests the city honestly to conduct an audit. In fact, that's in the heading to and my feeling is all of these all four items should be conducted by our h.r.'",
        "'speaker_8': 'Department. That's the way it's set up. And I have great faith in our city auditor. It's not that i don't think she's up to this task. It's just that i think that expertize should lie within our h.r. Department.'",
        "'speaker_8': 'The long beach business journal one month ago on August 13th published their annual salary survey of the city. And we always hear about that after the fact. So the latest number for the two had $200,000 a year club.'",
        "'speaker_8': 'That number is up to 43 employees. And what we always tell our constituents is, well, an operation, a city this size, you need that level of executive management expertize and that level of executive management exists in our h.r.'",
        "'speaker_8': 'Department. So I'm thinking this item and saying our h.r department cannot handle this task. And if that is in fact, what the problem is, then we do have a bigger problem than just conducting an audit. So for that reason, I will not be supporting this item.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_9': 'Thank you, Councilmember. I'm going to go ahead and go back. Actually, we only have one more comment. Councilman Mongo, I'll make a comment and then we'll go to public comment. Councilman Mongo.'",
        "'speaker_10': 'In the spirit of trying to start. I know it's going to take time for all of us to adjust and move towards our new council policy. Would you be open to the departments that are involved getting us a TFF that is in alignment with the policy we just passed?'",
        "'speaker_10': 'If we pass this tonight, that would be appreciated. So I know Mr. GROSS isn't here because he didn't expect this question, but if Mr. GROSS could and my friendly would be that Mr. GROSS work with the departments that are requested to ensure that it tff come back to us with the information as required by the new policy'",
        "'speaker_10': 'of resource allocation. As passed by this council with the budget this year. Thank you. I appreciate that.'",
        "'speaker_9': 'Thank you very much. Let me go ahead and just to just say for what public comment I know this has not been said tonight yet, but I do want to thank our H.R. department for the work that they do.'",
        "'speaker_9': 'We have we have almost we have 5600 employees, almost 6000, if you include some of the other part time employees. And I know that there is a dedicated team of professionals that are in that office, many of which have been here in the city for a really long time.'",
        "'speaker_9': 'And H.R. is one of the most difficult things you can do in any organization. It doesn't mean that we can't improve. I think there's always improvements in all of our departments. But I don't want it to be there being an appearance or an interpretation that somehow our H.R. department is not doing a great job.'",
        "'speaker_9': 'And I want to thank Alex and you and your team for consistent excellent work. And and I want to thank you also for for an organization of this size. The level of work that you're I would say small team does is pretty, pretty amazing.'",
        "'speaker_9': 'And so I want to make sure I had a chance to say that. And since it's not been said tonight yet much, let me let me also just add that I don't I don't have issues with the agenda item is presented.'",
        "'speaker_9': 'I think that it's a good opportunity for the auditor to be involved with the city and to tell us how we can do better. I have to agree with when it comes to and I have mentioned that I think the staff and this will be a good opportunity to review this.'",
        "'speaker_9': 'For because elected particularly are elected independently, the process of of training and transitioning and employees. It is partial it's part you know it's it's divided up among some of the administrative work is done through the mayor's office on the on the legislative side which as you're aware I've in the past said that I not ever been crazy'",
        "'speaker_9': 'about that piece. I always thought that that should go fully to H.R.. But there also are concerns as related earlier that a lot of it a lot of the issues will go to the city attorney. So I think I'm very interested in how we improve the elected appointed piece and what are best practices in other cities so'",
        "'speaker_9': 'that we can get that piece better. So I do support very supportive of that. And I think that I've said this to our city auditor many times, but I think when we partner in these audits, we usually get really good recommendations and really good results.'",
        "'speaker_9': 'And so I just am thankful to her for agreeing to partner in this process. But I do I do understand. And I want to just thank everyone that made their comments. I do agree with everyone's comments today. And so I just thank them for all of that.'",
        "'speaker_9': 'So, Jeff, the things for city attorney. Yes. Thank you, Mayor. And you did allude to it, but I do point out the charter section 207b, that each individual member of the city council has the authority to appoint, suspend, remove and discipline the employee or employees.'",
        "'speaker_4': 'Of the Legislative Department who serve at his or her pleasure.'",
        "'speaker_9': 'Right. And so nothing this evening or nothing out of this.'",
        "'speaker_4': 'Study changes that authority. So it it's it.'",
        "'speaker_9': 'We can study it. We can look at it.'",
        "'speaker_4': 'But the charter says what it says for the elected officials.'",
        "'speaker_9': 'And and this ordinance will not change that. That's right. And I think that that's and we'll look at all of that as we as we move forward. We obviously, each member is responsible for their they're the appointing authority and they are responsible solely for for their employees and for their office.'",
        "'speaker_9': 'So, Councilman Mongo.'",
        "'speaker_10': 'So I know I made a comment and my first set of comments related to the views fellow. Mr. MODICA Will there be a presentation to this body on that or is that something that maybe I could throw into my friendly that her report and her findings or a meeting between her and the auditor take place as a'",
        "'speaker_10': 'part of this overall?'",
        "'speaker_1': 'So we were planning on doing that as part of item three, if you were to pass as we were going to do it anyway, to report out on where we are. It's the Fuze fellow was looking at one portion of it.'",
        "'speaker_1': 'There's a number of other things, so we'll likely consolidate. But we'd like to come back and talk to you about some of the some of the things that.'",
        "'speaker_4': 'We're working on to improve the hiring.'",
        "'speaker_10': 'Practice. I would only say that from what I hear again, her term is almost over. And so if there was an opportunity for her to sit down with the auditor before she leaves and and kind of talk through her experience, I haven't done that yet, but I hear that there's a lot of opportunity for us to learn'",
        "'speaker_10': 'from an extensive 12 month process.'",
        "'speaker_1': 'So so we'll definitely partner with the attorney, with the auditor. I do believe she ends in two days so that it's we are we are wrapping up.'",
        "'speaker_10': 'That is the end. Okay. Well, thank.'",
        "'speaker_9': 'You. Thank you, Councilmember Pearce.'",
        "'speaker_7': 'Oh, yes. I just wanted to thank all of my colleagues for their comments. And just, you know, we've worked a lot with the city auditor, but i did think I said thank you to our h.r. Department at the beginning.'",
        "'speaker_7': 'Maybe I got lost because i tried to run and talk really quickly. But i do appreciate the fact that we are a city of 6000 people is huge and it's a big endeavor. And one of the reasons why I wanted to partner with the city auditor's office is so you can continue to do your job and the'",
        "'speaker_7': 'city auditor can take a sidestep and take a bird's eye view and a different lens and really look at what other cities are doing. And so I think that that for me was an important distinction because I feel like the things that she's come forward with have been really great and it gives us an opportunity to do'",
        "'speaker_7': 'that. So I think my colleagues for the the thoughtful conversation today, I'm really proud of this item. I'm really proud of the steps that Long Beach is taking to align our city with the values that we continually govern on behind this dais.'",
        "'speaker_7': 'So thank you very much.'",
        "'speaker_9': 'Thank you, Councilmember Councilmember Ringo.'",
        "'speaker_4': 'Thank you. Jeremiah. My soapbox. I left off one aspect of the of the proposals here you're talking about and constituents. So if you get Councilman Pearce complete giving a clarification in regards to how constituents.'",
        "'speaker_3': 'Can.'",
        "'speaker_4': 'Come into a play into play with with this.'",
        "'speaker_7': 'I think it goes back to what Councilmember Gonzalez mentioned, which is as as on the 14th floor and as the city attorney made real clear, we are the ones that hire and fire and train our staff. So I have to go out of my way to create a new training or find a new way to train my'",
        "'speaker_7': 'staff on trauma informed practices. Because I have a lot of constituents in my district that call that are struggling with their mental health. We've had to call police sometimes. We've had to call our quality of life officer. So if I can get my staff the right training to give them a couple more tools in the toolbox on'",
        "'speaker_7': 'how to handle folks with with a soft glove instead of, you know, immediate call that might trigger them or statement that might trigger them. That training is something that I'm providing for my staff and I provide for my constituents, but it helps us deliver better services to to our residents.'",
        "'speaker_4': 'So that that clarifies that. Absolutely. I was looking from the other from the other lens in terms of constituents who might have had a traumatic experience with a city employee. For example, when I had to contend with an issue regarding a city employee who sexually harassed a constituent, asking for her number, going to her home, I don't'",
        "'speaker_4': 'know how he got it, but he got her house number and phone number and then he began harassing her. She came to me as a manager, say, what are your employees? Is is harassing me. I brought him in.'",
        "'speaker_4': 'I interviewed him, determined that she was correct and subsequently let him go. So that's the other part that I was.'",
        "'speaker_7': 'So I think the training overall is going to assist all of us on the best practices. It's going to assist management directors and give some training for our constituents. So thank.'",
        "'speaker_4': 'You. Thank you.'",
        "'speaker_9': 'Thank you. Public comment. Please come forward. Hello. And if you're going to comment on this item. Oh, this is public comment for this item. Yes. Yes. And please come forward on this item and just just line up, please.'",
        "'speaker_9': 'I'm going to close the speakers list, I think, Mr. Suarez, for comment on this. And Mr. Suarez will be the last speaker. Yes.'",
        "'speaker_3': 'I. My name is Devin Deming. I am a resident of the eighth District. And I just wanted to say thank you so much for this. I spent my entire career in public service as a manager, in public service.'",
        "'speaker_3': 'I was of the city of Los.'",
        "'speaker_7': 'Angeles for 18 years and human resources. I have dealt with this all from an employee.'",
        "'speaker_10': 'As a supervisor.'",
        "'speaker_7': 'This is so, so important. Thank you so much.'",
        "'speaker_9': 'And you're an amazing manager at the public agency you work at today. So thank you.'",
        "'speaker_3': 'Hello. My name is Beverly. Life Firm and constituent resume district two. I do. The audit. The auditor's job for the federal government. Though I am not a trained auditor, I do it for my individual agency, not the GAO or an IG's office.'",
        "'speaker_3': 'And I just want to respectfully comment on council member supernormal comment about it's should be his job to conduct this audit of themselves. An audit is an independent analysis and research. It is not. Proper GAO, OIG. And I know you're not the federal government, but you have the same standards to audit yourselves.'",
        "'speaker_3': 'You can't expect the office to necessarily recognize not because they don't want to, but they're not. Their perspective is not independent and objective. It can't be. Plus, as others had mentioned, their job is to do our work. Let them do their job.'",
        "'speaker_3': 'Let the auditor and the audit office do their job so that they can assist h.r. And hence the whole city. I want my taxpayer money to be used appropriately. Thank you.'",
        "'speaker_9': 'Thank you. Next week, release.'",
        "'speaker_6': 'As high level shapiro. This is not why I'm here tonight, but Councilmember Pierce. Thank you very much. I'm not sure if you're aware that there were hidden cameras found in the restrooms at the Long Beach shelter. And it's really left employees and visitors really unsure and unaware of what has become of that.'",
        "'speaker_6': 'And the shelter in the city did not provide notification to employees or to guests. And I just I'm asking you to please look into this for the continued safety of employees and guests, for the well-being of everybody. I understand it's a LBB PD matter right now, but it just publicly we were not told.'",
        "'speaker_6': 'So I appreciate your attention to this entire matter. Thank you.'",
        "'speaker_9': 'Thank you very much, Nick Speaker, please. Thank you very much. My name is Bill Ward and I'm a member of the First District. I spent 25 years working in government affairs. I was a worked for five state lawmakers and also others I would agree with in the first district.'",
        "'speaker_9': 'The nature of public service is that sometimes you get people who are mad and they are sometimes dangerous. When I was the district director for Assemblywoman Sally Harvest, we had someone come to our door who I had a member of the they would send.'",
        "'speaker_9': 'They sent two officers, one, one on either side of me, each with a gun. And I spent half an hour listening to a clearly crazy man. And at the end of that conversation, he left. And then he went to a another elected officials office.'",
        "'speaker_9': 'And they did not have the good fortune of being able to listen enough that he walked off and was just mad because he's mad. Instead, they were deeply concerned. They called and the person was given a three day lockup.'",
        "'speaker_9': 'And I was the one who later got a call from the guy saying, You locked me up. Well, no, there's a very difficult business in politics, which is that sometimes, even though you know someone's crazy, you're the one who gets blamed when someone else goes a little thin.'",
        "'speaker_9': 'So it's a very hard business. I would like to commend the gentleman of the eighth District. There are hard times when you are on the count on the dias. And I worked for a senator who himself was ejected from the Senate because if you throw a book hard enough, pretty soon it hits you in the head and'",
        "'speaker_9': 'someone bleeds. Rod Right. Had to exit the Senate because not because of the members of the Senate, but because he got hit on the head with a with a book. And, yes, he got taken out. Members of the council here have taken a close look at something that was a hard issue.'",
        "'speaker_9': 'And by an 8 to 0 vote, they made a tough decision. Those are the things that you got to do. And it's a hard business. Thankfully, I will never be someone who is sitting at the dais because having spent the time I have, I'm lucky simply to be an obscure novelist and I'm not going to be running'",
        "'speaker_9': 'for office. So I am glad to see the meeting today, have so much discussion. Commend the member of the Second District for a great discussion and members of staff. You've got a good town and you've got good leadership.'",
        "'speaker_9': 'So good luck to you all. Thank you. Next speaker, our final speaker. Good evening, Mayor. City council members. I have some prepared statements, but before I read from them, I just want to quickly say that my comments today and I agree with those that support the current administration.'",
        "'speaker_9': 'I believe that Alex and her team inherited a broken product, and I think that bringing light to it is clearly in order. The city of Long Beach is a great, thriving community. Responsible for the successes of this community are almost 6000 loyal employees who toil here every day.'",
        "'speaker_9': 'I have the honor of representing the majority of City of Long Beach employees. I stand before you in an effort to inform and highlight this much needed review. We have members that toil in departments every single day that are under inconsistent policies and practices.'",
        "'speaker_9': 'H.R. historically has allowed department to put in place its own policies at times, at times without concern or regard for equal treatment. Some policies even go as far as being racially biased. We are having a problem right now with the police department, with a dress code policy.'",
        "'speaker_9': 'Additionally, some departments arbitrarily make decisions without proper guidelines, which allows them to make decisions that are the basis of a guilty until proven innocent model. We have had members may complain to the EEOC office and have been rejected the same day, explaining that they will not be looking into the complaint because it's just a personality conflict.'",
        "'speaker_9': 'How can they make that determination without a proper investigation? Time and time again, we have management covering for one another without the resolution of our members. H.R. continues its paralysis. A significant number of city of Long Beach workers are also live here as taxpayers.'",
        "'speaker_9': 'They pay the wages for all those who take home a city of Long Beach paycheck. I've been assigned to this location. I'm going on five years. I have never come across a work location in my 32 years in the labor movement.'",
        "'speaker_9': 'Where the Human Resources Department is as disconnected and uninvolved in policy and its implementation as they are here. The divide and lack of consistency is monumental. It's important that you understand this isn't just an issue. These are policies that affect everybody, and they're different throughout the entire landscape.'",
        "'speaker_9': 'I urge you this evening to, in the strongest terms, to support this item tonight. Thank you. Thank you. Thank you, Mr. Suarez. We have control of Supernanny, and then we'll go to a vote.'",
        "'speaker_8': 'Thank you. Just because I was called out personally for my comments, I feel compelled to respond. And if I miscommunicated, I apologize. I never suggested that H.R. should conduct an audit. That was my whole point. What I was trying to express was that onboarding orientation and informing employees of their rights should be something part and parcel to'",
        "'speaker_8': 'the duties of H.R.. So that's why I thought it should be handled internally. Thank you.'",
        "'speaker_9': 'Thank you, Councilmember. We have a motion in a second. Please cast your votes.'",
        "'speaker_3': 'Motion carries six one.'",
        "'speaker_9': 'Thank you. And we have. So let me. We have. So just just I want to be clear on the agenda order. So I shall have two items that have been requested to be moved up. I also have a full speaker list of ten speakers.'",
        "'speaker_9': 'So if we can briefly go through these items and I need to get to the speaker's list and then I have a we have a full agenda after that. So 31. Staff.'"
    ],
    "Update on Veterans Affairs Commission Activities. ": [
        "'speaker_3': 'Motion carries seven zero.'",
        "'speaker_9': '27, please.'",
        "'speaker_3': 'Item 27 is a report from Health and Human Services recommendation to receive an update on the activities of the Veterans Affairs Commission over the past 18 months.'",
        "'speaker_9': 'I think you're going to hear the side of and then do the the public comment. Councilman Richardson.'",
        "'speaker_2': 'Thank you. I wanted to just take a moment and acknowledge the Veterans Affairs Commission and the hard work that they've led. This was one of the third, fourth proposals I brought. The city council was to begin the process of developing this new commission.'",
        "'speaker_2': 'And I'm really proud of the support that the city council and the Budget Committee and everyone has led to establishing this in the Health Department. We're really proud of their work and we want to see and I'm looking forward to this update.'",
        "'speaker_2': 'And side note, I want to just sort of refresh this issue that that Veterans Affairs strategic plan is still seeking funding. It's been pegged about $40,000 needed. So we're going to try to advocate for that in this upcoming budget.'",
        "'speaker_2': 'And so we'll try to keep that issue alive. But I look forward to this this presentation.'",
        "'speaker_9': 'At the presentation.'",
        "'speaker_1': 'Thank you. Good evening. Honorable Mayor and council members like to introduce Gina OVERHOLT. She is our program manager for the Veterans Affairs Commission and she'll give a brief report and will be open for questions at the end. Thank you, Kelly.'",
        "'speaker_1': 'Honorable Mayor Garcia and council members, thank you for the opportunity to provide you with this brief update on the Veterans Affairs Commission. I'm Gina OVERHOLT, the coordinator for the Veterans Affairs Commission, which is administered administrated by the Health Department.'",
        "'speaker_1': 'Our core purpose, the Long Beach Veterans Commission and advises City Council on matters of importance to veterans in our city. This slide continues and shows additional details on the rules of the commission. It highlights the many achievements of those who have dedicated their lives to protecting the country.'",
        "'speaker_1': 'Serves as an advisory body to the Council regarding the well-being of military veterans. Provides recommendations pertaining to the affairs of veterans. Evaluates and recommends programs, policies and practices to assist veterans and acts as a central clearinghouse for information, programs and services relating to veterans.'",
        "'speaker_1': 'One of our objectives. Oh, I'm sorry. The original ordinance ordinance requires that at least four of the nine commissioners be veterans. One from each council district is the nine. We have seven out of nine commissioners are veterans. One of our objectives to act as a central clearinghouse for information, programs and services relating to veterans.'",
        "'speaker_1': 'Towards this end, we created a Facebook group page where we post on the average five times a week. So the that's just a snapshot of the the cover page and the URL is at the top. So I invite you to be one of the 200 plus followers that we have.'",
        "'speaker_1': 'Another one of our objectives is to provide recommendations pertaining to the affairs of veterans residing within our city. Towards this end, we've worked with other city departments such as Long Beach Fire. We provided input on the impact of 4th of July fireworks on veterans with PTSD and collaborated on the social media campaign developed around this issue.'",
        "'speaker_1': 'So this is an example of one of the messages. City Council, as you know, tests the commission with developing a strategic plan that includes programs and policies designed to assist veterans in multiple capacities and build stronger connections between local veterans and the community.'",
        "'speaker_1': 'What does the commission recommend that the city do to serve and support veterans over the next 2 to 3 years? The plan's recommendations must be thoroughly vetted, supported by data and well-developed, so they provide specific action plans to achieve strategic goals and objectives.'",
        "'speaker_1': 'The Commission developed temporary working goals based on their insights and expertize as a starting point. Goal one Economic Development Increase veteran employment by advising the City Council on ways to increase transitional employment opportunities, patronage of veteran owned businesses and private business ownership for veterans.'",
        "'speaker_1': 'Goal two Awareness and Recognition Increase awareness and recognition of all Long Beach Veterans, Service members and their families by advising the City Council on ways to regularly celebrate and recognize our veterans. Goal three Information Resources and Social Support to serve as a clearinghouse for information pertaining to resources, services and social support available to veterans in the Long'",
        "'speaker_1': 'Beach area. In collaboration with the city and and by advising the City Council, go for underrepresented groups. Identify and raise awareness of underrepresented veteran populations by advising the City Council about groups that may not identify as veterans and therefore may not seek assistance.'",
        "'speaker_1': 'So where we are now, we've developed a work plan to complete the strategic plan with existing staff collecting data. What exists on the Long Beach veterans population? What data exists on the Long Beach population already? And how do we access it?'",
        "'speaker_1': 'The next steps data analysis, identifying stakeholders and stakeholder interviews. And the plan is slated for release in July next summer. So I wanted to. Take a moment to invite you to the recognition ceremony for Lone Sailor. We're working with Partners of Parkes on this.'",
        "'speaker_1': 'It's on Saturday, October 13th, 10:10 a.m. to noon with the presentation starting at 11. The lone sailor is is in Bluff Park at Ocean and Paloma. So then I also wanted to take a moment to let you know that Long Beach Veterans Affairs Commission will also be participating in the 21st annual Veterans Day parade.'",
        "'speaker_1': 'We invite you to the Veterans Day Parade and Festival, which kicks off at 10 a.m. on Atlantic Avenue in North Long Beach. So the Long Beach Veterans Affairs Commission meets on the second Wednesday of the month at 5 p.m. at the Health Department's main building on Grand Avenue.'",
        "'speaker_1': 'Thank you, honorable Mayor and Council members for the opportunity to provide this update on the Veterans Affairs Commission. This concludes my presentation and I'm now open for questions.'",
        "'speaker_9': 'Thank you very much for that presentation. That was great. And I know that we have some of our commissioners here as well. And I just wanted to also thank them for their incredible work on the Commission of Councilor Richardson.'",
        "'speaker_2': 'Oh, I echo that. Congratulations. We want to make sure that we continue to support this commission. We. I'm really impressed at how engaged all of you have become. You've attended numerous events you were engaged in. You were there when we opened up the new veterans Fowler Plaza at Highland Park.'",
        "'speaker_2': 'And I look forward to getting you the resources working to get you the resources you need to present a really comprehensive, strategic plan that we can take very seriously. I applaud the work you've already done. The fact that a lot of the things you called out are in alignment with many of the things we've brought up in'",
        "'speaker_2': 'terms of including ensuring that veterans are included in our economic development strategies and that we continue to place a laser focus on underrepresented groups. So thank you for your hard work and I'm really proud to support you and continue the good work that you're doing.'",
        "'speaker_9': 'Thank you. Catherine Ashton.'",
        "'speaker_2': 'Thank you. Also, I second this motion. Thank you for the great report. I want to just recognize the veterans commission because this is a one of our newer commissions and you guys have really stepped up and really taking your role seriously to the point where I think, you know, they've had to say, hey, slow down a little'",
        "'speaker_2': 'bit, but I'm glad to see that there there's some focus of some some guidance. I speak regularly with our veterans of the commission representative for the eighth District, Sylvia Contreras, her and her husband. I know they're very, very involved.'",
        "'speaker_2': 'You continue to have my support. And like I said, I'm very encouraged by this report here and keep up the great work. Thank you.'",
        "'speaker_9': 'Thank you. Councilwoman Gonzalez.'",
        "'speaker_6': 'I just want to say thank you as well. I come from a long line of veterans and my family. Also being I was married to a marine for that went to Iraq. So a lot of people don't know that about me, but that is really I just really love this commission and all that it's done.'",
        "'speaker_6': 'What I'm specifically appreciative of is the data analysis portion. And so we're having discussions about digital inclusion. And I would love, as were growing that discussion and including more members, I would love to have one of the members of the Commission come to the digital inclusion discussions to talk about from your angle, what would make that initiative'",
        "'speaker_6': 'much better. So thank you for your service, your service not to just the city but the country as well. Thank you.'",
        "'speaker_9': 'Councilor Pearce.'",
        "'speaker_7': 'I want to echo the same appreciation for service, appreciation for staff. I know our commission sometimes it depends on how much staff energy and how much time and how the commission works together. And this is one of the commissions that I think everyone that's invested in it, including the council members in North Long Beach, have done a'",
        "'speaker_7': 'great job on. So thank you very much. I look forward to continue to work. I'm particularly excited about the job opportunities in the transitional piece, so let me know how I can help you all.'",
        "'speaker_9': 'Thank you. I'm closing the council comments. Any other public comment on this? Sorry. And please come forward so we can move on. Go ahead, sir. Thank you very much. When I was with the five state lawmakers. The state doesn't do a whole lot in terms of veterans.'",
        "'speaker_9': 'That's usually the feds or the county. And so very much I commend the city, commend the commissioners and the sponsor for this. One of the things that is one of your points is the economy. There are 3 million who have served in uniform in the last 20 years in open war.'",
        "'speaker_9': 'And in light of those 3 million people, a lot of businesses are aggressively pursuing employees who are veterans. Starbucks, if you're going to go to Starbucks, they are hiring 25,000. Staff personnel who are in have been in uniform.'",
        "'speaker_9': 'So when you find businesses who do encourage military service personnel. Absolutely. You can engage that. This was the capital of the Pacific fleet for almost 80 years. The presence of Mr. Roosevelt as the head of the Navy in World War One and as president in World War Two, does remind that, honey, that Long Beach is at the'",
        "'speaker_9': 'center of the military status of this nation. So absolutely not only do you have jobs that can be encouraged, but if you had a V to the letter B and B, your bed and breakfast can be VB and beans.'",
        "'speaker_9': 'You can lead the nation by the creation of an encouraged growth of tourism with veterans, with VB and B you can tell the local businesses. Why don't you give some discounts to veterans coming over? Why don't you give some lower costs for rooms?'",
        "'speaker_9': 'Why don't you give some housing that is for a month? Why don't you give some meals that are for free? VB And BS is something that can be a tourism growth for this city. Thank you, sir. Please cast your votes, members.'",
        "'speaker_3': 'Motion carries.'",
        "'speaker_9': 'Thank you. So I want to let me hear. If I call your name, please line up so we can make this expeditious sampler, this Bill Shorten and just trying to get folks that are in different groups. So let me start with Bill.'"
    ],
    "Long Beach Safe Parking Program Feasibility Study and Pilot Program.": [
        "'speaker_0': 'Motion carries 32.'",
        "'speaker_3': 'I am 32. Communication from Councilmember Pierce. Councilwoman Gonzalez. Councilwoman praised Councilmember Warangal recommendation to receive and file the Long Beach Safe Parking Program, facility, feasibility study and direct staff to initiate a 12 month pilot program at two locations within Long Beach.'",
        "'speaker_9': 'It seems the public comment scene on Councilmember Pearce.'",
        "'speaker_7': 'Yes. I'd like to turn it over to staff for staff presentation. Then behind the veil for conversation.'",
        "'speaker_1': 'Good evening, honorable mayor and council members. As you remember, in October of 2016, the City Council requested a report on the feasibility of implementing a safe parking program. The Health Department did so looking at five other cities. Almost all were in California.'",
        "'speaker_1': 'One was in Washington. They identified five best practices, basically, that everyone who participates in the Safe Parking program is working on transitioning into permanent housing. They're generally run by nonprofit agencies, usually utilizing a variety of resources. They have a well-developed relationship with local police departments.'",
        "'speaker_1': 'But what we found is that they haven't had to use that very much, that they operate only in evening hours. So they tend to maybe start at five or six at night and end at seven in the morning and that they do not allow for RV parking.'",
        "'speaker_1': 'Generally, the programs require that people engage in planning and services to reach permanent housing. The staffing is sort of a case manager and worker model and all the information is entered into the homeless management information system. So they're fully engaged.'",
        "'speaker_1': 'Those eligible to participate get a time limit. A parking permit might be 30 days, 60 days, 90 days. That is contingent upon their participation in services and that programs are mostly have a small number of units and multiple sites.'",
        "'speaker_1': 'So in many cases you only have five units, seven units, something like that. Um, so the, the recommendation was to do a pilot program with a number of sites up to approximately 20. And from that, the estimated cost is about $220,000, which include staffing, facilities, security and other materials.'",
        "'speaker_1': 'With that, I closed my presentation. Spaces. 20 spaces.'",
        "'speaker_4': 'Just to clarify, that would not be two sites.'",
        "'speaker_1': 'That would be two spaces. We're talking about that in.'",
        "'speaker_4': 'One, two or three or other site.'",
        "'speaker_7': 'Right. I think the. Appreciate the staff presentation. Again, a little bit of context. So this was an item that was brought forward over a year ago and staff did a great job about hiring an outside consultant to come in.'",
        "'speaker_7': 'We facilitated meetings with, I believe, nine different churches to find out would they be open to doing a program, program like this? If not, what were their hesitations? What did they need to see? So I think staff has done a great job talking about security and restrooms and cleanliness.'",
        "'speaker_7': 'I know in the second district this has been a major issue. We have a large population of people residing in their cars and that, as we've had discussions before, not only is good, it's not good for their health, but it's also not good for our neighborhoods when we have people emptying out their their waste of all types'",
        "'speaker_7': 'out on our street. And it is definitely something that we want to do better at. So I'm very thankful for. The nine churches most recently have had a discussion with the church on Seventh and Redondo. I know that there are some concerns about where the churches might be.'",
        "'speaker_7': 'I think having staff work with those that are willing and able and that we have good security measures in place is a great first step. I also really appreciate that staff has done a great job about identifying funded funding that wouldn't come from our general fund, but then would come from monies available at the state level.'",
        "'speaker_7': 'So I hope my colleagues will support this. I know it's something that we've been talking about for a long time. A pilot program with four locations and 20 spots with that turnover rate could really have a great impact on our residents.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_4': 'And if I can make a clarification, the.'",
        "'speaker_1': 'Agenda item talks about two.'",
        "'speaker_2': 'We would like some flexibility.'",
        "'speaker_4': 'To go through an RFP process and determine how many.'",
        "'speaker_1': 'Locations actually make sense. So given the dollars that would be.'",
        "'speaker_4': 'Available, how, you.'",
        "'speaker_1': 'Know, because some people may only want three or four spaces, some may want five or six.'",
        "'speaker_7': 'I think finding a good fit for us, that's not too many locations. I know that. I think four five is probably the conversation that we've had with with other folks. So I would ask that, yes, we go through an RFP process.'",
        "'speaker_7': 'I appreciate being able to be flex flexible. I think if it's more than four locations, we should have a two from four to the council to be able to talk about where those might be.'",
        "'speaker_4': 'Sure. If that could be add in the motion, that'd be great.'",
        "'speaker_6': 'I'll go right ahead. Okay. I have a comment.'",
        "'speaker_2': 'Yes. I'm sorry. Okay. Councilmember Gonzalez.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_6': 'So thank you for the the information. I'm glad that we're finally bringing this back. So thank you. Councilmember Pierson, you've been working on this for some time with our health department and many other organizations along with these churches.'",
        "'speaker_6': 'And what I would just say, and I know we're having this discussion, the 12 months in selecting a couple going from there, do we have or six months? Do we have a list of the nine churches that were in the discussions?'",
        "'speaker_6': 'Because it'd be nice to know who those are. And then secondly, I would just sort of reiterate, whoever we pick in the to whatever hopefully the pilot program goes well and it's, you know, to our liking and we like the process and we can get that figured out.'",
        "'speaker_6': 'But looking forward to like a mainstay program, I would really like us to look at this equitably around the city, and I continue to reiterate that because, you know, many of our downtown neighborhoods have been the fair share.'",
        "'speaker_6': 'We've we've had the fair share of a lot of the services. And I really just hope that we can find other cities are doing it. L.A. is looking at each each police division. So they have about four police, probably more police divisions, but they're looking at each police division to make it citywide.'",
        "'speaker_6': 'Other areas are looking per district. They're even looking at field offices of council members. I know that's a whole other discussion, but just in that same thought process, I hope that we can make this as equitable as possible throughout the city, not even just for our residents.'",
        "'speaker_6': 'But I also think about the individuals that are experiencing homelessness that may want different opportunities in different places close to other services around the city. So just a thought on that. But again, I think you and I think that was all my questioning.'",
        "'speaker_6': 'So thank you very much. I'm sorry, did you answer the nine locations?'",
        "'speaker_1': 'The nine locations. Councilwoman Pearce has those nine locations.'",
        "'speaker_7': 'Thanks. My staff is supposed to be sending them to me now. It's been a while since we reached out to them and not all nine of them. So it was a great conversation because not all nine said we have spaces available.'",
        "'speaker_7': 'Some of them said we have three spaces. I think one in your district said, you know what, we already do so much so we couldn't do overnight. But if you want to send people here in the morning, we can feed them.'",
        "'speaker_7': 'And so different churches have offered different things. I know in my district because I've been doing a lot of the work on the Seventh Street and Redondo. One is one in Grace UMC. That's at third and Gina Perez is another and both of those are outside of the downtown area.'",
        "'speaker_7': 'So I understand the the desire we can get you the list.'",
        "'speaker_6': 'So that would be, I think.'",
        "'speaker_7': 'After they do an RFP process, that will happen.'",
        "'speaker_1': 'Yeah, I want to clarify that. While we've done some initial outreach just to understand the market, this would still be an open competitive process.'",
        "'speaker_4': 'We're looking for both a.'",
        "'speaker_8': 'Vendor who can actually.'",
        "'speaker_1': 'Provide the services and run this program, but then also applicable sites. So, you know, the nine may be interested, but there may be others there may be some on that list that.'",
        "'speaker_4': 'Now, you know, aren't interested anymore. So that will all go through that process.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_0': 'Are you ready in the meeting?'",
        "'speaker_2': 'Councilmember Mongeau.'",
        "'speaker_10': 'Thank you. I would only ask that we again get a TFF back or a friendly amendment to bring a TFF back that says both the nine sites that that we can talk about or that'll come from Councilman Pearce and related to that.'",
        "'speaker_10': 'How much staff time it's going to take. I just really want to get in the habit of us making sure that we're assessing costs and staff time and specifically, like the item says, utilizing funding that's best appropriate. I think that staff could outline what that funding is and what the amount is and all of the I mean'",
        "'speaker_10': ', I just feel like there's a lot of information that's available that's not in the item yet. And so if we could get something back either from the councilman's office or from city staff, that would be helpful.'",
        "'speaker_4': 'So I can answer.'",
        "'speaker_8': 'Two of those quickly on the floor. We are looking at approximately $220,000.'",
        "'speaker_1': 'That was the estimate.'",
        "'speaker_4': 'And we can certainly refine that as we as we move forward. And the state the funding source would really be state homeless. One time dollars. Since this is a.'",
        "'speaker_1': 'Pilot program, we're trying something new.'",
        "'speaker_4': 'We do have the ability to apply for those dollars that's gone through and gotten very.'",
        "'speaker_8': 'Good feedback from the continuum of care.'",
        "'speaker_1': 'Partners. So we're really looking for counsel.'",
        "'speaker_4': 'Direction.'",
        "'speaker_1': 'Tonight. Should that be one of our priorities? So is.'",
        "'speaker_10': 'This from the part of funding we've already been allocated or is this a new part of.'",
        "'speaker_0': 'Funding.'",
        "'speaker_4': 'From the 1.3 that's been identified that Long Beach would be able.'",
        "'speaker_2': 'To apply for.'",
        "'speaker_10': 'And of the 12.3 that we're eligible to apply for? What was because this wasn't in it originally or was it.'",
        "'speaker_1': 'We are still putting together that actual list about we believe that we would.'",
        "'speaker_9': 'Be able to.'",
        "'speaker_1': 'Make room for it. It'd be about $220,000. Okay.'",
        "'speaker_10': 'Appreciate it. Thank you.'",
        "'speaker_2': 'I'll call on myself. I'll just say that I'm supportive of this item. I think, as I said before, you know, we are in unconventional times. And so we have to look at unconventional solutions to to to the problems of the day.'",
        "'speaker_2': 'You know, it's unfortunate that this is a one time funded in a one time manner, because if it's successful, you know, my my question is, you know, how do we fund it? You know, the following year or if the year after that, or how do you grow it if it's a successful program?'",
        "'speaker_2': 'And so this is hopefully something that we will model and be a best practice and hopefully have the state of California paying attention and county to to hopefully look at sustaining because I know it's going to be successful I'm optimistic here.'",
        "'speaker_2': 'The and then to staff I would just say that I've done some extensive outreach with many of our faith organizations churches in my district. And I know that we have a number of them who may be interested in participating.'",
        "'speaker_2': 'And so we'll be getting we'll provide you with a list as well of potential sites. So thank you. So with that, any public comment on this matter? See none, please. Members, cast your votes.'"
    ]
}