{
    "Opposition to Federal Definition of Sex and Support for Transgender-Inclusive Policies.": [
        "'speaker_0': 'Thanks. Thank you. We're going to go out and take that picture and let's give them a round of applause to thank him for their work. Okay. We're going to hear item 14, which is related to the item. Madam Court, can you read 14, please?'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Item 14 is a communication from Councilwoman Gonzalez. Council Member Peers. Council Member Tauranga. Council Member Richardson. Recommendation to request city managers to send a letter. Opposition to President Trump, the Office of the Civil Rights and the Department of Health and Human Services regarding their efforts to establish illegal definitions of sex under Title nine that exclude transgender people'",
        "'speaker_1': 'and request new language in the state and federal agendas.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_1': 'Yes. Thank you so much. And I'm glad and thankful for my coauthors, Councilmember Richardson, Councilmember Muranga and Councilmember Pierce for supporting me on this item today related to really what has been dubbed the Discrimination Administration. And I will say that, as we had mentioned earlier in the presentation, that we had just done that, you know, this this'",
        "'speaker_1': 'city is so much more vibrant and so much better when we are inclusive rather than being exclusive. So since two years ago, this administration has been dubbed what I mentioned, the Discrimination Administration, because of its constant attacks and exclusion of the LGBTQ community.'",
        "'speaker_1': 'The National Center for Transgender Equality has tracked this administration's roughly 30 individual actions against the trans community. And what we're asking for today is to ensure that this inclusion, not exclusion, remains on our state and federal legislative agendas and also remains a mainstay of our policy work here in the city.'",
        "'speaker_1': 'Some of the actions taken thus far by this administration have included the Department of Health and Human Services, removed demographic questions about LGBT people that center that Centers for Independent Living must fill out each year in their annual program performance report.'",
        "'speaker_1': 'Secondly, the Census Bureau retracted a proposal to collect demographic information on LGBT people in the 2020 census. He's also made mention of banning transgender individuals from the military. And I think the very first action that I personally noticed when he took office was removing the LGBT page off of the White House, White House's normal pages, which was'",
        "'speaker_1': ', for me personally a very strong reaction to being exclusive of the community. And so a few weeks ago, as we've seen this, they're trying to erase and redefine any definition of transgender form, form from federal law. And so what we need to do here is to just stand together, ensuring that, again, that we include the LGBTQ community'",
        "'speaker_1': 'in every single city policy that we have. So I urge my colleagues to support this item and certainly in a greater sense to support the LGBTQ community. And I think everyone, again, for being here at the center Long Beach, I see our Imperial Court friends and many friends that have been alongside us in our work for some'",
        "'speaker_1': 'time. So thank you very much.'",
        "'speaker_0': 'Thank you. Can we make the motion, please? There's a motion and a second council member. Pearce.'",
        "'speaker_6': 'Yes. I want to thank my colleague for bringing this item forward, I think. I feel a lot of the same sentiments. And tonight, celebrating remembrance. I've I've been there at Harvey Milk Park before when and I've stood there and I've read names.'",
        "'speaker_6': 'And it's really heartbreaking. And it's heartbreaking that it's typically once a year that we stand there and we share the names of people that have lost their lives for living to them their very best self, who they were born to be.'",
        "'speaker_6': 'And so it's heartbreaking because we often think about how do we educate small communities or, you know, after Prop eight, it was like, let's knock on as many doors as possible with members of the LGBT community so that we could say, Hey, I'm a normal human just like you, and we can break down those barriers.'",
        "'speaker_6': 'But when it comes from our president, it is a moment that is so disheartening and just rocks you to your core. But it stays like this that you get to remember that that that person still might be part of the community that we still have to organize around, and that by being a city, we have local power'",
        "'speaker_6': 'to do that. And so I'm really humbled to be on this item. And again, I just want to celebrate our community and thank you guys for being courageous and brave and and not backing down from being who you are.'",
        "'speaker_6': 'I'm really proud of everybody. So thank you again. Councilmember Gonzalez.'",
        "'speaker_0': 'Thank you, Councilmember Pearce. Councilwoman Price.'",
        "'speaker_1': 'I want to thank my colleagues for bringing this item forward.'",
        "'speaker_2': 'I think it's a great item and I'm happy to support it.'",
        "'speaker_0': 'Thank you, Councilmember Arango.'",
        "'speaker_8': 'Thank you, marin. And I also want to thank Councilmember Gonzales for bringing this forward and for inviting me to participate in this. I know that when we exclude anyone, we exclude everybody.'",
        "'speaker_3': 'So let's be inclusionary. And I'm very proud that I'm.'",
        "'speaker_8': 'A member of the city council in Long Beach that is pushing this forward. Thank you. Okay.'",
        "'speaker_0': 'Thank you very much. There's a motion in a any public comment on the item? Please come forward and just come to the podium, please.'",
        "'speaker_5': 'Hi again. My name is Joel Jimeno, and I'm here on behalf again of the LGBTQ center of Long Beach. And we are here to express our support for this letter of opposition, the efforts of the current fit federal administration to exclude transgender people as it considers a redefinition of sex under Title nine is an offensive push that'",
        "'speaker_5': 'works to a minimum to minimize acts of hate against trans people. Should this effort move forward, it would place unnecessary barriers on trans individuals to live freely and would legally allow for discrimination. This is the latest in a string of attacks, as Councilwoman Gonzales was saying, against LGBTQ people.'",
        "'speaker_5': 'And what we know is it would actually work to increase social inequalities and disparities for our trans community members who already have disproportionate rates of these inequalities. And this is an effort that we as a community must visibly stand against.'",
        "'speaker_5': 'Your approval of last week's name and pronoun policy reiterates how Long Beach sees here and acceptance community members for who they are. This is a value that we hold in high regard, and as such we must stand firm and be vocal against any attempt to undermine this value.'",
        "'speaker_5': 'Last week I was at an event for the Center and the National Center for Transgender Equality, and I was fortunate enough to talk to a young person who had just graduated and said they were working in Wyoming with LGBTQ youth.'",
        "'speaker_5': 'And they said, I'm so happy to speak to you all, because our because the youth in Wyoming, you know, that they look at your Instagram page for the youth and Long Beach and they look at it as a possibility model.'",
        "'speaker_5': 'And I was so happy to hear this because it affirms something that I had thought for a long time. Long Beach isn't just is not invisible when it comes to these things, to this conversation. And it's not just a part of this conversation.'",
        "'speaker_5': 'In fact, it's a leader in this conversation. And so we urge you to approve this this item. Absolutely. Because as a leader, we need to stand strong, visible, and we have a responsibility to speak up. And of course, like always, the center offers its assistance and any items that you may need help with.'",
        "'speaker_5': 'So thank you very much. I appreciate your time.'",
        "'speaker_0': 'Thank you very much. Next speaker, please. Is there any other speakers? I'm closing the speaker. Mister, could you please get in line, please, sir? Sure could here. I think. I thought you were next, so. Okay, then. There you'll be the last speaker.'",
        "'speaker_0': 'Go ahead, sir. Bill size of Council District three of Mayor Garcia. Council members. I am encouraging you to accept this policy, but I have a little issue with the language as noted on item 14, which is in consultation with the LGBTQ center, Long Beach.'",
        "'speaker_0': 'I would like to make sure that the City Council does not use the consultation of LGBTQ center Long Beach exclusively. There are other agents that I work with directly in New York and Washington, D.C. that are do this every day.'",
        "'speaker_0': 'They establish policy on a national.'",
        "'speaker_6': 'Level.'",
        "'speaker_0': 'For federal guidelines. So I'd like to provide my resources directly to Councilmember Elian Gonzalez. Janine Pierce, Robert Ringo Richardson. We have policies in place. And if you listen to what Joel said, he's focusing on transgender youth. He's not even addressing transgender adults or transgender seniors last year or the LGBTQ center here in Long Beach didn't even attend'",
        "'speaker_0': 'any of the trans giving dinners or friendsgiving dinners here in our county. So they're not in our city, so they're not even reaching out to our total transgender community. So I don't feel that they're completely prepared to address this as an organization.'",
        "'speaker_0': 'When I have resources for you that I can provide, that are doing this, are reaching out, are finding that there are there are two organizations in L.A. County that are doing this already. So I'm more than willing to provide you the names, phone numbers and their policies on what they're doing for the entire LGBTQ community, which includes'",
        "'speaker_0': 'transgenders of all ages. Thank you. Thank you, sir. And Mr. Good here. And then the speaker list is closed.'",
        "'speaker_8': 'Very good you, Clark, because of the address. This is a slippery slope. What say you to the individuals that want to marry somebody under age? And have two or three. We heard from the people last week and tonight who are championing this.'",
        "'speaker_8': 'They also championed Snoop Dogg. All right. With those views that he has relative to women. The councilperson from the second district. Doesn't even isn't even smart enough to know you can't fish off the company pier. So are you now going to allow.'",
        "'speaker_8': 'People in the city to fish off a company pier. It's a dangerous slope, but it's. There are. No limit to the number of cases. That come on the front pages of the news where you've got people that have ten.'",
        "'speaker_8': 'Eight, ten, 12. Marriages. American kids. They are under age. Five, six, seven, eight of the. There are three stories in that. There's a line to draw, and I think you've crossed that line. Notwithstanding the intense, the good intentions, some people.'",
        "'speaker_8': 'But you really haven't thought it completely through. What say you to the person that wants to marry his dog? Or as Kat. Because that's part of their family.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_8': 'That's a slippery slope from which there's no return.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_1': 'I'm going to leave with a positive note. Happy and International Trans Gender Remembrance Day. I hope all of you can join us tonight, and I thank you so very much for being here. Let's give them another big round of applause for all of their hard work.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you very much. And thank you all for being here as well. And it's always it's always good also to be remembered, to remember that not everyone in our community is supportive, is kind, is compassionate, and is willing to uplift and support people.'",
        "'speaker_0': 'And so more than ever, it's important for our community and for the LGBTQ community to to be strong and to continue the good fight. So thank you for being here today. And with that, we have a motion in a second, so please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Renaming Convention Center Exhibit Hall as Ernie Kell Hall.": [
        "'speaker_0': 'Thank you very much. And thank you for being here. Well, going on to item 20, please.'",
        "'speaker_1': 'Item 20 is communication from Vice Mayor Andrews, chair of the Housing and Neighborhoods Committee. Recommendation to approve renaming the Convention Center Exhibit Hall as the Ernie Kennel Hall.'",
        "'speaker_0': 'Thank you. There's a motion and a second vice mayor interest.'",
        "'speaker_4': 'Okay. Thank you very much. Because this is being the chair of this housing and neighborhood committee, I do put this in recommendation to approve the renaming of the Convention Center and exhibition hall as the only called the Long Beach Convention Entertainment Center.'",
        "'speaker_4': 'And now I'd like to would like to turn it over to Councilwoman Mongo, and then she will go to comments.'",
        "'speaker_6': 'Thank you. I'm pleased that we have the opportunity to recognize Ernie Kell, our first elected mayor of Long Beach. Many of you know that over a year ago, when Ernie passed, there were a group of residents who approached me about naming something after him and made some recommendations on some items.'",
        "'speaker_6': 'I've really appreciated the process and the community input. I really appreciate and commend the neighborhood committee. It's been vetted through the committee and it has been in alignment with the city process and policies of a year since the passing, which has allowed us to take the feedback of the residents who care very deeply about our city assets'",
        "'speaker_6': '. I want to express my thanks to Mayor Garcia and the Convention Center and all those who helped make this happen. Ernie Kell played a key role in envisioning the improvements and expansion that turned into the convention center and into an incredible hub for our community and a real center for tourism.'",
        "'speaker_6': 'So I think it's appropriate that this is the space that was finally agreed upon for which he will be honored and remember. And for that, I would like to state my full support for this item. And I really appreciate everyone who weighed in on all sides of the matter.'",
        "'speaker_6': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Councilwoman, I want to make a few remarks. Let me just begin by thanking the members of the committee. That, of course, was Vice Mayor Andrews, as well as Councilmember Lawson and Councilmember Darryl Supernatant, who all moved the item forward.'",
        "'speaker_0': 'And I also want to thank both council woman Stacey Mungo, who has been working on this for for the last year, but also Councilmember Janine Pearce. The convention center, while a citywide asset, clearly is also in the second district.'",
        "'speaker_0': 'And I know that her and I had some conversations and I want to thank her for for supporting this as well. Ernie Kell was our city's first citywide mayor and made history when he was elected in that position.'",
        "'speaker_0': 'He has known as someone that was dedicated across the city. But his roots, of course, as we know, were in the fifth District and in Long Beach, East Side. He also is well known for spending a lot of his time out in his field office and going door to door and talking to neighbors across the fifth District'",
        "'speaker_0': ', but also across the city. As mayor, he was known for being a kind person, a good leader and a good legislator. Of course, Mayor Kell also served on the city council before his time as mayor. Mayors, America's election was clearly a big step in the city's journey towards progress and a huge change in the way the city'",
        "'speaker_0': 'ran. Prior to that, as we're aware, the council was very different and Mayor Cal transitioned the council into a citywide and perspective and also a really took the city forward in many, many ways. He was a successful businessman who also served the city well.'",
        "'speaker_0': 'And of course, we know that his wife, Jackie, Jackie Kelly, also served the city of Palm Beach as a councilmember and in the fifth District. Besides being being known for being very focused on infrastructure and fixing potholes on a daily basis.'",
        "'speaker_0': 'He also had a love of flying, which is well documented and was instrumental in the creation and construction of the Long Beach Convention Center and Entertainment Center. It was during Ernie's time, first on the council, but then that and then as mayor that he led efforts not always supported by all across the city to construct what we'",
        "'speaker_0': 'know today as the modern Long Beach Convention and entertainment center of the building and all of its construction and plans were were constructed and created during his time. And the building opened just a few short months after he left office.'",
        "'speaker_0': 'And he was very proud to be able to go back and see all the work that he and the council, as well as the staff and the community put in building what is today a very successful convention center.'",
        "'speaker_0': 'I would also say that this naming of of Ernie Keel Hall, which essentially is the large exhibition hall that you see on Pine Avenue, is a is a substantial and important building in our city. And it really, I think, serves to remember someone that left that left us with a lasting legacy of service, but also left us'",
        "'speaker_0': 'with a strong tourism economy. This naming is supported by Jackie Kell and the Kell family, but it's also supported, I think, very importantly, by the Long Beach Convention and Visitors Bureau. They submitted a letter of strong support to rename the hall after Mayor Kell, and they are also very excited that it's a way to bring his legacy'",
        "'speaker_0': 'and his work in building that hall and that center back to where we are today. And so with that, I want to thank all the council members that have been involved in this. I want to thank the Kell family, especially Jackie, for for working with us.'",
        "'speaker_0': 'Sometimes this process takes longer than we would like, but it's important. And and we honor Ernie's memory tonight and every day. And so with that, if there any public comment. So could you.'",
        "'speaker_8': 'I fully support this concept. Ernie Cal was the quintessential type of mayor this city should always have. Unfortunately, that's not the case. He was never involved in any criminal complicity. He was never in queue to be arrested, tried and sent to prison as our current mayor is.'",
        "'speaker_8': 'He was absolutely fantastic. And this should always. You can't say enough about. Ernie Kell. He embodies. What every single elected official should be like and how they should conduct itself. Personally and in terms of civic affairs and so forth.'",
        "'speaker_8': 'And it it'll be a pleasure to see his name on that and a constant reminder. Unfortunately, of how far we have slipped. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Members, please go ahead and cast your vote.'"
    ],
    "Renaming of the Long Beach Fire Department Regional Training Center.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. We have item 21, which is another naming vice mayor.'",
        "'speaker_1': 'Item 21 is communication from Vice Mayor Andrews, Chair of the Housing and Neighborhoods Committee recommendation to approve renaming the Long Beach Fire Department Regional Training Center. The Captain. David Rosa. Regional Training Center.'",
        "'speaker_0': 'Vice Mayor Andrew.'",
        "'speaker_4': 'Excuse me. Also, this is the same recommendation. You know, which was just read, you know, for Captain Rosa. And I'm very happy that this will go to the committee. And I'm looking forward to the ribbon cutting ceremony and much love for Station ten.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you very much. There's a motion and a second councilmember. Austin.'",
        "'speaker_3': 'Thank you. Happy to motion. Happy to be on the Housing and Neighborhoods Committee that unanimously recommends this this item to to the Council for your full support. Obviously, Captain Rosa gave a lot and contributed a lot and paid the ultimate price for his public service to the city.'",
        "'speaker_3': 'And so I think it's only fitting that that we recognize him on at the fire training station for his contributions as a as a training firefighter as well. He did so much for for and trained so many of the existing department at the Fire Academy and so look forward to supporting this figure.'",
        "'speaker_0': 'Councilman, Councilmember Superdog.'",
        "'speaker_4': 'Thank you. Would like to echo the sentiments of Councilman Austin as a member of the committee, and we are very proud and honored to have this recognition at the training center in the fourth Council District. Thank you.'",
        "'speaker_0': 'Thank you very much. Any public comment on this scene? And please cast your votes. Motion carries a motion for the consent calendar, please. So much. Any public comment for the consent calendar? Say Nonmembers, please go and cast your votes.'"
    ],
    "Resolution and Lease for Winter Shelter Operation at 5571 Orange Avenue.": [
        "'speaker_0': 'Okay. Thank you. Moving on now to where we're going to be doing. Uh, of course, there was a request to hear 16. Right. Is that right? 16. Mm hmm. And of course.'",
        "'speaker_1': 'Item 16 is a report from Health and Human Services and Economic Development. Recommendation to adopt resolution read declaring a shelter crisis and authorize the operations of a winter shelter for a period of December 1st, 2018 through March 31st, 2019, and authorize City Manager to execute a lease with the United States Veterans Initiative, District eight.'",
        "'speaker_0': 'Thank you, Councilmember.'",
        "'speaker_3': 'Yes. I'd like to get a staff report, please.'",
        "'speaker_0': 'Thank you, Mayor. Councilmembers. I'm going to introduce Theresa Chandler, the bureau manager for Health and Human Services or Homeless Services Program.'",
        "'speaker_8': 'Teresa.'",
        "'speaker_2': 'Good evening, honorable mayor, vice mayor and council members. We are happy to support the winter shelter again for the service planning area eight.'",
        "'speaker_6': 'In Long Beach here.'",
        "'speaker_2': 'And our provider uSwitch is also here today. We have been a provider for several years.'",
        "'speaker_6': 'The city of Long Beach has hosted.'",
        "'speaker_2': 'The winter shelter. It's actually a program of last year, which is the combination of homeless services with the city and county of Los Angeles and the contract to provider us UCITS. For these years we have always supported the.'",
        "'speaker_6': 'The excuse me.'",
        "'speaker_2': 'Getting a building, getting a building and making sure that services are provided outside of the winter shelter. The Multi-Service Center has been a pick up.'",
        "'speaker_6': 'Location, along with a location in San Pedro, and we help orchestrate that.'",
        "'speaker_2': 'This year, the winter shelter will be at the old.'",
        "'speaker_6': 'Library.'",
        "'speaker_2': 'In the eighth District as it was last year, and this building is currently in the process of being sold. So this will be the.'",
        "'speaker_6': 'Last year that the winner shelter will take place at this location.'",
        "'speaker_0': 'Thank you very much. Contrasted.'",
        "'speaker_3': 'Thank you very much. And I'd like to just encourage our unanimous support for this item. Obviously, we are facing the winter months where the weather gets a lot colder. And this is an opportunity for us to provide shelter for for those who are living on the street, but also with that shelter providing access to opportunities and services'",
        "'speaker_3': 'that are that that our health department and U.S. vets can provide to hopefully get them off the streets and get them into services and the help they need. This is a multi-pronged approach supported by the County of Los Angeles, Lahsa, our our our health department, as well as our partner U.S. vets.'",
        "'speaker_3': 'And I can't say enough about the great work the U.S. vets did last year as the provider for the service in partnership with our city. It was amazing to watch them in action. The the the winter shelter, I think, was went without incident.'",
        "'speaker_3': 'Most of the residents who I had an opportunity to talk to, many were uneasy and unsettled by having the winter shelter in the neighborhood. I have told me that, you know, they didn't even really notice that it was there.'",
        "'speaker_3': 'So, again, hats off to U.S. vets. I'm glad that they are returning as a partner to to run this this program again and again. Council, I would ask for your unanimous support of sign.'",
        "'speaker_0': 'Thank you, Councilmember Ringa. Public comment. You know, Councilman Gonzales, the Councilman Gonzales said.'",
        "'speaker_6': 'Thank you. Good evening, Mayor Garcia, and thank you also Councilman Austin and the Council of Long Beach. I just wanted to add that us vets and our staff is here. There are some of us that are members of the California National Guard.'",
        "'speaker_6': 'Our job is to protect and to serve. And the winter shelter gives us the opportunity to protect and to serve the citizens of Long Beach and also for us to find military persons. Last year we were able to serve 815 and duplicated persons, and out of that we found 82 veterans.'",
        "'speaker_6': 'The Winter Shelter is a program that's designed to keep people off the street and to save their lives in the most critical weather conditions, which is cold and it's only a four month program. And we are gladly to be there even though we we work at US vets during the day.'",
        "'speaker_6': 'This is at night and we do it at night and we do it to save lives. And we thank you for.'",
        "'speaker_2': 'Encouraging everyone that.'",
        "'speaker_6': 'The homeless population and the homeless condition is going to be solved with all of our help. So thank you for the opportunity.'",
        "'speaker_0': 'Thank you so much. Let me do let me do Mr. Good. Here, then I'll go to Councilman Gonzalez.'",
        "'speaker_8': 'Obviously we fully supported this. And I want to suggest something also that can be done and I referenced this before are there are some small pods and I gave the council a few weeks ago, I think, pictures of them and I'll bring them down again that have been developed.'",
        "'speaker_8': 'And my thinking is what we could do is not just for winter but on a permanent basis, have three or four of those pods down. Next on on boathouse lane next to where the new eight end is going to be and which will have a complete can be a complete restroom and so forth.'",
        "'speaker_8': 'Then I research it and I think it's completely in concert with the basics of the Monroe Doctrine, which is the overall governing paradigm for that, and it would be specifically for people that are now being treated. At on a continuing basis at the VA hospital.'",
        "'speaker_8': 'And I have reached the stage where there are just a night circuit 60 to 90 days away from being released out into the wild, if you will, into their own home. And it's an excellent location for that, because with the motorized scooters people have, they could scoot down to either one of the two bus stops and be'",
        "'speaker_8': 'up at the seventh and the VA hospital and so forth. So I think I support this in concept. And again, I'll get the pictures out of the the pod. I have never personally seen them. I've seen the pictures of them and so forth.'",
        "'speaker_8': 'But I think there is ideal for that location and anything to support the vets. Thank you.'",
        "'speaker_0': 'Thank you. That concludes with a comment. Councilman Gonzalez.'",
        "'speaker_1': 'Theresa, thank you for this staff report. Are the two pickup locations going to remain the same? I don't know if I miss that. San Pedro and the Multi-Service Center, for the most part, yeah.'",
        "'speaker_2': 'For the most part, San Pedro, definitely. And the Multi-Service Center definitely in there could potentially be a third pickup site, but it has not been located yet and we'll be discussing that further.'",
        "'speaker_1': 'Okay, great. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Yes. And I would like to just take this opportunity before we vote in advance. Thank the Council for your support of this item, but also invite my colleagues to come and check out the winter shelter. I think if you haven't been to one or anybody in the community for that fact that wants to volunteer and help and'",
        "'speaker_3': 'do some benevolent good, good goodwill in the community, I think it will go a long way to dispel myths about who we're serving and the services that are actually being provided. Because I say once you go there and see it, you'll find it.'",
        "'speaker_3': 'There's powerful work actually happening. So thank you. And I would be happy to come along with you if you want to want to do that. Get you through the eight district personal tour.'",
        "'speaker_0': 'Thank you. And before we vote, I wanted to just say just one thing. I think I shared this with the staff, but that this doesn't happen often. I was I was at a restaurant here in Long Beach, and a very lovely couple came up to me and they said, hey, we know we've never met.'",
        "'speaker_0': 'We live in the eighth District and we're the two that were the loudest in opposition to this winter shelter the last time it was in front of the council. You may remember us, and I did remember them because they were pretty vocal and upset and they said, you know, we live a couple of houses down.'",
        "'speaker_0': 'And I just want to tell you that we were absolutely wrong and we're sorry that we came in opposition. It was we didn't even know the winter shelter was there. And we lived just a couple of houses down from the site.'",
        "'speaker_0': 'They complimented Councilman Austin and his office and they complimented the staff. And they they just said that it was just it was amazing and that they would be supportive of continuing. And so I just want to thank them for comfort, for stopping me and in saying those kind of words and thankful to the staff for their work'",
        "'speaker_0': '. So with that members, please cast your votes.'"
    ],
    "Resolution to Amend the Master Fee and Charges Schedule for Entitlement Fees and Mailed Notices. (Citywide)": [
        "'speaker_0': 'Thank you very much. That concludes public comment. We're going on to Iowa. We have the hearing and the Long Beach Airport noise ordinance next to items. So, Madam Clerk, the hearing, please.'",
        "'speaker_1': 'Hearing item one is a report from Development Services recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt resolution. Amending the master fee and charges schedule citywide.'",
        "'speaker_0': 'Mr. West, who's who's doing this?'",
        "'speaker_8': 'Thank you, Mr. Mayor. Staff report will be given by Linda Tatum.'",
        "'speaker_2': 'Good afternoon, Mayor, and members of the Council. This item is a public hearing to consider a resolution to modify the city's master fee schedule for development services by reducing selected entitlement fees and adopting new fees related to the mailing of public hearing notices.'",
        "'speaker_2': 'As you recall, on September 18th, 2018, the City Council adopted an ordinance that amended various sections of the zoning code related to conditional use permits, and it also. This action that the Council took at that time also updated the public notification requirements.'",
        "'speaker_2': 'Since then, our staff has evaluated the specific entitlement application fees, which currently include the cost for mailed public hearing notices. So of what we found from that analysis is that approximately $950 of the current application fees go toward the costs of producing and mailing these public notices.'",
        "'speaker_2': 'So adoption of this resolution would effectively unbundle the noticing fees from the application fee for most of the entitlement applications that we process. This resolution would also establish a tiered fee structure for mailing public notices going forward. The proposed fee reduction is $950 less than the current application fees and the new publication or the new public noticing'",
        "'speaker_2': 'fees range from $410 for the standard 300 foot noticing radius for Tier one. And this is explained in a little bit more detail in your staff report. But there's also a Tier two noticing four or 500 foot radius, and that is whenever a project is within 300 feet of a residential development and it goes up to Tier'",
        "'speaker_2': 'three, which is $950 for noticing whenever a project is 750 feet or greater from any application that addresses either a reduction of parking, shared parking or a project where there is a code requirement for some kind of distance buffering, like in a tattoo parlor as an example.'",
        "'speaker_2': 'So I just want to make sure that you're aware that this particular action will address mail notices, but it does not change any of the other standard notices that staff provides, and these include posting the notices in City Hall.'",
        "'speaker_2': 'We also post individual development sites with those large noticing posters. We also notice post notice on the city's website. We also notify city council offices as well as neighborhood organizations for all of the required public noticing for discretionary approvals.'",
        "'speaker_2': 'So I just wanted to make sure that you were aware of that. And we feel that the proposed resolution tonight balances the direction of the council to reduce the costs of the conditional use permit process. But we think that it also provides ample notification to the to the public for discretionary actions.'",
        "'speaker_2': 'So staff recommends that the city council adopt the proposed resolution to reduce the application fees and also to establish the new tiered fee schedule for public noticing. That concludes the presentation. But I'm here as well as Lisa Falls, our Administrative Services Bureau manager, who assisted on this project.'",
        "'speaker_2': 'And we can respond to any questions you have.'",
        "'speaker_0': 'Thank you. I got a motion in a second. Let me just do is there any public comment first seen a public comment? Councilor Pearce.'",
        "'speaker_6': 'I just want to say great job staff are really tackling how to reduce those costs in a creative way. Thank you for your hard work.'",
        "'speaker_0': 'So Mango.'",
        "'speaker_6': 'I completely concur. Well-written agenda item. I appreciate the work that was done and I think this is a good solution. Thank you.'",
        "'speaker_0': 'Thank you, members. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Resolution Amendment on Flight Slot Utilization and Noise Compatibility at Long Beach Airport.": [
        "'speaker_0': 'Great. Thank you very much. Next up is item 17.'",
        "'speaker_1': 'Item 17 is a report from Long Beach Airport. Recommendation to adopt resolution amending resolution number C, dash 28465 with respect to the utilizations of flight slots allocated at the Long Beach airport citywide.'",
        "'speaker_0': 'Thank you. I'm going to turn this over to Mr. West. Mr. Mayor, council members, this is an item that we've been debating for quite some time regarding how our slots allocations are flown at the Long Beach airport, especially with all of the new additions and improvements that we've made there.'",
        "'speaker_0': 'So with that, I'm going to turn it over to our executive director of the airport, Jess Romo, who will walk us through the proposed resolution Jess. Thank you, Mr. West, honorable mayor, vice mayor and members of Council. As Mr. was said, this has been a long and thoughtful process.'",
        "'speaker_0': 'And so tonight here, this culminates with a request for the city council to consider and look at proposed flight allocation resolution amendments. I'm sure you all had an opportunity to take a look at the very lengthy staff report.'",
        "'speaker_0': 'We want to make sure that all issues were covered. But this slide deck here really synthesizes it and summarizes it so that we could go through and look at the highlights of this project, as well as entertain any questions that you may have.'",
        "'speaker_0': 'So just to to cue this up, this slide deck here really is going to cover historical and legal context associated with the noise ordinance and flight allocation resolution. It will also speak to the current flight allocation resolution that's in place, as well as a summary of the proposed amendments.'",
        "'speaker_0': 'We also include data regarding average daily flight utilization on a monthly basis so that you can get a snapshot of what we've seen take place since January 1st of this year, including some projections that will take us into spring of next year.'",
        "'speaker_0': 'And then finally, we're going to cover the rationale that really is behind the proposed amendments to the resolution. So with that, in as most people who've been within the city for any length of time, you'll realize that this has been a very long process and very storied.'",
        "'speaker_0': 'Ordinance and allocation resolution there really they both support each other going back to 1981, which is when the first noise ordinance was enacted. And over a period of 14 years, there were steps along the way that included litigation, legal challenges, federal district court decisions, and finally culminating with a final judgment that allowed the city to adopt its'",
        "'speaker_0': 'current noise ordinance and companion flight plan allocation resolution. We want to make sure that members of the public, as well as the council and mayor are aware that, you know, there are two components to or noise restrictions here within the city.'",
        "'speaker_0': 'There is the noise ordinance and its implementing resolution. So as it's shows on the slide deck here, both documents balance the community needs for, you know, reasonable air service at the airport, along with environmental interest of the communities that are located within the city, within the vicinity of the airport.'",
        "'speaker_0': 'And secondly, what we're here for tonight is to look at the flight allocation resolution, and that really is what provides what we call the implementing flight allocation regulations that are consistent with the noise ordinance provisions. And just a little bit of background.'",
        "'speaker_0': 'You know, Long Beach Airport, along with a very small handful of airports in the nation in a fit of fairly strict noise regulations. And that's that's in part in large part because these regulations were initiated or put in place before the federal legislation, which has referred to the Airport Noise and Capacity Act or in shorthand referred to'",
        "'speaker_0': 'as anchor, which really now restricts airports from being able to set limits on certain limits at airports, especially those that would otherwise interfere with aircraft operations or those that would affect aircraft safety. So short of that, airports are allowed to do that, but it is a very difficult road to go down and to be successful at.'",
        "'speaker_0': 'So in that regard, Long Beach has the benefit of a noise ordinance and set of regulations that allow us to to manage that that balance of aircrafts or airline service and aircraft activity against the environmental needs of the community.'",
        "'speaker_0': 'These amendments, any amendments that we would make either to the noise ordinance or the allocation resolution, they have to be consistent with the City of Long Beach's sponsor, assurances that we have in other covenants that obligations that we have with the FAA.'",
        "'speaker_0': 'And finally, these amendments, they cannot or any application for federal grant funding, which is very critical for the airport in terms of keeping the airport operational areas safe and operational, or our ability to impose federal passenger facility charges or Pepsis, which is another funding mechanism that most airports rely on.'",
        "'speaker_0': 'The noise ordinance. As I said earlier, it is so, you know, we're one of the very few airports that enjoys this protection in it is unique as most of the noise restrictions that airports do have that are pre anchor.'",
        "'speaker_0': 'And because of that it's it's got to be protected. So staff has always been mindful and will continue to be mindful that it's a balance. But protecting the ordinance is one of our paramount duties. So we have or the noise compatibility ordinance, which is under, you know, the Chapter 16.43 and that is not being amended.'",
        "'speaker_0': 'So I wanted to make sure that was real clear. So people in the community had concerns about not touching the ordinance. So this action tonight does nothing with the noise ordinance itself. We know that the ordinance has been hard fought.'",
        "'speaker_0': 'It is one of the strictest in the nation. And again, instead, what we are looking at is amendments to the resolution, which is an enabling document that helps us protect and really show how we will enable airlines to maximize the capacity that does exist at the airport.'",
        "'speaker_0': 'So in particular, the flight allocation procedure procedure resolution, which is in place right now, was adopted back in 2004. It is worth noting that this is not the first or the second or third amendment of the allocation resolution.'",
        "'speaker_0': 'It's actually been amended six times to date, although the most recent one was in 2004. And again, it really supplements and buttresses the noise ordinance that your get provides that implementing allocation procedures that are in line and consistent with the noise ordinance.'",
        "'speaker_0': 'The resolution in particular addresses allocation, preference by air carriers, flight slot allocation process, the steps that are needed anytime an aircraft or an airline wants to secure flight slots. The minimum use requirements, which would be a key part of what we'll discuss here tonight, as well as a process to have the airport reserve and reallocate unused portions'",
        "'speaker_0': 'of flight slots. So a very high level summary of the amendments that are before you tonight is that what we're looking at is to have increased slot utilization of the slots that are awarded to the various air carriers.'",
        "'speaker_0': 'We'll get into the specifics of where they are today and where we would like to take them. It also revises certain definitions of flight slots and ferry operations is actually to help provide flexibility to the carriers and ferry operations, for example, or any time an aircraft needs to be repositioned.'",
        "'speaker_0': 'It's not a revenue flight, doesn't have passengers. It could be an equipment issue. But we want to make sure that that is clarified so that it gives more flexibility to the carriers, as well as a number of administrative amendments.'",
        "'speaker_0': 'And that is in part to help modernize the document itself as things have changed and references, you know, that that didn't exist back in the last time this was amended back in 2004. So this is a side by side.'",
        "'speaker_0': 'And we actually used this table when we held the community meetings earlier this year. So if you look on the left, this really speaks to the current minimum slot use requirements that are in place now under this resolution.'",
        "'speaker_0': 'And in short, really what it requires is for each slot that an airline has that they have to fly a minimum of four times per week, over a 180 day period. That equates to about 57% minimum utilization. So as long as they fly it on average over 180 days, you know, four times a week or 57%, they'",
        "'speaker_0': 'get to keep that slot on. The converse of that is that, you know, 43% could go unused if they choose not to fly that. There is another way that we look at that on a monthly basis or on a by monthly basis where they have to fly 30 flights in a 60 day period, which is 50% of'",
        "'speaker_0': 'that of that slot that's allocated on the right. We're looking at what we are proposing and what we're looking at is a stepped up requirement that really reflects a balance of working with carriers, understanding that schedules do change.'",
        "'speaker_0': 'But with that backstop of if you're going to have a slot, you should use it much more efficiently. So if you see they're on a monthly basis, what we're proposing to require is a 60% utilization, which is about 4 to 4 days out of the week.'",
        "'speaker_0': 'And on a quarterly basis, 70%, which is about five days out of the week. And then on an annual basis, 85%, which is about six days out of the week in order to maintain that slot. And this is the graph that I alluded to in the introduction.'",
        "'speaker_0': 'And really this is to help give everyone a picture of starting in January of this year. And obviously, we have data through October. And I'll just walk you through it real briefly that those months and those bars represent utilization.'",
        "'speaker_0': 'And if you look down below, really the blue represents the flights I'm sorry, the flight slots that were flown during that period of time. And you can see that for the first eight months, January through August, every every slot for the most part was flown very you see, very little in and probably no yellow.'",
        "'speaker_0': 'The as you move further on, we've got two months now that we've been able to see that since since September through and into October there has been a reduction in the use of the of the actual slots that are awarded either permanent or supplemental so that that green space.'",
        "'speaker_0': 'So the green and the yellow space represent that capacity that is available and the green of that represents what was actually flown. So the yellow across the board represents the UN flown capacity that's available but not being used by any carrier.'",
        "'speaker_0': 'Now of course, we are projecting and forecasting, you know, going forward, which is all we can do based on schedules that have been loaded. But if unless things change, this is what we're looking at in terms of a flight profile through March of next year.'",
        "'speaker_0': 'And again, if we don't change the allocation resolution, there would be no incentive for carriers to change behavior. So the main rationale behind proposing amendments are that it ensures that air carriers are adequately utilizing their flight slots. It also reduces the potential for anti-competitive conduct by certain air carriers.'",
        "'speaker_0': 'It promotes an airport operation on a fair and reasonable terms and without unjust discrimination, which is in accordance with FAA regulations. It also reinforces the proposition that our flight slots, they are not property rights or property interest of the carriers, but they in fact belong to the city to be allocated based on a reasonable use by the'",
        "'speaker_0': 'air carriers. The adoption of administrative penalty provisions, including the reduction of flight slots where there is underutilization under utilization, that is parcel part of the proposed amendments. Before you tonight. Again. The action tonight does not change the ordinance at all.'",
        "'speaker_0': 'The noise ordinance is not before you for any type of amendment at this point. It also does not change the structure for administrative violations that occur during the non permitted hours, which means that the fines structure for violations does not change because that's part of the noise ordinance, nor do the the daughters, the fine structure for consent'",
        "'speaker_0': 'decree violations that occur after 11 p.m. and before 7 a.m. again. Those are all those are part of a separate agreements with the city prosecutor. That's not up for discussion tonight, nor are we considering the number of permitted slots it is.'",
        "'speaker_0': 'There are 41 permitted slots that are permitted currently. And, you know, obviously right now we've got nine supplemental slots. That's not under consideration tonight. And then lastly, this does not in any way affect the flight profile of Long Beach Airport.'",
        "'speaker_0': 'Basically, the air carriers, so all the carrier, all the routes are and would remain domestic routes into and out of Long Beach. And as a reminder, we were very careful and thoughtful to make sure that we did a lot of outreach.'",
        "'speaker_0': 'So our outreach really in three tranches, you know, included outreach to the air carriers and the FAA. You know, you'll see the dates on there. We did it twice in 2017. We've done it three times in 2018. We had two community meetings earlier this year, back in January and February, where we presented this information and accepted comments'",
        "'speaker_0': 'by attendees as well as any written comments that the public wanted to submit at any time this this calendar year. And then, of course, the stakeholder responses really were based on the what the carriers, for the most part, and really the carrier responses were limited to Southwest and JetBlue.'",
        "'speaker_0': 'And those are part of your package. So tonight we are recommending that you consider adopting the resolution, the resolution of 28465, that would increase minimum flight slot utilization requirements and other administrative amendments. And with that, we're here to answer any questions you may have.'",
        "'speaker_0': 'Thank you, Mr. Romo. Very thorough presentation. I know a lot of work went into this. I appreciate that. Before I get to the council and Councilwoman Mongo, any public comment on this? Seeing no public comment or close public comment?'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_6': 'I think and appreciate our airport staff. I think that you guys did an excellent job at the community meetings, and I think that that is why the community has been so supportive of this. I think that you guys have been great and I think you did all your research.'",
        "'speaker_6': 'And for that reason, I'm supportive. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'I, too, am supportive. Also want to thank our airport director and staff at the airport. They have gone through a very process oriented, detailed, methodical process to get get us to this point. The community outreach efforts, the updates to the Airport Advisory Commission and frequent briefings with the council, I think has been very, very helpful.'",
        "'speaker_3': 'I don't have really any questions about this. I think this is a a no brainer. I see this as a clean up effort and right sizing of our slot allocation resolution in an effort to maximize efficient use of flight start slots at Long Beach Airport.'",
        "'speaker_3': 'And it's also consistent hearing from our airport director that this resolution has been amended six times in the last couple decades. And it makes a lot of sense to us, for us to to look at how this flight allocation process benefits the airport and puts the airport in in the in the driver's seat.'",
        "'speaker_3': 'And so I am completely supportive of this this item, and I'm glad to see it before us. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_6': 'Yes. I also wanted to thank staff. I think when I first got on council, I didn't know that we would get to this place. And so I'm really proud of staff the direction and the council members who the airport directly impacts.'",
        "'speaker_6': 'I often think of the airport as an asset for my district because we have tourism in my district. But knowing that that we've come this far, I think not having public comment is one of the few times I will say it shows how far we've come.'",
        "'speaker_6': 'This is the least amount of people I've seen in this room whenever we've talked about the airport. So for that, I applaud staff for hard work and really taking your time to get it right. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Super now.'",
        "'speaker_4': 'Thank you. I'd also like to commend staff for those of those of us who work with this on a daily basis. It's pretty simple. But if you don't, it's very, very complicated. And I think you did a great job, especially the PowerPoint here today, to make a complex issue, very simple and understandable.'",
        "'speaker_4': 'So thank you again.'",
        "'speaker_0': 'Thank you, Councilmember Ringo.'",
        "'speaker_8': 'Thank you, Barry. And I won't add my voice to the congratulatory comments that we made to the staff. You came in within two.'",
        "'speaker_3': 'Years, have made a quick evaluation.'",
        "'speaker_8': 'And see that we can do a lot better with our.'",
        "'speaker_3': 'With our flights. And I'm very pleased that it's going to make our airport that much more efficient and helpful for the community. So thank you for the working to.'",
        "'speaker_8': 'Put into this.'",
        "'speaker_0': 'Thank you very much. Members, please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Great. Thank you and excellent job by the team at the airport as well. So thank you very much, the whole team. Moving on to item number 18.'"
    ],
    "Ordinance Drafting for Hotel Worker Safety Provisions.": [
        "'speaker_1': 'Okay. Cooked, melted now. Also the.'",
        "'speaker_0': 'Cape motion Kerry.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Item 19, please.'",
        "'speaker_1': 'Item 19. Communication from Council Member Appears Councilwoman Gonzalez. Councilwoman Praise Councilmember Oranga recommendation to require city attorney to drive an ordinance amending the Long Beach Municipal Code and adding hotel worker safety provisions to the existing ordinance.'",
        "'speaker_0': 'Councilman Pierce.'",
        "'speaker_6': 'Yes. I would like to thank the city attorney's office for assisting us with drafting this with a quick turnaround. I'd like to think, Councilwoman Price, for partnering with me to make sure that we have not only panic buttons for all hotel workers, but worker protections to ensure that these workers do not have retaliation.'",
        "'speaker_6': 'And so I'm very happy to be here at this moment today. It's been a long time coming, but I appreciate everybody's leadership on this council. Councilmember Rex Richardson, Roberto Urunga, Lena Gonzalez and Susie Price today. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Price.'",
        "'speaker_2': 'I support the amendments.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_1': 'It's me. I just want to say thank you as well to council members Pearce and Price for working on this and finally getting us to this point. So thank you again.'",
        "'speaker_0': 'Thank you. Councilmember Gringa.'",
        "'speaker_8': 'Want to add my voice to.'",
        "'speaker_3': 'Kudos for the council. Council persons council.'",
        "'speaker_0': 'Persons peers.'",
        "'speaker_8': 'Embraced that a in their work for working this out together.'",
        "'speaker_3': 'I think it's an excellent way of saying that, you know, we can work things out together.'",
        "'speaker_8': 'We have done a good job. Thank you.'",
        "'speaker_0': 'Thank you. That concludes council comment with the we did the we do public comment a public comment on this item saying nonmembers please cast your votes.'",
        "'speaker_1': 'Wishing Karis.'",
        "'speaker_0': 'Q I wish Thanksgiving was every week. Next item is second public comment. Any seeing none on that in any business? Vice Mayor Andrews.'"
    ]
}