{
    "Entertainment Permit with Dancing for Udom Restaurant.": [
        "'speaker_0': 'And then we're moving up two items, the recommendation for Housing and Neighborhoods Committee on on the mayor on the mayor foster item and then the community hospital item will both be moved up and then we'll go through the rest of the agenda.'",
        "'speaker_0': 'And so first, let's do hearing number one. And this is a pretty fast hearing. Yes.'",
        "'speaker_8': 'Thank you, Mayor. On behalf, I would like to say that I am fully supportive of this item. And I think that the applicants for this. But this continue to support the Anaheim corridor with this business. So please do not hesitate to reach out to my office if you need.'",
        "'speaker_0': 'A vice mayor. Let me let me first let me let me have the the clerk roll call. The item personally will do that.'",
        "'speaker_8': 'I should.'",
        "'speaker_7': 'Be ready to.'",
        "'speaker_1': 'Go. Report from Financial Management Recommendation to receive supporting documentation into the record, conclude the public hearing and grant an entertainment permit with conditions on the application of food restaurant. 1223 East Anaheim Street for Entertainment with Dancing District six.'",
        "'speaker_0': 'And let me ask, is there, Mr. Modica, you won't answer that.'",
        "'speaker_8': 'I believe an oath is required.'",
        "'speaker_1': 'There is an oath. So any who will be participating in this hearing, please stand and raise your right hand. Do you and each of you solemnly state that the testimony you may give in the course now pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God?'",
        "'speaker_0': 'Mr. Modica, we.'",
        "'speaker_8': 'Will have a very short staff report from Brant. Jax, our business services officer.'",
        "'speaker_10': 'Good evening, honorable mayor and members of the city council. Tonight you have before you an application for entertainment with dancing for of on limited liability company doing business as Udon Restaurant located at 1 to 2 three East Anaheim Street operating as a restaurant with alcohol in Council District six.'",
        "'speaker_10': 'All the necessary departments have reviewed the application and have provided their recommended conditions as contained in the hearing packet, as well as the police department stand ready to answer any questions council may have. And that concludes staff's report.'",
        "'speaker_0': 'Thank you. And then with that, let me go ahead and go first to public comments or any public comment on this item. The hearing see none. Vice Mayor Andrews.'",
        "'speaker_8': 'Thank you, Mayor. As I was saying on behalf, I would like to say that I fully support this item and I thank the applicants for this, continue to support the Annan corridor with this business. Please do not hesitate to reach out to my office if you need anything for food as delicious if you get a chance to'",
        "'speaker_8': 'go back there. So I wish it were. I wish you the best. Thank you very much.'",
        "'speaker_0': 'There is a motion and a second account of an Austin and he comments.'",
        "'speaker_7': 'I second.'",
        "'speaker_0': 'Okay and we are public comment members please go and cast your votes on the hearing.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Naming of the New Civic Chambers.": [
        "'speaker_0': 'Thank you. Let's do a quick motion on the consent calendar. I think public comment on consent saying please cast your votes. Motion carries a thank you. So we're moving up item 14, Madam Clerk.'",
        "'speaker_1': 'Communication from Councilmember Pierce, Councilwoman Gonzales, Councilwoman Price, Vice Mayor Andrew's recommendation to forward a request from community members to the Housing and Neighborhoods Committee and the Harbor Commission to consider naming the new chambers at the Civic Center, the Bob Foster Civic Chambers.'",
        "'speaker_0': 'Let me actually, I'm going to take Councilmember Pearce. I know that she's the author of the item and then I'll go to Vice Mayor Andrews. So let's.'",
        "'speaker_3': 'Thank you. I just wanted to take a moment to thank the community members that sent us a letter asking for this to be named the Bob Foster City Council Chambers. And so I know that Foster Mayor Foster was a great advocate for our P3, the public private partnership that allowed the beautiful new civic center to be built'",
        "'speaker_3': ', the library, and is really at the heart of revitalizing our downtown. And so I think it's appropriate to have this discussion and have this discussion at our Neighborhoods Committee. And I want to ask my colleagues to support this item.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'And I want to make sure the motion is on. Okay. Thank you. Thank you. Councilmember Pearce. Vice Mayor Andrews?'",
        "'speaker_8': 'Yes. Mayor, I would just like to say that I'm looking forward to hearing this item in committee. Thank you very much.'",
        "'speaker_0': 'Thank you. Vice Mayor Andrews, Councilmember Austin.'",
        "'speaker_7': 'Yes. I, too, would like to look forward to hearing this in committee. I believe I'm on that. Position of honored people. Whether our still alive to recognize some of their good works. And so as you mentioned Councilmember Pearce Mayor Foster was really the brainchild behind, you know, rebuilding our civic center and which will have a huge impact'",
        "'speaker_7': 'on on the downtown Long Beach and on our future. And so happy to move this to to committee and discuss.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_2': 'Thank you. I, too, am very happy to support this item. We've received a lot of calls in the third district office over the last week in support of this item. I know that Mayor Foster has always been a great mentor to me, always making himself available, but not intrusive and not critical.'",
        "'speaker_2': 'He's not the one one to give me at least unsolicited opinions, but he is there for me to run things by, and I think that has helped shape me quite a bit as I've assimilated into this position. So I'm happy to support this item and I and I do understand and appreciate the level of input that he's'",
        "'speaker_2': 'had into the public private partnership process. And now we are exploring on multiple projects throughout the city. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Richardson.'",
        "'speaker_9': 'As one of the chime in and express my support for this, I'll tell you, it's a beautiful civic center. I can't wait to move over. But, you know, I'm going to have some of nostalgia about this old building.'",
        "'speaker_9': 'You know, you know, one of my first jobs, you know, right here and I remember my first experience with Mayor Foster actually was at the chancellor's office. So I was I was AC President Cal State Dominguez Hills. He was student trustee.'",
        "'speaker_9': 'And, you know, I went, you know, me and a number of the student leaders went down to speak against tuition increases. And there was an exchange between me and and Bob Foster back then. And I have this press telegram article that I shared with him once where, you know, I'm reading them the riot act about the budget'",
        "'speaker_9': 'and, you know, how we shouldn't, you know, increase tuition and things like that. And he responded to me and, you know, and I think it was just interesting the fact that while I didn't get to serve with him on council, I was the chief of staff during the time when he was mayor, the chief of staff to'",
        "'speaker_9': 'Councilman Neal, and was able to sort of be a part of that last sort of piece of is his his legacy in public service. So I'm certainly happy to happy to support this and look forward to seeing what comes out of housing neighborhoods.'",
        "'speaker_9': 'Thanks a lot.'",
        "'speaker_0': 'Thank you. Councilmember Councilwoman Gonzales.'",
        "'speaker_2': 'Yes, I, too, just want to say that I'm glad we're moving forward with this. I know the same thing similar to Councilmember Richardson. I've served here for almost ten years now in the city and have worked not alongside him directly, but certainly behind the scenes, working for then Vice Mayor Robert Garcia and to be able to see'",
        "'speaker_2': 'Mayor Foster at the time, you know, basically, you know, just the back and forth dialog he would have with constituents and even being able personally to be able to sit down with him and have great discussions, even if we didn't agree all the time, I think it was always good to have that dialog.'",
        "'speaker_2': 'And so I really appreciate this item and I look forward to seeing this go through.'",
        "'speaker_0': 'Thank you. I want to just a couple comments and I know we're going to get a public comment. Let me just first say, I do want to point out and think I think the letter that we all received as the council was signed, I think by about 36, 36 individuals.'",
        "'speaker_0': 'And if you look at the list, which was impressive to me, it's obviously folks that know him at the state level like Willie Brown. And there's very few people that are more legendary in the state of California now than former Speaker Brown and former Mayor Brown, two members of the labor community certainly, and his work throughout the'",
        "'speaker_0': 'building trades. But then of course, most importantly, just a list of folks that have worked with him as well during his time as mayor here in the city of Long Beach, whether on the nonprofit side or on the business side or folks that work with him across the bargaining table that often sometimes even clashed with Mayor Foster'",
        "'speaker_0': ', depending on on the issue. And so I want to thank all those folks that sent this letter, which I thought was really spoke to the work that Mayor Foster has done, not just as mayor, but his contributions to the state of California.'",
        "'speaker_0': 'I just also want to say that there's no doubt in my mind, having served with him for one term on his last term, that we have a civic center project because of Mayor Foster. He is the one working with staff that directed and crafted what is now known as our public private partnership that built this building that'",
        "'speaker_0': 'we're going to be moving into, and really the complex that we'll be moving into. And it was his, I think, creative vision as well as pushing and working with staff that. And the council that helped develop what is now probably one of the most successful P3 developments and projects anywhere in the state of California.'",
        "'speaker_0': 'And so I think to consider and for the committee to consider naming these this chamber after the architect of of that work, I think is is really great to see and one that I really support. I will also add that one thing that was not really reflected in the letter, but I want to always uplift is Bob'",
        "'speaker_0': 'and Nancy Foster are also two of the most generous people that the city has when it comes to their personal success and what they have done and the ways that they have given both large and small, whether it's organizations like the Ron McDonald House or Cal State, Long Beach or the numerous philanthropic organizations that they give to'",
        "'speaker_0': 'is really significant. And I want to thank them for those contributions as well. You know, I'll say finally and I want to add to something that Councilman Richardson said is Mayor Foster served on the California state board of trustees, leading the world's largest public education, university of its kind anywhere in the world, which is the Cal State'",
        "'speaker_0': 'system. And during that time as a trustee, he was a strong supporter of expanding student access, improving student success and building what the modern California State University system of which we all have benefited from. And so I view this opportunity that the committee will have in these discussions, not just to honor his legacy in creating the P3'",
        "'speaker_0': ', but in his legacy in leaving a better statewide university system. And certainly his philanthropic works and the work he's done as at the time the CEO of also a significant organization, which was Southern California Edison and the work that he did there as well.'",
        "'speaker_0': 'And so I, I do strongly support the work that the committee will have ahead and and this recommendation. And so thank you for that. And I do want to call for a public comment on this item.'",
        "'speaker_10': 'Very good who lived in this city since 1976 or 77. I fully support this concept, notwithstanding the fact that he's saddled with a Peter principal city manager that we're now stuck with, but that his other accomplishments overshadow that.'",
        "'speaker_10': 'I fully support this. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hi. Her Linda Chico, representing L.A. County Supervisor Janice Hahn. She wanted me to read this letter and to record Dear Mayor Garcia an honorable city council. I am writing in support of naming the new Long Beach Civic Chambers after former Mayor Bob Foster.'",
        "'speaker_3': 'Bob and I have known each other for many years and he was even my boss at Southern California Edison. And I still feel like I need to answer to him. And to know Bob, is to know about his commitment to making Long Beach a great city.'",
        "'speaker_3': 'While he was mayor, Bob navigated the city through tough financial times and initiated creative solutions like public private partnerships to help continue the city's progress. The city of Long Beach has a thriving downtown, due in part to the commitment and innovation of Bob Foster.'",
        "'speaker_3': 'There is one thing we can all agree on. That is Bob Foster loves Long Beach. He has been a dedicated public servant, and I think it is only appropriate that we name the Civic Chambers after the man who helped the Civic Center get built.'",
        "'speaker_3': 'And on a personal note, I was a staff member on the 14th floor during Mayor Foster's tenure, and I remember those tough decisions, and I want to thank him personally for his leadership and his innovation, just as a Long Beach resident and a former staff member thinks.'",
        "'speaker_0': 'Thank you, Mr. Chico. Next speaker, please.'",
        "'speaker_3': 'Good evening. My name is Kelly Lucero and president of the Long Beach Symphony. And on behalf of the Symphony Board of Directors, I'm here to share with you that we enthusiastically support this recommendation. I am thrilled to share also that we are quite proud and very grateful that the city has a long standing tradition of mayors and'",
        "'speaker_3': 'city council members who support a thriving arts and cultural scene. Present company included and Mayor Foster is no exception. He is a great advocate for the nonprofit sector, as he mentioned, for the arts in general, and a wonderful advocate for the symphony and helped us during also during some challenging times, helped us navigate through them successfully.'",
        "'speaker_3': 'And on a personal note. My first month, he welcomed me with open arms and offered to help in any way possible and in it set a very positive tone with my first meeting with my first politician in this position.'",
        "'speaker_3': 'So thank you very much.'",
        "'speaker_0': 'Thank you very much. Speaker, please.'",
        "'speaker_10': 'Jim Foster, president of the Long Beach Boy. I think history judges an elected official, not just by what they do, but by the context of history or time in which they're doing it. And it can't be lost on us.'",
        "'speaker_10': 'And what Mayor Foster did.'",
        "'speaker_9': 'During probably the greatest economic crisis that any of us will ever realize in our lifetimes.'",
        "'speaker_10': 'He was a tough adversary in a tough time when tough decisions had to be made. And if there was ever a properly selected person by.'",
        "'speaker_9': 'The powers that be for when history was going to hit us with this big crisis, it was to get Bob Foster in.'",
        "'speaker_7': 'That position at that time.'",
        "'speaker_9': 'We were, Mr. Mayor, one of those groups that clashed with Bob Foster. But we we.'",
        "'speaker_10': 'Clashed like the Lakers, clashed with the Celtics or the Dodgers clashed with the Yankees. And you walk away with great respect.'",
        "'speaker_9': 'For the person on the other side because they were fair.'",
        "'speaker_10': 'They were smart, they were tough. But most importantly, they were honest. And when you get to do some really tough things in tough times, you got to have a.'",
        "'speaker_9': 'Lot of faith that the person on the other side of the table is being straight with you. And he was. And so with.'",
        "'speaker_10': 'That, we.'",
        "'speaker_9': 'Wholeheartedly endorse his name being attached to the new.'",
        "'speaker_10': 'Council chambers. Thank you, sir.'",
        "'speaker_0': 'Thank you very much. Thanks, Peter, please.'",
        "'speaker_7': 'Mayors, City Council, City Management, Steve Gatling with the Convention and Visitors Bureau.'",
        "'speaker_10': 'Our organization as well.'",
        "'speaker_7': 'Supports us tonight and it's wonderful to see all of you supporting it. Bob went with us to Washington, D.C. on a lot of different sales missions. He met our clients in D.C. He met with the American Correctional Association.'",
        "'speaker_7': 'He met with the American Square Dance Association. And if you haven't seen Bob and Boots, cowboy boots, try it. They even had him do a dozy doe on stage.'",
        "'speaker_8': 'But at the end of the day, we could.'",
        "'speaker_7': 'Always count on Mayor Foster helping us close the business for Long Beach. And he was always there to close it. And the customers loved that personal attention because quite honestly, again, it sets us apart. Mayor Garcia, you've joined us and Mr. Modica has been with us before in D.C. when he was there, and Bob would always combine'",
        "'speaker_7': 'it with legislative work on the Hill. And so for us as a city, it was wonderful.'",
        "'speaker_5': 'Because at one lunch with 80.'",
        "'speaker_7': 'Customers, National Association meeting planners, Bob, who's always self-effacing, made jokes about his demeanor and his look and everything, and the audience just loved it. And then afterwards, I had many of them come up and say, Do you think he can be the mayor of our city in Washington?'",
        "'speaker_10': 'Anyway, with that, it's a pleasure to be.'",
        "'speaker_0': 'A part of this.'",
        "'speaker_7': 'And Bob was a wonderful partner and friend of tourism conventions and the city of Long Beach. And we appreciate all of you supporting this endeavor tonight as well. Thank you.'",
        "'speaker_0': 'Thank you. Mr. Goodling. We have a motion by Councilmember Pierce and Vice Mayor Andrews to send this to the Housing and Neighborhoods Committee and also believe the. Right. That's right. And after that, I would go to the Harbor Commission as well for consideration before it comes back to the council.'",
        "'speaker_0': 'Please cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Short-Term and Long-Term Lease Agreements with MWN Community Hospital for Acute Care Facility.": [
        "'speaker_0': 'Great. Thank you very much. And now, Madam Clerk, if we can move on to community hospital and we're going to also move up after coming hospital, the gondola item, so that we will hear it. We'll move that up as well.'",
        "'speaker_0': 'Give me the hospital.'",
        "'speaker_1': 'Report from Economic Development Recommendation to execute a short term lease with MWI and Community Hospital and execute a letter of intent related to the development of a long term replacement lease between the city and M.W.. And for the operation of operation of an acute care facility district for.'",
        "'speaker_5': 'Mayor Councilmembers in November of 2017. You handed us a very difficult I like to call it a homework assignment in dealing with community hospital. It looked like we were going to lose our acute care facility there, which was our emergency room.'",
        "'speaker_5': 'And we all know how important an emergency room is to any community throughout this throughout planet Earth. So after negotiating, working with the city council and working with the team, working with MWP and led by Mr. John Molina, we have what we believe are the parameters for a fantastic deal that can reopen the hospital and reopen the'",
        "'speaker_5': 'acute care facility. Before I turn this over to the staff, who's going to give the presentation, I do want to highlight the people that have put so much passion into this during the past year. I want to highlight John Keisler and his team.'",
        "'speaker_5': 'John, the Executive Director of Economic Development. I want to highlight Dianna Tang. She's our manager of government affairs and she's been working so hard in Sacramento to keep the doors open for this hospital to stay open. I want to recognize Oscar Orsi, who's our deputy director of development services, who has worked faithfully in the seismic issues there'",
        "'speaker_5': '. Also, John GROSS, our finance director, who's guaranteed that what we're presenting to you is something that is sustainable and something that we can do. Linda Tatum, our director of development services. Tom Modica, our assistant city manager, has been inside this deal and has been living the still in and out for the past year.'",
        "'speaker_5': 'And of course, I have to recognize our city attorney's office, Charlie Parkin and of course, Richard Anthony, who's been doing the doing just the yeoman's work in preparing agreements and working with the team and making sure that we're doing everything according to our charter and according to municipal code.'",
        "'speaker_5': 'So with that, I do want to turn it over to John Kaiser and his team. I see Diana back there and Oscar know Oscar, but Diana and John. Take it away.'",
        "'speaker_3': 'Great mayor. Members of the city council's pat mentioned. We have been working on this project for quite some time. Before you have a quick background slide back in November 2017, you directed us to do a feasibility study on cost share for the acute care at that site in May.'",
        "'speaker_3': 'We conducted some very targeted outreach. We found four bidders or I'm sorry, five bidders for later dropped out. And we have one before you today who we are very confident in. And in June, you allowed us to enter into an INA with and and so with that I'll go into a quick progress update.'",
        "'speaker_3': 'You'll recall memorial care while they were leaving allowed us to establish a transition agreement which set the stage for what we have before you today in the state. A number of state agencies have been incredibly helpful to us.'",
        "'speaker_3': 'CDP approved the hospital license suspension while we work through these issues. We at the city have completed the feasibility study, as I mentioned. We also worked with Ashford to complete the nonstructural seismic compliance work required to reopen the hospital.'",
        "'speaker_3': 'We've also engaged CDP and they have allowed us to begin at the middle of the hospital license application, have been approving each form individually as we send them in so that when the last piece goes in, hopefully in the next week or so, we may have the hospital license approved.'",
        "'speaker_3': 'We've also been working with Assemblymember Patrick O'Donnell, who has introduced AB 1495 state legislation proposing to extend the deadline for seismic compliance so that we have time to achieve that. And then last but not least, we have been working with Ashford and they have allowed us a six month extension through the end of this year for continued'",
        "'speaker_3': 'use of the USB-C one rated buildings while we work on a longer extension. So tonight I'd like to introduce you and we'll have them stand up in a little bit. Molina Wou networker M.W. N Molina you are very familiar with.'",
        "'speaker_3': 'We've got John and Mario Molina with 30 years of experience working in Long Beach health care. We've got Dr. Wu. Dr. Jonathan Wu has 30 years in hospital management. He has seven community hospitals with over 1200 beds and over 7000 caregivers in Southern California.'",
        "'speaker_3': 'So very, very well established hospital operator. And last but not least, we have Dr. SIM of Network Medical Management, who has 25 years managing physicians and managed care organizations to improve patient care. So we're very excited to have him for you today.'",
        "'speaker_3': 'Molina Wu and Network. And with that, I'll turn it over to John Keisler to go over a summary with you about the preliminary agreement and the recommendations before you today.'",
        "'speaker_11': 'So the preliminary agreement, which was recently announced, is I'm going to read some of the terms into the record. So bear with me. But this is. It recognizes the operation of a community hospital as a public private partnership between the city and our partner NWN.'",
        "'speaker_11': 'The agreement also establishes a 45 year lease term with the option and your extensions at a lease rate of $1 a year. The preliminary agreement shares funding responsibility of seismic retrofit costs between the city and MWI in up to $50 million.'",
        "'speaker_11': 'And the city will be responsible for up to 25 million of these cost over a 15 year term. NWN is responsible for any additional seismic related costs over the CAP, and NWN is also responsible for securing hospital licensing and managing the seismic construction permitting process.'",
        "'speaker_11': 'The city is responsible for legislative extension to complete the seismic construction. It requires the lease premises to be used for the operation and maintenance of an acute care facility, professional office building and other ancillary medical uses. It also requests our operator to provide sobering center beds, medical detox beds, recuperative care and psychiatric beds to address community needs'",
        "'speaker_11': 'identified in the city's Everyone Home Task Force Report. Subject to appropriate licensure and regulatory approvals. And it also requests our operator to rehire community hospital employees. So the recommendations that are before you tonight are twofold. Part one is an interim lease.'",
        "'speaker_11': 'This recommendation would authorize the city manager or designee to execute a short term lease. We're calling this the interim lease with our partners for the lease of the property owned by the city at Community Hospital. There's actually three different addresses which are included in the hospital site at Termino and East Wilton Street.'",
        "'speaker_11': 'This interim lease will allow our partner to secure state hospital licensing before it expires next month on April 28th. This interim lease also allows the city and our partner to finalize our long term agreement for cost sharing and seismic retrofit, which is expected to take anywhere from 4 to 6 weeks.'",
        "'speaker_11': 'Given all the details that will be hammered out, the interim lease will also provide the city and our partner up to a year to complete the long term lease under an agreement at $1 per year and provide for reimbursement of up to $1 million.'",
        "'speaker_11': 'In the event that this process takes some time and our partner incurs costs. The second recommendation that we're considering tonight for vote of the council is to establish a letter of intent. This recommendation would authorize the city manager to execute a letter of intent related to the development of the long term replacement lease between the city and'",
        "'speaker_11': 'our partner for approval by the City Council once completed. So that means will come back once the long term agreement is hammered out. This letter of intent would document our commitment for the long term agreement to operate an acute care hospital and cost sharing for seismic compliance as described above.'",
        "'speaker_11': 'It provides state regulatory and legislative agencies with a plan to reopen and rebuild the facility. This will be essential as they're considering or licensing or operating or business and financing plan, and it will provide time for both parties to negotiate detailed terms of the agreement while the hospital reopens to the public.'",
        "'speaker_11': 'It also will provide time to secure state licensing and permit approval, even as we're working out the details. So in terms of next steps before you take action, ultimately, we're hoping to execute this interim lease this month. In fact, perhaps even as soon as this week, we're hoping to submit our seismic rebuild plan to the state of'",
        "'speaker_11': 'California this month, maybe over the next couple of weeks, submit our legislative extension to the state. This could be a bill that would have to happen sometime this month and secure hospital licensing, probably as soon as April, before the April 28th licensing expiration.'",
        "'speaker_11': 'We have to also move forward with finalizing the long term agreement. Our city attorney has said this could take 4 to 6 weeks. We're hoping to to to really jump on this and get it done as soon as possible.'",
        "'speaker_11': 'And then we would come back to the city council with a finalized agreement so that the public, the council and everybody could review and comment. And we would hope that once the state licensing is secured, that the rehiring of employees at the hospital would begin as early as this spring with a hospital reopening sometime within a few'",
        "'speaker_11': 'months after licensing is approved. That would all allow us to begin our construction planning for the seismic retrofit. We would need to approve those plans in mid 2020 and then we would need to complete construction in different phases with the hospital rebuild either by 212, 2022 or 2025, depending upon the response from the state agency.'",
        "'speaker_11': 'Before I introduce our representatives from NWN, I wanted to hand it back to the City Manager, Pat West.'",
        "'speaker_5': 'Council members before we conclude. I can't conclude without recognizing the passion exhibited by Councilmember Supernormal, whose district the hospital is in, as well as council members Susie Price and Stacie Mongeau, whose districts are immediately next door to this hospital.'",
        "'speaker_5': 'That said, a hospital transcends district boundaries. I want to assure everyone here that the entire city council, including Mayor Garcia, have been intimately involved in every step of this way. So, again, this has been involved by the entire city council because a hospital is so special in a city.'",
        "'speaker_5': 'So with that, I'm going to turn it back over to John to introduce the MWI and folk.'",
        "'speaker_11': 'Thank you. Pat is the the representative spokesperson for NWN in Mr. John Molina is here tonight and I wanted to give him a chance to speak as part of the staff report and to introduce his partners, which have been incredible through this whole process.'",
        "'speaker_11': 'It's been an extremely collaborative process with a lot of difficult reports and and decisions to make throughout. So with that, I'll hand it over to John Molina. Thank you.'",
        "'speaker_10': 'Thank you, John. Mr. Mayor, city council members, I want to introduce my partners in this project, Dr. Ken SIM from Network Medical Management and Linda Marsh from M.S.. They do not have the deep ties to language that I do, but you could not have asked for better partners on this project.'",
        "'speaker_10': 'H.M.S. operates seven community hospitals here in Southern California. Network medical management manages thousands of doctors and importantly, helps 650,000 patients navigate the health care system. And I think to show you how attuned they are to this community. I also want to introduce to you Virgin Arbutus.'",
        "'speaker_10': 'Who's going to be our CEO? Verge is a Long Beach resident. So you have someone at the helm of the hospital who really is got his finger on the pulse of the community. This has been a very long process, and I want to thank the staff for putting up with us.'",
        "'speaker_10': 'Most importantly, I want to thank you, Mayor Garcia, for your unwavering support and leadership and to the city council. All of you, as as the city manager said, hospitals transcend council boundaries. This is a hospital that belongs to all of the city.'",
        "'speaker_10': 'And it will help relieve a lot of the pent up demand that we're experiencing at Long Beach Memorial and St Mary's. And this wouldn't have happened without the the leadership of councilmember supernova price and Mongo. He did a fantastic job of mentioning the city staff, and I don't want to repeat that, but it's just been a pleasure'",
        "'speaker_10': 'to work with evokes. Everyone has been optimistic, everyone has been realistic and everyone has been very forthcoming. Community Hospital has a wonderful foundation led by Matthew Faulkner and Ray Burton, who are here, and they have been with us every step of the way, and I really appreciate all the help that they've given us.'",
        "'speaker_10': 'And most importantly, I want to thank the people of Long Beach, the folks who came to meetings such as this, the folks that came to the listening sessions, the folks that put their signs out that said, Save our hospital, save our E.R..'",
        "'speaker_10': 'Without their support, we wouldn't be here tonight either. And it is not just the support in the past, but it's going to be the support when they use the hospital and the services going on in the future. That's going to make this a financially feasible, financially viable, long term solution for Long Beach.'",
        "'speaker_10': 'I want to go over some of the next steps, so maybe answer some of the questions and then I'll be happy to answer any questions along with with verge on what happens next. We will be submitting our license application by the end of this month.'",
        "'speaker_10': 'That's a big step and we need this lease. In order to do so. We expect to start hiring people end of April through the end of May. And I'll get to the hiring in just a minute. And we expect that the state of California will do a license survey sometime in mid-June.'",
        "'speaker_10': 'And if all goes well, as we expect it will, we expect to reopen in the summer, probably July, maybe August. Believe me, we would like to have that date sooner rather than later, but we're not going to open it until we're ready in terms of hiring staff.'",
        "'speaker_10': 'We're going to give preference to those employees who used to work at the hospital. We welcome them back to the family. They never left. I am sure that you either have received or will receive calls from the unions.'",
        "'speaker_10': 'At this point, we feel a little premature to talk about the unions. That's really an employee issue and we want to make sure we get the hospital open first. But we're not going to do anything to stand in the way.'",
        "'speaker_10': 'We believe that when we open the hospital up, we'll have about 200 employees as we begin to get more patients in the hospital and in the E.R. and ramp up other services. We expect that we will add more employees and at the end probably have about 400 people working there.'",
        "'speaker_10': 'This does not include employees who may be working for physicians in the physician offices, in the medical office building or some other ancillary programs that we intend to bring on. So what services are we going to have there?'",
        "'speaker_10': 'When we start off, we're going to have most importantly, we're going to have the ER open. And I know that for a lot of people who have suffered long waits because the hospital er is closed, it will be great news.'",
        "'speaker_10': 'And hopefully soon after that we will be able to add an ambulance, run to it as well and paramedic runs. We're going to have acute care beds, medical, surgical and ICU beds, pharmacy lab radiology, including a CT and MRI and behavioral health.'",
        "'speaker_10': 'One of the things we heard from the community is there is a lack of behavioral health services in the city. And so we intend to do what we can to alleviate some of those issues. Additional services we will bring on over time.'",
        "'speaker_10': 'Many of these will be to support the Everyone at Home Long Beach initiative, and that will include outpatient behavioral health for both adults, children and adolescents, substance abuse services, recuperative care and again, other services that we specifically heard the community really want, such as diabetes, care, wellness and other holistic services.'",
        "'speaker_10': 'We are very appreciative of the $25 million commitment that the city has has made or will be making. And I want you to know that we're putting up an equal amount. And this will go towards the seismic retrofit.'",
        "'speaker_10': 'And we will do everything we can to bring that cost down. We don't want the city to spend one penny more than it has to, because, frankly, that means we have to spend one more penny than we have to.'",
        "'speaker_10': 'In addition, we're committing up to $40 million as needed to buy equipment. To do deferred maintenance. The hospital's been closed now for a long time. And there's deferred maintenance. And the fact is we have to carry the employees for probably 3 to 6 months before we start getting paid.'",
        "'speaker_10': 'And so we're going to commit $40 million to make sure that those things can happen. It is our goal. To make this hospital a long term asset to the community in it. I mean, let's let's not beat around the bush.'",
        "'speaker_10': 'This has been a challenge for the previous owners, previous operators. Whether it was community hospital as a standalone hospital, part of the Catholic Health Care West System or part of the memorial system. But our commitment to you folks and to the folks in the audience is to make sure that Long Beach is proud of this hospital.'",
        "'speaker_10': 'And I am. Very happy to answer any questions.'",
        "'speaker_0': 'I think, Mr. Molina, we're going to continue with the presentation and then if raise questions, we'll we'll we'll have you come back up.'",
        "'speaker_10': 'I guess.'",
        "'speaker_0': 'Okay. Thank you. Thank you very much. Let me let me take this back to two staff. We're fine. Are we. Are we done with that? Complete with the whole presentation? Okay, great. So let me first go to I think Councilman Superman might make a couple opening comments.'",
        "'speaker_0': 'We're going actually go to public comment first. I believe he'd like to do it. And then we're going to come back to the council for questions and comments.'",
        "'speaker_9': 'Okay. Thank you. You know, the folks in the audience have been waiting for about six months and now six months and 2 hours. So I'd like to invite public comment this time. Thank you for your patience.'",
        "'speaker_10': 'Larry. Good. You say that. Yes, I fully support this concept and particularly Councilperson Susan off. And I'm going to come up with a suggestion of how the possibility that this and I think there's a distinct possibility of getting federal funds.'",
        "'speaker_10': 'Are. To start to analyze what you've. Referenced as behavioral issues. And Long Beach, unfortunately, is uniquely positioned. Given the fact we have the most criminally complicit mayor at the current time. We our state or U.S. senator per the U.S. Ninth Circuit Court.'",
        "'speaker_10': 'R is corrupt. So I think what we could use. We'll use those federal dollars to study and to find out what makes people as corrupt as our mayor. As are U.S. Senator Kamala Harris, who the U.S. Ninth Circuit bipartisan panel.'",
        "'speaker_10': 'Found that she had engendered an epidemic of corruption. And I think that will also be as they will get inside of it. Our new governor. Who is fawning over. The US Ninth Circuit Court Review. Kamala Harris. So I'll take the lead.'",
        "'speaker_10': 'I'll contact some people in Washington to see if we can get. Federal dollars to address those behavioral issues. There are far greater. Far greater. Then the issues you referenced here before. That's not to diminish those. Those are legitimate causes.'",
        "'speaker_10': 'But we're uniquely. Suited for this. We know the most corrupt mayor the city has ever had. We know the slot. The US Ninth Circuit rebuked. And I think it would benefit this city and the country. And we'd be at the this city would be at the epicenter of conducting that study.'",
        "'speaker_10': 'Thank you. Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_7': 'My name is and I can pay. Resident Sixth District. It's council and mayor. It is important. It is important that we as a community demand more transparency in relation to where and to whom are elected officials choose to give our hard earned money to.'",
        "'speaker_7': 'Here we find ourselves witnessing with too many in the community feel as a prime example of corporate welfare. If we are to exist under the current capitalist system that presides over the American economy, it makes no sense for an investment at this level to be covered completely at the expense of the taxpayers of this beautiful city.'",
        "'speaker_7': 'For many, it is fiscally unsound and inappropriate for our city to be handing over tens of millions of dollars to a private public enterprise at the meager price of $1 a year lease with no proper stipulations. The federal government didn't operate under these pretenses with GM and Chrysler, and neither should we with w.'",
        "'speaker_7': 'W. H. Not while there is development at the level that it is today going on in the city. I to use a personal antidote was born at Pacific Hospital in the Wrigley area. The hospital was shut down due to decades of medical fraud and malpractise and the.'",
        "'speaker_10': 'Property.'",
        "'speaker_7': 'Was ultimately acquired by a private for profit nursing college. We didn't have the great fortune of a public private enterprise such as this coming in to services and our community. I believe that for the city to proceed on with this project, we would like we in the in the community would like to restructure the deal currently on'",
        "'speaker_7': 'the books and what it means for this amount of city funds to be involved. I and many others recognize the importance of keeping this hospital open. That's not a question here. I believe the hospital should be opened, and I believe that the east side of the city should be serviced by a hospital at this level.'",
        "'speaker_7': 'However, that being said, this goes beyond financing and as such there needs to be a more involved conversation about possible public ownership of this space ran by our health department rather than a public private enterprise. And.'",
        "'speaker_10': 'If there is to be a public private enterprise.'",
        "'speaker_7': 'Such as the listed suitors of the potential lease agreement here, there should be, instead of especially at 45 years, a mandatory reduction in service and care price controls put into place, and beds specific, more beds specifically dedicated to our mentally ill.'",
        "'speaker_7': 'A goodwill gesture is simply not enough when public funds are being utilized. Until we see that, myself and others will be writing letters both to our state elected representatives.'",
        "'speaker_10': 'OHS, HPD, the State Department of Health, as well as.'",
        "'speaker_7': 'Our current insurance commissioners to see how our city found itself in the predicament we are in today. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Hey, everybody. Hi. Ellen Markowitz, former employee of Community Hospital of Long Beach. Long Beach Community Hospital. What else was it called? Oh, it's gone through several names, but you get the gist. I would like to personally thank each and every one of you for all of the hard work.'",
        "'speaker_2': 'All of the hard work, everybody. This is a great moment right now for us and especially for the citizens of East Long Beach and not just East Long Beach, because once everyone knows that that emergency room is open, that's where they're going.'",
        "'speaker_2': 'That is where they're going. They are going to have ten hour waits to be seen. And it. It is. I have friends and relatives that have had those ten hour waits to be seen at various hospitals. And I also want to thank M.W. and for approaching the mental wellness side of this project, because the other two mega'",
        "'speaker_2': 'hospitals in the area, in the city don't. They just don't. So a heartfelt thank you to each and every one of you.'",
        "'speaker_3': 'And I appreciate the 25 million. It's a lot of money to the people who are worried about it. But this decision was not made in a vacuum. It's a big need. And I know you guys put a lot of thought into that.'",
        "'speaker_3': 'So nothing but respect. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening.'",
        "'speaker_7': 'My name is Mike Madani. But he's not my k. Iran is NYC that needs the microphone because I'm the head of the Taxi Cab Drivers Union in L.A. so I'm their voice. So they call me Mike, but they make a mistake.'",
        "'speaker_7': 'They say, Mike, anyway, I haven't been here for a long time and currently I think my council member would be Rex Richardson, Herman Cherry and Hardy. So. But it's your fault if I don't know, because you never come over the you never knock on the door.'",
        "'speaker_7': 'You never ask me what's going on. So you just stay in your seat. Not enough. You've got to do work wise.'",
        "'speaker_0': 'And this is on community hospital, correct, sir?'",
        "'speaker_7': 'Is about all the hospitals, okay? Not. Not just that hospital. Just. I was currently on Long Beach Memorial in Long Beach Memorial one night. And it was so many people over there that took me the whole 24 hours to get out of there.'",
        "'speaker_7': 'I got out of there next day, 6:00 in the morning. Why? Because we don't have enough for taking care of the sick people. And that's the major thing. What's going on? And has to be investments. I remember Long Beach before, many years ago.'",
        "'speaker_7': 'Probably you don't remember. And it was poor city even had a lot of money. But they start investment. And now you see it looks much better and looks really different than Compton or other part of the like, Watts or other part of the L.A..'",
        "'speaker_7': 'Anyway, you have to invest. You have to care about the people. You really care about the people. If you're not sick, it doesn't mean that you'll be worry about other people. You have to worry about other people. Why?'",
        "'speaker_7': 'We don't have no more hospitals in the area. How many hospitals we have. And this is all the same we had before, but we had more people living in this area. In Long Beach, we have more people living recently comparing with ten, 20 years ago that I was going to college here.'",
        "'speaker_7': 'You need more hospitals. Do you ever think of that? Did you plan to build new hospitals? There is a lot of room. Long Beach. We have a lot of empty spaces and you have a lot of money. Actually, Long Beach after L.A. is one of the richest cities in the area because of the income of the port'",
        "'speaker_7': '. Right. But what do you would do with that money? But that money goes if doesn't go to housing for senior citizen, it doesn't go for. I'm on the waiting list for housing for senior citizens. Six years. Why? Because you don't care.'",
        "'speaker_7': 'I go to the hospital. It takes a long time. Why? Because you don't care. I don't breathe good air. Why? Because you don't care.'",
        "'speaker_0': 'Thank you very much, sir. That concludes public comment. I'm going to go ahead, go back to the council. Let me start with Councilmember Supernova.'",
        "'speaker_9': 'Thank you, Mayor Garcia. Thank you to staff for the presentation. John Molina. Thank you very much for your presentation. I'll actually make my comments very brief. I'd like to do some acknowledgments and thank you first to my council colleagues.'",
        "'speaker_9': 'I'll tell the public right now they have been nothing but totally supportive of this project from the very beginning. Never wavered. Well, there was a couple of weeks ago when that kind of weird newspaper headline came out and kind of shocked a few people.'",
        "'speaker_9': 'But we got over that. I'd also like to mention that one great byproduct of this project has been getting to meet and work with so many great people, whether they have medical backgrounds or not, they genuinely care so much about the residents of Long Beach.'",
        "'speaker_9': 'And first, I'd like to mention the nurses. Ellen and Jackie, thank you for speaking tonight and thank you for working so hard on this project. I should I should also mention Patti Eckenroth. I think she's taken every one of my notices in our Friday newsletter and posted it online.'",
        "'speaker_9': 'So thank you for that, Patti. The doctors, Dr. Andrew Manos, who met with us so many times and Mike Vasyl Mental lack is the only Grammy Award winning cardiologist with a seven syllable last name that I know. So he's been absolutely instrumental in pushing this project forward.'",
        "'speaker_9': 'And for those who don't know, he caused a paradigm shift to happen in my thinking. And that is we'd heard so much about the legacy of this 94 year old institution. For instance, four generations of my family have used it.'",
        "'speaker_9': 'So many people say, Well, my kids were born there or I was born there, and we had sponsored the nurses to walk in the Belmont Shore Christmas parade. And Dr. Mike walked along with you and afterwards he said, You know, there are a lot of young families in Long Beach with kids that he noticed down there on'",
        "'speaker_9': 'the parade route. He said the real story should be what we're doing for this next generation and generations to follow. So I think John Molina hit on that saying it's really the future of this institution that's important here.'",
        "'speaker_9': 'And that caused us to change our focus from Save Community Hospital to save the East site E.R. And that was our focus from that point forward, because young families, unfortunately, need ERs and it's just a fact of life.'",
        "'speaker_9': 'I also want to mention the Community Hospital Foundation. Thank you all for being here tonight, Matthew and Ray and Suzanne. Diane. And I also want to mention Ruth Lowell, my neighbor, who I think I've told the story before, but.'",
        "'speaker_9': 'At our very first task force meeting. She lives two doors down from me, said Darrell, can I get a ride to the house first meeting? I said, Ruth, I'm not at home. I'm down at City Hall. I'll barely have time to get there, she says.'",
        "'speaker_9': 'That's okay. I'll take an Uber says. But by the way, do you know if they're taking donations tonight? I said, Ruth, that's that's not what we're doing there. But I'm sure someone can take a check from you, but it's a task force meeting.'",
        "'speaker_9': 'So later I found out that Ruth did donate a check that night for $20,000. So the lesson there is, moving forward, I'll commit to the public that if you want to make a donation of $20,000, I will pay for your Uber to take you to the meeting.'",
        "'speaker_9': 'Fact I'm going to live here, I'll make it. I'll take it down to $1,000 and we'll do that. I also want to mention staff, I should say CEO, Virgina Brutus up there. He was introduced earlier, but Virgin has been great and patient.'",
        "'speaker_9': 'I didn't know how patient he could be, but thank you for hanging in there and we look forward to working with you moving forward and then to city staff who've been mentioned. I also want to mention City Manager Pat West.'",
        "'speaker_9': 'Thank you for recruiting and developing such awesome staff members and kudos to you because they're not too many city managers have a resume that includes a new courthouse, a new city hall. Now you've saved a hospital. So that's pretty impressive.'",
        "'speaker_9': 'And I'm not even mention that on your watch. City Council approved Meatless Monday, so could it.'",
        "'speaker_0': 'Yeah. Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Which by far was the most controversial item I voted on I supported. Thank you to my colleagues on that. Yes, it was very controversial, believe it or not. So I, too, want to thank staff and, of course, Councilman Supernova and our partners in this Marlena Wu network.'",
        "'speaker_2': 'I think for me, the most important aspect of the lease agreement was that we have at least the tentative agreement that we have in place very clearly that acute care services would be part of this contemplated agreement between the parties.'",
        "'speaker_2': 'And so I just want to ask a few questions from staff just to make sure. I know this has been an issue that's been raised by my constituents. And I want to I want to ensure that I'm I'm analyzing the term of the terms of this agreement accurately so.'",
        "'speaker_2': 'It is my understanding that acute care services are a fundamental part of this agreement, and if for some reason down the road, acute care services turned out to be not viable, not feasible or otherwise unattainable at this location, would that be considered a default by a molina view?'",
        "'speaker_2': 'How would we handle that situation? Let's say we're several years in.'",
        "'speaker_11': 'Councilmember. So under the preliminary terms of the agreement, we have a number of contingencies that we have agreed upon that we've put in place and which we'll flesh out in detail over the coming weeks in the final agreement, depending on the cause of what we would consider a default, the inability to.'",
        "'speaker_11': 'No pun intended, by the way, given that it's a seismic issue that we're trying to address. But there's a number of agencies that will have a say in as to whether or not we're able to license permit and continue to provide acute care at the site.'",
        "'speaker_11': 'So if if there was a default, that that was because of some sort of activity or result outside our control. Then in that case, we would both look at the situation and it would be a matter of reimbursing NWN for costs that they've incurred to date.'",
        "'speaker_11': 'So if that occurred, say, in the next couple of weeks when we are seeking pet approval for permitting or CDP licensing, well then there wouldn't be very many costs to reimburse. But if it were to happen later on in the project, then we have both agreed that the restriction to provide an acute care services at the site'",
        "'speaker_11': 'would no longer be eligible and that condition would be removed. We would also consider the potential sale of the property to NWN at fair market value less the cost that they've invested to date. So that would be a possible scenario if if the default were to occur for reasons outside our control, we have similar scenarios that we've'",
        "'speaker_11': 'hammered out in the agreement, the preliminary agreement, if it were to occur, that the costs to operate or some issue that was within the control of our partners, they would, of course, you know, be in default at that point.'",
        "'speaker_11': 'And we would have to consider whether or not we could find another operator. But we would ultimately, if we could continue to operate an acute care facility, we would deal with our options at that time. And again, it depends on how long this occurs, what the cause is, and ultimately whether or not, you know, we consider it'",
        "'speaker_11': 'to be an act that was in or outside the control of either the city or of our partner.'",
        "'speaker_2': 'Okay. Thank you. That clarifies it. I mean, I think for me that we're obviously we're interested in having a hospital, but we're interested in having a hospital with acute care capability because that is what's going to take the pressure off of the other hospitals in the region, reduce wait times and assist with the the overall needs.'",
        "'speaker_2': 'So I want to make sure that that legislative intent is very clear in addition to what's. Articulated in the proposed agreement that we're voting on tonight. And it sounds like that's very clear in terms of staff's understanding as well.'",
        "'speaker_2': 'I do have a couple of questions that I've received from residents that I want to just kind of run by staff and perhaps of staff doesn't know the answer to those, which is unlikely. Mr. Molina might be able to assist at some point.'",
        "'speaker_2': 'Is it our goal or is it the goal that this hospital would be a fully functioning hospital such that if there was a surgery need identified in the acute care facility, that we would be able to do the surgery at the at the facility or would there be a transfer?'",
        "'speaker_2': 'And if so, have we contemplated how certain insurances like Medicare would be impacted by that transfer?'",
        "'speaker_10': 'It is our goal and our commitment that it will be an acute care hospital. So depending on the type of surgery, if you needed your gallbladder removed, for example, we can handle it. Okay. If you needed brain surgery, we probably refer you to a tertiary hospital that has that kind of capability.'",
        "'speaker_2': 'Any ideas about cardiology, stents and things of that nature?'",
        "'speaker_10': 'Yeah, it's probably not. I mean. Long Beach is fortunate that both Memorial and St Mary's have excellent cardiac surgery programs. And one of the things that. Is counterintuitive. In health care, if everybody has lots of services, costs go up.'",
        "'speaker_4': 'Mm hmm.'",
        "'speaker_10': 'So what we really want to do is we want to focus those types of services to the appropriate place.'",
        "'speaker_2': 'Okay. Of course, I appreciate that. And just the last question. Again, I've gotten tons of, you know, third district residents are, you know, heavy users of community hospital when it is open. I myself have gone to the E.R. There once is a, you know, 18 year old college student involved in a traffic collision and another just recently'",
        "'speaker_2': 'before I had emergency back surgery on the days before the closure. And so, as you can imagine, we've received a lot of nuanced questions. I'm not going to bore you with those details now, but I think an important one is will be will we be working or will you be working with insurance providers to try to keep'",
        "'speaker_2': 'costs low for transfer from one facility to the other for the purposes of performing a surgery that was identified in your E.R.?'",
        "'speaker_10': 'Absolutely. That's one of the reasons why network medical management was brought into the group, because they have an extensive staff and experience in handling issues with the health insurers.'",
        "'speaker_2': 'Excellent. Okay, good. Well, you know, as I've said to my residents and there are there are folks here with whom I've met one on one. And I'm sure there's going to be more meetings from this point forward. I think what I'm proud to say tonight is that the city is doing everything we can.'",
        "'speaker_2': 'And I know Molina wewe network is doing everything you can to move this agreement forward. This by no means, however, is the end of the road. And there are a lot of regulatory bodies ahead of us that will need to look at what we're doing and make sure that their the compliance is at a level where they'",
        "'speaker_2': 'are satisfied. So having said that, you know, this is our we are making a commitment, but the details of what the future looks like will come as we move through this process together and obviously address any concerns that come from other regulatory agencies that we'll have to adjust to.'",
        "'speaker_2': 'I want to thank you. Our staff has been amazing. Our entire staff who the city manager mentioned, Councilman Super, has had countless number of meetings with constituents on this issue. And of course, Molina, we network has been a tremendous partner.'",
        "'speaker_2': 'But specifically, I want to thank John Molina. Your passion for the city of Long Beach has had a lot to do with why we're here having this discussion right now. Thank you for investing in the city that you live in and love.'",
        "'speaker_2': 'So it benefits all of us. Thank you very much.'",
        "'speaker_0': 'Thank you, Council Councilwoman. I'm going to make some comments as well. And then we're going to go to the rest of the council. And Mr. Molina, if you want to, you can you can grab a seat if you'd like.'",
        "'speaker_0': 'I think there's other questions. We'll we'll bring you up. Let me let me just begin by saying that since since day one, the city has been committed to reopening community hospital. I think you've heard that from the council.'",
        "'speaker_0': 'You heard it from the staff, and you certainly have heard that from the community and the foundation. When the. The notice was received by the city and this whole process started. I think there was a lot of concern across the city about losing a hospital and an emergency room, and particularly in an area that is underserved by'",
        "'speaker_0': 'these services. You often read in the newspaper or see on the news about hospitals closing and other communities. And I'm really proud that Long Beach is right now leading a conversation about keeping a hospital and saving a hospital within our community.'",
        "'speaker_0': 'And so I wanted to take the moment for also that to sink in with all of this, that we are at a very special and important moment in the process. I like Councilmember Super A.Z.. I want to thank so many folks that have been involved in this process.'",
        "'speaker_0': 'Most of all been thanked already. I see members of the community that I have met with and the foundation board, of course, are nurses who have been at the forefront of pushing this every single step of the way, our doctors, the community.'",
        "'speaker_0': 'I want to thank Supervisor Hahn and her commitment from day one. And I especially want to thank our legislative partners and assembly member Patrick O'Donnell, who has been a strong voice and will need to be a strong voice as we move forward to get this deal done through the state process.'",
        "'speaker_0': 'And I also need to really give a huge thanks to our city staff, everyone from the management team to the team at Economic Development to Ms.. Tang and our city attorney team. I will tell you that they have been phenomenal in getting this to this point, and I really want to thank them for their work.'",
        "'speaker_0': 'And of course, to me, when we want to thank you for this partnership as we move forward and know that we're committed to the partnership as well. I want to make a couple a couple notes. The first is that I want to reiterate some of what's been said.'",
        "'speaker_0': 'This is tonight is not the end of this process. And I think it's really important for us to note that. I think while we should celebrate where we are and celebrate this interim agreement and this framework, the real celebration will hopefully happen once the state process is concluded.'",
        "'speaker_0': 'And so I think that we should not in any way let up. And right now, essentially, this council is ready to move the ball forward. And we are very close to to the end here. But really, the ball is now in the state of California's court and in the agencies in at the state that will make the'",
        "'speaker_0': 'decisions to to really reopen the hospital. And so it's important for us to take the energy now to our partners in the state and do all of the the lobbying and goodwill that we have there over the next few months ahead.'",
        "'speaker_0': 'And so I do want to reiterate, again, like was said by the council, that this is not the completion of this deal, but really the beginning of a of a process that will take place over the next few months.'",
        "'speaker_0': 'I want to note that our commitment to reopening the hospital is not just about the importance of community as it as it relates to emergency response and getting folks to their to their to the health care they need.'",
        "'speaker_0': 'But it's also critically important to the city when it comes to firefighting and paramedic service. And so I want to thank the fire department and the fire association that's been involved in this. And I'll tell you that reopening community is critical to ensuring that our engines and our paramedics are able to access emergency rooms efficiently and build'",
        "'speaker_0': 'the type of trust and relationship that they have with the nurses and doctors that were there at community before. Community was closed, the door was closed. And so I think that is incredibly important. And I want to note that I agree that the community is everyone's hospital.'",
        "'speaker_0': 'And as part of that, I want to thank NWN for their commitment to meeting the goals of the Everyone Home Long Beach report. It's important to note that prior to two community closing, the services that were there as it relate to psychiatric evaluation and and psych services.'",
        "'speaker_0': 'This was one of the main centers in the city where these activities were happening and to reopen the hospital with a renewed commitment to the to the psych beds. But also looking beyond that to meeting the other needs that we have citywide as they relate to to sobering facilities and detox facilities, as they relate to serving the'",
        "'speaker_0': 'recuperative care needs that we need. To me, that is absolutely worth the city's commitment and investment in this need that we have on this facility and really across the city. And so I also say to the foundation, who will be entering a different relationship and a new a new relationship as well.'",
        "'speaker_0': 'These these are areas that we look forward to working with all of you on. And we know that your your hearts are there in this work. And I want to thank you for your commitment to these critical needs that we have across the city.'",
        "'speaker_0': 'In addition, I want to be clear, it was brought up. The commitment the city is making financially is essentially going towards the retrofit of the buildings that we own. And the city of Long Beach has essentially a facility that has major needs for seismic repair and investment.'",
        "'speaker_0': 'And what we're putting our dollars to is not towards ongoing operation of the hospital or some or ongoing operations of the of the personnel need. But it is going to ensure that the facility that the taxpayers of Long Beach have invested in in the past is upgraded and that the regulations are met with the state of California'",
        "'speaker_0': 'so that we can operate a functioning E.R. and a facility that would make the city proud. And so that's where our dollars are going. And I believe those are are wise investments for us to reinvest and to partner in this what will be a unique public private partnership and relationship with MDA when as a city moves forward'",
        "'speaker_0': '. Let me also add that and this is something that I talked to Councilmember Supernanny about, and I want to ask the staff as well. We are obviously going to be looking and using our general fund dollars to maintain our commitment.'",
        "'speaker_0': 'We're making as a staff report notes, a 15 year commitment to to put our portion of the retrofit dollars towards towards the hospital. And so as staff brings back the final lease, which I know is coming in the months ahead, as we bring back the reports from the state of California on the process and we finalize those'",
        "'speaker_0': 'items, I would like staff to also come back because I know you're already looking at I'm providing this council kind of the options and the way forward on how we look at filling those those general fund gaps that we know we will have.'",
        "'speaker_0': 'And I think it's responsible responsible for us to have that conversation as we move forward as well. And so Councilmember Supa and I would ask, is part of our motion that staff also brings back those those recommendations when the lease agreement is back to the city council.'",
        "'speaker_9': 'Okay. Well, accept that.'",
        "'speaker_0': 'And and in addition, let me just say in in conclusion that I want to I want to thank, you know, Councilmember Superman in particular. I think you've been a great leader and voice on this issue, and it's been great working with you on this issue.'",
        "'speaker_0': 'But I also appreciate the numerous hours you have spent personally managing and working with members of the community, which is which has been very hard on this on such a big topic. So thank you and thank you to the staff and thank you to everyone out here for for sticking with us throughout this process.'",
        "'speaker_0': 'And with that, I want to turn this over to Councilwoman Mongo.'",
        "'speaker_3': 'Thank you. I appreciate the staff and the presentation. For those of you who aren't aware, we've been meeting in close session on this now for several weeks. And so we've had a lot of time to go over a lot of the different components of the agreement.'",
        "'speaker_3': 'I appreciate the mayor's request for the solutions on how we pay for those revenue options. I think this is a great way to structure the deal as well in terms of how the commitment over time increases when we have the opportunity to find those revenues and grow them appropriately.'",
        "'speaker_3': 'If you follow any of us on social media, you might know that our economic development team has done an exceptional job, not just growing revenues, but also finding cost savings throughout the city on other things. And so I'm confident that when this comes back with the least, that we'll be able to identify what that looks like and'",
        "'speaker_3': 'where those things come from. And so I look forward to that. Many know that. More than 80% of our calls for service in the fire department are medical in nature. And so the success of a hospital in our community is critical to the success and health of our community and the families that we serve.'",
        "'speaker_3': 'And so I look forward to the day the doors reopen. I'm also co-sponsoring some items at council next week that relate to other solutions that will help both before and when the hospital is open. In terms of pilot community paramedic programs that drop off at urgent care centers and other things so that hospitals aren't receiving patients that'",
        "'speaker_3': 'they shouldn't be receiving in the first place. And so those types of pilots that are going on throughout the state can also be a part of the solution in giving the hospital the best chance at a better survival rate than are their predecessors.'",
        "'speaker_3': 'So I want to thank John Molina and the team. I know that there's a lot more behind this. And John's been the faith and the spokesperson, but there's a lot that goes into a deal of this magnitude. And so each and every member of your team and your financing and your components.'",
        "'speaker_3': 'There's a lot of risk. And we appreciate you and the commitment you have to Long Beach and the commitment you have to people over profit and to families. And that's just something that's just so important that we talk about here today.'",
        "'speaker_3': 'I also cannot let a moment go. And I'm not one who wants to thank stuff publicly as much as I think they appreciate the appreciation quietly, but it cannot go without thinking. Council Member Super. Not publicly. It has been no matter what hour of the day.'",
        "'speaker_3': 'I get a question on community hospital. I can I can text him and my hours with a newborn are odd and I can text him and he'll usually have an answer for me before 7 a.m.. And so that really that responsiveness and that expertize that he's developed on this matter over time has been a phenomenal resource to'",
        "'speaker_3': 'all of us. And I can't say enough about him. I mean, I also appreciate working with Councilman Price on this. It's been a big learning opportunity and something that I think our community has grown together with. And when I talk about the community, I appreciate each and every one of you, but a big, big thank you to'",
        "'speaker_3': 'the foundation, because the foundation and being there and advocating early on putting your money where your mouth is, that's a huge component of what's made parts of this possible. And so I feel like you really need, even if all nine of us say at a public thank you and I really appreciate you again, good time to take'",
        "'speaker_3': 'a breath, but maybe not celebrate yet. And I will keep on working with staff. I know that we have good hands with Deanna Tang and her work at the state level and a lot of our advocacy from a lot of our local electeds and statewide elected.'",
        "'speaker_3': 'So let's keep the pressure on. Let's stay positive. And I look forward to getting Lisa back with some of our revenue options.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilmember Pearce.'",
        "'speaker_3': 'Yes. I want to echo everything that's been said without sounding like I'm repeating myself or anybody on this council. But it goes without saying that something of this magnitude is the hallmark of what makes our civilizations great. When we can take care of our neighbors and our residents and our community members, that strengthens our community.'",
        "'speaker_3': 'And so I know that when we got the news of what happened, it was heartbreaking and that feeling of powerlessness for a minute. And so I really want to applaud everybody for their efforts for being creative and the fact that we, you know, our city and not a county and not a state, but we're able to be'",
        "'speaker_3': 'nimble and creative and bring all those stakeholders together. And I really want to applaud everybody. And I know our staff. I just I, I am always impressed with economic development. And I just want to say publicly that I know that, John, this has taken a lot of you coming in and having discussions with us and us, you'",
        "'speaker_3': 'know, kind of pushing. And so I applaud you for managing nine council members, a mayor, a community that is really demanding the best that we can get. And so I really know that you guys have have worked to make that happen.'",
        "'speaker_3': 'I agree that our tax dollars need to make sure that they're, you know, put in a place that we have transparency and accountability and that we believe that we're getting the best for our dollars. And there's no better use than than health care at the national level.'",
        "'speaker_3': 'We have a health care crisis as much as sometimes we're numb to that. And in the city of Long Beach, when this hospital closed down, it meant that, you know, some wait times in the E.R. extend an additional 10 minutes, and that's 10 minutes that can save somebody's life.'",
        "'speaker_3': 'And so when I think about is this a good use of taxpayer dollars? Absolutely. It's a great use of taxpayer dollars, not to mention doing it locally with with our local nurses, local doctors and our people like John, who continually step up and really are putting their money where their mouth is.'",
        "'speaker_3': 'And so. Thank you, everybody. Thank you. Councilmember Super nono you took. Authority of the meetings. And thank you to everybody on this council for really seeing that this is a citywide asset. And the one other thank you, I'll say is, for know, you guys really work to educate me on thinking about creative funding opportunities and really seeing'",
        "'speaker_3': 'that while I care very deeply about mental health and recognizing we have a mental health crisis in this country and and in the city as well, that adding those beds to this hospital allow us to have additional funds at our fingertips.'",
        "'speaker_3': 'And hopefully we when we get to that point, we can see a lot of different funding options to make this a robust, exciting hospital that it should be. So thank you again, everyone.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember Richardson.'",
        "'speaker_9': 'Thank you, Mr. Mayor. And I just want to raise up a few points that resound with me. I think I like the approach of lifting up and implementing some of the everyone at home recommendations. And I think if you look at that and other work that the Council has taken on over this last year, this is really'",
        "'speaker_9': 'about strengthening the safety net of those in need in our city. And so I think that that is, you know, cities are taking on more of these sort of broader issues that traditionally have been taken on by, you know, counties and states.'",
        "'speaker_9': 'But across the country, cities are stepping up to lead on these issues. And here this is an example of cities leading to provide a social safety net for the community. So I appreciate that. I also love that there's a commitment to rehire the former employees.'",
        "'speaker_9': 'I think that's that's important. So I wanted to lift that up. So thank you for making that commitment. I also want to want to reinforce again, you know, we have nine districts, but this is, you know, occasionally we're able to to look and support a project that may not be in your backyard because you understand that it's'",
        "'speaker_9': 'connection to the broader system. And as it relates to hospitals, emergency rooms, they are a vital component to our emergency response systems. And so adding this or making sure that we have that resource in that area, that helps to smooth out response times across the city.'",
        "'speaker_9': 'And so this is certainly a citywide investment the entire city council should be focused on. And so I do support that. It's also opened up a broader conversation about and Councilman Longo mentioned the community paramedics, an idea or conversation that that will have at council.'",
        "'speaker_9': 'But I think if you think about, you know, East Long Beach and where the emergency room is and you put up, you know, you grab a map, we actually have quite a few hospitals where a city our size, but where they are, they're all sort of clustered in a certain area of town.'",
        "'speaker_9': 'And if you think about Islam Beach, this is critical. They're in Norfolk Beach. We both have access to we have access to Long Beach Memorial. But also Lakewood Regional is is directly on the border of Long Beach on on South and Downey.'",
        "'speaker_9': 'And so we are our emergency responders, our first responders. They transport folks there. But but the need on that side of town maybe, say, urgent care centers or figuring out how to make sure that we, you know, leverage our economic development department or developments across town to make sure that there's urgent care centers that take a that'",
        "'speaker_9': 'take pressure off of emergency rooms in general. So all of that is sort of come out of this conversation really how do we strengthen our health care network in the city? And so, you know, I have to say, Councilman Super now, this was a crisis that happened, you know, within, you know, to, you know, within two years'",
        "'speaker_9': 'you were able to really rally and get the community together and unify the council. And so that that really is a compliment to you and your leadership and your style of leadership, where everyone really felt inspired to get involved and contribute in any way that we could.'",
        "'speaker_9': 'And so congratulations to you. And I know that there's been a lot of credit given a staff, but I got to say, this was amazing work. I've seen a crisis or two in our city, but the way that the team really formed ranks and and delivered brought us to this position a very different place than where we'",
        "'speaker_9': 'were and in a place where we've we're comfortable with this agreement. And now it's in the hands of other agencies to execute this plan. I think that's that's really strong. And so I want to just congratulate and lift up staff once again.'",
        "'speaker_9': 'Thanks a lot.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'You know, I always queue up late and so I don't know that I can say much more than that has already been said. But thank you. And I know that the public doesn't want to hear me to say how much we appreciate staff, but we do appreciate the staff and their work on this.'",
        "'speaker_7': 'It has been pretty, pretty amazing to talk to witness. And as a councilmember, Richardson mentioned, this this deal, so to speak, has evolved and evolved and evolved. There's been dozens of meetings and back and forth negotiations, closed sessions with the city council.'",
        "'speaker_7': 'But the political will and the will of our private partners nwn to get us to this place has been unwavering. I want to just mention that there are some risk here and let's not be sugarcoat this and recognize that there are shared risk.'",
        "'speaker_7': 'There's shared risks from the private partners when there's risk from the city here. This is a huge commitment. There's a risk from the community. Our the fate of our emergency health care response system is is really, really weighing on on and on this deal to happen.'",
        "'speaker_7': 'We we need to ensure that we have that those are services on the east side of our city. And if it's not, there does impact the entire city's response system. And so I am super supportive of this. I want to elaborate on on one point in our staff to to please walk us through the public, through what'",
        "'speaker_7': 'still needs to happen, particularly from the Sacramento legislative standpoint, to make this deal work. And so the city manager. Can you please address that?'",
        "'speaker_3': 'Sure. Mayor, members of the city council. So the first thing that we need to do is work with NWN and CDPQ to get the hospital license approved for NWN so that it is taken off the hands of memorial slots.'",
        "'speaker_3': 'Step one, step two. After that. And when that process there is there are a number of steps that need to happen. The forms, of course, but also the surveys. City does come out and do a site visit so that they see the appropriate number of beds are there, the appropriate equipment that the site does and will support'",
        "'speaker_3': '. The eight basic services that are required of every acute care hospital in California concurrently will also be working with occupied on an extension for size. That compliance that may involve the state legislature as well, but certainly occupied as a state agency that administers that type of work.'",
        "'speaker_3': 'And so Oscar Orsi and his team, along with Perkins and Will and the Molina team as well, have been working together to devise a site plan that will meet president compliance and support a functioning and sustainable hospital long term.'",
        "'speaker_3': 'Those are two primary goals that we need to achieve in the next, I would say, month or so. And so this project has in a couple of months in the making a little over a year, but we have been working very diligently every single day and every moment has counted.'",
        "'speaker_3': 'So I would say that those two are critical steps. If we don't meet those deadlines, then we've got a problem. But I am confident that we will. And so with that, I think I'll leave it there before we get too much further ahead of ourselves.'",
        "'speaker_7': 'Well, I just want to take this opportunity. Miss Diana Tang, I want to thank you for your excellent work in inter-governmental relations, not just in Sacramento, but also with the county and all of our public agencies to really get us to the place that we are.'",
        "'speaker_7': 'And of course, the action taken this evening by the city council is a continuation, is just gives the authority for us to keep moving this this this process forward. But understanding that there's still a lot of moving pieces that that need to still happen to make it happen.'",
        "'speaker_7': 'And obviously, the city council, the will is behind it to to to support our staff and doing some great work. And obviously whatever we can do to do that, to make it happen as well. And again, I want to extend our congratulations and thank you, super councilmember super and offer your leadership and Councilmember Price standing up for'",
        "'speaker_7': 'your communities. And then the workers out here who took time out to be here, that the wonderful folks of Sienna, the nurses who have also been a very good partner in keeping this issue front and center throughout this entire time.'",
        "'speaker_7': 'And, of course, the foundation board from community hospital. Let's continue to to do what we need to do to make this deal happen. You have my full support.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_2': 'Yes. I think a lot of what I was going to say has been said before as well. But I will just reiterate as well that, you know, this was a very mindful approach and we became solution providers. It was all of us together really, really doing this.'",
        "'speaker_2': 'And I, too, want to thank my colleagues, council members, Supervisor Price and. Go for really putting their efforts together to ensure that this was really looked at as a city wide approach. And we also thank M.W. when we are familiar faces with decades of experience here in our city.'",
        "'speaker_2': 'So it was for me personally as a councilmember here in downtown, it was really I felt confident going into this approach. And I think that our public, our constituents will do the same thing. And to Sienna as well, I know it's always scary when jobs are kind of on the line and having the opportunity to have those'",
        "'speaker_2': 'back is really fascinating, especially as as the state level. We're talking about cover, you know, universal health coverage, access to health care, and those discussions will continue to just burden the system. We need to have access here in our city, in Long Beach.'",
        "'speaker_2': 'And I just want to say overall, thank you to everybody to staff as well for their commitment to seeing this through. I think we've done a really great job tonight, and I look forward to seeing the state's results and look forward to having a great ending to all of this.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Superdome.'",
        "'speaker_9': 'Thank you. I'll wrap up by thanking staff. Yeah, actually, I want to mention a couple of people because Councilman Mongo talked about me responding all hours a day. I'd just like to mention that Diana Tang, our manager of government affairs, has that same quality answered.'",
        "'speaker_9': 'A lot of questions for me, and I'm sure the partners and everyone else at various times ask her or see our Deputy Director of Development Services. Thank you, Oscar, for getting us to this point. And the tough part when I think of Oscar's job is so much of the heavy lifting is yet to come, so save your'",
        "'speaker_9': 'energy. I also want to mention Charlie Parker and staff. Speaking of the heavy lifting yet to come, Rich Anthony has done an incredible job, but he has the task ahead of him, too. So we we wish him well with that.'",
        "'speaker_9': 'One staff member who hasn't been mentioned is my own staff, Barbara moore, who's sitting. So for those of you who don't know, this all started with a preliminary architectural study that our office funded. We came up those funds through operating efficiencies.'",
        "'speaker_9': 'That is our off council office operating budget. So we had to cut back. We had to run very lean and mean, and we couldn't have done that without. Barbara moore And she it's so tough to run a council office.'",
        "'speaker_9': 'And along with that, she puts out a world class newsletter every Friday. And I think in that we had 65 or so community hospital updates in that time that everyone really appreciate. So, Barbara, thank you for all your hard work.'",
        "'speaker_9': 'And then I want to get to John Keisler, because this is just a monumental task. He's taken on someone once put online that words the effect of, hey, if if Darryl and John pull this off, they should build a statue for them.'",
        "'speaker_9': 'It's like we were co-equal partners. So let me put that in perspective. If I got a lapel pin for this effort, John Keisler should get recognition the size of Mount Rushmore. And I guess I can't say enough about what he's done.'",
        "'speaker_9': 'He's always cool under fire, and there's plenty of fire on this one. But what I think is so remarkable is he wasn't a hospital expert when this all started, and I wasn't either. But if you asked him today, what are the eight components of an acute care hospital without looking at notes, he would say, of course, that's'",
        "'speaker_9': 'medical, it's nursing, it's surgical, it's anesthesia, it's laboratory. Let's say it's pharmacy and dietary services. Right, John. Okay. And I see another. Well, I'll leave it at that. Anyway, I'd also like to thank Mayor Garcia. It's especially quality of leader who lets the staff do their thing.'",
        "'speaker_9': 'And lets them excel and do the very best and come in right at the right moment to make it all happen. So that's a real unique quality, a very great quality and a leader. And we appreciate that. And finally, John Molina, thank you for stepping up.'",
        "'speaker_9': 'And if there's anyone who saved community hospital is John Molina. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. And to wrap us up, Vice Mayor.'",
        "'speaker_8': 'Yes, thank you very much. You know, after listening to all our speakers behind the diocese here, it really at one time, even in closed session, I thought this was just a done deal. And then again, I thought, this is a no brainer.'",
        "'speaker_8': 'And then all of a sudden I said, What are we speaking about? And then it just got bigger and bigger and bigger. But now it seems like this thing is getting ready to come to fruition because the fact that great people have great people just like great minds.'",
        "'speaker_8': 'Mr. Merlino, you and your staff, and especially Mr. Superman, Mrs. Price and Mrs. Mongo, these individuals, they won't let anything get past them. So I just know that it was going to this is going to work. It had to work.'",
        "'speaker_8': 'And with Pat, you know, staying honest in a mayor's dinners, you guys and the young ladies who your jobs are coming back, I guarantee you that there is no way that it won't come back, because if this doesn't go through, we probably won't have a consummate career anymore.'",
        "'speaker_8': 'So I'm pushing very hard for this. I want to thank everyone who got behind this and really making this a really a true, true. Mr. Merlino I just can't tell how much it's you when you get you just like E.F. Hutton.'",
        "'speaker_8': 'Boy, when you speak, everybody listens. So I want to let you know that you guys are doing a great job. Keep it up and I know we're going to get this hospital open. And guy, Mr. Super now not going to ask you about I'm sick or not you know all these good health care and okay.'",
        "'speaker_8': 'But I feel good tonight. Thank you guys very much. Let's get this hospital open. Thank you.'",
        "'speaker_0': 'Thank you very much. And members, please go ahead and cast your votes on the motion by a count from the supernova and Councilwoman Price. With the with the friendly that was accepted.'",
        "'speaker_10': 'Motion carries.'",
        "'speaker_0': 'Thank you.'"
    ],
    "Feasibility Study for a Gondola System between Downtown and Queen Mary Island.": [
        "'speaker_8': 'Next, we'll go to item 15 with the clerk. Please read the item.'",
        "'speaker_7': 'Communication from Councilmember Pierce, Councilwoman Gonzales. Councilwoman Price, Councilmember Richardson. Recommendations are to determine the costs of a feasibility study pertaining to the development.'",
        "'speaker_8': 'Of a gondola system.'",
        "'speaker_10': 'Connecting downtown Long Beach with Queen Mary Island, and to create a multi party partnership to conduct an initial.'",
        "'speaker_7': 'Feasibility study and identify potential public and private funding sources.'",
        "'speaker_8': 'Yes. County Councilwoman Pierce.'",
        "'speaker_3': 'If we could wait for everybody to clear. So we can hear. That would be awesome. Okay. I thank you. And I want to say thank you to the city. I wanted to say thank you to the mayor for putting together the Queen Mary Development Task Force.'",
        "'speaker_3': 'Several years ago, I was a 12 person task force that really worked to vision what we might do at the Queen Mary and what urban commons might do during their their lease there. One of the concepts that came up was doing an aerial tram and to some it seems like pie in the sky.'",
        "'speaker_3': 'If we're going to be punny tonight. I'll go there. We know that dreaming big is something that's really important. And we know that this is a creative idea that other cities like San Diego, L.A., are really exploring and taking seriously.'",
        "'speaker_3': 'I've had many conversations with urban commons, with other stakeholders, with the port that say that they are interested in seeing if this is feasible. And I know we already have a feasibility study. That was a very quick one, a phase one.'",
        "'speaker_3': 'And what this item would do is basically have our city staff work with all the stakeholders to identify funds to go forward with the second feasibility study. And so I want to say thank you to Tom Modica for working with us on this item and making sure that, again, this isn't a commitment that the city is going'",
        "'speaker_3': 'to spend city dollars on this, but this is about visioning and doing this prep work that really allows urban commons to come in and develop something that works for the city, works with our waterfront and works with our residents.'",
        "'speaker_3': 'And so I want to thank all the stakeholders that have participated so far and thank my council colleagues for signing on to this item. I think it's fun to dream a little bit and see what we can get to.'",
        "'speaker_3': 'So I'm curious to hear from public comment. I know we have some people here in the audience and then hear from our council colleagues.'",
        "'speaker_8': 'Fine. Thank you. Councilwoman Lena Gonzalez.'",
        "'speaker_2': 'We can bring the public up.'",
        "'speaker_8': 'Okay, fine. However, the public comment on this item, which you please come up.'",
        "'speaker_9': 'First off, I.'",
        "'speaker_7': 'Appreciate that we have an opportunity of being in front of eventually in front of the mayor, the honorable mayor and members of the city council. Um.'",
        "'speaker_10': 'It has been a long time coming. My name is Alex Bellemare.'",
        "'speaker_7': 'My address is 6242 Napoli Court, Long Beach.'",
        "'speaker_9': 'And I am.'",
        "'speaker_7': 'President of the statewide developers and the initiator of the wave, which is the aerial tram. Which, by the way, began at the.'",
        "'speaker_10': 'Last.'",
        "'speaker_7': 'Portion of 1990. So that'll give you some idea how length shows.'",
        "'speaker_10': 'Everything is a matter of timing. Now as a little bit of the history. The way back.'",
        "'speaker_7': 'When we were approved by the council, the town council, to proceed with our project and everything was going fine.'",
        "'speaker_10': 'Except it evolved our financial our finances. That is, on a country level.'",
        "'speaker_7': 'Turned into a very, very deep recession. And at that point in time, the city.'",
        "'speaker_10': 'Was no longer.'",
        "'speaker_7': 'In a position financially for them to have.'",
        "'speaker_10': 'Their staff.'",
        "'speaker_7': 'Work with us, and we had to put the project on the shelf. Subsequent to that, we began working with the the Queen Mary people.'",
        "'speaker_10': 'And others to the extent where we raised funds, substantial front funds, that would have taken us well into the project and just about ready to go.'",
        "'speaker_7': 'And the Queen Mary, as you painfully remember.'",
        "'speaker_10': 'Had financial problems. So once again, we had to.'",
        "'speaker_7': 'Put the project on the on the.'",
        "'speaker_10': 'Agenda or I'm sorry, on the on on hold. It is painful, but fortunately it caused this.'",
        "'speaker_7': 'Project to be delayed.'",
        "'speaker_10': 'Until now and with the financial finances nationally.'",
        "'speaker_7': 'And and our.'",
        "'speaker_10': 'Thanks to all of your work here. The city of Long.'",
        "'speaker_7': 'Beach and many other factors. And we are at this point ready to take advantage of the other time. You might say that the third the third time.'",
        "'speaker_10': 'Is.'",
        "'speaker_9': 'Really the charm. Now.'",
        "'speaker_7': 'Because of my age, which is like 84 at this point, I realized that my steam.'",
        "'speaker_9': 'Has pretty well evaporated.'",
        "'speaker_7': 'To the extent where I need.'",
        "'speaker_10': 'To have, uh, someone to fill in.'",
        "'speaker_7': 'The.'",
        "'speaker_10': 'Leadership role.'",
        "'speaker_7': 'And carry most of the, of the, the challenge here.'",
        "'speaker_10': 'And that individual is standing next to me.'",
        "'speaker_7': 'Clay Sandwich I believe that most of you know Clay.'",
        "'speaker_10': 'He is an incredible business person, a tremendous.'",
        "'speaker_7': 'Communicator, and a kind of.'",
        "'speaker_10': 'A guy that once he puts his teeth in something, he will not let it go.'",
        "'speaker_7': 'So with that and what let me first say to our council lady here, thank you so much. I'm going to turn that over to the co-developer clay.'",
        "'speaker_9': 'Sandwich at this point in time. Thank you all very much.'",
        "'speaker_10': 'Thank you, Alex. Mayor. Mr. Mayor, where you are? City Council. Thank you very much. I'd just like to take a very brief moment to identify my team. That's a world class team that we've assembled to really take this project and really look at it.'",
        "'speaker_10': 'Alex has been on this for over 15 years. I've been involved with it for about six. But we have assembled a world class team representing WSP is Cliff Hankey here in the audience. WSP is a global firm representing about 30,030 7000 employees.'",
        "'speaker_10': 'I've got our Moros. Our project advisor is a former executive director or acting executive director and retired from Port of Long Beach. I've got Robert ATA Lino, who is not here with us tonight. We also have Dapo Meyer Gary event, who is the largest gondola manufacturer in the world and probably has more ropeway tramway systems installed in'",
        "'speaker_10': 'in the world than anybody. So we do have a world class team that can really evaluate what the right options are for connecting the downtown to the to the waterfront. And I just want to say thank you to the mayor and the City Council for consideration of requesting staff to assist in identifying funding for the feasibility study'",
        "'speaker_10': 'and benefit cost analysis of the aerial tram people people mover system. Our tram folks look forward to working with all stakeholders in establishing the basis and feasibility of an aerial tram system. So thank you all very much for your time tonight.'",
        "'speaker_8': 'Thank you. Thank you very much. Mrs. Gonzalez likes like this.'",
        "'speaker_2': 'I think this is great. And I think, Councilmember Pearce, for bringing this forward with Alex and with everyone, because I really do think that this is the prime time in downtown being the other half of downtown to really.'",
        "'speaker_2': 'Start exploring these great ideas and really providing different avenues for transportation. I've heard my residents talk about this quite a bit, and I know that Austin, Brooklyn, Chicago are also exploring various ideas. And so where we have to tell ourselves that we're a small city, but we're actually a really big city, and so we should absolutely think'",
        "'speaker_2': 'big as well. And I would only include and I know this was a very loose request to study, but I would also include any commissioners specific to our economic development, which I'm sure that they will be included, but everyone should be at the table to be able to explore how great this could be potentially for our city'",
        "'speaker_2': '. And I think urban comments as well for coming to the table and being a part of this. Thank you.'",
        "'speaker_8': 'Thank you, Congressman Austin.'",
        "'speaker_7': 'Oh, thank you. Um, you know, I love when we can dream and this is when I heard about this, this idea that was one that was very intriguing to me and one that is very intriguing to me because I've been to many cities, many downtowns that actually have amenities.'",
        "'speaker_7': 'And I think this would definitely add to the character of our downtown. Specifically, the item is requesting that the stakeholders or the city manager work with stakeholders to determine the fees cost of a feasibility study. And to my city manager, I had a question regarding where and how such a feasibility study would be funded if you have'",
        "'speaker_7': 'an idea if there is a fund available to do so.'",
        "'speaker_8': 'Thank you, Mr. Austin, and members of the Council. So there is already some work underway and Councilmember Pearce alluded to it. So Urban Commons is in the middle of putting together their development proposal for the 54 acres across the bay and as part of their master development they are looking at all possibilities for getting people over to'",
        "'speaker_8': 'the site as part of their Sequoia. So they are already looking at this. They have started some technical feasibility work just to see is it technically feasible. And what they've let us know is they want you know, that next step would really be kind of feasibility of of neo of a system.'",
        "'speaker_8': 'Where would it go? Who could maybe be included? And they wanted to take a break and say there's some other partners that might want to participate in in making that a broader study. So it really is urban commons is the lead.'",
        "'speaker_8': 'It would be their study. And we will pull together people to see who might be interested in helping to fund some of this. We expect it to be maybe about 100,000 in the beginning, but will determine that. And if the city were to participate, it might be some transportation dollars in a very low amount.'",
        "'speaker_8': 'But we haven't made that determination yet too. We all going get together great.'",
        "'speaker_7': 'Well, that helps clarify one of the questions that that a constituent posed to me a little earlier, like, well, how do we pay for such a feasibility study? And I was curious, is the talent fund available to do this type of study?'",
        "'speaker_8': 'Potentially, it could be Prop eight transit, it could be some tidelands. Again, it's a pretty minor dollar amount at this point. If this were to become a full on city project, we a project wouldn't be a city project to be you see, obviously we would be looking for grants in metro and those larger amounts of dollars to'",
        "'speaker_8': 'support.'",
        "'speaker_7': 'Okay. So it doesn't sound like this is a general fund burden and there might be some some other opportunities, is that correct?'",
        "'speaker_8': 'I would not imagine that we would ask for a general fund for this. No.'",
        "'speaker_7': 'Great. Well, but that said, I'm happy to support this moving forward.'",
        "'speaker_8': 'Thank you, Councilwoman Mongeau.'",
        "'speaker_3': 'I appreciate my budget oversight committee vice chair or member and their questions. They answered exactly what my questions were. Thank you.'",
        "'speaker_8': 'Thank you. Councilman Pearce, you want to go at this again? Councilman Parrish.'",
        "'speaker_2': 'Councilwoman Price all the time. We look so much alike.'",
        "'speaker_8': 'And it's the p, the Persians.'",
        "'speaker_2': 'Okay, um, so this is a great idea. I want to thank Clay and Alex. They did brief me on this a few months ago, and I think it's definitely an idea worth exploring. And I look forward to the opportunity to learn more about it and discuss the feasibility.'",
        "'speaker_2': 'I do think it's a really good effort when we're talking about mobility and the difficulty in going over to the Queen Mary and some of the congestion that we experience and we will continue to experience as hopefully the Queen Mary thrives with programing and that entire area over there is rehabilitated and thrive.'",
        "'speaker_2': 'So I look forward to this. I think, Councilmember Pearce, for bringing this item forward and I look forward to hearing the results.'",
        "'speaker_8': 'Thank you, Councilman Richardson.'",
        "'speaker_9': 'Thanks, Vice Mayor. So, like, I like the idea. I think it's going to be essential if, you know, Queen Mary is going to be developed. We're going to have to figure out how to get people over that over that harbor.'",
        "'speaker_9': 'Whatever it is, we're going to have to figure that out because it's difficult to get over there. And, you know, and it myself, you know, I've used that the water taxi, both the water taxi and the Aqua Link, I've used them both and they're really cool.'",
        "'speaker_9': 'But I feel like they like the experience of getting on a boat is really what what folks use that for. And I think, you know, having something like a gondola, people are going to ride it for the experience of riding a gondola.'",
        "'speaker_9': 'Right. And it's going to actually transport people. And I think it's really cool that, you know, they're thinking the same thing in Dodger Stadium from from Union Station. So I think timing is timing is important. I was in Seattle I was in Seattle this weekend on the Space Needle.'",
        "'speaker_9': 'And they have an area where they talk about the history. I think what's really interesting is it accounts for every little step along the way. So it says right here, June 2nd, 1961, they number 47 of the project.'",
        "'speaker_9': 'Seattle Building Superintendent asks City Council for permits permits to allow the needle's construction. So all these little when we think big we may not know how far is going to go, but all these little roles that we play, they all, you know, contribute to the identity of our city.'",
        "'speaker_9': 'You know, you think of Saint Louis, you think of the arch. You think of, you know, Seattle. You think of the Space Needle in Long Beach is going to be the Queen Mary in the port of Long Beach.'",
        "'speaker_9': 'And so the more investment we can make into gondolas and things like that, I think are great. So I'm happy to be in support of this design. And thank you, Councilwoman Pierce.'",
        "'speaker_0': 'Thank you. Councilman Pierce.'",
        "'speaker_3': 'Two things. One is I wanted to just recognize and thank the people that sent letters in IBEW, Leo's Building Trades, Urban Commons and John Thomas from our Queen Mary Task Force today. So we received those. I did have a question for Mr. Modica on timing.'",
        "'speaker_3': 'I know we've been talking about this for a little while. Just if you could clarify what the next step would be.'",
        "'speaker_10': 'So if this were to go forward.'",
        "'speaker_8': 'Which it seems like it is, we would be working with urban commons to pull together the stakeholders. So really, you know, this is their project. They are in the middle of their entitlement process for that site and they need, you know, to submit a plan for mobility of which they right now they believe the gondola would be'",
        "'speaker_8': 'part of it or a different alternative that would do a similar function. So we would pull them together and have them help identify some of the stakeholders. You've identified some of them here and then start talking about, you know, what the cost could be, whether there's an appetite for investing.'",
        "'speaker_8': 'And then we imagine coming back with a report and we'll let you know what we would recommend for for a city contribution and if there was one, and how we would pay for that.'",
        "'speaker_3': 'Thank you and thank all my council colleagues for their support.'",
        "'speaker_0': 'Thank you. I just want to I'm glad I made it before the item was was ending. But I want to just say that I completely support the study and the concept of the gondola connection. And, Mr. BOLLYKY, you've been at this for a very long time.'",
        "'speaker_0': 'I remember the first time we sat down and you told me about your your vision for connecting the downtown and in different ways. And this was, I think, even before I was on the city council. And I just want to just say that I think your persistence and your ability to look to look towards the future is'",
        "'speaker_0': 'really served this project well in the team. You have a great group of folks working with you, and so I'm very supportive of the feasibility study. I have been supportive of this concept as it's been, you know, kind of been back and forth in different iterations over the years.'",
        "'speaker_0': 'But I think it's a it's a great way of connecting the the pieces of Long Beach that need greater connection and greater transit opportunities. This was mentioned, I heard over the Speaker in the back. Mr. MODICA You had mentioned Metro and I want to just re-emphasize that once we get past the feasibility stage and hopefully get to'",
        "'speaker_0': 'an actual project that we can look to or agencies like Metro for significant partnership. Metro right now is looking at investing in a aerial gondola system that could connect Dodger Stadium, you know, to other parts of of the ravine.'",
        "'speaker_0': 'It's looked at looking at possibly a gondola system that would connect the Hollywood sign down to two visitors. So there's a lot of conversation around different types of transit. And in my view, this isn't just an innovative project.'",
        "'speaker_0': 'This is a transit project. And any way that we can invest in public transit and bring in partners that are doing that work I think is really important. And so I look forward to the conversation and I look forward to bringing this project forward to the Metro Board when when we're ready to do so.'",
        "'speaker_0': 'And so. Thank you to Councilmember Pearce and everyone that supportive of this. And I look forward to to continuing to support it. And with that I think they did public comment already members going and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. We have public comment. Let me. We have. Two categories of folks. Let me start with with is is Latoya marshall here and Trymaine Deanna Ellis. And then Larry Goodhew will be next. Actually, Mr. Good to be there first and then you'll be the third.'"
    ],
    "Grant Application and Acceptance for Stormwater Treatment Facility.": [
        "'speaker_0': 'Thank you, Miss Kareem. Thank you, sir. Thank you. That concludes public comment. We are going moving on to item 16, please.'",
        "'speaker_1': 'Report from Public Works recommendation to adopt a resolution authorizing the city manager to submit a grant application to the California Ocean Protection Council for the Long Beach Municipal, Urban Stormwater Treatment Recycle Facility and Accept, said Grant if awarded in an amount up to $2 million.'",
        "'speaker_1': 'Districts one, seven, eight and nine.'",
        "'speaker_0': 'Thank you. Is there before we go to this. Is there a staff report on this?'",
        "'speaker_5': 'A brief staff report by Mr. Craig Beck.'",
        "'speaker_0': 'Its main rumors. City Council. Thank you for this opportunity to present this item. We are excited about the Long Beach Mass project and to remind the audience it's a project that would clean our stormwater runoff before it goes into the L.A. River.'",
        "'speaker_0': 'We are in design plans for that project, and part of the work includes the creation of some wetlands adjacent to the property. We are hopeful we could be successful with this grand opportunity to help build out the wetlands as planned.'",
        "'speaker_0': 'That concludes the staff report and I'm available to answer any questions.'",
        "'speaker_2': 'Tom Gonzalez Just want to say thanks, Craig. I know you and your team have been on this and we're very excited. We talk about it at multiple community meetings and we look forward to seeing this through. Now, what timeline do we can we foresee for the grant if we do receive it?'",
        "'speaker_0': 'The application submittal package is due in a couple of weeks, so we're hopeful we can get action tonight and we should hear within the next 90 days.'",
        "'speaker_2': 'Great. Thank you so much.'",
        "'speaker_0': 'Thank you. Councilman Austin.'",
        "'speaker_7': 'I second the motion of grants are good.'",
        "'speaker_0': 'Any comments on the grant? Seeing non-police casseroles.'",
        "'speaker_4': 'Connect.'"
    ],
    "Contracts for As-Needed Concrete Repairs and Related Improvements.": [
        "'speaker_0': 'Motion case.'",
        "'speaker_1': 'Item 17 Report from Public Works Recommendation to award three contracts for as needed concrete repairs and related improvements in an aggregate amount not to exceed 30 million citywide.'",
        "'speaker_0': 'There's a motion and a second. Councilman Austin.'",
        "'speaker_7': 'So I'd like to get a quick staff report. Sure.'",
        "'speaker_0': 'Let's get a staff report, please.'",
        "'speaker_5': 'Craig Beck?'",
        "'speaker_0': 'Yes, ma'am. As city council, this continues our contracting work to allow us to deliver ADA projects. If you recall earlier, we actually late in 2018, in December, there was another item that came forward related to city curb ramps.'",
        "'speaker_0': 'And at the time, staff made a recommendation that we award to two contractors. That was C.J. Construction and Caliban. That contract specifically addresses new ADA ramps that need to be installed throughout the city. This particular item before you this evening is for sidewalk repair.'",
        "'speaker_0': 'And if if you recall, the city did agree to a settlement with under a class action lawsuit to allow us to prioritize different ADA work across the city. Part of that settlement agreement also included conducting a self-assessment. You may or may not have had an opportunity.'",
        "'speaker_0': 'We we do have a draft self-assessment out in it. It's starting to articulate in detail where we have deficiencies citywide. So we do have a lot of work before us. I know one issue had come up before about one of the contractors on this list, and that is C.J. Construction and the questions related around local hiring.'",
        "'speaker_0': 'This particular contract was not bid under any of our play guidelines that we have for many of our projects. But we did connect with all three of the vendors listed here and asked for them to commit to working with our workforce development team for any new hires.'",
        "'speaker_0': 'So the new hires that they they would bring on board related to these construction projects would come through our workforce development team. And as you know, they're integral in the pre apprentice work that we're doing in our city with our residents who are interested in entering into the building trades.'",
        "'speaker_0': 'That concludes my report and I'm available to answer any questions. Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. And I certainly understand the need to turn to work contracts to meet our needs for for sidewalk repairs in response to litigation as well. You know, I don't recall it being as much as $30 million, though.'",
        "'speaker_7': 'Is that is that new?'",
        "'speaker_0': 'I think what staff's trying to articulate is it could be upwards of $30 million worth of work. When you look at some of the street projects that we have in a five year term.'",
        "'speaker_7': 'And this is over a three year period.'",
        "'speaker_0': 'Three year +21 renewals.'",
        "'speaker_7': 'Okay. And in in relation to the your comments regarding the the the local hiring and hiring practices of the contractors, it does I am encouraged that that that we're being proactive in moving forth with the workforce in this meant for to to work with these contractors to provide them with a good candidate pool of.'",
        "'speaker_7': 'Of individuals who they can hire. I just would always emphasize that that that candidate pool be reflective of the diversity of the city. And, you know, I love to. I'm looking forward to getting some data back on on the place that we've also entered into over the last few years, just to see how how those those hiring'",
        "'speaker_7': 'practices are working out. But those are my comments for now. I salute.'",
        "'speaker_0': 'Thank you. A vice mayor.'",
        "'speaker_8': 'Yes. I just like to connect the sentiments that the council asked them speaking about, especially on local hiring. I think that's extremely important, especially in this day and time. And thank you. And I second that motion.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Gonzales.'",
        "'speaker_2': 'Yes. Thank you for the report. I know that there was a two. And thank you for addressing the issue with compliance, because that was going to be my my question. But I do know that there is from the two from four that was sent out a few weeks ago, there was still a pending issue.'",
        "'speaker_2': 'Do we know if that's been resolved at all? It looked like there were four or five issues outside of the city and four of them had been resolved and one of them had not been resolved.'",
        "'speaker_0': 'Councilmember Gonzales, the the last issue, from what I understand in our conversations with C.J. Construction last week, is they are close to a settlement, but it is not finalized yet.'",
        "'speaker_2': 'And is this regarding apprenticeships? Can you explain that a little bit? So we have a full understanding of what this.'",
        "'speaker_0': 'Yes. So just in general, all of the contracts that we work with on construction projects are required to pay state prevailing wage. And underneath that state prevailing wage guideline, there are opportunities for apprenticeship placements. And so that's really where we see a lot of local hiring happen.'",
        "'speaker_0': 'So when you're able to get folks who are interested in getting into the building trades, they typically start as apprentices. And so those apprentice opportunities exist on on every job I believe in. I'm trying to remember that this city that they were having some challenges in one of the cities up up the 17 freeway.'",
        "'speaker_0': 'From what we understand from the data, we were able to collect that they did hire some apprentices, but they they didn't pay them. The right wage passed a certain number of hours. Apparently, if an apprentice works beyond a certain number of hours and I apologize, they don't have those hours in front of me, but then you have'",
        "'speaker_0': 'to pay them at a different rate. So a journey level rate and the CGA construction did not pay the journey level rates for some of those hours beyond that minimum threshold.'",
        "'speaker_2': 'Okay. And you had mentioned about this not being included under our play. Is that correct?'",
        "'speaker_0': 'Yes, that is correct.'",
        "'speaker_2': 'Because it's all. But it's 30 million. Correct. So is it can can you explain that? I'm just trying to get that clear in my head as to why this.'",
        "'speaker_0': 'We are so were these are on call services. And so really what we're asking for is the authority to spend up to $30 million on multiple projects. And typically when a scope of work is developed, it's small segments of sidewalks.'",
        "'speaker_0': 'So for example, in the first District, I think there's ten or so different sites that are being worked on right now. And the cumulative amount of of that site work is less than the $500,000 threshold that we have for a play contract.'",
        "'speaker_0': 'So it doesn't meet that minimum threshold for the play agreement.'",
        "'speaker_2': 'Okay. I kind of have an issue with that just because I think that we are you know, I know that we this the limit is up to the 30 million. We may not get to that 30 million, but I still think that it should be covered overall because it's the same sort of services for the same contract'",
        "'speaker_2': '. So I with that, I think I would love to see and I know that we're going to be taking up the project labor agreement 2.0 and do we know when that will be coming back to council? I know it was supposed to come back this month and it's not.'",
        "'speaker_8': 'We're looking at early to mid April. So with the we have a number of very large items coming your way in December. In March and April. And so April it will be.'",
        "'speaker_2': 'Okay. I would prefer to have seen this. After that we established all of the new kind of rules or any other discussion we had on the play first before we saw this new contract. Just because I think and I know that it's timely, but we also just approved another 30 million, almost close to 30 million back in'",
        "'speaker_2': 'October for the same contractor. So I think at this time, I may be voting no. Just wanted to let you know that. But I appreciate the information and I think it'd be good to know this information as to the lawsuits and additional information about contractors that are not playing well, even if it's not in our own city'",
        "'speaker_2': '. But thank you.'",
        "'speaker_0': 'So I do want to clarify that this is $30 million over a potentially five year period of time. So we're we're essentially talking about $6 million annually split, but three between three contractors. So I want to make sure that everyone understands it's not $30 million for one vendor, but it would be split.'",
        "'speaker_2': 'Between three contractors. Yes. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Councilmember Pierce.'",
        "'speaker_3': 'Thank you. And I want to thank Councilmember Gonzalez for raising this issue for me. And I have a I guess, a couple of thoughts. One is, yes, that we have a play policy. I know that we're overhauling or not overhauling.'",
        "'speaker_3': 'That is definitely the wrong choice of words that you guys are bringing back a report on the play and that there are some conversations around how do we make sure that we strengthen that pipeline. And so I know that when those conversations come forward, there will be more conversations about how we work with good contractors.'",
        "'speaker_3': 'And so I would like what I hate is being up here on the dais and finding out right before we're about to vote that we have a contractor in front of us that doesn't have the best practices and history and that they're in the middle of settlement agreements around labor practices.'",
        "'speaker_3': 'So I don't want that to continue to happen. So I'm just saying that on record so that we can work on that in the future. I agree that if we're going to spend $30,000, even though it's different 30 million sorry projects, even though it's different projects and three different contractors, that if we as a city are saying'",
        "'speaker_3': 'that we care about having our residents get into good jobs, that we need to use every opportunity that we can, even if it's not a requirement. So I'll be working with your office and with economic development just to continue that conversation so that we don't find ourselves in that situation again.'",
        "'speaker_3': 'Is there a timeline crunch on this? Is there a need for you guys to have this vote today?'",
        "'speaker_0': 'Yes, Councilmember. Currently we don't have a contract in place for any ADA sidewalk work.'",
        "'speaker_3': 'We don't have a contract place. When would this work begin?'",
        "'speaker_0': 'With approval tonight. We would move forward, finalizing these contracts and have these in place. I would imagine in the next 2 to 3 weeks.'",
        "'speaker_3': 'Can we continue it for another week?'",
        "'speaker_0': 'Mr. Beck, could it be continued for a week? My recommendation is we move this forward. I'm not sure what changes in a week.'",
        "'speaker_3': 'Well, at least I'll have some time to understand more about this contractor and work with you and your office to see what practices we're putting into place to make sure that we don't have another you know, that they don't have more lawsuits on their hands on one of our projects.'",
        "'speaker_0': 'So you're up.'",
        "'speaker_5': 'There is a two from four regarding this contractor specifically that went out about a month ago or maybe two months ago, and that has all that information. So. I don't think there were anything new based on the 2.4 that went out a month ago.'",
        "'speaker_0': 'And I'm not sure if you haven't had a chance to to read through the two form four memo yet. There were no incidents of any wage issues or labor compliance issues for any of the work that C.J. Construction did in the city of Long Beach.'",
        "'speaker_0': 'We have a very robust labor compliance group here in Long Beach, and we wouldn't be sitting here in front of you making a recommendation, move forward with this contractor. If we didn't believe that this contractor would meet all of its obligations under under this proposed contract.'",
        "'speaker_0': 'So, Mr. West, I think I think the you know, what I'm hearing from from a couple of the members is just obviously, it's a large contract amount. This is you know, this is a it's significant. And so you feel confident and the review that you have made that that this one operator or this one contractor, that we'",
        "'speaker_0': 'should be concerned about the the issues as they relate to labor practices.'",
        "'speaker_5': 'Absolutely. We've had numerous discussions with this contractor, reviewed their history and we feel very comfortable with them.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_7': 'Yes. I think this has been thoughtful. You know, we didn't just just approve this went on without without some thought here on and we still have it. I'm I'm in supportive of moving this forward under with the understanding that that this this contract is awarded and gives some discretion to our city staff to award contracts as needed'",
        "'speaker_7': '2 to 3 different contractors. And so this doesn't necessarily or maybe the question is, does this mean that every contractor is going to get an equal amount of the contract, or will they be contracted as needed as available to to do the work for the city?'",
        "'speaker_0': 'So we have a lot of work that needs to get done. We fully anticipate working all of these contractors to their available resource limits. We're hopeful that we can catch up with some of the delays that we've had in addressing some of our sidewalk issues.'",
        "'speaker_0': 'As I mentioned, we haven't had a sidewalk contract in place since November.'",
        "'speaker_7': 'And what what sort of and if you can answer this is great, but what sort of interaction has already occurred or has any interaction occurred between these contractors and our workforce investment Pacific Gateway to talk about hiring local folks.'",
        "'speaker_0': 'So there has been a pre-meeting with contractors and an introduction to a liaison through our workforce development team and talking about what the pipeline looks like and where those placements can occur.'",
        "'speaker_7': 'And Mr. Beck, is it possible and I know this doesn't fall under the play guidelines that we approved, but is it possible to track the data for the local hiring or those within the Long Beach zip code that actually work for these particular contractors or any of the contractors that we we work with?'",
        "'speaker_0': 'Yes. So one of the requirements when paying prevailing wage is that the contractors must provide something called a certified payroll. And so the certified payroll essentially lists all the members that are on the payroll, on a given job and the rate of pay that that individual received and their address.'",
        "'speaker_0': 'So through the certified payrolls, we would be able to understand who's working on the job and where they live.'",
        "'speaker_7': 'I don't think I've ever seen a report like that. Is it possible to produce something like that for the council? Maybe a year out?'",
        "'speaker_0': 'Yeah. I can show you a copy of a certified payroll. It's not something the city produces. These are things that come from the contractors as part of their prevailing wage requirements. But certainly we receive have the opportunity to review them and we can share those with council if that's council's interest.'",
        "'speaker_7': 'Well, I think that's that's I as part of my motion to accept this, I would love to just just ask that that that kind of information be disclosed to the to the to the council moving forward so that we can have some accountability on the contractors and contracts and understanding that we send a message loud and clear'",
        "'speaker_7': 'that we are serious about Long Beach residents, local folks getting jobs, and particularly ensuring that the workforce is diverse. So I move to support this. With that in mind. Thanks.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_3': 'Um, yes, I wanted to ask two questions. One is, could we move forward with the first two countries, first to contractors that don't have the labor practice violations while we. No. Okay. That's why I saw you for the record.'",
        "'speaker_8': 'I just want to point out that we have to abide by state law for contracting. And C.J. is the low bid, so they are the low bidder. And the other two were added on. So that's the reason why we would not be able to do that.'",
        "'speaker_3': 'Okay. So they are the low bid. Okay. I would like to I know that I just met today with John from Economic Development and his team about the work that they're doing. So I would ask that the work that they're doing inside Pacific Gateway that we just make sure that they're partnering.'",
        "'speaker_3': 'Echo What Councilmember Austin said, that they're partnering and that we do get a chance to look at those numbers and that if there's I think there's future discussion on a good contractor process that we can move forward on.'",
        "'speaker_3': 'So. Thank you.'",
        "'speaker_0': 'I guess maybe to address some of the questions that have come up, I would offer that staff can provide this council and update report at maybe the six month mark to share with you what kind of work has been done and how the contract dollars have been distributed and what the certified payrolls look like.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_0': 'Worth mind. I love those are the solutions for. Did you do that item already? Oh, okay. Okay. Got the one with the little hearts or angry eyes. Okay. Any public comment on this item? Seeing none. There's a motion.'",
        "'speaker_0': 'And second, please cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ]
}