{
    "Ordinance Amending Zoning Regulations for Assembly, Agriculture, Wireless, and Cannabis Uses. ": [
        "'speaker_4': 'Thank you. Next up is the hour. We have two hearings, hearing item 12, please.'",
        "'speaker_0': 'Or from Development Services recommendation to receive supporting documentation into the record, include the public hearing and find the project exempt from secure declare or simply.'",
        "'speaker_4': 'You know what? Madam Clerk, I'm sorry. I think we have a full public speakers. This will go in just to public speakers right now. So, Madam Clerk, if you want to just do the public speakers that we have, I know we've hit our ten limit, so there will be 90 seconds.'",
        "'speaker_4': 'Why don't you go and go through those right now? Thank you. And you can just you could just take those one after the other.'",
        "'speaker_0': 'Thank you. We don't have public comment callers queued up at this time.'",
        "'speaker_4': 'Oh, okay. You're kidding. You're still keeping them up?'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'Okay then please go and cue them up and we'll do the hearings and then it'll be queued up right after that. Okay.'",
        "'speaker_0': 'Thank you. It's a report from Development Services recommendations received supporting documentation and of the record to conclude the public hearing and find the project exempt from secure declared ordinance, amending various sections of Title 21 of the Long Beach Municipal Code.'",
        "'speaker_0': 'Read the first time and lead over to the next regular meeting of City Council for final reading and adopt a resolution to submit the ordinance amendments to the Coastal Commission for Certification Citywide.'",
        "'speaker_4': 'Okay. Go ahead, please.'",
        "'speaker_7': 'Oscar Orsi are development services director there.'",
        "'speaker_1': 'This is Councilwoman Pierce. I'm going to recuse myself from this item for working with from the earth. Thank you.'",
        "'speaker_4': 'Thank you, Mayor. Members of the City Council in accordance with the city's local coastal program, various zoning code amendments were that were approved by the City Council or were submitted to the Coastal Commission for the LCP amendment. The Coastal Commission considered the amendments and took action to approve them, subject to certain modifications.'",
        "'speaker_4': 'Those modifications are minor in nature. They include some type of in some clarifications, adjustments to our tables, allowing for minor deviations from the LCP to comply with the Lupa, as well as some standards for lighting and etc.. That said, staff is requesting that the Council approve the modifications and if approved, the audience will be submitted to the'",
        "'speaker_4': 'Coastal Commission for approval. That concludes my presentations will be more than happy to answer any questions. Okay. Is there any public comment on the hearing?'",
        "'speaker_0': 'There is no public comment on this hearing.'",
        "'speaker_4': 'Okay. Then we'll call it public comment. And can I see a motion to approve a accounts from Ranga? Can I get a second? Can I get a second, please? Okay. Speaking about Councilman Price, unless there's any comment from either the motion or the second or Councilmember Ringa, we'll go ahead and do a roll call vote.'",
        "'speaker_0': 'District one. I district to. District three, I. District four.'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six. Art District seven. I District eight. District nine. High emotion carries.'"
    ],
    "Entertainment Permit with Dancing for The Bungalow Long Beach.": [
        "'speaker_4': 'Okay. Thank you. Next is hearing 13. And Madam Crook, I'll be going right into public comment after this hearing, just so you know. So hearing item 13.'",
        "'speaker_0': 'Report from financial management. Recommendation to receive supporting documentation under the record. Conclude the public hearing and grant an entertainment permit with conditions on the application of the bungalow. Long Beach at 6420 East Pacific Coast Highway number 200 for entertainment with Dancing District three.'",
        "'speaker_0': 'There is an oath required for this, and there are appellants on the line to give testimony.'",
        "'speaker_4': 'Staff.'",
        "'speaker_0': 'Getting Mayor in council. We will have staff from the financial management department to present this this public hearing.'",
        "'speaker_2': 'Monique? I don't know. Did you want to administer the oath now? Before I did my staff report?'",
        "'speaker_0': 'Yes. The applicants on the line.'",
        "'speaker_2': 'Yes. Yes.'",
        "'speaker_0': 'Do you solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God?'",
        "'speaker_2': 'I do? Yes.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Yes. I mean, good evening. I ran for mayor and members of the city council. Tonight you have a for you an application for entertainment with the theme for the Bungalow Long Beach, LLC. Doing business at Bungalow Long Beach located at 5428 Pacific Coast Highway Number 200.'",
        "'speaker_2': 'Operating as a restaurant with alcohol inclusive disagree. There is one change that I need to make two additional condition. Number one, there was a typo at the end of that condition that reads in the interior of the establishment, and I need to change that to say, dancing is only permitted in the interior of the establishment the way'",
        "'speaker_2': 'it currently reads without this change. So the confusion and this will make it clear that dancing is only allowed in the interior of the business. With that correction. All of the necessary departments have reviewed the application and have provided the recommended conditions as contained in the hearing packet.'",
        "'speaker_2': 'I, as well as the police department, stand ready to answer any questions Council may have, and that concludes that report. Thank you.'",
        "'speaker_4': 'Okay. Thank you. Any public comment, please? Do you want to have the appellant speak? Madam Clerk.'",
        "'speaker_0': 'They're on the line. Do you have any comments?'",
        "'speaker_2': 'Yes. This is Mike. I mean, the representative for the bungalow, Mr. Brant Millhouse, is also the principal of the bungalow is on the line. We first wanted to thank staff for the incredible work they did to get us to this hearing, as well as the police department, which we met with and spoke with quite regularly, as well'",
        "'speaker_2': 'as the Building and Safety and Fire. We're here to answer any questions that you may have. Thank you, Brett, for the correction to that condition. Otherwise, we've read, understand the conditions, stand ready to be a part of the community in Long Beach, and I look forward to answer any questions that you may have also.'",
        "'speaker_2': 'Mr. Brett Malthouse is on the line and he's ready to answer questions and if he has anything to add, he's certainly. No, I'm just here to the councils. Any questions on, you know, what the bungalow is? We have two other locations, one in the city of Santa monica, one in the city of Huntington Beach.'",
        "'speaker_2': 'And this will be our third location in the city of Long Beach. And we're super excited to be part of the community.'",
        "'speaker_4': 'Okay. Councilman Price.'",
        "'speaker_1': 'Very much so. I want to thank staff on their work on this project. I know that second PCH has presented a lot of opportunities for staff to work and to think about all the different uses that we have in that space.'",
        "'speaker_1': 'I want to welcome the bungalow to Long Beach, and we we look forward to having a great partnership with you. I will note that it's unusual for us to issue and approve and recommend and advocate for entertainment permits.'",
        "'speaker_1': 'Usually that's a very long outreach process that involves a lot of feedback from the community. But given the location of this restaurant and given the potential for this site to be used in many different ways, I think this is going to be an excellent fit for this specific use.'",
        "'speaker_1': 'So, gentlemen, welcome to Long Beach. We look forward to working with you. Thank you.'",
        "'speaker_2': 'Thank you. Thank you very much.'",
        "'speaker_4': 'Thank you. Can I get a second on the motion, please? There's a second account from your Ranga bloke over.'",
        "'speaker_0': 'District one. I district to. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. High District six. I'm District seven.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Report and Presentation on Illegal Firework Issues.": [
        "'speaker_4': 'Thank you. We're going to hear items 16 and 25, which are both fireworks related together, please.'",
        "'speaker_0': 'Communication from Councilman Price, Councilmember Pierce, Councilman Super Knob, Vice Mayor Andrews. Recommendation to receive and file a report from the Long Beach Fire Department and a presentation from the Third Council District Committee on illegal fireworks. And item 17 is a report from Health and Human Services, a recommendation to award a contract to Volunteers of America to provide'",
        "'speaker_0': 'operational I'm sorry, $0.25 item.'",
        "'speaker_4': 'Actually, I'm going to do one at a time. I just wanted to note that to hear one after the other. Okay. Sorry about that. So why don't we go ahead and do item 16?'",
        "'speaker_0': 'The recommendation receive and file a report on the Long Beach Fire Department from the Long Beach Fire Department and a presentation from Third Council District Committee on Illegal Fireworks.'",
        "'speaker_1': 'Mr. Mayor queued up.'",
        "'speaker_3': 'I think you're good to.'",
        "'speaker_1': 'Can you guys hear me? Yes we can use as he comes on our earth. Is the video queuing up or.'",
        "'speaker_0': 'Yes, we can hear you. We can hear you on this. And if you'd like to start your presentation.'",
        "'speaker_1': 'Okay. So I think there is a video for this presentation and I don't know if it's getting queued up or not, but I do have some comments on the item before we show it. It's one of our public service announcement videos that we work with Cal State, Long Beach every year to create.'",
        "'speaker_0': 'Oh. My name is Biscuit. When I was a puppy.'",
        "'speaker_1': 'I was really scared of these loud.'",
        "'speaker_0': 'Bright lights in the sky.'",
        "'speaker_1': 'I used to hide wherever and whenever I could. But then I knew. Coming. Comfort me. No matter what, everything is going to be okay. But then. My husband went away for a. And when he came back, it was the happiest day of my life.'",
        "'speaker_1': 'But he wasn't the same person.'",
        "'speaker_0': 'He used to be.'",
        "'speaker_1': 'My police dog friends tell me it's from these things called fireworks, which are these wild things that aren't allowed in Long Beach, but the humans use them anyway. So now it's my job to let my human know that no matter what, everything is going to be okay.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'So.'",
        "'speaker_1': 'So we wanted to kick off this item with that PSA. I think many of my council colleagues know that for the past several years we've been working really hard on education and outreach for fireworks leading up to the 4th of July.'",
        "'speaker_1': 'A few years ago, our office created a citizen committee to deal with fireworks. I know that, Ken Wise, I hope he's on the call right now. I think he wanted to give an update on the fireworks committee. And I think the importance of that is I don't know how many of my council members remember in 2018 when'",
        "'speaker_1': 'they did a presentation, they spent over 100 hours interviewing different public safety personnel throughout the city of Long Beach. They pulled data on hospitals in terms of 4th of July fireworks related injuries. They interviewed cities all throughout the region about how they deal with fireworks, education and outreach and also enforcement and prosecution of violations.'",
        "'speaker_1': 'And they presented a report to council. And as a result of that report, we brought several items over the past few years asking for the city attorney's office and the city manager to look at things such as administrative citations and other ways that we can better enforce and regulate fireworks activity in the city of Long Beach.'",
        "'speaker_1': 'This is to me, the situation is even worse this year. I know I've talked with Chief Luna about it and I've talked with Councilman Austin, who I know is also very concerned about this item and has brought an item as well tonight.'",
        "'speaker_1': 'This is an issue that for me, this year appears to be a lot worse. And in talking to the chief, I don't really know what the reason for that is, but the situation is out of control. It's almost nightly now, especially that on weekends.'",
        "'speaker_1': 'And so we're we're bringing awareness to the issue because I think it's important for us to have outreach and education through the pieces. I know that Ken Weiss, who's on this call, has been very successful in getting those pieces introduced into Long Beach Unified.'",
        "'speaker_1': 'He's worked, and I think he can speak to this himself, but he's got thousands, tens of thousands of views on these pieces just through the work that he's done with the committee that we created. And it's completely volunteer committee.'",
        "'speaker_1': 'So I'm really grateful for that. I also want to acknowledge our city prosecutor, Doug Halbert, who I spoke with earlier this week, who is going to be announcing, I think later this week a public facing website that will allow residents to be able to upload videos and to be able to lodge complaints.'",
        "'speaker_1': 'And we have that for price gouging. We're going to do a similar thing for fireworks, and that will allow the opportunity for home owners to also be held accountable for activity that's taking place on their property, even in the situation where the police officer doesn't witness the violation, which is necessary for a misdemeanor offense.'",
        "'speaker_1': 'So I'm going to turn it over. If it's okay, Madam Park, I don't know exactly how this would work, but I would love to hear from our fireworks advisory committee member Ken Weiss, if he's on the call and have him give a few updates and then and then we can move the item forward.'",
        "'speaker_1': 'And I know Councilmember Pearce reached out to me because this is an issue that's of great concern to her as well. So I know she's going to want to talk, but if we can ask Mr. Weiss to talk before she does, I think that would be great.'",
        "'speaker_0': 'Mr. Weiss's on the call.'",
        "'speaker_2': 'However.'",
        "'speaker_0': 'Mr. Weiss.'",
        "'speaker_1': 'Met.'",
        "'speaker_2': 'Can you hear me?'",
        "'speaker_0': 'Yes, sir.'",
        "'speaker_2': 'Mr. Mayor. City Council members, thank you very much for letting me make a few more hours and make a few comments tonight. Our committee has worked really hard this year on developing a fourth PSA relating to addressing the PTSD and how the fireworks effect affect individuals that have that problem.'",
        "'speaker_2': 'And we worked with Cal State, Long Beach and the Veterans Administration, and we just had a wonderful experience with a different administration. They were just anything we needed. They stepped forward and helped us. With the project and they did it.'",
        "'speaker_2': 'They were wonderful. I want to do it real quick because I know time is short. We all the pieces are now in the Long Beach Unified School District curriculum and are being shown to all the elementary school children.'",
        "'speaker_2': 'They are also in the Long Beach library system and are going to be available, I believe, through the youth learning part of the library. We we developed a static piece of art to go along with the with the pieces.'",
        "'speaker_2': 'And that's that piece of art is on the Long Beach Convention Center. Billboard As we speak, we have a language on the. On the Veterans Administration billboard on Seventh Street that has that was started at the beginning of June and has been run through 4th of July.'",
        "'speaker_2': 'We took the we had kind of a I think it's a wonderful thing. We had a citizen a protest and ask he he wanted to be involved with our committee, but he couldn't make the time commitment. And so he asked us, he said, of all the things that you have done this year, what haven't you been able'",
        "'speaker_2': 'to do? And I immediately said, Well, I'm going to do a bumper sticker or a Windows sticker. And he said, Send me the artwork and I'll make make it happen. And two weeks later, I had a box of 5000 bumper stickers on my on my front porch.'",
        "'speaker_2': 'And we've distributed them to different organizations around Long Beach here. 5000 isn't enough, but it's a start. The the pieces are on Long Beach TV. Parks and Rec is going to show them in front of the movies in the park when and if things get back to normal.'",
        "'speaker_2': 'The VA has. Has put out the and the the the yes A's through their social media. We worked very hard last year to develop a distribution network specifically in Long Beach, and we have 140 partners who are now distributing the pieces, all four of them to their organizations.'",
        "'speaker_2': 'And they are people like the Boys and Girls Club, Homeowners Association, just a whole myriad of organizations in Long Beach that are concerned and upset about the fireworks situation. We as of yesterday, the safety squad pieces. I have I have earned 24 million views.'",
        "'speaker_2': 'Which I think is just outstanding, just amazing and blows me away to think that 24 million people have seen what we created. If any of you have any questions for me, I'm. I'm more than happy to try and answer.'",
        "'speaker_1': 'And I don't have any additional questions for you, but I wanted to thank you on behalf of the city and on behalf of me and my team for the amazing work that you've done. I know that when we started this process, we talked a lot about trying to do outreach and education at the grade school level and'",
        "'speaker_1': 'the middle school level, just to teach the future leaders of Long Beach that this is this is not okay behavior. And and to maybe call upon the adults in the room who are breaking the rules to say, you know what, that's not okay.'",
        "'speaker_1': 'Kind of like our kids do sometimes. If we're picking up the phone while we're driving, they'll call out bad behavior and we want kids to understand that. But I think the work that you've done has been amazing. And the initial research that you did to get us to this point has been fantastic.'",
        "'speaker_1': 'And I just want to thank you. I know there's a lot of discussion to be had tonight. I also know that Chief Luna has shared with me that the attention of the police department toward this particular issue is going to be enhanced leading up to 4th of July from this point forward.'",
        "'speaker_1': 'So I want to thank you. Ken. And with that, Mr. Mayor, I have no additional comments. Thank you.'",
        "'speaker_2': 'Could I say one more thing before? Hello. I could say one more thing. Our committee is in the process right now of putting together recommendations for 2021, and we look forward to presenting them to the City Council in late August or early September.'",
        "'speaker_2': 'Council meeting. So I just wanted to make all of you aware of the work that we're doing on that.'",
        "'speaker_4': 'Thank you. Let me go to the coolest Councilman Pierce.'",
        "'speaker_1': 'Thank you, Mayor. And thank you, Councilmember Price. And to your team that's been doing work. I, I did reach out to see if you were going to do this. And so I'm glad to be a part of this item.'",
        "'speaker_1': 'I have questions and I think I'm going to save for for the next item. That way we can have them all in context, but really appreciate what you guys are doing and really appreciate just doing the education component.'",
        "'speaker_1': 'I think that there's a lot more that we we can do, but also recognizing how difficult this situation is to manage. So I'll say my comments for the next one. Thank you so much.'",
        "'speaker_4': 'Councilman. Your anger.'",
        "'speaker_2': 'Thank you. And thank you, Susie.'",
        "'speaker_6': 'For bringing this forward. I know we're all districts are trying to do their part in trying to control fireworks. And, you know, actually, they're they're explosive devices now. And there are some fireworks out there that I. Yet the margin of being called a firework.'",
        "'speaker_6': 'The explosive devices, anyway. All that to say is that CD1. Mary said there has been four years of ice. Mary Andrews and myself were hosting a town hall meeting this coming Tuesday, June 30th at 7 p.m. to invite the community to talk about the fireworks and where the city is doing in terms of trying to address the'",
        "'speaker_6': 'issues. And you're absolutely correct. The fireworks, it appears, are getting worse and worse every year and much more violent. My my wife was on Facebook and she heard earlier today that one of our neighbors lost her dog to a heart attack because of the grief and the panic that that dog was experiencing.'",
        "'speaker_6': 'And I make sure that I always bring in my dogs early enough before it really gets going to like shield them from all the noise inside. So please. Those are two in the community that are listening to us.'",
        "'speaker_6': 'Please tell your neighbors that fireworks are illegal in Long Beach. Thank you.'",
        "'speaker_4': 'I mean, thank you. Any public comment on this item? Madam Clerk?'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'We have one public comment from Cameron Berger. Your time starts now.'",
        "'speaker_2': 'Hi. I'm just appreciative of the fact that everyone is pushing for education and I think the push for firework education is really important. I am a little disturbed to keep hearing that the police are going to continue to be involved in the enforcement of firework laws.'",
        "'speaker_2': 'I lived in Long Beach for three years now and reminding the public that fireworks are illegal has clearly not worked. I think that the city should probably also push its efforts to educate high school students rather than just elementary school students, since they're the ones lighting the firework.'",
        "'speaker_2': 'Not elementary school students, but in the city should focus more on education and less on enforcing the firework ordinances to the police. Thank you. And I yield my time. Black Lives Matter.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_4': 'Okay. Rule cover, please.'",
        "'speaker_0': 'District one. District one.'",
        "'speaker_1': 'I am.'",
        "'speaker_0': 'District two. I. District three. District three. District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'I. I.'",
        "'speaker_0': 'I. District six.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_4': 'Hi.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Illegal Explosives and Fireworks Action Plan Recommendations.": [
        "'speaker_4': 'Thank you. Item 25, which is also fireworks related.'",
        "'speaker_0': 'Communication from Councilman Austin, Councilwoman Zendejas, Vice Mayor Andrews, Councilmember Richardson. Recommendation to request recommendations of the illegal explosives and Fireworks Action Plan to address the illegal use of fireworks and explosives in Long Beach.'",
        "'speaker_4': 'Councilman Austin.'",
        "'speaker_6': 'Sir. Thank you, Mr. Mayor. And I'd just like to just just frame the issue. While the illegal use of fireworks is a recurrent issue, each year, this year it's been mentioned, seems to be significantly amplified and based on media reports that the surge in illegal fireworks and explosions complaints is being experienced not only here in Long Beach'",
        "'speaker_6': ', but in cities across the country. The activity seemed to have started much earlier this year with greater frequency and a greater number of loud explosive devices nightly. And like many of my colleagues on the council, I not only experience these nightly disruptions in my neighborhood.'",
        "'speaker_6': 'I've spoken with many residents and heard from many residents in my district and throughout the city that they are. Asking the city to do more to address the problem. I'd like to thank my colleagues, council members and they House Vice Mayor Andrews and Councilmember Richardson for signing on to this item really at the last minute.'",
        "'speaker_6': 'This was a supplemental item as well as Councilmember Price and the council members who brought this item, previous item to the agenda on fireworks. It deserves our attention as a council. This is an issue that impacts many of us, all of us, especially those who are veterans or others who suffer from PTSD.'",
        "'speaker_6': 'Families with small children, pets, pet owners. I've heard from many of you, but it affects us all. And there's no easy answers here. A week ago, I held a virtual town hall on the issue of. Legal fireworks with our city prosecutor Doug Halbert, North Division Police Commander Anthony Lopez.'",
        "'speaker_6': 'We had a very productive discussion and I received many constructive suggestions, suggestions from the community, and I've taken a look at some of them as well as best practices in other cities. With that information, we put together this a legal explosives fireworks action plan to support our education campaign and current enforcement efforts with additional tools to curtail'",
        "'speaker_6': 'the activity. Is that versus the virtual town hall and bringing this item forward. Our city prosecutor has already, as mentioned, established a public portal for residents to report and submit evidence of illegal firework activities directly to the city prosecutor's office and website of the city prosecutor.'",
        "'speaker_6': 'However, dot com backslash fireworks that are illegal is also started sending letters to property owners where illegal. And I want to clarify that property owners, residents, anybody who is a dweller in a household can be cited. And he's going to send these to these individuals where these these households, where where illegal fireworks are being charged and given'",
        "'speaker_6': 'notice the storage or discharge of fireworks. That property is against the law and constitutes a public notice. I would like to thank the city prosecutor, however, for taking these immediate steps. While we won't be able to eliminate the problem of illegal fireworks altogether and immediately with additional education and concrete actions, I believe we can take steps forward'",
        "'speaker_6': 'here to really make a difference for our city. So we put forth seven our request on this item, and I'm certainly open to hear from my colleagues about potential amendments to this. But number one, we request the city attorney to draft an ordinance that would include a person who owns rents, leases or otherwise, has possession of the'",
        "'speaker_6': 'premises as the responsible party for the illegal use, discharged possession, storage or sale of fireworks on the premises. Number two, we request the city attorney and city manager to report back to the city council with options for increasing the penalties for anyone cited or arrested for firework violations.'",
        "'speaker_6': 'Number three, we request the city attorney and city manager to report back to the City Council on the feasibility of including an administrative citation process for legal firework use to allow additional enforcement capacity in our city. Number four.'",
        "'speaker_6': 'Request the city manager to assess the feasibility of establishing an online portal or go Long Beach app feature for residents to submit video evidence of firework violations for referral to city prosecutor. Five request the city manager assess the feasibility of utilizing open data or crowdsourcing to create a publicly accessible heat map of incidents of illegal fireworks and'",
        "'speaker_6': 'explosives in Long Beach. Number six Request of City Manager Assess the feasibility of establishing a fireworks hotline for residents to report illegal fireworks and explosives. And lastly, number seven, request the city manager provide an update on public education efforts this year that all fireworks are illegal in Long Beach.'",
        "'speaker_6': 'I think some of this is done and is also in line with what we are already doing. But we want to send a strong message to anyone out there that that fireworks are illegal. I would appreciate my colleagues and support on this item.'",
        "'speaker_6': 'I know it's very important to all of our constituents. Thank you very much.'",
        "'speaker_2': 'My next councilwoman. Jeanine, you're up next.'",
        "'speaker_1': 'Somebody else can. Somebody that's on the item can second it. That's fine. I can go at the end.'",
        "'speaker_2': 'But I wasn't there. Right. Fine. Okay. Fine. This is I like to say, you know, in this one person I wouldn't appreciate out, you know, for bringing in the other, you know, our colleagues that got on with this excellent idea.'",
        "'speaker_2': 'And there's no doubt that in the last 75 years I've been here, this is the worst year for fireworks. You know, I like some questions before we get started here. You know, do we have a, you know, a report on the most commonly reported locations for fireworks?'",
        "'speaker_2': 'But.'",
        "'speaker_7': 'I'm sorry. Can you repeat the question, please?'",
        "'speaker_2': 'We have a report. What's the most common, you know, reported locations for fireworks.'",
        "'speaker_7': 'So we can ask our police department and our director of Disaster Preparedness Communications, Reggie Harrison, to give some anecdotal response to that. I think the item is asking us to kind of come back with a heat map where we would provide some data, but we can provide some just anecdotal evidence.'",
        "'speaker_7': 'I do believe we're seeing them throughout the city right now, but I'll turn it to them to ask or to give additional detail.'",
        "'speaker_3': 'The Vice Mayor being joined by chief of police Robert Luna. As the city manager mentioned, we are and as a report indicated, we have seen highs in calls for service regarding fireworks already exceeding what we received during the same time period last year.'",
        "'speaker_3': 'My most recent report indicates that we're up by 25% over the same period of time last year in terms of the number of calls for services that we're receiving. And they are they're being called from all over the city.'",
        "'speaker_3': 'We haven't found a concentrated area that I'm aware of at this point. It seems like they're pretty well distributed throughout many neighborhoods in Long Beach and also not just in Long Beach, but nationwide as well. We're seeing lots of reports as indicating that this issue is record setting across the country.'",
        "'speaker_3': 'So it's not just an isolated alarm beach issue.'",
        "'speaker_7': 'Uh, if I could add to that. Robert Luna here. Good evening, Vice Mayor and members of the City Council. We've heard our community loud and clear. I've spoken to many of you in the last week, two weeks. And I know that our community is very frustrated with this significant nuisance from the police department perspective.'",
        "'speaker_7': 'We are in the process of putting maps together, and they're for the purposes of giving them to our officers. So they're armed with that in the field and they can go out and identify specific addresses or locations where it's a continuous challenge for us.'",
        "'speaker_7': 'I saw one today where we had three addresses, specifically in one of the police divisions. And the officers are directed to go out there and spend more time. The last couple of weeks have been a little difficult. We've been preoccupied with we're now at 60 protest.'",
        "'speaker_7': 'So as those hopefully will slow down a bit, we can go out there. But for anyone in the public who's listening to me, please, it is a reminder that fireworks are illegal in this city. We want you to be respectful to your neighbors.'",
        "'speaker_7': 'I live here in the city and it's very difficult to sleep at night, as many people have described it. And I've got to tell you specifically in this environment, it's very difficult for our officers to go out and want to give citations for this violation.'",
        "'speaker_7': 'It is $1,000. We don't want to give citations, although we've given out several dozen of them already, and we don't want to give out any more. So we want you to stop doing this. But that being said, we are going to be putting out additional officers primarily focused on this activity.'",
        "'speaker_7': 'And if you're caught, you're going to get cited. And it's really expensive. So please stop.'",
        "'speaker_2': 'Thank you. I really am that cheap because I'm really looking forward to report coming back with locations and numbers of citations. You know better to use in don't know drama for you know the enforcement so but but what I really would like to thank you know residents can again who's keeping me on my toes every single boom'",
        "'speaker_2': 'she she may not know it but B she'd be in a lab right up she's right up the street from each other. And I am convinced that together we are going to find out who is keeping instead in all these so we can get these things taken care at night.'",
        "'speaker_2': 'So with that, I want to thank everyone. And so the next that will be missed is the data. You coming up, please.'",
        "'speaker_1': 'Thank you, Vice Mayor. ANDREWS First of all, I wanted to thank our staff for for giving this item the much needed attention that it's been a need for these past couple of weeks. I know that with COVID 19 present here, we haven't been able to give as much attention to this to this issue as we as we'",
        "'speaker_1': 'would have liked to. But, yes, I am I am a resident of the downtown area here in Long Beach, and I am am witness to every night having to hear the you know, the these fireworks are illegal and they're illegal for a reason.'",
        "'speaker_1': 'So I appreciate all my residents for trying to try to chime in and letting us know where the problem is and stuff. So they're all over our district. So I really appreciate Councilmember Austin for taking the lead on this on this problem that, you know, that we're all facing right now.'",
        "'speaker_1': 'It's very important that we you know. That we realize that this really affects those most vulnerable, which are our seniors, our children, and especially our pets. And it's very, very heartbreaking to feel like your your your hands are tied, because by the time that, you know, the officers come out to where the site was, there's nobody there'",
        "'speaker_1': 'anymore. So it's very hard to track and actually hard to enforce it, even though it is a misdemeanor here in Long Beach. So with that said, I'm so excited about the new portal that our prosecutor has launched today that will enable us to actually submit the videos, the the locations of where we're hearing them and pictures.'",
        "'speaker_1': 'But I just want to tell all our residents, not only in the first District but everywhere to yes, please do report those and any instances onto this portal, but always remember that your safety comes first. That's one of the things that I think is the most scary from these illegal fireworks, is that, you know, the innocent people'",
        "'speaker_1': 'that are not setting them off are are the ones that are being hurt by it. I've known people getting burnt in their back by them, you know, with them not even being close to someone, setting them off. So we and I, it's just so scary to see that and to put, you know, innocent people in harm's way'",
        "'speaker_1': '. So, again, if if if you're out there, you're listening. Please don't don't do these fireworks. Please don't just think of those other people that you might hurt and you know, it's just not right. So thank you very much again, council member Austin for for bringing this item forward.'",
        "'speaker_2': 'Yes, Councilwoman Mungo. Councilwoman Mungo, are you there?'",
        "'speaker_1': 'Yes. Thank you, Vice Mayor. A couple of quick questions. We talked a little bit about the fee of $1,000 fine, but the individuals that we're talking about are literally buying thousands of dollars in fireworks. Lighting them on. Right.'",
        "'speaker_1': 'So there is a fine is very meaningful too. So my question would be to city staff, what can we do to force add to the. Along the lines of 40 hours of community service, you're keeping people up and ruining their sleep.'",
        "'speaker_1': 'Let's find something that's more important to you than money. If you're obviously willing to let your money on fire, what else can we do?'",
        "'speaker_7': 'So yes. So it's currently a misdemeanor. We've looked into this and whether or not we can raise the fee, I believe that would require some state law changes in terms of other sentences. That tends to be up to the city prosecutor on what he can sentence under.'",
        "'speaker_7': 'Perhaps a chief when I can expound on that. Currently, as Mr. Modica stated, Councilwoman Mango, it is a misdemeanor and the punishment or the fine can go up to $1,000. So you basically get a misdemeanor citation for $1,000.'",
        "'speaker_7': 'If the judge, when you go to court, if he keeps it at that, he or she keeps it at that amount.'",
        "'speaker_1': 'Is there an administrative fine that we could impose instead of 40 hours of community service? Because, again, fireworks are expensive. And if you're willing to light tons of fireworks on fire, you're literally lighting your money on fire. So to me, that saying $1,000, no, no big deal.'",
        "'speaker_1': 'So what other alternatives as a city could we pass legislation, either local legislation that says, okay, well, in Long Beach, it's an administrative fine and we're going to do 40 hours of community service. Or 60. I'm open to a lot of suggestions.'",
        "'speaker_7': 'Yeah, I hear your frustration and that's a level of frustration. A lot of us and I see us as a community. I will absolutely sit down with the city attorney and the city prosecutor to see what further options we may have.'",
        "'speaker_1': 'And then can you tell me about the Coordination Council member Richardson and I, when we're on Facebook and talking with community members, talk a lot about, um, we work with our own commanders, but we have some challenges on our borders from cities who are contract cities and may not be contracting for as much service or are patrolled'",
        "'speaker_1': 'by another agency. And specifically, I've worked 4th of July as a sheriff's deputy in the city of Carson, and I'm aware of what they're going through. But, um, for a city to get serious, no matter what city it is, they need to have adequate staffing.'",
        "'speaker_1': 'Because if they don't, all of the Long Beach residents who are in border cities are really just. Garage with the fireworks that are just adjacent to them because the sounds are so loud and the sound carries so clearly.'",
        "'speaker_1': 'What are we doing to cooperate with our partners at Signal Hill, Los Alamitos, SEAL Beach and the L.A. County Sheriff's Department, which covers Lakewood, Lakewood, Hawaiian Gardens, Bellflower and Paramount.'",
        "'speaker_7': 'One of the advantages we have here in the city, our own city, is that we have our own police department. So when a community speaks, all of you speak to me and speak to me very loud and clear.'",
        "'speaker_7': 'So we're able to put resources on this challenge. I'm just going to be brief and say that other cities around us, specifically county agencies, don't show the same level of interest that we do.'",
        "'speaker_1': 'Okay. You know, there was not. You have. And you've mentioned that the increases in calls is up 25%. Do you think that that is a total number of reported? Which would be great. Or is it location? Because one of the things I was invited to a Facebook group called Against the Fireworks.'",
        "'speaker_1': 'And I had originally thought it was going.'",
        "'speaker_7': 'Uh, Councilwoman Mango. The the dispatches or the calls for service are up.'",
        "'speaker_1': 'I know we could probably turn it into something like that.'",
        "'speaker_7': 'Can't remember. We lost two there for about 20 seconds, can you?'",
        "'speaker_1': 'Or are we getting more locations from your gut?'",
        "'speaker_7': 'So, Councilmember, we lost you for about 20 seconds. Can you repeat the question again, please? Councilmember Can you hear us? Councilmember Mongo.'",
        "'speaker_2': 'Fine. I think we lost it. We're going to go and come here.'",
        "'speaker_1': 'But you said the council vice mayor. Vice mayor.'",
        "'speaker_2': 'Okay. Go ahead.'",
        "'speaker_1': 'Mr. Harrison, were you able to tell me if it was 25% increase in locations or calls? Because what we need is a large number of residents participating in the crowd sourcing to identify and narrow down the locations to send in our officers.'",
        "'speaker_7': 'Councilwoman Mungo Robert Luna here again. The numbers that were given out, calls for service, an increase in calls for service that we are receiving both into dispatch and then obviously that our police officers are handling. In regards if I you did cut out there for a second, I think you asked if there were reports taken on something'",
        "'speaker_7': 'like this and know there are calls for service that we go back to and then our systems can draw from that calls for service for things like heat maps and addresses that our officers are paying more attention to, to try and stop the use of the illegal fireworks.'",
        "'speaker_7': 'I'm hoping that answers your question, but you did cut out there for a second, so I want to make sure I did answer your question.'",
        "'speaker_1': 'Thank you, Chief. I was working towards figuring out if we were to set aside a task force in every region of the city to crowdsource where the explosions are coming from, then maybe the police officers could be more successful.'",
        "'speaker_1': 'I know there's nothing more frustrating than to show up to a location based on a call report, but to find out that that's not the location. Fireworks they echo the sound can't always be identified depending on what region of the city or district of the city you're coming from.'",
        "'speaker_1': 'So I was just trying to figure out if we could work some kind of crowdsourcing. With our neighbors. And then lastly. There was a discussion two years ago about evidence and how a person needs to do a private person's arrest to enforce that.'",
        "'speaker_1': 'They saw the lighting of the firework versus a police officer seeing the lighting of the firework. Have we made any progress as a city or any with our legislation to allow the prosecution of. People lighting off fireworks that are caught on film.'",
        "'speaker_7': 'Let me try and answer that the best I can. Currently, it's a misdemeanor, and if the officer observes it, they can cite for the violation if they didn't see it. But one of our community members sees it. They can do a private citizen's arrest.'",
        "'speaker_7': 'And Councilmember, this is Tom. The program that the city prosecutor is launching is exactly that. So he is launching a website where residents can upload their videos and upload their pictures. They can put in suspect suspect descriptions, they can give actual locations and they can say, here is the criminal activity that I witnessed.'",
        "'speaker_7': 'And then the prosecutor will send letters to the property owner whose property it is, because that is against the law, not to create a nuisance on your property. And then that can be followed up on that will requires, you know, some identifying information.'",
        "'speaker_7': 'So the more information the community has to provide the prosecutor, the better on specific individuals that are performing specific criminal acts. So it is another tool that we're glad to have added to the arsenal.'",
        "'speaker_1': 'I appreciate that. Councilmember Odinga and I were talking earlier. I know in my district we have some individuals who are not necessarily associated with the House. So, for instance, a group of neighbors see the individual. Adjacent to the park, lighting off fireworks.'",
        "'speaker_1': 'But they've never seen him in the neighborhood before, so they're not sure which household he belongs to. What about the videoing of a particular person not associated with a residence? The backpack lighters, I guess, is what we're kind of calling them.'",
        "'speaker_7': 'Yeah. And those pictures or videos can be turned over through the city prosecutor to the police department, and we can investigate it to see if we can make a connection and be able to identify them. So that is absolutely a possibility.'",
        "'speaker_1': 'And, Mr. Halbert, it will be it'll be available for sharing with our adjacent cities and the district attorney's office.'",
        "'speaker_7': 'I will have to ask that question. I think he's using it for our specific, you know, what's in his jurisdiction to be able to send the letters to for those go to private property owners. So, you know, that is one of the things that council has to look at.'",
        "'speaker_7': 'Last time was holding the private property owner more responsible. We had investigated the admin site process, which can do that, but it also requires a lot of work and some additional costs. The prosecution prosecutor can do that under existing laws, and we'd be happy to talk to our neighboring cities if they'd like more information on that.'",
        "'speaker_1': 'Wonderful. Thank you. We have to get a better handle on this. I mean, every night everyone knows I have three dogs and a veteran and a 20 month old, 19 month old at home. And as I lay in bed, when she wakes up in the middle of the night with the mortars going off and for years the'",
        "'speaker_1': 'dogs have been terrorized. But nothing like this year. This year, and I've talked to some of our officers, they are working their hardest. It is just very, very difficult to get a handle on all of this with the resources.'",
        "'speaker_1': 'So we have to come up with better solutions. So thank you for all that you're doing and thank you for continuing to listen to the community. And a big thank you to Councilmember Austin for your listening session last week.'",
        "'speaker_1': 'I know a lot of our neighbors really appreciate that and the committee that Councilman Price put forward, because those are all avenues where we can brainstorm and come up with solutions. A lot of people say, well, what are other cities doing?'",
        "'speaker_1': 'And I haven't been able to find a city that does any of it better than us yet. But I'm still listening and willing to adopt any other creative ideas that come from any other cities. Thank you.'",
        "'speaker_2': 'Thank you. That, of course, when asked would you said.'",
        "'speaker_3': 'That Vice Mayor wanted to take a minute and chime in on this? I think the city council has every year taken this on. And, you know, I think Councilman Austin for for putting this platform for us to all sort of jump in and share our thoughts and ideas here every year it's been it's been bad.'",
        "'speaker_3': 'And every year it seems like it's gotten worse. Every year we have an agenda item or two about it. This year, it's clearly worse than ever or people are also paying attention to this moment. So I think it causes us to discuss the complexity of the problem and let people understand just how big this issue is.'",
        "'speaker_3': 'It's a problem across the L.A. region. There's 88 cities here in L.A. County, all with different rules. We're all piled up right next to each other. You're North Long Beach, reported by Paramount, Bellflower and Lakewood all have different degrees of of the problem and different laws around the problem.'",
        "'speaker_3': 'And when long because but we're all right next to each other. And so you can you can walk right across our border by safe and sane, so you can buy illegal fireworks online. So people are frustrated. Residents are frustrated, but they are organizing.'",
        "'speaker_3': 'And I applaud their organizing. Hamilton Association My district's been very, very vocal. Every every neighborhood North Long Beach deals with this every single night. I say this lot to them when they visit. A part of it is I just try to help them understand that, hey, I rest my head north Long Beach every night right there with'",
        "'speaker_3': 'you. I raised the last five, last five years, two newborns that have been disturbed all night. We have to do a lot to keep my dog from, like, tearing up, tearing at the house. And so so we get it.'",
        "'speaker_3': 'We're frustrated about it. I think the legal fireworks Facebook group has done some good organizing. I know that. I'm concerned with what I've heard about some of the non productive responses to this. More specifically, what I'm hearing about vigilante patrol groups, I want to just say that it's important that our residents have confidence that that we are'",
        "'speaker_3': 'being proactive on this issue. And we are letting folks know that, you know, this is not a moment for any sort of vigilante justice. So I wanted to strongly discourage what I've been seeing out there, the talks about vigilantism.'",
        "'speaker_3': 'I also want to want to say that, you know, I think that we can spend a lot of time talking about solutions and what we're going to do. But I think we need to do more to check in on the welfare of our most vulnerable residents.'",
        "'speaker_3': 'So so for example, I spoke with the VA U.S. vets just here recently about just just today and over the last few days about creating a space for veterans with PTSD in different areas of town, veterans who are going to have a difficult time allow them to come to a safe space where there's counseling, maybe music, if'",
        "'speaker_3': 'it stays open til 12 or 1:00, maybe there's maybe there's you know, there's pizza, there's music, there's counseling. Allow them to be in a safe space so they can receive some therapy and be in a really safe space around them.'",
        "'speaker_3': 'I would like to personally just offer Highland Park for this. And I want to also in Councilman, I would include this in the motion. I want to offer my one time District nine funds to help if this going out in park and I hope that others can.'",
        "'speaker_3': 'I know the V.A. has some of this already, but in North Beach, we don't have anything like this. So I want to I want to add up to $5,000 for my one time to help get a program like this going to help folks just have a safe space.'",
        "'speaker_3': 'And I want to just pause there. Tom, would you mind responding to that request?'",
        "'speaker_7': 'Sure. So thank you, Councilmember. So we'd be happy to take a look at that, especially if that's a service that an existing group already provides and if we're able to host it here in Long Beach. We would this year need to be checking it with the health order to make sure that it fits under that.'",
        "'speaker_7': 'Typically, gatherings are not prohibited or prohibited are not allowed. But counseling services, there are some exemptions for some specific treatment and counseling services. So if you want to add that to the motion, we'd be happy to look at what can be done either this year or in the future.'",
        "'speaker_3': 'Absolutely. And what and what I understand, it's it's it's exactly what you described, what we what we discussed. It's really about counseling and therapy. And, you know, we want to utilize that exemption to the to the order to handle that.'",
        "'speaker_3': 'We have a venue, social hall out in part. We have funding. So that's what I want to I want to see happen. And we're talking about maybe the week leading up to the 4th of July and maybe the week after, because we know it's going to get worse.'",
        "'speaker_3': 'And then it doesn't just stop it, you know, it begins to smooth out. So that's the week I'm really concerned. Those two weeks are what I'm really concerned about. So the other thing that I want to mention is that I know that we have a lot of focus on suppression, and I know that that's important.'",
        "'speaker_3': 'But I really want to have some questions about upstream. How are these things coming into our community? Chief, are you able to speak to, number one, how we know that the very, very loud devices, the very loud explosive devices that are coming to.'",
        "'speaker_3': 'You have an idea on the scale on how they're coming in and our capacity to limit that ability for them to come in.'",
        "'speaker_7': 'Yes, sir, Councilman. When we've made arrest in the past and we've made several arrests in the past, generally people are selling them. They're selling them on the Internet, and they're getting them from either the state of Arizona or the state of Nevada, and they're bringing them in in quantities.'",
        "'speaker_7': 'So that is extremely difficult to enforce. But that does it. That never stops us from from doing what we do. And so we're talking a lot about giving citations or seeing violations out in the street, which is important.'",
        "'speaker_7': 'But we're also going to be on a very aggressive campaign to try and stop a lot of this activity on the Internet. And I'll leave it at that.'",
        "'speaker_3': 'Right? Right. So so that said, I know that, you know, we can we can do these things, but really, it's it's difficult without having a clear front door on where these things are coming in the community. And given our past work in L.A. County of different regulatory framework, really the statewide solution.'",
        "'speaker_3': 'So I want to also add to this this motion a recommendation for the city to advocate for a statewide ban. I think a statewide ban would supersede so the county would be able to do with this rogue charter city.'",
        "'speaker_3': 'So the state would have to do this in order for us to have one consistent law across the region to allow us to enforce them in a more strategic way. And so I want to include that as well.'",
        "'speaker_6': 'I'll accept that as a friendly.'",
        "'speaker_3': 'Okay. Thank you. Thank you. Yeah. I was going to keep going. I got I got maybe one more. And I also mentioned my support for the data and the heat map. You know, I said that publicly. We've talked about this.'",
        "'speaker_3': 'It's included in the item. I think it's about really being transparent regarding how massive this issue is. We also need to be transparent. Transparent in the way our city prioritized, prioritizes responses. What I hear from folks, again, is that they don't necessarily feel heard that the city is responding.'",
        "'speaker_3': 'So, so so my my my thought here is that. When we rollout, when we identify whatever data we have, we also should be able to look at some response data and how we prioritize it and maybe think about and think about maybe some strategies on response that sort of could be targeted and there may be some innovative'",
        "'speaker_3': 'ways to do it. But I really want to see the data of the calls and the relationship to the response. I'm supportive of the ideas that that that the prosecutor to hold property owners accountable. These are discussions we've talked about with with respect to if a liquor store has certain activities that happen there, motels have certain activities'",
        "'speaker_3': 'happening in there. The property owner also is accountable to the impact they have on the broader neighborhood. And if we know that there are certain properties that are, you know, a problem, then, you know, I think that's something we we certainly need to look at.'",
        "'speaker_3': 'I think that makes sense. On Monday, I'm going to the city prosecutor joining joining me on a District nine town hall. I think that would be a good time to say it. 530 on Monday, a virtual town hall.'",
        "'speaker_3': 'That information is coming out in email, but the city prosecutor is going to join us to talk about this concept as well. So a lot of these meetings are happening across the city. So I want the ninth district to know that theirs is coming up on Monday.'",
        "'speaker_3': 'I think that's all I have. And just to sort of account, thank you for accepting the friendly councilman. I want to just be clear cause I didn't hear a second I cued up, so I want to be on the record second in this as well.'",
        "'speaker_3': 'And and, Councilman, you accept that that part I want to add some of my one times to help get this pilot program on as well. You guys you guys get that as well, councilman.'",
        "'speaker_6': 'The one times. I mean, that's something that I think you can do independent of this this item and set that up in your district. I mean, no, I don't know that that has to be a part of a citywide thing.'",
        "'speaker_6': 'I mean, you want to do it at Highland Park. You want to use your district nine one times. You know, I'm not sure because I don't want anything to prohibit this moving forward. Is that is that that's a wrinkle?'",
        "'speaker_6': 'I think that might be a bit of a challenge. Um, so, so.'",
        "'speaker_7': 'So councilmember if I can jump in there, we don't need the one times in there. It's good to get enough to hear that the councilmember wants to do that. I would like some direction from the entire council that we should be focusing on creating a new program in the next couple, in the next week essentially, and working'",
        "'speaker_7': 'with the VA so that we would requests to be part of the motion to get council direction. And the one times we can follow up the actual dollar amount, we'll follow up separately.'",
        "'speaker_6': 'Okay. I guess I can accept that idea.'",
        "'speaker_3': 'Okay. But how do you guys want to do it. Is is good. I just think we need to be ready. And it's the 4th of July help support our readiness. Yes.'",
        "'speaker_6': 'I agree. And several residents have actually brought that idea forward as well. And so I appreciate you including it. Thank you.'",
        "'speaker_2': 'Thank you very much. Congressman, just an got a one year.'",
        "'speaker_1': 'Thank you very that. So I, I support the direction that this is going. I, I it's not lost on me, though, that we are in a moment when we are talking about what kind of responses our community wants to see.'",
        "'speaker_1': 'And it's not lost on me that we have kind of two different groups that are asking us for changes. One of them is asking for more police presence and one of them is asking us for less. So I really love getting the prosecutor involved and talking about a statewide strategy, talking about where we can kind of stop'",
        "'speaker_1': 'the inflow of this. And some of my constituents have shared with me photos of, you know, our grocery stores or Ralphs or Vons and our targets that are selling some of the smaller fireworks that are selling them nonetheless.'",
        "'speaker_1': 'And so, Tom, could you share with everyone what they should be doing if they see that at a store right now?'",
        "'speaker_7': 'So if the question is if illegal fireworks are being sold at stores, they are not allowed to be sold at stores in Long Beach. So Lakewood does allow what are called safe and sane, but you may not sell those pretty municipal code in Long Beach, and that's a crime that should be reported.'",
        "'speaker_1': 'Right. And they can still report that through the new website that that Doug Halbert is doing. Correct.'",
        "'speaker_7': 'I think we'd prefer those to be reported in to you dispatch order. You can get them to their council office and we'll follow up from both a code enforcement business license perspective and also a criminal perspective with PD.'",
        "'speaker_1': 'Okay, so we mentioned dispatch. One of the other concerns that's been brought up to me by several constituents is when they call dispatch, because this is a lower level crime and they don't feel like they're getting the best response.'",
        "'speaker_1': 'So I just want to make sure that I say publicly for all my constituents that have reached out so that the chief or whoever's in charge of dispatch can make sure that there's proper training happening on how to respond to those calls.'",
        "'speaker_1': 'I know it must be frustrating because the whole city is blowing up at the same time, so I can't imagine being a dispatcher at that time. That must be irritating.'",
        "'speaker_3': 'We appreciate we appreciate that, councilmember. And you're exactly right. Dispatchers are extremely busy with fireworks calls. I've indicated earlier that we've already seen a dramatic increase in the number of calls over last year, but they are responsible for entering those calls for service as they receive them.'",
        "'speaker_3': 'Often we get multiple calls for the same incident. So they do try to do some screening of those so that we limit the number of duplicates that might be in the system. But it is it's it's an extremely busy time for the dispatchers as it is for law enforcement officers out in the field trying to respond to'",
        "'speaker_3': 'those as well. We look forward to working with the prosecutor's office, with the new portal that he is introducing, as well as the police department is establishing email addresses as well, where we will be referring those callers who indicate that they have video or pictures to to share.'",
        "'speaker_3': 'We will be utilizing that technology and when referring callers to that.'",
        "'speaker_1': 'Thank you for that. And I think that the. The collaborative effort is important because as already noted through the rest of the conversation, what's happening in neighborhoods is somebody calls the police because somebody is doing fireworks. Maybe they get there in time and then the police go and talk to the people.'",
        "'speaker_1': 'The police don't see them, so they can't cite them. The neighbor maybe sees them. But my neighbors don't want to file against somebody that's not doing fireworks because they don't want somebody to know where they live. And so there's a real fear that many people have about doing an arrest that way.'",
        "'speaker_1': 'And that, for me, is why I think working with the prosecutor, working at the state level is so important. And I hope that maybe you guys can continue to have creative ideas about how community members can share information, but that doesn't put them at risk.'",
        "'speaker_1': 'And. Does not mean that we have officers coming out to basically just shoot off some people when there's not a citation happening or there could be a situation of an increased anxiety there. And then the last question I had on enforcement with this is.'",
        "'speaker_1': 'Do we know what the surrounding finds are around the city outside of Long Beach? I've heard some subsidies are 2000 or 3000. And it's just curious. We have that data.'",
        "'speaker_7': 'This is Tom. To my knowledge, it's it's regulated by the state, so it's a misdemeanor with a maximum of $1,000. So if there is anyone that has seen a city with something higher, we'd be very interested in that.'",
        "'speaker_7': 'Our research to date shows that this is not a city spying that set the maximum set by state law.'",
        "'speaker_1': 'Great. And I know that was mentioned earlier. I just wanted to make sure we tease that out one more time. And then for enforcement, I mean, it seems like fire is a responsible party because they if there is a fire caused by these guys.'",
        "'speaker_1': 'I'm just wondering if there's any other role for any other departments to play. So I would ask that question of the team as you guys are working on this. And the last thing I'll say is, if there's a way for the for the alert Long Beach, for there to be a notice, to go out through that alert'",
        "'speaker_1': 'about how to file complaints on fireworks, I think that would be really helpful to make sure that the city is is playing a key role in educating people on the right steps to take. I know that in the past we've done things like sending postcards or putting something in people's bills, and I know that's really expensive, but'",
        "'speaker_1': 'I would hope that after the program is finalized that we can send that information out. Thank you.'",
        "'speaker_7': 'And the alert Long Beach is scheduled by the by the public affairs team, and that's scheduled for Friday to go out to announce the new program and how you can help us track through data where fireworks are happening and to get specific complaints about properties to the city prosecutor.'",
        "'speaker_1': 'Can I ask one more question? What we're talking about this on. There was some chat a while back whenever we started the COVID crisis and trying to get information about the DMV playing a role in connecting people who have driver's licenses in the city of Long Beach to the city of Long Beach's alert Long Beach, is that'",
        "'speaker_1': 'something that's happened or could potentially happen to make sure that we're getting contact with more people?'",
        "'speaker_7': 'I don't think we've quite heard that in terms of the DMV's role. We get it through a firm and we basically have everybody's land line in our database, and then we ask people to opt in through cell phones.'",
        "'speaker_7': 'So if there's another way to get additional numbers that we can expand our reach, we'd be interested in looking at that.'",
        "'speaker_1': 'Okay. I think that's all.'",
        "'speaker_2': 'Thank you. Thank you. This is the government. And they have.'",
        "'speaker_1': 'Thank you, Vice Mayor. I just was queuing up because I had thought that I had thickened on that motion a bit earlier, but not sure if that was captured.'",
        "'speaker_2': 'And nice of you to come to Austin.'",
        "'speaker_6': 'Thank you. I think we've. We really had a great conversation and I really appreciate the feedback from all of my colleagues and it's a very important item. Again, you know, I will acknowledge that this is a unique time and an odd issue to be in talking about enforcement.'",
        "'speaker_6': 'But, you know, we do live in a society made up of laws. And this is about being a good neighbor. This is about, you know, respecting your know, your neighbor and the community as a whole and understanding that these aren't these aren't safe.'",
        "'speaker_6': 'The same fireworks that we're talking about necessarily, although all fireworks are illegal, these are explosives. These are very disruptive to the quality of life, but also to the mental health of many of our our neighbors and residents. And so let's keep that in mind as we move forward.'",
        "'speaker_6': 'Appreciate the conversation. And I look forward to hopefully some productive results out of this. Thank you.'",
        "'speaker_2': 'Because when I stood up to come in.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'There's public comment for this item. I believe there are eight callers on the line.'",
        "'speaker_5': 'First up is Seagram's. Your time starts now. Seagrams, are you there? Hello. Next speaker is. And Sheryl. Your time starts now.'",
        "'speaker_1': 'Thank you. My name is. I live my name. I'm Cheryl. I live in District two. First off, I just want to start by saying, as was just said a little bit ago, we are not talking about safe and sane folks here.'",
        "'speaker_1': 'We're talking about dangerous explosives that are legal statewide. Some of them, the eighties and up are illegal on a federal level. So we're not talking about little baby fireworks. We're talking about things are dangerous. They set fires. They're dangerous to be near.'",
        "'speaker_1': 'I've had my back patio scoured by firewood from my neighbor two doors over the days and education are nice and all that, but a lot of these people are shooting these off. No, they're shooting off illegal fireworks. They know they're breaking the law and they don't care because they know they won't be caught, because they know that'",
        "'speaker_1': 'even when when police come out to their doors, unless they've seen it happening, nothing will happen to them. They just deny that they've done it and continue to do it as soon as the police leave. My neighbors do that.'",
        "'speaker_1': 'My neighbor did it just the other night when I called the cops on them. They let them off as soon as the cops left. In fact, those same neighbors I confronted a few weeks ago about firing off fireworks and mentioned that it terrifies my dog.'",
        "'speaker_1': 'Not only did they basically just tell me to go f off, but they told me that they hope my dogs died and became very intimidating to me. I'm a spy to middle aged woman, and even though I have a very fiery personality, having to confront people, putting off fireworks is dangerous for me.'",
        "'speaker_1': 'These people don't care that it's illegal, which means that they don't care if I'm asking them to stop because my dogs are scared or because kids.'",
        "'speaker_2': 'Are scared or.'",
        "'speaker_1': 'That they're scared, they basically just slip their fingers off of this and continue to do it. And if we try to say anything more to them, they become belligerent and confrontational and intimidating and threatening to us. One of the things that I have a problem with is that I've we've actually in my neighborhood in Rose Park had'",
        "'speaker_1': 'police that we've called out who are down the street from fireworks going off that we had given them addresses for. And they aren't doing anything. They just are. You're chatting with somebody they just took a report from when there's fireworks literally a half a block away that both me and a friend of mine at separate time pointed'",
        "'speaker_1': 'out to an officer. And he was like, Yeah, yeah, I'm going to be there in a minute. By the time he got there, there was a huge fight breaking out among people. So the fireworks are now forgotten. When we called in the same addresses over and over again, and I personally called in one address literally every single'",
        "'speaker_1': 'night for three weeks. It took that much of me calling and other people calling on the same address over and over and over again for the police to actually finally do what they should have been doing, which is waiting down the block.'",
        "'speaker_1': 'A friend of mine witnessed it happen, waiting down the block until these people saw the fireworks again and bussing them for it. Finally, thank God, because that particular address has been keeping me up night after night after night.'",
        "'speaker_1': 'We need to.'",
        "'speaker_5': 'Thank you for your comment. Next up, we have Sheryl Simmons. Your time starts now.'",
        "'speaker_1': 'Thank you. Thank you. Mayor Garcia and city council members who have heard our pleas and have shown.'",
        "'speaker_2': 'Up.'",
        "'speaker_1': 'Positive action in the last week with regards to the illegal explosive problems happening throughout our city. My name is Cheryl Sanchez Simmons. And on behalf of District two, I urge the passing of the agenda item 25. That is it as it is a good beginning to stopping these illegal explosives.'",
        "'speaker_1': 'I would also like to ask that Councilwoman Pierce have an open dialog with the residents in District two. Councilman Austin recently held a town hall on this issue for the residents in District nine. This would be productive for all of us that live in the area to come up with ideas and solutions to stop the bombardment here'",
        "'speaker_1': 'in District two. Thank you, city prosecutor Doug Halbert for giving us a tool to use to report those offenders directly to the city. I am hoping that law enforcement now begins to take this problem seriously and does not continue to turn a blind eye when they see the offenders shooting off murders like they have been seen doing'",
        "'speaker_1': 'in this past week. I would also continue to suggest an anonymous hotline that people can leave addresses and not fear retaliation. Just a reminder that the Facebook group Long Beach against illegal fireworks with over 1500 members has gathered data and does have a map of.'",
        "'speaker_2': 'Where these explosives are being detonated. Please keep the dialog.'",
        "'speaker_1': 'Open with the residents of Long Beach on this issue as it takes a community.'",
        "'speaker_2': 'To help solve this problem.'",
        "'speaker_1': 'I am still willing to be part of a resident task force, along with city leaders, to help come up with solutions to this problem. Thank you.'",
        "'speaker_5': 'Thank you. Next up, we have Claudia Vega. Your time starts now.'",
        "'speaker_1': 'Hi. I am a concerned resident of District nine. The reckless use of fireworks in our community have become a danger to ourselves and our property. A few years ago, my parents home caught on fire. And just last year, our neighbor's backyard went up in flames on 4th of July.'",
        "'speaker_1': 'My elderly parents cannot leave their home the days leading up to the 4th of July and fear of their home catching on fire again. No one should live in the fear. We find ourselves calling the police constantly on these offenders, but nothing is really done.'",
        "'speaker_1': 'The police have dropped by at the moment. They turn the corner. The explosions can begin again. As long as there are no consequences for these people, the fireworks will continue. We have to start enforcing the fines and increasing fines and or jail time.'",
        "'speaker_1': 'Otherwise, they will continue knowing that there are no real consequences. And just as a side note, Lakewood does have a fine of $2,000 a day. Just increase that apparently this year. We have to start making examples out of these offenders by by making them by enforcing the fines so that they receive the message that Long Beach will'",
        "'speaker_1': 'no longer tolerate this. Residents are putting their safety underline down the people that are terrorizing communities themselves. What we need is more police in our neighborhoods, especially District nine, that has always been neglected and deprived. These people using these explosive devices have no regard to other people's property.'",
        "'speaker_1': 'Last year we had a group of people lighting them up right next to our own garage. The police were called, but never came. My husband had to go outside and confront the group himself and take matters into his own hands.'",
        "'speaker_1': 'This can create an unsafe situation, which is why we need our calls to be taken more seriously. I've heard several testimonies from residents that are 911 calls are not being taken seriously. There have also been several fires here in our district that have probably been caused by illegal fireworks recently in the Deep Pass Park area.'",
        "'speaker_1': 'There was also a young man who recently lost his hand while lighting up this explosive. If it wasn't for a Facebook page, I mean, I would have never heard of this incident. We have to take these tragedies as opportunities to educate the public.'",
        "'speaker_1': 'When this happens in our neighborhood, the people we know, it's easier for us to relate. We need to do more. Some of the things some residents have discussed as possible solutions are to increase the fines and to impose them to use the Long Beach alert tax to continuously remind residents of illegal fireworks.'",
        "'speaker_1': 'We have also heard of the use of drones and other studies. And we need we need more police on bikes in our neighborhoods. Thank you for your time.'",
        "'speaker_5': 'Thank you. Next up is Jamie Larsen. Your time starts now.'",
        "'speaker_1': 'Thank you very much, Mayor Garcia, and the city council people this evening. I think there's been some really, really great feedback here and many of you have really had your thumb on the pulse of what's going on. I think that we can hear in everyone's voice and everyone's concerned and something that I would like to suggest and'",
        "'speaker_1': 'would be more than happy to for as far as the residents to help organize, is that it's a bit difficult to try to organize chaos in chaos, and I think it will realistic. We're going to understand that this is going to go through Labor Day.'",
        "'speaker_1': 'It did last year. And there seems to be a resolve in Long Beach this time of year. But it's like, yeah, well, it kind of happens this time of year. So how about when it calms down in the timeframe that it's not happening?'",
        "'speaker_1': 'Let's keep the momentum going. And I'd love to know how we as residents, all of these suggestions are great, but they're in midst of a panic. And so I love to keep the momentum going and find out exactly how we can pass these things.'",
        "'speaker_1': 'So the 2021 is our goal because I don't want to be a downer, but we're in this right now, and this fight is difficult for the police. It's difficult for our elected officials and obviously for our residents. So we could come up with suggestions and then have a better idea next year of how to do it.'",
        "'speaker_1': 'Like maybe a hotline that doesn't take up of dispatchers time, something that's more specific that we get when we know what's coming or that we know what's happening. A councilman earlier asked, and forgive me, I don't remember your name about surrounding areas.'",
        "'speaker_1': 'Pasadena. Just as an example, if you are caught with fireworks in your car, your car is immediately impounded. For anyone dealing with fireworks, you may spend up to a year in jail and the fines go up to $50,000.'",
        "'speaker_1': 'So there are different amounts that are around there. Another suggestion that I thought that we could work on throughout the year is everybody understands that when they go through a construction zone, if you are caught speeding, it's double the fine.'",
        "'speaker_1': 'So maybe we keep the thousand dollar fine from October to May and then June through September. It is a ridiculously high fine because I hate to say it, but fear changes people and having to pay a lot of money and the fear of being put in jail, that is unfortunately what creates change when we're talking about the'",
        "'speaker_1': 'situation. Drinking and driving became $20,000 and would literally ruin your life. And that's when things started to change. It's sad, but it's true. So my thoughts on this and just understanding more about it is I love to have a future meeting with more questions.'",
        "'speaker_1': 'I have a few more about the portal, so I'd love for that not to just sort of end with the summer and I am in District six, so I would be more than happy to help organize any district that wants to speak throughout the year and make sure that we're really well organized.'",
        "'speaker_1': 'And we don't just sort of forget this after Labor Day. But again, I want to thank our police department and our elected officials, because the Facebook page became 1500 people in less than a year. And I think.'",
        "'speaker_5': 'Next we have Kathleen. S Your time starts now.'",
        "'speaker_1': 'Hi. My name is Kathleen Shane. I live in District eight. I wanted to first thank you, Austin, for the meeting on June 15th and the action plan that you put together and Doug Hopper for the portal for us to report issues with fireworks.'",
        "'speaker_1': 'Jamie did mention about the drones and the cameras. I wanted to add that to see if that's something that's feasible. Also, our our the task force that we have for the four officers, are they on patrol on bikes or cars?'",
        "'speaker_1': 'And in addition, I just wanted to comment on some of the items that were brought up by council members. One of them was PTSD for the vets. But there's also a lot of people that do suffer with PTSD, not just veterans.'",
        "'speaker_1': 'So I wanted to know if that would open up to other people that do suffer from PTSD. Also, I agree with the California statewide. We need to look at the California laws. I am looking at one right now where it shows that there are misdemeanors for illegal fireworks and also felonies for illegal.'",
        "'speaker_2': 'Fireworks for quantity.'",
        "'speaker_1': 'I feel that that's where we need to address. Also, I wanted to. Talk about if we do the California state wide mandate, try to implement some laws regarding that, would that be able to have.'",
        "'speaker_2': 'Checkpoints.'",
        "'speaker_1': 'For people coming into our state that are coming.'",
        "'speaker_2': 'From.'",
        "'speaker_1': 'States that are high volume of purchasing these items? And I think that is all I wanted to say. Thank you. And I wanted to thank the city council and everybody for their passion.'",
        "'speaker_2': 'Regarding this issue.'",
        "'speaker_5': 'Thank you. Next, we have Samantha Hardy. Your time starts now.'",
        "'speaker_1': 'Hello, City Council. My name is Samantha Hardy, and I live in District seven of Long Beach. And I just have to say that something really needs to be done with these fireworks. I've lived in this district my whole life, and it has never been this bad.'",
        "'speaker_1': 'I hear all these signs that say fireworks are illegal in Long Beach, but you wouldn't be able to tell that if you came to my neighborhood. And I'm going to comment this in sort of a personal sort of a personal level right now.'",
        "'speaker_1': 'My mom's high blood pressure is through the roof with all these fireworks. And my uncle's going to be coming home in the next few days after having a triple bypass so he won't be really able to take them either.'",
        "'speaker_1': 'I've had to endure these fireworks and explosions through my whole ear surgery recovery process. And let's not forget about our furry friends that live not only in this house, but in all the other houses that are absolutely terrified.'",
        "'speaker_1': 'I've spoken to many of my neighbors and they're upset about this situation. My mom and I call every night and it seems like nothing is done. I'm part of the group on Facebook that's trying to help stop this.'",
        "'speaker_1': 'But when we're met with dial tones or operators who just don't care, then we kind of feel helpless. These explosions go on for hours and they are terrorizing our neighborhood. Something needs to be done because it's been going on since March and it will continue to go on.'",
        "'speaker_1': 'As a teacher, I know that sometimes teaching can only do so much, and these people who are firing off fireworks every night need more than a talking to or a warning. Thank you very much for your time.'",
        "'speaker_5': 'Thank you. Our last speaker is Seagram. Your time starts now. See Graham.'",
        "'speaker_1': 'Yes. Listen, my mom's on call every day. Hi. Is this sort of agenda item 25?'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'I think it's absolutely disgraceful. My name is Caitlyn and I live in District three. I think it's absolutely disgraceful that you are continually continuing to criminalize people. We are calling for defunding of the police of liberty. And she.'",
        "'speaker_1': 'Instead of walking in the streets calling you to do council members, you have a constituency, you have a people to hear and you public people to act on behalf of. We are the people and we are asking you to defund the police.'",
        "'speaker_1': 'This measure on fireworks is absolutely ridiculous for the penalize and criminalize people. Shame on all of you. Shame on each one of you. And the price especially. Shame on you as my district comp person. This is absurd. We need to have a total restructuring of the things that are going on in the city.'",
        "'speaker_1': 'I yield my time.'",
        "'speaker_5': 'Thank you. And that concludes public comment for this item.'",
        "'speaker_4': 'Thank you. Let's go ahead and take a roll call vote then on this item, please.'",
        "'speaker_0': 'District one. I district to. I'm district three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District or.'",
        "'speaker_2': 'My.'",
        "'speaker_0': 'District by district six.'",
        "'speaker_4': 'Five.'",
        "'speaker_0': 'District seven. District seven. District eight.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Ordinance to Establish Repayment Schedule for Rent Deferred Due to COVID-19.": [
        "'speaker_4': 'Okay. Thank you. Move carries on item 25. So now we're going to be moving on to item number 26, please.'",
        "'speaker_0': 'Communication from City Attorney. Recommendation to direct City Attorney to prepare an ordinance amending the Long Beach Municipal Code to require that residential and commercial rent deferred due to COVID 19 impacts be repaid according to a schedule citywide.'",
        "'speaker_4': 'Okay. Think we're going to have a report from the city attorney.'",
        "'speaker_7': 'First mayor, members of the council, Rich Anthony. You might be having some technical difficulties. This item was brought back to the council, requested us to come back and present the council with options for the repayment of the rent deferred due to COVID 19 impacts and according to a payment schedule tonight for your consideration.'",
        "'speaker_7': 'The item presents four options or three options, and obviously the Council can and are various other options that are available. We are here to answer questions and take your comment. Thank you.'",
        "'speaker_4': 'Okay. Thank you. We're going to go ahead and go to the council of council. I'm sorry. City attorney Rich Anthony on the line now, by any chance.'",
        "'speaker_7': 'Richard, are you on the line?'",
        "'speaker_2': 'Yeah. I'm sorry. Can you hear me? This is Rick. Anthony, can you hear me?'",
        "'speaker_4': 'Yeah, we can hear you now.'",
        "'speaker_2': 'Okay, I apologize. I was having muting trouble, but Charlie summarized it well. I just wanted to remind counsel that you asked me to bring this back on May 26. We originally we're going to bring it back in July.'",
        "'speaker_2': 'It keeps coming back a little bit earlier because I do think is it important? It is important for both landlords and tenants to see if there's going to be a repayment schedule. I think they need as much time as possible to know that in order to plan for the future.'",
        "'speaker_2': 'With that, I stand by to answer any questions, which I'm sure there will be a fair amount during discussion. Thanks.'",
        "'speaker_4': 'Thank you, Mr. Anthony. All right. I have Councilmember Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. So in the discussion around moratorium extension, there was a lot of discussion about really the need to help support people, make sure that they don't get have this large balloon payment at the end of the repayment period that city council put forward.'",
        "'speaker_3': 'I think the council made the right decision to give people up to a year to catch up on their rent. And I think the concern is if people are already struggling. And when they you know, when they begin to pay full rent on August 1st, it's going to be it may be difficult to make some of those'",
        "'speaker_3': 'back up payments. You know, by proposing a repayment plan that could inadvertently trigger evictions, I don't think that that was the goal of the city council either. I think this is a moment where we just have to think about what the problem is and how best we can help people solve their problem.'",
        "'speaker_3': 'If we want to help people, I think we should address the fact that. When come August 1st, when people are paying full rent, when the moratorium period is over, those people are really struggling. We should really help them.'",
        "'speaker_3': 'We should target our resources to help them with the back rate so that they don't have a problem in the future. So the idea here is that the purpose here is we don't want to lose sight of the point is to help people.'",
        "'speaker_3': 'This program should not be something that inadvertently triggers evictions for anyone. It should be voluntary. It should be incentivized. I'm not interested in putting forth a policy that triggers more evictions. Money should be our resources should be targeted at helping renters get out of the hole during the pandemic.'",
        "'speaker_3': 'For that said, I think I think the solution here is to take our rental assistance fund and look at ways that we can target that to help people make up their back rent. It's very limited resources. It's only $5 million.'",
        "'speaker_3': 'There's potential to add more. It was only $5 million here. There's 300,000 people in the city that live in a real household. That money is going to go very, very fast. If you think about the universe of people who are paying the rent in August.'",
        "'speaker_3': 'Let's say they paid 50% or 70% in the past and they're going to need to be caught up. That funding will go a long way to help support them get out of the hole. And that's the way we should be thinking about it.'",
        "'speaker_3': 'Targeted resources to help people get out of the hole. So what I have in mind is sort of a matching program that can help match dollar for dollar. Somebody helps make a payment to the back rent and the city can come in and match.'",
        "'speaker_3': 'Obviously the details of the program would need to be shaped up. But to be clear, what I'm not interested in is a policy that triggers evictions, but rather right now are programs to incentivize people through matching, to pay back whatever they can in the city will help them get out of that hole.'",
        "'speaker_3': 'So I have a motion I move that we receive and file a report from the city attorney and direct the city attorney to take no further action at this time regarding repayment schedules or benchmarks. In addition, in order to address potential failures to pay that deferred rent and evictions resulting therefrom, we direct the city manager to propose'",
        "'speaker_3': 'a program for City Council consideration at a future meeting date which could allocate current and future federal and state rental assistance funds to the payment of deferred rent during the moratorium period that the City Council has established. This program should be limited to repayment of rent.'",
        "'speaker_3': 'That's deferred pursuant to our moratorium. It should provide a dollar for dollar match. It should be available to any tenant who can document the reverse impacts from COVID, the people who are behind on their rent from that period of time and to the extent of the funding sources, allow, not just those who are I mean, this should'",
        "'speaker_3': 'be open to anybody who sort of has back rent, because I think our dollars go further that way and we can actually help people get out of the hole. That is my motion, and I'm happy to accept any questions or clarity that folks might have.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Okay. The that's the motion. Is there there a second to have a long list ahead of me up.'",
        "'speaker_1': 'Councilmember Pierce. 1/2.'",
        "'speaker_4': 'Okay. Well, let me go down the list, Councilmember, your. I have one person in between. Vice Mayor Andres.'",
        "'speaker_2': 'Okay. Yes. Thank you, sir. Thank you, Mayor. First of all, you know, I think it's it's really unfortunate that we are once again debating people's livelihood. Where you are, Kenneth Orlando. It is unfortunate that it takes government involvement to sort out.'",
        "'speaker_2': 'Just because at the end of the day, we're not going to reach an agreement that makes everyone happy. My district, which is the sixth District, has a large population of people who left. And it's also one of the communities have struggled with their basic needs since COVID.'",
        "'speaker_2': 'There's not a single tenant I have spoken to when asked for rent rental assistance that is unwilling to pay rent. It is the same premise where they reach out. They want us to help them pay their rent. I believe that if we do not establish a repayment plan, our community is going to fall into a great debt'",
        "'speaker_2': '. They will not be able to come out of. I do not think they remember. I do not think that as a member, it is our role to establish a specific a specific repayment plan, because every household is different and every household income and spending needs are different.'",
        "'speaker_2': 'I received about 90 emails in support of a repayment plan and about 45 against the repayment plan. And I want to see where this conversation goes tonight. And I really want us as a city to use dollars and resources available to help people get their rent paid all across the board.'",
        "'speaker_2': 'And I'd like to hear some more dialog before speaking some more. And I want to make sure that everyone would qualify for this program regardless of income. I believe this program should apply to anyone who owned that, who owes back do rent because the corporate customers in Washington.'",
        "'speaker_2': 'Do you see that as your motion?'",
        "'speaker_3': 'Absolutely. Look, it's limited resources. I think targeted at people who are behind will go a lot further, especially if it's a matching and sort of just putting it out broadly to 300,000 people who live a real household across the city.'",
        "'speaker_3': 'They will get more bang for our buck and actually help, which is the point, help people out of the hole. Yes, sir. Mayor.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you. Next up is Councilman Pierce.'",
        "'speaker_1': 'Thank you, Mayor. I want to thank Councilmember Richardson for his motion. I think that it is in alignment with what we see the needs to be in our community. I was happy to bring forward the item that this stemmed from, which was a 12 month delay and being able to support people that we told there's a moratorium'",
        "'speaker_1': '. We told them there's a moratorium to evict you, pay what you can, because we, the government told them you can't go to work. We the government told them, you need to stay home. Stay home. I cannot support anything that we then turn around and create a mechanism that would affect tenants for doing what we told them that'",
        "'speaker_1': 'they could do. And so I just want to get on the record. Two questions with Rich Anthony. If there was a repayment section and I know that's not the motion on the floor, but I want to just ask the question if there was a repayment option and a schedule, would tenants be at risk of being evicted if'",
        "'speaker_1': ', say, they paid their full rent but they didn't pay the full amount that that payment plan had included?'",
        "'speaker_2': 'Yes. Let me make sure that you all can hear me. You can, right?'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Yes. Good. Yes. So if I understand your question correctly, Council Member Pearce, if you were to adopt a benchmark payment requirement, any one of the three outlined in the letter or something else which required tenants to pay a certain percentage.'",
        "'speaker_2': 'You know, as we move through the upcoming year, then yes, the if they failed to make that payment, the idea would be that they would then be subject to eviction even if they were current on their regular rental payments.'",
        "'speaker_2': 'The benchmark system in other cities that have adopted it is meant to to require the tenant to pay. But of course, as you said, that's not the motion that's on the floor right now.'",
        "'speaker_1': 'Thank you. And my my other question is what we have right now, if we receive and file this today. When the 12 month period ends and there are tenants that cannot pay their full rent, they can then be evicted at that end of that 12 month period.'",
        "'speaker_2': 'That's right. As of August 1st, 2021. That's right.'",
        "'speaker_1': 'Right. So I understand that the conversation with some of the landlords has been wanting to understand when they would get paid. There's a relationship that landlords and tenants have. I've been a renter my entire life. I know the relationship.'",
        "'speaker_1': 'Well, if there's an issue, you call your landlord. Sometimes you don't call your landlord because you're scared. Right now, I'm spent as a renter. I don't know if I'm the only renter on this on this council, but I know I'm a renter, a single mom that rent an apartment in my district.'",
        "'speaker_1': 'The cheapest thing I can find for a two bedroom with $800. And I know that my landlord, since I have not been paying for rent because I am not consulting, in addition to being a councilwoman, he is here every single day.'",
        "'speaker_1': 'He is here. Fixing the roof, fixing a window, tapping on my door to ask if everything is okay. He is here more than he's ever been in the three years I've lived here. And while he's not saying anything that's threatening to me, it makes me very anxious.'",
        "'speaker_1': 'And it has meant that I've put off other bills to make sure that I spend whatever I can on my rent. And so the idea that tenants are going to wait to pay a balloon payment is something that we have fear of.'",
        "'speaker_1': 'But that has not been demonstrated. And I think that there's some numbers out there. About 80% of tenants are paying their full rent. And so I would hate for us to create a mechanism to evict anybody for any reason that's not already law.'",
        "'speaker_1': 'And so with that, I just wanted to make sure I had those facts on the on the record. People can't be evicted if they don't pay their rent based on what we have now. But that period is 12 months later.'",
        "'speaker_1': 'So thank you, Councilmember Richardson, for making the motion. I really hope that we can move on and get to this other program that you've outlined, which I think is a fantastic program that I fully support and look forward to having that discussion when the time is appropriate.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Count twins. And they have.'",
        "'speaker_1': 'Mayor for and thank you, Councilmember Richardson, for doing this this motion. I, too, have been conflicted on this repayment plan. I definitely do not want to see our. Renters, you know? Be faced with the possibility of being evicted due to not being able to match the rent repayment plan.'",
        "'speaker_1': 'But I also don't want to see our property owners lose out on the rent that they that they so rightfully deserve. I know that we're in a special times right now, that we're during COVID. And like Councilmember Pearce said, you know, we did ask all everyone to please stay at home to, you know, restrain from going to'",
        "'speaker_1': 'work. Everybody closed down. So, you know, it's it is kind of unfair if we kind of like jump and put a repayment plan and ask them to do it here like this when we know that they're facing uncertain times ahead.'",
        "'speaker_1': 'So I think that by filing this report, receiving, receiving and filing this report is the right direction to go to as we explore a little bit more on how things are going to be in the next couple of months.'",
        "'speaker_1': 'I think this is the right direction. But I'd also like to see. And I'm hopeful, you know, too, that a lot of the tenants like myself, I'm also a renter. And I also fear of not being able to pay rent, you know, at times.'",
        "'speaker_1': 'But. You know, i1i myself know that rent to me is a priority and I want to assume that it is for all of those of the renters as well, and that, you know, those renters are not going to try to not pay rent because rent is something that they really want to do as it is for me'",
        "'speaker_1': ', because, you know, to have a safe place to live. So I again, I do think that this might be the right thing to do right at this moment. So I encourage my colleagues to support this at this moment.'",
        "'speaker_4': 'Thank you, Councilmember Ranga. Counseling for your anger. I think you're muted. Council member. Think your muted.'",
        "'speaker_6': 'You hear me now?'",
        "'speaker_4': 'Yes.'",
        "'speaker_6': 'Oh, geez. Okay. For some reason near me, I think that the two council members who are renters set the story straight. They're the ones that had the experience and they lived it. There's a lot of moving parts. And this item here that I can't agree with of the biggest one, of course, being COVID 19 and the direction'",
        "'speaker_6': 'that it's taking. When we look at whether people are going to be going back to work or not or when they go back to work or not, it's a matter of how many.'",
        "'speaker_2': 'Hours are going to go back to.'",
        "'speaker_6': 'Work and what and even if they have a job.'",
        "'speaker_2': 'Waiting for them.'",
        "'speaker_6': 'So I think the sad in the way it's being presented today is not an item that I can support. So I'm going to be supporting the of the receiving file with the additional comments that the Councilmember reached to put in in terms of looking into some kind of matching program that we might be able to to assist'",
        "'speaker_6': 'renters with. So I'll be supportive of the motion. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Austin.'",
        "'speaker_6': 'Thank you. And I have a couple questions regarding the receiver, not file motion, but I'll also make a few comments. No, I think the spirit of what? We as a council understanding these really unprecedented times and challenges that we have been presented, that have been presented to our constituents, our residents throughout the city, renters, property owners, business'",
        "'speaker_6': 'owners, small businesses. This is we were we were we were we've been faced with really unprecedented decisions. Right. And the. Much of what we did was all in good faith. It was all to help people or support families to provide economic relief.'",
        "'speaker_6': 'We passed the package hastily. Right. And we with the intent of getting it right. And I think for the most part, it has worked out. But then there were the unintended. I don't think it was ever intended that the eviction moratorium would what mean, you know, a French rent vacation or free rent because there's no free mortgage'",
        "'speaker_6': '. There's there's a system there's an economic system that has been disrupted. And. I do. And I think the intent of what's creating the Long Beach Cares program, the rental assistance program that we passed just a week ago or two weeks ago, was intended to do justice to help people catch up on their rent and allows for up'",
        "'speaker_6': 'to $1,000 a month for three months. And so I'm not sure exactly if we received a file. Are we looking to create the same program for the same intent or. Or what? So I'm a little confused about that part.'",
        "'speaker_6': 'I'm okay with putting this item right, because I think it gives us a little time to to work it out and to work the details out. But we are in as smart and efficient with the resources and helping the folks that.'",
        "'speaker_4': 'Councilman Austin. I think we lost you.'",
        "'speaker_6': 'And a landlord and I think the city council and I've heard it. Well, now appreciate what you said of council members. And they have. I appreciate and I encourage good faith between those parties. Right. I would say that the vast majority of renters and landlords are going to work it out and should have the ability to work'",
        "'speaker_6': 'work it out. And so what is proposed here is very prescriptive. I we have four options on this notion that are very prescriptive. That. Could. Essentially, if it doesn't work, we create an unintended consequence. But I also would say that.'",
        "'speaker_6': 'We look forward. A year from now and someone is three months behind on their rent. Are we still looking at the same? To do what they in terms of potential eviction because they are behind on their rent. I don't know that answer, but I certainly do not want to.'",
        "'speaker_6': 'Contributed to anyone being evicted or losing their housing as a result of this this economic. Chaos that we're in that. With no fault of anybody. Not. Not the fault of the renter. Not the fault of the. The landlord, a property owner and really not the fault of the city.'",
        "'speaker_6': 'I think we're all trying to to to work to get to a good place. And so I guess my question to Councilmember Richardson, in terms of the receiver file, what can you. Can you tell us again what the direction.'",
        "'speaker_6': 'Absolutely. Where we want to go, because this is not written down up, by the way. You know, we're just kind of interested.'",
        "'speaker_3': 'So so, councilman, thank you for allowing me to clarify. So and thinking about a way to structure what a voluntary program would look like that didn't trigger evictions, but could incentivize people to make payments by matching it. I spoke with Rich Anthony about the appropriate action that we can provide so that he understood it.'",
        "'speaker_3': 'And so I think so. I think I structured it based on that discussion. I think it would be helpful if we just hear from Rich on how he understands the request. It's it's it is what we have in front of us.'",
        "'speaker_3': 'The ordinance we have in front of us is specifically related to a repayment plan. And whatever repayment plan we do, if people default, that triggers the eviction. So the appropriate action, whoever the appropriate action is to not do it within ordinance but within, within the program.'",
        "'speaker_3': 'Charlie Great.'",
        "'speaker_2': 'Sure. So just to clarify, there's not an ordinance before you right now. What was before you was the direction to give the city attorney direction to adopt an ordinance which would amend 8.1? I'm hearing the motion loud and clear.'",
        "'speaker_2': 'That's not what is on the table now. But in order to. Councilmember Richardson, I think what you were trying to do is without imposing a strict commitment schedule, you were trying to address what you see as a potential problem, which I think Al just also noted, which is there may in fact, be a year from now.'",
        "'speaker_2': 'A lot of tenants out there may not, but there may be a lot of tenants that have not been able to repay their deferred rent and come more or less a year from now, a little more than that.'",
        "'speaker_2': 'They're not going to be able to pay all the deferred rent that they need to. And there may be a bit of an eviction crisis occurring in July of 2021. In an effort to address that, Councilmember Richardson is directing city staff.'",
        "'speaker_2': 'I'll be working with city staff, but primarily the city manager, to see about establishing a program very similar to the program that this council approved two weeks ago. Rental assistance. But it would be a little different. I think it would be a it would be a stand alone program.'",
        "'speaker_2': 'The way I see it. People would be eligible for both programs. They could apply for both. And tenants may in fact, qualify for both. It would be limited very specifically to only city dollars would only be given to tenants to pay their deferred rent, rent that they had not paid, and that accrued between March 4th.'",
        "'speaker_2': 'And assuming no extension of this moratorium July 31st of this year, whatever that dollar amount is, the city would have this program and would pay up to half of that dollar amount, presuming that the tenant pays the other half.'",
        "'speaker_2': 'So so because this was admittedly this was not agenda on tonight's agenda because we didn't know it would come. And that is why we're discussing the program now. But we'd have to bring this back. We got to give staff a little bit of time to think about how it would work to identify any potential problems.'",
        "'speaker_2': 'Although I've been we've been thinking about that for a while now, and I don't think there are. And then we would bring this back for formal approval and establishment by the council, you know, as soon as we can, and we will highlight any sort of direction that we need at that time.'",
        "'speaker_7': 'And this is tell me if I can make a quick question to the maker of the motion. I need to understand is this Instead of the $5 Million program, which we have $5 million for taking a portion of that or some of it, I just need to know if we hit pause on that program because we don't'",
        "'speaker_7': 'have any other dollars allocated for any type of new tenant program at this time. So some direction on that would be helpful.'",
        "'speaker_3': 'Sure. And I don't think you should cancel the program. I think you should look at some of the resources that indicated that program and figure out what portion to be targeted for this. And then and then as additional CARES Act funding comes in, we should we should increase it.'",
        "'speaker_3': 'To be clear. I'm not. What I'm saying is it's a repayment program as opposed to a structure repayment plan or a repayment program. And that program incentivizes matching. That's what I'm saying. So I think you can take some time and then bring it back.'",
        "'speaker_7': 'Okay. So given that then, because really the portion of the program, we would take a short break before we implement that program to evaluate this should the motion move forward.'",
        "'speaker_4': 'Thank you, Mr.. Let me let me let me keep going forward.'",
        "'speaker_6': 'I'm not. I'm not. That was the question. Clarifying question. May I just. I do have the floor.'",
        "'speaker_4': 'I. I was giving I was giving you a back and forth. Okay. So let me just keep moving forward. So, Councilman Austin.'",
        "'speaker_6': 'So I guess my my question for the city manager is, I know we've received some more relief from the county. Could there be funds in that to go toward this in addition to the Long Beach care program that we have?'",
        "'speaker_6': 'And then secondly, I know. Councilmember Richardson We are also working on getting money in the Heroes Act potentially from DC to help with some of the economic relief work that we want to do. I would say earmark or contingency or for that for this type of program, because what we're also looking at is we don't necessarily have'",
        "'speaker_6': 'to have it today. We sounds like we have some time to to work out a replacement plan for for those who are in arrears. So those are my comments. I'm really interested to hear the discussion from my colleagues on this.'",
        "'speaker_6': 'This is this is I think it's encouraging. I, I want to. I don't feel so comfortable with an ordinance at this point to to mandate the repayment. I do like the idea of a program. I like the incentive incentivizing repayment.'",
        "'speaker_6': 'And I think this council should be in a place where we're encouraging folks to continue that good faith relationship between and it's a landlords. Thanks.'",
        "'speaker_4': 'Thank you, Councilman. I have concern from Vice Mayor Andrews. Actually Vice mayor, do they have. I have two people that haven't spoken yet. So let me go to them and they'll come back around just for a second round.'",
        "'speaker_4': 'Captain for Superman.'",
        "'speaker_2': 'Thank you. I have a question on clarification on an issue and maybe be making this step. I think I heard two different things, and that is let's let's talk about first things first. Would at the sunset of the eviction moratorium, what is the date that typically renters would pay their first rent?'",
        "'speaker_2': 'Would that be August one? Yeah. This is rich council member Super nine. Yeah, I think that's the way it would work. The as the ordinance currently written sunsets on July 31st. I mean, I think everyone on the call probably knows 90% or more of residential rent's due on the first of the month and that that will be'",
        "'speaker_2': 'due on August 1st. Regular rent not the deferred rent, but regular rent. I think it's safe to assume what we do in the vast majority of cases the day after the sunset. Okay. So could you take a guess at then?'",
        "'speaker_2': 'Well, I think I brought this point up at a previous meeting, but I think it's a very important point. So I'll reiterated. Um, if that rent payment is missed, is the penalty that the back rent is due at that time.'",
        "'speaker_2': 'Yes. So if that if that rent payment is missed. After a three day notice to pay her quit is is delivered to the tenant. Then what we want to make sure is if if the if an unlawful detainer is moving forward legitimately based on August 1st rent or any rent thereafter, the landlord has the right to include'",
        "'speaker_2': 'in this lawsuit the repayment of all deferred rent at that time. So I don't think it's right to say if if the rent payment is missed on August 1st, all deferred rent is immediately due. The tenant still has the opportunity to go through the three day notice to pay or quit procedure.'",
        "'speaker_2': 'Okay. So for the sake of argument on on let's say August 7th that that would kick in and that. Yeah, that's right. If they failed if they failed to come current on their August rent in response to the three day notice to quit, then everything would be due August rent and also the deferred rent.'",
        "'speaker_2': 'Okay. And also, Mr. Anthony, you couldn't possibly speculate on when an eviction would physically actually take place in that scenario. I could always speculate on something, but given that currently the Judicial Council, the court says, kept at least unlawful detainers closed, youth courts are closed.'",
        "'speaker_2': 'I don't think that they will be open by August. But whenever they do reopen and this is a bit of speculation, I don't have direct experience, but I do think unlawful detainer actions usually take 5 to 8 weeks to get to completion.'",
        "'speaker_2': 'I may be off on that and I welcome comments from other members of the Council who may have different opinions. Okay. Thank you. The other question I'd like to ask staff is the number of 80% of renters are paying rent.'",
        "'speaker_2': 'Do we have any opinion from any data on that, from staff?'",
        "'speaker_7': 'Linda Tatum will take a shot at that question.'",
        "'speaker_0': 'I'm. Councilman, I'm not sure where that number comes from. We know that there are many that aren't paying, but we don't have a really good, accurate data source that we could give you that would really be based on actual data.'",
        "'speaker_0': 'So it's completely anecdotal.'",
        "'speaker_2': 'Okay. So just to summarize my position here, I'm very concerned about that August one date and I'm equally concerned about the balloon payment, which I think everyone is. So I'll hold any further comments for now. Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Pryce.'",
        "'speaker_1': 'Thank you, Mr. Mayor. And I share I mean, from the very beginning, I have shared very publicly that I am concerned about the concept of the balloon payment. And when we offer things like. Rental assistance, but we don't have mortgage assistance.'",
        "'speaker_1': 'Then the burdens that we're creating are falling on the shoulders of only one entity in the circle that is involved with housing. And I and I definitely concerned about that. I know that the repayment option is not a popular one.'",
        "'speaker_1': 'I'm hearing that from folks to me, and I've shared this with with everyone, I think on the council as a as a commercial tenant, I know that for us, the balloon payments is going to be nearly impossible to meet.'",
        "'speaker_1': 'So we've talked a lot about a partial payment structure that would work. And to Councilman Austin's point, you know, working with your landlord is always the best way to do it and always the best way to ensure that you don't fall into a situation that the city can't really mandate, that we can't really mandate people to meet'",
        "'speaker_1': 'and confer on a payment plan. If we could, I think that's something that we would have thought about a long time ago. So the repayment plan is really an opportunity or an effort to try to be fair to all of the entities that are involved in the housing cycle, the housing provider, as well as the person who's'",
        "'speaker_1': 'occupying the home, the tenant. And I think what we I think we've done a lot to help tenants, and I think it's great. Certainly nobody on this council wants to see people get evicted. Nobody no councilmember wants that.'",
        "'speaker_1': 'But what we are trying to do is to be fair to the folks that aren't getting any mortgage relief. And for anyone out there who thinks banks are offering relief left and right, you're absolutely wrong. That's not happening.'",
        "'speaker_1': 'It's not happening for commercial properties and it's not happening for residential properties, at least not on a large scale. And certainly that's because the government can't intervene and force that as we can with the eviction moratorium for tenants.'",
        "'speaker_1': 'So I would like to see a payment plan, but I also agree that we don't want to do anything that subjects people to earlier eviction. Because if they can't if they can meet their balloon payment, that they're not going to be subject to eviction.'",
        "'speaker_1': 'But if they can't meet their balloon payment and it's unlikely they're even going to be able to make the partial payment, then that's going to subject them to earlier eviction. And nobody wants to see that. My concern I like the idea of the incentivizing and the matching.'",
        "'speaker_1': 'I really do like that idea. I think that is a great way to look at it and it's a great way to offer incentives for people to pay. And they wouldn't get evicted, but the landlord would still get a partial payment.'",
        "'speaker_1': 'The concerns I have with that is one I will say that I don't like the fact that we're leaving it open. Councilman Richardson, I think you and I've been on the council long enough that we know when we are receiving five with they bring it back at some future date.'",
        "'speaker_1': 'We're basically kicking it out with no expectation that it ever come back. I would like to offer as a friendly that we set a time for it to come back, whether it's 30 days or 60 days, to have staff report back on what funding is available and what the limitations on that funding might be.'",
        "'speaker_1': 'The state and federal dollars and county dollars that we're getting to help with rental assistance do come with some restrictions. And some of those restrictions, for example, there's income based qualification. So I'd like to get a better understanding of if we're going to do a repayment incentive program or partial payment incentive program.'",
        "'speaker_1': 'Are there moneys that we can utilize that have less restrictions attached to them so that tenants throughout the city can benefit from it because they may have a higher income in other parts of the city, but they're still tenants and they're still facing the same problems as tenants throughout all of the city.'",
        "'speaker_1': 'So if their rent is, let's say, you know, if they're if their income is is similar to someone living in a cheaper apartment, but they're paying more of their income to rent. But their incomes about the same, then they're really not going to be able to qualify.'",
        "'speaker_1': 'And that puts them in a very difficult situation. They've chosen to pay more of their income to live in a more expensive housing unit, but yet they're not qualified. They're not getting qualified for any sort of rental assistance because they don't make enough money.'",
        "'speaker_1': 'And so I worry about that category of people. And so I'd like to see what options are available. I certainly do not want to cut the current tenant assistance programs that we have, the $5 million that we have, a place that has worked so hard to get that program up and running.'",
        "'speaker_1': 'I'd like to see that program up and running as soon as possible. So I don't want that program to pause. But I would like us to come back in 30 days or 60 days and evaluate what additional funding is available, whether there is any funding or any revenue source that we can tap into that's nontraditional, that might'",
        "'speaker_1': 'help for this sort of program, you know, a back to work type program, maybe it's not even. Earmarked for housing specifically, but to help people get back on their feet on some sort of a stimulus program that might amount that we can utilize to help residents get back on their feet.'",
        "'speaker_1': 'So my friendly would be I'd like to have it come back, not necessarily with a date certain, but, you know, a month certain. And I would hope that you would be amenable to that.'",
        "'speaker_3': 'Absolutely. So when so Rich Anthony mentioned that, I think you mentioned the date of July 14th. And my conversation with him earlier just simply just comes down to how some staff can. And, you know, look at the program.'",
        "'speaker_3': 'Get the details on the color of the money, what restrictions? All of those are important for us to understand. We can do and we want to leverage additional funds as well. I think there are some opportunities. But like you, I want to be urgent about this.'",
        "'speaker_3': 'I think people need help and we should help them as quickly as we can. So I think I think 30 days should be plenty of time. But sooner if we can get this back, the date that that rich man, I think that I would prefer.'",
        "'speaker_3': 'But I think 30 days is 20.'",
        "'speaker_1': 'Oh.'",
        "'speaker_2': 'I'm sorry to interrupt. I would just. This is rich. I'm a little worried that I was being aggressive on that date, given that I'm not the one that's going to be doing most of the work. It's going to be city staffer.'",
        "'speaker_2': 'And I think council. Council member Austin made a good point. I don't think that it's that time critical. I don't mean to dismiss Councilmember Price. And your point, Councilman Richardson. Let's make sure it comes back. I get it.'",
        "'speaker_2': 'But since tenants are going to have until July 31st, 2021 to pay. There's a lot of time during which we could establish a program and during which they can take advantage of that program. So. Is there a is there a council meeting on July 21st and maybe we bring it back in early August?'",
        "'speaker_2': 'I definitely want to make sure Tom and city staff have input into when they feel comfortable bringing it back.'",
        "'speaker_7': 'So this is done. So yeah, we do agree we should come back in about 30 days rather than 60. While the city attorney is right about there's not time from the ordinance perspective. A time crunch there is on the money that we would be able to access for this.'",
        "'speaker_7': 'The Federal Cares Act money needs to be out the door spent reimbursed everything done by the end of December. That's incredibly fast. So to be able to use any of that money, we need to make some decisions on it fairly soon.'",
        "'speaker_7': 'So we would commit to coming back within 30 days, giving you the options for the $5 million or what we could do with that, how we would move that program forward and any additional federal cares act or other revenues that you may want to dedicate.'",
        "'speaker_3': 'I think that's fine. I accept that. And just be clear, we're talking about the program. I know that. We're not talking about the ordinance. I know you mentioned ordinance.'",
        "'speaker_7': 'Sorry, I'm talking about the program. Yes, sir.'",
        "'speaker_3': 'I just want to be clear. We're talking about the program. But, Councilwoman, I fully accept that. Absolutely.'",
        "'speaker_1': 'Yeah. Thank you very much. I appreciate that. And Tom or Mr. Modica. You know, as you and your team are evaluating funding sources, really, I know you guys are really good at being creative, but this repayment program is different.'",
        "'speaker_1': 'It's creative, and maybe there's some category it falls into that's not specifically housing, but allows us to be a little bit creative with, you know, incentivizing people, getting back on their feet or something like that, and also trying to see, I hope that I was able to articulate the concerns I have about it being income based because'",
        "'speaker_1': 'there are people who do 40 or 50% or even higher percent of their salary to rent so that they can live in a different neighborhood, so that they can be in a different school district or whatever the case may be.'",
        "'speaker_1': 'So I want to make sure that we're trying to help as many tenants as possible. And of course, there are landlords, too, who aren't getting any mortgage relief.'",
        "'speaker_4': 'Okay. Thank you. Next up is. Council member Mungo. No.'",
        "'speaker_1': 'Q can you hear me? Wonderful. Thank you. I think a lot of the concerns mentioned tonight, in no way was the council looking to set up runners to have a big balloon payment at the end. And we always talked about finding a way to help them get there.'",
        "'speaker_1': 'And the reason that balloon payments are not. Really allowed anymore in the credit industry is because people don't typically have the ability to get to a point where they have that much cash on hand to make those balloon payments.'",
        "'speaker_1': 'So we want to have a win for everyone tonight. We want to make sure to focus on the back rent owed. I guess I just have two things. It's easy to say that we want to. Forgive rent. And the challenge comes with the finding who's going to eventually pay for that?'",
        "'speaker_1': 'I was talking to one of my colleagues today about a woman in my district who literally hasn't had any income, zero income, but her Social Security, which is very, very low because it was her husband's who passed away.'",
        "'speaker_1': 'She's been getting food from a local church and she doesn't have any income coming in except for the food from the local church. And her husband's passed away. Has the Social Security to pay for her caretakers and to pay for her living expenses.'",
        "'speaker_1': 'And. And as you get older, if you have caretakers and those things, they're very expensive. And those caretakers will not allow her to pay late. And so the home that she grew up in, that she now uses as a rental and has not been paying their their rent.'",
        "'speaker_1': 'So we're not talking always about some big corporation. We're literally talking about our neighbors who also need to eat. And so any way to put forward a program. So I'm going to just kind of delineate a couple of things.'",
        "'speaker_1': 'So the $5.3 million that we talked about last week, I first want to think two weeks ago, Councilmember Austin, for starting us down that path. And one of the things that I talked about was stretching that money and instead of up to 100% of rent, that it would be 50% of rent.'",
        "'speaker_1': 'And I love the idea of using it as matching, and I think that that is a huge component and that really was kind of thrown around. But I know that we are all working so hard to. Fine solutions so quickly.'",
        "'speaker_1': 'We haven't been able to work through all the details I agree with. The idea that there isn't as much urgency now, because we do know that they have longer to pay, but there's still neighbors at home who need some certainty on when they can pay things back.'",
        "'speaker_1': 'So this neighbor that I mentioned is in her late seventies and she took out a credit card cash advance to make her payments. She needs to kind of figure out when she's going to be able to pay those things back.'",
        "'speaker_1': 'So I'm a big thank you to the city staff who are willing to make a commitment to getting that back to us in 30 days. I'd also like to say that we need real data on what is outstanding, and so I'd like to see the city staff pull together with our I.T. team, some kind of portal where'",
        "'speaker_1': 'a landlord can enter limited information about what is outstanding from them. You can go on and say, I have two units and I have one tenant who's three months behind on rent to the tune of 1800 a month.'",
        "'speaker_1': 'And I have another tenant who's behind on rent, but they've been paying 70%. I think we as a city need to know what that looks like because we need to kind of track that as we go, because we as a city need to prevent a mass eviction status across our city.'",
        "'speaker_1': 'In August, what is it, July 31st of 2021. We need to look at where those numbers are lining up so that we can prepare ourselves and put in additional programs as necessary. So I'd love to see some kind of portal if Councilmember Richardson's amenable to adding that to his motion or the city staff to explore what options'",
        "'speaker_1': 'they might have to collect that data for us.'",
        "'speaker_3': 'Absolutely. We should we should explore it. I think I think more broadly, we need to be thinking as we approach July of 2021 about a strategy that. Well, this could be one of the larger things I think you're thinking correctly in that we don't want mass evictions at that point.'",
        "'speaker_3': 'So there should be a whole host of evaluate absolutely them.'",
        "'speaker_1': 'And then I think asking the question, too, there are a lot of people who haven't gone back to work yet and they do have rent due just around the corner. And so I think for landlords to also give that information on where they've made exceptions, what they've done to accommodate renters and whether they did have a COVID'",
        "'speaker_1': 'reason or not, just for us to have that is important and then for us as a city to really think it out. The program was supposed to start on June 29th. That's six days from now. And we don't have another council member between now and meeting between now and then.'",
        "'speaker_1': 'Mr. Modica, what is your plan with if the motion on the floor passes? What are your initial thoughts on when we could regroup in terms of what kind of information you've already sent out regarding the program as it was or.'",
        "'speaker_1': 'What that would now look like.'",
        "'speaker_7': 'Ask Linda Tatum to respond to that.'",
        "'speaker_0': 'Councilwoman Mango We have been very aggressive in terms of starting to publicize and put the information and the information documents. We've gotten a really robust response to this from the public who are saying we're ready to go and we have committed that we would have the application forms and other information about the program up on the website'",
        "'speaker_0': 'on the 29th for the the rental assistance program that the council approved a couple of weeks ago. So if you direct us to continue that effort tonight, we would certainly just get that information up and just restructure the program based upon the direction.'",
        "'speaker_0': 'And as I understand it, I think the clarification is that we would need to understand that you want us to continue with the prior rental assistance program, but just use a portion of that fund funds, the 5.3 million to dedicate to this program that we're talking about tonight.'",
        "'speaker_0': 'So that's the direction that we would need, whether we put the one on hold or continue with the one and funded at a certain level and dedicated a portion of the funds that have already been committed to that program and divert those to this new program.'",
        "'speaker_1': 'So I don't think it's a diversion. I really think it is a prioritization. So I think you open the portal and again, I can hear from my colleagues, you open the portal and people apply and we can use the data of all the applicants and how far behind they are.'",
        "'speaker_1': 'All the different components for us to determine from a policy perspective where the most need is and where the city can forgive or not forgive. Brant Pay on behalf of the tenants. That makes the best impact on our economy as a whole to be able to lift up neighbors and make sure that they get to stay in'",
        "'speaker_1': 'their homes. So that would be my recommendation. I think that even if it's still opened on the 29th without clear direction on how much any one person is going to get, I think you kind of talk about the possibilities of up to $3,000 of rent matching or or prepayment for you.'",
        "'speaker_1': 'And then you'll have the data in in there for us to determine. And I kind of said that at the last meeting, too. And I think this is really just an enhancement of a great program really authored by Councilmember Alston and for us to and have now sat on it for a week and said two weeks and'",
        "'speaker_1': 'said, okay, let's leverage that money as the matching, let's do up to the 50% of rent owed a couple of those sides of it. So we can see how far that money can stretch and how much of an impact it can make.'",
        "'speaker_1': 'But other than that great work of Councilmember Richardson, Councilmember Austin and Mr. Anthony, I know you've worked on this tirelessly, and I know my council colleagues who really discussed this program over the last few weeks. I know that we wish we could forgive rent, but forgiveness is really not making it disappear.'",
        "'speaker_1': 'It's really taking from one and giving to another. And in some of those cases, some of our most vulnerable senior citizens are kind of living on that income, and you can't really differentiate how you pull those people apart.'",
        "'speaker_1': 'We want to make sure not to have our senior citizens without care, food or or housing. So I'd thank you all to your work on this. I'm really excited to see an opportunity for renters to be incentivized to both pay back a little bit of that back rent and for the city to step in with these funds'",
        "'speaker_1': 'to kind of pay off part of it for them.'",
        "'speaker_4': 'Vice Mayor Landrieu's.'",
        "'speaker_2': 'No, I'm fine. Thank you very much, man.'",
        "'speaker_4': 'Consumer superpower.'",
        "'speaker_2': 'Thank you. I just want to back what Councilmember Mungo said, and it looks to me and maybe staff can respond that if this comes back on the 14th, can we be up and running by August one? So if we if we leave the end of June.'",
        "'speaker_2': 'Program in place. Our program in place. Um. Tenants can access that money. And then if this program gets going, um, is August one too early a date to get that moving?'",
        "'speaker_0': 'I let me respond to that. I think it would be helpful to just clarify that the the the prior rental assistance program, the criteria for that were very specific in terms of the income qualification and the other criteria in the documents that you would need to be eligible for that program.'",
        "'speaker_0': 'The program you're talking about tonight for the rent deferral, that program, in my opinion, and we're still we'll still spend some time to look at it over the next 30 days would potentially have a different set of criteria because it would come from a different funding source.'",
        "'speaker_0': 'And that's why I was asking you to consider maybe having these as two separate programs rather than melding them, because they come from different sources and they have different criteria for qualification. And that makes it really challenging to meld them together and try to really efficiently and fairly implement them when they're melded together under the scenario that'",
        "'speaker_0': 'was just described. So I would and the program that you previously approved was scheduled to be rolled out on the 29th. And given that if we don't come back with the the details of the program you just talked about for another 30 days, that truly would delay the implementation of the rental assistance program.'",
        "'speaker_0': 'So I'm some clarification about the goals would help and I would encourage you to consider them as two separate programs because of the different funding sources.'",
        "'speaker_2': 'Okay. Well, I was I was playing off of Stacey Mungo's comment. So if I like to respond to what I just said, but again, I want to reiterate that August 8th one is a great concern to me. And what I failed to mention is August one is just the first milestone that rent will be have tenants want'",
        "'speaker_2': 'to pay their rent on time every month after that? That is correct, Mr. Anthony. I believe that I might have overemphasized August one, but that's just the start date. Any month after that, rent. Rent is late. The same consequences will kick in.'",
        "'speaker_1': 'Thank you, Mr. Zubrin. I do agree that there is some confusion because, Ms.. Tatum, we cannot continue to create separate programs to a taxpayer, to a renter, to a landlord. It is one program. It needs to be a11 door.'",
        "'speaker_1': 'They don't know the differences of what type of funding it is.'",
        "'speaker_0': 'They the applicant would not, but the the city staff would. And we would certainly put all of the details of each one of the programs. And I what I'm hearing is that a any one household could be eligible potentially for two programs unless you direct us to qualify them for one or the other of the programs.'",
        "'speaker_0': 'And there is clearly some overlap because the rental assistance program that you approved last week, a person who has deferred rent would likewise be eligible for that program, even under assuming that they met the income guidelines. Everything you talked about tonight, they could potentially be eligible for the rental assistance program you already provided.'",
        "'speaker_0': 'But I'm hearing that you're really concerned and you want to focus additional funds on those who exclusively have deferred rent. So there there's there's a difference in both of those those qualifications for the program, which is why a more distinction, a greater distinction between the programs would be helpful in terms of administration.'",
        "'speaker_0': 'But I hear you loud and clear. You're saying we could probably just get the application and see which one of those programs they would would qualify for. And if you're okay with that, we can certainly study that and roll out the rental assistance program on the schedule we had already provided because the funding wouldn't all go away'",
        "'speaker_0': 'immediately. I think we could work something out where we move forward on the one and yet still maintain some of those funds for for the new program and continue to look for additional program program funds.'",
        "'speaker_7': 'And this is Tom. I jump in here a little bit, so I think we just need some clear direction. There's definitely two different ways we can go. So we've got $5 million set aside for a program. We're ready to go.'",
        "'speaker_7': 'You're asking us to do something different, which is to kind of either either modify that money to extend to this kind of new a program or to create two separate programs. We can certainly go out and look for more money we only have right now.'",
        "'speaker_7': 'We know we have the $5 million in hand. So that's kind of what I'm looking for direction from from the either the maker of the motion or others and we, you know, just should we try to do both or should we create one new program?'",
        "'speaker_7': 'That's what we're looking for.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'Okay. So this is this is the Mary. Nobody's had a chance to speak. I want to I want to just clarify, and I think I'm hearing everyone's comments. And, Councilman Margaret, you have additional comments also.'",
        "'speaker_1': 'Well, I really appreciate Mr. Modica comment, but I think that what we're talking about is an enhancement with some of the suggestions made last week, because when Mr. Richardson states up to 50% matching, there are certain tenants that would then be what I think we would use the word prioritized because they were marching down that path, but'",
        "'speaker_1': 'because they wouldn't have that same kind of requirement. So I think that they should consider my recommendation to the maker of the motion is that they would continue to take in applications, but that we don't necessarily tell anyone who's been awarded an application until at least we get a report back from the Development Services Department on the'",
        "'speaker_1': '14th. So we as a city can make sure that it's headed in the right direction. That would be my only comment and thank you for all that. The considerations to both Mr. Medications.'",
        "'speaker_4': 'Tatum Great. I'm going to make a brief, brief clarifications and then we'll move on. I think actually. Then I've got Councilman Austin and we're going to move up. Just to clarify, I think I know a lot of people, including Councilman Austin and others, worked on the original program.'",
        "'speaker_4': 'I think we want to keep the original program in place, is what I'm hearing. So the original program stays in place. We have funding already set aside for that program that moves forward and we have a timeline set up for that.'",
        "'speaker_4': 'In addition to that, we are expanding this kind of this program that we have to also do this kind of rental repayment assistance program. That's a matching program of which we're going to look for additional dollars to supplement that program if and over the course of the next few weeks, you know, staff, you come forward and say'",
        "'speaker_4': ', hey, we think, you know, we found some new dollars here or we think that there's some some dollars maybe, you know, some limited dollars from the original program that can move into the other one. I think we'll wait to hear from you.'",
        "'speaker_4': 'But I think what I'm hearing is we want to move forward with the original program and keep that going. Then we now we have a new program as proposed tonight that we're going to look for additional funds. That program is going to come back to the council for approval.'",
        "'speaker_4': 'And it will essentially be one rental assistance bucket of which there's different kind of programmatic ways of of of people getting assistance. So that's the way I'm hearing things. And hopefully we can get to a vote. Councilman Austin.'",
        "'speaker_3': 'I think I was cued up.'",
        "'speaker_6': 'Thank. Thank you, Mr. Mayor. I am pleased with the direction this is going in. I appreciate your clarification. I did want to just express my my desire and hope that the council will support moving forward with the right care Long Beach Cares program, the rental assistance program that we already have in place.'",
        "'speaker_6': 'I'm supportive of this. We've seen and we can commit to doing that and also look at how we can enhance options for for helping people pay their rent and helping landlords get their rent as well. I think everybody wins with the proposal on the table.'",
        "'speaker_6': 'And if we can take just a little bit more time to work that out and also hopefully identify new resources from other sources, this could make the program even more robust and beneficial to the more so. Those are my comments.'",
        "'speaker_6': 'I hope we can stay the course here.'",
        "'speaker_4': 'Okay. Think I'm going to go to public comment unless, Councilman Richardson, do you have do you have additional comments before we do have a comment and vote? As a Richardson.'",
        "'speaker_3': 'Here. I am sorry. I was a supporter of that in this direction. I think I think a lot of the last. A lot of discussion, just confused a lot of folks. I think we wanted to be very, very clear here.'",
        "'speaker_3': 'We already have a program in the works. I think that program, people are expecting to get assistance. We don't want to take anything off the table that we've already put on the table to them. What we're saying is we need to develop a program to help with back rent.'",
        "'speaker_3': 'Where the color of money comes from. Steph's going to need some time to evaluate that. What the funding levels are, staff's going to have to evaluate, and there's going to have to be additional funding as well. So Steph has some flexibility come back with a few options for the city council to consider.'",
        "'speaker_3': 'But this motion is about saying let's not do rental assistance. It says we can maybe look at, you know, figuring out how our dollars can stretch this massive matching concept and truly incentivize people to make those, you know, to make payments as best as they can.'",
        "'speaker_3': 'So so those are my comments. Thank you.'",
        "'speaker_4': 'Yeah. View it as an expansion of what we were already doing. So we're not going back on what the program was and expanding it in a different way. So let's go to public comment. Madam Clerk.'",
        "'speaker_0': 'We have 13 public comments.'",
        "'speaker_5': 'Our first comments from Tanya Jimenez, your colleague. Your time starts now.'",
        "'speaker_1': 'Hi. This is Tania menendez, District seven. This item is important. Landlords do not provide a valuable service to society. They are parasites that hoard housing, stock and profit off the backs of others. Requiring tenants to pay back rent without taking into account the continuing pandemic and inability of many times to pay is not logical.'",
        "'speaker_1': 'It does not serve the people it serves to evict tenants and free up housing stock to put for sale back on the market. I heard about this. It only serves landlords and property owners. It serves to increase the city's overall homelessness rate, something you are going to want to reduce.'",
        "'speaker_1': 'If you need it to live, it should be free. This includes housing, water, food and health care. And this goes specifically.'",
        "'speaker_2': 'To the councilman.'",
        "'speaker_1': 'That says she hopes renters are not trying to get out of paying their rent to the councilman who said there should be no free rent because there's no free mortgage. And so the councilwoman who called landlords housing providers point blank, period, housing is a human right.'",
        "'speaker_1': 'Housing should be free. Keep your landlord assistance and repayment plan. Black women and black families in particular are the most rent burden in Long Beach and are at the most risk of eviction, followed by families headed by indigenous peoples and people of color.'",
        "'speaker_1': 'I urge you all to cancel the repayment plan and forgive him. People over profit should be the bottom line. Always. My time.'",
        "'speaker_5': 'Thank you for your comment. Next we have. And you said De la Cruz a better.'",
        "'speaker_1': 'Starts now. Hi, I'm from District one. So today, me and other residents, I want to ask for all of you to vote no on the repayment plan. First of all, I think it's ridiculous and there's a special plan to move forward with the renters, which are the ones who need protection from the landlords.'",
        "'speaker_1': 'This is the price. So how dare you support a measure that would help you as a landlord? This is not about personal gain. It's about the people involved and the 59.8% of renters. And then protection. There would be that 59.8%.'",
        "'speaker_1': 'Our economy is still not functioning and reopen and with little openings have taken place. COBRA 19 infection rates have skyrocketed and landlords want to sit there like royalty until long time resident that you should have a plan or a safety net or that x amount months is plenty of time to pay back to rent.'",
        "'speaker_1': 'People do not have the money right now to pay what's already ridiculously high rent. Working class people both a lot of these are nationwide have been bearing the brunt of government response to COVID 19, from the city dragging its feet to provide widespread testing to offering the least possible help to thousands of workers who were thrown out'",
        "'speaker_1': 'of their job and don't have the wait a month. Rents are growing overhead. The proposed rate rise with the payment plan will leave thousands of citizens of our village at risk for eviction or failure to pay rent. The fact that sentences of this city are being subjected to pressure to this pressure is criminal, especially when members of'",
        "'speaker_1': 'our city council are a landlord themselves, indirectly profiting from the very plan they are proposing to pass. The real issue here is that rent should have been forgiven in the first place. You guys have filed 5.3 million, I believe I heard.'",
        "'speaker_1': 'Dollars.'",
        "'speaker_5': 'Thank you for your comment. Next, we have Seagram. Your time starts now.'",
        "'speaker_1': 'Y'all are going to be hearing from me and my fellow community members now and in the future, because we are listening. We are tuning in and listening. We are taking note. We are mobilizing. And we are angry. You need to hear our words.'",
        "'speaker_1': 'I'm looking at you because I know that you are a landlord, a landlord in our community, and you will benefit directly from this measure. It is in your personal interest to pass this measure. But as a member of your district, I say I demand that you vote no on this measure.'",
        "'speaker_1': 'We need to cancel rent completely. Cancel it, cancel repayment, cancel it all. We are in a new time. Corporate capitalism has failed the people and only benefited property owners. Well.'",
        "'speaker_5': 'Thank you for your comment. Next, we have Daniel Kelson.'",
        "'speaker_2': 'Thank you. Thank you. Mayor and city council members. I'm a longstanding homeowner and I do not rent, nor do I own properties for rent. I therefore speak with no conflict of interest on this measure. But as a concerned citizen, the push by rental property owners for an ordinance scheduling this rapid to pay back of rent is mathematically'",
        "'speaker_2': 'challenged, economically irresponsible and civically reprehensible. For those renters lucky enough to have been out of work and that missed payments for only three months, this proposal amounts to an inhumane 25% rent increase to pay back dismissed once in a 12 month period.'",
        "'speaker_2': 'Many more people are still suffering in this economic and public health crisis. With the unemployment rate in Long Beach hovering around 20% and more months of rent still paying that back in a 12 month schedule is an even more dramatic increase in their housing burden.'",
        "'speaker_2': 'So just because the proposed table sounds simple doesn't make it humane or even feasible. A large number of Long Beach residents who are housing stressed, a population skewed toward people of color and the working poor would be devastated by such an ordinance whose sole aim must be seen really as a roundabout way to produce more evictions when'",
        "'speaker_2': 'rent payback schedules cannot be met. Now is not the time for landlords to be talking about clawing back funds that may never make it into the hands of the tenants. I just defended the property owners. Consider that this is the sort of measure appropriate at this time.'",
        "'speaker_2': 'Thank you for your time.'",
        "'speaker_5': 'Thank you for your comment. Next, we have Elsa tongue. Your time starts now.'",
        "'speaker_1': 'Hi, this is Ailsa Chang from Long Beach Forward. I'm going to read some excerpts from the letter that our executive director, Dr. Christine Pettit, submitted today. We at Long Beach Forward stand in strong solidarity with the Black Lives Matter movement here in Long Beach and around the world.'",
        "'speaker_1': 'We strongly oppose item 26 to mandate and ill conceived one size fits all deferred rent repayment schedule for all tenants. This proposal, especially during a global pandemic with mass unemployment, is patently anti-black, anti-immigrant, anti-poor and anti small business, and, if passed, will lead to mass evictions, growing homelessness and shuttered small businesses.'",
        "'speaker_1': '63% of black women and 60% of all women of color in Long Beach are rent burdened. These women and their families, meaning children, will be the first to be evicted from their homes and onto the streets. Under this proposal, black residents are already grossly, disproportionately represented in L.A. County's unhoused population.'",
        "'speaker_1': 'Long Beach must reject any and all policies that would add one more black body to the violence of homelessness. Vote no on the repayment schedule and instead cancel rent and cancel mortgages to provide real relief in our renter majority city.'",
        "'speaker_1': 'I yield back.'",
        "'speaker_5': 'Thank you. Next, we have Fred Sutton. Your time starts now.'",
        "'speaker_2': 'Honorable Mayor City Council Fred Sutton on behalf of the California Department of Association. Appreciate your time and your deliberation on this very important issue. Housing providers continue to act with compassion towards those who face related hardships to the coronavirus as the economy reopens and an increasing number of employees return to work.'",
        "'speaker_2': 'We asked council to insert a payment standard to help residents pay rent that has been deferred. It is in no one's interests to have large payments outstanding in a year from now. This policy should be simple, regular, and give everyone time to understand their financial obligations.'",
        "'speaker_2': 'It makes sense and helps avoid mass evictions. It is not mutually exclusive what Councilmember Richardson is talking about in his motion. You can insert a payment plan and have renter assistance. Fulfill those that are unable to meet some of those installments that are continuing to struggle.'",
        "'speaker_2': 'The you can vote for an installment plan and assistance to come back and figure out how to pay some of those installment payments at a later date. This should move forward in some capacity today. We understand what everyone is facing, but housing providers need some relief as well as there has been no assistance through the CARES Act'",
        "'speaker_2': '. Coming to housing providers and utility costs are going up, maintenance is going up and income is not coming in from these units. It's fair and equitable to find a payment plan solution going forward and using assistance loans to fill those gaps.'",
        "'speaker_2': 'Appreciate your time and consideration. Thank you.'",
        "'speaker_5': 'Thank you. Next, we have Jen, Victor and Ensign.'",
        "'speaker_2': 'Honorable Counsel. My name is Jan Victor Anderson. I am an immigrant from the Philippines and grew up in Long Beach, and I'm currently an organizer with Eastside Communities, located on two four, four eight Santa Fe Avenue.'",
        "'speaker_1': '90810.'",
        "'speaker_2': 'Before I speak to item 26, the city needs to ensure that the public comment feature on the city website follows the Language Access Policy Protocol as it currently is only accessible in English. This means needed Tagalog speakers like me, monolingual Spanish speakers will not be able to participate in our city meetings as it.'",
        "'speaker_1': 'Relates to the repayment plan. Thank you for your leadership.'",
        "'speaker_2': 'Councilmember Richardson and the other Council members in support of Receive.'",
        "'speaker_1': 'And filed a repayment plan and no to.'",
        "'speaker_2': 'Any ordinance because any repayment plan will.'",
        "'speaker_1': 'Only lead.'",
        "'speaker_2': 'To eviction in organizing.'",
        "'speaker_1': 'With working.'",
        "'speaker_2': 'Class black brown residents during the COVID 19 pandemic. This repayment plan is going to be an added stressor creep on abilities for many in our community to be evicted. This is not speak to the moment of the pandemic where residents are facing lack of work hours and lacking financial resources.'",
        "'speaker_2': 'Many residents are relying on city services and community groups to cover their food and other mutual aid. But this repayment plan contradicts the spirit of the eviction moratorium past weeks ago to protect those most vulnerable so that we don't create a bigger homelessness issue.'",
        "'speaker_1': 'Usually, Lufkin did research.'",
        "'speaker_2': 'Estimating 120,000 households in Ohtani will be at risk of homelessness because of this pandemic.'",
        "'speaker_1': 'Thank you for this motion file and receive it.'",
        "'speaker_2': 'Let's not revisit the repayment plan. Cancel the rent council mortgage and find ways to protect and support the most vulnerable in Alberta and keep our home. Thank you.'",
        "'speaker_5': 'Next, you have Jordan when you've time starts now.'",
        "'speaker_2': 'Hi there. My name's Jordan Win. I'm a second district resident. I stand firmly against the original item, and I thank Councilmember Richardson for introducing the substitute and I am in support of that, as well as the council members that are standing behind Richardson's motion in Long Beach.'",
        "'speaker_2': 'We need to stop pitting families against each other. There have been mom and pop examples that have been given out time and time again. What about this one situation? What about this one situation? It's disrespectful to suggest that one family's income is a deserved or God given right of another.'",
        "'speaker_2': 'This is not about transferring rents between residents. We need to make sure that people have the ability to pay for their housing, and that means camping rent and canceling mortgages for everybody. We have to stop pretending that COVID 19 is disappearing.'",
        "'speaker_2': 'It's not just still here. It is increasing. The economy isn't going to snap back on July 31st. All of a sudden, people aren't going to suddenly be reemployed. Once again, people are going to be on the hunt for jobs.'",
        "'speaker_2': 'Truth to suggest that we need to have some sort of uniform repayment plan is ludicrous, and it is truly out of touch and out of sight. People who have who have a consistent roof over their heads, who even if they weren't able to pay for their mortgage, they could sell their house.'",
        "'speaker_2': 'Do they have wealth? Renters don't have that luxury. They end up on the street. Two thirds of our homeless population this year are experiencing it for the first time. That point directly to housing and affordability in a severely rent burdened community.'",
        "'speaker_2': 'I ask you to receive and file the original item and don't bring it for your comment.'",
        "'speaker_5': 'Next, we have Joshua Christian.'",
        "'speaker_2': 'Leaving the remaining members of the council to the Joshua Christian eviction defense attorney with the Legal Aid Foundation in Long Beach. I want to thank all of you for speaking really clearly about what was a pretty misguided item on the agenda tonight.'",
        "'speaker_2': 'Councilwoman Pierce, you cannot it clearly out of the gate. Thank you very much and thanks for supporting the motion on the floor. I hope we can go home just with this arbitrary repayment plan policy put to bed entirely.'",
        "'speaker_2': 'I think that the motion that we're discussing is actually a perfect example of why setting up arbitrary levers to eviction is ineffective and inappropriate at the time. 12 months form a grand kids breathing room to households to get back on their feet, the different economic sectors to recover at different rates, and to local legislatures to be creative'",
        "'speaker_2': 'and come up with plans like the one that we'll hear about in a few weeks. Jim mentioned there are 120,000 people expected to be homeless during the next year because of this crisis, and that's with a 12 month rent deferment plan.'",
        "'speaker_2': 'So I think what was originally on the agenda tonight was going to make that a lot worse at a much faster rate. And I hope that the repayment program that we come back to consider is something that will be much more constructive and supportive for the Long Beach renters.'",
        "'speaker_2': 'So thank you very much. Thanks to city staff as well.'",
        "'speaker_5': 'Thank you. Next, we have Keith Kennedy. Your time starts now.'",
        "'speaker_2': 'Yes. My name is Keith Kennedy and president of the Smart Property Owners Alliance, also known as BOA. We support a pay back option that establishes that deferred rent obligations be paid back in one vehicle installments over a one year period of time starting August 1st of 2020.'",
        "'speaker_2': 'Having said that, I'd like to ask the mayor and city council members if they would be using the 5.3 million C, D, b g funds approved three weeks ago for this new program. We would support a matching payment plan.'",
        "'speaker_2': 'However, it should not be tied to income. Since the reason for the deferment was not based on income, I'd like to request that this come back to City Council for July 14th. Also, it's important to remember that housing providers are not in the business of evictions.'",
        "'speaker_2': 'It's expensive and disruptive. With that in mind, banks are not so kind and generous of many of our housing providers, of which some are elderly and may be suffering from ownership and security as concerns for meeting their contractual obligations without a structured payback period are mounting.'",
        "'speaker_2': 'With the likely extension of the federal unemployment benefits, along with employers opening up, it may become less of an issue.'",
        "'speaker_5': 'Thank you. Next, we have Mike Parkinson. Your time starts now. Mike Mitchinson.'",
        "'speaker_2': 'I'm sorry. Good evening, Mayor and council members. My name is Mike Murchison and I supported Councilmember Orphan's push for a rental assistance program. But there was one caveat to that had to do with an 80% income level for area median incomes.'",
        "'speaker_2': 'And we all know that doesn't apply to all tenants in Miami. So certainly all landlords are not going to benefit. I want you to keep that in mind with this rental assistance program. If you have the same type of program and you're using that 5.3, you're not going to be benefiting all tenants and all landlords of that'",
        "'speaker_2': '5.3 million. I do encourage you to follow up quickly with what I told you about using those monies prior to December. So 30 day response time seems appropriate. Finally, clarify on evictions. The Judicial Council for the State of California has already gone on record as saying there's going to be no unlawful detainers until the start of that'",
        "'speaker_2': 'process or 90 days, 90 days after the governor declares the eviction moratorium over. We're not talking about evictions right now. We're talking way, way down the road. I hope that you guys can find programs that don't have these restrictions that contends and landlords can benefit at the same time.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_5': 'Thank you. Next, we have Norberto Lopez. Your time starts now.'",
        "'speaker_2': 'Hello, council and mayor, you know that people are tired of their showing up in the streets and they're against the street because they have no other option. They fight for their home now while they're in there or they're going to have to fight for it on the outside.'",
        "'speaker_2': 'With instability of the nature of the police are out and that people are tired of being told that they are going to have to pay back the rent and you try to dictate how they should pay back the rent.'",
        "'speaker_2': 'That's not the way to go. Right. And then the landlord rents talking about that. They're compassionate that we have you know, we have tended to be threatened with gun violence and that they're going to go get shot by their landlord.'",
        "'speaker_2': 'That's not compassion. And I get the apartment association emails and, you know, my parties are saying that Judicial Council this and that. But, you know, the apartment association fighting to also repeal that. What? If there are units back to get rid of all the lower income folks out of Long Beach.'",
        "'speaker_2': 'We already saw the first wave of gentrification hit the first district and folks are moving over to a nice district. That's why I appreciate the ones that are standing up for the people, putting people over profit, not profit over people.'",
        "'speaker_2': 'And, you know, all these private meetings that are happening like we. Need, right? I am not like, you know, people are standing up and they're going to continue to show up and they've got to take off the street.'",
        "'speaker_2': 'They will take off the street. And we've seen it. And, you know, you know, the police aren't going to help because the people are tired and they're going to continue fighting. Are you on my side?'",
        "'speaker_5': 'Thank you. Next, we have Tiffany Davey. Your time starts now.'",
        "'speaker_1': 'Hi. Good evening.'",
        "'speaker_2': 'Council Mayor and all citizens listening. I strongly oppose the original item. Support definitely was even fail as well as hoped to see an extension statewide. Given the fact that we are still in a global pandemic with no real I mean, even these July 31st dates seem quite arbitrary as we're about to segway into the next item when'",
        "'speaker_2': 'we're talking about systemic racism being a public health crisis. Considering the all of the numbers going back, I mean, before this crisis existed and now what it's really brought to light. I also support it in that same note towards the possible aggression.'",
        "'speaker_1': 'Of this moment.'",
        "'speaker_2': 'Similar to the ads that we saw during the No on Rent Control campaign that depicted 1937 almost word for word KKK ads that were endorsed by many small property owners and such. So not to revisit that as we're also seeing different types of other potential tools of future hate crimes.'",
        "'speaker_2': 'Again, we're in a.'",
        "'speaker_1': 'Pandemic, and.'",
        "'speaker_2': 'If we move forward, the next item would be acknowledging that we're also in a public health crisis long overdue to acknowledge. So with that, especially hearing the audio from the gun violence video past anti-harassment or.'",
        "'speaker_5': 'Thank you for your comment that concludes public comment for this item.'",
        "'speaker_4': 'Okay. Thank you for public comment and roll call. Vote, please.'",
        "'speaker_0': 'District one, district two. I District three. I used it for.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'District five. I District six.'",
        "'speaker_4': 'Five.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'II.'",
        "'speaker_0': 'District eight.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_4': 'Thank you. Okay. We're going to go ahead and go through the next. So six or seven items should go rather quick. Kelly I know there's got to be some discussion on, I think on item 27 from from a couple of council members.'"
    ],
    "Contract Award and Grant Acceptance for Year-Round Shelter, Atlantic Avenue Bridge Community (ABC) Operation Services.": [
        "'speaker_4': 'So let me let me go ahead and go through the next few. I'd have to go rather quickly and we'll get to oh 27 item 17.'",
        "'speaker_0': 'Report from Health and Human Services Recommendation to work contractor Volunteers of America to provide operational services for the year round shelter Atlantic Avenue Bridge Community in an annual contract amount not to exceed 2,080,500 for a one year period.'",
        "'speaker_0': 'District nine.'",
        "'speaker_4': 'Can I get. I got a motion. Can I get a second, please?'",
        "'speaker_3': 'We just wanted a quick, quick update on this.'",
        "'speaker_4': 'Okay. Quick update, please.'",
        "'speaker_7': 'Thank you. Kelly Collopy will give that update. Kerry. I don't think we can hear you.'",
        "'speaker_4': 'With coffee there. Okay. Why don't you go to public? Let's go to public comment.'",
        "'speaker_1': 'Can you hear me now, sir? Sorry. Can you hear me?'",
        "'speaker_4': 'Go ahead and call me.'",
        "'speaker_1': 'Yeah. So, uh, this item is to award a contract to Volunteers of America for.'",
        "'speaker_2': 'A period of one year with an option to extend for three years.'",
        "'speaker_1': 'We went through an RFP process and Volunteers of America.'",
        "'speaker_2': 'Was the winner of that process.'",
        "'speaker_1': 'The current facility, all major.'",
        "'speaker_2': 'Construction, will be completed by July one, and then we'll be.'",
        "'speaker_1': 'Working on utilities and furniture. So sometime during.'",
        "'speaker_2': 'June, July, the buildings will be the.'",
        "'speaker_1': 'Buildings will be fully ready.'",
        "'speaker_2': 'We then give the.'",
        "'speaker_1': 'Provider.'",
        "'speaker_2': 'About 60 to 90 days to really.'",
        "'speaker_1': 'Make sure that they have all the staffing.'",
        "'speaker_2': 'That everything is in place and that they're ready to open. Given that the contract is.'",
        "'speaker_1': 'Being.'",
        "'speaker_2': 'You know, there were this is going through council now. They should be.'",
        "'speaker_1': 'Able to begin planning and working.'",
        "'speaker_2': 'During this month and into early.'",
        "'speaker_1': 'Into early July. So we are we're looking forward to them moving in. They had a very.'",
        "'speaker_2': 'Impressive proposal and that's my report for them. Open for comment.'",
        "'speaker_4': 'Kate. There's emotion. And a second. Any public comment?'",
        "'speaker_0': 'Yes. There's one public comment.'",
        "'speaker_5': 'Tanya Manus, your time starts now.'",
        "'speaker_1': 'Putting in councilors. Punishment is, again, a little less emotional time. So per this year's homeless count, 2034 of Long Beach residents are experiencing homelessness. This is a 7% increase from last year. I find it appalling that a city as large as ours, where leaders consistently claim we are ahead of the curve and innovative, innovative, we have not'",
        "'speaker_1': 'considered a policy that would reduce homelessness significantly. The first policy, Seasonal Shelter, is an outreach conducted by the city's health department, as well as the Hart team are Band-Aids. Providing individuals experiencing homelessness with housing, as well as robust health care, including mental health support and drugs, alcohol rehabilitation and career and educational assistance.'",
        "'speaker_1': 'Will do more than a shelter or outreach ever could to reduce homelessness. There are also preventative measures you as a council could do to reduce homelessness. Like ensuring residents have access to affordable, accessible and quality housing. And implementing strong tenant protection policies.'",
        "'speaker_1': 'Now, Council Mayor, I know you might be thinking where would the money come to provide permanent supportive housing to individuals experiencing homelessness when we're facing a budget deficit? The answer is simple. Define LGBT and invest in your communities.'",
        "'speaker_1': 'There is no moral justification for such an overinflated police budget, for the high degree of militarization, or for their blatant disregard for the safety, health and lives of our residents. While there are over 2000 individuals in our inner city that do not have a place to call home, do right by your residents, defund CPD, invest in your'",
        "'speaker_1': 'communities. Thank you.'",
        "'speaker_4': 'Thank you, Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Just wanted to say this. Is this a big moment for residents? I wondered who would be the operator for the year round municipal shelter. And now they know. Volunteers for America, a great organization. With a great proposal.'",
        "'speaker_3': 'We look forward to being open this summer and moving forward with getting to the next stage of planning the comprehensive campus. Thank you.'",
        "'speaker_4': 'Councilman Austin I'm sorry customers in Dallas you're you're the second give any comments.'",
        "'speaker_1': 'Thank you, Mayor. I'm just really happy again that that this is happening and sooner than we expected. So it's really great to hear this good news.'",
        "'speaker_4': 'Thank you, Katherine Austin.'",
        "'speaker_6': 'Yes, this is a long time coming. And I'm encouraged to hear that this program, Project Shelter, will be open very soon. And with Volunteers of America, certainly a very reputable organization to help run it. I did have a question for our health director, Kelly regards in regards to the current temporary shelter that is at the North Library'",
        "'speaker_6': '. Will those will that shift into the Atlantic Farms shelter? Or is that what is the plan.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'So that shelter right now is extended. The, the, the county runs that program and they.'",
        "'speaker_2': 'Have extended that shelter for three months until September. So they will continue to be housed there at that time. They will will.'",
        "'speaker_1': 'Those that are in that the gap between when the new winter shelter program.'",
        "'speaker_2': 'Opens, we would be able to shift into the shelter or other shelters within the city of Long Beach as many of the shelters are reopening.'",
        "'speaker_1': 'There will there every year there is a winter shelter program starting in.'",
        "'speaker_2': 'December.'",
        "'speaker_1': 'And it's up to the county to determine whether they'll.'",
        "'speaker_2': 'Extend that between the end of September.'",
        "'speaker_1': 'And.'",
        "'speaker_2': 'The beginning of December, again for next for next year's winter shelter program.'",
        "'speaker_6': 'Okay. Appreciate the heads up. We'll be talking more about that. And we certainly support to have this item.'",
        "'speaker_2': 'Great. Thank you.'",
        "'speaker_4': 'Catherine Ringa.'",
        "'speaker_6': 'Thank you, Mayor. This is one of those issues that, you know, I've brought up before in terms of the health department and all the great work it does and the work it does with grants and outside funding.'",
        "'speaker_2': 'I know this is a year round program.'",
        "'speaker_6': 'It's for 2 million for one year with possible.'",
        "'speaker_2': 'Extensions of up to three years. So what happens at the end of three years?'",
        "'speaker_1': 'The funding and the funding that we've worked with, with the county is when we.'",
        "'speaker_2': 'Agreed to move forward with the shelter the county committed to to fund the shelter.'",
        "'speaker_1': 'We committed to provide a shelter for ten years, and they're.'",
        "'speaker_2': 'Committed to working with.'",
        "'speaker_1': 'Us to fund that shelter.'",
        "'speaker_2': 'The issue.'",
        "'speaker_1': 'Around the provider.'",
        "'speaker_2': 'Is it allows for.'",
        "'speaker_1': 'The provider and then we.'",
        "'speaker_2': 'Can we can RFP. It could be the same provider. It could be a different one. After a total of four years in space.'",
        "'speaker_6': 'Okay. Well, the reason I say is because I'm still very much in favor of we need to institutionalize our health department. And a lot of these services should be institutionalized and funded without having to go out for.'",
        "'speaker_7': 'Grants every.'",
        "'speaker_6': 'X number of years. But I'm very supportive of the of the motion, and I will.'",
        "'speaker_2': 'Be voting for it. Thank you.'",
        "'speaker_1': 'You could count on the.'",
        "'speaker_4': 'Roll call vote, please.'",
        "'speaker_0': 'District one. I district to.'",
        "'speaker_1': 'My.'",
        "'speaker_0': 'District three i district for.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_6': 'I. I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Purchase of excess workers compensation insurance with Safety National Casualty Corporation.": [
        "'speaker_4': 'Thank you. Next item, please.'",
        "'speaker_0': 'Item 18 Report from Human Resources. Recommendation to purchase access workers compensation insurance for a total premium amount not to exceed 505,134 citywide.'",
        "'speaker_4': 'Any public comment?'",
        "'speaker_0': 'No public comment on this item.'",
        "'speaker_4': 'OC motion, but counter appearances are a second. Taken my customers and they asked Customer Pearce, do you want to? He said, You want to. Short staff update.'",
        "'speaker_1': 'Yes. I'm not sure which which item it is if it's 18, 19 or 20, but I just. Was hoping to get a brief staff report on on the insurance.'",
        "'speaker_4': 'On which item?'",
        "'speaker_1': 'We'll do it on 18 is fine.'",
        "'speaker_4': 'Okay.'",
        "'speaker_7': 'Alex Vasquez will get the step forward.'",
        "'speaker_0': 'Good evening, Mayor and city council. I'm going to turn it over to Jolene Richardson.'",
        "'speaker_1': 'She's our risk manager and she'll give a brief overview of this particular report. Even the mayor and council. This is for the city's annual renewal, for the excess workers compensation insurance, which is important for us to continue to provide coverage for our employees.'",
        "'speaker_1': 'It also helps us to reduce our negative financial consequences for our high exposures or losses that may result from injuries or deaths due to accidents, fire or terrorist attacks and earthquakes during work hours. This coverage will be obtained through the city's casualty.'",
        "'speaker_0': 'Broker for a record.'",
        "'speaker_1': 'Alliant Insurance Services. This year's policy for excess workers compensation will continue to provide 150 million and coverage access of 5 million self-insured retention at a premium of $505,134, which represents an increase of approximately 6.6% from the expiring policy due to increase in city's payroll.'",
        "'speaker_1': 'I think if there's any questions, we'd be happy to answer.'",
        "'speaker_4': 'Welcome back, please.'",
        "'speaker_0': 'District one. I'm District two. I District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five. I. District six. District seven. By District eight. District nine.'"
    ],
    "Property and Earthquake Insurance Purchase for City Assets.": [
        "'speaker_3': 'I.'",
        "'speaker_4': 'At a 19.'",
        "'speaker_0': 'Report from Human Resources Recommendation to purchase property insurance and earthquake insurance citywide.'",
        "'speaker_4': 'Washington. A second police. The motion by council embarrassments are going to compromise in the House. Is there any public comment?'",
        "'speaker_0': 'There's no public comment on this item.'",
        "'speaker_4': 'A roll call vote.'",
        "'speaker_0': 'District one. I'm District two. I. District three. I. District four.'",
        "'speaker_4': 'II.'",
        "'speaker_0': 'District five II. District six. First District seven. District seven. District eight.'",
        "'speaker_6': 'All right.'",
        "'speaker_0': 'Thank you. Yep. Yep.'",
        "'speaker_6': 'All right. Thank you.'",
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Insurance Policies Renewal for Various City Operations and Assets.": [
        "'speaker_4': 'Thank you. Next up is Adam 19. I'm sorry, Adam 20.'",
        "'speaker_0': 'Or from Human Resources recommendation to purchase access municipal liability insurance and airport liability insurance citywide.'",
        "'speaker_4': 'Get a motion in a second. Most of my friends and they ask me to add a second, please.'",
        "'speaker_1': 'I motioned Robert for.'",
        "'speaker_4': 'I don't have anything on this one. I have one on the last one.'",
        "'speaker_1': 'I said it's for the customer.'",
        "'speaker_4': 'Pierce is a second accept report, please.'",
        "'speaker_7': 'Jolene Richardson will give the staff sergeant a comment.'",
        "'speaker_4': 'No staff report, public comment.'",
        "'speaker_0': 'There is no public comment for item 20.'",
        "'speaker_4': 'We can't recall.'",
        "'speaker_1': 'Yeah. Maybe my text isn't coming through, but my text says I'd like a staff report on this item, please.'",
        "'speaker_4': 'Oh, I'm sorry. Because earlier early you had said you only wanted to start for corporate 18 of the three. So that's why I thought you meant.'",
        "'speaker_1': 'I sent a text and then.'",
        "'speaker_4': 'You changed it. Okay, that's fine. So let me go ahead and get a short staff report.'",
        "'speaker_7': 'Joleen Richardson.'",
        "'speaker_1': 'Thank you. Honorable Mayor and City Council. So the city annually purchases excess municipal liability, airport liability, aircraft liability and whole insurance, underground.'",
        "'speaker_0': 'Storage, tank liability, drone insurance.'",
        "'speaker_1': 'And marine insurance.'",
        "'speaker_0': 'To cover exposures arising from the city operations.'",
        "'speaker_1': 'Coverage is being obtained through the city's casualty broker record life insurance services. This year's policy for Excess Municipal Liability Insurance will provide.'",
        "'speaker_0': 'Coverage limits.'",
        "'speaker_1': 'Of 40 million excess of a 10 million self-insurance retention for all city departments, including the police department, due to historical claims.'",
        "'speaker_0': 'Frequency and severity.'",
        "'speaker_1': 'The 2019 excess liability liabilities were challenging with a hardening of the market, lack of carrier capacity and increases. The city purchased $30 million in limits versus the historical 45 million. City risk management staff is working with the city's broker, Alliant Insurance.'",
        "'speaker_0': 'Services, to secure options to get the city closer to the.'",
        "'speaker_1': '45 million limit that has historically been purchased. Coverage for eminent domain, medical malpractise and pollution contamination will continue to be excluded from this policy. However, the policy does include 30 million in coverage for unfair unemployment practices, employee benefits, liability and public officials.'",
        "'speaker_1': 'Errors and omissions. The city also purchases airport liability coverage. The city received a price indication from the insurance carrier National Union Fire Insurance offering limits of 3 million and a premium not to exceed 93,000, which is an increase of approximately 1.5% from the expiring policy.'",
        "'speaker_1': 'This policy does not have a deductible and the city does not self-insure any of the airport risks covered under. Policy. The policy includes extended coverage for international domestic.'",
        "'speaker_0': 'Terror acts under the Terrorism Risk.'",
        "'speaker_1': 'Insurance Act. The policy also covers personal injury malpractise auto and employee employers liability. The city maintains limits of 50 million and aircraft liability and health insurance, also through National Union Fire Insurance, subject to.'",
        "'speaker_0': 'A 31,400 deductible.'",
        "'speaker_1': 'When the helicopters in motion on the police department's 2.'",
        "'speaker_0': 'Copters.'",
        "'speaker_1': 'The Renault premium price indication will not exceed 48,000, approximately a 21% increase. The city is also recommending drone coverage through the National Aviation Liability Program, and it costs not to exceed 5000 to protect the city from liability related to drone operations.'",
        "'speaker_1': 'Lastly, the city operates vessels that service the coast, including the port, the recommended purchase which will provide liability coverage on the boats and includes Jones Act coverage which limits of $10 million subject to a 2500 deductible. In addition, actual physical damage to the coverage boats.'",
        "'speaker_0': 'Is provided subject to varying.'",
        "'speaker_1': 'Deductibles depending upon the value of each boat. Renault premium price indicated will not exceed 2280 $1,000. If there's any questions to answer.'",
        "'speaker_4': 'Captain Pierce, can we go to vote now? If you have questions.'",
        "'speaker_1': 'Thank you so much. The reason why I asked for a staff report was we had a lot of conversations about the impacts of some of our lawsuits that we've had. And I just wanted to be able to understand it from the staff's perspective.'",
        "'speaker_1': 'If lawsuits that we've had over the lifetime of of being the city of Long Beach have impacted our premiums. And if Tom can speak to that just briefly and then we can go to a vote.'",
        "'speaker_7': 'Yes. In the past, probably five, ten years, just about every local government has seen an increase in claims. And so that does put a strain on the insurance market. We're not alone in this, but our general liability has gone up in terms of the price that you pay and also the insurance that you're able to receive.'",
        "'speaker_7': 'So we were able to get insurance this year, which is a very good thing, and we strongly recommend this policy in front of you.'",
        "'speaker_4': 'Any other questions, Councilwoman?'",
        "'speaker_1': 'That's all. Thank you.'",
        "'speaker_4': 'Okay. Rock over.'",
        "'speaker_0': 'District one. I'm District two. District three. District three. District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District five, I. District six.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_3': 'All right. All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Taxiway D Rehabilitation Contract, Appropriations and Categorical Exemption at the Long Beach Airport.": [
        "'speaker_4': 'I'm 21, please.'",
        "'speaker_0': 'Report from Long Beach Airport. Recommendation to award a contract to Sally Miller Kohn Contracting Company for the Taxiway de Rehabilitation for a total amount not to exceed 6,223,745 District five.'",
        "'speaker_4': 'I'm going to mention in a second. Of most significance from boring to any public comment.'",
        "'speaker_0': 'There's one public comment for this item.'",
        "'speaker_5': 'Dave Shukla. Your time begins now.'",
        "'speaker_2': 'Hello. This is Dave Chappelle. I just walked away from city hall because it's chilly and I go to the bathroom, but black lives matter. And with this item, if you compare the process. The open bid process for the contract.'",
        "'speaker_2': 'They're fighting with the one that's coming right after it. You can see a market different. In how we prioritize certain types of work, certain types of local knowledge within our own department, as well as within the local economy.'",
        "'speaker_2': 'As I understand it, the actual construction engineering work. Or this item would not be terribly complicated. It's something that we could benefit from. A local firm learning how. And there's got to be a better process, got to be a better process for supporting our local economy in this moment.'",
        "'speaker_2': 'And for the record, I'd just like to ask the city clerk, what's the function of this public comment? Because they just switched to before the council discussion. But for a couple of years and we just had earlier today they were after, you know, the council had its deliberations.'",
        "'speaker_2': 'I'd like to see the public's input prior to their council. People making decisions on their. Thank you and BlackLivesMatter.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_4': 'We'll cover.'",
        "'speaker_0': 'District one, i. District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'I. District for.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five. I.'",
        "'speaker_0': 'District six. I'm seven.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District nine. High ocean carries.'"
    ],
    "Contracts for Engineering Construction Management Services for Long Beach Airport Projects.": [
        "'speaker_4': '22.'",
        "'speaker_0': 'Report from Long Beach Airport Recommendation to award three contracts for as needed engineering construction management services various development projects at the Long Beach Airport in an aggregate amount not to exceed 4 million District five.'",
        "'speaker_4': 'Okay. Can I get a motion to make Councilman Mango so I can make Councilman Ringa? Roll call vote, please. Is there any public comment? I'm sorry.'",
        "'speaker_0': 'There's one Republican. There's one public comment on this item.'",
        "'speaker_5': 'Dave Shukla you have your start now.'",
        "'speaker_2': 'Oh, I said everything I had to say previously. Black Lives Matter. Thank you.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_4': 'Roll call vote, please.'",
        "'speaker_0': 'District one. I just like to shine. District three.'",
        "'speaker_1': 'IV. District four.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'District five. I. District six. Five districts. Seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight. District eight. District nine. My motion carries.'"
    ],
    "Appropriation Increase and Transfer of Measure R Funds for the Shoreline Drive Realignment Project.": [
        "'speaker_4': 'Okay. Next item.'",
        "'speaker_0': 'Or from Public Works recommendation to increase appropriations in the Capital Project Fund Group and the Public Works Department by 2,000,800. Offset by measure are funds for the Shoreline Drive Realignment Project Districts one and two.'",
        "'speaker_4': 'There is a motion. Can I get a second?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'If there's emotion, there's emotion by. Well, let me let me have. Councilman Zendaya's motion has this because it's in her district and the second by Councilman Mungo. Mr. Mark, I think you wanted to make a staff report or a short one.'",
        "'speaker_7': 'I do. So this is really an incredible project that's been under way for several years. We're getting additional funding. It's going to really re-envision how we come into the downtown area and also double the size of the park.'",
        "'speaker_7': 'But primarily, I just want to comment that this is Craig Beck's very last council meeting. So he is here. This is his last item that he'll ever do. So I just wanted to make sure that the council knew that we are going to miss Craig incredibly here at the city.'",
        "'speaker_7': 'He has a long, storied career here in Long Beach. He's been a true public servant and he's been a good friend. So we will miss Craig. And thank you very much.'",
        "'speaker_4': 'The motion is by consumers and I'm going to make them the second by consumer appears in part of the project is also in the second district. Let me let me just add let me add a couple of things.'",
        "'speaker_4': 'So one is what I think I want to think and Craig back Beckham will have a chance to a few things at the end. But Mr. Burke, you've been a great partner on on this project. And I believe part of this includes the additional money for the Shoemaker piece of the realignment.'",
        "'speaker_4': 'Is that correct? Mayor. No, this money is really specifically aligned for the Shoreline Drive realignment. This is the alignment is only for the Shoreline Drive piece. Okay. But it's still the Metro money, correct? Yes. Measure R. Okay. Okay.'",
        "'speaker_4': 'Great. Great. Great. Okay. Good. Thank you. Did you have Councilman Mongo that you have queued up to give any comments on this?'",
        "'speaker_1': 'I just wanted to think, Mr. Beck, when I heard it was a public works item I queued up for, sorry, I didn't know it was in districts one and two. Mr. Beck, you have been a warrior in helping residents focus funding on street repair, park repair and the things that are important to them.'",
        "'speaker_1': 'This is just another example of that. And thank you for all that you do. And. Cheers to a very relaxing retirement.'",
        "'speaker_4': 'Thanks, Mary Andrews.'",
        "'speaker_2': 'Yes, Mr. Banks, I tell you, I just wanted to say you've been a guru, as no one has been able to do it the way you have. I just wanted to let you know, big guy. So whatever you do and wherever you goin, I give you all the best.'",
        "'speaker_2': 'But don't forget that last project I talked to you about. Good luck, big guy. Whatever you do.'",
        "'speaker_4': 'But thank you. And I know a couple of folks are going to say some some remarks at the end for Mr. Beck. So, Craig, stick around there. And I think is there any public comment on this?'",
        "'speaker_0': 'No. There's no public comment on this item.'",
        "'speaker_4': 'Roll call vote, please.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'High District or.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'High High. District six. District six.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District seven.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Ordinance on Short-Term Rentals.": [
        "'speaker_4': 'Right. And next one, I'm 24, please.'",
        "'speaker_0': 'Communication from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code related to short term rentals. Read and adopted as read citywide.'",
        "'speaker_4': 'Okay. Okay. Councilmember Pearce, is there a second? Second.'",
        "'speaker_1': 'Back to the second. Oh.'",
        "'speaker_4': 'Okay. Can I get any public comment, please?'",
        "'speaker_0': 'There is no public comment on this item.'",
        "'speaker_4': 'Okay. Then we'll we're going to go to a roll call vote. Unless anybody wants to add anything else. Councilman Pearce.'",
        "'speaker_1': 'No, thank you.'",
        "'speaker_4': 'Roll call. Vote.'",
        "'speaker_0': 'District one I. District two i. District three, i. District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six. District seven.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_6': 'II.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'"
    ],
    "Resolution on Racism and Reconciliation. ": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_4': 'Item 2711.'",
        "'speaker_0': 'Communication from city attorney recommendation to adopt a resolution acknowledging racism as a public health crisis and establishing a framework for reconciliation citywide.'",
        "'speaker_4': 'Gave a motion by Councilmember Richardson and a second by Councilmember Pearce. We got a public comment, please.'",
        "'speaker_0': 'There's one public comment for this item.'",
        "'speaker_5': 'Dave Shukla, your time begins now.'",
        "'speaker_2': 'Oh. Hello. Sorry. The bloody bishop. This is a very important item. It. Yeah. I mean, I can't stress that enough as someone who the only enemy he has is a hundred years of carbon trapped in the. It's kind of easy to attract content.'",
        "'speaker_2': 'But for everyone's lived experience right now, there are all the decisions that were made tonight, made from a place of lack of knowledge about how they'll affect certain groups more than others. And a lot of the unintended consequences that we hear about from public policy discussions, we need to kind of fill that in in the 21st century'",
        "'speaker_2': '. We need to kind of look at the data that we have so many different events, but but specifically on how certain groups of people. How you have their freedoms as a result of keeping other people unfree. That's not what this country should be about.'",
        "'speaker_2': 'Thank you very much. Black Lives Matter.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_4': 'Councilman Richardson, you want to speak to the motion there?'",
        "'speaker_3': 'A few thoughts on that. Some are just some changes here. So first, I want to just acknowledge Vice Mayor Andrews, Councilman Austin and Councilwoman Pierce, who all signed on to the initial recommendation that started this on this framework reconciliation path.'",
        "'speaker_3': 'We've had two meetings, the last meeting, and it's one in 55 people in the listening session. I think it was in terms of listening sessions go, it was incredibly powerful and the things that we heard, what folks opened up and shared.'",
        "'speaker_3': 'I don't think has ever there's ever been a forum on the record for that to ever have happened, and that's incredibly important. I think the events that are taking place in our country with respect to racial injustice, it's an important moment for me.'",
        "'speaker_3': 'You know, for me personally and for a lot of the members of this council. Typically, when we pass a resolution, these are ceremonial moments and some of them means different, significant things. I think the fact that, one, our city council is unanimously declaring racial inequity as a public health crisis is important, and that makes me proud as'",
        "'speaker_3': 'a city. Secondly, it's important that we started off this process of this framework by acknowledging and so the original the original resolution that was proposed did things like acknowledge police violence in America and within our city. And it allowed us to acknowledge that so that we could, you know, start in the same place in terms of moving'",
        "'speaker_3': 'forward into listening, into convening and into catalyzing action. I know that traditionally in our process and this is I'm speaking for the public to understand this process, a lot of times we bring a resolution, we'll bring a draft, city attorney will make edits that draft, and it comes back to the council to make edits to the draft'",
        "'speaker_3': '. So I know that there were pieces in here that were that were that were removed. That's the process. And we tonight, the council has the ability to put that back in again. These resolutions, you know, they they really sort of help reflect the statement that the council is trying to make.'",
        "'speaker_3': 'So and so I know that I've had the conversation with the city attorney and the city prosecutor about reinstating some of that language. I know that Councilwoman Pearce wants to speak to some of that, too. So we want to make sure that that language is is restored.'",
        "'speaker_3': 'I think it's also important for this moment in history that the resolution also proclaimed that Black Lives Matter. I think that's important. That is reflected consistent with, you know, this moment in history. And when our city looks back at this moment in history, we want to make sure that we acknowledge this movement for black lives and the'",
        "'speaker_3': 'role that is playing here. So that's it. That's my emotion. And I want to hear some of the feedback from the second.'",
        "'speaker_4': 'Councilman Pearce.'",
        "'speaker_1': 'Thank you and thank you so much for speaking to that. And yes, historically, whenever we bring items to the Council for a vote, a resolution, we ask the city attorney to draft it. And this resolution was drafted quickly and put as an example.'",
        "'speaker_1': 'And so I want to speak to the statistics that are that I'd like to put back into this, and I want to highlight that all the statistics that I'm going to suggest putting back in are numbers that our city has provided us, either through PD or through our Office of Equity in the Health Department.'",
        "'speaker_1': 'And so I will have this all written up and sent back to you, Mr. Parkins, with the exact language that was given to me by the Office of Equity. And so the original item was getting out. I'll go through it quickly because I know that you have it, but 13% of Long Beach is population, is African-American.'",
        "'speaker_1': 'Black residents and those who identify as mixed race, it's greater barriers and finding unemployment, employment and having a higher than average unemployment rate of 12.2%. Black workers tend to face higher unemployment rates regardless of education level. A nearly 33% black residents in Long Beach continue to have the highest poverty rates compared to other racial and ethnic groups'",
        "'speaker_1': '. One quarter of black residents in Long Beach are homeowners, the lowest rate compared to other racial and ethnic groups. Black women have the highest rate of rent burden, which is defined by paying more than 30% of your rent of your income on rent.'",
        "'speaker_1': 'Black women are paying 63% of their income. Black residents have higher mortality rates compared to other racial and ethnic groups due to education, economic housing, segregation, as well as environmental racism. African-Americans in Long Beach have the highest rate of hospitalization for heart disease, diabetes, asthma compared to other races and ethnicities.'",
        "'speaker_1': 'Black residents are hospitalized for asthma 9.4 times more than whites. The long, the longest life expectancy has a gap of 17 years, depending on where you live in the city. One quarter of very low birthrate babies are born to African-American mothers in 40.'",
        "'speaker_1': 'Let me see. I wanna make sure I include only the stats. That 44%. So this is a number that did come from our city as well. 44% of those arrested by a Long Beach police department for cannabis enforcement were black, even though they were represented 13% of the population.'",
        "'speaker_1': 'And then the other two statistics, which are the only ones that we have right now, which speaks to the need for us to make a commitment to transparency, data and access for the public that we have around our police force.'",
        "'speaker_1': 'As of today, I know that there are numbers that are from the past. But today in Long Beach, when we passed this resolution, the facts are that in five years, from 2015 to 2019, there was 191 uses of force complaints filed against the Long Beach police officers, including 21 complaints in 2019.'",
        "'speaker_1': 'That number is significantly lower than the other years. In seven years, from 2014 to 2020, the city spent $31 million and alleged police excessive force. Settled lawsuits since 2014. And so I think that what Councilmember Richardson said was correct, that the resolution the city is making today is a statement saying that we are the responsible party for'",
        "'speaker_1': 'the structural racism that exists in our city, that includes health disparities, the climate gap, unemployment dependency discrepancy and police violence. Last night I listened to the public safety reconciliation session. I read the comments and I've talked to my constituents.'",
        "'speaker_1': 'They want a resolution that means something. They want an acknowledgment, a genuine acknowledgment and reflection on the current state of the city of Long Beach. It's with that that I ask that we include these statistics provided by the Health Department on the black state, on the state of Black Long Beach, and to include the current state of'",
        "'speaker_1': 'police in our city by including these statistics I've laid out. So thank you, Councilmember Richardson, and I hope to count on everyone's support for that.'",
        "'speaker_4': 'Okay. Very. Any public comment, please?'",
        "'speaker_0': 'We did public comment. Dave Shukla already spoke on this item.'",
        "'speaker_4': 'Right. Then roll call vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'Upstairs I.'",
        "'speaker_0': 'District to. I. District three. I. District four.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'District five. District six. District six.'",
        "'speaker_1': 'What is he going to achieve by putting that?'",
        "'speaker_0': 'District six. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_4': 'Okay. We're going to go ahead now and close the council meeting. We have a couple of announcements. Let me start with customary Ringo.'"
    ]
}