{
    "Resolution to Vacate a Portion of Martin Luther King, Jr. Avenue. ": [
        "'speaker_1': 'Item number three Report from Public Works Recommendation to receive supporting documentation into the record. Conclude the public hearing. Find that the area to be vacated is not needed for present or prospective public use and adopt a resolution ordering the vacation of a portion of the West Side of Martin Luther King Junior Avenue, south of Sixth Street, District'",
        "'speaker_1': 'one.'",
        "'speaker_0': 'Thank you, Mr. West.'",
        "'speaker_4': 'Mr. Mayor. The staff report on this item will.'",
        "'speaker_5': 'Be handled by our Malloy and our Director of Public Works. Honorable Mayor and Honorable Council Members. The item before you is a request to vacate a portion of the West Side of the Martin Luther King's Junior Avenue, south of Sixth Street.'",
        "'speaker_5': 'As depicted in Exhibit A. It's about a five feet by 49 feet, equating about 244 square feet of public land. On February 3rd, 2015, the City Council adopted Resolution Number 15 Dash 0009, declaring its intention to vacate the subject property or right away and set March two, which is today as the date for the public hearing.'",
        "'speaker_5': 'If you have this is the end of my report. If you have any questions, I can respond.'",
        "'speaker_0': 'No problem. Are there any public comments on hearing item number three? See none. If there's any council deliberation on hearing item number three. See nonmembers. Please go and cast your votes.'",
        "'speaker_1': 'Councilwoman Pryce. Motion carries six zero.'",
        "'speaker_0': 'Thank you. Now we're going back to hearing item number one.'"
    ],
    "Entertainment Permit with Conditions for The Boathouse on the Bay.": [
        "'speaker_1': 'This item requires an oath. Item one report from Financial Management. Recommendation to receive supporting documentation into the record. Conclude the hearing and grant an entertainment permit with conditions on the application of Naples Restaurant located at 190 North Marina Drive for entertainment with dancing by patrons.'",
        "'speaker_0': 'District three can return this over to Mr. Modica.'",
        "'speaker_5': 'Thank you. And, Madam Clerk, if you would administer the oath.'",
        "'speaker_1': 'Please hold up your right hand. You and each of you do solemnly state that the testimony you may give on the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_4': 'Thank you, Mr. Mayor, members of the City Council.'",
        "'speaker_5': 'The staff presentation will be handled by Jason.'",
        "'speaker_4': 'MacDonald, our purchasing and business services manager. Mr. Mayor, Council Members.'",
        "'speaker_2': 'Jason McDonald Purchasing Business Services Bureau Manager for the Financial Management Department. Tonight you have in front of you the application for Entertainment with Dancing for Naples Restaurant Group, LLC, DBA, The Boathouse on the Bay 190 Marina Drive in District three.'",
        "'speaker_2': 'All of the necessary departments have reviewed the application. The application and proposed conditions are contained in the packet that was provided. We are prepared to address any questions or concerns along with the police department regarding the application or those conditions.'",
        "'speaker_2': 'Our office was made aware of at least one complaint regarding this application. That concludes my presentation where available for questions. Thank you.'",
        "'speaker_0': 'Thank you. And now, as part of the hearing, we open it up for public comment before we take it behind to the council. See? No public comment. Councilwoman Price. Sorry, sir. I didn't see you back there. Please come forward.'",
        "'speaker_5': 'Good evening. My name is Mike Leshner. My address is 203 North Marina Drive, Long Beach. I am a yacht owner in the row of boats that are directly opposite the open patio for the Boathouse restaurant. Dating back to the middle of 2014.'",
        "'speaker_5': 'We've had some serious noise issues. We addressed those through the proper channels, through noise. The noise department. Noise department sent a letter to the restaurant asking them to perhaps make some revisions to their noise policies and nothing happened.'",
        "'speaker_5': 'So then we received another letter from the noise department saying, Well, you have to send a petition with six names. So we did. And I can tell you that it's not easy gathering names from six millionaire boat owners on the same petition.'",
        "'speaker_5': 'But we sent it in and of course, we heard nothing else again. We started to try to figure out why it was happening, that the city was not clamping down and what we thought was an egregious noise problem.'",
        "'speaker_5': 'And I began to investigate that the ownership of the restaurant and I won't make any broad based conclusions, but certainly one of the owners of the restaurant is the son of a. Congressman, one of the owners of the restaurant is the son of a county supervisor.'",
        "'speaker_5': 'I grew up in the south side of Chicago. I'm not an idiot. I will say this. You are my landlord. I live there because I have a limited work permit. The gentleman who's going to speak after me. Paul is another major yacht owner in the marina.'",
        "'speaker_5': 'Between the two of us, in the years we have been there, we have spent $1 million. We tallied it. We have spent $1 million to have this space. All we ask is the peaceful enjoyment of our area. We are directly across from an open patio with no walls, no roof until 10 p.m. every night.'",
        "'speaker_5': 'We hear some of the worst music we've ever heard. It is an opportunity for anybody with a saxophone, a Coca-Cola band or everything else to make a racket. And we expect more from the city. We expect more from the marina.'",
        "'speaker_5': 'And I have given you each a packet which shows the the sign petition, the correspondence with the city. We've made every attempt to deal through all of the channels. And it's just been the strangest, strangest process we've ever seen trying to figure out how to get some peace and quiet, what we ask for.'",
        "'speaker_5': 'And I'll I'll make this sweet. We're not expecting to see anybody tonight in the entertainment license, and we'd like to see the boathouse do well. I'm a past board member at Pepperdine. I called one of our alums, Matt Carnaby, who's one of the owners, and we had a very nice chat and have tried to amicably make some'",
        "'speaker_5': 'suggestions of how we can get serve.'",
        "'speaker_0': 'Time is up. Thank you very much, sir. Next speaker.'",
        "'speaker_4': 'Hello. My name is Paul Franks and I also reside at 203 Marina Drive. We have a liveaboard permit. That is our home. We are less than a thousand feet from this particular patio that they're playing the music on.'",
        "'speaker_4': 'I don't again, I don't have an issue with them having a permit for entertainment, but I do have an issue with is the amplification this patio. I'm not even sure you could park five cars on it. It's very tiny.'",
        "'speaker_4': 'There's no reason to have amplification. And from inside my boat most nights. This stuff you can hear, it's booming through. Whether it's good or bad music, I don't really care. It's the volume of it. There's no need for amplification.'",
        "'speaker_4': 'You can't be more than 30 feet from the person playing the music on that patio and it's really annoying. I can't do. It's the equivalent of you having a rock band on your front lawn. And before you decide on this, I want you to decide.'",
        "'speaker_4': 'Would you have a rock band on your front lawn every night? You are my landlords. I pay a very large sum of money every year to house my boat there. And I live aboard that boat along with my wife.'",
        "'speaker_4': 'And it is an amazing volume. So what I'm asking for is just no amplification. I like the restaurant ether all the time. I think it's a great restaurant, but they don't need to be making that kind of volume.'",
        "'speaker_4': 'You cannot sleep with it. And many times I go to bed at eight or 9:00 at night. And you can't it's that it's that loud. So, you know, I think you need to ask yourself, would you have a rock band on your front lawn?'",
        "'speaker_4': 'And if not, you know, you need to think about it. Well, they can play it without amplification. And everybody on that patio can hear every note played. There's absolutely no reason. So what I'm asking for is just a restriction to basically say no amplification of the music.'",
        "'speaker_4': 'Anyway. That's about all I have to say. Again, you are my landlord and you are responsible for this. And like I said, we pay for that peace and quiet. We live there for a reason because we like living there.'",
        "'speaker_4': 'And that marina, it's been very quiet and we've lived there for years. And now suddenly every night until 10:00, we have an amazing amount of racket. Anyway, thank you for your attention.'",
        "'speaker_0': 'Thank you, sir. Mr. Good here.'",
        "'speaker_2': 'Do I need to be sworn in? This? I do. Larry. Good clerk has the address. I support the concept of having the music, but without the amplification. No good musician needs amplification. Particularly in an area that is essentially almost the same, identical to what is between this podium and you.'",
        "'speaker_2': 'And I'm going to suggest if there's if there's any. Single and musician or group. They cannot make pleasing music without that amplification. The club should not hire them, period. Thank you.'",
        "'speaker_0': 'Okay. Thank you. Any other public comment on this hearing? Yes, sir.'",
        "'speaker_5': 'Good evening. My name is Eric Johnson. I lived for for for for all of Avenue in Long Beach. I'm one of the partners at the Boathouse. And I just like to say, I appreciate everyone's comments over the last several months.'",
        "'speaker_5': 'We've tried to work with some of the locals on some of their concerns. I appreciate Councilman Price's recommendations and suggestions on ways that we can work with some of the local residents. We want to be responsible business owners.'",
        "'speaker_5': 'We think we are. We're certainly open to suggestions and ways to make it better. The entertainment is important to our business. Al Ms.. Bay Landing is a dining and entertainment destination, so we want to work within that, but also be good neighbors.'",
        "'speaker_5': 'So I appreciate everyone's time and I do appreciate their comments. The entertainment license is important to us. I just want to say that. Thank you.'",
        "'speaker_0': 'Thank you very much, Casey. No other speakers for the hearing. I will now be closing the hearing and taking this back for council deliberation, starting with Councilwoman Pryce.'",
        "'speaker_6': 'Thank you, Mr. Mayor. I'm going to be recommending recommending that we approve this item. I have a few conditions that I've modified that I'd like to address right now and request that staff prepare a modified copy that has the following changes.'",
        "'speaker_6': 'In terms of the indoor music, I'd like to change the proposed condition that we have currently listed and allow. The actual clause will read entertainment activities indicated on page nine of your entertainment application shall be restricted through to Sunday through Wednesday until 9 p.m. and Thursday through Saturday until 1 a.m. and Sundays preceding a holiday Monday till'",
        "'speaker_6': '1 a.m.. So, Mr. MacDonald, is that a change that you can make?'",
        "'speaker_2': 'Yes, Councilmember, we can make those changes.'",
        "'speaker_6': 'And the second change and and I'm making a motion that we approve this item as I'm modifying it right now.'",
        "'speaker_0': 'There's a second bike comes from Boston.'",
        "'speaker_6': 'Thank you. The second modification that I'd like to make is directly in response to the residents who spoke tonight. You know, I do want to just. Say at the outset that I believe that this is a a business that benefits the city and the third district in great ways, that this particular business has been a good partner'",
        "'speaker_6': 'to the residents and to the community, and I believe they're going to continue to be. And I think that they are going to be very responsive to the concerns that that are raised. But in regards to outdoor entertainment, I want them to have the options that they need in terms of musical entertainment.'",
        "'speaker_6': 'But I do believe it's reasonable to limit the hours of operation. So I modified the outdoor entertainment clause to read. Outdoor entertainment shall be restricted to no more than three live performing performers and must cease by 9 p.m. Sunday through Thursday and will be allowed until 10 p.m. on Fridays and Saturdays.'",
        "'speaker_6': 'This actually limits the time that they'll be allowed to have outdoor entertainment by requiring them to attend the outdoor entertainment by 9 p.m. Sunday through Thursday. There are going to be some exceptions to that and the exceptions will be on the following holidays.'",
        "'speaker_6': 'We'll have an exception. Music Outdoor Can can continue until 10 p.m. and that'll be on the following holidays. New Year's Eve. New Year's Day. St Patrick's Day. Cinco de Mayo. Memorial Day. 4th of July. Labor Day and Halloween or the Associated Sunday night when the holiday falls on a monday.'",
        "'speaker_6': 'So on those exceptions, Music Outdoor will be permitted until 10 p.m.. Otherwise, from Sunday through Thursday, music will have to end at 9 p.m.. Mr. McDonald Do you think those are modifications that can be made to the proposed up?'",
        "'speaker_2': 'Yes. Council member that we would be making modifications to the entertainment permit as applied for.'",
        "'speaker_6': 'Oh, I apologize for the entertainment permit. And those are modifications that can be made in some sense as they restrict the operating hours I'm sorry, the entertainment hours for outdoor music. Is that.'",
        "'speaker_2': 'Correct? Yes, that's that's acceptable for the original conditions.'",
        "'speaker_6': 'Okay. I want to encourage the business owners to continue to be good partners to the Liveaboard residents and to the members of the community and to continue to work with them. This entertainment permit is premised upon the expectation and the understanding that we're not going to have any major problems associated with these conditions.'",
        "'speaker_6': 'And should the conditions create a problem in any way, we're obviously going to revisit the conditions and take another look at further restrictions if necessary. So with that, I thank you, Mr. Mayor, of nothing further.'",
        "'speaker_0': 'Thank you. See no other council comment. There is a motion on the floor. Members, please go out and cast your votes on the motion as submitted by Councilwoman Price.'",
        "'speaker_1': 'Motion carries seven zero.'",
        "'speaker_0': 'Thank you. Hearing number two.'"
    ],
    "Entertainment Permit with Conditions for The Gaslamp Restaurant and Bar.": [
        "'speaker_1': 'Item two report from Financial Management. This item requires a note recommendation to receive supporting documentation into the record. Conclude the hearing and grant entertainment permit with conditions on the application of Gas Lamp Partners at 6251 East Pacific Coast Highway for Entertainment with conditions I'm sorry for entertainment with patrons by I'm sorry for entertainment with dancing by patrons'",
        "'speaker_1': 'and performers. District three.'",
        "'speaker_0': 'Thank you. Should we do the oath, Madam Court?'",
        "'speaker_1': 'Please raise your right hand. You and each of you to solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Modica.'",
        "'speaker_4': 'Thank you, Mr. Mayor. The staff item will be the staff report on. This item will be presented by Jason MacDonald Purchasing and Business Services Manager.'",
        "'speaker_2': 'Mayor Council members. Jason McDONELL Tonight you have in front of you the application for entertainment.'",
        "'speaker_4': 'With Dancing for the Gaslamp Partner's.'",
        "'speaker_2': 'Diva, the Gaslamp Restaurant and Bar on 6251 East Pacific Coast Highway in District three. All the necessary departments have reviewed the application. The application of proposed conditions are contained in the packet that was provided. We are prepared to address any.'",
        "'speaker_4': 'Questions or concerns along with the police department regarding the application or those.'",
        "'speaker_2': 'Conditions.'",
        "'speaker_4': 'Our office was made aware of at least one complaint regarding this application.'",
        "'speaker_2': 'That concludes my presentation.'",
        "'speaker_4': 'And we're available for questions.'",
        "'speaker_0': 'Thank you. With that, I'd like to open this up for any public comments on the hearing. Please come forward.'",
        "'speaker_2': 'Very good. You clear as the address, one of the items that needs to be addressed with this. A facility within the restaurant is a real problem. I see. Almost every evening that I pass it and I think it's easily corrected if the right people are brought into the picture.'",
        "'speaker_2': 'They have a mobile sign that's on a trailer. More often than not, that mobile sign is brought out across the public sidewalk. Which creates a problem for people that are in wheelchairs. It forces them either have to hop onto the grass or more dangerously so, out into the street.'",
        "'speaker_2': 'There are that that is a heavy, heavily trafficked corner. People coming from the little shopping center, their sandwich shops and the other restaurants there across the street and then back across. Back, trying to make their way back to Golden Sails and being forced up either into the grass or into PCH is inviting a disaster.'",
        "'speaker_2': 'For which the city would end up paying. So I'm suggesting that you set in. The requisite requirement that it be clearly marked off where their property ends. Where are the cities? Where the public properties? And right now, I'm not sure anybody knows.'",
        "'speaker_2': 'But clearly, forcing people to take a wheelchair up across the grass or out into PCH at night is dangerous. Thank you.'",
        "'speaker_0': 'Thank you. Any other public comment on this item? CNN. I'm turning his back over to the council. Councilwoman Pryce.'",
        "'speaker_6': 'Thank you. I'm going to be recommending that we approve this item with some one modification. And I see that Councilman Andrews has seconded that. So again, Gaslamp is another great partner to the third district. Good, good corporate citizen in terms of being responsive to issues that have come up.'",
        "'speaker_6': 'I want to commend Michael Neufeld, his the owner who for really trying to change some of the operations and the image of the Gaslamp. And he's done a very good job. We've hosted several third district community events there just to show the residents what kind of an establishment it is, because in the past it was a little'",
        "'speaker_6': 'less focused on food and being a restaurant than it was a bar, and he's really changed that. So I'd like to make a modification to item number seven, which is you must operate and maintain your licensed premises. As a bona fide eating place, you must make actual and substantial sales of meals during the normal meal hours that'",
        "'speaker_6': 'you are open at least five days a week. Normal meal hours are breakfast 6 a.m. to 9 a.m., lunch 11 a.m. to 2 p.m. and dinner 6 p.m. to 9 p.m.. Premises are not open five days a week and must serve meals on the days that they are open.'",
        "'speaker_6': 'The premises must be equipped and maintained in good faith. Mr. McDonald I believe, and it's not reflected here, but I understand that the kitchen stays open until 11 p.m. on Fridays and Saturdays. Is that your understanding?'",
        "'speaker_2': 'We do not have that Information Council member, but that is my understanding from communication during this process.'",
        "'speaker_6': 'So I think that the owner understands the importance of maintaining this, this establishment as a restaurant first and making sure that as a condition of their ABC license that their food sales exceed their alcohol sales. So with that understanding and that amended condition to the entertainment permit, I'd move this item.'",
        "'speaker_0': 'There's been a motion and a second. Members, please go ahead and cast their votes.'",
        "'speaker_1': 'Motion carries seven zero.'",
        "'speaker_0': 'Okay. Thank you. Let's go ahead and get a motion on the floor to pass consent calendar. There's a motion and a second public comment on consent. See now and please cast your vote.'"
    ],
    "Suspension of Council Rule to Cancel Meeting on April 14, 2015.": [
        "'speaker_1': 'Item 22 report from Mir Mir Garcia. Recommendation to suspend council rule containing in Long Beach Municipal Code Section 2.03.020 relating to the municipal schedule of the City Council in order to cancel the meeting of April 14, 2015, due to the special municipal election.'",
        "'speaker_0': 'Okay. There's been a motion in a second by accounts from Richardson. And you recognize or any public comment on the item. Say, Mr. Goodhue, please.'",
        "'speaker_2': 'Yes, Larry. Good. You click as I address once again I would suggest holding this off until. I would suggest, based upon the recent communications from the ninth District, I would say ninth District Court. Until July, at which time we will have a opportunity to vote for also a new mayor, and that will consolidate the efforts and so'",
        "'speaker_2': 'forth. And the new mayor. Incidentally, given the budget situation, we'll have a salary equal to $1 more than the council people until our situation in this city is squared away. That's going to be one of the issues that will come up with the new mayor.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Goodhew. We have a motion. No other public comment. Okay. Members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries seven zero.'"
    ],
    "Delay of Action and Direction on International Customs Facility at Long Beach Airport.": [
        "'speaker_0': 'Thank you, Madam Clerk. Next item.'",
        "'speaker_1': 'Item 23. Communication from Councilman Austin. Councilman Urunga. Recommendation to direct City Manager to delay any action regarding requests for an international customs facility at the Long Beach Airport until receiving further direction from the city council and until 90 days after the representation on the city council is completed.'",
        "'speaker_0': 'Okay, thank you. I'm going to turn this over now to Councilmember Austin.'",
        "'speaker_11': 'Thank you, Mr. Mayor. And I want to thank my colleague, Councilmember Urunga, for cosigning on this item. He is a true champion for our neighborhoods here in Long Beach. I want to start out and I want to be very clear that this agenda item does not address the merits of building the customs facility at the Long Beach'",
        "'speaker_11': 'Airport. Surely we will have that conversation at some point, possibly in the future. However. But I am troubled. For more than two years. JetBlue and Long Beach Airport officials have had early discussions and have been discussing a federal inspection services and a customs facility.'",
        "'speaker_11': 'We've just learned that there have been a lot of movement. There's been a lot of movement, resources and staff time committed to this issue. With no direction whatsoever from the city council. There are even discussions with the Department of Homeland Security and financial feasibility studies prepared.'",
        "'speaker_11': 'And objections from the City Council. How much of this effort? More than a year ago. Now we have a formal request from JetBlue for the city to submit an application for customs facility. And it makes sense for us to cool the jets, slow down on this very sensitive issue.'",
        "'speaker_11': 'Actually, tonight is the first time this issue is even being publicly discussed by the council, let alone we take a vote. So what are we seeking to do here before the city manager takes direction from the City Council on how to proceed with this request?'",
        "'speaker_11': 'There should be full representation on the City Council. Now, just to put it in perspective, I don't think we would have moved forward on a Belmont pool project had there been no council representative in the third District most recently.'",
        "'speaker_11': 'And I'm sure there would have been serious objections with moving forward with the Civic Center project if there were no representative from the Second District or the First District at the time. And we certainly don't want to move forward with a medical marijuana policy that oversaturate the ninth District if the ninth District doesn't have a council representative'",
        "'speaker_11': 'there either. Many residents who live in a fourth district live directly under the flight path of the airport. And I believe it's undemocratic to move forward with this issue in any way when such a key district does not have a voice or vote on the city council.'",
        "'speaker_11': 'We must also give time for that representative who will be elected in just over a month to get time to have time to be brought up to speed. There's a lot that comes at you when you're a brand new city council member.'",
        "'speaker_11': 'And for that fact, I think we held up a lot of business for the city to allow five new city council members to get seated and to get their feet underneath them so that they could get caught up on the issues.'",
        "'speaker_11': 'I think we all the same consideration for this new new councilmember coming in. For anyone who may disagree with me tonight recommended action. I'm sorry. I simply ask, what is the rush and whose timetable are we working under?'",
        "'speaker_11': 'The request was made for the city council and the city to move forward. And so we are driving this process. Not any company, not any airline in the spirit of decency and fairness to more than 500,000 residents in our city who do not have a seat behind this dais tonight, it is only right to delay this action'",
        "'speaker_11': 'or any action or considering this request for a few months. All three candidates from the fourth District seat have asked the city council in writing to delay this issue until 90 days after this seat is filled. One of these three candidates will soon be our colleague on the council.'",
        "'speaker_11': 'We even have a letter here from former councilmember in the fourth District and now state assembly member Patrick O'Donnell requesting the same and supporting this agenda item here today as well. As is often the case, I fully expect there will be efforts this evening to offer friendly amendments and substitutes and substitute substitutes.'",
        "'speaker_11': 'And I just want to be very, very clear. The JetBlue's lobbyists and the JetBlue folks have been very active in contacting our city council members and asking for this timetable to be minimized. Let me state that I consider that any proposal that fails to recognize the need for a voice from the fourth District residents before any action'",
        "'speaker_11': 'is taken by our city manager or staff would not be viewed as a friendly amendment. It runs counter to the intent to have a democratic process on this issue. This is an issue that can impact thousands of residents throughout our city.'",
        "'speaker_11': 'And so let's make sure that all the Long Beach has a voice. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Isom. Yeah. Customer your income.'",
        "'speaker_5': 'Thank you, Mayor. I want to echo the sentiments of my colleague from the eighth District. This is a too important topic to not have a full council on. So I too, I support the motion by my my council colleague to delay this action until there is a full, full city council on board.'",
        "'speaker_0': 'Okay. Think it comes from rearing someone to move on. I do have some speakers that we're going to go to. Of course, we have public comment, so we're going to go to have we have some I think there are some questions and speakers first and then we'll get to public comment, then we'll go back to the Council'",
        "'speaker_0': 'for deliberation. Vice Mayor Lowenthal.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I may have missed this. Was there a motion?'",
        "'speaker_0': 'There was not. Whether I believe that I may see a motion plugged in and think he said it, but he plugged into the system.'",
        "'speaker_8': 'So I'm sorry. I'm not even looking at the system. I apologize. Yes, there was a motion.'",
        "'speaker_0': 'Yes, we have a motion in a second. Austin uranium.'",
        "'speaker_8': 'Okay. I do have a few questions. And the first question I have is and most people don't need this, but just just for my own edification. Mr. City Attorney, if if you could just summarize perhaps what the distinction here is between this issue that we're taking up and the conversation that we're having and the concerns that a'",
        "'speaker_8': 'lot of people have, and rightly so, the concerns that people have about the noise bucket and and whether this actually impacts or any action such as this would impact that.'",
        "'speaker_4': 'Mayor, members of the council. Just to reiterate what was discussed at the study session on the airport there, the noise ordinance is not technically implicated by where the flights originate from or to. It is a cumulative accumulation of the noise created by the jets landing and taking off.'",
        "'speaker_4': 'So it is not related to or tied to this item before you this evening.'",
        "'speaker_8': 'Thank you. And then. For the city manager so that those of us who aren't privy to all of the work that you're doing or even the conversations that council may have had in previous council meetings, if this motion if this item had not been before us, what was the work that you would have done or what is'",
        "'speaker_8': 'the work you would have done? What's the process you would have taken? Could you describe that for us?'",
        "'speaker_5': 'Vice Mayor Council Members We would then begin, probably hire a consultant and go through a study to look at the financial feasibility of this, look at the geographic feasibility, look at how it fits operationally, administration. And then probably in about five months, in July or August, we would come back to the city council for the city council'",
        "'speaker_5': 'to set policy.'",
        "'speaker_8': 'Okay. Thank you. That's all I have right now, Mr. Mayor.'",
        "'speaker_0': 'Thank you. And except Councilwoman Mongo.'",
        "'speaker_12': 'I just wanted to make a statement about how I feel about my responsibility as a council person and how it differs from the letter written by a colleague that I respect and admire greatly. While I am elected by the members of the Fifth District, I think that each and every one of us have taken an oath of'",
        "'speaker_12': 'office to represent each and every person in this city, and that visits the city. And so when people come up to me and ask if I'm their council person, I say, of course, because I, I vote on $3 billion in budgets annually and the future and contracts related to millions of dollars in vendors, the pensions and benefits'",
        "'speaker_12': 'of hundreds of police officers, firefighters and public service workers and each and every one of those items is of importance to me. Specifically, I think that we as a council owe both our residents and our businesses a process this weekend while spending an additional amount of time in the fourth District, the place where I get my dry'",
        "'speaker_12': 'cleaning done, and my favorite frozen yogurt shop, which I spent a bit of time at. Residents often approach me and ask, Can you help with this? Can you help with that? Of course, because we as a council represent each and every one of you.'",
        "'speaker_12': 'While as a district representative, I take the lead on certain things related to cups or business licenses. That doesn't mean that my colleagues at any time would not vote for residents if they felt that I was not doing my diligence as a council member for the city.'",
        "'speaker_12': 'And so one of the challenges I have with the letter is it implies that the Fourth District is not represented, and I want each and every one of you to know that you are represented. I have lived in the flight path in two different locations.'",
        "'speaker_12': 'I have a multitude of family members who currently live in the flight path, as I've mentioned before. Every few months I remember as a child watching the screens from the windows and the soot on the cars from living in the flight path.'",
        "'speaker_12': 'And my parrot. My grandparents bought that land when the airport was just a little speck in people's eyes. And so he built that home that we lived in and. The difference can be, too, that often we buy our homes knowing and understanding the things that are there and the protections that are in place.'",
        "'speaker_12': 'And we need to balance that with ensuring that every business has the right to bring forward a request to this council and to be considered timely. I may not agree with some of the items before this council, whether it's the marijuana ordinance or the logic labor agreement or any other item.'",
        "'speaker_12': 'But the constituents are represented and every business is given that due diligence and the way that I currently read the memo from the city manager. This is a three year process. A delay of an additional three weeks is pandering.'",
        "'speaker_12': 'To this crowd because it's it's insignificant in a three year plan, which will take an exuberant amount of time. And so those that's my perspective. There is no way that our city staff would be able to bring back the information until the time at which our council members.'",
        "'speaker_12': 'Our new council member colleague will be seated. I have great respect for the three colleagues. I moderated their debate earlier this week. I think any of them would be able to digest this information. They seemed very informed on the matter in front of the public that was there then.'",
        "'speaker_12': 'And I have confidence in their abilities now and then. So with that being said, I have no more comments.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman. Councilwoman Price.'",
        "'speaker_6': 'Thank you. I have a couple questions for staff. First, I want to say that. I understand where Councilman Austin is coming from. I've talked with him about this issue. I know he's very concerned, as are all the council members.'",
        "'speaker_6': 'But he has he represents a constituency that we don't all represent. He has his own unique constituency and issues. And I've spent a lot of time talking to him about his concerns. And I do believe him when he says that this item is not about the merits of the proposal, but rather allowing us to be in a'",
        "'speaker_6': 'place where we have representation. And I think there's some validity there. And while I didn't think about that on this issue, I will say that this council has before it another very important issue, and that's the medical marijuana ordinance.'",
        "'speaker_6': 'And it's interesting to me, because the fourth District has a series of businesses that were negatively impacted by illegal medical marijuana dispensaries. They feel very passionately about that subject. And yet the current timeline that the council has in place for making a vote on that doesn't even include the fourth District representative being elected.'",
        "'speaker_6': 'And so I think there is a lot of merit to the idea of having representation from all of the districts, because although Councilwoman Mango may have her finger on the pulse of the Fourth District residents, I certainly don't.'",
        "'speaker_6': 'I represent the entire city, but my day to day obligation is to the residents of my district. So I think their councilperson would be in the best position to know what it is their constituents feel, and I think they would take that very seriously.'",
        "'speaker_6': 'So I think there's a lot of merit there. I also like and I hadn't heard it before, but the analogy to some of the big things that we voted on recently, we would not think for a moment about voting on the pool or the shot create issue if there was not a third district council person in the'",
        "'speaker_6': 'seat, because those are issues that heavily impact my district. So I think there I think he has some great merits on it, but I do have some questions for staff in regards to this process, and it's mostly just to educate myself on the process.'",
        "'speaker_6': 'So is there any work that the staff has to do before we vote, before we move forward with JetBlue's request, before we can actually move forward with JetBlue's request?'",
        "'speaker_5': 'Councilmember Mayor, first off, I'd like to make a comment that our airport director, Bryant Francis, had a long standing commitment outside the city. So he's not here tonight. We have our financial bureau manager, Claudia Lewis, with us to answer any specific questions.'",
        "'speaker_5': 'But this is a pretty general once I'll answer it. Basically, in order for us to go approach the federal customs facility, we would have to do our own study and get our own request from the city council. Whether the council views, whether this is a good idea or a bad idea to send an application forward.'",
        "'speaker_5': 'But we would need, like I said, about a five month time period to conduct a study, bring it to the council, and the council would take the next step.'",
        "'speaker_6': 'Now, would you need any direction from council to actually undertake that process.'",
        "'speaker_5': 'Given the item that we have tonight? I certainly would request direction. Yes. Absent this meeting, we would probably just process it.'",
        "'speaker_6': 'Okay. Okay. And in regards to this particular item, I would like to ask the maker of this motion. Council member Austin and your. Would you be open to a friendly amendment to move the time period to 60 days after the person is seated to give them the opportunity to get caught up?'",
        "'speaker_6': 'Because I do agree with some of the points that have been made that I think we should wait. However, given the relevance of this topic and how frequently it's been coming up during the campaign trail, I expect that our future colleague will be very well versed on this issue.'",
        "'speaker_6': 'So I'm just wondering if you're open to that.'",
        "'speaker_0': 'Mr. Austin.'",
        "'speaker_11': 'Well, I can tell you that when Councilmember Urunga and I first had this conversation early Monday morning before we could put our agenda item in last week, we we were fully aware that, that, you know, our 90 day, um, ask could be be seen as a little ambitious considering the fact that we have 30 days before we're'",
        "'speaker_11': '30 days out from an election and then possibly 60 days or even more after that. The 90 days was an arbitrary number to give us some cushion. I personally would would would I would be okay to a friendly amendment for 60 days, but nothing less.'",
        "'speaker_11': 'And if I knew that that I could get full council support on this on that I don't I don't want to. Undermine the importance of of delaying this and giving the fourth District Council member, the new council member coming in all of the room possible to to to be fully brought up to speed.'",
        "'speaker_11': 'And when I say fully brought up to speed, they have to step up in office. They have to figure out a mechanism to outreach and bid and get community support or to have a town hall meeting with their their constituents on this.'",
        "'speaker_11': 'And so when we do the 90 days out there, we thought that was fair. But, you know, if I'd be open if I thought that there was some if we can get some consensus as a council on this.'",
        "'speaker_6': 'And that's where I'm coming from. Council member Austin is I'm trying to find if there's a way that we can meet in the middle and effectuate the intent of, of this agenda item. You know, one thing I didn't mention carries a lot of weight with me is our former colleague, Assemblyman O'Donnell's letter.'",
        "'speaker_6': 'That carries a lot of weight with me because I don't think there is a single council member that I've studied in history that had his finger on the pulse of his community as well as Council Councilman O'Donnell did.'",
        "'speaker_6': 'And he is telling us from Sacramento, my constituents need to be heard. They need someone advocating for them specifically. That carries a lot of weight with me. I wasn't expecting to see this letter when I walked in tonight.'",
        "'speaker_6': 'I knew what your position was and certainly was sensitive to that. But I think to me, this this letter says a lot because he's the closest thing to a representative that they have right now. So, anyway, I appreciate you accepting that.'",
        "'speaker_6': 'Now, what about. Okay, I'm just going to stop there. Thanks for now.'",
        "'speaker_0': 'Thank you, Counselor Richardson.'",
        "'speaker_10': 'Thanks, Mr. Mayor. So just a couple of things. And, you know, I have my iPad up and I intentionally pulled up my my favorite game video game because I really didn't want to get into this conversation. But I think I'm going to jump in.'",
        "'speaker_10': 'So I would say that I'm serious. I got Star Wars. So I would say that, you know. This is a neighborhoods issue, the ninth District, not in the flight path, but they're on our neighbors flight path. Right. It's important to my neighbors.'",
        "'speaker_10': 'It's important to me. It's that simple. I think what's being asked for is is reasonable. But I'm lacking a whole bunch of context in terms of in terms of like I'm not I'm not entirely clear that we would be debating this issue at the city council within the next 120 days or 90 days after the election anyway'",
        "'speaker_10': '. I would need to just hear from the city manager. Like, when were you planning on bringing this to the council? Are we talking about this because this agenda item was placed on and we wouldn't have been talking about this otherwise.'",
        "'speaker_5': 'Councilor, mayor, council members. We'd been discussing with the city council privately, but also more importantly with JetBlue that we weren't going to accept any application for a Customs facility until we had a new airport manager, airport director in the seat and established.'",
        "'speaker_5': 'So basically we were getting ready to process that because Brian Francis had been there for has been here for enough time to initiate a study. Then given the interest in the city council and neighborhood, it's here before the city council.'",
        "'speaker_5': 'So we certainly at this stage would request if we if we went forward, we would want city council direction.'",
        "'speaker_10': 'I guess my question is when if this item hadn't been brought, what was your plan to bring to bring this discussion to the city council? See if we were interested.'",
        "'speaker_5': 'The Council would know that we're initiated it. But but the first time the council would see.'",
        "'speaker_4': 'The plan would be when the study was complete, probably.'",
        "'speaker_5': 'In July or August.'",
        "'speaker_10': 'Okay. So in in how you develop your plan. Are there? Is this just an inward analysis that you and all your airport staff do? Or do you have to do outward communication to customs or federal agencies or anyone else to express interest in the airport?'",
        "'speaker_5': 'I believe it's more internally, but that's.'",
        "'speaker_4': 'A question I'm going to refer.'",
        "'speaker_5': 'To Claudia Lewis.'",
        "'speaker_8': 'So if I understand.'",
        "'speaker_12': 'Correctly, the question.'",
        "'speaker_8': 'Is what type of outreach would we do?'",
        "'speaker_10': 'Is is the study the study you're doing, are you expressing to the public or to other agencies that might have some scope, some sphere of influence on this decision? Are you expressed are you communicating with them about the study or is this something you can conduct in-house?'",
        "'speaker_12': 'So to be clear, there's there's no study going on right now.'",
        "'speaker_8': 'However.'",
        "'speaker_12': 'The the study would be done likely by an expert in the field.'",
        "'speaker_8': 'Who would look to.'",
        "'speaker_12': 'Other similarly situated airports bring in. Information regarding Customs and Border Protection and what the requirements there would be. So.'",
        "'speaker_10': 'So there would be outgoing. We would consult with those agencies to figure out.'",
        "'speaker_12': 'Absolutely.'",
        "'speaker_10': 'And that consultation, that process, does that cost money?'",
        "'speaker_12': 'Ordering the study would cost money.'",
        "'speaker_10': 'As had it been appropriate. Is there a budget for this?'",
        "'speaker_5': 'We would work within the airport.'",
        "'speaker_4': 'Parameters with their enterprise fund to do that.'",
        "'speaker_5': 'Yes.'",
        "'speaker_10': 'I would I would just say and I don't have any motions or any substitutes or any friendlies, I would just say this, I'm not in any rush to jump into this discussion. I'd like to have an understanding of like what's out there.'",
        "'speaker_10': 'If that means city staff do their internal due diligence without necessarily particularly expressing to customs or someone else that we're interested. I think I'd like to say I have the facts. I think what my colleague is is asked for in terms of allow the council to be full.'",
        "'speaker_10': 'I'm not sure if that would have happened any way before we had it, but I think it's a fair question to ask. I you know, I agree. I wouldn't want this type of discussion take place if I wasn't on the city council or someone with the ninth District wasn't in it.'",
        "'speaker_10': 'But I would say that I don't necessarily agree that the rest of the council would necessarily put on a medical marijuana in district or wasn't someone to sit in there. But that's just my own personal opinion. But but.'",
        "'speaker_10': 'But here's what I would say. Like. I want to get out of the signs and the jargon and the politics and see the facts. So if you do what, no matter what happens tonight, I want to see. I would want to see, like the facts from city staff, whatever analysis internally.'",
        "'speaker_10': 'I don't want you to communicate out to other agencies. I wouldn't want you to express that we're interested, but have the facts. So when the fourth district is seated, we're not having another conversation because so far this is us.'",
        "'speaker_10': 'We had a study session, we couldn't talk about this issue and now we're having a second council item tonight where there's no facts on the issue. When it comes back again, when the fourth District is seated, I don't want to be in a place where there's no facts.'",
        "'speaker_10': 'So I guess my question is, is there a clear line, a distinct line between conducting a full study that engages customs and expresses our interest and a study that we can do internally to tell us the bottom line facts about the thing, the issues that folks care about.'",
        "'speaker_10': 'But that's my question.'",
        "'speaker_5': 'Councilman, if I could answer that, first off, I want to make it clear that any study that we did would not go to Customs and express an interest in this. This would just be a fact finding study when the council reviews it, it would not come with a recommendation.'",
        "'speaker_5': 'It would not say do this, or it could easily disappear in 30 days.'",
        "'speaker_4': 'If we find out it was financially feasible, then we would just stop and inform the council that we can't do this.'",
        "'speaker_5': 'But if it was financially feasible, we would continue it. But it would come to the council without a recommendation. It would merely say this is feasible. Does the city council want to take the next step? And the next step would then be to express an interest in this.'",
        "'speaker_5': 'We would not be expressing an interest through the study. The study would be fact finding. I also want to point out that what you're asking for, for staff to do an internal fact finding thing, we would not be able to do that.'",
        "'speaker_5': 'We couldn't meet your needs and that that's why we would have to go to an outside expert so we.'",
        "'speaker_4': 'Would not be.'",
        "'speaker_5': 'Able to to meet your needs in producing some type of an internal report that we can get to you.'",
        "'speaker_4': 'Without going to an outside consultant and taking the four or five months.'",
        "'speaker_10': 'I understand. So if this. So what would happen if this motion moves forward? Then after the fourth District councilperson was seated, then you would come back to City Council for permission to go out and do a study. Or you would wait until the 190 day or 120 days?'",
        "'speaker_5': 'We would we would wait to what the motion says, and I'll look to the city attorney. But if the motion says 60 days after the council member is seated, the study begins, we would keep this on a shelf.'",
        "'speaker_5': 'And in 60 days after the councilman receded, we would begin the study. If we got that direction, if the council said, if the motion said, come back to us in 60 days to see if we want to do it, we would do that.'",
        "'speaker_5': 'So it depends on what the motion reads from the city council. But again, at that 60 day point that the five month trigger would start, it would not start now. It would start 60 days after the member was seated.'",
        "'speaker_10': 'I get it. So really the question is, do you start your study now or do you start your study? Do you start your study essentially now based on direction or do you start the study three months after the fourth?'",
        "'speaker_10': 'This person is seated. Two months. Forgive me that that's the question. I mean, that's essentially the options that the council has today. That's a question.'",
        "'speaker_5': 'That's for the council to decide. We will respond to whatever, I guess.'",
        "'speaker_0': 'I think I think they're a quick point of information.'",
        "'speaker_11': 'And it was a report of information, as I mentioned in my opening comments. First of all, this this this agenda item request that that no action delay any action regarding the request until receiving further direction from the city council and and originally stated 90 days after a city council member from the fourth District received it.'",
        "'speaker_11': 'And I also want to raise the point that there was the airport did undergo a feasibility study. And there are facts laid out in that feasibility study for this council to consider it in point before that as well.'",
        "'speaker_0': 'Can we go back to the speakers list? What I'm going to do is I have a lot of people queuing up from before, so I'm gonna go to Mr. Andrews and then going go to this to the public, and then we'll go back to the council unless there's any objection from those are queued up.'",
        "'speaker_0': 'Okay. Unless you want to go for the public is up to you.'",
        "'speaker_2': 'Oh, no, that would be too late.'",
        "'speaker_0': 'I go first.'",
        "'speaker_2': 'Okay. Go now.'",
        "'speaker_0': 'Mr. Andrews?'",
        "'speaker_2': 'Yes, by all means, yes. I also. I and you know, Councilman Austin, I really, truly understand, you know, your concerns and your compassion. You know, about this item. But I mean, we all have responsibilities to our constituents. You know, I believe that we need to begin the process of gathering information because the city has never been harmed'",
        "'speaker_2': 'by having too much information. You know, it's information that we need. And I've heard a lot of speculation, but no facts. And I would like to hear what the city manager, the city attorney airport and JetBlue has to say.'",
        "'speaker_2': 'Even though getting this report would probably get back to this probably after 90 days, 90 days, but I'm willing to go along, you know, starting the process after 60. You know, that's a friendly amendment. Thank you.'",
        "'speaker_0': 'Okay. Now we're going to go over to the public and we're going to go back to the council. So, again, 3 minutes, please, everyone, just come forward. If you come forward, if you can just begin to line up at the podium and just make sure you give your name and address and we'll go from please come forward'",
        "'speaker_0': '. How are you doing?'",
        "'speaker_5': 'Good. My name is Greg HERWICK at 2024. I am in the fourth District. I am not represented. I was very happy to hear about Pat O'Donnell's letter showing up. Thank you so much for being happy about it. We're happy about it because we are not represented.'",
        "'speaker_5': 'Pat was really tight within our community and pretty much everybody knew him as with or without the airport issue personally and for the people that live in my community. We don't need an international airport. LAX is not that far.'",
        "'speaker_5': 'Orange County is not that far. It's ridiculous that we would want to have bigger flights, noisier flights come into our community. It doesn't make any sense. Has anybody in the city council I know there's some new people here.'",
        "'speaker_5': 'Is anybody heard of the Triangle of Death? That's what Long Beach has basically been represented as this. More flights, more noise, more pollution coming through the middle of the Triangle of Death. That's basically how Long Beach is looked at.'",
        "'speaker_5': 'They long they line up from the pyramid, come over public schools. It's not about necessarily the noise or the number of flights. It's about the pollution. It's about how it affects our kids. The noise bucket, in my personal opinion, is a joke.'",
        "'speaker_5': 'If you live in the flight path or if you live on the take off or, you know, we're more on the landing side, it's it's it's a joke to the, you know, to the people in the community, the 7 p.m. to 10 p.m. flights.'",
        "'speaker_5': 'That's a joke as well. They they break that all the time. We had flights taken off at five, six, 7 a.m. on a regular basis. There is nothing that controls this airport. And all you're going to do is make it bigger and get it more out of control for the people that live in the flight paths.'",
        "'speaker_5': 'That's it. I appreciate you putting on the snow day and picking up that slack from Pat O'Donnell and you guys coming out. But we need to be.'",
        "'speaker_4': 'Represented and before anything goes on, we.'",
        "'speaker_5': 'Need to be represented.'",
        "'speaker_0': 'Thank you. Next week, a police.'",
        "'speaker_5': 'Good evening, Honorable Mayor Council members. My name is John Deeds. I reside at 3600 Pacific Avenue. I have lived there for going on 45 years. But for the first 27 years of my life, I had a Naples home address.'",
        "'speaker_5': 'And just want to inject a little historic fact here. The last time that a recall effort qualified to go to a ballot. Was directed at my father, the third district councilperson and Tom Clark. And it was over there supporting.'",
        "'speaker_5': 'Jet service at Long Beach Airport. And with that, I will ask that you support Councilman Austin's motion. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Good evening. My name is Josephine Long.'",
        "'speaker_12': 'I've been a homeowner in the seventh District for about 25 years, and I opposed the international flight from the JetBlue Airlines.'",
        "'speaker_7': 'I love JetBlue. And as I look, I try to travel to them as much as possible.'",
        "'speaker_12': 'But as far as the international flights, I think they would only, as they previously said.'",
        "'speaker_7': 'More noise, more deaths, more traffic.'",
        "'speaker_12': 'More everything. That's not good for Long Beach. In L.A.X. is less than 30 minutes away. And so there's no problem going to there or any of the other airports that have the international flights. But I think the homeowners that live in in Long Beach, as I said, they don't agree with the fact that they do fly earlier'",
        "'speaker_12': 'and later. They note it and it's an inconvenience for the homeowners there. So I ask you to take it into consideration and please do not allow them to have the international flights. Thank you.'",
        "'speaker_0': 'Thank you so much. And because the city attorney will consistently remind me and remind us, I just want as a reminder, the item before us is on the argument about the motion on the floor, which is to postpone any action until after the fourth District person is seated.'",
        "'speaker_0': 'So we want to make sure that we're keeping the the comments to that action. Thank you, sir.'",
        "'speaker_4': 'John Dilatory addresses on file. Honorable Mayor, City Council. Thank you for the opportunity to speak. Everyone says, including everybody up there, that they will support and defend the Long Beach Noise Ordinance. The fact is, Long Beach has never successfully defended our airport noise ordinances.'",
        "'speaker_4': 'Our first ordinance adopted by the City Council in 1981 allowed a maximum of 15 daily flights. In 1983, 14, airlines challenged our ordinance in court. That federal district court determined that there were there was insufficient basis to support the 15 and up to to 18 1986.'",
        "'speaker_4': 'The City of Long Beach adopted an ordinance to limit the number of commercial carriers to 32. 1989, the ninth District Court invalidated the 1986 ordinance and ordered an increase to 41 per day that we have today. In 2000, two American Airlines challenged our slot distribution and alluded to their assault on our noise ordinance.'",
        "'speaker_4': 'If an agreement had not been reached with JetBlue to relinquish four slots to American, the paperwork was ready to file against the city. Mary Garcia City Manager. Patrick West. This direction to postpone any further discussion on allowing JetBlue a Customs facility should also apply to you and your staff.'",
        "'speaker_4': 'City management, no doubt under the guidance of Mayor Foster and now you. Garcia has moved this project forward behind closed doors since 2013. There are if you actually take a look, there are studies looking at this that says this is not really that feasible financially for us.'",
        "'speaker_4': 'That was done in 2013. Working in the dark without any public participation. And transparency is not why you were elected to serve as mayor. Please wait for the fourth District Council person to be elected. Then let's have an open discussion to see if it's even worth pursuing an international airport.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Dennis Dunne, a staff update. I beg your indulgence for 10 seconds. I was presented with this document with what I was required to get. However, this is not enough. The map with the districts, the phone numbers should be enlarged and put in the library.'",
        "'speaker_9': 'It put it in the lobby, not on a table.'",
        "'speaker_0': 'Forgotten it. Thank you, Mr. Dunn. Next speaker, please.'",
        "'speaker_2': 'David Lewis, 840 West, 28/7 District. Last week, I was at a friend's house down in Orange County. Disney fireworks went off. I was startled. Didn't know what.'",
        "'speaker_5': 'It was at first. He said It's.'",
        "'speaker_2': 'Disney comes with the territory. Sunday night I was in my backyard yard. The smell of the, I guess, gas coming from the refineries over the way was nauseating. I've lived in Long.'",
        "'speaker_5': 'Beach for 20 years. In Wrigley.'",
        "'speaker_2': 'For 15. Comes with the territory. We had boats backed up in the air and in the waters here.'",
        "'speaker_5': 'Years ago there was talk about the US.'",
        "'speaker_2': 'Comes with the territory. I recognize what Long Beach is. It's a trade place with the ports. Not only does.'",
        "'speaker_5': 'Our local community, our federal community, but the world.'",
        "'speaker_2': 'Economy depends upon movement of goods and services out of Long Beach. I almost have a fatal. Attitude about living in Long Beach. And I don't think it's fair. I don't think.'",
        "'speaker_5': 'That Long Beach residents should go through the health risks that we go through. But I recognize.'",
        "'speaker_2': 'That it comes with the territory. We're not going to be able to slow down. The commerce at the ports comes with the territory. Now there there. You know, JetBlue wants to have an international airport at the Long Beach Airport.'",
        "'speaker_2': 'And we all know what that means. We all know where that's going to what that's going to mean. It's going to mean more revenue for JetBlue, more revenue for Long Beach. But at what price? There comes a time when we have to put not our health, but our children's health first before revenue.'",
        "'speaker_2': 'I know that it's kind of hard to stop the wheels of. Money. But that's what this is all about. JetBlue city of Long Beach making money. But at what price?'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_2': 'My name is Mario Cruz. I reside at 2315 Charlemagne in the fourth District, and I rise in support of Mr. Gurung. Mr. Austin motion to delay this vote. I appreciate his comments. As a resident of the fourth District, I have a voice and the residents of the fourth District have a voice, and that voice needs to be'",
        "'speaker_2': 'heard. I'm all for process, but there's also accountability. And with all due respect, none of you answer to my vote because I do not have a representative on this council. So notwithstanding your good remarks, you do not answer to me.'",
        "'speaker_2': 'Because I have not voted. And I want to vote. As far as time, it's not just the matter. Of bringing the council up to speed. There's the community consider. The community has to be about speed. You can't put a time limit on that.'",
        "'speaker_2': 'And certainly 60 days is not enough, in my opinion. So I would. Good asked. Asked Mr. Ralston in agreeing to reject the friendly amendment when he as much time as we can get to consider this very important issue for the residents of the Fourth District.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Yes. Good evening. Ron soc, formerly of the airport commission from 2000 to 2008. I don't know where to begin. Maybe just a few facts there. I've heard statements tonight that international flights mean more flights, mean noisier flights jeopardize the noise ordinance.'",
        "'speaker_2': 'The sooner that we can get to the point of studying this and showing that it will be, it's apparent that JetBlue is not asking for more flights right now. They're flying 20 to 25 flights out of their 32.'",
        "'speaker_2': 'They need to fill those gaps to make it more economically viable for them and for the city. And so they're simply asking for international flights, which are just the same number of planes, same number of gates. No increase.'",
        "'speaker_2': 'No increase in noise. And so some of these facts, some of these claims have to be dealt with because there is a serious misunderstanding in the community. And the other point that I want to make is that one of the things when I headed the commission that we stressed was that the members, as the council members, represent'",
        "'speaker_2': 'all the citizens of the city, not just their own constituents, as Stacy Mongeau pointed out. She actually those were thoughts that I had. And I can't see your timing, somebody sitting in front of it there. Okay. So JetBlue has been a proud partner to this city and they've done a lot for the city and they've not done'",
        "'speaker_2': 'damage to the city. And they are simply asking to have flights that will go to Mexico possibly, and it will not enlarge anything at the airport. I would just ask Councilman Austin and your anger to consider some kind of compression of the time period or if there's a way the staff can be given working on the studies'",
        "'speaker_2': 'even before the April election. That would be a great help. And also, I'm not quite sure city manager were the three year period. What's that's comprised of. And perhaps at some point you could explain why it's going to take three years.'",
        "'speaker_0': 'Thank you, sir. Time time's all up. Thank you. Okay. Thank you so much. Next speaker.'",
        "'speaker_2': 'Good evening, honorable mayor and members of the Council, Kurt Gaston, president of the Long Beach Airport Association. Thank you for taking the time tonight to discuss and receive our all of our comments on both sides.'",
        "'speaker_5': 'Of this issue. On the motion before you on behalf of the Board of the directors of the Long Beach Airport Association.'",
        "'speaker_10': 'And the airport business.'",
        "'speaker_5': 'Community.'",
        "'speaker_10': 'We again are here to confirm our unanimous support of the city's airport noise ordinance. We support your effort.'",
        "'speaker_2': 'To conduct the required due diligence on the.'",
        "'speaker_10': 'Facts that we believe support.'",
        "'speaker_5': 'Permitting.'",
        "'speaker_2': 'Permit international operations at the airport consistent with the provisions provided by the ordinance and slot allocation process. We appreciate the due diligence you need to receive in order to properly.'",
        "'speaker_5': 'Vet out and improve international flights. However, we ask you tonight not to unreasonably delay the process that will provide you those facts.'",
        "'speaker_10': 'But instead provide a 60 day window.'",
        "'speaker_2': 'Of time that will both permit the fourth District Council seat to be filled while providing staff the opportunity to finalize or prepare the required due diligence as a roadmap for you to consider all the specific and relevant details and facts.'",
        "'speaker_2': 'During this time, the candidates for the fourth District can participate and will be.'",
        "'speaker_5': 'Able to review the relevant facts and attend any community briefings.'",
        "'speaker_10': 'So that at the end of the 60 day.'",
        "'speaker_5': 'Period, the formal application.'",
        "'speaker_10': 'Can be submitted to this.'",
        "'speaker_5': 'Council for their review and action. Please do.'",
        "'speaker_2': 'Not consider further restricting use as an operational activities at the airport.'",
        "'speaker_10': 'That would.'",
        "'speaker_5': 'Be permitted under that noise ordinance.'",
        "'speaker_10': 'So that noise levels would be artificially kept below.'",
        "'speaker_2': 'That which is permitted. And any.'",
        "'speaker_10': 'International flight operations will only use existing.'",
        "'speaker_2': 'Slots, gates.'",
        "'speaker_5': 'Parking positions and no new passenger holding rooms. The arrival and destination.'",
        "'speaker_2': 'Locations for.'",
        "'speaker_10': 'Aircraft that will bring.'",
        "'speaker_2': 'Commerce, jobs and economic opportunity into the city in no way restrict or eliminate your opportunity or obligation as well as ours to manage and mitigate airport noise by enforcing without any fear what has and should be and continue to be a healthy, well defended policy.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'My name is Jane Naito. I'm a resident of the eighth District and have been since 1998. Mayor and City Council Members. You were all elected by the residents of Long Beach to represent their concerns and needs. Currently, the fourth District has no representation.'",
        "'speaker_8': 'In fairness to them, I strongly urge you to withhold any discussion or review of JetBlue's request for a Customs facility until after a fourth District Council person is in place. I know a plane flying from Mexico to Dallas makes no difference in the noise ordinance.'",
        "'speaker_8': 'I know that JetBlue is currently not using all the slots allotted to them, so the noise level is reasonably quiet. I know that the minimum 41 commercial flights are signed and that only six of the 25 commuter flights slots are now being utilized.'",
        "'speaker_8': 'What I don't know is if adding a customs facility to the Long Beach airport will invite the FAA and other airlines to challenge our current operation. I was part of the neighborhood group that challenged the city and business entities relating in 1923 against quadrupling the size of the airport to satisfy JetBlue.'",
        "'speaker_8': 'Thanks to our efforts, we have a beautiful airport that everybody loves. In addition to waiting until we have a fourth District Council member, I urge you to instruct city staff not to have any more closed door meetings with JetBlue.'",
        "'speaker_8': 'Some discussions have already occurred, and this is why it's raised the level of concern in the neighborhoods. We would love the opportunity to work with city staff and the Council on projects that impact us instead of finding out later what has been decided.'",
        "'speaker_8': 'Please consider the concerns and needs of the neighborhoods and the residents that voted you in office before the concerns and desires of JetBlue. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mayor Garcia and members of the council. My name is Rob Mitchell and I'm manager of government and airport affairs for JetBlue Airways, which is based here in Long Beach at the airport. Two weeks ago, my colleague Rob Land, our senior vice president for government affairs, stood before you and expressed JetBlue's continued and longstanding support for'",
        "'speaker_4': 'the sanctity of the noise ordinance that governs operations at the airport. The request JetBlue submitted recently was a direct ask of the city to begin a process of fact finding due diligence and discussion. With the letter we submitted, JetBlue is not asking for nor expecting the imminent arrival of international flights at the airport next week.'",
        "'speaker_4': 'Similarly, with the request we submitted, we were not expecting the study of a reasonable, modest addition to the capabilities of the airport to be postponed for 90 days after the next councilperson from the fourth District is seated. Something that would take us to the end of summer before any work could begin, let alone a decision be made'",
        "'speaker_4': 'at acquisition of a customs facility at the airport will take staff work by the city. The motion before the council tonight prohibits staff from doing exactly what they are tasked to do all of the homework and due diligence in order to bring it back to council.'",
        "'speaker_4': 'For a policy decision later, staff needs to have to begin to have these discussions with engineers, architects and the operations team. How it is financed needs to be investigated. And then after all that, the Council must submit a request to and receive approval from the Department of Homeland Security's Customs and Border Protection before a lengthy construction project'",
        "'speaker_4': 'could commence. If this Council wishes to delay a request made by a solid corporate citizen and a request only to begin a process for as much as 4 to 6 months without any justification, then it certainly shouldn't. It should should not stand in the way of the enormous research, due diligence and fact finding the city needs to'",
        "'speaker_4': 'undertake. JetBlue strongly supports that any delay this council votes on tonight explicitly avoid delaying the start of this critical investigatory work. The airport manager has a request from the majority tenant at the airport and undertaking the work I have described in no way rushes this process, nor does it force this council to act one way or another'",
        "'speaker_4': '. If the city truly wants to be an international city, a progressive city, and a pro-jobs city, it must at least explore all the opportunities to do so. Long Beach has has has long been and will continue to be an airport with tight restrictions and a flight ordinance that enforces tight restrictions on flights.'",
        "'speaker_4': 'And we believe the airport is simply being utilized far less than these limitations currently announced allow. I urge the Council not to support the unnecessary delay and allow staff to begin the much needed work right away and shorten the minimum timeframe for which it can be allowed to come back to the council.'",
        "'speaker_4': 'Thank you very much. Mr. Mayor. Council members. My name's Joe Miller. I'm the chair of the Los Altos Center, adjacent neighborhoods in the fourth District. And I can't tell you how many hours I've spent in this chamber dealing with airport issues over the years.'",
        "'speaker_4': 'Long time before most of you have been here. And I can tell you that this is a very important issue for the fourth District, the fourth District residents. This is the thing that unites them as a community is their concern over the airport.'",
        "'speaker_4': 'And it's something that our councilman and now Assemblyman Patrick O'Donnell understood. In fact, that's one of the reasons he was elected, is because our former councilperson did not understand that. And that's one reason he was elected. And for him to reach out to you from Sacramento on this issue is very, very important.'",
        "'speaker_4': 'And no one understands the fourth District right now more than Councilman and now Assemblyman O'Donnell. And the fact that he's reached out to you is very important. And I can tell you from my neighborhood, this is very, very important to our neighborhood.'",
        "'speaker_4': 'And as the JetBlue person said, we want to be a progressive city. We also want to be a Democratic city. And we really don't have a voice here. And as other people have said, we really don't have anyone who is accountable to us.'",
        "'speaker_4': 'You know, Patrick would pick up the telephone, call us, talk to the neighborhood leaders, just as I'm sure many of you do to your own neighborhood leaders. None of you have my phone number. None of you can reach out to the neighborhood leaders in the fourth District, and we really need that.'",
        "'speaker_4': 'The other thing that Patrick did when the airport size was being debated, he worked with the other council people to come up with that. We don't have someone to work with you right now. We don't have a voice to to tell you our concerns.'",
        "'speaker_4': 'We know that you talk to each other and you meet with each other. You you do that. We need someone on behind the dais doing that for all of us in the fourth District. And believe me, it is very, very important to all of us in the fourth District.'",
        "'speaker_4': 'That's why I'm here tonight, to ask you to please support Councilman Austin and councilman during this motion. And thank you both for bringing it forward.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Mayor and City Council. My name is Richard Ivey. I live at 242 East Bixby Road. I'm president of the Las Vegas Neighborhood Association. I love our city. I love Long Beach. When I was a student at Cal State, Long Beach, the professor would have to stop class twice an hour to wait for the planes to go over'",
        "'speaker_2': '. I thank you, Mr. Austin, as and Mr. Durango, both representing our neighborhood in both the seventh and eighth districts. For your stance here tonight and how important this is. This is something that our noise ordinance is extremely fragile.'",
        "'speaker_2': 'And the impact that this could have if. Planes decide to come in here because it's convenient and it opens up an opportunity to mess with the noise ordinance, which I don't think the citizens of Long Beach fully understand how big a decision this is.'",
        "'speaker_2': 'If you mess with that noise ordinance, you could be looking at 100 to 130 flights a day. And I don't think the citizens of Long Beach.'",
        "'speaker_5': 'Are aware of how serious this issue is.'",
        "'speaker_2': 'And I would just ask that you not mess with it.'",
        "'speaker_0': 'Thank you. Next week, the police.'",
        "'speaker_12': 'Good evening.'",
        "'speaker_8': 'My name is Bill Goodell Outdoor. I reside in the eighth district, four, four, six five Cerritos Avenue. And I'm here to support Councilmember your ongoing Austin's motion or agenda item. Thank you for bringing it forward. I wanted to address a couple of things, specifically that Councilwoman Manga Mongo said earlier.'",
        "'speaker_8': 'You said that you're used to yourself as representing the whole city. I accept that. And you also said you represent the businesses and since the airport is in your business, then this district, that means JetBlue is your constituent.'",
        "'speaker_8': 'Correct? Okay. So basically, you you represent JetBlue among all of you guys. That would be your constituent. So I understand that seems logic to me. Well, they don't get to vote no. Maybe not with their voices, but with something else.'",
        "'speaker_12': 'Anyway, I didn't want no, I didn't want I didn't want this.'",
        "'speaker_8': 'I didn't want that. This reality. Sorry.'",
        "'speaker_0': 'Guys. Let's just try to. Yeah.'",
        "'speaker_12': 'Yeah. Okay. But anyway, I think it's reasonable to for you to suggest let's let's just keep the process going. Let's start the process. You said it's a three year process or.'",
        "'speaker_8': 'The three year plan. You forget that it's already been going on since over two years. City manager has said that there has been private discussions with city council members. Some of you, maybe not.'",
        "'speaker_12': 'All of you, but there has been discussion.'",
        "'speaker_8': 'The process has been going on for over two years and maybe just another five months, and it's going to be completed. And for this to continue without the representation of the fourth District is just not responsible at all.'",
        "'speaker_8': 'You're suggesting that what? Just finished a process? We need all the facts. We'll get the facts in five months. We'll have the new councilmember here and we'll bring her or him up to speed. I would suggest that it's going to require a lot more than bringing her or him up to speed.'",
        "'speaker_8': 'You need to think of this person needing to be in the process. If the people of the fourth district really are going to be represented, their representative needs to be in the process from the beginning as much as possible to the end, not just be brought up to speed.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'Good evening, Mr. Mayor and council members, Darryl Supernova, resident of the fourth District. Thank you for bringing this motion forward. Councilmembers Austin and Ranga after the study session on the 17th. I saw the mayor in the next day and I compliment him on his handling of one of the questions.'",
        "'speaker_5': 'And I said, You know what? I really like the way you reacted. You got out in front of it. You owned it. You addressed the fact that the city had made a mistake and talked to the city manager.'",
        "'speaker_5': 'You referenced him and said it was a personal.'",
        "'speaker_2': 'Issue and we took care of it. So first, I'd like to compliment.'",
        "'speaker_5': 'You, Councilmember, for getting out in front of this issue, owning it and putting it in front of the people. Also to I'll just react to a couple of things that were said. Council Member Mungo, thank you for taking up the slack.'",
        "'speaker_5': 'And to your staff, we are out a snow day. But again, she does not have a vote.'",
        "'speaker_4': 'So that's the issue here. Finally, there was a previous.'",
        "'speaker_5': 'Speaker said there's some type of question about the three year time frame. I just referenced our previous airport director said there was a three year frame. Our current airport director says.'",
        "'speaker_4': 'There's a three year time frame. These are the.'",
        "'speaker_2': 'Experts. And in today's Language.'",
        "'speaker_5': 'Business Journal, I think there's.'",
        "'speaker_2': 'An online edition. Now, Dave Willunga has.'",
        "'speaker_10': 'An article that.'",
        "'speaker_4': 'Has that same quote. So I just want to clear clarify that point.'",
        "'speaker_0': 'Thank you very much. Thank you. Next speaker, please.'",
        "'speaker_2': 'I am Dr. Marshall Zamsky, 3917 Linden Avenue. And I wanted to definitely support Al Austin and Roberta Yar'adua's motion. I think it's very important. My concern is that we elected you guys. And to be on the council to represent us and yet the world.'",
        "'speaker_2': 'The wheels have been turning for an awful long time and it seems to me that the foundations of our country are based on democracy, and yet our city council doesn't seem to have almost any input into the process.'",
        "'speaker_2': 'So my feeling is that to support this this motion and to say that the city council should be involved at every point and be able to veto anything just because one big corporation wants some wants to muscle their way around here.'",
        "'speaker_2': 'It shouldn't be. It shouldn't be allowed. And that isn't what we elected our representatives, our city councilors to do. So anyway, that's. I just wanted to say that. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker.'",
        "'speaker_5': 'Yes. Joe Sopel. You have my address on file, Mr. Mayor. City Council members. Alan Roberto, thank you very much for bringing this forward. It's been said in here that we're going to give time for the candidate, whoever is elected, to be brought up to speed.'",
        "'speaker_5': 'But the truth.'",
        "'speaker_2': 'Is, none of you are up to speed.'",
        "'speaker_5': 'You know, we fought this a decade or so ago. And coincidentally, the same people who were saying build it, build a build it are the same people here who have stood in front of you tonight and two weeks ago and said, Oh, yeah, we need international flights.'",
        "'speaker_5': 'It's a good idea. What's a good idea for JetBlue? If I was, JetBlue would be the thing I would be doing international flights. In fact, JetBlue has been working behind your backs. It's been going on for at least the last year.'",
        "'speaker_5': 'They've been talking to city staff. They've been talking to other council members who want to listen to them. But really, it's been behind staff. Why is this such a good idea? We've got LAX, we've got John Wayne. What we have is one hell of a great municipal airport.'",
        "'speaker_5': 'We fought for it. We didn't want it to be industry standards. We want it to be what it is. That was the key word. Industry standards quadruple the size. A previous airport advisor president stood up in front of you a little while ago and said, it's not expansion.'",
        "'speaker_2': 'It's not going to get any bigger. The truth is, it will get bigger.'",
        "'speaker_5': 'There is more square footage going to be added. They've got to build a terminal for international flights. They can't do it out of what we have. That's just not going to happen. We can't afford it. Our our airport is perfect.'",
        "'speaker_5': 'It's a perfect.'",
        "'speaker_2': 'Relationship. Don't screw.'",
        "'speaker_5': 'With it. Leave it alone. We've got something good. Tackle the big, big issues like the marijuana issue or downtown. We've got plenty of issues to tackle. You know, there's quite a few people in here holding signs right now.'",
        "'speaker_5': 'Back in the old days, we used to fill every seat with a sign. And people were really upset and they had a lot of energy. And that's what's going to happen again if you proceed on this. Now, we're just talking about a little study.'",
        "'speaker_5': 'It's referred to as the the camel getting its nose under the tent. That's what we're talking about. I'm a salesman. I know when you're not going a door and you want to get in there, what you do is put your toe in there, you put your knee in there, get your butt in there, and then you're into'",
        "'speaker_5': 'that door. Don't let JetBlue do that. They can wait because whatever decisions you do make is going to last for a very, very long time. Don't be rushed. Thank you.'",
        "'speaker_0': 'Thank you, Joe. Next speaker, please.'",
        "'speaker_2': 'Larry, would you click as the address? I do not live in the fourth district, but let me say this. I've been very impressed with the counsel position from the ninth District. And when our good councilman Price becomes mayor, maybe in eight years or with luck, maybe even sooner.'",
        "'speaker_2': 'All right. Depending upon how fast in the Ninth Circuit Court moves. All right. Consider moving into the third district with very sharp mind. I like your approach. I see. This is one. If this project goes through regardless of its merits.'",
        "'speaker_2': 'It'll obviously as the last speaker been mentioned, it's going to be there for ages. All right. So the barn on this issue is a barn. It clearly is not on fire. Absolutely. So take the time to review it thoroughly.'",
        "'speaker_2': 'In respect to Councilperson Mungo's. Volunteering to vote for that district, giving her background. The people need to feel they are represented 100%. And as one who lives in a third district, I would take great umbrage of somebody coming in from another area that had not studied as well and is very familiar with anything related to Alameda Play'",
        "'speaker_2': 'or the Marine Stadium. That's not to say that your work is not appreciated. But the fact is, these people deserve to have someone there that is their official representative. Who they can hold responsible. For whatever vote, whichever way that person votes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Larry. Next speaker, please.'",
        "'speaker_8': 'Cecelia Leach.'",
        "'speaker_6': 'Seventh District 3645 Myrtle Avenue. Thank you, Mr. Mayor, and all the council members for listening to all of our comments. I want to thank council members Austin and Ranga for putting this motion.'",
        "'speaker_8': 'Forward, which I strongly support as well.'",
        "'speaker_6': 'It seems to me that one option that hasn't yet been discussed is the option of not moving forward at all.'",
        "'speaker_8': 'And while.'",
        "'speaker_12': 'There while.'",
        "'speaker_6': 'Some may oppose, some may support that option, so far, the JetBlue representatives appear to be saying that this would simply delay the process and assume that.'",
        "'speaker_8': 'The entire process would go forward.'",
        "'speaker_6': 'I think that that is not, as other speakers have mentioned, a democratic process. And we need to have all options on the table and we need to have all of the city council members here.'",
        "'speaker_8': 'To discuss those options. I also.'",
        "'speaker_6': 'Just want to register some surprise at Councilmember Mango's assertion that supporting this would be pandering to.'",
        "'speaker_8': 'Those of us.'",
        "'speaker_6': 'Who are citizens with signs in the audience of which I am one, which seems to be.'",
        "'speaker_1': 'Contradictory.'",
        "'speaker_8': 'To her.'",
        "'speaker_6': 'Statement that she represents the entire city. Thank you. Yes.'",
        "'speaker_0': 'If you like. Speaker, please.'",
        "'speaker_12': 'Hello. Good evening. Hello. Hi, Mayor. It's been a while. Mayor Garcia? Yes. And council members first. You know, I had something very nice and calm to read to you, but I have to make a comment on some of the discussion that was going on earlier when Claudia and Mr. West said that there was no study going on'",
        "'speaker_12': 'right now. That's a key word right now. There were actually two studies done. One was presented to the council, and I'm not sure what happened to the other one. For Askar and Associates presented in November of 2013 and the Megadeal Economic Study made comments that wouldn't support any further economic development of the city.'",
        "'speaker_12': 'Both of them stated minimal economic impact. Mr. West I'm going to say that you should have asked the Council if they were interested in moving forward with this in 2013. They have been operating behind the scenes, doing studies, meeting with Homeland Security, taking it, doing term sheets and and lots of communication going in this direction while the'",
        "'speaker_12': 'neighborhoods have been sitting back there not understanding what was coming forward. So with that, that's that's my rant. And now I would like to say the nice things that I have to say, and that is to acknowledge that every district in our city deserves a leader that can advocate on their behalf, especially when such serious commitments are'",
        "'speaker_12': 'being considered. That's good leadership, and it's also the right thing to do. Imagine if the First District had not had representation over Pier J. The Green Port Policy, the Middle Harbor or other mega influencing projects from the Port of Long Beach that have daily impacts on Long Beach residents.'",
        "'speaker_12': 'If the Second District was not represented in discussions on our downtown plan, Civic Center ideas or the Entertainment District Studies, if the third district leadership was vacant without direction on the wetlands development, the second and PCH controversial plans, the Belmont Plaza Pool or the Naples seawalls, the fifth District.'",
        "'speaker_12': 'As homogenous as it appears, houses one of the most controversial aspects of our city, our airport, just as the port and the downtown belongs to everyone, regardless of their home district. So does the airport, which lies in the center of some of our most successful neighborhoods.'",
        "'speaker_12': 'The the fifth has been faced with challenges with the transfer of McDonnell Douglas to Boeing, the massive reductions of Boeing, and then, of course, the direction of the Boeing development would take what it would take to best benefit and protect Long Beach and its citizens, the sixth District.'",
        "'speaker_12': 'It's a challenged community that bears the scars of poverty and the reputation of being outcast. Without a dedicated community person to lead, would they have found the solution to the loss of the Kroc Center at Shattuck Field or seen positive development within and around Cambodia town, the seventh District?'",
        "'speaker_12': 'In many ways a tale of two cities without a leader to champion the 710 expansion plan or the up and coming skate project. What would those neighborhoods be confronted with today?'",
        "'speaker_5': 'Ray I.'",
        "'speaker_0': 'Got a.'",
        "'speaker_12': 'Are you going to make me stop before I get to the district?'",
        "'speaker_0': 'It's not you know, I can I know I have to follow I have to follow the.'",
        "'speaker_12': 'Rules, actually. You know, the rules do allow you to to give me 30 seconds.'",
        "'speaker_8': 'Right.'",
        "'speaker_12': 'But I'll tell you what, I don't have to go.'",
        "'speaker_0': 'What I'm going to do is as a as a as a deference. You are a former member of this body. I will let you finish, but I'd want the public to know that generally if it wasn't because you're in a formal council, it's very difficult to continue.'",
        "'speaker_0': 'So please continue.'",
        "'speaker_12': 'I appreciate that, Mayor. Our eighth district representatives have always been required to educate and lead our city when it comes to issues related to our Long Beach airport. Imagine if there had not been an ED toddler, Jeff Kellogg on board to provide direction.'",
        "'speaker_12': 'Thank you, Al. And thank you, Roberto, for taking the lead on this. And then finally, the ninth District, much like the sixth uptown, has felt isolated and ignored for many, many years without the leadership and vision of Jerry Schultz, Val Lurch, Steve Neal and now Rex Richardson.'",
        "'speaker_12': 'What would the conditions be up there today? Together. The nine districts make up our vibrant, diverse city of Long Beach. What happens to one district will eventually in some way impact the others, creating ample time for the next fourth district councilperson to settle in.'",
        "'speaker_12': 'Allows time for each one of you to better understand the history of our airport.'",
        "'speaker_2': 'Where I got.'",
        "'speaker_5': 'To.'",
        "'speaker_12': 'It gives you time. It gives you time to consider the pros and cons and the benefits and the risks. Thank you very much.'",
        "'speaker_0': 'Thank you very. Next speaker.'",
        "'speaker_2': 'Hello. My name is Richard Lindemann.'",
        "'speaker_5': 'I'm running for the fourth District Council seat.'",
        "'speaker_2': 'My address is 1605 Ohio Avenue. And I want to thank Alison.'",
        "'speaker_5': 'And Roberto Urunga for bringing forth this measure.'",
        "'speaker_2': 'And I think.'",
        "'speaker_5': 'Either 90 days or 60 days is probably a good thing. And I'll give part of my.'",
        "'speaker_2': 'Time to her so.'",
        "'speaker_5': 'It'll it'll work out okay. But I really appreciate it. And I think I truly think that we need to have a voice on the on the council. So I hope that you do pass this.'",
        "'speaker_2': 'And safety measure for us. Thank you.'",
        "'speaker_0': 'Thank you for your work. And I if there's anyone else wants to speak, I'm going to close the speakers list with you. If you're not up to the podium, please. No. Okay. I'm going to close I'm going to close the speakers list.'",
        "'speaker_0': 'You're our last speaker. Please begin. Hi. My name is Robert Casado.'",
        "'speaker_5': 'I live on a 2235 Miramar Avenue. I'm in the fifth District. Thank you for increasing the wattage on our lights on our street. We really appreciate that. I don't have any stats or any numbers here to show you or.'",
        "'speaker_2': 'To give you.'",
        "'speaker_10': 'What I do have is a love for aircraft.'",
        "'speaker_5': 'I grew up in La mirada, close to Fort and airport, always listening to private planes fly over. There was always air shows. I lived in Torrance for a while, close to Zamperini airfield, which was wonderful because there's always small aircraft flying Long Beach.'",
        "'speaker_5': 'I love Long Beach more than anything right now because it has a wonderful airport for short flights. For me, it's perfect.'",
        "'speaker_0': 'Sitting on my couch watching.'",
        "'speaker_4': 'TV, I can.'",
        "'speaker_5': 'Watch C-17s take off. I can watch F-18s go 500 miles an hour, pass the tower. I can watch.'",
        "'speaker_10': 'B-17s.'",
        "'speaker_5': 'B-29, super fortresses and any vintage aircraft fly over my house, you know, a few times a year. So my love for the aircraft, I turn into a schoolboy when I hear the radial engines of the Catalina airboats flying over just because it sounds different now, nobody does.'",
        "'speaker_0': 'That for 747 or 737.'",
        "'speaker_10': 'Or anything like that, because every jet engine like that of.'",
        "'speaker_5': 'That size sounds the same to me. My love for Long Beach is huge. I don't ever want to leave it. I love it so much. I love my fit district. I do a lot, but I honestly don't have.'",
        "'speaker_0': 'Any numbers or anything here that's substantial.'",
        "'speaker_5': 'Except for a love of the aircraft. If you add more aircraft, more large aircraft, you're taking away the airspace from our pilots who have private planes, small helicopters, and you're taking it away from our World War Two veterans who sometimes come to Long Beach in those World War Two aircraft they fought.'",
        "'speaker_5': 'And so by taking up that space, you're taking away the love that I have for everything that is Long Beach and JetBlue. You just lost a customer.'",
        "'speaker_0': 'Oh, okay. Thank you, sir. That that concludes our speakers list and certainly, I think everybody for giving their comments. So we're going to go back to the city council and just so that we get a reminder of where we're at.'",
        "'speaker_0': 'City Attorney There is a motion on the floor just as a reminder from Mr. Austin and Mr. Rangel, which is at present. Is that correct, sir?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_4': 'Mayor. The motion on the floor, as I currently understand it, is and I'm not sure if the friendly amendment was accepted, but it would be to delay. Further action for the direction of City Council and direct city manager to delay any request for direction regarding a customs facility until either 90 days or 60 days after full representation'",
        "'speaker_4': '. So this would require the city manager to put an item on the agenda after 60 days. The Councilmember for the fourth district is in their seat for 60 days.'",
        "'speaker_0': 'Okay. So that so I'm not I don't care who made that friendly to Councilman Pryce did. So I want to be sure we know where we're at before we continue the speaker's list here. So, Mr. Austin. Mr. Austin, are you accepting that friendly 90.'",
        "'speaker_11': 'You know what? I want to wait to hear from the rest of the council on this. Okay. We accept the friendly women.'",
        "'speaker_0': 'Okay. So then the motion on the floor is as presented just for the record then. So I have speakers list councilman mongo.'",
        "'speaker_12': 'So let's start out on a positive note. I want to promote that this weekend we are having a fly in the Ford event at the airport and I hope that each of you will take an opportunity to revisit and appreciate the airport as it is today.'",
        "'speaker_12': 'Even if the vote did not pass tonight, that means that this would still be. Delayed at least through the study process through at least August. I want to make a couple of quick comments. Once elected. Knowing the importance of this item, I quickly met with the advocates and adversaries of the airport, including the Honorable.'",
        "'speaker_12': 'Where did she go? Where did she go? There she is. And Joe Suppo. And since then I have met with Joe, who, while I do not have his phone number, we do email occasionally and. I want to say that I do listen to public comment, and I really appreciate the comment from Mario Cruz, because while I do'",
        "'speaker_12': 'feel that every vote I take is a big part of this city's future, I always have such a positive attitude. I never considered the fact that the fourth District couldn't recall me. But it is true, and I appreciate that component.'",
        "'speaker_12': 'And that being said. I also want to support the person who said that the fee for landing after hours is not enough. I constantly hear planes land after that hour. Every time a plane lands after that hour, I get a call from my mother, of which I remind her to call the noise hotline so that the airline'",
        "'speaker_12': 'has to pay a fee to the library. But I cannot increase that fee without causing potential risk to the noise ordinance. And so that is why we keep the status quo in regard to that component. If it were my choice, it would be five to 10 to $15000 per violation as it escalated with multiple.'",
        "'speaker_12': 'Issues. So let me let me offer a. A friendly amendment. I would like to have the study back and then I want 60 days because I want to use that 60 days to go into my community and have community meetings.'",
        "'speaker_12': 'And so having 60 days before nothing happens, which makes no sense because right now the city manager said he's not coming back until August. And so. That is significantly more time than is necessary for our colleagues to get up to speed.'",
        "'speaker_12': 'So what I would like to do is I would like the study to begin immediately and then I would like the two from four to the council so that and I would like it published publicly on the three website.'",
        "'speaker_12': 'So then I can email my mailing list, schedule one or two community meetings to hear how the communities which many of my community neighborhoods also fall in this district. And so then that would give me the time to go out and do the legwork.'",
        "'speaker_12': 'Because one of the things that really. Frustrated me about other items that come before this council is that they are given they give us ten days and ten days is not even enough time to get a community group together to discuss these kinds of matters.'",
        "'speaker_12': 'And so I think it's actually about the same amount of time that you are asking for, but in backwards order. Oh, no, no, no.'",
        "'speaker_0': 'Okay, I'm not. Hey, guys. I want to make sure that behind the dinosaur real quick. So just so I'm clear, Councilman Mango is asking for a friendly amendment to Councilman Austin. Councilor Brosnan.'",
        "'speaker_11': 'So Councilmember Mongeau, I do appreciate the the brainpower that you put toward this and the willingness to to kind of meet in the middle. But I don't see that as a friendly amendment. And I will tell you why, because the the intent here is to get a fourth District Council member seated and then have that person as'",
        "'speaker_11': 'part of the process. In terms of whatever study there is there, there are going to be points and issues that that that we deliberate as a city council to give direction to the city manager on. And so that is the intent of the the the motion here.'",
        "'speaker_12': 'I guess. Oh, don't clap yet. I guess the challenge for me on that is when the city management and the staff who we pay a great deal of money to and trust for, if we don't like what they do, we then have the opportunity to then remove that city manager.'",
        "'speaker_12': 'But I do put a lot of trust in them and the work that they do and they do gain direction. So I'm going to make a substitute motion that we begin the study and then the motion comes before council 60 days after that, so that I have time to go and reach into the communities and hear their'",
        "'speaker_12': 'feedback. Because while it's great to have a bunch of people come to council, I hear time and time again from the East Side that it is difficult for our parents and our soccer moms and all of the rest of them to make it down to City Hall on a Tuesday night at 5:00.'",
        "'speaker_12': 'And so I want to have those meetings in my community.'",
        "'speaker_0': 'Okay. Hey, guys. I want to make sure that we're we have a process that's respectful to it's hard to hear when there's people chatting. So I want to make sure that we're the council is able to deliberate fairly, but I want to make sure that I understand the substitute motion as I'm not sure.'",
        "'speaker_0': 'So the substitute motion was to begin the process of gathering the research now. And then the fourth district member sat and then six days after that, what exactly what happens?'",
        "'speaker_12': 'So I would like it to come as a two from four memo to the City Council posted on the website so that the community can deliberate for 60 days and discuss the ideas that are presented and or then make direction to the city manager to do additional studies.'",
        "'speaker_12': 'Because what I don't want is a bunch of meetings with no data. I don't think we can afford a customs terminal. I don't know where people think we're going to get ten, 20, $30 million. I don't know why there's a point of even discussing it if we don't know the facts behind it.'",
        "'speaker_12': 'So I would like the facts gathered. That's why.'",
        "'speaker_0': 'Okay. So there's. So just for the record, there's a substitute motion. And is there a second on the substitute? Yes, there's a second on the substitute. Vice Mayor Lowenthal. And now we're going to move on to the speaker's list, which we have.'",
        "'speaker_0': 'So we'll continue that. And ladies and gentlemen, I want to make sure that we got we are we want you to be respectful. The council was respectful when everyone spoke. I want to make sure that we're all respectful to this deliberation process.'",
        "'speaker_0': 'This is we go through this on every issue that is big. And it's very important to obviously all of you. But please give the council the respect that they so they can deliberate. I also want you all to hear the comments.'",
        "'speaker_0': 'So thank you, Councilwoman Pryce.'",
        "'speaker_6': 'Thank you, Mr. Mayor. I. Want to reiterate that I support Councilmember Austin on this and I understand the intent behind it. One of my residents, Mr. Salt, spoke, and I respect him and I have incredible respect for him.'",
        "'speaker_6': 'But I wanted to talk a little bit about a few things that he said, because he is one of my residents and he's someone who has a great deal of experience with this. This is going to be a long term process.'",
        "'speaker_6': 'And I just think that there is no harm in waiting for our full body to be here as we start this process together. And I appreciate some of the comments that folks have made about, you know, you don't know the history.'",
        "'speaker_6': 'That's true. That's true. Certainly people with much more extensive experience and history of the airport could have run for office, but they're not here. So the reality is that, you know, we took the as glamorous as it may seem, the process of jumping out there and trying to serve our communities.'",
        "'speaker_6': 'And we are trying to educate ourselves and understand the history. And I'm meeting with anybody who wants to meet with me on this issue. I've been meeting with everybody. And and I'm going to continue to do that. But I want to make it very clear that there is nobody sitting up here that knows the third district the'",
        "'speaker_6': 'way I know the third district. There is nobody up here that cares about the third district the way I care about the third district. I wake up every morning, every day. I represent the entire city, but I know my district in and out and I know what those people need.'",
        "'speaker_6': 'And I'm going to always fight for them. I represent the entire city, but I think just because of the introduction that I've received of the fourth District, specifically their businesses in regards to the medical marijuana issue, that they currently feel a void in representation because they had a very strong advocate for a long time and they no'",
        "'speaker_6': 'longer have that person. And I think that is a very valid point. And I told Council member Austin from day one when we started talking about this, that I would support him on this. The reason I offered the friendly of 60 is to try to reach some middle ground so that we could be somewhat united as a'",
        "'speaker_6': 'council. I mean, that would be my hope because I'm going to tell you right now that and I appreciate the mayor clarifying that the issue before us tonight is when we're going to start this process. It's not the viability of an international terminal.'",
        "'speaker_6': 'I mean, it's not whether we like JetBlue or not. I fly JetBlue with my family. I think they've been incredible business partners. I don't think that's the issue tonight. I think the issue is when do we start this process?'",
        "'speaker_6': 'I, for one, am completely open to exploring the idea. I'm not against this idea. I'm open to exploring it and studying it. It's just a matter of when do we start that process? That is the limit of the discussion tonight.'",
        "'speaker_6': 'And we're talking about a three year process. I don't think 60 days or 90 days, I don't think is is any amount of time in the big scheme of things. I will say that one of the reasons I recommended 60 Days was because I feel that the authors of this item didn't feel that strongly about the 90'",
        "'speaker_6': 'days to begin with, that they were open to considering a different timeline. It's not that they were steadfast on the 90 days, and so it was really is a point of compromise to try to get us all together.'",
        "'speaker_6': 'But you know what? We don't all have to be together. We don't all have to be united. That's okay. It's nice if we proceed that way, but that doesn't always work out. So that's my recommendation. I will be supporting Councilman Austin, and I would hope that he would consider the friendly amendment even if it doesn't result in'",
        "'speaker_6': 'consensus. I would hope that he would. I think 60 days is going to be enough time for our new council colleague to engage and meaningfully take this on. That's just my opinion.'",
        "'speaker_0': 'Thank you, Councilwoman. Next up is Vice Mayor Lowenthal.'",
        "'speaker_8': 'Okay. And so right now we have the substitute. Is that right? Councilmember Price. I think the comments that you had made, were you asking about a friendly to Councilmember Mango's motion?'",
        "'speaker_6': 'I are checking for clarification right now, but I had made a friendly and. Councilman Austin had said he would like to wait until he hears from his colleagues to decide whether he'd accept.'",
        "'speaker_11': 'Just a point of order. I don't believe I can accept that friendly right now. But should it come back and the motion before us fell on that friendly, we could definitely have a favorable conversation about a friendly amendment.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_8': 'Thank you. Thank you for that clarification. I want to thank Councilwoman Price for her comments. I agree with you. I'm not in favor of not seeking information. I do want to know and have this issue vetted. I think it needs to be vetted.'",
        "'speaker_8': 'But I also respect and value the opinions that you come to this council with tonight. While you might not be representative of the entire fourth District or fifth District or the entire city, you've taken the time to come out here.'",
        "'speaker_8': 'And and what I can hear is that you would like more time for this deliberation. I agree with that. At the same time, I also have never been in favor of stopping our insatiable quest for information, for knowledge.'",
        "'speaker_8': 'And I think that's part of why we're here as well. We're not here because we know all the answers or we have all the data I count on. And I think each council member counts on our staff and whomever the staff hires with council direction on the information that they bring back, there's just no way this is'",
        "'speaker_8': 'a part time council. And so I would be troubled if we actually put a halt to acquiring the knowledge. And so I'm not fearful of that. I'm not fearful of what the outcome might be. I actually like to more no more than less.'",
        "'speaker_8': 'And so, Councilmember Austin, given that this is something that you're working on, you feel very passionate about, each of us feels very passionately about it as well. I mean, none of us has a monopoly on any particular issue, but.'",
        "'speaker_8': 'Would you be open to? Councilmember Mango's motion, if I can recall it correctly, is to continue work. And have I believe she said have the two for from come back in 90 days would you be open to. No.'",
        "'speaker_8': 'Can you repeat that.'",
        "'speaker_12': 'The two four from would still take I think the city manager said five months. So that would be August and then that would give us time, 60 days, August and September to meet with our community. My fear is if we move this into the Christmas time, turnout from the community plummets.'",
        "'speaker_12': 'And so I was hoping to have really good, nourishing dialog with my constituents with facts in my hand. I don't want to have meetings that have no facts. And so I was just looking for data. And then 60 days, it actually comes out to the same or more time than our asked for, which is why I'm so'",
        "'speaker_12': 'confused of why the crowd didn't like it, because it it just makes no sense to me.'",
        "'speaker_8': 'I'm confused, I think probably because I was perhaps my being confused wasn't unique. Okay, now I understand that does sound like the right the same amount of time as Councilmember Austin had asked for. And so if we can focus on one key aspect that you raised, Councilmember Austin, which I think others have raised and concur with, is'",
        "'speaker_8': 'the seating of the Fourth District Council member. I believe it's very important. It's critical. And so if we can benchmark. Whatever motion it is to first that person being seated. But also make sure the staff doesn't stop its work.'",
        "'speaker_8': 'I'm what I don't want us to communicate is that we are afraid of continuing research and work. When the point of decision comes back, that council member will be here to provide direction, to provide input, to deliberate with the rest of us.'",
        "'speaker_8': 'We are not taking action. And so my question is, would you be open to a motion that whether it's council member Mungo's or your own, a motion that would ensure that the fourth District Council person is seated? Staff is able to continue its work that we are not putting a gag order on their due diligence, which is'",
        "'speaker_8': 'really in all of our best interest at least to have that knowledge. You don't have to act on the knowledge. I don't either. And then to determine a time frame when the item comes back after the person is seated, whether that's 60 days, 90 days, sometime before Christmas, I hope, because I agree.'",
        "'speaker_8': 'I think Thanksgiving to Christmas is an unfortunate time for policy items, but not for anything else. So would you consider that?'",
        "'speaker_11': 'The long and short answer is no because. Because the point, the spirit and intent of the agenda item was to halt any work that has been done up to this point. You know, I think it's important for the city council to have input in on the direction on how we move forward.'",
        "'speaker_11': 'We just got a letter last week from Jet Blue, right. Asking us to move forward again. They are asking us to move forward. Not compelling us, not pushing us. There's nothing in their letter that says we have to move forward at all.'",
        "'speaker_11': 'Be quite honest with you. So. So I like Councilmember Pryce and many other council members. I'm open to hearing the case, but I don't think we should be committing any more staff resources because we've already committed quite a bit up to this point without council direction.'",
        "'speaker_11': 'We need to make sure that there is clear council direction on how we move forward and proceed forward. And a fourth district representative needs to be seated. For us to do that.'",
        "'speaker_8': 'Okay. I know.'",
        "'speaker_0': 'They surprise me a little.'",
        "'speaker_8': 'So thank you, Councilmember Austin. I think that's. I'm I'm glad I asked the question and I have that clarification from you. For the most part, I agree with you. I mean, I'm not in agreement over staff stopping work.'",
        "'speaker_8': 'So if I can ask, Mr. West, what is this work that just I know you've said it a couple of times, but please reiterate it for me. What is this work that you're doing?'",
        "'speaker_5': 'I think it's clear that back in 2013, JetBlue approached our current airport director, Mario Rodriguez, and there were discussions. There were two memos that were sent to the city council regarding those discussions. At that time, there was a lot of things happening in the city where the Civic Center going.'",
        "'speaker_5': 'We had a lot of stuff going on at Tidelands. So I directed Mr. Rodriguez just to stop and let's wait until we cleared our plate a little bit to go forward. A few months later, Mr. Rodriguez left us for another position, and then we made the decision.'",
        "'speaker_5': 'I made the decision informing the council that we weren't going to take this up until Mr. Francis was seated. So Mr. Francis is seated. So this brings us to where we're at today. So at this stage, what we would do with the council direction would go hire an expert firm in the customs arena, and they would work'",
        "'speaker_5': 'with us to provide us the metrics where we could come to the city council and let you know whether this is something that can possibly be done financially. Can it be done administratively? Can it be done operatively? Can it be done geographically?'",
        "'speaker_5': 'Where would you put it and how would it operate and all that? Again, this would not carry any recommendation whatsoever. If we found out early on that it doesn't make financial sense. If it doesn't make financial sense, we wouldn't go forward with it.'",
        "'speaker_5': 'But after a five month period with this consultant looking at industry standards for airports and look at airports of our size throughout America that have done this kind of stuff, then in five months, we'd given that study to the city council.'",
        "'speaker_5': 'Then the city council would discuss that study and what to do with it.'",
        "'speaker_8': 'Okay. Thank you. So I would like to make a substitute. Substitute motion. And that motion would be to start the process or continue the process, as Mr. West has indicated, and come back in 90 days after the council district.'",
        "'speaker_8': 'I'm sorry, after the member of the council. It's a little late night after the fourth District Council member is seated. It's not.'",
        "'speaker_0': 'Okay. So, guys, ladies. Gentlemen, I can't continue that. Please. I just want to make sure we're being respectful. That's a different motion than the original motion. So I just want to make sure that we're being respectful. The difference and the key difference of that motion and the original motion.'",
        "'speaker_0': 'Correct me if I'm wrong, Mr. City Attorney, is that Mr. Austin's original motion would come back for an affirmative vote of the council before automatically moving forward. Is that is that correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_4': 'The original motion asked for direction from the council prior to beginning the study is described.'",
        "'speaker_0': 'So that's that's a very different motion. So I just want to make sure that that we're very clear. Okay. So we have now a a substitute substitute. Is there a second on the substitute substitute? Okay. There is a second.'",
        "'speaker_0': 'Can you.'",
        "'speaker_10': 'Okay, so let me just get clarity. You got how many? How much time is this?'",
        "'speaker_8': '90 days after the person is seated in the fourth district.'",
        "'speaker_10': 'So the way I see this before.'",
        "'speaker_0': 'I mean. Well, hold on, Councilman. You're next on the Q.'",
        "'speaker_10': 'So, no, I don't I'm not I have questions about her motion.'",
        "'speaker_0': 'You can you can go into it because you're next on the Q.'",
        "'speaker_10': 'So I'm tracking this. So it looks like Councilman Austin's motion says, okay, folks, get seat in two months in the fourth District. Correct. And 30 days after the election, they'll get seated. Right? They'll get seated. They won't get seated the day they're elected.'",
        "'speaker_10': 'It's when they get seat. Two months from now, they get seated. Then three months it would come back to the council after after 90 days per your motion, it will come back to the council. So that puts us at five months.'",
        "'speaker_10': 'Okay. Or friendly 60. And then it and then it says five months later, there will be. That's how long it takes for the study to be concluded. The correct city manager. Five months.'",
        "'speaker_5': 'The study would take approximately five months.'",
        "'speaker_10': 'So five months. My calculation that puts us January 2016 is ten months from now. That puts us in January. Councilmember Vice Mayor, where does your so yours has us in 30 days. Know it? How many days after the election?'",
        "'speaker_8': '90.'",
        "'speaker_10': 'So 90 days after the two months it takes for the person.'",
        "'speaker_8': 'Not after the election. After they're seated.'",
        "'speaker_10': 'So after they're seated. Correct. They'll be seated in May. So that puts us at five months from now. So five months from now, that puts us in one August. So the question between the two motions are when the city council gets a vote on it.'",
        "'speaker_10': 'August or December.'",
        "'speaker_0': 'And the key difference between the two, I think, is it's also when staff would actually begin the data collection piece and so on. On Councilman Austin's motion, the data collection would not begin until sometime a few a couple of months after the council person is seated.'",
        "'speaker_0': 'But for that data collection to begin, it would first require a affirmative vote of the city council. The difference with Vice Mayor Lowenthal is motion is the motion. Would the process for the city manager would begin now, which, according to the city manager would take approximately five months.'",
        "'speaker_0': 'And so that the that the couple of months after the person is seated would fall around five months. And so it would be around the the August time period. So that's I think that's the difference.'",
        "'speaker_10': 'Here's here's the challenge that I want to I want to get to a place. I'm hoping that we can get to a place. And I understand you have a motion. And because I have the floor, I could second it.'",
        "'speaker_10': 'But I want to see if things are still malleable. Here's here's what I'd like to see. There's the difference between the two or is a difference of five months. And I need to have an understanding, like right now, the way I see this is very the council's very divided.'",
        "'speaker_10': 'I'd like to see if there's some middle ground and see if there's a place, if Councilmember Alston, like what do you really want to get out of this? Do you want to get this? January 2016 is where you want to take up this issue.'",
        "'speaker_10': 'Is that what you're trying to get to or in council vice chair more so I see this timeline is the same timeline that the that the city manager put forth. If he were to start today, it would take five months.'",
        "'speaker_10': 'So five months from today would be essentially the same timeline. So we've got a five month gap and I don't want to be in a place where we're being divisive. Let's meet in the middle. That's my that's what I'm offering to be meet in the middle.'",
        "'speaker_10': 'One person is saying January, another person is saying August, meet in the middle. Is that possible? There's no substitute substitute right now. You have a substitute. You can change it to meet in the middle. If I hear from Councilmember.'",
        "'speaker_0': 'Actually, just to clarify, let me clarify. I have the.'",
        "'speaker_10': 'Floor.'",
        "'speaker_0': 'There. No, let me clarify that. Is this a substitute substitute motion? There was a substitute motion by Councilwoman Mongeau.'",
        "'speaker_10': 'I understand we're talking about the substitute.'",
        "'speaker_0': 'Which has a sup which has a second.'",
        "'speaker_10': 'It has a second.'",
        "'speaker_0': 'It does have a second.'",
        "'speaker_8': 'It does. But I'm still listening, though. I am still listening, thinking I'm sorry I don't have.'",
        "'speaker_10': 'The I want to get to a place where honestly there's going to be a discussion about the international airport and we will have to take an up and down vote on it. And what we're talking about right now is whether we have when we take that vote between August and January and honestly, the ninth District, I said'",
        "'speaker_10': 'it earlier, we're not in the flight path. I want to be neighborly. I think there were some good concerns today about the fourth District not being seated. I would hate for those things to happen. I feel that everybody on the council here feels the same way.'",
        "'speaker_10': 'So what I'm trying to get to is I want to debunk and get past all the high energy here and get to a compromise. Can you guys meet in the middle?'",
        "'speaker_8': 'Mr. Mayor, may I just give a quick response to that?'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_8': 'So what is really important for me is to not stop our learning process and to not stop acquisition of information. That's that's important to me. I'm troubled by our direction that we stop staff from doing their work or the work that I trust them to do.'",
        "'speaker_8': 'I have many items on my policy plate that I'm not ready to take a position on today, but my staff is still vetting it. They're not waiting until I'm ready to take a vote and things take years. And so that's my most important aspect to this motion, is not to stop staff work.'",
        "'speaker_8': 'I think that's irresponsible.'",
        "'speaker_10': 'I understand. So what I'm trying to hope I'm just driving a conversation that hopes hopefully gets to a meeting in the middle and if there's any, that's what I want to get to. If if I'm I hope that we can have that conversation here and then I'm not forced to be in a place where I have to'",
        "'speaker_10': 'pick between the airport and the community. I think we can be reasonable and we can get to this point. And and you guys all control the motion. I can take no action right now, which is what I would have done, but I can't take any action.'",
        "'speaker_10': 'So this is ultimately up to all of you, and I hope that you get there.'",
        "'speaker_0': 'Okay. Thank you. I may turn this back to the next speaker, which is Councilmember Austin.'",
        "'speaker_11': 'Yes. Thank you. And and as I predicted, this would get caught up in the friendlies the most and substitutes and substitute substitutes. And this is normal par for the course for this council. I appreciate the everybody trying to get somewhere.'",
        "'speaker_11': 'I want to be very clear. I work for the city of Long Beach. I represent the residents of Long Beach, not Jet Blue. And I'm not compelled to to move their agenda tonight without a sport district representative seated.'",
        "'speaker_11': 'This is about process. And what the the current motion fails to do is fails to give the city, the fourth district representative, a voice at the table. The item that I brought forth would. Halt the process. It would wait until there's an election.'",
        "'speaker_11': 'But it would also bring this item back before the city council and allow the city council to be part of the discussion in terms of process moving forward. We would give direction there. The way this is now is allow staff to just do what they do, you know, and have their own process without our input.'",
        "'speaker_11': 'And I think that's wrong. So I would really ask this this council to step up and understand that that moving forward would be irresponsible and, in my opinion, undemocratic if we were to to vote on it in favor of the substitute substitute motion or the substitute motion.'",
        "'speaker_11': 'I want to get back to the original motion and the intent of what we came here to do tonight night. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. I have so I have I have two more speakers. And then we're going to go back to the motions, which of which there are three on the floor. And I will repeat those and make clear clarify those before we move forward.'",
        "'speaker_0': 'Next up, I have Councilwoman Mango.'",
        "'speaker_12': 'Thank you. Councilmember Richardson, my motion is in the middle. And let me tell you why. My motion gives us information by which we can vet with our community to come back to the council in November, which is between August and January.'",
        "'speaker_12': 'And at that time, we can give direction for additional information or not. But what I don't want is for us to come back in 90 days to give direction to the city manager with no more information than we have tonight.'",
        "'speaker_12': 'And that's that's where I'm stuck again. I'm not here to advocate for one side or the other. What I'm here to advocate for is information and a place in the middle. And so. If if that met what Councilmember Richardson was thinking and hopefully meets what everyone else is thinking, then maybe we'll vote down the substitute.'",
        "'speaker_12': 'Substitute and get to the substitute. Just a thought.'",
        "'speaker_0': 'Okay. And the final speaker we have council. Council member. You're Ranga. And then we're going to go to the substitutes motions and go down the go down there. So consider your anger.'",
        "'speaker_5': 'Okay, so now I'm all confused. No, I'm only kidding. Basically, what it comes down to is not. Whether we continue forward or hold it for longer or cut it shorter or initiate a process or not. What it's all about and what our original motion was or is, because it's still there on the table.'",
        "'speaker_5': 'Is to wait until a fourth district representative is seated. At that point, we start the process of informing staff or giving staff direction about how we want to study conducted. It's a council driven process as opposed to a staff driven, driven process.'",
        "'speaker_5': 'We provide we provide guidance and direction to staff as to what we want to see in this study. That's why we wanted to have to wait for a election to take place with a person to get seated, to get acclimated, and then once that happens, start giving direction to staff.'",
        "'speaker_5': 'What we want to see in the study, whether it's what's the effects going to be on the noise ordinance, what the effect is going to be in the flight, on the number of flights, all of that. Because that fourth district representative is going to have to have all that information in order to make a responsible, sound, informed'",
        "'speaker_5': 'decision. And if we and if we say that, okay, we do it now. Start the process now. That's a staff driven process. That's not what we're after. What we're after is a council driven process. And that's where we have to take control here behind these, not over there, with all due respect to my colleagues.'",
        "'speaker_5': 'So that's where I want to go back to my origin. Our original motion is to wait for the 90 days. If it's 60, fine, but 90 days after the person is seated so that that individual can become part of the process and helping to direct staff how we want the study conducted.'",
        "'speaker_0': 'Thank you. And I. I have one. I think I have one final person cued up. And then, Councilor Richardson, did you queue up again?'",
        "'speaker_10': 'So. That's right. I'm the guy who didn't want to talk about this. So. So. So I'm just I'm. I won't. I hoped that we got to a place that it was like a meeting in the middle, because at the end of the day, like, the council is going to have to vote on this how to vote on'",
        "'speaker_10': 'this airport, the motion that's on the floor. It doesn't take me where I want to go. I'm not going to be supporting that motion. And and I think so. I'm not going to be supporting that. And I appreciate Councilmember Mungo's suggestions.'",
        "'speaker_10': 'I would be open to considering that if, you know, I, I want to get to that point where we can talk about it, because it seems like there's been like maybe one or two people talking compromise, maybe three people in the council talking compromise.'",
        "'speaker_10': 'And we need to at least I think there's there's some entrenched sides here. And I think we need to get to the folks in the middle to make this motion. So that's where I want to be. So I won't be supporting the motion on the floor.'",
        "'speaker_0': 'Okay. Now I'm going back to I have I have summary low and thought of cued up. There you go.'",
        "'speaker_8': 'So if I hear you correctly, Rex, I think you're right. There are several of us here and probably all of us that would like to work toward a compromise. This isn't something that should be. Bare minimum votes. And so I'm willing to withdraw my motion and I will be supporting Councilmember Mango's substitute motion.'",
        "'speaker_8': 'Can I do that, miss?'",
        "'speaker_2': 'Yes.'",
        "'speaker_8': 'We're just. We're.'",
        "'speaker_0': 'Madam Clerk. We're going to go ahead and withdraw the. The substitute. Substitute? And now we have a substitute motion on the floor, which is the manga motion. Okay. Correct. Okay. I'm going to restate it for you forward. Vice President, are you out?'",
        "'speaker_0': 'Do you have anything additional?'",
        "'speaker_8': 'No. So it doesn't have names next to the substitute, do they? Thank you.'",
        "'speaker_0': 'Mongo and Lowenthal. Okay. Thank you. Now, I'm going to go before I move on to Councilman Price, who's next cued up. We are on the substitute motion and I'm going to have Mr. Sinatra. Do you want to repeat the motion for the council?'",
        "'speaker_4': 'MAYOR Members of the council. The substitute motion, I believe, made by Council District five and second by Council District two was to direct the city manager to begin the study immediately. And that process would take approximately five months at the conclusion of the study.'",
        "'speaker_4': 'The study would then be provided to the Council in a memo form to be published on the city website and then would be brought back to the council 60 days after it's published.'",
        "'speaker_0': 'Okay. That's the substitute motion on the floor. I do have a short speakers list. I'm going to get through that. Councilman Price.'",
        "'speaker_6': 'I guess the trouble I'm having is.'",
        "'speaker_2': 'What.'",
        "'speaker_6': 'Are we foreclosed from doing? Outreach with our communities if we wait 60 days or 90 days? I mean, I guess that's what I don't understand. So for me, I feel like the staff is going to be doing their work.'",
        "'speaker_6': 'And unless I've missed something, it's not like they're going to be reporting back to us regularly such that we have this updated information. I think they're saying it's going to take them about five months to do their study and their their research and what they have to do.'",
        "'speaker_6': 'So I don't know that we would have actual, tangible information any way to do outreach with the community. So for me, you know, I would like to do outreach with the community as well. I just you know, in the big scheme of things, I just don't think we're talking about that much time.'",
        "'speaker_6': 'And I've communicated this to people that are proponents of moving this forward is that I don't know that this is the battle that's worth the fight right now, because all we're asking for is a little bit of time to allow the fourth district representative to be involved in the process.'",
        "'speaker_6': 'Let's say, for example, that staff starts this process and there is a legitimate concern or idea. I mean, sometimes my council colleagues have great ideas that I didn't think about. They're brilliant in many ways. And so and sometimes they highlight things that I would have never thought about.'",
        "'speaker_6': 'Let's say our new councilperson has an idea or thought of something they'd like the staff to explore or look into that they know is going to affect them. Or of course, they'll have the opportunity to do that after the study is done.'",
        "'speaker_6': 'But to me, it makes sense for them to be involved in the process like we are. We're all involved in the process together. And so I don't think we're foreclosed from doing outreach and doing that meaningful community outreach when we if if we wait.'",
        "'speaker_6': 'That's that's all I'm saying. I might be missing something here. I just I guess what I'm and perhaps it's because I don't know the history. To me, it seems like this is not an unreasonable request for for a delay.'",
        "'speaker_6': 'I just it seems reasonable to me under the circumstances. So with that.'",
        "'speaker_0': 'Thank you, Councilwoman Price, Councilmember Austin.'",
        "'speaker_8': 'Starting the work.'",
        "'speaker_11': 'Again. I'd just like to first of all, thank all of the people who have endured and stay with this all night here. Obviously, this is an important issue and the council is giving it the the time it deserves and the thought it deserves moving forward.'",
        "'speaker_11': 'I'm going to go back to the original intent here. And again, I think council member Urunga summed it up best. This is a we're trying to accomplish a council driven agenda here on on anything moving forward with the customs facility at Long Beach Airport.'",
        "'speaker_11': 'Again, the staff has been working on this issue for close to two years. There has been feasibility studies that I see you shaking your head. Council, I mean, City Manager West. Can you tell us how much has been currently committed in terms of resources to to to this to this to this effort?'",
        "'speaker_5': 'I can't tell you entirely, because the resources committed.'",
        "'speaker_4': 'Were back in October and November of.'",
        "'speaker_5': '2013, as I mentioned, because we had so much on our plate after we brought the memos to the city council's attention regarding the work that Mr. Rodriguez was doing with Jet Blue. I personally made the decision because our workload was so tight to just stop this until we until we had some time to put some time into'",
        "'speaker_5': 'it, get to the city council. At that time, Mario then decided to leave. I pointed Reggie Harrison with the same direction to not engage JetBlue, not to process this. So I can affirmatively tell the city council with, with all due respect, that no work on this has been done since November 13.'",
        "'speaker_11': 'Okay. Well, that's what we're showing. And thank you for that clarification. There was a feasibility study done. There was a consultant hired to do that feasibility study. That feasibility study is available as public record as I believe. And so to to satisfy somebody's insatiable quest for knowledge that our council and council colleagues may have.'",
        "'speaker_11': 'There is some information out there and there has been work done. Again, we are trying to get to a point where this is a council driven situation where we can eliminate all of the the the the the conspiracies out there.'",
        "'speaker_11': 'We can do this in a transparent way. The process will be clear. And so, therefore, I'd like to offer a substitute substantive motion to incorporate the original motion, but ensure that. That after 60 days the city council can provide is is in a position where after 60 days the city council can provide city manager direction on how'",
        "'speaker_11': 'to proceed forward with the request for international customs facility.'",
        "'speaker_0': 'Okay. Mr. City, attorney.'",
        "'speaker_4': 'Mayor and members of the council that I don't see any distinction between your original motion, which requires the city manager. Well, let me.'",
        "'speaker_11': 'Clarify let me clarify that. Let me clarify myself. The two steps to motion will ask for 67 days as opposed to 60.'",
        "'speaker_4': 'That that wouldn't be a substantial change in order to make it. Well.'",
        "'speaker_11': 'The original motion was 90 days. So I think the substitute substitute motion incorporates the friendly and we'll days to 60 days.'",
        "'speaker_4': 'The question on the floor would have been, had you already accepted the friendly amendment and you had he mentioned a couple of times he.'",
        "'speaker_0': 'Has not accept the fact. No.'",
        "'speaker_6': 'Can I be heard on that?'",
        "'speaker_0': 'Real quick. Just real quick. So I'm sure there's a back over to the person who has the floor. But that fully amendment was not accepted by the councilmember yet. Councilmember Austin, Susie Price had a point of view. Do you have a point of order?'",
        "'speaker_6': 'Well, I do, actually. When I originally made the friendly councilman, Austin accepted the friendly at that time. And as he did, he talked about how when he and Councilman Councilmember Urunga were discussing this agenda item, they talked about the 90 days, but that they weren't completely I'm in court all day long so I can transcribe things like'",
        "'speaker_6': 'it's nobody's business. He talked about how they they have they talked about the 90 days. They weren't tied to the 90 days. They thought that that was overly ambitious and that 60 days seemed reasonable. In my opinion, that was an acceptance of the friendly when then we did some confusing things.'",
        "'speaker_6': 'But when it came back to him, he said, I want to hear from the rest of the council. By that point, he had already accepted the amendment.'",
        "'speaker_0': 'Well, just Mr. City Attorney. I was under the impression that he did not accept the friendly amendment.'",
        "'speaker_11': 'But we can roll the tape.'",
        "'speaker_4': 'I don't think we need to roll the tape, but I think that I wasn't clear on whether it was accepted. I respect Councilwoman Price's position, but I think it was he wanted to hear it.'",
        "'speaker_11': 'I wanted to hear additional comments before I accepted their friendly stance.'",
        "'speaker_4': 'So that so the difference, as I understand the substitute substitute motion now incorporates the friendly it requests the further direction from the City Council, which was already in your original motion and changes it from 90 days to 60 days.'",
        "'speaker_0': 'And the subsequent change, in my view, is that 90 to 60 days of the motion.'",
        "'speaker_4': 'So that's correct.'",
        "'speaker_0': 'Okay. We're going to go through the motions. There is a substitute substitute motion that is essentially Councilmember Austin's main motion with the change from 90 to 60. Okay. Then we have a substitute substitute motion, which is the mongeau motion, which begins a process today or at this time, but then waits until 60 days after to come back'",
        "'speaker_0': 'to it, to come back to council for more direction. And then there's the main motion, which is the motion that we have before us, which is back to 90 days. All right. Those are the three motions on the floor.'",
        "'speaker_0': 'We're going to go ahead now. Go to two votes on these motions. Madam Clerk, are you. Are you correct? You ready? Okay, so on the substitute substitute motion, please cast your votes. This is the motion by Al Austin.'",
        "'speaker_0': 'Council member, Austin.'",
        "'speaker_1': 'Every motion carries for three.'",
        "'speaker_0': 'Okay. So the motion. The motion carries. Okay. All right. So now just just just to be clear. The City attorney. So I want to be sure everyone's issue like this is important that where everyone's on the same page.'",
        "'speaker_0': 'So do you want to repeat what past?'",
        "'speaker_4': 'Certainly, Mayor, members of the council, the substitute substitute motion passed 4 to 3 to withhold any action by the city manager until 90 days are until 60 days after full representation or until the 60 days after the fourth District Council person is seated, at which time the city manager will come back to the City Council for additional'",
        "'speaker_4': 'direction on the study for regarding a customs facility.'",
        "'speaker_0': 'Thank you. And what I want to just say, I know I haven't had a chance to say any comments. I want to make sure that a few things. One is, I want to thank everybody for coming out. I know this is an incredibly important issue to a lot of people, and it's important for us to hear all'",
        "'speaker_0': 'points of view on any issue before the council. And so I know it's contentious. I know it's emotional. I know that for a lot of you, you've been in this in this airport conversation for a very, very long time.'",
        "'speaker_0': 'That dates back before anybody was here, sat on this current council. So I understand that. And I also think it's important. I think staff understands that this is obviously clearly an incredibly important topic to a lot of folks, not just some of the council colleagues, but people in the community.'",
        "'speaker_0': 'And so as we move forward through this process, I think, Mr. West, the more that there's an opportunity to check in and provide, you know, public check ins about what the where the process is and where things are going, I think will serve everyone to ensure that people feel that there is a transparent process.'",
        "'speaker_0': 'And what I don't want what I don't want to happen is I don't want because listen, our staff works very hard and they have a lot of issues, not just this one that they're working on every single day.'",
        "'speaker_0': 'And they're also sometimes trying their best to get things done and bring information to the council and bring information to me as well. And what I want to make sure also is this is I think the more transparent we are in this process, I think it's not just better for the community, but it's Mr. West it's better'",
        "'speaker_0': 'for staff as well. I think everyone it's out it's out there and everyone gets a an even look into what's going on. So thanks again for coming down. We have a process and Madam Clerk, we're moving on. I'm sorry.'",
        "'speaker_2': 'Item. Yeah, we're.'",
        "'speaker_0': 'We're going to go to item 24 after a quick take a quick recess. So the one minute recess for a restroom.'",
        "'speaker_13': 'I'm going to roll the tape.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_13': 'I want to know.'",
        "'speaker_3': 'How you do it. You know. Oh, my God. So I could.'",
        "'speaker_4': 'Like. I was going to ask her. She knows.'",
        "'speaker_3': 'Everything. But anyway.'",
        "'speaker_5': 'Here is your time.'",
        "'speaker_3': 'You're doing all right. Oh, we love. I got the answer. Okay, so we're just like, Hey, we let it go.'",
        "'speaker_10': 'I want to catch.'",
        "'speaker_3': 'So I would conclude. I need to find out.'",
        "'speaker_5': 'When they we're allowed to go.'",
        "'speaker_4': 'Back here and talk to Mr. Brady. All right. Issue.'",
        "'speaker_3': 'Should.'",
        "'speaker_13': 'I have no idea what we're like.'",
        "'speaker_3': 'Yeah. Yeah. So there. Because I know I be able to hear. I just didn't want. Well. A better way. Yeah. I feel like. Yeah. So are you. Do you? Really? Oh, yeah. I feel like I'm going to. Yeah, yeah, yeah, yeah, yeah.'",
        "'speaker_3': 'Be. Yeah. Where? People like you don't want. You got it right? No, not all. Well. It's not the.'",
        "'speaker_0': 'Okay. Why don't we go and back into session so I can have the council grab their seat?'",
        "'speaker_3': 'I would be like. Pretty.'",
        "'speaker_0': 'Okay. Madam Clerk.'",
        "'speaker_1': 'Would you like me to take a roll first? Vice Mayor Lowenthal Councilwoman Price. Councilwoman Mongo. Councilman Andrew's Council Member. You Ranga. Councilman Austin. Councilmember Richardson. Mayor Garcia.'"
    ],
    "Status Update on Language Access Policy Implementation.": [
        "'speaker_0': 'I'm here. Thank you. Next item, please.'",
        "'speaker_1': 'Item 24 Report from Development Services. Recommendation to receive and file a status update on the implementation of the Language Access Policy Citywide Camera Tour.'",
        "'speaker_0': 'This over to Mr. West.'",
        "'speaker_5': 'Mr. Mayor, council members. As you know, we adopted the language access plan approximately six months ago. The council asked us to come back at six months just for a look see at the program. So without having to turn it over to our development services deputy director Angela Reynolds and her trusty aide, Tracy Klinger.'",
        "'speaker_8': 'Good evening, Mayor and council members. As I said, we're back with our six month status update. We actually adopted the Policy Council did on August 13th, 2013. As per the policy, the staff report is. To give you the biannual update.'",
        "'speaker_8': 'So several initiatives have occurred to further the implementation of LEP and there's a whole series of them which I'll go through fairly quickly and then we can have questions at the end. So a directory of staff receiving bilingual pay for LEP languages is complete and available on the city's intranet and that's a resource for people.'",
        "'speaker_8': 'The city staff that encounter the public, whether it's at a public counter or on the phone or any of the departments of the city. City employees have been notified about that directory. Tracey has actually worked with a number of departments to look at the directory and understand how to use it.'",
        "'speaker_8': 'And then one of the other things that was a big issue for us is the translation of important documents. We worked with the Language Access Coalition and identified 175 documents citywide to be translated. And to date we've done 106 documents, and the remaining documents will be translated by the end of this fiscal year.'",
        "'speaker_8': 'The Technology and Innovation Department is currently updating the city's website. The website was also a place that we wanted to do some language, access and translation. And during phase one of the website update, Google Translate will be made available on the city's website.'",
        "'speaker_8': 'So every page will have.'",
        "'speaker_2': 'A Google.'",
        "'speaker_8': 'Translate button that people can just press on. During phase two of the website update, the most frequently used web pages will be reviewed, revised and translated into languages. Oral interpretation documentation translation continues to be available upon request. As you can see on all city charter, there's tag lines on the bottom of the agendas.'",
        "'speaker_8': 'The language line pilot program with public works is now operational and public works. Refuse call center has outgoing messages in lap languages. So that's the first call center that we're experimenting with to collect data on how how many calls we get in each of the languages.'",
        "'speaker_8': 'And if somebody calls in a language where a call center person is not identified, that speaks that language, they they buzz right into the language line. And that's the way they're able to do the translation. And we are also going to start doing a beta test and development services.'",
        "'speaker_8': 'Since we both work there and that would probably be the easiest one and we serve many customers probably the most in the city at our fourth floor counter. We're going to do the beta test of doing a phone lines which have outgoing messages in lap languages.'",
        "'speaker_8': 'There are three types of phone lines, so we've been working with technology services to understand how we will get this up and running. It's actually kind of complicated in terms of the telephone lines. There are three lines or the call center lines and there are auto attendant, which means it's a voicemail box and then the live person'",
        "'speaker_8': '. And each time each of these types of lines will be evaluated in the Development Services Department as part of the beta test. So we're hoping that lessons learned from that will be incorporated into doing additional city department telephone lines.'",
        "'speaker_8': 'And then we met with the advocates several months ago and staff about charged children as. Interpreters. So staff worked with our city attorneys to do a Paul. It's actually a procedure about child interpreters, and it's attached to your staff report as Exhibit B.'",
        "'speaker_8': 'It's not to be a part of the policy, but as an aside to talk about process and procedure, about how we actually implement that idea. The next steps include providing training for employees, receiving bilingual skill pay. A slap notice will be mailed to All Long Beach residents.'",
        "'speaker_8': 'We're going to continue translating the auto attended lines, analyze results from the Public Works pilot program, and then start to institute language line and all the other call centers. That concludes my report. And we can answer any questions you may have.'",
        "'speaker_8': 'Thank you, Mr. Randall. I'm sorry, Mr. Reynolds. Council Richardson.'",
        "'speaker_10': 'Thanks, Vice Mayor. So. So this has been coming along, and I'm very pleased to see that. I mean, at this point, you know, there are fewer and fewer people in the audience. And the conversations with the community about this are they've come a long way.'",
        "'speaker_10': 'They've come from this is something we need to do to this is something that we're tracking. It's progress and here are milestones and here are our benchmarks and we get to actually follow it. So so I'm very I'm very glad to see that this is this is where we are.'",
        "'speaker_10': 'At one point, it was a wish list, and now we actually have funding allocated to this. And and and it's a real commitment on behalf of the city. There's a few things, a few questions. So just some clarity.'",
        "'speaker_10': 'So language line. So we know that it was it was piloted in public works. Do you have any anecdotal examples or any sort of a how you know, how often is it being used? The language line program.'",
        "'speaker_8': 'Councilman Richardson, we're actually doing that tracking now. So I don't really have anything anecdotal for you other than to say Spanish is the most heavily used line.'",
        "'speaker_10': 'Okay. When do you think we can start seeing some analytics from that? Like how many people are actually calling? Because we wanted to do the pilot and I don't remember what the timeframe was, but the whole expectation was we wanted to use it as a pilot to see, you know, is this is this a real thing that'",
        "'speaker_10': 'that is actually helpful to to people? And that's why I moved it from the health department to the Public Works Department. So when do you think we can have an update on like analytics?'",
        "'speaker_8': 'Well, definitely by your next bi annual update, we will have that all analyzed and we'll probably have started on another call center by then.'",
        "'speaker_2': 'Great.'",
        "'speaker_10': 'On public area notices. I know that we said that we were going to start doing outreach. I know your memo says that you wanted to wait until the whole policy was implemented before going out and doing notification. But the notification piece was really important to me, I think well to a number of the council members from that'",
        "'speaker_10': 'discussion. So yeah. So why can't we go out and like talk about the language? What are we already talking about in some less formal way than public notices? And are there elements that we can go out and publicize now?'",
        "'speaker_8': 'Councilman Richardson, we're working to get notices out and to all Long Beach residents. Yeah. Through utility billing. But in addition to that. Um Development Services has quite a few large scale planning efforts in going on around the city, and all of those documents are translated or so people understand that, you know, that's how we're getting sort of'",
        "'speaker_8': 'the word out.'",
        "'speaker_10': 'So we're thinking. So we know that. So it sounds like. I don't know. I'd like to see, like, a deadline. I'd like to see, like, a commitment to, hey, we're out and we're talking about it, and we have public notices out there.'",
        "'speaker_10': 'So we're talking about put them into the get utility bills. I think that's a great solution. When do you think we can do that? When can we just put a deadline so we have some closure on that issue?'",
        "'speaker_8': 'We've been working with staff and we've got it slated for May or June.'",
        "'speaker_10': 'Okay, so June at the latest will have the notification. We're out there. Perfect. All right. So on telephonic messages. So you've begun the process. You've translated. What was the 106, was it? No, that's the documents. How many phone messages have we translated?'",
        "'speaker_10': 'Outgoing messages.'",
        "'speaker_8': 'Excuse me. Councilman, we're in the process of doing the development services main lines right now, so that'll be about three or four of them.'",
        "'speaker_10': 'Okay. So I guess the same question is what date can we. Make public that we can actually, you know, say that these numbers have been translated.'",
        "'speaker_8': 'Well, I can't give you an exact date at this point other than to tell you that we're working on it and we're working with technology services. And so there. To do these telephonic messages is really something that is.'",
        "'speaker_8': 'Very complicated. It takes a lot of manpower. And luckily, the one person in the city that's able to do this is helping us right along. So I would say if I had to guess for development services, we will have those.'",
        "'speaker_8': 'Trent, those three or four lines translated in all four languages because they're in Spanish now in let's say early May.'",
        "'speaker_10': 'Early morning. So definitely by June. So we'll have those done. I'm literally going through the check off list and everything that doesn't have a date. I'm just curious what those dates are so we can add some clarity to this.'",
        "'speaker_10': 'And it sounds like things are lining up for by June. These things can be implemented. So we can have analytics on language line by June. We can have our notices go out by June. We have a timeline on I know the website's a much larger project, but how soon are we talking about having the the Google Docs'",
        "'speaker_10': ', the Google Translate piece?'",
        "'speaker_8': 'Technology Services is reporting mid to late April.'",
        "'speaker_10': 'April, so definitely by June. So that's that. I know that we're talking about doing the training piece later and I'm okay there. The vital documents. I think that's I think that. Thank you for actually listening. The the documents have been translated.'",
        "'speaker_10': 'So I appreciate that. And and how's it going in terms of the public meeting and hearing requests for interpreters? It seems like that that process is going pretty well.'",
        "'speaker_8': 'It's going very well. We have a vendor for that and any time anybody is having a meeting and wants to have translation there, we provide it through the vendor.'",
        "'speaker_10': 'Okay. So it seems like of the things that we fund it and we applied to $250,000 to, it seems like we've made progress on all of them, but we haven't committed to like a timeline that we can like a concrete timeline.'",
        "'speaker_10': 'So on those, but we've talked about like April, May, June, so at least by June when we have an update on those. And then the final issue that you touched on was the was the you mentioned the city attorney's office and you guys mentioned that issue.'",
        "'speaker_10': 'And putting this child interpreter statement into the policies and procedures manual was the option you the option you selected to go go in and go into and from. And can you provide a better explanation or maybe city attorney provide a better explanation to what the specific implications are if we actually list this language into the language access'",
        "'speaker_10': 'policy? In addition to your, you know, your policies and procedures.'",
        "'speaker_4': 'Members of the council at Councilmember Richardson. The statement is is attached as Exhibit B. I think that we were trying to reach some sort of a staff policy level and guidance for all of the departments to discourage the use of children being using children as interpreters or minors as interpreters.'",
        "'speaker_4': 'And so it's kind of self-explanatory. So I'm not sure if I understood your question.'",
        "'speaker_10': 'So we have the language access policy adopted, which development services put together, and a lot of work was done to that. And then this piece, this statement we're including in our Policies and Procedures Manual, it just makes sense to me that when you reference the language access policy, we should be able to see statements related to language'",
        "'speaker_10': 'access policy there. So I just want to know specifically, I'm sure there was a methodology for doing it that way. I want to have that conversation publicly. Why is it in this body, in this body of work and not in any other work?'",
        "'speaker_8': 'Well, Councilmember, it's like when we update an ordinance, we refer out to things that are existing, whether it's fee ordinances or any other thing that's part of that ordinance or the process or procedures. But we don't put them verbatim into the ordinance or the policy in case they change.'",
        "'speaker_8': 'So we don't have to come back and renew the policy. If we're trying to change something, we don't have to open it back up. So what we could do in six months is we can come back with a section in the policy about child interpreters and refer out to this paper, to this exhibit.'",
        "'speaker_10': 'Thank you. So that works for me here. So here's what I like to do, and I see that the maker of the motion is councilmember urine on here. So I'm going to offer some friendlies, councilmember, to your motion.'",
        "'speaker_10': 'And it's all consistent what we discussed. I think that we've we I like the report that we've gotten. I like the answers we've gotten in terms of the deadline. So I would like to say, see if you can add to your motion that we receive a report from city staff by June 1st on the implementation, like the'",
        "'speaker_10': 'implementation of the of the key elements we just mentioned that will be implemented by June. And those are the analytics on language line, the Google translate on the website, the recorded telephonic messages in the resident notices inside the inside the utility document.'",
        "'speaker_10': 'So I think that cleans it up. So if you can, that would be my friendly. And then secondly, oh, as well as the policy we refer to the updating the policy with the reference on child interpreters.'",
        "'speaker_5': 'Let me get let me get some clarification on this with this. Would this be something that you would do anyway in the six months report? Yes. Yeah. Okay. So, I mean, I think it's within it's within the motion to do those.'",
        "'speaker_5': 'All you're doing is clarifying, provide specifics in regards to some of those reports that you want back. So I think. Yeah. In other words. Yes.'",
        "'speaker_10': 'Right. Yes.'",
        "'speaker_5': 'Yes.'",
        "'speaker_10': 'Thank you very much. Okay.'",
        "'speaker_5': 'Although we're going to get it back anyway, but it's going.'",
        "'speaker_8': 'To remember you.'",
        "'speaker_5': 'Yeah. And the other part, just a clarification. If I understood it previously in our discussion that we had about this in terms of the, the the children interpreters, that that is more of a procedural type of effort, not a policy type of effort, that it would be something that that staff would be directed to follow in the'",
        "'speaker_5': 'event that they were confronted with a situation where there was a child being used as a translator. So it's not a policy per se, but more of a procedure.'",
        "'speaker_8': 'Yes, Councilman, you rank it. That's the way that we're seeing it in case anything needs to change in the future. But it's not a problem to actually have a section in the policy that we could bring back and have agendas at our next six month visit with you so that you could take an action to actually add'",
        "'speaker_8': 'that reference out into the policy.'",
        "'speaker_5': 'Okay. All right. I guess I have the Q You did?'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'In regards you mentioned that you translated 106 out of the 125 documents. Are you prioritizing some of these? Because I see that some of these documents that have not been translated as yet include some in the fire and police departments to the most important departments that I think would require almost immediate types of translations.'",
        "'speaker_8': 'Yes, Councilman, you were right. Let me tell you the way we're actually doing it. Look, instead, we are we've already reached out to all the departments that have identified important documents. We are working with them. Tracy meets with departments at least three or four times a week to talk with them, try to get their data from them'",
        "'speaker_8': '. And as soon as she gets it, it goes out to the translator. We have a translation vendor as well. So they everybody knows that they're supposed to what they're supposed to give. And we're just facilitating that and doing the staff work to get it done.'",
        "'speaker_5': 'Yeah, well, the only reason I've seen it, because I think that there was a translation service for like for example, domestic violence resource for four forms, temporary restraining orders. That type of information has not been translated yet. So I think that those are two very important documents that that I think would be very helpful almost immediately.'",
        "'speaker_8': 'And we'll take note of that and we will call the police department tomorrow.'",
        "'speaker_5': 'Okay. Those are the your questions I have. But I want to thank the language Axis Coalition for bringing this forward and and for and to Councilmember Rex Richardson for his support on this. That's an important job. We've committed a lot of resources to it.'",
        "'speaker_5': 'And I want to thank you for it, for your tenacity and perseverance in pushing this forward with us as well. Thank you.'",
        "'speaker_8': 'Councilman.'",
        "'speaker_2': 'Yes, thanks. You know what, Councilman? You, Ranka and Rex. I think it's really a this is a great, you know, item that you guys brought in the policy that you brought together, especially with the language access. And I would really want apply to all of the individuals out there, you know, for working so hard on this and'",
        "'speaker_2': 'especially what you and Councilman Richardson is doing, you know, about the kids, because that's very, very important, especially in my district, you know, being that of Cambodians, most of the times it's the kids. It does all the, you know, language interpretation.'",
        "'speaker_2': 'And that's you know, I think sometimes it's good and sometimes it's bad. But I think we really kind of hit it on the nail. We're working hard with that. So I just want to thank the staff also for your hard work on this policy because it's really exciting.'",
        "'speaker_2': 'And I know this is a long time coming because we started this, you know, last year and we're finally getting around to some fruition on this. And I want to thank all of you guys for your work on this and especially that, you know, the staff.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_8': 'Thank you. Councilman Andrews, Mr. City Attorney.'",
        "'speaker_4': 'Thank you, Vice Mayor. Councilmember Richardson, on the clarification of the motion, I believe you asked for a friendly amendment to come back in June. Do you want this or this is going to come back at the regular six month?'",
        "'speaker_10': 'No, I was. So what? I'm okay with the format that Ms.. Reynolds mentioned. So it was a report, a report by June on those specific elements. But when's the next check in? Six months from now. That's fine. I think I'll wait.'",
        "'speaker_10': 'But you actually going to have to bring it back to city council for the vote to put on the policy, right?'",
        "'speaker_8': 'Exactly. So if I could bring it back in six months, we'll have definitive answers for you like, oh, it's you know, we did the notification, we did the phone line.'",
        "'speaker_10': 'I'd like to I would prefer the two from four in June.'",
        "'speaker_2': 'Okay.'",
        "'speaker_10': 'The dates, we disagree, but we just talked.'",
        "'speaker_8': 'ATF is.'",
        "'speaker_10': 'Fine. A lot of them were. A lot of them were. April, May and June will just make it clean. And what I'm references in terms of in terms of the action to integrate into the policy like how long do you think it would take just to have just that action placing the reference into the policy, how much'",
        "'speaker_10': 'time you need. I'm flexible on.'",
        "'speaker_2': 'This. Okay.'",
        "'speaker_8': 'Well, we staff takes about there's about a one month cycle for staff to get something on the council agenda.'",
        "'speaker_10': 'So by June we'll do that to do everything by June one.'",
        "'speaker_8': 'Well, I can do that. Do you want to or do you want to just just come.'",
        "'speaker_10': 'Back to TF on the items we're going to that we're going to reference. Right, that just the specific like the update on implementation, I think in making the adjustment to the policy is a separate item that actually has become the council, correct?'",
        "'speaker_10': 'Well, you. Mr. City Attorney. Yes, that.'",
        "'speaker_4': 'Would have to does and that would be in your normal six months of September.'",
        "'speaker_2': 'If I may. Yes. Good evening, Vice Mayor Low and members of the City Council, Arturo Sanchez with the city manager's office through the chair. Councilmember Richardson. The cycle that you would be putting us on in terms of coming back to the Council in June?'",
        "'speaker_2': 'Would then you'd have a report in June and then a six month report in August.'",
        "'speaker_10': 'Really? Respectfully, just. I'm not asking for a report yet.'",
        "'speaker_2': 'No tff tff in June. But but right now I just to ask you for clarity, just to make sure that we're on the same page. So tff in June, the six month report in August, coming back with the policy edition that we are talking about regarding the use of miners.'",
        "'speaker_2': 'Because that would that would get both items in front of you at the same time. So you can knock out both the six month, six months.'",
        "'speaker_10': 'That's what you're suggesting. That makes more sense. I'm okay with that. Okay, yeah. If the maker of the motion is okay with that. So, yeah. So I guess his only changes, I guess is only changes when we when it, when we come back to city.'",
        "'speaker_10': 'So we have the two from four which confirms what we're, you know, the implementation we have that by June, the two from four that codifies that. And then when we come back to City Council, what's placed on the agenda actually amends the policy at the next update when it comes back city council.'",
        "'speaker_10': 'That way we don't have to take the City Council twice in six months. I'm comfortable with that.'",
        "'speaker_8': 'Okay. So there are no other speakers cued up. There's been a motion by Councilmember Your Honor and the second by Councilmember Richardson. Is there any member of the public that wish to address council on this item? Please come forward.'",
        "'speaker_8': 'State your name. Hi. Hi.'",
        "'speaker_5': 'Good evening, Honorable Vice Mayor. City council, city staff and everybody who came out here tonight. My name is Alex Montano. Since I'm a first district resident, I'm with the Filipino Migrant Center and the Language Access Coalition. First off, we just want to thank everybody, City Staff Council and everyone who has been part of moving forward the language'",
        "'speaker_5': 'access policy. It's really a huge victory for the people of Long Beach, which is, you know, one of the most racially and ethnically diverse cities in the whole U.S.. Tonight, I just want to provide a brief context about the language access policy and just outline a few basic requests from the Coalition.'",
        "'speaker_5': 'A Brief History. So in November 2011, the language access policy was introduced and the city staff were instructed to draft a policy in 120 days in August of 2013. The policy was approved by City Council, a major victory.'",
        "'speaker_5': 'And then in September 2014, the policy was finally funded for $250,000 for the 2014 2015 fiscal year. But now it's March 2015 and the language access policy has not been fully implemented. And we know that there's been great strides by city staff to move forward, but our community members have not seen a tangible result.'",
        "'speaker_5': 'We haven't seen tangible results that this policy has been fully implemented. And so all the all of our members of the community are asking, how long do we have to wait until this is fully implemented? And so our requests are, number one, we respectfully request that the city council direct city staff to fully implement the policy by'",
        "'speaker_5': 'June 1st, 2015. Number two, we also respectfully request that the policy is amended to include the children used as interpreters in the policy itself. It would be a stronger statement and better protection for the city and all of our children if it's written in the policy.'",
        "'speaker_5': 'And so we, the Language Access Coalition and thousands of other residents here in Long Beach believe that these are ways that we can move this forward and provide greater access to thousands of residents in the city. And so in the next coming testimonies, you'll hear stories from other Long Beach residents who have been denied language access here'",
        "'speaker_5': 'in the city. And so we also once again ask, how long do we have to wait? Thank you for your time.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Good evening. All my cancer council. Uh, my name. I'm doing that blue in the first three. And one, three, four, four Sandy Avenue. Lovely.'",
        "'speaker_3': 'And.'",
        "'speaker_1': 'Uh, carpeting. I think I can hide the baboon. I can't be. Hey, champ. MAN To.'",
        "'speaker_8': 'Galina.'",
        "'speaker_1': 'Yeah, that movie.'",
        "'speaker_12': 'Here they come.'",
        "'speaker_8': 'Again.'",
        "'speaker_2': 'On Monday, February 9th, 2015. I made a phone call to a public office.'",
        "'speaker_1': 'To get to some of them.'",
        "'speaker_2': 'Regarding garbage bins.'",
        "'speaker_1': 'So I pay them so much.'",
        "'speaker_2': 'So at that time I requested I would like to request it to speak to a an employee who can speak Cambodian.'",
        "'speaker_1': 'Japan. Now that we kind of got by on a salary.'",
        "'speaker_2': 'And they did refer me to an employee who speaks Khmer, which is a Cambodian language.'",
        "'speaker_1': 'Job that they hire. But amount of me and.'",
        "'speaker_2': 'At that time I waited for 5 to 10 minutes, but there was no person speaking Cambodian.'",
        "'speaker_1': 'Uh, how did they know me? And from the entire phone gets on my phone.'",
        "'speaker_2': 'And then this voice from the telephone just telling me to leave a message on that telephone.'",
        "'speaker_1': 'Which means that at some kind, I mean, uh.'",
        "'speaker_2': 'It's crucial if there is an employee or employees of the city of Long Beach who can speak my or the Cambodian language.'",
        "'speaker_1': 'Mm. How you. Was my to me in the room had got like a sonnet card line that you can.'",
        "'speaker_2': 'For example, let's say there's there's an urgency or emergency situation. Let's say there's a fire call. And when someone makes a telephone call and nobody is able to to respond in the language, the target language, it would be an issue.'",
        "'speaker_1': 'My phone.'",
        "'speaker_2': 'Yeah, but what it would be. Wonderful if there's a Cambodian speaking employee or who can converse back to us. And that we can understand. I thank you very much.'",
        "'speaker_12': 'Good evening, Honorable Council and Mayor. My name's Alicia morales. I am a second district resident and I am an organizer with the Long Beach Immigrant Rights Coalition. Thank you for taking the time to address this issue of Language Access tonight.'",
        "'speaker_12': 'And while there has been a lot of good work done around this issue, there's still a lot of work that needs to be done. For this reason, I brought with me today testimonies from many as our class that we conduct in the mornings in regards to experiences that our community members have faced within the last year with'",
        "'speaker_12': 'the lack of implementation and how this lack of implementation of the Language Act as policy has affected their lives in hopes that you would take their experiences into consideration. So does the story of Blanca, a resident from the first District.'",
        "'speaker_12': 'Blanca's child got severely sick and was forced to call an ambulance after this incident passed the ambulance center bill. She was then told to take the record. Her meant her son's medical records and a copy of the bill and take it to City Hall where she can finish the paperwork and pay for it.'",
        "'speaker_12': 'Blanca came to City Hall and had trouble identifying the proper window in which to pay her bill. She entered the first lane that she saw and when she reached the counter, she was told there was a wrong lane for her issue.'",
        "'speaker_12': 'There was no one there to help her because of her lack of English alone. Blanca grew desperate and frustrated, and after hours of waiting and receiving unclear directions, she left City Hall flustered without paying her bill. Not paying her bill made Blanca anxious, but she did not want to go into City Hall again, anticipating that there was'",
        "'speaker_12': 'no one willing to help her and she would meet some closed doors again as. As the deadline emerged, she had no choice but to attempt her bill again. However, this time she was successful because there was a bilingual person she was able to approach.'",
        "'speaker_12': 'But she avoided City Hall because she anticipated that no one would help her. In a more severe case. Marino, who is also a Long Beach resident, last month was wrongfully identified as an individual who stole a car. She was stopped by eight police officers when she was driving on the road.'",
        "'speaker_12': 'Because of her limited English, the situation which was stressful enough, already turned into something more severe for Marina as she tried to explain with flashing lights in her face and yelling that she could not speak English. She was trying to explain that she had just bought the car and that this was an issue of wrongful identity.'",
        "'speaker_12': 'But she could not. She was able to eventually communicate with someone. But Marina, who suffers from anxiety, was a point of fainting and couldn't even drive home after this situation. In these experiences of extreme stress, there was no a time for language access for people like Marina four for Blanca.'",
        "'speaker_12': 'And this further triggered harm to our residents. When should have an implementation of our policy been implemented already? They wouldn't have occurred. These common practices and experiences of our community members are a reflection of the lack of this implementation.'",
        "'speaker_12': 'While we have a long way to go, our community members are still paying the price for this inaction. I'm almost done. I'm almost. And I swear. So hope you can take their experiences into consideration and to push for a June 1st deadline because of the experiences that we've seen within the last year.'",
        "'speaker_12': 'A very.'",
        "'speaker_0': 'Thank you very much. Thank you very much.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_5': 'In evening. Mayor, members of the City Council, thank you so much for the opportunity to speak tonight about language access. First of all, my name is Renee Castro. I live at 616 Grand Avenue in the third district. And I want to thank my councilmember, Susie Price, for meeting with our coalition about some of our concerns.'",
        "'speaker_5': 'I really appreciate the questions tonight. Councilmember Richardson and I'm just really, you know, getting staff to be specific about dates, I think that's super important. And I also want to recognize Councilmember Urunga for your statements, particularly on the domestic violence resources, which I know is really important to Councilmember Price as well.'",
        "'speaker_5': 'There are critical documents in here that need to be prioritized. I appreciate staff's efforts to get some of them translated, but one concern I had in the council letter is there's a real pattern here of at least that I'm picking up the nonresponse from particular departments.'",
        "'speaker_5': 'If you look particularly at the council letter and the documents for Parks and Rec, there's been no nothing received from Parks and Rec. I can see on the council letter also gas and oil is there's a dearth of documents there.'",
        "'speaker_5': 'There's this it doesn't seem to be any response there. And then again, just prioritizing particular documents. So I understand staff, you know, Tracey going out and meeting with staff, but I think what we need here is leadership on the council telling these directors, you better get on this if you get a call from Tracy Kalinga.'",
        "'speaker_5': 'You need to respond to that. So once again, I think the council's efforts and I really appreciate your efforts to really drill down some specifics on this policy. Thank you.'",
        "'speaker_0': 'Thank you. Speaker.'",
        "'speaker_3': 'Rotate.'",
        "'speaker_12': 'Good evening, Mayor. City council members and city staff. My name is Laura Field and I'm speaking on behalf of building Healthy Communities Language and the Long Beach Language Access Coalition. You have heard several stories tonight touching on the importance of real language access in our city.'",
        "'speaker_12': 'Through my work in the community and in this coalition, I've seen firsthand that language access is a very nuanced process and one that requires our constant attention. I did want to address just a few things that were presented tonight.'",
        "'speaker_12': 'One, a very large one, actually, for our coalition. We were very happy to hear updates from development services on the progress, and we have been in communication at various points, but we also feel that we have struggled to main communicate, maintain communication in recent months.'",
        "'speaker_12': 'And as a folks kind of working on the ground with very invested community members in this process, we would just like to keep those doors of communication open and make sure that we are continuing this and are always sort of able to go off each other and understand what's happening, the policy, so we can best communicate that'",
        "'speaker_12': 'with people we are working with. Another piece I just wanted to place about children is interpreters, the language on that. We understand the concern of the difficulty of amendment for putting something in a policy versus leaving it as an internal policy document.'",
        "'speaker_12': 'But I think that's why we're here today in the democratic process, because we think if this is more visible, if this is something that's part of policy, that there's more opportunities for community and government to work on that and to give input, not to be left as a staff memo Lost in the abyss.'",
        "'speaker_12': 'And finally, as the Language Access Coalition, we are asking not for more updates and reports, but for full implementation by June of the pieces that have already had funding allocated. I think a staff report to offer from Memo, however it's delivered, is great information.'",
        "'speaker_12': 'But all the stories tonight speak about people on the ground not connecting to the services that there should be. So we are asking about implementation and not about reports. So just until language access services are fully implemented and in place, our city residents will continue to have their voices left out of the conversation.'",
        "'speaker_12': 'We are very excited to be this far in building more language access language thanks to the work of our staff, the advocacy from our council, and we thank everyone who has tirelessly worked on it. But again, we need services now and especially for what has been allocated.'",
        "'speaker_12': 'So again, we ask how long do we have to wait? Thank you.'",
        "'speaker_0': 'Thank you. Q We're gonna go back to council. Councilman Mongo.'",
        "'speaker_12': 'I want to thank the staff for the work that they've done on this and then also to the community group that waited so long to have your item heard this evening. Also, please note that while we are council members here, we also have other jobs and my other government entity is implementing multiple languages on our website in'",
        "'speaker_12': 'the coming days. So thank you for the information and knowledge you've brought to me, and I hope that you can appreciate that 10 million residents of L.A. County will soon get a new and refreshed website because of your efforts.'",
        "'speaker_12': 'Not solely. I do have to give my boss a lot of the credit.'",
        "'speaker_0': 'Thank you, Councilman.'",
        "'speaker_6': 'Thank you. I want to thank Councilman Richardson and Durango for championing this. I did meet with the coalition. I think this is a worthy policy for us to pursue. I want to thank staff for the efforts that they've taken on this.'",
        "'speaker_6': 'I do want to point out that and it's your job and I respect it incredibly, the coalition. But to advocate for the very best situation that you can get to advocate for that the most and the widest amount of resources that you can get, I respect that entirely.'",
        "'speaker_6': 'And I just I want you guys to understand at the very deepest places of your heart that we really are trying to do the very best we can with the resources that we have. And I don't know if you were here earlier for the budget discussions, but our outlook in the next few years is not so good'",
        "'speaker_6': '. So we have to be very prudent with what we do. And although this is an amazing policy, I know that there's always a desire to have more and make it better. I just I want to encourage staff to know that this is a priority for us.'",
        "'speaker_6': 'I think we've communicated that we would like there to be compliance that's meaningful. And beyond that, we understand and I hope everyone understands that there's financial limitations to what we're able to do and whether or not we can provide.'",
        "'speaker_6': 'You know, the ideal product at this time is probably not a realistic expectation, but the best that we can do with the resources that we have, knowing that the intent of this council is to provide access information to as many people and residents in the city as possible, regardless of what their primary languages.'",
        "'speaker_6': 'That's that's our intent. We serve everybody, every single person. So thank you.'",
        "'speaker_0': 'Thank you. And now we have a motion on the floor, which is Councilman Ringa and Richardson. We're going to go and take a vote on the motion.'",
        "'speaker_1': 'Motion carries seven zero.'",
        "'speaker_0': 'Okay. Thank you. Thank you all for for coming out, madam Kirk. Next item.'",
        "'speaker_1': 'Item 25 Report from Health and Human Services Recommendation to authorize City Manager to execute all necessary agreements between the City of Long Beach and the Los Angeles County Children and Families. First to accept funding in the amount of 14 413,000 and increase appropriations in the Department of Health and Human Services.'"
    ],
    "Alcoholic Beverage License Transfer for Lolas Mexican Cuisine.": [
        "'speaker_1': 'Item 29 Report from police recommendation to receive and file the application of Novarro Norton partner for a premise to premise and person to person transfer of an alcoholic control license at 2030 East fourth Street District two.'",
        "'speaker_0': 'There's a motion in a second. Any public comment on the item? Seeing the vice mayor landfall.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I know all the council members have been to Lola's on Ford Street, and if you have not, I hope you will stop by one of these days for some great food and service. I see the owners in the audience and I just want to indicate that you've always run a very solid business and'",
        "'speaker_8': 'been nothing but supportive of our community causes. So thank you for being a responsible neighbor. Appreciate your desire to compete with area restaurants and your desire to serve high end drinks paired with your dishes rather than operating like a bar.'",
        "'speaker_8': 'I think that was really honest and very supportive of what what the Street is aiming to do. I'm just pausing because there was a time where we had no food on Fourth Street. So this is a good problem to have.'",
        "'speaker_8': 'With that, I'd like to move to receive and file Lola's application for a premise to premise and person to person. ABC License.'",
        "'speaker_0': 'Okay. There's been a motion and a second. No public comment or we did public comment already. Excuse me, please cast your votes.'",
        "'speaker_1': 'Motion carries seven zero.'"
    ],
    "Alcoholic Beverage License Transfer for Legend Energy at 5740 Atlantic Avenue.": [
        "'speaker_0': 'Next item.'",
        "'speaker_1': 'Item 30 Report from Police Recommendation to receive the application of legend energy for person to person and premise to premise transfer of Alcoholic Beverage Control License at 5740 Atlantic Avenue. Determined that the application serves the public convenience and necessity to submit a public notice of protest to ABC and direct the city manager to withdraw the protest if'",
        "'speaker_1': 'a conditional use permit is granted. District eight.'",
        "'speaker_0': 'There there's a motion by Councilman Austin and a second by Richardson. Councilman.'",
        "'speaker_11': 'Well, quite frankly, I'd like to continue this motion until March 17th, and the council will indulge us. We have a hearing that that day on this particular item, and it just makes sense to do it all in one day.'",
        "'speaker_0': 'Yeah, there's a motion to continue. And the second concern. Richardson Any public comment on the item to continue? CNN Please cast your votes.'",
        "'speaker_1': 'Motion carries seven zero.'",
        "'speaker_0': 'Next item.'",
        "'speaker_1': 'Item 31 is withdrawn. Item 32 Recommendations. I'm sorry. Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code by amending subsections. 10.14 .0208.25 I'm sorry. Point five and 10.14 .020.80.7. Relating to a one way street and alleys red and adopted as red.'"
    ]
}