{
    "Contract Award for Medical Bill Review Services to Lien on Me, Inc.": [
        "'speaker_0': 'very much. And he is someone that needs a lot of prayers and love right now. So we just take a moment just to think about about our friend Val and his family at this time. Thank you. And please know, Val, that we are all thinking about you and praying for you and for your family as well.'",
        "'speaker_0': 'Please have a motion any second, please, to pass the consent calendar. Interesting that you up to speak that.'",
        "'speaker_4': 'Just wanted to just I don't want to pull the item, but we want to speak because some folks are paying attention to it. The item referred referencing the community garden in North Long Beach. I'm supportive of the item and I look forward to the opportunity to review the terms with the operator about expanding access to the local'",
        "'speaker_4': 'neighbors to be able to use that community garden. And so if you're listening and paying attention, that's not what we're voting on tonight. We're voting on the agreement with Edison, but we will have an opportunity to review the terms with the actual operator.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you very much. There is a motion and a second. Please cast your votes.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Thank you. And I know we have a presentation tonight. We're actually beginning to roll presentations back into our meetings. And so for our first official presentation, back to Redding prior to COVID. I'm going to turn this over to Councilor Austin.'"
    ],
    "Resolution to Support Molina Healthcare's Bid for Medi-Cal Services in Los Angeles County.": [
        "'speaker_0': 'Thank you. That concludes public comment. So thank you, Herb, for public comment. We are going to move on to the rest of the agenda. We have item 14/1.'",
        "'speaker_1': 'Communication from Councilwoman Allen, Councilman in the House of Vice Mayor Richardson, recommendation to request city attorney to prepare a resolution to communicate the city's full support of Molina health care to continue providing health care to Medicaid recipients in the county of Los Angeles as the primary contracted commercial plan.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Thank you, Amir Molina. Health care is a major employer here in downtown, with 2500 total employees and more than a thousand of these employees and their families are living in Long Beach. The job that many health care providers here are good paying jobs and they have a huge economic impact.'",
        "'speaker_1': 'And these jobs support thousands of additional jobs, both directly and indirectly. Most of you know that. But the company was founded here in Long Beach and is still headquartered here today. And having their headquarters here is valuable to our city and having their employees here is valuable to our city.'",
        "'speaker_1': 'The company is also a good corporate partner. One thing that they did recently was during COVID, they help train volunteers to support our community during COVID 19. I strongly believe that our city should be supporting their state application.'",
        "'speaker_1': 'It's an important way to use our voice that will benefit our community. Thank you.'",
        "'speaker_0': 'Thank you. Councilman's in Dallas.'",
        "'speaker_5': 'Thank you, Councilmember Allen, for this item. Very, very happy to be able to support this item. As you all know, the COVID pandemic cast for many changes from everyone and for very quick response from our city and from our partners.'",
        "'speaker_5': 'I'm so grateful for the support Molina Healthcare was able to provide during this time by providing PPE donations and offering volunteer support to our community based organizations in particularly. I love that they were able to help with their outreach efforts in our hard to reach population and that's their specialty and I'm so honored to have them here'",
        "'speaker_5': 'in Long Beach and I just want continuous. I want to be able to continuously support them as they support our communities that need them the most. Thank you. Happy to support this item.'",
        "'speaker_0': 'Thank you. And basically, Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Thank you, Councilwoman Allen, Councilman and de Haas for bringing this forward. Happy to sign on and support. It makes a lot of sense for Long Beach. You know, it's anchored here. It's based here. My colleagues made a strong case and we have a, you know, a pulpit here as Long Beach.'",
        "'speaker_4': 'And we should weigh in if, you know, if they continue to provide services. That's the jobs that remain here in Long Beach. And that's always a good thing. So I'm happy to sign on support. And I think we should certainly prepare a resolution or express a letter or whatever we need to do to make it really clear'",
        "'speaker_4': 'whether they were Long Beach fans. Thank you.'",
        "'speaker_0': 'Thank you. I'll do a public comment. If I can have the speakers, please line up to the to the microphone. Cameron Smith, Eartha Knowles, Adrianna Baumann, Ryan Reif, Noelle Lara. And so I can say in that order, Cameron Smith, Eartha Knowles, Adriana Berman, Ryan Reif, Noelle, Laura.'",
        "'speaker_0': 'And can I confirm, please? Thank you, Mr. Mayor and Council. I appreciate the opportunity to see everybody in person as well and to just voice our support for the resolution, as Councilmember Allen alluded to. You know, Molina is homegrown Long Beach Company, like I said, with over a thousand employees based here in the city, along with another'",
        "'speaker_0': '1500 working at our corporate offices. And this is the first time in over a decade that the state is moving forward with the rebid process of the the Medi-Cal program throughout the state. And that's why is the first time you're seeing us here asking for a resolution, because it's the first time the state has moved forward in'",
        "'speaker_0': 'many years. So we have a number of employees here that also want to express their appreciation and support for the motion. And I'm certainly happy to stand by if there are any questions that the council may have. Thank you very much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Good evening. Can you hear me okay? Yes. Perfect. Good evening. My name is Eartha Knowles. Mr. Mayor, a council members. And my comments are from item item 14 on the agenda. In August of 2000, I decided to work formally in a health care because it was established back in 1981 by a Long Beach family.'",
        "'speaker_1': 'They kept the business in Long Beach, which I call my home. Besides having a steady paycheck, which is always a good thing, I stayed with Marlene and not only because it is a good company to work with or to work for.'",
        "'speaker_1': 'I really like how Milena supports the community through the Helping Hands Volunteer Program. I believe that council members and Dais mentioned that in her speech. But I remember for me personally, there were many weekends sorting through pallets of book donations for Long Beach schools, serving holiday meals at the local churches, shelters passing out toys to the neighborhood'",
        "'speaker_1': 'kids. Given that the first, very first backpack filled with school supplies on the first day of school. Monitoring intersections as retired vets proudly paraded down Long Beach streets, displaying their stripes on their once crisp uniforms, meeting with our coworkers, doing beach cleanups.'",
        "'speaker_1': 'And then. Now I'm speaking before city council member. Hey, check that out. I have watched Melina grow and expand over the years. And through it all, even in a pandemic reality, Melina has stayed true to the mission of providing quality health services to financially vulnerable families and individuals covered by government programs.'",
        "'speaker_1': 'It is city officials like you, thank you said, who has supported Melina through the years so that Long Beach can remain home to Melina corporate office. So thank you. City of Long Beach for your continued support. And thank you for this opportunity to speak before you on this item.'",
        "'speaker_1': 'Have a good evening. Good evening. Thank you, city council for the opportunity to be here tonight. It's really nice to see you all in one room. My name is Adrian Environment. I'm the community engagement manager at Molina Health Care, and I'm a proud Long Beach resident.'",
        "'speaker_1': 'I've been working for health care for 27 years. I have the privilege to work alongside with our founder, Dr. David Molina. I seen the company start with just a handful of clinics. Small clinics born here in this beautiful city of Long Beach now has grown throughout 18 states, coast to coast.'",
        "'speaker_1': 'Carrying the same values, the same mission and vision that we started over four decades ago, which is. Serving the underserved and providing health care to the. To the disadvantage family. I'm very lucky to have one of the best jobs I Milena, and that is to serve the community in my own backyard.'",
        "'speaker_1': 'Our job goes beyond health care. We work with schools. We work with community based agencies. Churches. I might be assisting families obtaining health care coverage. I could be delivering blankets, food, clothing at local shelters. You might see me at community events providing families with health, education and resources.'",
        "'speaker_1': 'I'm really proud to represent a company here in Long Beach. Molina has been committed to the city of Long Beach for many, many years. And with your support. We'd like to continue to. I'm sorry. I'm really nervous. Really great.'",
        "'speaker_1': 'Thank you. Thank you. We want to continue to provide health care and community services for all Angelinos. So I want to thank you tonight for your support for your time. Well, Molina, that's a home grown business in Long Beach.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Right.'",
        "'speaker_2': 'Thank you, Counsel, for the opportunity to speak with you today on the Agenda Item 14 resolution to keep me as a commercial payer in Los Angeles. My name is Ryan Reiser, director of health care at Director of Health Clinic Quality Improvement.'",
        "'speaker_2': 'A little bit about what I love about my job is day to day. I get to use data analytics to identify at risk populations that to be targeted for various interventions to help improve their health outcomes. Six years ago I was still in Minnesota, but a friend of mine was working on Lean and he shared with me'",
        "'speaker_2': 'the vision that Melina had and the work that he was doing. It was this inspiration that caused me to move all the way out here. I mean, also, the weather helped, too. And over the last six years, it's been nothing but inspired from the work of the city itself.'",
        "'speaker_2': 'The growth had overtaken over the last six years of growth for Molina and the way that we've been able to expand our outreach and the way that we are impact members and improve their lives. It is through this work too that I've been inspired not to settle down and run some routes.'",
        "'speaker_2': 'A homeowner now in Long Beach and now also to I've been elected to serve as chairman and board of a local nonprofit here in Long Beach Dreams and the into goals looking into helping kids get better educational outcomes as well.'",
        "'speaker_2': 'And so it just really it's mission. Leanna was really the inspiration that brought me here, but it was really the city of Long Beach that kept me here and really appreciate the council's support on this measure. Thank you for your time.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_2': 'Hi. My name's Laura. I would like to express my appreciation. And I need to be here and express my gratitude. I first moved to London in 2003. I am a graduate from California State University Army Beach. I'm willing to health care.'",
        "'speaker_2': 'I'm a quality manager. I mostly support the western regions that health care operates in. So California is one of the states. And my department performance data and measurement. We try to predict the future and stay ahead of chronic illnesses across traditionally underserved populations.'",
        "'speaker_2': 'Our success in health care is largely determined how we help the community and the interventions that we come up with. A lot of what we develop here locally in Long Beach, in California specifically oftentimes get embedded into other state health plan operations.'",
        "'speaker_2': 'So for me, it's particularly meaningful work and where we impact the health outcomes of up to hundreds of thousands of our members. Growing up. My grandmother and mother steered us towards the public service sector. So a lot of clinicians, a lot of law enforcement on my mother's side.'",
        "'speaker_2': 'So naturally we were steered certain career path. So for this reason, it's really exciting to continue to showcase our best practices. And help improve the health outcomes of populations across the nation. Ultimately, I'm very full of gratitude and I thank you for the opportunity.'",
        "'speaker_2': 'Again, thank you. Thank you.'",
        "'speaker_0': 'Speaker.'",
        "'speaker_2': 'So I can't say. Sixth District Resident There's always these ample opportunities to prove that I have no political aspirations. Molina Health care is providing another opportunity. Speaking as a shareholder of Molina, Healthcare had the opportunity to buy in about a year ago at $132 a share and now sits at $281.'",
        "'speaker_2': 'I think I'm doing pretty good. That said, you know, our governor here has an opportunity with this medical re hall to eliminate a lot of structural inequities that exist with Medicare. And going into one of those structural, inadequate and inadequate inadequacies is a ghost network.'",
        "'speaker_2': 'You know, of course, networks are providers, lists and networks of you know, usually it depends on what sector of health you're having an issue with. But in this example, we'll use mental health. So you have ghost networks where the providers with that are kind of an accurate.'",
        "'speaker_2': 'Our friends. Money and health care have been they've had some inaccuracies. There's actually a sitting case with the city attorney of San Diego right now with relation to the inaccuracies provided to some of our low income and people of color, patients who aren't getting the full service that they need provided by money in health care.'",
        "'speaker_2': 'Upwards to the 80 percentile rate. That's actually one of the reasons why Governor Newsom is, you know, so actually trying to combat some of these issues. Speaking both as a shareholder and as a private resident here in the city of Long Beach, it's a little bit alarming for the city to connect itself with these kinds of managed'",
        "'speaker_2': 'care professionals who are having, you know, multiple violations with relation to these kinds of things as they have a book reader and big on consumer protections unsafe and at any speed by Mr. Ralph Nader is an all time favorite of mine.'",
        "'speaker_2': 'And I think that as a city council and as our mayor, we have to be really mindful and what we choose to support. I'm sure the vote has already been figured out, but with respect to the public, we have to be mindful of the fact that although, yes, I'm a big advocate of local hire and I'm a'",
        "'speaker_2': 'big advocate of the positive response and impact that Molina Healthcare has provided in the workplace. We do have to be mindful that, you know, care is preeminent in terms of what's important and how we represent our city and who we partner with and things like this.'",
        "'speaker_2': 'So.'",
        "'speaker_0': 'Thank you. There is a there's emotionally second on the resolution recommendation that's in front of the council members was going to cast your vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Thank you. Next up is going to be item number 15. Do you want to as we go to item 15, I do want to thank the the all the employees from Molina that that came out. And they're also part of our greater Long Beach community.'"
    ],
    "Pedestrian Safety Presentation and Resolution.": [
        "'speaker_0': 'So just appreciate all of you for for being involved in that. And obviously, one of the larger institutions that we have in the city, either on the public or private side, and certainly you can get engaged in all the volunteer work they're all doing.'",
        "'speaker_0': 'So thank you very much. And with that, let me go and turn it over to item number 15.'",
        "'speaker_1': 'Communication from Councilwoman Ciro. Councilwoman, then they have Councilwoman Price recommendation to receive. And finally, pedestrian safety presentation and request city attorney to prepare a resolution to recognize October as National Pedestrian Safety Month.'",
        "'speaker_4': 'I'm sorry.'",
        "'speaker_1': 'Thank you. So it's been a very alarming and just in the past year, the the rising rates in pedestrian vehicle accidents. And I wanted to make sure that given that in the recent pandemic, many people have been encouraged to go outdoor and walk.'",
        "'speaker_1': 'And also, in light of our budget discussion, we've been talking a lot about infrastructure and making sure we have better roads. But I think that we want to I want to make sure we bring back the focus back to pedestrian and that it's really important we recommit back to our 2016 Vision Zero goal to eliminate traffic, death'",
        "'speaker_1': 'and serious injury by 2026. And in July 2020, the Safe Street Long Beach Action Plan was adopted and outlined to eliminate traffic and related death and serious injuries city wide. So I want to thank you. Public Works and Long Beach fire and police for being here to do the presentation today.'",
        "'speaker_1': 'So with that said, I'll hand it over to Mr. Hickman.'",
        "'speaker_2': 'Thank you, Councilwoman Ciro and Mr. Mayor, fellow council members. I'm Carl Hickman, city traffic engineer and acting city engineer. With me this evening, I have Deputy Fire Chief Hardin and Deputy Chief of Police Lewis. To talk about this important topic regarding pedestrian safety.'",
        "'speaker_2': 'A few facts that we do know. On the chart on the left, you can see where if there were to be a collision between a pedestrian and a car, if the car is traveling at 20 miles an hour, there's a 13% likelihood that there will be a serious or fatal outcome.'",
        "'speaker_2': 'And if a car is traveling at 30 miles an hour, there is a 40% chance that there will be a fatality or a serious injury. And it kind of makes sense as if you could go up there. You can see at 40 miles an hour, there was a 73% chance or likelihood that there will be a serious'",
        "'speaker_2': 'or fatal outcome as a result of that event. On the chart on the right. We do know that from 2013 to 2017, if you look at all the collisions in the city of Long Beach, 6% of those collisions involve pedestrians.'",
        "'speaker_2': 'And on the chart there on the far right of all the fatal and serious collisions that have occurred between 2013 and 2017, 34% of those injuries that are fatal or serious involve pedestrians as well. This is a chart of the entire city.'",
        "'speaker_2': 'It's kind of tough to see there. But for all the vehicle versus pedestrian collisions, it kind of shows you the dense area in the downtown section of the city where we have the majority of our car versus pedestrian collisions.'",
        "'speaker_2': 'It kind of, again, makes sense where you have a more dense area cars, pedestrians and a smaller, dense area, you have more pedestrian related collisions. And that data there is from 2019 to 2021. One of the important aspects about pedestrian collisions is that drivers need to be aware that they must always yield to pedestrians, whether there's a'",
        "'speaker_2': 'crosswalk there at the intersection or not. It is legal in the state of California to cross at an intersection, even if there's not a crosswalk. And drivers take a large bit of the responsibility to make sure that they're looking out for pedestrians, bicycles, scooters and whatnot as they approach the intersections.'",
        "'speaker_2': 'The drivers also need to slow down and be prepared to stop when turning or otherwise entering a crosswalk. Drivers need to stop behind crosswalks and yield to pedestrians at all times. Drivers should never pass. Vehicles stopped at a crosswalk.'",
        "'speaker_2': 'There may be people crossing that. Drivers may not be able to see. And one final note is that drivers really need to be able to follow directions from crossing guards or emergency responders. There's many times where cars enter an area that is being controlled by someone and they need to be paying attention to what's going on in'",
        "'speaker_2': 'the intersection. Following along with our drivers responsibilities. Drivers should never drive under the influence of alcohol or drugs. Drivers should always follow the speed limit, but especially when there are people on the street. Drivers should be paying attention and driving a little bit slower.'",
        "'speaker_2': 'As a commitment to our Safe Streets action plan in July of 2020. I've recently looked at, investigated and changed speed limits on 50 plus of our roadways in the city of Long Beach. So over 50 roadways. We are looking at the speed limits and reducing them by five miles an hour in an effort to make our streets'",
        "'speaker_2': 'safer. Also, drivers need to make sure that when turning on a red, they need to come to a complete stop. Look for all traffic, pedestrians and bicyclists. Folks on scooters, whatever the case may be. And then again, you know, when there's bad conditions out there on the road, hard to see conditions such as nighttime or bad weather'",
        "'speaker_2': '. Drivers need to take extra precautions. So again, these roles, ideal safety tips are the responsibility of drivers and pedestrians. So now here are some rules and safety tips for pedestrians. One of the main problems that we're experiencing is that many drivers are distracted.'",
        "'speaker_2': 'So are the pedestrians. So pedestrians need to keep your keep their eyes up, put away the phones, pay attention. Look at what's happening on the streets. You know, pedestrians need to be looking out for scooters and bicyclists as well.'",
        "'speaker_2': 'There are times when collisions happen between between pedestrians and scooters or pedestrians and bicyclists. So those are unsafe as well. Pedestrians need to look left, right and left again before crossing the street. And if there are locations where pedestrians walking, where you don't have sidewalks, make sure that a pedestrian is walking on the far left of the'",
        "'speaker_2': 'roadway. That way. The the the pedestrian is out of the traveled way and less likely to be involved in a collision with the with the driver. That syringe should not run or dart out into the street or jump out between parked cars.'",
        "'speaker_2': 'Very unsafe. And pedestrians should always make eye contact with drivers as are crossing the street. Make sure that the driver of the car sees you before you cross the street and again look out for bikes or scooters. Now we're going to move into a section of the presentation where we talk about traffic signals and what happens at'",
        "'speaker_2': 'a traffic signal when a person approaches the intersection and pushes that button to cross the street. A steady walk signals the is that green man you see there on the top. That means you have 7 to 10 seconds to get into the crosswalk to start your crossing.'",
        "'speaker_2': 'Typically, I increase that time to 10 seconds around school zones or areas where there are senior homes. Next phase of the pedestrian walk time, you'll see the hand come up and usually a time, a number that will give you the number of seconds that is left for you to cross the street.'",
        "'speaker_2': 'That's the flashing don't walk period, where a pedestrian shouldn't enter the intersection from the curb. But if he's already in the intersection, he can proceed. And finally, you have the red hand at the very bottom there that's telling the pedestrian who might be approaching the intersection not to enter the intersection.'",
        "'speaker_2': 'You're not going to have enough time to cross. And that's a big problem in the city. When I walk around, I see people who are walking against that red hand. That's a big problem in the city of Long Beach.'",
        "'speaker_2': 'The pedestrian walk. Times are determined by the road, with divided by 3.5 seconds feet per 3.5 feet per second, minus the yellow time, minus all red time. So basically the average walking person is moving at 3.5 feet per second.'",
        "'speaker_2': 'And there are cases when I get phone calls to my office where folks want more time. So I make adjustments to make sure that they have enough time to get across the street when that's when it's proper. Next, we have additional resources.'",
        "'speaker_2': 'Again, you can always look at our Safe Streets initiative that was passed by this council in July of 2020. And I wanted to point out that many of our engineering projects, as we move forward, they do contain complete streets and safe streets elements to make the streets safer for all users, that is drivers, pedestrians, bicyclists, etc..'",
        "'speaker_2': 'So we are making moves and taking giant steps to make our streets safer in the city of Long Beach. Now I welcome comments. From one of the deputies. Thank you, honorable mayor and council members. I'd like to present some of the data in regards to fire that we collected prior to this Council meeting in 2019.'",
        "'speaker_2': 'There are four we respond to 492 vehicle versus pedestrian pedestrian incidents and 347 vehicle versus biker motorcycle. 2020, those numbers did drop. Obviously, with COVID, there's a lot less traffic on the streets. And then 2021, we're on track and we had 528 vehicle pedestrians and actual vehicle versus biker motorcycles actually lower.'",
        "'speaker_2': 'And it was a 7% roughly increase in those pedestrian incidents. When you look at that heatmap, majority of our incidents were in that downtown area from ocean up to Willow or from Magnolia to Redondo, up Atlantic of all the intersections that had major thoroughfares.'",
        "'speaker_2': 'And then on the obvious, intersections such as lasco is diagonal. Santa Fe and PCH in Bellflower and Seventh Street have clusters at all those areas. Just an insight to how we operate. Any any incident that involves a vehicle versus pedestrian.'",
        "'speaker_2': 'We'll get at Charlie response which is a the closest engine or truck with a paramedic unit which has advanced life support the engine or truck and usually arrives on scene first and protects the incident and the personnel working on the incident.'",
        "'speaker_2': 'And then when the medics arrive on scene, if they determine that that vehicle is traveling over 20 miles an hour, that person is transported immediately to the closest trauma center, which for us is St Mary's Memorial. And that 20 miles an hour from reference, five or six is concurrent with what Mr. Hickman was talking about, is data'",
        "'speaker_2': 'of anything over 20 miles an hour. That 13% chance of increased injury or fatalities. That also includes the same procedure for an enclosed transport crash and significance over or greater than 20 miles an hour. And that relates to bicycles, motorcycles or scooters.'",
        "'speaker_2': 'And then if we have patients that do not want to be transported, we make a base station protocol contact and they can sign out against medical advice. Even then, we still encourage them to be transported to the local, local trauma center.'",
        "'speaker_2': 'But if they sign out, they can go with a VLF EMT ambulance or they can go by a family member. And that's all four of our.'",
        "'speaker_0': 'Vice Mayor and council. The police department is obviously an integral and important part of the city's city's overall public safety effort to reduce vehicular and as we heard already, pedestrian related traffic collision. This includes a big part of public education, traffic, engineering awareness and ultimately through enforcement.'",
        "'speaker_0': 'We understand this is a team effort in conjunction with staff and support from from other city departments, not even just sitting next to me tonight. It is important for residents and visitors to know the police department has an eye on traffic safety is in addition to in addition to standard patrol officers, the police department deploys specialized traffic'",
        "'speaker_0': 'safety personnel like motorcycle officers, DUI team and commercial enforcement officers to name a few types of personnel we have that are focused on traffic safety. All of this is in addition to staff who work with and support traffic safety efforts through the various city departments.'",
        "'speaker_0': 'Furthermore, in support of overall city effort, the police department deploys personnel in response to specific traffic complaint complaints and can include traffic safety issues in neighborhoods, business areas, entertainment areas and on large high volume roadways. In addition to the police department activities, the police department believes believe residents are a valuable piece of the overall traffic safety effort'",
        "'speaker_0': '. The police department encourages all residents to drive safely report traffic concerns while providing suggestions or input on how traffic measures can be better implemented together through these efforts. We will make a positive difference on the safety of all the residents and visitors throughout the city.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'All right. Thank you. Next, we have Councilwoman Van de Haas.'",
        "'speaker_5': 'Think. Thank you, Councilwoman Ciro, for bringing this very, very important item forward. Thank you to Carol, not only for this great presentation, but also for continuously working with my office on finding solutions for pedestrian safety. I know that's an ongoing thing, and I thank you for always being willing and open to working with my office when we'",
        "'speaker_5': 'have questions from our residents. A 2017 CD report indicated that in 2017, 5977 pedestrians were killed in traffic crashes in the U.S., which amounts to about one death every 88 minutes. Additionally, about 137,000 pedestrians were treated in emergency departments for crash related injuries that same year.'",
        "'speaker_5': 'Therefore, we are concerned not only for the loss of life that may occur during these incidents, but also for the the lack of pedestrian safety and also the health implications that come after being injured in an accident as such.'",
        "'speaker_5': 'Also, pedestrians, child pedestrians who are children, seniors and or wheelchair users are at the highest risk of being a being. We have an accident resulting in fatal. And a collision when a collision happens. It also is a matter of equity when we talk about increasing pedestrian safety.'",
        "'speaker_5': 'This is of high concern for my residents, especially around our schools. This is why I am extremely supportive of this item. And thank you again, council member Sorrell, for bringing this item forward. Yes, I think it raises the importance of having this discussion and it aligns with our city's interest in protecting and strengthening our public safety.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman Ciro.'",
        "'speaker_1': 'Yes? I wanted to.'",
        "'speaker_5': 'Thank.'",
        "'speaker_1': 'Mr. Hickman and Deputy Chief Hardin and Deputy Chief Lewis for your presentation. I think it's just so crucial. And thank you all the staff for their hard work in ensuring that everyone is safe on the street. And I just want to share that.'",
        "'speaker_1': 'While what Mr. Hickman presented isn't anything new, it's very common sense stuff.'",
        "'speaker_5': 'But I think that it's just like.'",
        "'speaker_1': 'Everyone needs to be reminded again and again, especially now as more people are on the streets walking and more people are driving as we're resuming back to working in-person again, and that we don't forget that this is a high priority issue and that we as a city have created many plans.'",
        "'speaker_1': 'In addition to the Safe Street Initiative of 2020, there's been the community of excellent nutrition, physical activity, but obesity prevention, the pedestrian plan, there's been that. And then more recently, the Cambodia Town Dry Vision plan. And a lot of these are within the highly dense area that was mentioned earlier where a lot of the accidents occur.'",
        "'speaker_1': 'And so we want to make sure we bring it back to the forefront that this is alarming. And the rates that people are being hit are almost hit. More and more people are not paying attention while they're driving and sometimes even walking.'",
        "'speaker_1': 'So that's why I wanted to make sure we recognized October as National Pedestrian Safety Month, is that we really need to recommit back to this vision plan. So thank you so much to my colleagues for your support and to staff for all their hard work.'",
        "'speaker_4': 'Thank you. Councilman Pryce.'",
        "'speaker_1': 'Thank you very much. And I want to thank Councilwoman Sara for bringing this item forward. We had the opportunity and the privilege to hear this presentation at the Public Safety Committee meeting, and I think it's a really fantastic presentation.'",
        "'speaker_1': 'It just reminds us all how important pedestrian safety is. And as I mentioned in the public safety meeting, and I'll do it again. You know, a lot of residents don't like the decisions that we make or don't make regarding traffic safety.'",
        "'speaker_1': 'But I always tell them I try. Perhaps it's just my background and profession. I try to tell people that even if you don't like the outcome or the decision, it's being made by an expert. And, you know, Mr. Heckman is I tell everyone all the time, he is an actual engineer that's required for traffic engineering.'",
        "'speaker_1': 'And sometimes I make him tell people that, too, because I think it it sets the foundation for why they should trust his opinion, why they should trust the decisions that he's making. It's important to me that when we ask people to take the direction of city staff in terms of a traffic measure or traffic mitigation measure or'",
        "'speaker_1': 'really anything, we ask the public to trust us in that. We tell them the expertize of the people. And and Mr. Heckman is a fantastic engineer. He spent a lifetime committed to the principles of traffic design and engineering, which include knowledge of physics and all the different human factors that take into account.'",
        "'speaker_1': 'When we're talking about traffic, traffic safety, this is a huge area for the city to focus on. It's no secret that I think we need a better a stronger and more populated traffic enforcement team with the Long Beach Police Department.'",
        "'speaker_1': 'I know that enforcement does not result in long term traffic mitigation and pedestrian safety, but it does provide for some directed enforcement efforts that serve as an outreach opportunity to educate drivers about the safety concerns. And our traffic division at the Long Beach Police Department has been reduced dramatically in the last ten years.'",
        "'speaker_1': 'We need to have more drug recognition experts hired by the Long Beach Police Department. We need to have more directed enforcement teams that do directed enforcement right now. I mean, I want to thank our police department. We don't have a commander.'",
        "'speaker_1': 'We have we have a commander starting this week. But in the past, the commanders we've had, you know, we've really had to beg for traffic enforcement because the resources are so limited. And again, that's a short term solution.'",
        "'speaker_1': 'The long term solution for pedestrian safety is Mr. Hickman and his team. But the short term solution, the solution that we need to remind drivers that you can't drive while you're impaired, you can't drive while you're distracted, you can't speed on especially on certain roads because it will result in great bodily injury or death.'",
        "'speaker_1': 'That's our police department. And so I really firmly believe that we need to route more money to the police department, specifically for traffic enforcement, because someone who loses a son, a daughter, a mother or father, a relative to a traffic fatality, especially by an impaired driver, that is no less of a murder than if someone is killed'",
        "'speaker_1': 'in their family because of a gun or a knife. It's still a death. It's still a major loss. It's still totally avoidable. And we need our police department to be out there educating people so that we don't lose members of our community due to impaired drivers and other factors that we can have a more active hand in'",
        "'speaker_1': '. So I thank you for the presentation. I think Catwoman's sorrow for bringing this item forth. I know that when it came to Public Safety Committee, we talked about making sure that our California Office of Traffic Safety Grants are maximized right now, that we're looking at creative grant opportunities at someone who runs that program.'",
        "'speaker_1': 'In my day job with the jurisdiction I work in, it's important for us to change up those grants every year. We shouldn't be applying for the same grants with the same language. We should be looking at ways to be creative and including things like the mobility issues, the mobility options that we see into those grant funding opportunities'",
        "'speaker_1': ', loud pipes, for example, speeding speed contests. We've seen a rise in speed contests in the region. These are things that we really should be trying to route money to, to have our police department be able to enforce. And again.'",
        "'speaker_1': 'Traffic engineering is actual real engineering. You have to trust the opinions and the decisions. Even though everybody wants a stop sign to solve every problem, that doesn't solve every problem. For reasons that our traffic engineer often shares with people.'",
        "'speaker_1': 'So thank you to our city team for being here. And I mean, I just think I'm always going to be advocating for more money to go to traffic, education, traffic, engineering and traffic enforcement, because that's what makes a difference in people's lives.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_0': 'Thank you. We have Councilwoman Mango.'",
        "'speaker_1': 'Thank you. I want to thank everyone for the presentation. I want to thank the Public Safety Committee. Pedestrian safety has been a huge concern since I was on the city council. Many of you know, my story is similar to Councilman Price's, where our issue was about a crosswalk and a left turn arrow and protection for a neighborhood'",
        "'speaker_1': 'that had had far too many accidents and pedestrian deaths. And our neighborhood association kind of rallied around a woman who was going to run for city council, hopefully. And then she backed out. And here I am. And it comes down to the safety of the neighborhoods you live in.'",
        "'speaker_1': 'And changing driver behavior is definitely one of the best ways to solve some of these issues. Installing the stop sign that nobody's going to stop at anyway are the same people who are the ones speeding, are the same people who sometimes are the ones complaining.'",
        "'speaker_1': 'And I think that it's very poignant that I had a real heart to heart with a neighbor recently who was one of the people who complained all the time about speeding. And then his wife almost took the door off of the police chief's car because she was speeding in her own neighborhood.'",
        "'speaker_1': 'So we often forget and we get rushed and we have to remind people and the only way that we can really make meaningful change is to change traffic conditions. And I think that it's also really important to remember that our traffic engineer is also really restrained by state law.'",
        "'speaker_1': 'There's a lot of state law that is in place to ensure that when a driver drives from city to city to city to city, that they can expect the same standards across all cities. They don't always know when they're crossing from one city to another.'",
        "'speaker_1': 'And it's it's difficult to make changes that are meaningful. And we appreciate all the work you do. We know how hard it is. And on behalf of the residents, we want to thank you, all of you, for all three of you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Is your public comment on this item?'",
        "'speaker_1': 'There's no public comment on certain.'",
        "'speaker_0': 'Customers or any additional comments. Looking to please members go and cast your vote.'",
        "'speaker_1': 'Careful analysis of motion is carried.'"
    ],
    "Resolution for Breast Cancer Awareness Month.": [
        "'speaker_0': 'Next to that. I'm 16, please.'",
        "'speaker_1': 'Communication from Councilwoman Allen. Councilman and I have Councilwoman Sorrell recommendation to request city attorney. Their pair resolution recognizing October as breast cancer awareness month.'",
        "'speaker_0': 'Councilman Allen.'",
        "'speaker_1': 'Thank you, Mayor. I'm very proud to introduce this resolution today, and I think it's an important gesture that our city can make. October is Breast Cancer Awareness Month, and while most people are aware of breast cancer, many forget there are practical steps that we can take to detect the disease in its early stages.'",
        "'speaker_1': 'As most of you know, I'm a breast cancer survivor. And I think that it's important that we raise awareness for this disease. I am going to take this opportunity because a really close friend of mine done a woman called me when I was in my forties and she was so persistent that I go and get a mammogram'",
        "'speaker_1': '. And it was when I look back and I think about these conversations, I thought, you know, I'm young and it was just a distant thought of cancer. But she was persistent and maybe just a good ma was speaking to her, but I wouldn't have that mammogram.'",
        "'speaker_1': 'And then I was diagnosed with cancer and I went on to have a double radical mastectomy. And breast cancer is the most common cancer and the second leading cause of death in women in the United States. The chance of a woman having breast cancer sometime during her lifetime is about one in eight.'",
        "'speaker_1': 'And early onset of cancer, which is women under the age of 45, is one in ten. Breast cancer is very common, but it's also preventable. So today I'm asking the city to recognize October as Breast Cancer Awareness Month and help our residents to be more informed and better prepare to prevent, manage and survive breast cancer.'",
        "'speaker_0': 'Thank you, councilwoman, councilman and engineer.'",
        "'speaker_5': 'Thank you, Councilwoman Allen, for bringing this item forward. I really respect and admire your passion and advocacy on this matter. As a breast cancer survivor, my sister is also a breast cancer survivor. And I just want to say I stand with you in this advocacy to raise awareness about breast cancer.'",
        "'speaker_5': 'I think it is very important that we all understand the importance not only within women, but also within men, because everybody has moms and daughters and sisters. And so I'm happy to support this item with you.'",
        "'speaker_0': 'Councilmember Granger.'",
        "'speaker_2': 'Thank you. And I want to. Think of the people who brought this forward of. I used to bring this forward a couple of times when I first started in the city council because my wife is a breast cancer survivor and I wanted to make sure that the message would get out to individuals to please, please, please.'",
        "'speaker_2': 'Get yourself examined. Get a press or get a test because your best way to fight it is when you catch it early in my way. We're fortunate in that you caught it early and didn't have to go through the major type of surgeries that other people have gone through, like my colleague in the islands.'",
        "'speaker_2': 'And, you know, thank you for bringing that forward and making people aware that this is a very important health issue and that people should continue to get the get tested. Very happy to support.'",
        "'speaker_0': 'Thank you, Councilwoman Sara.'",
        "'speaker_1': 'Thank you, Mayor. I want to thank Councilmember Allen for bringing the item forward and that I also stand with her and all of the those who have survived breast cancer, as well as wanting to honor those who had passed from breast cancer as well.'",
        "'speaker_1': 'And that this is an important month where it's, you know, if you're not scheduled to get tested is a good time to make sure you do and that it's on a regular basis. And just that it's never. It's always important to do education on this.'",
        "'speaker_1': 'So thank you so much.'",
        "'speaker_0': 'Thank you. And Councilman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I, too, want to thank Councilwoman Allen and the COSIGNERS for bringing this item forward. And also, I just really want to thank Councilwoman Allen for sharing so openly and honestly about her personal journey with breast cancer.'",
        "'speaker_1': 'I think her allowing herself to be vulnerable about that will hopefully allow a lot of people to to take, you know, to kind of heed that advice and and do what they need to to make sure they're safe.'",
        "'speaker_1': 'My mother was a breast cancer survivor. She is currently surviving breast cancer because her cancer came back a few years ago and she has metastasized breast cancer. But we have amazing medicine today and amazing doctors and nurses at the City of Hope, where we go as a family to get her treatment.'",
        "'speaker_1': 'And as a result of that and all of the research that's been done in the area of breast cancer, my mother is still hanging in there and, you know, feistier than ever with her four years in taking the current daily medication that she takes.'",
        "'speaker_1': 'And so I'm proud of the efforts that the leaders throughout this country have done to support policies to advance the science in the area of breast cancer and super proud to serve on a board with so many women for whom this disease is incredibly significant.'",
        "'speaker_1': 'And with at least one of those women has shared her personal story, having touched been touched by this personally. And so I appreciate that. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, is there any public comment on this? And please cast your votes.'"
    ],
    "Agreements with Centro CHA, Inc. to occupy spaces at Jenny Oropeza Community Center and Long Beach Senior Center.": [
        "'speaker_0': 'Adam 19.'",
        "'speaker_1': 'Report from.'",
        "'speaker_0': 'Perth. There's been a request on item 19 for a short presentation.'",
        "'speaker_1': 'Please report from Parks, Recreation and Marine recommendation to execute agreements with Central Asia to occupy Room 112 at the General Officer Community Center at Cesar Chavez Park and Suite one, or for A, B, C, D and E at the Long Beach Senior Center Districts one and two.'",
        "'speaker_2': 'Thank you, Mr. Mayor. We're very excited to be here today with these two agreements that support a wonderful partner in our nonprofit community center. And I'll give it to Brant to talk a little bit about what these two items are.'",
        "'speaker_2': 'Thank you, city manager. Good evening, Honorable Mayor and council members. I think on the coattails of last Tuesday's significant community support for the Latino Cultural Center and also naming Central Cha as the lead not for profit to move that project forward.'",
        "'speaker_2': 'I think our department and citywide are continuing that partnership in a very supportive way. We have two operational agreements before you this evening. One is within Cesar Chavez Park at the center. Basically giving center some office space and underutilized corner of that facility.'",
        "'speaker_2': 'It is for a period of five years with the possibility to add two additional five year periods. And I think long term the purpose of that was once the Latino Cultural Center is identified, that a more permanent home would be located within that facility.'",
        "'speaker_2': 'The other realization is Central CHA continues to provide significant community services and they do utilize the Jennifer Payson Center as a home base for a lot of the programs they deliver. The accompanying agreement, operational agreement, is again realizing that Central Cha, a new headquarters building on Atlantic Avenue, probably to be completed within the next 12 to 18'",
        "'speaker_2': 'months. They'll be utilizing some office space at the Fourth Street Senior Center that's recently been vacated with the relocation of Partners of Parks over to the Recreation and Parks Administrative Building in Eldorado Park. So and that again, is of a more temporary nature, realizing that probably within the next year to two years that they would be relocating'",
        "'speaker_2': 'back over to the Atlantic facility. So with that, I'm available for any questions that you might have. Thank you.'",
        "'speaker_0': 'Councilman's in the house.'",
        "'speaker_5': 'Thank you, Mayor. I'm so excited for Central to having a space in our Jenny Oropeza Community Center at our beloved Cesar Chavez Park Central Chantelle's amazing work in the community. And that is a big, big thing for our community and for our residents.'",
        "'speaker_5': 'They really thrive off of being able to have central trust so close to them. So I really think central time for all the amazing work that you do and that you provide for for our communities, especially for our communities that are hard to reach, especially for those communities that are the most in need.'",
        "'speaker_5': 'So thank you from the bottom of my heart. And I'm just so glad that we were able to work together as a city. I really want to thank city staff for all their amazing work and their willingness to collaborate and make this make this agreement possible for Central Time.'",
        "'speaker_5': 'I also want to give a huge thanks to our Parks and Rec and Marine staff, especially to Director Denis, who was able to see the need that central chair had for for space and was able to to provide this space and work with them.'",
        "'speaker_5': 'And your willingness to always provide for the community is just amazing. So thank you very much for your collaboration with this and for realizing that this is a community that really, really, truly needs these services. And that tenure piece is the journey out of business center is the right place for them.'",
        "'speaker_5': 'So thank you again to everybody who made this possible.'",
        "'speaker_4': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. Just completely support this item. It's just great to have a partner with Central try and with just this great community organization. And I also look forward to having your offices in the second District, at least for a little while.'",
        "'speaker_1': 'Congrats.'",
        "'speaker_4': 'I thank you. I look at my comments here. I think every time we're able to figure out partnerships with community based organizations to provide services, it's a great outcome. We see that in North Long Beach with what's happening with Camp Fire.'",
        "'speaker_4': 'We lost our after school program services. Camp Fire was able to come in and help out. Conservation Corps has moved in and has reactivated that space, and I have no doubt that central charge is going to have a tremendous impact on the park and the broader community.'",
        "'speaker_4': 'So congratulations to everyone. Councilwoman Zoro.'",
        "'speaker_1': 'Yes, thank you. I wanted to express my support on this item and that I know that when center to finish building their facility in the sixth district, they'll be circling, spreading their resources in this variety of areas and then coming back home to the sixth district.'",
        "'speaker_1': 'So thank you very much.'",
        "'speaker_4': 'Thank you. We have one public comment, Jessica Quintana.'",
        "'speaker_1': 'Thank you so much. Good evening, everyone. On behalf of Center Child, this is just truly an exciting time, a moment for us to demonstrate this, this partnership with the city of Long Beach. Once again, I know we were here last week and I lost all my colleagues and crew because tonight's the Dodger game.'",
        "'speaker_1': 'And so they're all here in spirit and they should just get you go. We'll be here in spirit. But you know, this this truly really solidifies and advances, you know what we're all saying in our community and to promote and expand public benefits for our community members.'",
        "'speaker_1': 'You know, prior to the pandemic and currently now with the economic recovery, we've seen more of a higher need within our community to have access to benefits and services. And so we just want to thank our partner, Brant Dennis and the city manager and the city council member team and everybody at Parks and Recreation for being so'",
        "'speaker_1': 'supportive and welcoming us to the space. We truly appreciate that. You know, it's a lot of people don't know the story, but I moved to Long Beach in 1964. We moved on fourth and main. And so I grew up here in the city.'",
        "'speaker_1': 'And, you know, I have three folks who who inspired me throughout my life. One was also Travis. I had the opportunity to march with him when I was only 15 years old. He came to Long Beach and we marched to Wilmington.'",
        "'speaker_1': 'And we all know he's a labor leader and a civil rights activist. And so through working at the center of Back in the Day with Professor Armando Vasquez, who was here last week, we were boycotting grapes up and down Anaheim market, you know, and we had the opportunity to march with Cesar.'",
        "'speaker_1': 'Then the next inspiration of my life, who inspired me to do the work that I do, is the three folks who are memorialized. Associate Chavez Park is Jenny Oropeza. So Jenny, as you know, was the first Latina on city council and then went on to be our state senator who fought and championed for the quality of life'",
        "'speaker_1': 'for women, children in our communities. And then maybe a lot of folks may not know him, but there is a bench that's memorialized for John Northmoor. And John Northmoor was an advocate on behalf of youth. He's the one that brought things post to our city, into our community.'",
        "'speaker_1': 'And so I was a youth growing up in Long Beach with the first team post that was in West Long Beach. So I have the honor and privilege to go back to the area and really, you know, inspire my community and provide community benefits with three of the most influential leaders who made a difference in my life'",
        "'speaker_1': 'in the work that I do to provide services. And our community center, Chuck, for years have been in the city for over 25 years. We have an infrastructure that has brought many, many, much needed services to the community and bringing millions of dollars to the city of Long Beach and we're going to provide legal services were a'",
        "'speaker_1': 'part of Immigrations Appeals Agency and we'll be providing immigration, legal services, business development and workforce development services. And then we come with so many partnerships. We focus on job training and workforce development and have contracts with the Long Beach City College and other institutions for certified training.'",
        "'speaker_1': 'So we're just so ecstatic for the the excitement for this partnership and to provide services to Cesar Chavez Park and at the senior center. So it benefits so much. I know I'm over my time, but thank you, everybody.'",
        "'speaker_1': 'It's truly privilege. An exciting day for for center time for myself.'",
        "'speaker_4': 'Fantastic. Thank you. Members, please cast your vote.'"
    ],
    "Takeover Agreement with Nationwide Mutual Insurance Company for Alamitos Beach Concession Building Project.": [
        "'speaker_2': 'Motion here.'",
        "'speaker_4': 'Thank you. 21, please.'",
        "'speaker_2': 'Recommendation to approve and authorize city manager? Or do you need to execute a takeover agreement with nationwide mutual insurance company to complete construction of Alamitos Beach Concession Building Project District two.'",
        "'speaker_4': 'Thank you. I don't believe there's a staff report. Here's any public comment on this item.'",
        "'speaker_2': 'Yes, there is one of them. I would surely. It, actually.'",
        "'speaker_4': 'All right, S.A. Public Comment members, please cast your vote.'",
        "'speaker_1': 'You know, I have a comment.'",
        "'speaker_4': 'Go for it, Councilmember.'",
        "'speaker_1': 'Thank you both, Mayor. I just want to say real quickly, I mean, I was definitely disappointed. When you see exciting projects like this that get delayed due to the contractors and I was walking by this location regularly and as excited to see it going to get it to get it opened.'",
        "'speaker_1': 'But I do know the city has made every effort to engage with the contractor and address certain issues, and the contractors have just been unable to meet the deadlines and complete the job on time. So I just want to say thank you to Eric Lopez.'",
        "'speaker_1': 'Thank you to our public works team for moving quickly and bringing forward a takeover agreement on this. I support moving forward this agreement and look forward to a completed concessions and quickly. So thank you for all the work that you're done that you've done.'",
        "'speaker_1': 'And I know the community is excited to finally get this completed.'",
        "'speaker_4': 'Thank you. Council members. Members, please vote.'"
    ],
    "Ordinance to comply with SB 1383 on organic waste methane emissions reduction.": [
        "'speaker_2': 'Emotions carried.'",
        "'speaker_4': 'Thank you. 22, please.'",
        "'speaker_2': 'Recommendation to request city attorney to prepare an ordinance amending the Long Beach Municipal Code to comply with the state mandated legislation. Senate Bill 1383.'",
        "'speaker_4': 'Or their second on this motion is moved and seconded. There's one public comment. Shukla.'",
        "'speaker_2': 'Good evening. Mayor and City Council. I'm here this evening to speak in favor of this item and urge your support for it. I'm aware of the study session that already occurred on August 3rd and the the memo that came out a couple of months before that was an item that dovetails with current explorations to replace the search'",
        "'speaker_2': 'plant, our local trash incinerator, which at present does not have the physical infrastructure, the sewer hookups for anaerobic digestion, so that a pathway for meeting the demands of the SB 1383 is going to be off the table before its enforcement time.'",
        "'speaker_2': 'The main thing that I'd like to ask this evening, since it didn't cover the question, is when the city, like the city of L.A., is going to have a zero waste policy and adopt a zero waste set of goals, the easier to talk about if we knew when the Climate Action Adaptation Plan was happening.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you, members. Please cast your vote.'"
    ]
}