{
    "Ordinance to Amend Use District Map from CCA to CCN. (District 2)": [
        "'speaker_4': 'We do have one hearing. So let's go ahead and hear the hearing, please. Which is item which is item 13?'",
        "'speaker_1': 'Item 13. Report from Development Services Recommendation to receive supporting documentation into the record. Conclude the public hearing and determine the project. 23 for sale market rate townhomes at 2200 through 2212 East seventh Street 600 through 620 Dalton Avenue and six $21 Avenue is within the scope of the project and warrants no further environmental review pursuant to secure'",
        "'speaker_1': 'and declared ordinance approving a zone change. Read the first time and lead over to the next regular meeting of the City Council for Final Reading District two.'",
        "'speaker_0': 'I'd like to introduce I'd like to introduce Oscar Orsi, Development Services Director, to kick off this presentation.'",
        "'speaker_5': 'Yes, thank you. Good evening, Mayor. Members of the City Council. The following is a public hearing. The following public hearing is a request to approve a zone change for 23 townhomes located within the Rose Park neighborhood. Ms.. Patricia Defender will provide a presentation.'",
        "'speaker_1': 'Good evening, Mayor. Vice Mayor. Council members. As mentioned the item before you is a request for a zone change from. Pardon me. Is a zone change from the K zone, which is the commercial community commercial automobile oriented zone to the CNR zone, which is the commercial residential community are for and C can zone.'",
        "'speaker_0': 'Oops. Pardon?'",
        "'speaker_1': 'The location of the proposed zone change area is 2202 2212 East Seventh Street and 600 to 620 Dawson Avenue. The current zoning is the key zone in the CNR zone. The site is a 0.78 acre site and currently developed with a parking lot.'",
        "'speaker_1': 'The subject area is designated by the general plan as the neighborhood serving centers and corridors. Moderate general plan, place type. The surrounding context is a mix of commercial institutional uses as well as some other. Some family. Some residential uses on the West Side.'",
        "'speaker_1': 'On January 21st, the Planning Commission held a public hearing on this item and recommend took the following actions. It recommended that the City Council approve the zone change. It also approved a site plan review, investing tentative track map and administrative use permit associated with the project.'",
        "'speaker_1': 'Final approval of the project is contingent on a zone change. There were a total of 17 comments received on the proposal. 14 letters of support, three letters of concern, concerns related to issues of crime, parking and displacement of the current community.'",
        "'speaker_1': 'The so we talked about the current zoning and the proposed zoning would be consistent with the general plan, land use place type of neighborhood serving commercial center and corridors. And as a result, that's the general plan. Land use element did identify this area as a major area of change to accommodate mixed use development and the needs for'",
        "'speaker_1': 'housing in the in city. And this zone change proposal would be consistent with that place type just by way of some background, even though the project specifically is not before the council. The project is a 23 unit for sale townhome project.'",
        "'speaker_1': 'That would be three stories in height. It has some gas parking styles that are located off side across the street. It does meet all the open space and other development standards. There was an environmental compliance checklist to the program Environmental Impact Report for the land use element prepared for this project, and it was found to have adequately'",
        "'speaker_1': 'analyzed the impacts which were previously analyzed in.'",
        "'speaker_0': 'The earlier air.'",
        "'speaker_1': 'And there would be no further impacts that have not been analyzed and no further environmental.'",
        "'speaker_0': 'Review is required.'",
        "'speaker_1': 'So with that, the recommendation is that the City Council determined that the project is within the scope of the previously analyzed air and declared ordinance to approve the zone change from the CCR to the end zone for the subject area.'",
        "'speaker_1': 'That concludes the staff presentation. Happy to answer any questions.'",
        "'speaker_4': 'Thank you. We will go. I don't see. Is there any public is there any other comment on this? Let's go to and go to that first. There might be, too, I think.'",
        "'speaker_5': 'But Mr. Mayor, we also have the applicant. And if you want to start with the applicant.'",
        "'speaker_4': 'Sure. What's going to hear from the applicant?'",
        "'speaker_5': 'Matt Hamilton.'",
        "'speaker_2': 'Hi, this is Matt Hamilton, the project applicant. Just wanted to thank staff for all their efforts in getting us to this point. We're excited to move forward with the project and happy to answer any questions you might have.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. We have one public comment. Derek Burnham.'",
        "'speaker_2': 'Hi. Derek Burnham with the applicant's team as well. Just, just wanted to reiterate Matt's comment that we are happy with staff moving this forward and look forward additional support tonight and are excited to build this project.'",
        "'speaker_4': 'Thank you. Turn this over to Councilman Allen, who got a motion.'",
        "'speaker_0': 'I thank you, Mayor. This is a very exciting project and a welcome addition to our Rose Park neighborhood. I strongly support the project and the zone change that is required. This project advances our land use goals and adds to the city's housing stock.'",
        "'speaker_0': 'And most importantly, the project is supported by our community. I know that there are several letters of support, including letters from the Rose Park Neighborhood Association. And in May those folks have been in close communication with my office.'",
        "'speaker_0': 'So just think. Thank you for all of your reaching out. I do appreciate that this is a much needed project and I know that we are all looking forward to the revitalization of this space. I would like to give a special hats off to the owner and developer Matt Hamilton, who was really exemplified how a developer should'",
        "'speaker_0': 'work with the city and the community on a particular project. He has prioritized community outreach and developed a really good relationship with them, with our residents. I know the people in the neighborhood know him. He has addressed each of their concerns and even offered space, outdoor space during the pandemic.'",
        "'speaker_0': 'So I congratulations, Matt, on a great project. I know that you have spoken to my staff and I look forward to speaking with you and meeting with you as well in the near future. I want to give a special thank you to Eric Lopez and the public works team for all the work on this project and seeing'",
        "'speaker_0': 'this come to fruition. And and just on a separate note, I know that many of our neighbors, our neighbors in Rose Park continue to express concerns about the traffic and the speed along Seventh Street. So we'll continue to work with that and address that.'",
        "'speaker_0': 'So, again, congratulations and thank you for everyone that worked on this project.'",
        "'speaker_4': 'Councilwoman. I can have a second, please, on Councilwoman Allen's motion. I have a second buy comes from Ringo. There is no additional comment. We will go to roll call. Vote, please.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Councilwoman Allen. I can swim in price. I councilman's up now.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilwoman Sara, I council member oranga. By Councilman Austin. Vice Mayor Richardson, motion carries.'"
    ],
    "Renaming of Houghton Park Community Center.": [
        "'speaker_4': 'Thank you. Number 20.'",
        "'speaker_1': 'Item 28 Communication from Vice Mayor Richardson, Councilwoman Sara, Council Member Oranga and Councilman Austin. Recommendation two referred to the Parks and Recreation Commission and the Government Personnel and Elections Committee to consider naming of the newly renovated Halton Community Center complex.'",
        "'speaker_1': 'The doors topsy over community center and recommend city manager to identify additional sites of significance to the African-American community for the purposes of historic preservation.'",
        "'speaker_4': 'Vice Mayor Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Today, I'm proud to present to you a proposal for naming the newly built and renovated community center complex after mother doorstops. Before I begin my comments and share short video and acknowledge a few people, first six Bishop Council members who we sorrow.'",
        "'speaker_2': 'Seventh District Council Member Roberto Ranga. And Eighth District Council member Al Alston also acknowledge the steering committee members former ninth District Councilman Steve Miele. Steve and Jackie Topsy. Cecily Harris Walters. Sharon Biggs. Jackson. Marcus Tyson, Anita Dempsey, Michelle Dobson, Joanie Riggs, Odie and Wayne Chaney.'",
        "'speaker_2': 'Also want to thank the more than 70 community members who have signed on in support of this effort, including community community leaders like Mayor Beverly O'Neal, amid Sophia Fear, Bixby Smith, Carl Kemp and others, faith leaders including Pastor Gregory Sanders, Bishop Todd Irvin and Dr. Lee.'",
        "'speaker_2': 'Our word in our families neighborhood associate neighborhood leaders, including former ninth District Council member Val Lerche and press birds and the presidents of many of our ninth District neighborhood associations. I also want to thank the elected officials who took time to send in letter support today.'",
        "'speaker_2': 'Congressman Alan Lowenthal. Representative Annette Barragan. Senator Lena Gonzalez. Assembly Member Mike Gibson. Supervisor Janice Hahn. Thank you so much for those letters of support. And finally, thanks to the Long Beach TV team who helped put together the video we're about to see.'",
        "'speaker_2': 'Dennis Hunter, Nadia and Ed did a great job. And so to introduce this Mayor Topsy over mother doorstops, Joubert served as the first African-American woman on a Long Beach City Council. She was our first African-American harbor commissioner and a two time vice mayor right here in the city of Long Beach.'",
        "'speaker_2': 'And she's a mentor to many of us and said paved the way for many of us here in leadership. The name of the new community center housing park after this living legend is a true honor for our community.'",
        "'speaker_2': 'And it recognizes her legacy, her contributions and 35 years of public service to the entire city of Long Beach. She's recognized and affectionately called mother for many great reasons, the new community center complex. The site is designed to be a park that embodies the very things that she valued by community and youth and equity and improving the'",
        "'speaker_2': 'quality of life to residents. It also provides programing which are core tenets of her legacy programing for our communities, youth, seniors and social needs. I will continue. There's much more than I can say, but we put together a great video to share.'",
        "'speaker_2': 'And to be clear with this, we need to do a better job citywide and these conversations come up. We need to do a better job ensuring that our assets and our our public facilities reflect the cultural diversity of our of our community.'",
        "'speaker_2': 'And so this does not preclude Mother Doris from being recognized even for in other areas of town and or anyone else. And I think the second part of this motion really speaks to us being intentional about updating our our citywide historical context statement and going through a process of identifying all communities that are underrepresented through these processes'",
        "'speaker_2': 'to make sure that they can also be reflected in our naming process, the city wide. So that's it. I'd like to go ahead and share the view. Hi, I'm Long Beach Vice Mayor Rex Richardson, and welcome to a very special edition of Go Long Beach.'",
        "'speaker_2': 'We are here at the Houghton Park Community Center, right in the heart of uptown Long Beach. It's a great regional park that offers services and amenities to teens and seniors for our entire community. And I'm here to share with you a great proposal to name our new center after living legend and trailblazer Doris Topsy over mother Doris'",
        "'speaker_2': '. His legacy is that of community, of public service and of equity, all things that we value right here in the city of Long Beach. And for that reason, she's deserving of this distinction and honor. But you don't have to take my word for it.'",
        "'speaker_2': 'Let's hear from some.'",
        "'speaker_5': 'Folks who are closest to Mother Doris on what.'",
        "'speaker_2': 'Makes her so special to the city of Long Beach.'",
        "'speaker_0': 'Vice Mayor Doris Topsail Ward is an amazing woman who gave generously of her time and talents.'",
        "'speaker_3': 'Doris is truly one of the most wonderful, caring, civic minded people that I have ever met in my entire life. Doris is a community person at heart. She's been my best friend, my teacher, my mentor.'",
        "'speaker_0': 'Doris is warm, she's generous, she's loving, and she's my mom.'",
        "'speaker_3': 'Anybody that says has anything to say about it and there's nothing but kind words because that's the way she is. Even before I met her in person, I met her in the pages of this book that I'm holding in my hand, which is the 1949 Saint Anthony yearbook.'",
        "'speaker_3': 'You will see that not only were you a leader, you were a scholar. You were an athlete. There's a picture in here of Dorothy leaving a social group of students that were providing food and supplies and clothes to people who are in need in Yugoslavia.'",
        "'speaker_3': 'Doris was the first African-American student at seniors in high school. You opened the door for so many other people of color that followed you and emulated you and all that you were able to do. You're in the city of Long Beach.'",
        "'speaker_0': 'The 1992. She won her bid for becoming the first African-American woman to the Lombard City Council. And then she was elected as the vice mayor. So to know her is to know a woman of integrity and a woman that kept her promises.'",
        "'speaker_0': 'She saw the need within several underserved communities, the children in the community like the midnight basketball games. That was one of them, to keep the kids off the streets at night from getting in trouble. She was the founder of the King Parade.'",
        "'speaker_0': 'She also helped to put a cover on the pool at the Kings Park, too. She went to Washington to look for that money, for that project.'",
        "'speaker_3': 'So she was she was made the vice mayor. And after that, she left the city and went to the poor. I think her addition to the Harbor Commission back then was a new day in that we had a true person who really had a good perspective of community engagement to really have credibility in terms of addressing the'",
        "'speaker_3': 'very legitimate environmental issues that we had to address by back then. When that became known as the Greenport policy, Doris was very supportive in that obviously there was a commitment to address the environmental questions that we had to address, but it was more than that.'",
        "'speaker_3': 'It was also a commitment to engage with the community. You know, today in the year 2021, we're still talking about equity and inclusion. She was a great contributor to making sure that we're also going to lead in terms of diversity, in terms of the workforce and what our commitment was.'",
        "'speaker_3': 'For me, I can't wait to visit and see the community center with the name Doris Top Children. You deserve a Doris. I can't think of another person who's more deserving to have a community center named after them than you are.'",
        "'speaker_3': 'You truly have been at the center of the heart of this community your entire life.'",
        "'speaker_0': 'We thank you for loving us and embracing us as family. We want all of the community to know of your generosity to the city of Long Beach.'",
        "'speaker_3': 'You are so I love you. And I would not be where I'm at today if it wasn't for you. And that goes for everybody that has worked with her and helped her. Always been proud of you. You know you are everything you deserve.'",
        "'speaker_3': 'Whatever you got, come on. Because you've always been there for me.'",
        "'speaker_0': 'I hope that everyone in Long Beach will learn something of you as we go on through time, especially the young people in our communities.'",
        "'speaker_2': 'She's truly deserving of this honor. And now I want to share with you more about the future of Highland Park right here at Highland Park. We are reimagining the way we deliver services to our broader community. We are integrating a workforce center, a health care clinic, a new signature playground, and plans to restore the original building and'",
        "'speaker_2': 'build a brand new indoor gym to serve the youth of our community. So that's what's happening at Highland Park. I'm Vice Mayor Rex Richardson. I want to thank you for watching. Go Long Beach. Thank you. Thank you. I'm happy to make the motion and.'",
        "'speaker_2': 'Yeah, thank.'",
        "'speaker_4': 'You. Thank you. There's a motion on the floor and I have a second by Councilman Ringo. Contrary.'",
        "'speaker_3': 'Ringo Thank you, Mary. And I want to thank Vice Mayor Richards for bringing this forward. Before Doris was my friend and collaborator, she was my opponent. We ran against each other in 1988. That's how far I go back with her.'",
        "'speaker_3': '32 years, 33. We ran for school board. We neither of us won, but we became close friends almost, almost immediately from then on. And she became very close in my career. As I move forward to see you all meet, she became a commissioner in the Civil Service Commission who for whom I worked and I was actually under'",
        "'speaker_3': 'her leadership. I became the recruitment officer, which I always talk about in the city. It was through her leadership that I got there, and of course the rest is history as city council vice mayor or commissioner. And I was glad to see Ralph in that very nice mayor because I haven't seen Ralph in a long time.'",
        "'speaker_3': 'And we are stories with that. So more than happy, very pleased to support this item and looking forward like everybody else to the naming of the community center for Vice Mayor Gore stops. He retired.'",
        "'speaker_4': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor, and I am excited and honored to sign on in support of this item. I want to thank my colleague, Mr. Richardson, for bringing it forward as well as the my other colleagues for signing on.'",
        "'speaker_2': 'This is a real honor for a true trailblazer and somebody who is well deserving of a name. I want to just say this is a special proposal for a very special person. She's a civic leader who is truly an icon in our city and particularly the black community.'",
        "'speaker_2': 'She was the first black woman to serve on the city council. She did so honorably. She represented our district in a in a strong manner. She was the first person to really introduce the idea and the concept of equity.'",
        "'speaker_2': 'If you know Mother Dorothy and you know that lives she impacted the city employees through the careers that she has has helped foster through her leadership. It is amazing. It's an amazing story. And, you know, I don't think I have time to die within my time, so to speak, on all of those accomplishments.'",
        "'speaker_2': 'But there are countless number of individuals who can step forward and tell you of the influence that she's had on their lives, their careers and families throughout the city of Long Beach. Our contributions in our city are broad and deep, and they go well beyond her service on the city council as an elected leader.'",
        "'speaker_2': 'They go beyond her service as the harbor commissioner and vice mayor. She she is somebody who has given, as we mentioned, the student at Saint Anthony. She was engaged, involved. She was a young leader and has been a public servant really all of her time in the city of Long Beach.'",
        "'speaker_2': 'And so I'm I'm honored to sign on to this. There's a bit about Doris that was left out here, too. I just want to just commend her for her constant. Commitment to celebrating and preserving history. She was the founder of the African American Heritage Society, along with the late Indira Hale Tucker that is currently in existence still'",
        "'speaker_2': 'at BURNETT Library. And there still is an organization that is very active and relevant in our city today. And personally, Dorothy has always been a great sounding board, a mentor, someone who cares deeply about this city and shares the history I have.'",
        "'speaker_2': 'I consider she is a neighbor who lived within walking distance. I was watching March Madness a couple of weeks ago with her on Saturday at her home, watching basketball games and chatting it up and always getting nuggets of advice, but also understanding of the rich history in our city.'",
        "'speaker_2': 'I think that's very, very important for all of us as leaders to have somebody like that to bounce ideas off of, but also to get advice from as well. And I just appreciate the relationship that I've personally been able to have with her and her family.'",
        "'speaker_2': 'I'm glad to call her one of my favorite eighth District constituents and neighbors, and I'm proud to sign on in support of this this wonderful item. Congratulations, and thank you for bringing it forward, Vice Mayor Richardson.'",
        "'speaker_4': 'Thank you, Councilwoman Sara.'",
        "'speaker_0': 'Thank you, Mayor. I want to thank Vice Mayor Richardson for his leadership on this item, as well as all those who submitted letters of support and supporting this item, as well as by council member Yarrawonga and Austin. And I enthusiastically support the naming of Doris Topsy Alvord Community Center while she was a former Long Beach Council District'",
        "'speaker_0': 'Council member. Ultimately, she's a city of Long Beach civic leader and an important figure for many young women of color that looks up to her, such as myself. So she's more than deserving of this honor. And just as the first Cambodian woman council member, I look up to her as a trailblazer in setting the foundation and pathway'",
        "'speaker_0': 'for our many leaders. And I truly believe that the naming of our building should be reflective of leaders and people in our city. And so I'm certainly supportive of identifying additional sites of civic significance to the African-American community and all other underrepresented community for the purpose of historic preservation and landmarking and inclusion in our updated citywide historic'",
        "'speaker_0': 'context statement. So for that, I again just I'm so glad to see this moving forward, and I'm just really happy to help in any way I can. Thank you so much.'",
        "'speaker_4': 'Thank you. We'll go ahead and take a roll call vote on this, Madam Clerk. And as we do so, I just want to also just congratulate everyone, then Vice Mayor Richardson and everyone that signed on to do this effort.'",
        "'speaker_4': 'Of course, Vice. As we know, our mother, Doris, but Vice Mayor, Doorstop Silver is a legend really in our history and in really in present time as well. I think the one thing that was said that I just want to add to is, ah, her influence and really leadership within the African-American community is something that's very lasting'",
        "'speaker_4': 'and that our our black community, our black leadership for African-American, our history has so much in her work. And so I'm grateful to be supportive. But also just want to thank all of you for bringing this forward as well.'",
        "'speaker_4': 'So real.'",
        "'speaker_2': 'COLBERT This.'",
        "'speaker_1': 'Councilwoman Cindy has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Allen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabrina.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman Mango. I can swim in Zara. I council member Tauranga. I can swim in Austin. Vice Mayor Richardson. All right. Bush and Kerry's.'"
    ],
    "Transfer of Pier H and Queen Mary to Harbor Commission.": [
        "'speaker_4': 'Great. Thank you very much. Item 18, please.'",
        "'speaker_1': 'Item 18 Communication from Councilwoman Allen, Councilwoman Zendaya's and Councilwoman Price recommendation to discuss the possible transfer of the Operation and Control Pier eight from the City Council to the Harbor Commission.'",
        "'speaker_4': 'Great. Thank you. Let me turn this over to Councilman Allen.'",
        "'speaker_0': 'Thank you, Mayor. I am proud to introduce this agenda item and explore the possibilities of transferring power to the Harbor Commission. I want to make sure that the discussion is public and transparent. And tonight's discussion is a first step to beginning these transparent conversations.'",
        "'speaker_0': 'Public engagement is going to be key. And this process. Staff will come back with a report with detailed recommendations as well as next steps. I would like to thank my colleagues, Councilwoman Pryce and Councilwoman Cindy Haas, for signing onto this item.'",
        "'speaker_0': 'And also just a special thank you to Councilwoman Price for all of her efforts over the years on this on this topic. I believe that our harbor department is well equipped and experienced to handle leases and development on the pier on the piers.'",
        "'speaker_0': 'I also transfer locally appointed harbor commissioners to represent our community's best interests. Our city attorney has carefully looked over the legality of this discussion, and he says that there are no legal impediments to the discussion. I have also talked to up to the hotels and the event venues on here H and a question they have is how'",
        "'speaker_0': 'specifically the city and the harbor will manage their permits and developments, inspections and just other items related to the hotel and the event uses uses. So I would please request and kindly ask that staff include this in the report and work with the hotels and the event venues.'",
        "'speaker_0': 'I look forward to hearing back with more information on the analysis in 60 days. Thank you very much.'",
        "'speaker_4': 'Thank you, Councilwoman. Councilwoman Price.'",
        "'speaker_0': 'Thank you, Mr. Mayor. And I want to thank Councilman Allen for bringing this forward. It's been a true pleasure to get to work on the issues surrounding specifically the Queen Mary and the site with her since she joined the council.'",
        "'speaker_0': 'And I want to commend her on how proactive as she has been on this topic. And again, it's been it's been a true pleasure for me to work alongside her as we think about the future of of the ship and, of course, the land around the ship.'",
        "'speaker_0': 'And the one thing I wanted to ask is I just wanted to ask counsel our staff, as we move this project over to the harbor department, I just want to make sure that the stakeholders that are in that area are consulted regarding future developments and just make sure that they have a seat at the table in terms'",
        "'speaker_0': 'of what future development of Pier H can look like, what type of uses, because I just want to make sure that we're being as creative as possible. I think we all understand that that is a very, very valuable city asset and we want to see it realized to its fullest potential.'",
        "'speaker_0': 'Not just the ship, but the land is really what I'm talking about. And I hope that Councilwoman Allen is okay with that. I just want to make sure that the stakeholders have a seat at the table in terms of potential development opportunities and partnerships.'",
        "'speaker_0': 'And that's all I wanted to share.'",
        "'speaker_4': 'Thank you. Let me go to I believe we have one member of the public. They want to speak.'",
        "'speaker_5': 'Yes, we have Michelle Grubbs.'",
        "'speaker_0': 'Hi. Good evening. Good evening, Mayor. City Council members. My name's Michelle Grubb, and I'm the vice president of the Pacific Merchant Shipping Association. Operation of the Queen Mary for the last 29 years have passed through multiple organizations, resulting in disappointment, bankruptcies and failure.'",
        "'speaker_0': 'Now, almost 30 years later, the city wants to transfer it back to the port with an estimated repair cost of $289 million. The audit report, released last week by the city auditor regarding the lack of documentation of 23 million in repairs is another example of the disappointing history and only heightens our concern based on specific goals from'",
        "'speaker_0': '. Garcia and Governor Newsom. The Port of Long Beach is transitioning to zero emission. The port's Clean Air Action Plan estimates it will cost $14 billion to transition equipment and infrastructure to zero emissions over the next decade. The tenants and customers of the port are struggling to find a way to transition to zero emissions and remain a competitive'",
        "'speaker_0': 'gateway. In addition, the port's priority is to develop an $800 million Pier B rail yard, which is critical to achieve their environmental goals and attract discretionary cargo. Both of these major investments will take the focus of the management team to ensure the port is a successful economic engine.'",
        "'speaker_0': 'Moving forward, the port has a world class management team and international trade, not in overseeing hotel and tourist attractions. These are fundamentally different skill sets, the city attorney memo states. Since 1992. Two things have changed that support the transfer pier back to the harbor.'",
        "'speaker_0': 'First, primary port use has been developed as a cruise facility. And second, the Port Master Plan has an increased focus on visitor serving and recreational uses. These two items are not new. In fact, in the 1998 Port Master Plan, Section six, it says the goal for the Queensway Bay Planning District meet demand for appropriate visitor service facilities'",
        "'speaker_0': 'and recreational activities and develop a cruise facility. It's time for an honest discussion of whether this ship is a viable attraction to MSA request. The city undergo a structural and environmental survey before a discussion about transferring it to the port of Long Beach.'",
        "'speaker_0': 'The costs and liabilities involving the Queen Mary need an independent and transparent process and need to address how the port will also be able to meet their zero emission and Pier B financial goals. I appreciate your time tonight.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_5': 'Thank you. That concludes public comment.'",
        "'speaker_4': 'Think you were going to go have to go back to the counsel. I'm going to make a couple of comments now that the motion has been made. And then let me I'll turn it back over to those that are chewed up before I commented.'",
        "'speaker_4': 'Councilman's in the house when it was on item. I want to comment first and then I'll go after.'",
        "'speaker_0': 'Thank you, Mayor. I just wanted to say thank you to Councilmember Allen and Councilmember Price for bringing this this item also forward. And I think it's it's very timing. I and I think that we it's a great thing that we're actually exploring the possibility of transferring it to the Harbor Commission.'",
        "'speaker_0': 'Like like we said, they are very, very capable of being able to handle this. So I'm excited to see what that possibility looks like in the near future. So thank you.'",
        "'speaker_4': 'Thank you. But I just wanted to just to add of course, I want to thank first just Councilwoman Allen. You kind of just came right in and I know are very interested in taking on this challenge, and we appreciate that.'",
        "'speaker_4': 'I just wanted to uplift both you and something, Councilman Price. And Councilman Price. I also just want to thank you. I think you've been very active in this work, and so it's been great to see both you and Councilwoman Allen engaged and really trying to come up with some positive solutions moving forward.'",
        "'speaker_4': 'So I just want to thank you, Councilman Pryce, also for your extensive work, particularly around all the title of work that we're doing. I just wanted to uplift something. I think it's important just to note, obviously, I think we know that prior to the early 1990s, all the Pier H was under that kind of leadership of the'",
        "'speaker_4': 'Harbor Department of City One, which of course the harbor department is still part of the city of Miami Beach. But of course it is a separately run, a special department by operated by its own commission. The appearance, of course, is more than just the Queen Mary.'",
        "'speaker_4': 'We are talking, of course, about the park. We're talking, of course, about the Carnival Cruise Line terminal, the enormous amount of land that exists. Absolutely, of course. And the all the land around the block development opportunity land around around the Queen Mary.'",
        "'speaker_4': 'But also there's incredible hotel and tourism properties that are all on the same site. And so pure H, as a reminder, is broad. It's a it is a pier. And I think one thing that I'm in the conversations with Councilman Price and Councilman Allen have you know, we've discussed is that the folks who manage Piers are the'",
        "'speaker_4': 'best in our city is our harbor department. And they they they don't know this work. They do this work. And so I think this is a really an important just first step in getting information back from staff on how this would what this would look like, what a transfer could entail, and then getting the council engaged in'",
        "'speaker_4': 'that process, of course, and I know that throughout this process, I know that the Council and I are committed to ensuring that the city auditor remains an active partner in this process. She, she and we have discussed and she has discussed this possible port transfer as well with Councilmember Allen and others.'",
        "'speaker_4': 'And I know that she is supportive of exploring this as an option as well. I mean, as is the port and I've been I've had some conversations with our our chief executive there, and he's looking forward to doing the research and then working with the city to put some more information in front of the council and in'",
        "'speaker_4': 'front of the Harbor Commission, which I think is the most important thing, to just want to thank everyone for their from gathering committee to kind of gathering this information. And with that, let me turn it over to Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. Just wanted to take a minute and offer my support, I think. You know, we're a city that's blessed and fortunate to have a harbor department. And although none of the nine members of the city council, the mayor, where we're here for the discussions about acquiring the Queen Mary here to Long Beach, I think it'",
        "'speaker_2': 'doesn't preclude us from exploring what I think makes a lot of common sense. Aligning the Queen Mary, a ship with a department whose main business is ships and the tide lands in the harbor and all that. So. So I think that certainly makes a lot of sense.'",
        "'speaker_2': 'And I wanted to offer my support. Thank you.'",
        "'speaker_4': 'Thank you, Councilmember Councilmember Oranga.'",
        "'speaker_3': 'Thank you, Barry. And I want to thank the council members who stand up to this is very important for the Queen Mary in terms of its future. And I think it's a brighter future when it's with poor language.'",
        "'speaker_3': 'I also want to make a note that the it's within it's going to be before it is actually and always has been within the jurisdiction of the California Coastal Commission, of which I serve. And I'd be more than happy to actually support any project that's there that I know that going to be coming forward in development when'",
        "'speaker_3': 'it comes to the Queen Mary and any other items that come before that your age. So looking forward to continuing the development of the Queen Mary and. Thank you.'",
        "'speaker_4': 'Thank you, Councilmember Austin.'",
        "'speaker_2': 'Thank you very much. First of all, I'd like to just congratulate my colleague, council member Alan, for hitting the ground running and taking really the bull by the horns and taking on a tough issue, a challenging issue, an issue that has been a challenge for the city council for many, many years.'",
        "'speaker_2': 'I'll just say it is very refreshing to have a clear eyed council member who is engaged, particularly on this issue of the Queen Mary. So salute you for that. And I really support innovative thought when it comes to problem solving and dealing with our challenges.'",
        "'speaker_2': 'And I think I see this as a as an innovative concept. I'm looking forward, obviously, to getting all of the details back and and encouraging our staff to do the great work that they do around this and understanding what the details are.'",
        "'speaker_2': 'But but I certainly support this moving forward to to studying this. And hopefully we get to a place, a better place with that asset here in our city. And I'll just mention that I don't see too much separation between the Harbor Commission and the city of Long Beach.'",
        "'speaker_2': 'I'm looking out my office at the Harbor Commission. They're very much connected with the City of London. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you. Many know from discussions in closed session over the years that district residents, while far from the port, do have a passion for the Queen Mary and the history that comes with it. I mean, many of their ancestors that came over on the Queen Mary and we're excited to see a new opportunity and are very supportive'",
        "'speaker_0': 'of this item.'",
        "'speaker_4': 'Thank you. And with that we will go ahead and do a Rokakis.'",
        "'speaker_1': 'Councilwoman sandy has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Allen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Pryce.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabina a bona.'",
        "'speaker_2': 'Fide.'",
        "'speaker_1': 'Councilwoman. Mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Bush and Kerry's.'",
        "'speaker_4': 'Thank you. Now we're moving on. We're going to do all the final transfer items in one item and then we'll read them all and do comment. Those are items 14, 15, 16 and 21, unless there's any objection. Those are all the points transfer items.'"
    ],
    "Funding for Speed Cushions on Ximeno Avenue.": [
        "'speaker_4': 'We'll do those all as one item. This is here. Any objection from the council? I do not. Madam Clerk, please read 14, 15, 16, 17 and 21.'",
        "'speaker_1': 'Item 14 is community. Item 14 Communication from Councilman Price. Recommendation to increase appropriation in the Public Works Department by 7500 to provide funding for the installation of speed cushion on Examiner Avenue between Broadway and Second Street. Item 15 is communication from Councilmember So Pinol.'",
        "'speaker_1': 'Recommendation to increase appropriation in the Public Works Department in the amount of 2500 to install a new street light in the fourth Council District. Item 16 is communication from councilman have been a recommendation to increase appropriation in the city manager department by 500 to provide a donation to Cambodian Town Inc for the 2021 Virtual Cambodian Town Parade'",
        "'speaker_1': 'and Cultural Festival. Item 20. 17 Item Seventeen's Communication from Councilman Super NA recommendation to increase appropriation in the city manager's department by 500 to provide a donation to CSU LP 49 year foundation for the second annual Wings of Hope virtual event.'",
        "'speaker_1': 'Item 21 is communication from Councilwoman Mango. Recommendation to increase appropriation in the Public Works Department in the amount of 2500 to support a critical needs. Safety improvement in the Fifth District's.'",
        "'speaker_4': 'Thank you. I have a motion by Councilmember Supernova to approve the items in a second by Councilman Price. Councilman Supernanny comments.'",
        "'speaker_2': 'No. Just you, sir.'",
        "'speaker_4': 'I appreciate everyone's support. We have some charitable contributions here and a street light.'",
        "'speaker_2': 'So there's the breadth of these motions.'",
        "'speaker_4': 'Councilwoman Pryce.'",
        "'speaker_0': 'I just want to acknowledge the residents who are going to be the hopefully the beneficiaries of this traffic mitigation enhancement that we're installing at this location. This was truly such the quintessential democratic process. The residents got together. They had multiple meetings with me and my team and really advocated for this.'",
        "'speaker_0': 'And then they did their own community outreach. And I'm just really grateful to to them, to the residents for bringing this forward. And I just want to give a huge thanks to Carl Hickman and Elias Garcia from our traffic team, who really have helped us a lot with this issue and everything that they do.'",
        "'speaker_0': 'We'll see if this works. It's a pilot program, but I'm grateful for the opportunity to be able to fund the pilot and to have the residents support and traffic support to do it. Thank you.'",
        "'speaker_4': 'Thank you, Counselor. Murray. Ringo.'",
        "'speaker_3': 'Look, Simon, thanks for the good.'",
        "'speaker_4': 'Luck and councilmember Mongo.'",
        "'speaker_0': 'Thank you. This recommendation comes from our police department in partnership with one of our local community groups. And I'm very supportive and I really appreciate the number of comments we receive from the community in support of this item.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. That concludes council comment. There is some public comment. I believe we might have a public comment for item 16 and public comment for item 21.'",
        "'speaker_5': 'Yes. We have Patricia to Pat for item 16. And. Oh, there we go. Patricia to Pat.'",
        "'speaker_0': 'Cooney. Yeah. Sorry. Good evening. Same console. My name's Patricia, but I'm here to speak on behalf of the youth and which I believe that tobacco should be banned because according to research paper, products are more used in young adults than older adults.'",
        "'speaker_0': 'Younger adults are more likely to use. Favorite product by 85% compared to older.'",
        "'speaker_2': 'Adults.'",
        "'speaker_0': 'Who mostly use 10% to 20%, according to an article. On Truth intuitive Blackhawk youth prefer sweet taste and snuff compared to regular tobacco. This shows how flavor products can be addicting. I urge you to pick this audience as it is.'",
        "'speaker_0': 'Thank you for your time.'",
        "'speaker_5': 'I think your next speaker. Sorry. Our next speaker is for item 21. Carol Mayor.'",
        "'speaker_0': 'Good evening, honorable mayor and council members. My name is Carol Meyer, living in the third district and I am first vice president of the Long Beach Community Garden. And speaking on behalf of our 15 member board and 300 garden members, we are asking for support of an allocation to improve security.'",
        "'speaker_0': 'In one of the corners of our garden, we unfortunately have experienced theft by people without homes. They come into the garden at night and opportunistically steal vegetables, tool machines and other equipment purchased either by the garden.'",
        "'speaker_2': 'Or.'",
        "'speaker_0': 'Personally by the members. This garden is a gem that many Long Beach residents don't even know existed. It is nine acres and likely the largest community garden in Southern California. We work very closely with the city through our Councilperson Stacie Mango and the city department, particularly the Department of Parks and Marine.'",
        "'speaker_0': 'We have members from every city district. We provide fresh, organic vegetables year round for our family and friends. Further, we do share the garden members contribute over 60,000 of vegetables to the Long Beach Rescue mission on an annual basis.'",
        "'speaker_0': 'During COVID, we were inundated with requests for membership, and all plots are now assigned with 35 applicants on the waiting list. The garden was an oasis during COVID for its members, some with with us. For nearly 40 years it has been and continues to be that peaceful, productive place.'",
        "'speaker_0': 'We request your vote to secure critical funding to deter nonmember entry where access is most frequently violated. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker for item 21 is Milton Johnson.'",
        "'speaker_2': 'Give me a favorite. Sure.'",
        "'speaker_4': 'There's a comment that says you guys are a good unanimous vote.'",
        "'speaker_0': 'Mr. Mayor, you're not muted.'",
        "'speaker_4': 'Oh, thank you. Thank.'",
        "'speaker_5': 'And that concludes public comment for this item. Mr. Mayor, that concludes some time for all these items.'",
        "'speaker_4': 'Yeah. Councilman Price is up next. Okay.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Mayor. I'm sorry, but I didn't realize that we were talking about item 1/2. Item number 29. The flavored tobacco ban. Is that up for a vote right now? Because we had some public comment on it.'",
        "'speaker_5': 'No, that was not.'",
        "'speaker_2': 'That comment was was attributed to item 16, which was my item. And the comment did not relate to the item of my.'",
        "'speaker_0': 'I understand. Okay. Thank you. Then I have nothing. Thank you.'",
        "'speaker_4': 'Thank you. Please roll call. Vote, please.'",
        "'speaker_1': 'Councilwoman Sun has. I'm Councilwoman Allen. I'm Councilwoman Pryce. I Councilman Sabina. I Councilwoman Mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Zahra, Council Member Oranga.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Support for SB 603 on Cannabis License Tax Credit.": [
        "'speaker_4': 'Thank you very much. Now we're going on to item number 19, please.'",
        "'speaker_1': 'Adam 19. Communication from Councilwoman Ellen. Council Member Oranga and Vice Mayor Richardson. Recommendation to request City Attorney to prepare a resolution in support of SB 603.'",
        "'speaker_4': 'Thank you. Councilman Allen.'",
        "'speaker_0': 'Thank you, mayor, and thank you vice mayor Richard said that and council when you're ringa for signing on to this item, I introduce this item because I think our city needs to lead the way and I know we have already when it comes to supporting social equity programs and council members.'",
        "'speaker_0': 'You have been at the lead of this. This bill, Senate Bill 603 provides a tax credit and makes it easier for equity businesses to operate in the cannabis industry. And as you know, legal cannabis operators face a host of regulations and requirements from growing standards to product testing, licensing fees and city taxes.'",
        "'speaker_0': 'And these are daunting challenges for the cannabis industry and businesses. For equity applicants, there are major barriers, particularly against the illicit market, and the illicit market continues to thrive and undermine the legal operators. By providing this modest tax credit.'",
        "'speaker_0': 'This bill will help equity dispenser dispensaries stay in business, meet all the state requirements and pee in the illicit market. So ultimately, this bill will help the equity businesses play a larger role in their communities. And we all have a responsibility to support equity programs.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you, Councilwoman. Councilmember Durango.'",
        "'speaker_3': 'I want to thank Castmember well for bringing this forward. Social equity has been a big issue for us for a long time now, and it covers all aspects of our of our city audiences. I think it's important that we review this and that and are looking forward to looking at it even further at the state level when'",
        "'speaker_3': 'it comes to us and come back with a recommendation. So I thank you that Councilmember Aloe.'",
        "'speaker_4': 'Thank you, Councilwoman Mongo.'",
        "'speaker_0': 'Thank you. And I appreciate Councilman Allen for bringing this item. I chose not to sign on at the time because I wasn't quite clear if we were at the final stages of the bill or if there would be significant amendments.'",
        "'speaker_0': 'I know that there have been significant amendments to other items. And so I guess I'm hoping and I know we've just reorganized all of our committees. I'm hoping that we can get continual updates on the progress of the item and if it changes.'",
        "'speaker_0': 'Oftentimes these things happen and major changes take place. And so while I will be supporting that item today, I would like the state ledge to have an overarching statement of what our position of support is on items like this and should the item get too far out of the range of the policy statement of this Council and'",
        "'speaker_0': 'what we support that then our support would change to no support should a bunch of fillers be added to the item that are not in alignment with the Council's current strategy. So but I do appreciate that item. No hard feelings that I didn't sign on because the legislative process is a quite unwieldy one at the state and'",
        "'speaker_0': 'federal level right now. And so it just makes me nervous to support any particular item by number, but I will support it at this time in hopes that we can continually get updates as Councilmember Ortega said. Thank you.'",
        "'speaker_4': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. I'll be brief. Thanks for inviting me to sign on. I think it's you know, obviously, these issues are to evolve, evolve since the legalization of cannabis. I'm happy to support this and I look forward to continuing to follow it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Kathryn Austin.'",
        "'speaker_2': 'Yes. I'd like to just say say I think this is interesting, Bill. Certainly it meets the spirit and and the the the direction that our city is definitely headed in when it comes to cannabis equity. I see it as a real benefit to potentially many new new cannabis license holders to encourage them to to.'",
        "'speaker_2': 'To open businesses, but also to B, b, be successful in what they do. Senator Bradford has brought this bill forward. I do believe that there are options and opportunities for there to be changes in the bill. And, you know, certainly as to two of the three members of the state lands committee have signed on in support.'",
        "'speaker_2': 'So I'm going to support this as well. But obviously, should should there be some sort of dramatic change, I'm sure will be notified and staff will make us aware. And I assume excuse me, like I said earlier, I do believe that this this legislation is in line with our state led agenda to promote social equity in our'",
        "'speaker_2': 'city. So thank you. I'll support.'",
        "'speaker_4': 'Thank you. Let's do public comment if there is any on the of first.'",
        "'speaker_5': 'Speaker is Elliot Lewis.'",
        "'speaker_2': 'Hello. This is Elliott Lewis. I'm CEO of Catalyst Cannabis Co, also a lifetime resident of Long Beach. I always love having an agenda item because I get to sit through the meetings and listen to all the great stuff.'",
        "'speaker_2': 'I want to applaud the mayor for his inspirational discussion regarding the border crisis. I'm here to talk about SB 603. I want to give a shout out to Cindy Allen for championing this issue, as well as Councilman Richardson and Durango for signing on.'",
        "'speaker_2': 'It's really important to get these letters of support. I love to see Long Beach being the first one to get a letter on this item. The city of L.A. is supposed to be right behind, and there should be some other cities supporting as well.'",
        "'speaker_2': 'And these are very important. So the state knows that, in fact, we're behind the issue. There's still a lot of work to do at the state, but the city showing support is very important. Again, I love to see lobbies leading on the equity issues.'",
        "'speaker_2': 'The war on drugs has been a bad thing that disproportionately impacted communities of color and municipalities. Taking action is very important. Catlett has been also very outspoken and very public about its opinion on adding brick and mortars, and we applaud the city for their vote a couple of weeks ago.'",
        "'speaker_2': 'While this is a huge step and we think it's symbolic and there are some people that will benefit, we do think this will be a small amount of people compared to the entire population that was incarcerated around the war on drugs.'",
        "'speaker_2': 'So we want to see the conversation get broader on the equity issue, from expungement to job training to community outreach to reentry, etc.. SBO SB 603 is important part of breaking down barriers, giving social equity applicants a better chance to be able to compete in the marketplace.'",
        "'speaker_2': 'And it also illuminates how nuanced and broad the issue can be. Myself and Catalyst Cannabis Co are in support of it. We applaud the Council for their letter of support as well, and we give our word and we will continue to do our best to support this through our connections at the State.'",
        "'speaker_2': 'Thank you very much for letting me speak.'",
        "'speaker_5': 'Thank you. Our next speaker, Steven Contreras. Hello, everyone.'",
        "'speaker_2': 'Good evening, Mayor. Good evening, city council members. My name is Steven Contreras and the community outreach director for the Long Beach Collective Association. I would just like to say that LBC supports SB 603 that will provide a deferral or a waiver of an application fee, a licensing fee or or a renewal fee otherwise required by a division'",
        "'speaker_2': 'or a need based applicant or a needs based licensee. In addition, the LBC also supports AB 1138 and SB 59. If SB 235 is amended, it will also have LBC support. I'd like to thank you for your time.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_4': 'Thank you. Thank you. To can go ahead and take a vote. I want to thank Councilman Allen for leadership on this. Certainly an innovative bill coming out of the legislature and members. Please go ahead and cast your votes.'",
        "'speaker_1': 'Councilwoman Cindy, have I? Councilman Allen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Pryce. I in Sabina.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you. I think we still have do we have a few folks that are signed up for general public comment? I remember.'",
        "'speaker_5': 'Yes. We have someone on the line.'"
    ],
    "Ordinance on Flavored Tobacco Products Sale.": [
        "'speaker_2': 'Thank you. I think we have one more item here. Item 29, please.'",
        "'speaker_1': 'Item 29 is communication from City Attorney. Recommendation to declare ordinance amending the Long Beach Municipal Code relating to the sale of certain flavored tobacco products within the city of Long Beach. Read the first time and lead over to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_2': 'Thank you. Moved by Councilmember Price and second by Councilman Ranga. Councilmember Price is. You want to speak to this?'",
        "'speaker_0': 'Yes. Thank you. Our office has been working with the city attorney's office on amending some of the language. So if I can please have the city attorney's office share with us the latest update on the proposed language change.'",
        "'speaker_0': 'Good evening, council members. This is Taylor with the city attorney's office. It was brought to our attention that some other jurisdictions have faced legal challenges regarding some of the language that had been included in the ordinance. So to avoid similar legal challenges.'",
        "'speaker_0': 'Our office is recommending the following changes and to adopt the ordinance as amended on the floor in section 5.81.010.8 on page six, lines 21 through 22. Strike characterizing flavor includes flavor in any form mixed with or otherwise added to any tobacco product comma, including electronic cigaret.'",
        "'speaker_0': 'In Section 5.81. 010s on page ten at lines 15 through 17. Strike Tobacco Product Flavor Enhancer means a product designed, manufactured, produced, marketed or sold to produce a characterizing flavor when added to a tobacco product in section 5.81. 070f on page 11 at line 22, amend the phrase to offer for sale, to read, to sell in section'",
        "'speaker_0': '5.81. 070f on page 11 at lines 23 through 24 strike or a tobacco product flavor enhancer in section 5.81. 070f3 on page 13 at line five, strike or Tobacco Product Flavor Enhancer. And finally in section 5.8, 1.07.4 on page 13 at line eight, strike comma, including tobacco, product flavor enhancers and were available for any other questions that'",
        "'speaker_0': 'you may have.'",
        "'speaker_2': 'Thank you. Councilman Ringa.'",
        "'speaker_3': 'No comment other than I know that our Department of Health and Human Services is very much on top of this as well. So I'm looking forward to that. There are monitoring this is monitoring our our response. Thank you.'",
        "'speaker_2': 'Thank you, Councilman Austin. I support. I signed on to the motion, but I'm full support of this with the better enough. Thank you. Was there any public comment on this item?'",
        "'speaker_5': 'Yes. Our first speaker is Isabella Carroll.'",
        "'speaker_0': 'Hello and good evening, Honorable Mayor and mayors of the City Council. My name is Othello Carol. I live in District five. I'm also a volunteer ambassador for American Cancer Society Cancer Action Network. I applaud the city for taking steps to protect our youth from the dangers of flavored tobacco products.'",
        "'speaker_0': 'As a mother and a grandmother, I am deeply concerned about the dramatic increase of e-cigarette using usage among our youth. And it is unconscionable that tobacco products are the number one cause of premature death in the United States because it's so preventable.'",
        "'speaker_0': 'I strongly believe that protecting our youth from tobacco initiation and addiction is one of the most important public health actions policymakers can take. Flavored tobacco products are driving this unprecedented increase in the usage. So in closing, I respectfully urge you to pass a strong ordinance to permanently end the sale of all flavored tobacco products without exemptions.'",
        "'speaker_0': 'Exemptions for any product will weaken the ordinance, creating loopholes for young people to access flavored tobacco products that can lead to a lifetime of tobacco addiction. Thank you, everyone, for your time.'",
        "'speaker_5': 'Thank you. Our next speaker is Annie Hagan.'",
        "'speaker_0': 'Hello. This is Annie Pagan with Tobacco-Free Kids. Good evening, mayor and city council members. We are in strong support of ending the sale of flavored e-cigarettes and all flavored tobacco products. These sweet and minty products are aimed to lure kids with candy flavors and hook them for the long term.'",
        "'speaker_0': 'Ending their sale is a critical step that will protect Long Beach kids from the unrelenting efforts of the tobacco industry. Took them to a deadly addiction, and the tobacco industry would like nothing more than to scare the city council into believing this is a more more complicated than it is.'",
        "'speaker_0': 'This is a commonsense solution. The policy simply removes the flavored products that are most attractive to kids while leaving unflavored products on the shelves. It's a fair solution that will protect our kids and vulnerable populations. By passing this ordinance, Long Beach would join over 60 and maybe 70 now cities in California that have passed similar ordinances.'",
        "'speaker_0': 'So I thank you, each of you, sincerely, from the bottom of my heart for sticking up for Long Beach kids, even in the face of industry pressure. Thank you so much.'",
        "'speaker_5': 'Think your next speaker is Alexa warming.'",
        "'speaker_0': 'Good evening, Mayor Garcia and council members. My name is Alexa Warman. I'm with the American Heart Association. I'm here tonight to support a strong policy to protect Long Beach kids from tobacco addiction, disease and death. Ending the sale of all flavored tobacco products is key to reducing youth tobacco access and youth sweet kid friendly flavors like mango'",
        "'speaker_0': ', mint, menthol and cotton candy mask. The harshness of tobacco products make them seem safer and are highly appealing to youth. In fact, over 80% of kids who use tobacco started with a flavored product. The tobacco industry knows this and uses this information to target children.'",
        "'speaker_0': 'The industry has even called high school students their, quote, replacement customer customers. This is unacceptable and cannot continue. All flavored tobacco products, including flavored e-cigarettes, menthol cigarets, flavored hookah, cigars and smokeless tobacco are hooking kids into nicotine addiction.'",
        "'speaker_0': 'We need your help to reduce access to these deadly products at the retail level with your commitment to a strong flavored tobacco policy. Long Beach can better support our youth and overall community well-being. Please put our kids health over tobacco profits.'",
        "'speaker_5': 'Inc. Your next speaker is David Ross.'",
        "'speaker_2': 'Very. Good evening there, Garcia and city council members. My name is David Ross. I've been a Long Beach resident for about 40 years. I'm also a volunteer for the American Heart Association and was the chair of their board of directors.'",
        "'speaker_2': 'The American Heart Association supports ending the sale of all flavored tobacco products as an evidence based policy to reduce youth tobacco use. It's clear that the tobacco industry is actively and aggressively working to addict new customers, using flavors to target youth, people of color and the LGBTQ community into a lifetime of nicotine addiction.'",
        "'speaker_2': 'So e-cigarettes are the most common tobacco product used by middle and high school students. Kids are also using flavored cigars, cigarets hookahs and chewing tobacco at alarming rates. All flavored tobacco products are appealing to kids. They're highly addictive and they are deadly.'",
        "'speaker_2': 'Both of my parents started smoking in high school. Both my parents were killed by tobacco. My mother at age 61 and my father when he was only 47. We need bold action to prevent a new generation of nicotine addiction, disease and death.'",
        "'speaker_2': 'I urge the Council the health of our kids and families first by ending the sale of flavored tobacco products here in Long Beach. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Ed Sanders.'",
        "'speaker_2': 'If evening council members know that. My name is Ed Sanders with the Coalition of Los Angeles Families Fighting Flavor and Tobacco. I would like to urge you to enact this ordinance that ends the sale of flavored tobacco, including menthol flavored cigarets as well.'",
        "'speaker_2': 'I think you've heard from other speakers the obvious threat to young people is clear. I know you will hear from opposition that ask you to look at how this impacts businesses. But I think it's important to point out how we as a community need businesses that could products that benefit the health of a community.'",
        "'speaker_2': 'And when we're looking at flavored tobacco, this is a product that is high in nicotine. It's addictive and it leads to poor health. It is, you know, still the number one cause of preventable death in the United States.'",
        "'speaker_2': 'Flavored tobacco is used to entice new customers to this product. And then when you start looking at menthol in a more insidious way, it's targeted at vulnerable communities, particularly the African-American community. I think you, as a legislative body can take strong action.'",
        "'speaker_2': 'I think you've heard how over 60 to 70 municipalities throughout California have already acted. This is a growing movement, but it is a growing movement that says that.'",
        "'speaker_5': 'Thank you. Our next speakers, Eric Bache.'",
        "'speaker_2': 'Good evening, Mayor Garcia and city council members. Again, my name is Eric Batts from the vice president of advocacy for the American Heart Association. And I you know, I really just wanted to call in tonight and applaud you all for considering taking this action.'",
        "'speaker_2': 'You know, the national dialog right now has focused on holding those accountable who abuse and harm our communities, and that includes big tobacco. I had a chance to read the article that was in the Press Telegram today by the Circle K owner.'",
        "'speaker_2': 'And I got to say, I couldn't believe that the author would say that this policy would make it difficult for businesses to survive. I mean, what about Long Beach residents? I mean, should we not consider measures that will help Long Beach residents survive and really thrive for that matter?'",
        "'speaker_2': 'Selling flavored tobacco. It's not an honorable endeavor, and it certainly doesn't contribute to the health of Long Beach. The bottom line is that flavored tobacco products attract youth, nicotine addicts them. And when you put flavored tobacco together with nicotine, you know you're setting our youth up for a lifetime of addiction and health problems.'",
        "'speaker_2': 'Tobacco use contributes to more deaths and disease than any other product. And menthol is the deadliest of all tobacco products. So during a time when we're all being asked to do what we can to protect the health of our communities from COVID, you know, we can also keep our community safe and healthy by restricting the sale of'",
        "'speaker_2': 'all flavored tobacco products. You know, every day that goes by without this policy, another Long Beach child can start a lifetime of nicotine addiction. So making it harder for Long Beach youth to get their hands on these products the right thing to do.'",
        "'speaker_2': 'And I respectfully ask.'",
        "'speaker_5': 'Thank. Think your next speaker is Jakarta Robinson. Our next speaker is John Kindred.'",
        "'speaker_2': 'Keep up the. Good evening. Mayor and city council members. My name is John Kendrick. I live on the borderline of District One into an area that is most populated by the damage. Health wise, environmental wise, on this on these products, as you heard to everybody else.'",
        "'speaker_2': 'And the tobacco company has never showed any data to back up their claims. Well, while the Long Beach Health Department.'",
        "'speaker_0': 'And I keeping.'",
        "'speaker_2': 'The CDC and the World Health Organization has shown countless times and data how dangerous these new tobacco products are and the damage it does to communities of color of our children. And it also goes against the city's. Mission and vision when it comes to addressing the community's health as best.'",
        "'speaker_2': 'If anybody reads your mission statement, what it says also to what nobody says when he said that is it's also a health problem, environmental problem. When you look at the cities cap the city's climate action and that action plan, when it comes to climate change and air pollution, this is one of the deadliest things we talk about'",
        "'speaker_2': 'planting trees all the time.'",
        "'speaker_5': 'I think your next speaker is Laurie Bremner.'",
        "'speaker_0': 'Good evening. My name is Laurie Bremner and I work with peers, which is parents against vaping e-cigarettes. PAVE has found and run and powered by volunteers. I'm the grassroots coordinator, but I'm speaking to you tonight. Also from my heart as a parent and a cancer survivor and a daughter who lost her dad to tobacco related illness.'",
        "'speaker_0': 'He was grateful that the city council is focusing on this urgent piece of legislation. YouTube are 5 to 7 times more likely to develop COVID.'",
        "'speaker_2': 'Than those who.'",
        "'speaker_0': 'Do not vape flavored tobacco is now more than ever a deadly hook. The use of Long Beach simply cannot wait for the state or the federal government to take action to protect them. The California State Bill 783, has been delayed by a big tobacco funded referendum for a year or two.'",
        "'speaker_0': 'And that's why we urge you to immediately end the sale of all flavored tobacco products with no exemptions. SB 793 provides a floor but not a ceiling for a local ordinance. You can and.'",
        "'speaker_2': 'Should go.'",
        "'speaker_0': 'Further. Please remove the exemptions. Parents and kids are counting on you, their local elected.'",
        "'speaker_2': 'Officials, to.'",
        "'speaker_0': 'Step in and halt the epidemic of youth tobacco use. The need is urgent for you to place the health of kids lungs.'",
        "'speaker_2': 'Above some.'",
        "'speaker_0': 'Small portion of a retailer's profit that comes from flavored tobacco. We urge you to take decisive action to do for the kids of Long Beach. Please remove the exemptions. Pass a comprehensive ordinance.'",
        "'speaker_5': 'Thank you. Our next speaker is Primo Castro.'",
        "'speaker_2': 'Dear Mayor Garcia and City Council. My name is Premal Castro, government relations director for the American Cancer Society Cancer Action Network, and also committed to protecting the health and well-being of residents in the city of Long Beach, use evidence based policy and legislative solutions designed to eliminate cancer as a major health problem.'",
        "'speaker_2': 'As such, we're here tonight to urge this council to pass this ordinance to end the sale of flavored tobacco products, including menthol cigarets. Tobacco remains the leading cause of preventable death in our country, and sadly, sadly, greater than, you know, greater than 90% of adult smokers began smoking before the age of 21.'",
        "'speaker_2': 'Actions taken now at the local level can help to encourage a generation of Tobacco-Free Kids, potentially saving them from a lifetime of addiction and the deadly consequences of tobacco use and in the sale of flavored tobacco products, including menthol, is not only a health issue, it is also a social justice issue.'",
        "'speaker_2': 'Targeting marketing to communities of color, low income communities and the LGBT communities adds to the health disparities in populations already impacted by social inequities. Atheist Kent urges this council to pass this order and the ordinance as amended, prohibiting the sale of bob flavored tobacco products without exemptions removes so much of the allure of these products and is'",
        "'speaker_2': 'a key component of a comprehensive strategy to effectively help reduce tobacco.'",
        "'speaker_5': 'Thank you. Our next speaker is Gina Rodriguez.'",
        "'speaker_0': 'Good evening. Mayor Garcia and city council members. My name is Jeanette Rodriguez and I work at the University of Southern California Institute of Prevention Research at the Keck School of Medicine. I would like to share some research findings from the U.S. Tobacco Center of Regulatory Science.'",
        "'speaker_0': 'Our center has been following student cohorts for many years, and the trends in tobacco use over time have shown that youth with no history of cigaret use and those who are unlikely to have smoked cigarets are starting with e-cigarettes.'",
        "'speaker_0': 'And the most common reason for starting is the availability of a wide variety of flavors. This includes mint and menthol. The majority of youth reported that they would no longer use e-cigarettes if flavors were not available. It main research point I would like to highlight is that we found that a strong, comprehensive ordinance to regulate e-cigarettes flavored'",
        "'speaker_0': 'and mental tobacco products has a tremendous potential to substantially reduce youth use of tobacco products, including e-cigarettes. Our research study shows that a strong, comprehensive tobacco retail license preventing sales to minors was associated with lower rates of youth and adult initiation of combustible tobacco and e-cigarette use.'",
        "'speaker_0': 'Our current research suggests that it is important to consider the overall impact of e-cigarettes and tobacco use on all segments of the population. However, the weight of the evidence points to a far more detrimental effect on youth. We hope that this research can educate and inform your decision.'",
        "'speaker_0': 'Please let me know if you have any questions our team may be able to answer. Thank you.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_2': 'Thank you, members, please. Let's go ahead and have a roll call vote. Thanks.'",
        "'speaker_1': 'Councilwoman Sandy has. I'm Councilwoman Allen. I can tell I'm in Price Pryce.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman. So, Boehner. I can swim in Mongo. I can swim in sorrow. I Council member Oranga.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Bush and Kerry.'"
    ],
    "Renaming of Bixby Dog Park and Long Beach Performing Arts Center.": [
        "'speaker_4': 'Great. Thank you. We're going to go in and go back up to item 22.'",
        "'speaker_1': 'Item 22 is communication from Councilman Super Knoll, Chair of the Personnel and Elections Oversight Committee. Recommendation to approve renaming the Bixby Dog Park as the Dr. Marina, Mickey Donoghue Dog Park and the Long Beach Performing Arts Center as the Beverly O'Neill Performing Arts Center.'",
        "'speaker_4': 'Thank you. That's number two from.'",
        "'speaker_2': 'Thank you, Mayor. These both items have been vetted by our committee, and so we forwarded to the City Council for discussion.'",
        "'speaker_4': 'Thank you. Is there any public comment? I believe there's 1/1.'",
        "'speaker_5': 'No. We don't have anyone that called in for the seven.'",
        "'speaker_4': 'Okay. Great. I have a I have a motion. I have a second backed by Councilmember Ellen.'",
        "'speaker_0': 'Also. Amir, I have some comments.'",
        "'speaker_4': 'Yes. Please go.'",
        "'speaker_0': 'I want to start. I did receive some of some messages I'd like to read from the community regarding the dog park. And so the. The first one is I received a message just just 1/2. I'm trying to pull up the letter here.'",
        "'speaker_0': 'So. So here it is. Bye bye. It's my president, Robin Richardson, and and this is his statement. He says, Mickey's kindness and dedication to the community engagement through the dog park has been an inspiration to all of us.'",
        "'speaker_0': 'She gave her expertize in community activism to our group. She also generously gave her own time and efforts to make sure the dog park is the best it can be for the members of the local community and their dogs.'",
        "'speaker_0': 'And I also want to share a few words from Nikki's husband, Tommy, who wrote this. Said. Dr. Donahue was a leader in the formation of the Friends of Bixby Dog Park from the park's inception early in 2017. As such, she was elected by the community as a first president of the Friends of the S.B. Darke Art Association'",
        "'speaker_0': '. Through her tireless effort efforts, the dog park has grown to be a jewel for dog owners and the densely populated neighborhood. As a professor of emeritus at California State University, Mickey possessed the organizational skills to coordinate many improvements to the dog park.'",
        "'speaker_0': 'As a community organizer. Mickey knew how to involve the whole community in these efforts. So the part belonged to the dog loving public who shared a stake in the park. Until the day she was taken from us. Her love of the dog park was instilled in her.'",
        "'speaker_0': 'It's only fitting that the dog park be named in her honor. I look forward to seeing her name at our dog park. So thank you for submitting those comments. It was just my pleasure and honor to be able to read those.'",
        "'speaker_0': 'And then with regards to the mayor, Beverly O'Neill, I just want to start by thanking the community members who organized and came together and a way to honor Mayor Beverly O'Neal. And she has done more than anyone to uplift the many forms of art than any other elected person in the city.'",
        "'speaker_0': 'So I look forward to honoring her generous contributions and talent and with our entire community with this well-deserved honor. Thank you very much.'",
        "'speaker_4': 'Thank you, Councilwoman Pryce.'",
        "'speaker_0': 'Thank you, Mr. Mayor. And I want to thank Councilman Sucre not for taking these two items. To get the full. Counsel. I'm very happy and pleased with the naming of the dog park. The dog park, for those who may not have the institutional history, has equal funding from District two and three.'",
        "'speaker_0': 'So I very much consider that a joint asset between our borders. And I'm so grateful that we're able to put some love behind the name to remind people of the love that's in that space. And I very much enjoyed hearing those letters.'",
        "'speaker_0': 'Councilwoman Allen, thank you for sharing those. I know we talked a lot about Mayor Beverly O'Neill when this item first came to council. And I certainly don't want to rehash a lot of the statements that we made, but I'm just very, very excited about having her name attached to a place that brings so much light and culture'",
        "'speaker_0': 'to our city because she brings so much light and culture and kindness to our city. And I just wanted to just acknowledge that again and just I can't wait until her name is on on the marquee outside of the Performing Arts Center.'",
        "'speaker_0': 'And I just wanted to ask staff, do we have any update? I know the cost for that is, is was something that was being considered and contemplated, but I just don't know. Is that something that we are going to be able to get up there soon?'",
        "'speaker_0': 'Because I would love for her and her family to be able to see it as well. And during this time in her life.'",
        "'speaker_5': 'Councilmember. We'll get that information to you.'",
        "'speaker_0': 'Okay. Thanks.'",
        "'speaker_4': 'Thank you very much. That concludes council comments. Please, members, go ahead and do a roll call vote.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Ellen. I can swim in price. I can summon subpoena. All right, Councilwoman Mango. Hi, Councilwoman Sara. I Council member Oranga. I mean, Austin.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Vice Mayor Richardson. Vice Mayor Richardson.'",
        "'speaker_4': 'Vice Mayor Richardson has left the meeting. He has actually had an outage at his home. So he's just informing me right now. So he's had a power outage. Not sure if it's just his home or how big it is, but he is unable to join us.'",
        "'speaker_1': 'Bush and Kerry's.'"
    ],
    "Contract Award to Yardi Systems for Emergency Rental Assistance Program Implementation.": [
        "'speaker_4': 'Thank you. Next up is item number 22 and actually 23.'",
        "'speaker_1': 'Item 23 to 4 from development services recommendation to award a contract for the Emergency Rental Assistance Program implementation in a total amount not to exceed 1.4. Now, see, I.'",
        "'speaker_4': 'Have a motion in a second, please. Most of it comes from Boston. Can I have a second.'",
        "'speaker_3': 'Thoughts about that?'",
        "'speaker_4': 'It's like I'm a councilmember. Zero. I know. Public comment. I just have one question before we vote on this. Do we have a still a timeline of when we're going to be able to folks who will start applying for the emergency rental assistance?'",
        "'speaker_4': 'I know. I've heard from some folks.'",
        "'speaker_0': 'Mayor, I'd like to introduce Oscar or so he can respond to that question and we'd like to read a correction in the motion on the item into the record.'",
        "'speaker_5': 'Sure. Yes. Thank you, Mayor. We are hoping to roll out this program immediately, immediately, potentially by next Monday.'",
        "'speaker_2': 'Great.'",
        "'speaker_4': 'That's great. Thank you. Okay. Real is there.'",
        "'speaker_5': 'Mayor, prior to the vote. We need to amend the item. Oscar, do you want to? Yes. Yes, thank you. Uh, we want to make sure that we amend the recommendation to not to exceed $1,507,957 through September 30th, 2022.'",
        "'speaker_4': 'Okay. We'll cover.'",
        "'speaker_1': 'Councilwoman Cindy has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Allen and.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price, I. Councilman Sabina.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Mango. Councilwoman Mingo. Councilwoman. Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'"
    ],
    "Termination and Release Agreement for Lease with KBA6845, LLC.": [
        "'speaker_1': 'Vice Mayor Rich. Motion carries.'",
        "'speaker_4': 'Thank you very much. Next up is item 24.'",
        "'speaker_1': 'Item 24 is reported from economic development. Recommendation to execute a termination and release agreement for city owned property at 6845 Atlantic Avenue. District nine.'",
        "'speaker_4': 'Can I motion? Can I get a motion in the second place?'",
        "'speaker_5': 'Mayor. Mayor, I'm sure we. We would like to make a just a read a correction into the record, if possible. Sure. Yes. If we can, please amend the termination date of the lease from March 31st, 2021 to April six, 2021, at the request of the tenant and staff is supportive of that modification.'",
        "'speaker_4': 'Okay. There's emotion that comes from your anger. Seeking my counsel more often. There's no public comment on on this roll call vote.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Ellen. Councilwoman. Now it's Councilwoman Price. I Councilman Sabina.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilwoman. Sara, I council member oranga.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Bush and Kerry.'",
        "'speaker_4': 'Thank you, Mr. City Attorney. You also make some announcements in closed session.'",
        "'speaker_5': 'Yes. Thank you, Mayor. This evening in closed session in the case of Jose Encinas versus city of Long Beach by a vote of 9 to 0, the city council approved settlement of this matter in the amount of $300,000.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Thank you. On to item 25 or 24. I'm sorry.'"
    ],
    "Renewal Grant Application and Agreement for HUD Homeless Assistance Program.": [
        "'speaker_1': 'Bush and Kerry.'",
        "'speaker_4': 'Thank you. Next up is item number 27.'",
        "'speaker_1': 'Item 27 report from Health and Human Services Recommendation to submit a renewal grant application to the US Department of Housing and Urban Development for the 2021 Continuum of Care for Homeless Assistance Program Citywide.'",
        "'speaker_4': 'There's a motion and a second. Let's see. I need a need a second, please. Kept emotion of emotion by customers and they have second by counseling and sorrow. Please go ahead. And members, cast your votes.'",
        "'speaker_1': 'Councilman. Councilwoman Sunday has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Ellen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabrina.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Sara. I council member oranga.'",
        "'speaker_3': 'I.'"
    ],
    "Resolution to Hire Stephanie Kemp for Human Resources Department.": [
        "'speaker_1': 'Councilman Austin. I motioned Kerry's.'",
        "'speaker_4': 'Thank you. Next up is Adam 28.'",
        "'speaker_1': 'Item 28 Report from Human Resources Recommendation to adopt resolution to hire Stephanie Camp for a limited duration to work in the in the human resources department citywide.'",
        "'speaker_4': 'Yeah, I have emotion, but I can get emotion in a second, please. Okay. Most of my concern was in the house. And the second my councilwoman sorrow. No public comment. Please cast your votes.'",
        "'speaker_1': 'Councilwoman Sun has. Councilwoman City has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Ellen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Pryce.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabina. Councilwoman Mongo.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilwoman. Sara. I Council member Oranga.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you. That concludes, I believe, the agenda. Madam Quirk, is there anything I think we got through every item there.'",
        "'speaker_1': 'Correct?'",
        "'speaker_4': 'Correct. So we will go to closing any closing comments or announcements from the council? Seeing none. We will go ahead and adjourn this meeting of the Lombard City Council. And thank you all for the evening.'"
    ]
}