{
    "Resolution to Vacate Alley Portion near 520 West Willow Street.": [
        "'speaker_0': 'through Measure H. And so I want to make that announcement and and thank you thank you all for your support on that on that important issue. With that, we're going to go ahead and go right into the first hearing.'",
        "'speaker_0': 'So, Madam Clerk.'",
        "'speaker_1': 'Hearing item one is a report from Public Works recommendation to receive supporting documentation into the record, conclude the public hearing and find that the area to be vacated is not needed for present or prospective public use. And a resolution ordering the vacation of the alley portion south of 520 west Willow Street, east of Daisy Avenue, District seven'",
        "'speaker_0': '. Thank you. And to turn this over to staff.'",
        "'speaker_4': 'Thank you, Mr. Mayor. The staff report was given by Deputy Director of Public Works John Crumby. Good evening. On a Roman Council item, each one seeks to move forward a vacation of the portion of the alley south of 520 west Willow.'",
        "'speaker_4': 'The recommended action tonight has three parts, which are to conclude and conduct a public hearing, find that the alley is not needed for public benefit and adopt the resolution for vacation, said Alley. This item has had a general plan consistency finding by the City Council on February 14th of this year.'",
        "'speaker_4': 'Also, a notice of intent to vacate occurred on May 9th of this year. I'm available to answer any questions that you.'",
        "'speaker_0': 'Kate, thank you. So thank you for the staff report. Let me move that public comment on this hearing or public comment. Please come forward. Home EC to put up these two?'",
        "'speaker_2': 'Absolutely. So we got to. The. Perfect. Just a test.'",
        "'speaker_3': 'Because you're paying attention.'",
        "'speaker_0': 'Sitting back there just a little bit. Good evening, Mr. Mayor, and members of the city council. My name is Delgado. My address is on file. I represent Raymond Jensen, who is here. And we are opposed to the to the proposed Ali vacation.'",
        "'speaker_0': 'The way I have organized this in the interests of time and I believe this will save us a lot of time, is to have each of the people that are speaking in opposition speak very, very briefly. First, Michael Polley, who is a private investigator who I retained to do some work on this.'",
        "'speaker_0': 'And he did some counts of. Of vehicles in the area. Secondly, the owner of the adjacent property property, Raymond Ginn, on third, Esmeralda Zambrano, who has for more than 20 years been the general manager of the Priority Care Medical Group, which is at 500 West Willow Street.'",
        "'speaker_0': 'And then Dr. Dariush Kashani, who is the medical doctor at Priority Care Medical Youth Group. And then Dr. Sam Gibney, all of whom will take it very briefly, and then I'll sum up. So first, I would have Michael Polley address you.'",
        "'speaker_0': 'Good evening. My name's Mike Pauley. I'm a private investigator, licensed with the state of California. I was retained by Mr. Otto to conduct observations and.'",
        "'speaker_4': 'Monitor and document vehicles.'",
        "'speaker_0': 'Accessing the alleyway today from 7.'",
        "'speaker_2': 'A.m. to 4 p.m..'",
        "'speaker_0': 'And I counted.'",
        "'speaker_4': '339.'",
        "'speaker_0': 'Vehicles accessing the east west alleyways. 1/2. Actually, Madam Court, can you help them with the fix the mike? We have a little issue with the mike we're going to fix right now. There we go. Okay. Thank you very much.'",
        "'speaker_0': 'They're much better.'",
        "'speaker_4': 'The east west alleyway, along with the North-South Alley Alleyway.'",
        "'speaker_0': 'Next, the property owner from five 500 West Willow Street. Good evening.'",
        "'speaker_5': 'My name is Raymond Johnson, owner of the 500 and 520 East Crest Villa. By closing that alley, whatever the traffic is, going back and forth is going to come through.'",
        "'speaker_4': 'Behind our.'",
        "'speaker_5': 'Property and whatever. It doesn't go there. It double the traffic over there and is not safe. If it is not safe for West Westland people, it would be double for our people coming and going from the parking to the building and for the trucks.'",
        "'speaker_0': 'Trash trucks.'",
        "'speaker_5': 'Going there. It is going to be close the alley. How that truck.'",
        "'speaker_4': 'Can turn and go out from.'",
        "'speaker_5': 'One way the back up to they see the back side. It just happened last year that the lady got flattened with the asphalt near up near our home. So you have to consider that.'",
        "'speaker_2': 'If.'",
        "'speaker_0': 'Next we'll have. Dr. Dariush Kashani, who is the medical director of the Priority Care Medical Group. We can we can turn the clock off. I think it's just a reasonable amount of time and so they're okay, keep going.'",
        "'speaker_5': 'Good evening, council members and thank you for the opportunity to speak. My name is Doris Kashani. I'm the CEO of Priority Care and Medical Group. I run a nonprofit organization. We serve the uninsured and underinsured of the community.'",
        "'speaker_5': 'We there.'",
        "'speaker_4': 'Has been a clinic.'",
        "'speaker_5': 'In 500 west well over the last 25 years. We just recently took over the clinic over almost about a year now. And the population that we serve are generally low income or uninsured from the surrounding community. So we serve the community for that purpose.'",
        "'speaker_5': 'The patients who utilize our services are mostly with physical disability. They either have hearing visual, they might be pregnant carrying a baby or two babies on toes. They might be on wheelchair, amputated on crutches. I don't think the city council realized the impact of putting a gate at the end of this alley.'",
        "'speaker_5': 'What it will cause to people who have to cross the parking lot to come over. These people are not going to be able to react to any impending danger as easily as a healthy body can react to it.'",
        "'speaker_5': 'As I understand it, next door neighbor is a real estate company and a construction company. These are able healthy bodies that need to cross from their parking lot into their building. If it is unsafe for them to cross from their parking lot to their building in healthy, abled working bodies.'",
        "'speaker_5': 'How do we expect people who have visual hearing, disability or other physical disabilities illnesses that utilizing the community clinic to be able to safely go from the parking lot to the building? This is a real danger for our community and people who utilize our clinic.'",
        "'speaker_5': 'Again, we serve the under insured and uninsured population of the community. Most of our patients do come from the neighboring area and I am of great concern for their safety. If this goes in place, all the trucks and delivery and other cars that need to address and go through this alley, we're not going to be able to'",
        "'speaker_5': 'go through. They will end up having to back up and they will get stuck and will cause significant amount of hazard.'",
        "'speaker_4': 'Thank you so much for your time and listening to me.'",
        "'speaker_0': 'Thank you. Now, Esmeralda Zambrano.'",
        "'speaker_3': 'Hi. Good evening. My name is Esmeralda Sembrano. I been the office manager priority care for 24 years. I don't even see how this is even considered. To close this alley, we use this alley all the time for our patients.'",
        "'speaker_3': 'We've called 911 several times. Patients have gotten severe sick. And how are they going to have access? How are they going to have access to come in and out fast? When we call them, these patients need access to these alleys.'",
        "'speaker_3': 'I myself have to go around because if I take well in Magnolia, there's been accidents there. Look in the records almost at least once a month. There's accidents on Willow and Magnolia. People getting hurt every single month. You have to really consider this for our patients sake to really consider closing this alley.'",
        "'speaker_3': 'It's very important to us. I really appreciate if you consider this. Thank you.'",
        "'speaker_0': 'Thank you. Then. Dr. Samuel, get Blake. Hi. Good evening. I have a.'",
        "'speaker_5': 'Practice in the building for more than 20 years and I think definitely we see the impact of the patient and my colleagues have been. Explain how this important if you consider about their safety for sure the patient safety number one definitely is.'",
        "'speaker_5': 'We see the cars go in and out and it began up like the alley for sure. We're going to have a lot of cars that have to make a U-turn to bring it back to go to the main street.'",
        "'speaker_5': 'And I think this is going to do impact plus, like they mentioned, the handicap wheelchair.'",
        "'speaker_0': 'All the kids, you know, the running, walking from the parking lot to the building.'",
        "'speaker_5': 'So definitely it should take this one into consideration as of the block in the alley.'",
        "'speaker_0': 'Thank you. Thank you. Then I'll I'll look. Sum up what the argument is here. Basically, when is a street or alley vacation supposed to happen where you start off with the idea that it's a gift of public land?'",
        "'speaker_0': 'What happens is you're saying we no longer need this public alleyway. And so because it's unnecessary, we're going to let the people that are adjacent to it or have some claim over it take that land. They can only do so, however, with a finding by you that as follows.'",
        "'speaker_0': 'And this comes from streets and Highways Code Section 6324. If the legislative body finds from all of the evidence submitted that the street, highway or public service easement described in the notice of hearing or petition is and these are the critical words unnecessary for present or prospective use.'",
        "'speaker_0': 'The legislative body may adopt a resolution vacating the street, highway or public service easement. The process that has to be gone through is that there must be a conformance with the general plan finding and that is delegated to the Planning Commission.'",
        "'speaker_0': 'This has come up several times over the last couple of years and the Planning Commission has never made a conformance finding. In fact, at the hearing on December 1st after public testimony, the Planning Commission discussed the matter and determined that the proposed alley vacation would not be in conformance with the general plan.'",
        "'speaker_0': 'The Planning Commission determined that the portion of the alley proposed to be vacated had the potential to provide public use or convenience due to its existing access points to existing residential and commercial uses currently provided by the existing East West Alley.'",
        "'speaker_0': 'That's the alley that we're talking about and the therefore that the alley vacation had the potential to be detrimental so that the alley would no longer be available for present or prospective public use. Now I've put up two boards here and unfortunately I can't see either one of them.'",
        "'speaker_0': 'So I'm going to have to sneak a peek so we can talk about this. This board here shows the actual area that is supposed to be vacated. It is the western westerly half. And we've talked about the westerly half of this alley directly behind for a 520 west Willow Street.'",
        "'speaker_0': 'The other half of the alleyway is where my client's business is. And they purchased that that that building in January of this year. The second board that I have here, I put up to show you just this that alleyway is an integral part of the circulation patterns of District seven and the Wrigley neighborhood.'",
        "'speaker_0': 'In fact, many, many, many people use that alleyway to get around so that they can avoid Willow and and having to get out on major streets. This is between Magnolia and Daisy. And you can see here how right goes.'",
        "'speaker_0': 'Right in between Magnolia and Daisy. It drives up just, you know, 50 feet and then it goes all the way to a building. Well, wrap it up the time. Oh, okay. And so that's the process is this I challenge anybody in the city, in the planning department or in the public works department to tell me where a'",
        "'speaker_0': 'half of an alleyway has ever been vacated before like this. And finally, I would say, no, you can't make the finding, because just today there were more than 300 cars that showed that this is presently in use and needs to be kept as it is and not vacated or given away to someone, which is what's been requested'",
        "'speaker_0': '. Thank you. Thank you, Mr.. We're still doing public comment. Hello. Good evening.'",
        "'speaker_4': 'Can Greenspan from 520 West whether from Westland.'",
        "'speaker_0': 'So I just wanted to take a few minutes.'",
        "'speaker_4': 'To respond to some of those comments.'",
        "'speaker_0': 'And it's interesting to me that the argument is that by blocking off.'",
        "'speaker_4': 'This section of the alley that we are actually increasing the safety hazards. It would.'",
        "'speaker_5': 'Seem to me that if we block the access of the.'",
        "'speaker_0': 'Alleyway, we're going to get a lot less through traffic, through the alleyway.'",
        "'speaker_6': 'Which is going to make things.'",
        "'speaker_0': 'Safer. And of those 300 cars, probably 150 of them, give or.'",
        "'speaker_4': 'Take, maybe even 200 of them came from my office.'",
        "'speaker_6': 'Alone with my.'",
        "'speaker_4': 'Own.'",
        "'speaker_6': 'Tenants and people that are customers that are coming into my.'",
        "'speaker_0': 'Building where we're going to be stopping those people from driving by the medical office.'",
        "'speaker_5': 'Which I think is.'",
        "'speaker_6': 'Is actually an increase in safety.'",
        "'speaker_4': 'We looked at at the last few times, we came up here and presented we also talked about the trash issue.'",
        "'speaker_6': 'And found that the trash actually does not.'",
        "'speaker_4': 'Need to come through that alleyway. There is a.'",
        "'speaker_6': 'This is not blocking off happening. There's actually a.'",
        "'speaker_4': 'Three way alley and there is we're not.'",
        "'speaker_6': 'Blocking off it.'",
        "'speaker_4': 'Making a dead end to the alley. There's still an exit path through this.'",
        "'speaker_6': 'Alleyway so that cars can continue to drive through without having to make a U-turn or anything like that.'",
        "'speaker_0': 'We also did some.'",
        "'speaker_6': 'Research on the accidents.'",
        "'speaker_0': 'Reported on Magnolia.'",
        "'speaker_6': 'And have found no records of any car accidents at the exit of the alley at Magnolia.'",
        "'speaker_0': 'We've also been able to show through our previous presentations that the circulation pattern here in this area, actually, many of the buildings don't have these alleys behind them. And in fact, our alley, our building is absolutely unique in the way that it has no actual buffer.'",
        "'speaker_6': 'Between the back of the building and.'",
        "'speaker_4': 'The alleyway. So we talk about safety from our perspective.'",
        "'speaker_0': 'You open our door to our building and you are literally in an.'",
        "'speaker_6': 'Alley with 300.'",
        "'speaker_0': 'Cars.'",
        "'speaker_6': 'Driving by. And it it can become a it is a danger with the medical office and the other buildings on that block.'",
        "'speaker_4': 'They have a good.'",
        "'speaker_6': '20, 25 feet buffer between their back doors and the alleyway. And that's what I wanted to say on this. So thank you very much for your consideration.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Hi, Mayor. Council people. My name is Dr. Levy Freed. I'm the co-owner and founder of Long Beach Beer Lab at 518 West Willow Long Beach First Manufacturing Brewery as of Friday. So we're very excited to be here. I'm at 518 and I use the West Land Alley and I use the West Land parking lot.'",
        "'speaker_4': 'And I'm concerned about the through alley because me and my employees and my staff have number of times always been hit by people zooming through that alleyway. So I think the safety concern should be that we should worry about too much traffic through that alley.'",
        "'speaker_4': 'And I think that application of that alley and and a stop in there would help people cross that alley on their way to work or away from work, especially my patrons who will be parking in that alley and walking around the building to my entrance.'",
        "'speaker_4': 'So I'm concerned about them, especially late at night. And well, people are just zooming through on their way, bypassing any sort of whatever on Willow Street in also in the future, I hope to be able to use that alley for some sort of neighborhood festivals that we could do through our brewery and through the community.'",
        "'speaker_4': 'And having that access to the alley would definitely help that arrangement. If cars were to zoom past, that could be a huge safety concern. So I'm in favor of the vacation and that is it. Thank you very much.'",
        "'speaker_0': 'Thank you very much. That concludes public comment for this hearing. So I will go back now to the city council and I'll start with Councilmember Murang'a, which is this areas in his district so customary, Ringo.'",
        "'speaker_4': 'Thank you, Mayor. And I want to thank all the people who testified today regarding this L.A. vacation just for staff. Can you please review the process as to from initiation to where we're at at this point in terms of the different points of contact and different points of studies that we did starting from the beginning.'",
        "'speaker_4': 'Just to get a historical perspective.'",
        "'speaker_0': 'Happy to. When a request for a vacation comes in.'",
        "'speaker_5': 'To the city, a formal.'",
        "'speaker_4': 'Application is filed, and the city reviews several criteria to determine if public benefit is needed for the alley. Several things are not allowed or would not be recommended to move forward by the staff. One being we would never move forward.'",
        "'speaker_4': 'A vacation of an alley that forms a dead end alley. Every alley needs to have a in and out. And that is the case with after the vacation that moves forward here.'",
        "'speaker_0': 'But petitions are filed and.'",
        "'speaker_4': 'Notices go to the surrounding properties and they're provided opportunity to comment positively or negatively to the proposed action. And the staff works with with the surrounding property owners that receive those notices. Also, utility companies are public safety departments in several internal functions of the public works department.'",
        "'speaker_5': 'Go through.'",
        "'speaker_4': 'That process to determine if public benefit is needed for their services.'",
        "'speaker_0': 'Within the public works department.'",
        "'speaker_4': 'Traffic and trash departments are consulted and both in both cases, those departments or those divisions of the department agreed that the vacation could move forward and there would not be an adverse impact to vacation in the alley. A couple.'",
        "'speaker_5': 'Other comments on a.'",
        "'speaker_4': 'Few of the things that were said. It's important to note that only a portion of this alley is being vacated, and the gentleman who spoke about traffic counts mentioned northwest are north, south and east west. It's really only a portion of the.'",
        "'speaker_0': 'East west.'",
        "'speaker_4': 'Alley that's being vacated. And the other comment was the general plan, consistency, finding. Everything was said, was accurate, but the city council did make the general plan consistency finding in February of this year. Okay. Thank you. Now, when it comes down to the issues of ambulance or emergency vehicles going through to that area to address issues regarding'",
        "'speaker_4': 'the the medical services and next door, has there was every record done or account done in terms of how many calls for service there were and what impact that would have to that business.'",
        "'speaker_0': 'As part of the notification process.'",
        "'speaker_4': 'Emergency services consulted in terms of both in terms of emergency response.'",
        "'speaker_5': 'On ALS and in this case.'",
        "'speaker_4': 'The response.'",
        "'speaker_5': 'Was that.'",
        "'speaker_4': 'Coverage would be.'",
        "'speaker_0': 'Still provided at the same service level.'",
        "'speaker_5': 'As.'",
        "'speaker_4': 'Whether the vacation occurs or not. Okay. And just to clarify, the accidents that that were alluded to were regarding the alley to Magnolia. Correct. I mean, in terms of either turning north or south out of the alleyway, is that correct?'",
        "'speaker_0': 'So we haven't.'",
        "'speaker_4': 'Personally researched those individual accidents.'",
        "'speaker_0': 'As part of the.'",
        "'speaker_5': 'Process. Our staff does.'",
        "'speaker_4': 'Go through a database of accidents to look to see whether vacation has a safety impact. And that was not found in this case. Okay. Well, based on the report from staff and regarding the also the input that was put in by the fireplace fire police departments as well as public works in terms of trash pickup, I support'",
        "'speaker_4': 'the indication they would ask that my colleagues support it also. Thank you.'",
        "'speaker_0': 'Okay. There's a second on emotion, which is Councilwoman Gonzales. Any comments? Okay. Well, I see no other comments from staff. Mr. City Attorney, do you have something on addressing? Okay. There is a motion in a second by Councilmember Durango and Councilwoman Gonzalez, our members.'",
        "'speaker_0': 'Please go ahead and cast your vote.'",
        "'speaker_1': 'Motion case.'",
        "'speaker_0': 'Okay. Thank you very much. And thank you to everyone that came out for that. We're moving on to consent. If I can get a motion any second, please, on consent. I. Okay. There's a motion in a second on consent.'"
    ],
    "Ordinance to Prohibit and Regulate Oversized and Recreational Vehicle Parking. ": [
        "'speaker_0': 'Okay. Thank you. We're now going to hear those. It's going to take the council requests. And we had a request to hear item 16 at the top of the agenda. So we do. 16, please.'",
        "'speaker_1': 'Item 16 is a report from Public Works, recommendation to request the city attorney to prepare an ordinance amending the Long Beach Municipal Code to prohibit parking of oversize and recreational vehicles on city right away within residential neighborhoods citywide.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_7': 'Is there a staff report on this item?'",
        "'speaker_0': 'Yes, Mayor. Council members, we have our public works director Craig Beck and also our traffic engineer, Eric with Strom. So Craig. Thank you, Mr. Manager. Mayor, senior council members were pleased to be before you this evening to try to bring forward an item that had originally been been requested back in October of 2016.'",
        "'speaker_0': 'At that time, there was concern about some of the RV parking in many of our parking impacted communities and neighborhoods. Staff spent a lot of time researching what other jurisdictions are doing and what would fit in Long Beach.'",
        "'speaker_0': 'By uncovering that work, we we found that that the current the way that the municipal code is currently written is a little bit confusing and contradictory. So sometime in March of 2017, we provided a memo, a staff report to this council detailing some of the the conflicts that we see in the code and some recommendations that staff'",
        "'speaker_0': 'believe they would bring forward to the full body for consideration. So what we have before you this evening is a recommendation for council's consideration. And I'm going to ask the city's traffic engineer, Eric Woodson, to go through that presentation.'",
        "'speaker_0': 'Eric. Good evening, Mayor. Council members. If I get the presentation brought up. So start off quickly just with. The definition of an oversize vehicle in the Long Beach municipal code.'",
        "'speaker_5': 'Vehicle exceeding.'",
        "'speaker_0': '85 inches in height or 80 inches in width or.'",
        "'speaker_5': 'Longer than 20 feet. If there is.'",
        "'speaker_0': 'A trailer or objects on the trailer, all those features are included within those dimensions. Some of the current issues we face with oversize vehicles are parking impacts, especially in parking impacted residential neighborhoods, visual blight, safety and sanitation concerns, potential citations, issues at driveways, alleys and intersections, and then trash and debris from vehicles left and the right away'",
        "'speaker_0': '. There's also concern with Long Beach Municipal Code and the California vehicle code being somewhat contradictory in their requirements. And then oversize vehicle restrictions are not employed uniformly across the city. They're implemented on a case by case basis. So staffers researched ten municipalities within the vicinity of Long Beach to see what each of their restrictions and regulations call'",
        "'speaker_0': 'for.'",
        "'speaker_5': 'We looked at vehicle dimensions.'",
        "'speaker_0': 'Issuance, number of permits issued annually, and also also duration of the permits. So based on the review of those of other jurisdictions and our own recommendations and discussion, we recommend change in the overall length of the oversize vehicle minimum from 28 to 22 feet, excluding pickup sport utility vehicles, prohibiting the parking of oversize vehicles in residential neighborhoods'",
        "'speaker_0': '. And any vehicles parked in residential neighborhoods on private property would need to be behind the gate of current zoning requirements. The exception to parking in a residential neighborhood.'",
        "'speaker_5': 'Would be through the use.'",
        "'speaker_0': 'Of permits. Maximum issuance of permits would.'",
        "'speaker_5': 'Be for.'",
        "'speaker_0': '72 hours and 20 permits would be available annually. These products are currently available online, so we continue with the current online system. Other suggested changes to the code, consolidating oversight of vehicle restrictions and permit issuance to the city.'",
        "'speaker_0': 'Traffic Engineer requiring parking prohibition signs be posted at all city entrance roadways along the city perimeter and freeway off ramps and allowing parking to continue in certain commercial industrial areas, areas on a case by case basis based on approval of the city traffic engineer.'",
        "'speaker_0': 'Next steps for this process. Amend the musical code to include the suggested oversize vehicle changes and post signs prohibiting oversize vehicle parking at city entrances. Include a mailer in the utility bills of residences and then post on the website and social media to alert residents of the new policy and then meet with the Coastal Commission to discuss'",
        "'speaker_0': 'the ordinance and draft language and then submit the ordinance to the Coastal Commission for Certification. This will be followed by a public hearing held by the Coastal Commission. The fiscal impact of this change would be the cost to for city staff, city crews to install the science courses estimated at $18,000.'",
        "'speaker_0': 'Complaints would be a complaint based. Enforcement enforcements and additional staff are proposed and it would be expanding the current online permitting system. Happy to take any questions at this time. Thank you. Let me go back to Councilman Price and please, if you have any questions or comments.'",
        "'speaker_7': 'Thank you. So, first of all, a big thanks to staff for doing an extensive research project to get this item to the place where it is today. I really appreciate that. And I also appreciate that you looked at cities that are within the region that are similar to us in size, might be larger, might be smaller.'",
        "'speaker_7': 'But that gives us a sense of what other cities that are in the region are doing. And it's it's obvious to me that other cities do have some more consistency than we do in terms of RV regulations. I want to start with fiscal impact.'",
        "'speaker_7': 'You mentioned the $18,000 for the if we had a consistent ordinance that affected the entire city. But if we were to continue doing individual neighborhoods and individual signage, what would that cost look like?'",
        "'speaker_0': 'So let me let me try to address that. Currently, what we do is we we approach any restrictions on parking oversize vehicles on a case by case basis. And many times we will either receive a request by a council district or a community group that are citing particular impacts.'",
        "'speaker_0': 'We'll go out and analyze those particular streets and then we have to put up signs on that street. And where it becomes real challenging is the cost for maintaining those signs. So similar to the experience that we had when we went through updating our street, sweeping changes, if we were to do that on every street in the'",
        "'speaker_0': 'city on a case by case basis. And I would anticipate we would continue to receive more and more complaints about this. You know, it would be potentially a seven figure number. Okay.'",
        "'speaker_7': 'And over the years, in terms of the city's history with this topic, has this been an issue that's been a consistent source of complaint in regards to constituent issues?'",
        "'speaker_0': 'Yes, I know that the council offices have received many complaints, but as a staff have received those as well. And many times we're asked to go out and enforce codes that are confusing and conflicting, and it makes it challenging on the enforcement side.'",
        "'speaker_0': 'One of the things that we're asking for this evening is, is to really update the municipal code, to make sure that it's clear on what is being proposed and that enforcement of whatever action council takes this evening is easier to do, not only from an education perspective with the community, but as a staff perspective in enforcing that'",
        "'speaker_7': '. Okay. Couple of questions on the recommendations. I know that the recommendation is for 22 feet. Can you give me any sort of justification for that number?'",
        "'speaker_0': 'So the current dimension is is 20 feet. And looking at neighboring cities, many of the neighboring cities did have a vehicle, oversize vehicle length limit.'",
        "'speaker_5': 'Of 22 feet.'",
        "'speaker_0': 'So we felt that going to that dimension seem reasonable. This would exempt some of the pickup trucks and sport utility.'",
        "'speaker_5': 'Vehicles that are on the market today.'",
        "'speaker_7': 'Great. We also have 72 hours as a maximum for the permits. What's that based on.'",
        "'speaker_0': 'The 72 hours? Again, we're looking at consistency with neighboring jurisdictions and also vehicles are currently required to be moved after a 72 hour period. So we felt that was also consistent as well.'",
        "'speaker_7': 'Now, would there be an opportunity if a resident had a need for additional time to request an extension of that 72 hour period? Would there be any sort of a process by which they could petition for an extension?'",
        "'speaker_0': 'So the recommendations before you do not currently include that kind of an option? I think that that is reasonable. And if council were to take that action this evening, certainly staff would be able to implement it.'",
        "'speaker_3': 'Okay.'",
        "'speaker_7': 'And then how about the 20 permits per year? What is that number based on?'",
        "'speaker_0': 'We took a look at what some of the neighboring cities had, and we also looked at what the current Long Beach municipal code had. Currently, we had 12 permits for a two day duration each, which allowed for 24, basically 24 days of oversize vehicle parking.'",
        "'speaker_0': 'So we felt that we wanted to be a little more consistent or, you know, increase that number. So we increased it to a three day or 72 hour limit and going to 20 instances per year.'",
        "'speaker_7': 'What total does that give us in terms of the number of days that you can have an RV parked outside of your home?'",
        "'speaker_0': 'That would give us a total of 60, 60 days per year.'",
        "'speaker_7': 'Right. So I would like I have made a motion, but I would like to be a little bit more specific about the motion. I'd like to make a motion and ask my colleagues to support staff's recommendation with with the following caveats that the number of hours that the 72 hour permit could be extended on a case by'",
        "'speaker_7': 'case basis at the discretion of our Public Works Department, Traffic Engineering Bureau. And the 20 permits per year could also be evaluated for an extension on a case by case basis through our traffic bureau, so that if there is an unusual circumstance or something that requires special consideration, the discretion would be within your department.'",
        "'speaker_7': 'That would be my recommendation. The other final changes I would make from staff's recommendation is I would recommend that I'd ask my colleagues to.'",
        "'speaker_3': 'Support.'",
        "'speaker_7': 'Approving this, but not requiring that the oversize vehicle that's parked on residential private property be behind a gate because some homes don't already have a gate. And we don't want people to take on an additional cost. And also putting a gate in front of your property may change the character and the curb appeal of the property.'",
        "'speaker_7': 'So with those three changes to the recommendations, I move this recommendation forward.'",
        "'speaker_0': 'Q There's a motion, there's a second by Councilwoman, Mango, Councilwoman Mongo. Mayor, may I interrupt? Just not sure. I'm sorry. On the third.'",
        "'speaker_4': 'Recommendation or amendment that currently is the gate requirement is currently part of the zoning.'",
        "'speaker_0': 'Ordinance. So if that's adopted tonight, then it would have to go back to Planning.'",
        "'speaker_6': 'Commission before we could come back with a revised ordinance just for timing purposes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'That I would I would be okay with that as the maker of the motion. I'd like to hear from my colleagues if someone would like to make a friendly that's different from that recommendation. But I think allowing that flexibility for our constituents is important.'",
        "'speaker_7': 'And I might add that our office has received over the last year or so, hundreds of emails in support of adopting a city wide, consistent approach to handling RVs. Because when the police do get called out, it's incredibly confusing what ordinances and what place on what street.'",
        "'speaker_7': 'So I'd ask for my colleagues support. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, go.'",
        "'speaker_3': 'Yes. I have a lot of the same notes as Councilman Price, specifically with the gate, because there are a lot of communities, even within the districts that are historical districts, that they cannot aggregate actually. And so we have one of those in our area.'",
        "'speaker_3': 'We prefer that it stay not behind the gate. So I'm really supportive of that. I also want to thank the staff. This was a lot of work and it's been a long path to get here. We really appreciate that.'",
        "'speaker_3': 'Under bullet three, on page two of the item, it talks about the length being from 20 to 22 feet. It has the ability to exclude pickup trucks and sport utility vehicles. I want to take a minute to thank in our our newsletter, we encourage people to make public comment via the E comment.'",
        "'speaker_3': 'And we get these comments and we get them in advance of the council meeting. And so we can read them and really talk with our staff and the city staff about them if we have the time. And so one of the concerns was that there are some commuter vehicles that are currently in use, specifically the Mercedes sprinter'",
        "'speaker_3': 'van, which is a seven passenger commuter vehicle that is used by a lot of the van pools. And so my only concern would be if there were vehicles that on a case by case basis fit within this guideline.'",
        "'speaker_3': 'And with the 20 to 22 feet, I hope that this would not be a problem anymore, but that we would somehow work through what that would look like. There just has to be a process by which an exception can be made.'",
        "'speaker_3': 'And so with that, and I really want to thank the neighbors who supported a lot of this throughout the last several months. There is also a concern about consecutive use of the permits. So if I applied for a 72 hour permit under the current regulations, would you theoretically be able to stack those four consecutive days?'",
        "'speaker_0': 'Currently the way the musical codes are written is that there has to be a 24 hour waiting period before refiling for the permit.'",
        "'speaker_3': 'Perfect. That's wonderful. Thank you very much. I hope my colleagues will support this important item.'",
        "'speaker_0': 'Thank you. Clinton reports.'",
        "'speaker_3': 'Yes. I want to thank my colleagues for their work on this. And thanks to city staff, I know back in in October, I had many unanswered questions around the legality enforcement and the costs. I appreciate everybody's work to resolve these.'",
        "'speaker_3': 'I want to make clear tonight that this is not banning people from sleeping in their cars and their actions tonight should not be seen as a way to open the doors for more vehicular living restrictions. So I have a couple of questions for staff just to make sure that's clear before we move forward.'",
        "'speaker_3': 'I know that previously we talked about the code that we should amend was 10.2 4.078. And I want to make clear that we are still not able to enforce that part in our code and that we would be abiding by that.'",
        "'speaker_3': 'Mr. West.'",
        "'speaker_0': 'So we would be amending. 10.2, 4.078 and 10.2.'",
        "'speaker_4': 'For oh in the code.'",
        "'speaker_3': 'And can you clarify for everybody that that, in fact, does not make it where we will give people tickets for sleeping in their cars? Should they be sleeping in a VW van that doesn't have a permit in a residential area?'",
        "'speaker_0': 'Those sections of the code don't address those topics.'",
        "'speaker_3': 'That's true. Sorry. I have a list of codes in front of me. Let me take out the code question and let me rephrase it. Previously, when we were here in October, the concern was that passing this would ban would mean that we were going to be banning people from sleeping in their cars and enforcing that ban.'",
        "'speaker_3': 'The concern I had at that time is that we could not enforce that ban because of other laws on the books. I know that the city attorney, Charlie Parker, answered a lot of these questions for me last time.'",
        "'speaker_3': 'So perhaps the city attorney could help me out here.'",
        "'speaker_0': 'As proposed today, that doesn't address the other laws that.'",
        "'speaker_4': 'You're discussing.'",
        "'speaker_0': 'Or referring.'",
        "'speaker_4': 'To. So I guess my question it it is a bit broad.'",
        "'speaker_0': 'On your question. And so the Volkswagen van may be under 22 feet and it wouldn't be subject to this. So that may not be a good example. But we are only proposing to amend the two sections.'",
        "'speaker_4': 'For you this evening and not addressing the other issues that you've raised in.'",
        "'speaker_0': 'Those laws. This would have no impact.'",
        "'speaker_6': 'On those laws.'",
        "'speaker_3': 'That is what I was looking for. Thank you. I did want to clarify for everybody that we wanted at the same time to bring forward a a transitional parking policy that we've been working with churches over the last several months.'",
        "'speaker_3': 'Our health department, as well as our other staff have been working on that. So just quickly, I'd like to ask if Mr. Modica could possibly give just a brief update for folks on the point of this questioning is just to make clear to everybody that has called my office with concerns that this is addressing homelessness, that in'",
        "'speaker_3': 'fact, we have another program that will possibly be voted on in the near future.'",
        "'speaker_4': 'Thank you. Councilmember, I believe you're referring to the safe parking program that the council has asked city staff to look into. But we were asked to look into is is there an ability to go through a process to.'",
        "'speaker_0': 'Allow.'",
        "'speaker_5': 'People who do currently sleep in their car.'",
        "'speaker_4': 'Who are homeless, to to have a space to do that within parking lots? We've been doing the research on that and we've.'",
        "'speaker_5': 'Produced a memo.'",
        "'speaker_4': 'Fairly detailed from Health and Human Services outlining some cities that do that, some of the challenges that come along with that and some of that, some of the possible benefits as well, as well as the costs. I do want to point out, though, in our in our review, what we really learned was that people in RVs and'",
        "'speaker_4': 'people sleeping in cars are two different populations. So people that are in there and have recreational vehicles don't consider themselves homeless for the most part where and they have different standards of living and different incomes than people living in cars who tend to be lower income and do consider themselves homeless.'",
        "'speaker_4': 'So those are two different populations. We provided that report back to council with the cost impact and so that, you know, that's something the council wants to look at. We can discuss that further, but that's different than what's happening here tonight.'",
        "'speaker_3': 'Great. Thank you, Mr. Modica. We will. We are working with several nonprofits right now, and we'll hopefully bring that back in the next month or two. So I just want to clarify that there's another process for that. And then my last question is on the location of these vehicles, I just want to get clarity that the item'",
        "'speaker_3': 'that was before us talks about commercial industrial corridors and that that is still the case, even with Councilmember Price's amendments to a case by case basis that we're still looking at that in those corridors. Can you clarify and define the process for identifying those corridors?'",
        "'speaker_3': 'It's challenging for me to know if they're not in my district and I'm doing a vote that says I'm going to push them all to somebody else's districts. That's not an impact that I necessarily want to be on the hook for.'",
        "'speaker_0': 'Councilmember I think what we would do is look at the zoning code. So I think there was a presentation earlier today on the general plan update. And so certainly within the city's general plan, there's designations on what areas of the city are considered residential and what areas of the city are considered commercial and industrial.'",
        "'speaker_0': 'And so that's where we would start, is in those neighborhoods that are designated as residential.'",
        "'speaker_3': 'Great. Thank you so much. I greatly appreciate everybody's work on this. I'll be supporting this item. Thank you.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Okay. Next up is Councilmember Ringa.'",
        "'speaker_4': 'Thank you, Mayor. And I want to thank staff for their work. Good staff work on this. There's been a lot of complaints that I have been getting also regarding not only RV but boats, kind of boats that are all over the place.'",
        "'speaker_4': 'And I think that that is the most prevailing complaint that I got in in neighborhoods around my area. So I'm glad that there is a item in there that includes trailers and boats in regards to moving that. The other portion of it as well.'",
        "'speaker_4': 'When this came up a couple of months ago, obviously I was concerned about having a blanket ordinance that would cover this issue. But yet we have a big coastal area, coastal. His own that would not fit because of other communities up and down the coast who are trying to address this issue and have encountered some difficulty in'",
        "'speaker_4': 'being able to adopt an ordinance that would address people's access to the beach because of restrictive ordinances or vehicles being able to stay overnight or for a few days along the coast. So I do see that there is an item or bulletin here or at the end of saying that we are going to pursue Coastal Commission acceptance'",
        "'speaker_4': 'or at least a hearing with the Coastal Commission to address this ordinance and hopefully work something out between between the cities on beaches, LCP, local coastal plan and the ordinance. So I'm looking forward to that and having having this issue resolved because I think it's important.'",
        "'speaker_4': 'Thank you very much. Catherine and I will be supporting the.'",
        "'speaker_0': 'Motion Council in worship. Thank you.'",
        "'speaker_5': 'Thank you. I want to go back to one of the points made. If they can pull up slide five, I think I can explain some of the confusion on that item. That's possible. And because we've had inquiries at our office, let's see.'",
        "'speaker_5': 'And I think, right, if you look at the title, it says Recommended changes to the municipal code. Okay. Now go down to the bullet point about the fencing and we have some subject verb agreement disagreement here. So it is not a change.'",
        "'speaker_5': 'The title says changes and then down at that bullet point. But we're going to go with an existing. So that's where the confusion came from. So I think that's what we need to resolve that it was in the past it's been complaint driven.'",
        "'speaker_5': 'So nothing has changed to the city attorney's point that it would take a different change than what we can do here tonight to to do away with that. But that's where I believe all the increase to the officers came from.'",
        "'speaker_5': 'Secondly, to the point of the special circumstances where you have to extend the 72 hours, this has to be seamless because that might be a mechanical problem with the vehicle or something like that. So that shouldn't trigger the use of one of the special permits that has that 24 hour window.'",
        "'speaker_5': 'So I think that that's what my colleague, Councilwoman Price was was driving it. Finally, on the 22 foot distance, we would ask how that would be measured. And I don't think we have any patrol officers up here who are traffic enforcement officers.'",
        "'speaker_5': 'But I think you run the plate and the DMV record would give you the length of the vehicle. And that's we just have to I don't I'm not sure how it's done, but we have to determine that. Or else we have people getting out a tape measure every time they go out to look at one of these'",
        "'speaker_5': 'vehicles. But there's not necessarily agreement on the registration versus what the actual length of the vehicle is. So that's something I'd like to see staff address before we have problems moving forward. I think that's different naturally. Okay. I think we're good.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. So my position is rather a little bit since the last time we had this conversation initially, you know, I, I said if someone has had their RV, has a had any issues neighborhood, sort of hasn't complained about it, then we should give that person a break.'",
        "'speaker_5': 'But in thinking about it, over the last few months, my district in particular, we border a number of different cities, Lakewood, who has a different policy than Bellflower Compton, Paramount. We bought all those cities, and I think it is clear that we have a very clear message on this policy.'",
        "'speaker_5': 'So I do support, you know, having, you know, one clear restriction across the city that that will be very clear to people who live along the borders as well. I think the permits online and free is good and renting an RV for the first time this past holiday, you know, between Christmas and New Year.'",
        "'speaker_5': 'And, you know, I kept it on my street for a couple of days before and a couple of days after. And I think I wouldn't want to have to take an additional step to go somewhere and get a permit, you know, while I'm coordinating vacation.'",
        "'speaker_5': 'So the fact that you can, you know, you can get it online is free. And how would this work? We just simply printed out online and posted. Okay. So print out online, print on dashboard. I think that's seamless.'",
        "'speaker_5': 'That's great. So good work on thinking that through. There's been a lot of chatter on next door and in the neighborhood associations about this concept of a sanctuary district. I've tried my best to try to refute this concept that it wasn't driven by city council or city staff.'",
        "'speaker_5': 'But can we can I just have city staff respond? Is there a proposal for a sanctuary district anywhere in town that says, Hey, our district is open for RVs and all the rest of them are closed?'",
        "'speaker_2': 'No.'",
        "'speaker_5': 'I think you can't get more clear than that. And then my final question is, and it might have been in the presentation, but how long until this is implemented should the city council adopt this?'",
        "'speaker_0': 'I'm going to let Mr. Beck respond. But if we add the aspect of going to the Planning Commission for.'",
        "'speaker_4': 'The gate issue, that could certainly.'",
        "'speaker_0': 'Add several months to the time before it comes back to the council.'",
        "'speaker_5': 'Okay. I'll just ask ask that, you know, once we get all everything worked out and we do have it ready to go for prime time, that we give a break to the people who, you know, we don't immediately start hammering people who take a minute to adjust to this.'",
        "'speaker_5': 'So we should have some some warmup grace period. So, you know, people who may not be too happy about this, we get a chance to kind of get in the warm up to it a little bit. So we should we should just, you know, think about our residents in that way.'",
        "'speaker_5': 'Thanks a lot.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_7': 'Yes, thank you. Great work to staff and great work to Councilmember Councilwoman Price on this item as well. I will be supportive here, but I do want to mention a few things that my colleagues have mentioned as well.'",
        "'speaker_7': 'And I look forward first, I look forward to the safe parking program that Councilmember Pearce is talking about because we can't talk about this issue, I feel, without addressing the fact that people are living in their RVs, and I think it is a real issue that has to be tackled and we have to figure out some way'",
        "'speaker_7': 'to tackle that. And although this doesn't address that specifically, I look forward to hearing more information from her office. Secondly, can you clarify I know that it is included in here as to the commercial use of oversize vehicles.'",
        "'speaker_7': 'For instance, in the first District, we have the Magnolia Industrial area who where many business owners have overnight vehicles and they have them there at two, three in the morning and they start, you know, at four in the morning.'",
        "'speaker_7': 'So can you just clarify for me how that would work into this ordinance?'",
        "'speaker_0': 'Councilmember. I think I think there's two ways to address your question. The first would be that generally in a municipal code, a vehicle has to be moved within a 72 hour period. Otherwise, it can be cited and potentially towed.'",
        "'speaker_0': 'So in a commercial zone such as Magnolia Industrial, we know that we have oversize vehicles that are used for commercial purpose, but those are being moved constantly. If there was a need to address parking issues, we would look at those particular areas on a case by case basis and devise an appropriate restriction based on the needs of'",
        "'speaker_0': 'that particular district. I think you're you're very familiar with the area in your district. And I think what we would look at is how if if restrictions were needed, how would they be addressed in MiG?'",
        "'speaker_7': 'Yes. And I'm wondering if there is a way it seems to me that it would be a case by case basis. But since areas like that are primarily like over 75% commercial, I'm wondering if we could maybe air towards the, you know, allowing the vehicles to be there a little bit longer because they are you know, there's'",
        "'speaker_7': 'no residential in the area. So I'm just wondering how that fits in. But of course, it's, you know, up to your discretion to to figure that out. And that should be fine. I just wanted to point that out.'",
        "'speaker_7': 'And then I think those are all the questions that I have, but I think this is a great item. I know many residents in the First District have had the same issues related to just overnight vehicles staying for, you know, significant amounts of time.'",
        "'speaker_7': 'So. Thanks so much for the work. Appreciate it.'",
        "'speaker_0': 'Thank you, Councilman. Awesome.'",
        "'speaker_8': 'Thank you. And I think most of my concerns have been addressed by my colleagues. I didn't want some clarification on the the was it a substitute motion or the from Councilmember Price regarding a case by case basis? Can can we clarify with that which you actually met on that.'",
        "'speaker_7': 'An original motion.'",
        "'speaker_8': 'It's in the original motion so so in the staff report it says the currently currently the city approaches parking restrictions on a case by case basis. So in the original the motion basically it sounds like it does the same thing that we're currently doing.'",
        "'speaker_7': 'Well, no, I don't think so. I think right now we don't ban our RVs on every residential street. And with the passage of this, we would and then we would allow certain limits to how long RV can be parked outside of a residential in a residential neighborhood and the public right of way for a certain period of'",
        "'speaker_7': 'time. That particular aspect of the exemption would be subject to case by case determination at the discretion. So if they wanted beyond 72 hours or if they wanted more than 20 permits. So just as to those two areas.'",
        "'speaker_7': 'But but the idea of whether you can park your RV outside of your home would would be addressed through the change of the ordinance.'",
        "'speaker_8': 'Thank you for that clarification. And to staff, I think obviously, are we supporting this? I do recall having some some conversation when this item first came before us regarding RV being parked in commercial corridors and business or in impacting businesses.'",
        "'speaker_8': 'Does this particular item address that in any way?'",
        "'speaker_0': 'Councilmember Again, we're focused tonight on residential neighborhoods and communities, and then we would look at commercial areas and industrial areas on a case by case basis if a restriction was needed to be added in those those particular zones.'",
        "'speaker_8': 'Well, I certainly have heard enough from our residents to know that this is this is something that most of the residents in my district would see as something welcome. This is a welcome change. It provides uniform uniformity and clarity.'",
        "'speaker_8': 'And so I think staff has done a great job on that. I mentioned the commercial corridors because of the potential for the unintended consequences. And I do figure I do figure that we will be discussing that more in the future.'",
        "'speaker_8': 'So I'll be supportive tonight, but also be watching very skeptically about how those how this policy impacts our business districts as well.'",
        "'speaker_0': 'Thank you very much, Councilman. Councilman, Mongo.'",
        "'speaker_3': 'So one of the things that we don't want is for this to be delayed tonight. So I think that I'd like to offer a firmly back to your original motion where we pass this as written tonight and instruct the city manager, help me of what I can do on the gate so that it is a second degree'",
        "'speaker_3': 'thing, so that you'll bring this back right away as is. We'd still like to address the gate.'",
        "'speaker_0': 'Being a requirement. So tonight is a.'",
        "'speaker_4': 'Is.'",
        "'speaker_0': 'A consideration to request my office to prepare the ordinance as amended by the friendly that we would be going to Planning Commission to amend the zoning.'",
        "'speaker_4': 'Ordinance to remove the requirement.'",
        "'speaker_0': 'Of.'",
        "'speaker_6': 'Parking that it must be parked behind a gate.'",
        "'speaker_0': 'If you eliminate that third portion.'",
        "'speaker_4': 'Then we could.'",
        "'speaker_6': 'Create the ordinance.'",
        "'speaker_0': 'Bring it back. But you still have to.'",
        "'speaker_4': 'We'd have to do the signage before you could ever implemented.'",
        "'speaker_0': 'And we'd also need to go to a Coastal Commission and have Coastal Commission.'",
        "'speaker_6': 'Weigh in on either accepting it or proposing whatever changes they would.'",
        "'speaker_4': 'Propose to that before you could implement the ordinance.'",
        "'speaker_3': 'So having to go to the Planning Commission would not include a delay.'",
        "'speaker_2': 'Well, because of the.'",
        "'speaker_0': 'Others, I would say that it does.'",
        "'speaker_6': 'Include a delay.'",
        "'speaker_4': 'Of some amount of time. I know.'",
        "'speaker_3': 'So I'd like to ask that we take that component out and then maybe you and I can work on a separate item that we'll bring back to council immediately to ask the instruction to go to the Planning Commission, asking them to consider removing it.'",
        "'speaker_0': 'You could certainly go separately to have that item considered at a later date and would amend this.'",
        "'speaker_6': 'Ordinance if.'",
        "'speaker_0': 'It was passed almost. So, you know, do have.'",
        "'speaker_2': 'A.'",
        "'speaker_3': 'Dual track. Wonderful.'",
        "'speaker_0': 'Mr. Park. And hopefully, I think as the council process move forward in the other and the signage process, hopefully those two separate items align, you know, as we come out the gate certainly and as an ordinance could come back on a Tuesday after that process.'",
        "'speaker_6': 'Has happened with the commission. You could.'",
        "'speaker_0': 'Amanda. That's great.'",
        "'speaker_3': 'Wonderful. So is that accepted? Wonderful. Thank you.'",
        "'speaker_0': 'Okay. Next up out Councilmember Pearce.'",
        "'speaker_3': 'Okay. Let me try this one more time. Just to clarify for the record, as I mentioned, I had a long list of codes in front of me. So Mr. Parkin, the code that I was referring to is 10.18 .040, which we talked about at length whenever this was originally here, which says no person shall user occupy any'",
        "'speaker_3': 'recreational vehicle, trailer coach van or other vehicle or any public on any public street for human habitation or camping purposes. And when we are here back in October, we had a full conversation about how we don't enforce that because we're fearful that we would be sued for constitutional rights because other cities have been sued.'",
        "'speaker_3': 'And back in October, I had asked that we address that in our code. So will this policy could we use this opportunity now to remove that from our code since we're not enforcing it?'",
        "'speaker_0': 'You could add in in the staff report, I think in March of 17, that item was identified and addressed in the.'",
        "'speaker_4': 'Cases were cited.'",
        "'speaker_3': 'Okay. I'm not remembering seeing the cases. Well, I would like to ask if could make a friendly to include leaving that portion out. You know, so long as things are, people are getting their permits if they're in that 72 hour zone and they're at least abiding with the law if we're not enforcing it already, having policies on'",
        "'speaker_3': 'the books that we don't enforce, I'm certain that we didn't.'",
        "'speaker_7': 'That's okay. I'm not sure I understand what the request was. But let me just make it clear that this item tonight is limited to the issues presented, in my opinion, with what we've heard from residents about regarding traffic safety, visual blight, vehicle corridor obstructions, consistency throughout the state with having the same ordinance in place.'",
        "'speaker_7': 'I did not intend, nor am I prepared to intent, nor am I prepared to discuss and have received zero notice that we were going to be speaking about ordinances involving people sleeping in their vehicles and the legal parameters of such that it's just not on the agenda.'",
        "'speaker_7': 'And in my opinion, I think we're talking about two very different issues. And I think that the recommendation that's being brought forth by staff is really being brought forth as a cost savings to the city, as a consistency issue for the city.'",
        "'speaker_7': 'And I think to conclude that particular item by including issues of constitutionality of other ordinances would just really be out of scope with what this particular item is.'",
        "'speaker_3': 'So thank you for your comments, Councilwoman. I brought it back up because we had a full discussion about it last time not to try to slide something new. And we will be bringing back my colleagues and I will be bringing back the transitional parking.'",
        "'speaker_3': 'I'm comfortable with having that discussion with the transitional parking conversation, and I'll have comments with staff as well. I'll be supporting this tonight. I just wanted to make sure that any time that we have codes on our books that we're not enforcing that we've said that we're fearful of us being sued for, that we take the opportunities'",
        "'speaker_3': 'to address those because that seems like smart governance. So we'll bring it back at the time with the transitional parking, and I'll make sure that you and I have an opportunity to sit down and chat before then.'",
        "'speaker_0': 'That'd be great. Thank you. Well, there's a motion on a second on the floor. We also have public comment now, so please for comment. Come forward. They give you cookies the address the suggestion this in advance a couple times before in fact last week at the Mac committee and that commission.'",
        "'speaker_0': 'One of the things this city should take a look at is what other cities have their private organizations that are private companies that do it, but what they build and I'm thinking of that to PCH and Studebaker, the old tank farm, the old electric plants is to build and it doesn't have to be there.'",
        "'speaker_0': 'A three story, maybe four story, depending on the area it's in building in which people can store their boats on elevated platforms. What the paradigm is, if you have a boat, you call up the facility the night before and say, I want to come down and I'm going to pick up my boat and trailer at a certain'",
        "'speaker_0': 'time. The next day they arrive, they take it and go out and do it, whatever, and then they come back. So I think that's something we should take a look at. They're highly successful. They're operated. I've not personally been in any of them, but they're in the coastline of this state is inundated with those.'",
        "'speaker_0': 'And I think if we can put the word out and provide the areas to put them in, I think that would be great. And I again, as I say, it doesn't necessarily have to be close to the water if you've got some places that are up in the knees, Jesus, that doesn't that has the square footage where'",
        "'speaker_0': 'they can put that in. That would be great. Thanks. Thank you. Speaker Hi, I'm Anthony Cruz with the fifth district. I want to thank all the city council for bringing this item up and also other city leaders. And I'm hello, mayor.'",
        "'speaker_0': 'And it was I just want to say that I think this is very important. I mean, personally in our neighborhoods that are along especially along the park areas, we deal with a lot of RV issues and a lot looking at, you know, people sleeping in their vehicles.'",
        "'speaker_0': 'I understand that it is a touchy subject, but at the same time, you're looking at our these and like what one of the gentleman over here had brought up the issue that are not the issue, but the the fact that people in RV do not consider themselves homeless.'",
        "'speaker_0': 'All right. And I live in a pretty ideal neighborhood. Okay. And I love I love the district. But at the same time, you know, when you're living, you know, in your neighborhood and you're doing what you need to do to to to, you know, be neighborly and love, you know, the businesses and what's around there, you know'",
        "'speaker_0': ', then you find these unintentional neighbors, you know, what I call curbside neighbors that are living, you know, in your street that just, you know, sometimes it's cool and a and they they they're there for the time being and they leave when they, you know, leave.'",
        "'speaker_0': 'But a lot of times they're staying there. They become an intentional neighborhood residents. You know, there's been issue with a couple of them that I have even seen suspicious activity where they come, you know, they have people coming in and out where, you know, they're doing some sort of deal.'",
        "'speaker_0': 'All right. And it's it's like that's not the neighborhood I'm living. And these people roll in with their wills, come in and and plant themselves. You know, I would like to see some special consideration as well, being in front of a park, you know, I mean, kind of considered like a beach because we're not Crystal Cove, this'",
        "'speaker_0': 'is not a campground. And to have all these RV constantly coming in and staying there for days, you know, it's a it gets pretty annoying. You know, I don't pay what I pay for my mortgage to open up my window and see our vehicle along my street, you know, there.'",
        "'speaker_0': 'And again, it is a, you know, only in America kind of problem. But at the same time, it is an issue that does actually affect my neighbors, myself and a lot of us that, you know, that live here as a motorcyclist.'",
        "'speaker_0': 'You know, also dealing with the safety issue. I see it all the time when I'm riding past RVs and what have your cars cannot see when they're backing out of the driveways. It's a it's also very unsafe, you know, anyways, I'm coming to an end.'",
        "'speaker_0': 'But at the same time, I just want to say I'm I'm for this. I hope that you guys would consider this and not add too many implementations that would, you know, give them still leeway and freedom to, you know, continue doing what they're doing.'",
        "'speaker_0': 'Again, I want to thank City Councilwoman Stacey Mongo for her support and help and her awesome staff. They're very patient and they've dealt with me. So I got to say, you know, kudos to you guys. Thank thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'And Jenny Hall, back Salters and Belmont Shore. I want to thank Susie Price for all the work that she and her staff have done. On this because we brought it up multiple times and it's very important to a lot of people.'",
        "'speaker_3': 'So thank you. I just wanted to add a couple of things. That 72 hour criteria, you know, might be a good idea to get some guidelines written down about that, because I can just see, you know, people saying, well, my neighbor got an exemption.'",
        "'speaker_0': 'I didn't.'",
        "'speaker_3': 'You know, and so I think that it may not be need to need to be written into it's being approved, but at least there has to be something in writing maybe by the parking group as to what will be approved for an extension and what won't.'",
        "'speaker_3': 'The other I have a question or I'm not really familiar with this requirement about the gate and all. I just wouldn't want to see people now suddenly thinking that they can just have a 22 foot vehicle parked in a driveway.'",
        "'speaker_3': 'And then we're trying to back out of our driveway and our neighbor right next to us has this huge vehicle and we won't be able to see who's coming. We won't be able to see pedestrians, little kids. That could be a problem.'",
        "'speaker_0': 'I just want.'",
        "'speaker_3': 'To say also that I don't think our city streets are the place for camping or vehicle storage. Just to say that we've had multiple meetings with our police department and the they've said this and also the neighborhood.'",
        "'speaker_0': 'Watch.'",
        "'speaker_3': 'Group, one of the cornerstones of that is know your neighbors, know who lives on your street by name, know what their habits are and know what vehicles they have. And we really can't do that with a lot of strange vehicles parked all around our neighborhoods.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_3': 'Good evening, council members. My name is Sommer Temple and I am the owner of Downtempo, Storage and Long Beach Shoe Store. Mark here in Long Beach. My father, Dawn Temple, opened the first self-storage facility in the L.A. Basin right here in Long Beach.'",
        "'speaker_3': 'Nearly 50 years ago, the family, business and self-storage industry has been a part of my life since the day I was born, and I have watched it grow and developed over the course of my lifetime. Now, I'm not here tonight to tell you that you should or shouldn't pass this RV ordinance.'",
        "'speaker_3': 'I'm here as a business owner in this city who will be directly impacted and who is intimately involved in this industry. That correlates back to all of this. Right now in Southern California. RV Storage space is tight. RV RV Parking space availability, such as what our facility offers, is not just rare in our city, it's nonexistent.'",
        "'speaker_3': 'We are completely full, and yet we get 45 calls every day for people looking for RV parking storage. The closing of our tourist RV facility has trickled down to our city. We are getting phone calls from those displaced customers looking for places to store their ARVs boats and other vehicles because they have nowhere else to go.'",
        "'speaker_3': 'Shane Carson RV storage is being chipped away at as the also cemetery next door reclaims their land that they owned. We have a serious supply and demand issue in this city and surrounding issues surrounding cities. Excuse me. But as land is not becoming available to build Newport for storage facilities on at the same rate that we're losing'",
        "'speaker_3': 'storage facilities, another example of this of using RV storage spaces in Long Beach is our own facility at 3750 Spring Street at the April 11, 2017 City Council meeting. And sorry, last week that you granted Urban Development LLC the exclusive negotiating rights to develop land for absent that part of our company currently leases from from the airport'",
        "'speaker_3': 'commission. The person in question currently holds 79 spaces. We didn't analysts of these 79 spaces. Based on current addresses we have on file for them cross-reference them to the district lines and determined by each district the percentage of their costs constituents that would be left without RV parking if this goes through.'",
        "'speaker_3': 'I came here tonight because I do have concerns about what happens if the ordinance eventually comes to pass. Where can my 79 little customers and your constituents go to safely store their vehicles in the city? And I have to wonder, both sincerely and respectfully, how you can complement, how you can consider both banning RV parking in Long'",
        "'speaker_3': 'Beach and control at the same time, reducing the amount of RV spaces available here as well. I thank you for your time.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mayor Council. My name is Angela Kimball. I live in the unincorporated county island area. I testified before you on this issue. I want to thank Susie Price for bringing us back to the council floor and discussing it.'",
        "'speaker_3': 'We recently enacted a similar ordinance in the unincorporated county island of Long Beach. It is working. It has been it is effective. There's some bumps in the road that, you know, have to be ironed out as some of the council members, I believe it was.'",
        "'speaker_3': 'Councilman Richardson said there was a grace period involved to kind of ease neighbors into the new policy. It's this has been a long time coming. It's been a as I said, it's been effective. Yes. RV storage is sometimes difficult to find in your own city, but there are spaces available.'",
        "'speaker_3': 'My family owns RV. We store it, we bought it. We understood we needed to store it and not impose that upon our neighbors. When we bring it in, we bring it in for 24 or 48 hours. Load it up, go have a great time.'",
        "'speaker_3': 'Come back, do the same thing. Get it out of the neighborhood. It doesn't belong on our public streets. Our public streets should not be a storage yard. That's the bottom line. It's a public safety issue. We've had people in the past in our community who've turned them into third, fourth and fifth bedrooms.'",
        "'speaker_3': 'They're living in them with water lines strung across the street, electrical lines strung across the sidewalks, and they tell their neighbors, tough. I have a neighbor who bought a home across the street a block away from me, and she said it was almost a deal breaker for them to buy that home with an RV parked out front'",
        "'speaker_3': 'where the neighbor had his nephew living in it. And then, of course, about a year later, he goes to sell his house and oh, lo and behold, he realizes, hey, it's not really a good marketing tool to have a 35 foot RV parked in front of your house.'",
        "'speaker_3': 'I'll go move it near the school so the kids can deal with it. Trying to cross going back and forth to Patrick Henry. Nice guy. But really, the bottom line is the nation's largest RV and camping organization, the Good Sam's Club, they've said it best.'",
        "'speaker_3': 'The residents want a long term solution to a decades long issue. The public streets are not a place to store your RV. Thank you. Thank you.'",
        "'speaker_0': 'Next speaker. Hi. My name is Ramon. The main thing that I wanted.'",
        "'speaker_4': 'To emphasize was the same as this the young lady.'",
        "'speaker_0': 'Who was here regarding Temple. I have a lot of people, friends that are in the storage area, and I just want to reiterate that they all they're all saying and there's like six of them that are saying that there's no room for ARVs in their storage facilities.'",
        "'speaker_0': 'Now, I hope that before we get going in, we do that there's some kind of a a look see in to see if there is some if this space is available for people to go, we are going to see escalated costs for sure, you know, to store their their vehicles.'",
        "'speaker_0': 'Another thing that I would like to mention is that it relates to to Jeannie and to Lena Gonzalez, the concerns they have for homeless. And I know we don't want to mix those issues, but how do we discern the two?'",
        "'speaker_0': 'If someone is is living in their RV and who isn't? We need to kind of have a rule on that, something that that coordinates that. Also I noticed that when we picked the the cities that are about our size.'",
        "'speaker_0': 'I think that's what somebody Susie Price said that those cities were different than the ones that the first responders were were had chosen for their examples. So I'm hoping that we're not cherry picking. I don't know if that's true or not.'",
        "'speaker_0': 'I know Eric. He's a good guy. He's not going to do that. But we should have a standard. If we're going to pick on, we're we're going to choose cities of the same size. Let's be standard and pick the let's be standard and pick the same cities instead of play that game.'",
        "'speaker_0': 'You know, the gate thing as far as as far as what Stacy Mungo has said, if you want to go that route, that's fine. But let's make sure that we give those guys a waiver who are in that area, you know, before implementation, till all that stuff goes that are in those areas.'",
        "'speaker_0': 'Um, also visit Vitter visitors that come in. I know people don't want to have all this stuff in vacation, but if somebody comes from another area and they just need a couple of days in that realm, in some area, whatever they are supposed to park it, I think we need to probably have a sign where they need'",
        "'speaker_0': 'to know. I mean, we're going to have the sign saying, you know, you can't park 72 hours, get a permit, but maybe even like an email or an address for them to go to get the permits to make it easier for someone who is who is trying to get a permit and trying to do things a legal'",
        "'speaker_0': 'way. So, I mean, I'm not going to say one way or another which way you should go, but these are just thoughts that I have. All right. But the next speaker, please. Hey. Good evening. I'm going to have the counter speakers.'",
        "'speaker_0': 'Listen, these are our last two speakers. Looks like a case of the gentleman in the church. The last one. Thank you.'",
        "'speaker_4': 'Good evening. Thanks for hearing my comment, Chris. Jake was from fifth district. I'm concerned about.'",
        "'speaker_0': 'So the gentleman in the red shirt was the last speaker before I cut off the speaker's list. The want to speak on this topic, sir? Okay. So you'll be the last speaker. That's the last speaker. Okay, then. Anyway, so I was concerned about separating the gate issue and I think there might be a timing.'",
        "'speaker_4': 'Issue that could come up. So is it that we'll see the gate issue reintroduced into this bill, you know, say a week from today or whatever, so that we could see that that would be part of it. Also, does the permit process allow you to take out multiple permits at the same time so that you can depart'",
        "'speaker_4': 'and arrive? And another concern would be for guests guest permits. Something that would allow them to, I guess, stay maybe move out of the way of the street sweeper and then come back. Right. It may not be practical if you have out-of-town guests and they have to leave for a day and then come back to another permit'",
        "'speaker_4': 'or something. Given the fact that they you can you can actually get a permit. Thank you.'",
        "'speaker_0': 'Thank you, sir. All those issues will be. We'll look at those. Okay. Next speaker.'",
        "'speaker_8': 'I repeat, with black votes matter. And one thing I was trying to find out, because I didn't really know what this agenda was all about. And I was listening as Rahm was speaking. And I remember another time Ramos speaking just like that.'",
        "'speaker_8': 'And you were joking, shucking and jiving, laughing. And he he got angry and he blasted you. And then he walked out angry. Now it was you work for we the people. You make money and you're the boss here and everything.'",
        "'speaker_8': 'But you work for us. So why don't you stop doing that? Every time he looked at you, you did. And then he has to look over Mr. Richardson, Mr. Austin, whoever, because you are joking. Now, this is only Republican, but you got to get your votes.'",
        "'speaker_8': 'Republicans, stop voting with these suckers. Now, listen, you got to be more respectful. Yeah, I think I thank you today for paying attention. They were respectful. Stop that. And what are you still doing here, Miss Karl Marx? I thought you was leaving.'",
        "'speaker_8': 'I'm done.'",
        "'speaker_0': 'Next speaker. My name is Sarah erm from Park Estates. Thank you, Susie, for doing this. We've been dealing with this issue for years. I've been there for five years and we've been struggling with the RV issues. It's temporary parking, temporary living.'",
        "'speaker_0': 'And we have it's an incessant problem. And I want to thank you very much for taking taking the bold steps to get this taken care of. Appreciate that. Just a couple of questions for the people that are visiting.'",
        "'speaker_4': 'How are they going to print.'",
        "'speaker_0': 'The the parking passes if they don't have a printer in their RV with them? There's got to be some way for them to print it. And the second would be, as I used to live in the neighborhood, that young or the young lady behind me over in the unincorporated Longreach area we have over there, we had issues'",
        "'speaker_0': 'or people that had limousine services, so they would drive their limos, their limos are their work and so they're parking their limos and they're definitely longer than 22 feet. And so how are those going to be addressed? Has there been any thought as to the impact that that's going to be on their livelihoods?'",
        "'speaker_0': 'Just just a question. Thank you very much. Thank you very much. In the last speaker, please.'",
        "'speaker_4': 'My name is Mark Levin. I live on Flint in the third district and I 100% support this as an RV owner. I keep my RV in storage. I'm responsible. I just want to I appreciate you bring it up to the two questions regarding the permitting process.'",
        "'speaker_4': 'I just want to would like some clarification that if you need an extra permit that it's seamless and not you don't have to jump through hoops. It's relatively easy to get like the first one. And then the second is the tow permit limit that would limit you to ten uses of your RV per year.'",
        "'speaker_4': 'It seems a little like some people use their RV several times a month. Some people use their RV for for sports, for their you know, for their kids. I just think ten uses is it might be a little light.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes public comment. I'm going to go back to Councilman Price, and I just want to add a short comment. Let me just first say to particularly Councilman Price and concern monger who have both worked on this, very supportive of this.'",
        "'speaker_0': 'And I just want to also just note and staff and I were discussing this when this issue came before the council, when I was on the council maybe five years ago or so, it was incredibly contentious and unorganized and unproductive process that ended up not going anywhere.'",
        "'speaker_0': 'And I think that getting to a point where I think the community has been heard and there's been comments and there's been a lot of work done by Councilman Price and Councilman Mongo. I know Councilmember and has been involved on this issue as well, I think is a testament to the hard work that's gone into getting here'",
        "'speaker_0': '. It just didn't overnight happen. I think there's been a lot of conversations and a lot of community input on this process, and so I'm very thankful that this process has gone the way it has because the last time was one of the worst possible processes that I've seen since I was on the Council.'",
        "'speaker_0': 'And Mr. Russell knows exactly what I'm talking about because he was here, too. And it was it was terrible. So so thank you to everyone that's contributed to this. I want to just add, Mr. West, when we're working on the interface for the permits, I think I think you heard a lot tonight about ensuring that it's an'",
        "'speaker_0': 'interface that is easy to use and is not complex and is hopefully something that for residents that can easily, you know, do go through that permitting process online in a way that it's easy for them to do. So that would be great.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_7': 'Thank you. And thank you, Mr. Mayor. And a lot of my colleagues have of share the responsibility of how the item has come before us now, and their partnership has been really, really vital to the process. So it's really just definitely was a team effort.'",
        "'speaker_7': 'I will say that in regards to RV storage availability point, very well taken. My chief of staff, Jack Cunningham, did have an opportunity to make some calls today. So we know that there is RV availability in very short distance from the city of Long Beach, and Carson has lots of availability right now.'",
        "'speaker_7': 'So we called and confirmed it today, $130 a month. So if you need help with that or if you're a third district resident and you're concerned about that and that's causing you stress, please contact our office. We will help you do what we can to identify various RV sites.'",
        "'speaker_7': 'And the original item that I authored and brought in October had a list of storage facilities that you could also call. And at the time, several of those had vacancies as. Well, so we can send you that item or we can help put you in touch with an RV storage yard.'",
        "'speaker_7': 'So thank you to the residents who came out, and thank you for sharing with us the concerns you have in your community. And I'm glad that we were able to move something forward that addresses your concerns.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_3': 'Yes. I also appreciate, Summer, that you came down for this today. I spoke to Marlene on Saturday, and I do my best within the legal authority to within what Charlie will allow us to share, update her as I can.'",
        "'speaker_3': 'And I know that you're running the organization right now, and I hope that we can have a better relationship. I know we have some distance in terms of mileage, but perhaps that we can can be on the same page a little bit more with that, because there are facilities even on Carson Avenue that do have availability and'",
        "'speaker_3': 'there is no intent to want to close down RV storage facilities. But we do need to explore all of our options and job creation within the boundaries of the city, and that process does have to go through certain steps along the way.'",
        "'speaker_3': 'So I appreciate your continued partnership. Great to see you and your your entire group here today to support and be here to voice your opinion. It's really valuable. And we appreciate you. Thank you.'",
        "'speaker_0': 'Okay. Thank you. There is a motion and a second and then Mr. City attorney will get to work on this. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. All that came for the item. We're going to be moving on just now. We're going to be doing a public comment. And then I'm going to take the two items on the farmers market and the urban ag item.'"
    ],
    "Feasibility of Farmers Market Ordinance and Fee Reduction.": [
        "'speaker_0': 'Is there Nicholson here? Okay, now Nicholson is not here. Okay. And I called Mr. Kennedy. Mrs. Kennedy, not here. Okay. Mr. Kennedy, I hear we're going to go ahead and here item madam. Quick item number eight.'",
        "'speaker_1': 'Item eight, say communication from Vice Mayor Richardson. Councilmember Pierce, Councilmember, your UNGA recommendation to request the city manager to explore the feasibility of establishing a farmers market ordinance that requires farmer's market in Long Beach to accept cow fresh electronic benefit transfer cards.'",
        "'speaker_0': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. The purpose of this recommendation is simple. We want to make sure as many residents as possible gain unfettered access to fresh fruit. Now we know because our health department, our heels on many of our initiatives in our city, have done this work for years, that there are barriers to accessing fresh fruits and vegetables'",
        "'speaker_5': '. And farmer's markets have really been a they've been a a real they've done a lot of good work in making sure that we've we actually have these have access to these in our community. We worked for a number of years on a number of different farmer's markets in North Palm Beach.'",
        "'speaker_5': 'And it was frankly, it was different, difficult to navigate in terms of getting them established, making sure that they're sustainable, making sure it's easy to engage with the city. We've done mobile food stands. We've done a number of different activities.'",
        "'speaker_5': 'And we've noticed that some cities have taken some steps, like making sure that you deal with one point of contact and like sort of one expert, a farmer's market expert in our city that helps you to navigate those those permits that are across multiple departments.'",
        "'speaker_5': 'It didn't cost any money. It was a matter of just sort of realigning how we engage. So what we want to do here is we want to explore two things. We have a farmer's market in our city. We want to we want to explore the feasibility of making sure that you do accept the Cal Fresh program.'",
        "'speaker_5': 'Cal Fresh has accepted in a number of our farmers markets and having a policy that ensures access to all of them, or at least those are located on city property makes sense to me and can further ensure that our residents do have that access to fresh fruit and vegetables.'",
        "'speaker_5': 'Now there is a perception that applying to accept and implement Cal. Cal Fresh can be confusing and difficult. So I want to make sure that this feasibility study looks into looks into this perception. And if it does seem to be true that it's, you know, unfeasible.'",
        "'speaker_5': 'Then we look at ways to ensure that the city can assist these farmer's markets in ways to make this reality. So this is a good thing. This isn't intended to be a burden on an existing farmer's market. The point here is we want to make sure that we do assist these farmer's markets because, you know, the outreach'",
        "'speaker_5': 'we've done, these folks, they want to achieve it, but they've they've run into, you know, different issues here, there. So this is an opportunity for us to take another look at these barriers, get some expertize in terms of someone locally, internally that can help them navigate this and see how we can make sure that we look at'",
        "'speaker_5': 'these permits, license fees, any other barriers to establishing markets and to having our own sort of ombudsman as well as access to the Cal Fish program. And the hope is that we explore this. We come back within the next 60 days.'",
        "'speaker_5': 'What I'd like to see is, hey, these are what the burdens are that we've heard of, and this is where we think we can be. We don't want this to be a punitive process. These are these are typically good minded folks.'",
        "'speaker_5': 'These these individuals do farmers markets. We want to just make sure that we're sending the right message to the whole community. And, you know, other cities are starting to navigate some of the same stuff, that this is an opportunity for us to also be aligned with other cities that are taking taking these steps.'",
        "'speaker_5': 'So that's the gist of this. So this is my motion. And thank you, Councilman you, Ranga, for your second.'",
        "'speaker_0': 'Councilmember, your ranga.'",
        "'speaker_4': 'Thank you, Vice Mayor Richardson, for bringing this forward and for inviting me to participate in this and this issue. I think it's very important that we expand the opportunity for farmer's markets to get out there, and I hope that this does precisely that, as well as providing an additional option for people with cards to purchase some fresh'",
        "'speaker_4': 'fruit and vegetables. So I totally support this this this item. Thank you.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_7': 'Thank you. To support this item, I think it's a really fantastic concept and I'm happy that we're requesting a feasibility study because there be a couple of components that hopefully would be included in the study. And I'm hoping that the maker of the motion and the authors of this item are supportive of a study that would include'",
        "'speaker_7': 'a couple of things. The first is, you know, having a liaison, farmers market liaison or ombudsmen, as Vice Mayor Richardson mentioned, is a good idea. But I would really caution us to explore and think outside the box about who that person could be like.'",
        "'speaker_7': 'Could it be an existing staff member that we have or a management assistant or even an intern who wants to later work with the city that might be able to take on a program like that so that we're not, you know, spending money on another position, especially with I don't know that a new position would be warranted'",
        "'speaker_7': 'for just this responsibility, but I just want to be mindful of that. And then the second would be, I would hope that the feasibility study would include things such as maybe doing a pilot in certain areas, because I'm assuming there would be some costs associated with purchasing the card reader or having a staff member or volunteer work'",
        "'speaker_7': 'the station where the card reader is. So hopefully the feasibility study would look at what that kind of a cost would be, whether people can opt in and out based on demand at their market, so that, as Vice Mayor Richardson said, we're not placing a burden because I don't view this item as intending to place an additional'",
        "'speaker_7': 'burden. So I support it. And hopefully Vice Mayor Richardson and the authors are agreeable with the feasibility study being broad enough to include those two topics.'",
        "'speaker_5': 'Thank you. I just want to respond. So I'm good, but I do want to say something every time we want to do something for for people who are in need, we always claim fiscal problems there. There was nothing in this motion that says hire anybody.'",
        "'speaker_5': 'We had help people in our health department. And I just want to be clear, make a statement here. We have people in our health department. We're just asking them to take a look at the best way to do this.'",
        "'speaker_5': 'So I don't want to make it seem like we have to be creative or don't spend a dollar that's not in this motion. We want I mean, we have we have capable staff here. We have management assistance. We have all these individuals.'",
        "'speaker_5': 'And if there are concerns, I would hope that we don't muck up this by saying, hey, this isn't really important, therefore let's make sure we don't spend any money on this. That's not the message I want to send here.'",
        "'speaker_5': 'We've done this a number of times where we explore different things and our staff is creative and able to figure it out. So I do want to be clear this is important. Access to fresh fruits and vegetables is important, and they will do their diligence, city staff on the feasibility and report back.'",
        "'speaker_5': 'And in terms of the other the other recommendation in terms of pilot, I don't support a pilot. I think we should there's only a number of farmer's markets in our city and some that are in the process. I think we should talk to those ten different individuals.'",
        "'speaker_5': 'It's not that many and see if this is feasible. So, no, I think no matter where you live, we should be trying to provide access, not about a pilot. We throw out an idea about a pilot, about ARVs.'",
        "'speaker_5': 'No. After having those conversations and sort of we came to a place that, you know, the whole city deserves this. So I would not be open to a pilot. I think we need to have this conversation. It comes back and it's not feasible.'",
        "'speaker_5': 'Then we'll address it. Those are my positions on that.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_7': 'Yes. I'd like to thank Vice Mayor Richardson and Council Member Saranga for being bringing this forward. I think it's a great item. I would agree to that. We need to keep something more longstanding and sustainable in the city of Long Beach.'",
        "'speaker_7': 'I know that some farmers markets do already accept MBT, which is fantastic. If we can look into this a bit further, it would be great. I would add one thing, though, if you would be up for this tiny, friendly amendment, but it would just be, and I'm sure you've already thought of it.'",
        "'speaker_7': 'Just knowing you is outreach to and trying to create better outreach to Cal State, Long Beach students and Long Beach City College students. I think all of us know the statistics are about one in five of every CSU or college student is suffering from lack of healthy, good, healthy food.'",
        "'speaker_7': 'And so I think if we bolster that program a bit and I know Cal State Long Beach is already doing this to some extent, it would be good to highlight that if we do get something in place.'",
        "'speaker_3': 'Absolutely. Okay. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'Thank you. I'm going to be supporting this item because I think it makes good sense. And I would just ask that, you know, the we may not always agree 100%, but a disagreement. And I welcome the input from all of my colleagues.'",
        "'speaker_8': 'I have a couple of farmers markets in my district. I've always been very supportive of them. I will continue to do so. I will recommend the staff go and talk to the folks at the government leaders who've implemented CBT at the farmers market like three years ago.'",
        "'speaker_8': 'So this is not anything new. Other farmers markets actually do already recognize MBT And, you know, it's just a process, I think, working with the county to get a system in place to coordinate that. And so I'll be supportive of this and invite you guys to visit the Uptown Farmers Market every Thursday, 6 p.m..'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_7': 'Thank you. And I just want to clarify, I wasn't trying to, quote, make up any item. I think it's a great item. So I said that before I'm and I repeat it because I think maybe that was lost on me just asking a few questions.'",
        "'speaker_7': 'Sometimes when we support one another's comments, we also ask tough questions or we ask questions that are interesting to our constituents. So in this particular case, we did reach out to our farmers market. And the only thing they said was, could the report include the possibility of, you know, would there be any costs associated with a card'",
        "'speaker_7': 'reader and a staff member to man, that particular man or woman, that particular station? And if so, then could the farmer's market have the opportunity to determine whether or not they have a customer base for T readers? So that's all I was trying to say.'",
        "'speaker_7': 'I really wasn't trying to be negative about the item or say anything other than it's completely 1,000% fantastic. I was just asking a few questions and even if there were a fee associated with it, I'm not saying let's not do it.'",
        "'speaker_7': 'I'm just saying like like I said and then you repeated management assistance people in the in the current city. Those are opportunities for us to actually give people an experience in running a program like this, which would be a really great experience.'",
        "'speaker_7': 'So that's all I was trying to say. I just want to clarify, you know, just because we ask a question about a council's item and ask it in a particular I mean, I've seen really harsh questions be asked preceding someone voting in favor of an item.'",
        "'speaker_7': 'It's not personal and the item is fantastic. Let me repeat that. The item is fantastic. I just want to make sure the report is broad. Thank you.'",
        "'speaker_5': 'Thank you. I'll just I'll just say thank you for your clarification. It wasn't really directed at you. I'm just careful with the message that we send to some of our more vulnerable neighborhoods. I don't want them to think any time there's an idea to help support them, that it always we always sort of go to this place'",
        "'speaker_5': 'of, you know, fiscally it's difficult to achieve. So unfortunately, it came out this way, but it is something I have noticed moving, you know, when we take on issues like this. So but I'm happy we were able to land how we land.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Public comment. Please come forward.'",
        "'speaker_3': 'Hi. My name is Kate Sarnoff. I live in the third district and my family goes to two farmers markets every single week and we love it. And even though I am very, very privileged to live in a high income neighborhood and run into a lot of well-heeled people at those two farmers markets, I would love to see'",
        "'speaker_3': 'people of all stripes and incomes at that farmer's market and to be attracted to those farmers markets because they know that there is a beauty there. And I am also here representing the Long Beach Alliance for Food and Fitness, which is working towards reducing diabetes and other diseases and conditions related to obesity here in Long Beach.'",
        "'speaker_3': 'We know that we have very high obesity rates, very high diabetes rates, and we are working on policies to reduce that. This is.'",
        "'speaker_7': 'One of those.'",
        "'speaker_3': 'Policies that could help because people don't have most people my family accepted don't have the access to fresh fruits and vegetables that that they deserve to have. My understanding is that the vast majority, perhaps eight out of.'",
        "'speaker_7': 'Ten, nine out of 11.'",
        "'speaker_3': 'Of the farmer's markets in Long Beach already have this up and running and have for a long time. And it's no big deal. Right. So I don't think that we need a pilot because we have those experiences to go from.'",
        "'speaker_3': 'I can also say that Long Beach Alliance for Food and Fitness reached out to one of those farmer's markets that does have a diverse customer base, that does not have the beauty in place and offered to help them and were we did not get a response on that.'",
        "'speaker_3': 'And that's part of why we very much support this effort to just have an across the board policy. If we're going to be having more farmers markets that come.'",
        "'speaker_7': 'On board, well, they'll have a heads up already. But this is something that needs to go into their business plan.'",
        "'speaker_3': 'So I don't think it's rocket science. I'm sure that our our current staff could could handle it. And I'm very excited to see us take a clear position on it and support low income people who need fresh produce.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mr. Mayor, and members of City Council. My name is Tony Demeaco and I am co-director of Long Beach Fresh. We work as a local Food Policy Council. I'm also a member of the executive committee of the Long Beach Alliance for Food and Fitness.'",
        "'speaker_4': 'So we have been part of these conversations and very interested in finding creative ways to support farmers markets. And, you know, there's a couple of challenges that are very consistent with farmers markets. One is that it is actually, contrary to popular belief, quite difficult and cumbersome to acquire EBT status.'",
        "'speaker_4': 'You know, there's a federal process, but there is also the kind of complicated process of trying to choose a third party processor. As you may know, these processors are often banks and they operate at a profit. And, you know, they market their services quite heavily.'",
        "'speaker_4': 'And there are kind of multiple ever levels or tiers of fees that they charge from per transaction fees to ATM machine fees. And there have been federal grants that have sought to make the machines free. But those grants from folks we've talked to are often the money's dried up by the time you apply for it.'",
        "'speaker_4': 'So there are real barriers with actually getting there with elite status, and we definitely hope the study would look at that as well as the broader challenges to opening a farmer's market. I think then we can best help and I know this is something that Los Angeles recently passed, and I think they had sufficient ideas in place'",
        "'speaker_4': 'to better support the markets. And I think there are a lot of things the city could do, potentially even looking at ways that the city could actually vet the third party processors, you know, to maybe get better deals with them for the local farmers market.'",
        "'speaker_4': 'So we're just a few ideas from the conversations we've had, but I know a lot of our smaller vendors and you know, I know that farm stands probably wouldn't fall into it, but those are a lot of the folks we've talked to, like the folks that growing experience Farm or Lincoln Spring Farm stand.'",
        "'speaker_4': 'And it's been very difficult for them to get there, even though they've been working on it for quite some time. So thank you to the member or Vice Mayor Richardson for bringing this forward. We think it's a great thing and we just hope the study will be brought into a little bit so we can better address the'",
        "'speaker_4': 'challenges of getting it status. And just I guess one last thing to mention is that the markets that we found have been most successful with the VTR, the ones that fall under the in like high poverty areas. But that's primarily because they're able to take advantage of market match, which is a statewide program that we worked for'",
        "'speaker_4': 'a couple of years with this statewide Food Policy Council to get the state to commit $5 million of funding to and receive federal matching grants. So this program is exceptional and really helps to counter the notion that farmer's markets are too expensive because it doubles people's purchasing power.'",
        "'speaker_4': 'And currently, I think all of the markets that are eligible for this program in Long Beach are utilizing it and are very successful. So that's something to look at as well. That would boost CBT benefits quite a bit for those who need it the most.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. And the other speakers, Mr. Goodhue. Very good to clear as the address. My experience with farmers markets began with the when they disingenuous operator the one that operates the what's essentially a de facto arts and craft market in the Long Beach slipped it in as a farmers market and misrepresented the fact that while this was'",
        "'speaker_0': 'going to be a home a a part of, the proceeds will go to the Alamitos Heights Homeowners Association. And the first thing we heard was the president of the association said they could not associate with that because of and this began my education a true farmers market.'",
        "'speaker_0': 'Which I seriously doubt we have in this city. I think the majority and we have our arts and craft markets. A true farmers market is regulated by the federal government. The intent was and the intent is today to bring fresh fruits and vegetables to areas of a city or a county or a country or area that does'",
        "'speaker_0': 'not have a Ralphs, that does not have a lawn, that does not have a food for last, that does not have a smart and final period. You go down there now and in the the one weekly at the end that they snuck into the Marine Stadium.'",
        "'speaker_0': 'It is. They've got liquor. T-shirts. Everything you find out at the checkouts stand at the 99 cent store. Very little that would qualify. I think they have some. But you go down there and check it yourself. Next week I've got two pictures of an I'll show there.'",
        "'speaker_0': 'They are not. They are, in fact. And what you need to understand are really what I say. Arts and craft, market spirit. Now. In addition to that, they are an attraction for these. They come down and scope out the neighborhood.'",
        "'speaker_0': 'I think I related a couple of years ago about the conversation I heard with two guys coming down in the blue line about the one in North Long Beach. And they were telling how you know where to go during that and the shops and the residents to go because everybody's down there and so forth.'",
        "'speaker_0': 'So I would suggest you really get inside of it and figure it out, because what you're actually also doing is inherently reducing or intensifying the propensity of a Ralphs or a local food market to pull up stakes. I don't know how most of you are really, pal people.'",
        "'speaker_0': 'All right. They operate on very thin and thin margins. And when you suck out a little every little bit, it, you know, takes its toll period. So I would suggest that you do your study and go around for yourselves and check how much your arts and crap and how much of your actually true vegetables and fruits certified'",
        "'speaker_0': 'by the government is the type that they intend to destroy and distribute. Thank you. Thank you. Next speaker, please.'",
        "'speaker_8': 'Robb report from black votes matter. Okay, this is a good thing. I agree with it because everybody needs vegetables and all that. You know, it's easy to do something like this because everybody's going to be on the beat and they're going to stay on the beat.'",
        "'speaker_8': 'With these policies, we need more policies as something that can really put something in people's pockets like that airport that left that could have brought jobs, but it didn't. Okay. Like dealing with a legal situation, like not making this a sanctuary city.'",
        "'speaker_8': 'If you wouldn't have done all that and everybody voted on that, then that would have been many more dollars freed up, which I happen to know. You support a lot of these groups with. Or or Karl Marx is over there.'",
        "'speaker_8': 'You know that she should have willed her out. The a wheelbarrow shouldn't even allow her to sit there, you know. Anyway, so we're going to need a beat, you know, because there's a lot of homeless people, veterans. As I walk through, I see them sleeping right by the library and know piss on the ground.'",
        "'speaker_8': 'And I remember, what, about three months ago, there was a $25 million bus be for the homeless. I want to run and ask money. Nobody heard about nothing. They knew. I told them about nothing. Then we just passed something else for the homeless.'",
        "'speaker_8': 'Some always pass for the homeless. But don't. Nothing change, you know. So that's a good thing because they're all on the beat. And I talk to a lot of them. A lot of these homeless living in the canal got degrees on this meth and heroin, you know?'",
        "'speaker_8': 'So we really need to do something about that. That's a good thing. But let's change these policies. Listen, I was coming just hard and I'm not going to just keep coming because we need I'm serious. We need to do stuff, and I'm gonna come hard and certain things.'",
        "'speaker_8': 'But come on, now, all this. 809. No, listen, let's get some good stuff and not just be going one way and let's really do something, you know? And Donald Trump is the man. Remember that? He's the man. He was the man before he became president.'",
        "'speaker_8': 'He's really the man now. Don't mess with Trump. You get Trump out.'",
        "'speaker_0': 'All right. Thank you. Seeing no other public comment, we have a motion in a second on the floor.'",
        "'speaker_8': 'Where did the airport. Poor girl.'",
        "'speaker_0': 'Still here. There's a there's a motion any second on the floor by Vice Mayor Richardson and members. Please go ahead and cast your vote.'"
    ],
    "Ordinance to Establish the Urban Agriculture Incentive Zone Program.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. We're going to hear the urban ag item, which I believe is ten.'",
        "'speaker_1': 'Item ten is a report from Development Services recommendation to request the city attorney to draft an ordinance amending Title eight of the Lombard Municipal Code to establish the Urban Agriculture Incentive Zone Program citywide.'",
        "'speaker_0': 'Mr. WEST. Mr. Mayor, council members, we've been working on this for some time, and.'",
        "'speaker_4': 'Larry Rich, our sustainability coordinator, is going to give us a presentation on it. Thank you, Mr. West. Good evening, Mayor Garcia. And Members of the City Council. Assembly Bill 551 The Urban Agriculture Incentive Zone Act was enacted by the State of California to promote small scale agricultural activities on urban vacant lots.'",
        "'speaker_4': 'The County of Los Angeles implemented its own program in 2016 that allows cities within the county, including Long Beach, to create local urban ag incentive zone programs of their own. This program would give eligible, vacant property owners the opportunity to realize a significant reduction in their annual property tax bill when they commit their property to an agricultural'",
        "'speaker_4': 'use for a minimum of five years. Agricultural uses include urban farms, community gardens.'",
        "'speaker_0': 'And educational gardens.'",
        "'speaker_4': 'Conversion of vacant lots to urban agriculture can produce multiple benefits to the community, including connecting residents to the broader food system, providing greenspace and recreational opportunities, building community and promoting food access, public health and economic development potential. The Department of Development Services, primarily through the Office of Sustainability, would administer the program.'",
        "'speaker_4': 'This administration will include accepting and reviewing applications, executing contracts with eligible property owners. Interaction with the L.A. County Registrar, recorder, assessor and treasurer, tax collector offices and initial and annual inspections of the property to ensure compliance with the UHC contract.'",
        "'speaker_4': 'The Office of Sustainability will also market the program and help connect potential farmers with vacant land owners, ideally utilizing the proposed vacant lot registry. City Council approval of the recommendation today will direct the City Attorney's Office to draft an ordinance to amend Title eight of the Municipal Code to create the UAC program and Title 21 to define'",
        "'speaker_4': 'land use zones eligible to participate in the UAC program. This concludes my presentation. I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you. We have a motion and a second on this summary. Richardson.'",
        "'speaker_5': 'Thank you. I just have a few things. So. So this ordinance coming back, I want to just applaud the Sustainability Development Services team for bringing this back. We requested this back in May 2016. It took a year to come back.'",
        "'speaker_5': 'But the reason why is because this item and the subsequent item number nine, the hope was that they will work together. Item number nine, which we'll hear about, is the the vacant lot monitoring program, the vacant lot registry, which would offer a stick, if you will, to the city, to lots who have been vacant for, you know'",
        "'speaker_5': ', some some 20 years. And work with this as a carrot to say, listen, you know, you have additional standards on your lot. You need to keep it well-maintained and white picket fence. You know, no more code enforcement issues.'",
        "'speaker_5': 'But if you work with a local, local agricultural group, you can receive not only assistance in maintaining your site, but you could also receive a tax benefit. And so the hope is that the two of these worked together.'",
        "'speaker_5': 'So I do want to just thank staff for bringing this forward. We look forward to seeing where there will be, you know, grant case specific fee exemptions and what we have that in this ordinance for vacant lot owners who agree to let let let these lots these vacant lots be used for these these services.'",
        "'speaker_5': 'So we're really pleased to see this come back. And the registry, which is the next next item. And what I really envision is hopefully is vacant lots are placed on our our data lab site. So if you are interested in doing urban agriculture, you can access the registry and really see, you know, see in real time.'",
        "'speaker_5': 'These are the opportunities to go ahead and sort of partner with a local property owner. So thanks to city staff and thanks to the city council for their support.'",
        "'speaker_0': 'Thank you, Councilman Gonzales.'",
        "'speaker_7': 'Yes. I just wanted to say thanks to Larry Rich and your team for working on this. And I know Vice Mayor Richardson had been working on the vacant lot program as well. And I just want to clarify, it will be on the data LP or open LP site, is that correct?'",
        "'speaker_7': 'Are there any other places that it will exist on our city websites to try to market what we're doing here?'",
        "'speaker_4': 'So the Office of Sustainability will definitely support this through.'",
        "'speaker_0': 'Its own website. But being on data, albeit if I'm not as familiar with that, but if that's possible, that will help too.'",
        "'speaker_7': 'Okay, great. Thank you. And I know there's a few people here from the urban agriculture community, and I want to thank them as well, because I know many of them have worked very, very hard to ensure that they're, you know, keeping up these vacant these lots that they have and creating good, healthy food.'",
        "'speaker_7': 'And so I want to thank each and every one of you for what you do. And hopefully this is another avenue for us to provide even more spaces for people. So thanks so much.'",
        "'speaker_0': 'Thank you. Will not take public comment on this item. Any public comment saying. Oh, okay.'",
        "'speaker_3': 'With the union, Mr. Mayor, and members of the City Council. My name is Natalia Kovach. I am a resident of the First District. I also am a member of the Alliance of Food for Food and Fitness. I'm a member of Best Start Central Long Beach, and they serve on the Headstart policy console.'",
        "'speaker_3': 'I'm a mother who lives in the multi-family residential area, as many of Long Beach residents don't. In my neighborhood, one small community garden is garden in Martin Luther King Junior Park, which is fairly small in full in existence.'",
        "'speaker_3': 'It is not very safe and easy. There is a need for more in my neighborhood. For me and mine is for many of my neighbors. We would be happy to be able to grow and purchase local, naturally grown, affordable produce.'",
        "'speaker_3': 'Sometimes I'm able to get to the big park farmers market by traveling there with my child on foot, fix the lawn and it's not affordable. Having the opportunity to purchase quality produce grown on the vacant lot on my block would be amazing.'",
        "'speaker_3': 'The proposal would attract and encourage these opportunities and empower my neighbors and I to take control of our health. Thank you.'",
        "'speaker_4': 'Hello, Mayor. City Council. My name is Ryan Serrano. I live at 81 Chestnut Avenue. I'm the founder and owner of a company called Earth Steward Ecology. We're an ecological landscape development company. My crew and I are a team of ecological thinkers, designers, builders and educators.'",
        "'speaker_4': 'And a lot of our work is basically.'",
        "'speaker_0': 'Retrofitting our outdoor.'",
        "'speaker_4': 'Spaces, our urban outdoor spaces to be more regenerative that is beyond sustainable, beyond just, you know, offsetting the resources that they're consuming, but producing more beyond that. And our work is predominantly working with California native plants and edible and medicinal plants that are endemic to this bioregion.'",
        "'speaker_4': 'We do a lot of work with developing. Food production, food production systems. We also build greywater recycling systems and rainwater catchment systems. I'm interested in this issue because I've been involved for years in urban agriculture, advocacy and work in the city.'",
        "'speaker_4': 'I previously had in a nonprofit.'",
        "'speaker_0': 'Organization called Food Scape, and.'",
        "'speaker_4': 'We were focused on agricultural literacy and and a demonstration project that went on for years right up the street at eighth and Chestnut. And we had a vacant lot that we were building a demonstration food forest, and we had an agreement with a private owner that was terminated when they wanted to sell it.'",
        "'speaker_4': 'But nevertheless, it was a great and powerful project that a lot of people got to experience and be fed from, both spiritually and and literally, you know, as as a food source. And, you know, it's a shame that there aren't more projects like that and there.'",
        "'speaker_0': 'Not more projects being invested in.'",
        "'speaker_4': 'It's an emerging market to be producing food locally. And it's it would be in the interest of the cities, you know, in terms of valuing the area to have more of that going on. It could offer alternative vocational opportunities and learning opportunities for young people who maybe don't.'",
        "'speaker_0': 'Have a path.'",
        "'speaker_4': 'To college or don't have interest in that. It also is is a way for you to be regenerating energy in the city. For as long as we aren't producing any any of our own food, we're dependent on imported food.'",
        "'speaker_4': 'And as long as we're dependent on importing anything, we're permanently exporting funds out of the city. So being economically regenerative is tied into this as well. I think that it's a no brainer to to approve this incentive zones.'",
        "'speaker_4': 'I think city properties should be considered as part of it as well and find a way to, you know, open up those spaces and not just speculatively value them, but what can be built there. And I think creating a clear path to how to do this is really important and not create a bureaucratic.'",
        "'speaker_0': 'Vortex that people get.'",
        "'speaker_4': 'Captured in and to turn away from using these spaces.'",
        "'speaker_0': 'Thank you very much. Next speaker, please. Oh, Mr. Mayor.'",
        "'speaker_8': 'Council. My name is Damon Lawrence, and I'm from Long Beach Grocery Cooperative. Our Long Beach Grocery Co-operative has a mission of opening up long beaches, first property owned, community owned grocery store. Okay, we started we incorporated in 2015, March 2015.'",
        "'speaker_8': 'We started taking shares in April of 2016. We currently have to almost 250 member owners to date, and we have completed a feasibility study that says that the co-op would be a really good fit for our area. Aren't the co-op would probably would make somewhere between 4 to $8 million ish projected in the first year.'",
        "'speaker_8': 'We wanted this urban agriculture agenda item. It would be a gold for us to be able to use locally sourced, grown in Long Beach produce at the cooperative to be able to sell that with cooperatives. That's what they do.'",
        "'speaker_8': 'They start local and try to keep the money local, and having that as a.'",
        "'speaker_0': 'As a resource.'",
        "'speaker_8': 'Would be, as an expanded resource would be great, would be absolutely outstanding for us. Note the also thinking about it, the farms that we do have in Long Beach Farm 59, the going experience. These are beautiful places. These vacant lots are a blight on us right now.'",
        "'speaker_8': 'But you can imagine turning them into farms so kids can actually see the fruit growing that they'll eat, you know? And actually, when you think about it, the co-op will actually allow it to be monetized and actually allow it to be sustainable over a long period of time by buying from those farmers, buying from those local agricultural'",
        "'speaker_8': 'agricultural farmers and supporting them and and their effort. And so it will be something that that they can they can pass forward. Also provide jobs. Okay. As we're as they will be, we'll have they'll be hiring people to work on these farms to sell the produce to to the cooperative.'",
        "'speaker_8': 'All right. Is to have several.'",
        "'speaker_0': 'Co-Ops in Long Beach. Okay.'",
        "'speaker_8': 'Over the long period of time so we can keep money inside of Long Beach. We're currently looking for a property right now.'",
        "'speaker_0': 'Or a.'",
        "'speaker_8': 'Property right now to open the first one. So you guys in your districts that have vacant properties that you would think that would be a good fit for the co-op. Please contact us right now is we're in property search right now.'",
        "'speaker_8': 'I want to thank you guys for your work in this area. Really this really is really makes this possible. The work that you guys have done has made this cooperative possible.'",
        "'speaker_0': 'Thank you very much, sir. Next speaker, please.'",
        "'speaker_6': 'Good evening, Mayor and council members. I'm Dan Rodrigues, third district Columbus resident and current president of Lomita Organic, a nonprofit community garden organization. We currently operate eight gardens in the city, three of which are located on private property.'",
        "'speaker_6': 'And as part of our mission is to educate the community on the importance of being caretakers of the environment by promoting organic and sustainable gardening practices. We accomplish this by converting empty lots into community gardens. Over the past 20 years, this Long Beach Organic has been in existence.'",
        "'speaker_6': 'We've had positive experiences developing agricultural projects on empty lots such as these and that are privately owned lots. However, we still have a waiting list for some of our gardens that span about two years long, so we're still not able to meet that demand that the community has in this area.'",
        "'speaker_6': 'As you're aware, a good portion of Long Beach housing is on multi family dwellings that don't provide space for these types of activities or much outdoor space in that matters as a whole. So from that perspective, community gardens such as ours are places where Hands-On Education, Training and Discovery is provided for children and adults as well.'",
        "'speaker_6': 'Most of our gardens have gardeners that have no previous gardening experience, but as such, we foster a collaborative learning environment where seasoned gardeners and beginners alike can learn from each other. And in this process, community gardens also provide multiple benefits to the community.'",
        "'speaker_6': 'Two of which, as you're probably aware, that provides a place for our gardeners and then in their own neighborhood to grow their food for their tables. And secondly, as has already been mentioned, neighborhoods with empty lots that are often blighted, full of trash become converted into vibrant community gardens.'",
        "'speaker_6': 'And even the neighbors that aren't directly involved still benefit from the existence of these locations in their communities. Additionally, landowners also benefit as they are relieved of the maintenance responsibility for this property. This Urban Agricultural Incentive Act would increase the potential for additional community gardens in the city.'",
        "'speaker_6': 'The tax incentive would be enticing for, excuse me, an enticing factor for someone who is considering such a use for a vacant lot that they might own. And of course, a five year commitment would allow lobbies, organic and similar organizations, to further their mission in this area.'",
        "'speaker_6': 'So thank you for your time.'",
        "'speaker_0': 'Thank you very much. Next speaker.'",
        "'speaker_3': 'Hi. Dana Buchanan, a member of the third district and owner of Primal Alchemy Catering and Events. I want to thank Larry Rich and your staff for working on this and everyone here for not letting this.'",
        "'speaker_4': 'Go super important.'",
        "'speaker_3': 'I come from a little bit of a different perspective as a business owner in the food industry. We are the farmers markets. I don't know what that guy was talking about, but we're at the farmers market five, five or six days a week.'",
        "'speaker_3': 'We had all the markets in town to provide food for our our organic catering business. So this would help alleviate some of the supply demand issues that we have in the city for a lot of restaurants. I know of ten or 15 chefs right now that would totally support any urban farm growing produce for their restaurants, including'",
        "'speaker_3': 'including our business. So this is just a no brainer. It makes a lot of sense to me. One of the things I would invite you to once this passes is to seriously look at a way of streamlining, creating, licensing or permitting process that creates removes obstacles rather than create obstacles for people who want to.'",
        "'speaker_4': 'Get into urban farming, because that's, I'm sure, going to be an issue.'",
        "'speaker_0': 'So thank you. Thank you, Dana. Next speaker, please.'",
        "'speaker_7': 'Hi. Good evening, Mr. Mayor. And council members. We're all together, all four of us. So I would like to have them stand next to me.'",
        "'speaker_0': 'I'm there. That's great. Yes. Please come down.'",
        "'speaker_2': 'Tell them we love that stuff.'",
        "'speaker_7': 'We are survivors of the Khmer Rouge genocide, and we use gardening as a form of healing for us. My name is Laura Song. I am a property owner in the fourth district as well as the sixth District and also the founder of a nonprofit called the ME Center.'",
        "'speaker_7': 'And these are all the members who are benefiting from the ME Center just to introduce this as Miss Kim Tam. She lives in the fourth district. This is Mr. Lim Ching, who lives in the ninth District. And this is Ms..'",
        "'speaker_7': 'Veteran who lives in the fourth District. At the May Center, we use meditation, agriculture, yoga and education to promote healing from trauma as survivors of the Khmer Rouge genocide. My bio starred in Long Beach. I came here in 1992 as a refugee.'",
        "'speaker_7': 'I was ten years old. No one knew I had PTSD. No one knew I lived for 20 years. Seeing my own mother, being near death in a refugee camp. No one could understand that. The spark of my success.'",
        "'speaker_7': 'Going from a homeless kid to a property owner to a founder of a nonprofit that is helping my first generations, my elders who are now still suffering from PTSD. The spark of that genius actually came from my interaction with plants and gardening as little as Long Beach House in terms of gardening, space and plants.'",
        "'speaker_7': 'And we are known as te generation of the cement generation and many of the younger generation are actually suffering from nature deficit disorder. I decided to create a center that uses gardening as a platform for me to teach science and teach the survivors about the science of their bodies so they could empower themselves to heal.'",
        "'speaker_7': 'And I realize the time is ticking, but we do share the 12 minutes. Right?'",
        "'speaker_0': 'Just continue.'",
        "'speaker_3': 'Okay. We have a small.'",
        "'speaker_7': 'Property where we practice natural farming methods to grow native vegetables and traditional Cambodian herbs and plants. Though we have an organic certification. We were surprised to learn that the properties that lie in the residential zones are not permitted to have agricultural use.'",
        "'speaker_7': 'We have identified several vacant lots in our community and that we would like to use to farm and share produce with the community through small markets, restaurants and community health centers. Many of our community suffer not only from trauma but also from illnesses that could be prevented with better nutrition.'",
        "'speaker_7': 'Unfortunately, our neighborhood also lack grocery stores and farmer's markets where residents can access healthy food. We're in central image. Passing this proposal would enable us to better feed our community and grow together by legalizing urban agriculture in our neighborhood and providing incentive to property owners.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Thank you, all of you. Thank you. Next speaker.'",
        "'speaker_2': 'Please.'",
        "'speaker_3': 'Good evening, Mayor Garcia and City Council. My name.'",
        "'speaker_7': 'Is Mary Redfern.'",
        "'speaker_3': 'And I live in the fifth District and I'm here to voice my support for urban agriculture in Long Beach. I don't represent a specific organization, but I'm deeply involved in advocacy advocating for sustainable agriculture locally. I'm a master's student at Cal Poly Pomona studying environmental sustainability.'",
        "'speaker_3': 'I'm a gardener at the Long Beach Community Garden at Eldorado Park. I volunteer to teach gardening at Mark Twain Elementary through.'",
        "'speaker_7': 'The.'",
        "'speaker_3': 'UC Master Gardener, L.A. County Master Gardener program. And I also work part time for the University of California Department of Agriculture and Natural Resources supporting local urban farmers. I love what I do, and I never thought that I would get so much joy out of teaching third, third to fifth graders gardening.'",
        "'speaker_3': 'But on a more serious note, as we move into a future where climate change will have a real global impact, the decisions we make for the future of urban areas are crucial. Making the path easier for urban ag in our city with incentive zones is a win win, and it's really.'",
        "'speaker_7': 'The minimum that we can do for social.'",
        "'speaker_3': 'Health and economic benefits of urban AG are well documented. I want to thank everyone here that has supported this idea. From those of you at the city, to the advocates behind me and also the advocates that couldn't be here tonight.'",
        "'speaker_3': 'But let's keep in mind that this ordinance is just the beginning and that the real work comes next, because like the soil and a garden that must be nourished before we can plant in it. Good things take time.'",
        "'speaker_3': 'So furthermore, we have some great advocates who work full time, have families, manage gardens, run farms. Yet they make the time to advocate for this because it's truly a transformative cause. So let's join our partners in the city of Los Angeles, where urban agriculture incentive zones passed this morning, and move forward with ideas that benefit the greater'",
        "'speaker_3': 'good.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'What's your plot? Number five. I'm an observant.'",
        "'speaker_5': 'Jew. Greetings. My name is David Herron. I'm a district resident. I am an industrial designer by trade. I'm an educator at Cal State Long Beach. But one of the things I'm most excited about is urban agriculture. So I work with an organization.'",
        "'speaker_5': 'It's a nonprofit social enterprise called Our Foods. And we are just setting our claim here in Long Beach, or I'm helping bring it to Long Beach, trying to do more. And I think that advocacy of this program and taking it forward will greatly expand those opportunities.'",
        "'speaker_5': 'We are a strong regional organization. We have programs going all the way up to the jail system in San Francisco. We have programs in Riverside and throughout L.A.. So just trying to bring more of that here into Long Beach as well.'",
        "'speaker_5': 'Our most recent project here in Long Beach was implementing, designing and implementing in a very short amount of time the learning garden at the Michelle Obama Library. And of the times I've been there on a weekly basis, sometimes many more.'",
        "'speaker_5': 'I interact with a lot of the patrons that come and use that space and of this grand amazing library that the garden is one of their highlights. So just to show the impact that's already created and that was an empty lot previously.'",
        "'speaker_5': 'So this proposal increases opportunities to work with local communities, and it also enables others to grow more food and organizations to come from that opportunity. It also addresses some of the current barriers and some of the things like lack of space opportunity.'",
        "'speaker_5': 'There's other issues in helping the urban ag industry take off. It's relatively new and there's a lot of growth in its future. But we do have a lot of barriers in place. So land is one of those things.'",
        "'speaker_5': 'So some of the key points that I see with Urban AG and what gets me excited is the diversity that's around. You know, we have local breweries, you know, talking earlier about making local beer. Well, we can also grow local hops for those breweries.'",
        "'speaker_5': 'We have a lot of amazing chefs and restaurants that are being showcased, especially at like music, taste good festival. People are coming into this town to see the amazing food being prepared, but we're also growing a lot of amazing food, like at the Garden Experience and some of these other farms that I work with.'",
        "'speaker_5': 'And one of the last things I want to end on in terms of my work with our foods is we're not really about growing food as much as growing jobs and education, and the food is just a great byproduct.'",
        "'speaker_5': 'So with that in mind, you know, creating more incentives and encouraging this proposal going forward is actually creating job creation as well. So special thanks to council members Oranga and Richardson for pushing this forward and thank you for your time.'",
        "'speaker_0': 'Thank you so much, Councilwoman Mongo.'",
        "'speaker_3': 'I still say that I'm excited about this great possibility.'",
        "'speaker_0': 'Councilman Super now.'",
        "'speaker_5': 'Thank you. That caught me off guard. That was a quick statement. I just wanted to respond to our friends from the Cambodian community who spoke here tonight. I think they've already left. Maybe they're home by now and watching this.'",
        "'speaker_5': 'But we're well aware of the issues with PTSD and the need to have these kind of agricultural experiences. And so, Larry, Rich and I have actually identified properties in the fourth District on the corridor that that might come to fruition just in May.'",
        "'speaker_5': 'May is two things. Mental Health Month and Asian Pacific Islander Month. So it's a perfect time. We got together with the Asian Pacific Islander Mental Health Facility is in the fourth District, also that's at PCH and Exhibitor and I went into depth with them about this critical need.'",
        "'speaker_5': 'So just rest assured, the fourth district will be working on it. Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Richard.'",
        "'speaker_5': 'Just wanted to give a shout out to Tony. I thought he was going to speak, but Lambie's fresh and my chief of staff, Sharna, really picked this up, making sure that the organizing and all that stuff did take place.'",
        "'speaker_5': 'So. Tony, we see you keep up the good work, brother. And thank you so much to Shana.'",
        "'speaker_0': 'Thank you very much. There's a motion and a second on the floor. Thanks again to all of the folks here today. Good stuff. Please cast your votes.'"
    ],
    "Ordinance to Include Vacant Lots in Maintenance Code. ": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. We're going back now to item nine.'",
        "'speaker_1': 'Item nine is a report from Development Services. Recommendation to request city attorney to drive an ordinance amending the Long Beach Municipal Code. Chapter 18.21 maintenance of long term boarded and vacated buildings to include vacant lots citywide.'",
        "'speaker_5': 'Thank you. Quick staff report, please.'",
        "'speaker_7': 'Mr. Vice Mayor, members of the City Council.'",
        "'speaker_3': 'This is in relation to the previous item that you just heard. And without vacant lots it's really hard to do urban AG So at this point I'm going to turn it over to Alison Spindler, a planner in the Planning Department, who is presenting this item.'",
        "'speaker_3': 'Thank you. Thank you, Amy. And good evening, Mayor, and members of the City Council. As you heard, in May 2016, the Council requested the city manager to explore the feasibility of a citywide vacant lot registry ordinance to address the negative impacts of vacant lots throughout the city.'",
        "'speaker_3': 'This request followed successful implementation of a revised foreclosure registration program and the ongoing success of our vacant building monitoring program. The intent of a vacant lot registry is to protect neighborhoods from negative impacts associated with those lots, particularly those that are not well kept up, which are associated with decreased perceptions of neighborhood safety and decrease neighboring property'",
        "'speaker_3': 'values. The proposed ordinance amendment before you tonight would require vacant lot property owners to register with the city, would implement stronger maintenance and upkeep standards, and would provide proactive inspections by code enforcement to help mitigate those negative impacts associated with vacant lots while creating opportunities to activate such slots for community serving users.'",
        "'speaker_3': 'As we just heard through AB 551, the Urban AG Incentive Zone Act or for potential development opportunities staff identified 618 lots across the city that would be required to participate in this registry should the ordinance be enacted. Concurrent with data collection and analysis of these lot staff research registry programs in other cities across California and the country'",
        "'speaker_3': ', based on these examples, we've come up with a basic set of standards, including where we the abatement upkeep, curb painting and white vinyl split rail fence that would be required. Having this proactive registry and expanding the vacant building monitoring program to include those lots would allow staff to leverage existing programmatic infrastructure, including notification to owners, quarterly fees'",
        "'speaker_3': ', inspections and abatement by code enforcement in the case of negligent, negligent or non-responsive owners. Finally, the staff proposes that the registry be made publicly available through Data Lab, the city's Data Open Data Platform to allow neighbors, community members and potential developers alike to access this information.'",
        "'speaker_3': 'As requested earlier this evening. You heard during public comment on the last item all the benefits that come along with vacant lots, especially for access to healthy food for communities that may not have sufficient access today. And those are often the same communities that are disproportionately impacted by vacant lots.'",
        "'speaker_3': 'Therefore, Stafford recommends authorizing the Director of development services with the discretion to grant case specific temporary fee exemptions for vacant land owners who agree to allow their locks to be used for specific communities serving uses such as urban agriculture.'",
        "'speaker_3': 'Urban greening. Community programing. With potential adoption of well, with the adoption of the UAV program before you tonight, tax incentives will be available, as you heard, for these property owners, in addition to not having to pay the fee associated with this registry.'",
        "'speaker_3': 'Therefore, you may be aware on average that produce in L.A. travels about 1500 miles before consumption. So localizing food sources can help reduce vehicle miles traveled while increasing community resilience to climate impacts. You'll recall some discussion about vacant lots earlier this evening during the study session on the land use element, which also supports these similar programs and'",
        "'speaker_3': 'policies. Once implemented, staff recommends conducting an annual review of demo permits to identify new vacant lots, and staff will work with the community to verify any additional lots not identified through the initial analysis. This concludes my presentation and I'm happy to answer any questions.'",
        "'speaker_5': 'Thank you so much. I want to just acknowledge staff. This has been a conversation has gone on for years. So the first policy I actually worked on as chief of staff for my predecessor, Councilman Neal, was a foreclosure registry.'",
        "'speaker_5': 'It was the purpose was to crack down on the blight, crime and violence associated with vacant foreclosures at a time when we have plenty of them in our city. It went on to be wildly successful. It was award winning city.'",
        "'speaker_5': 'Staff did an amazing job on that. The idea here is to capitalize on that success, to translate some of those same tools and lessons learned from vacant buildings and vacant foreclosures and now place it on the problem of vacant lots.'",
        "'speaker_5': 'We know that some of these lots of sat vacant for 20, 30, 40 years. There are constantly problems in terms of code enforcement. And we want to add another tool to crack down on these vacant lots. And so a year ago, we asked at the same time that we look at this stick of cracking down on vacant'",
        "'speaker_5': 'lots and the carrot of urban agriculture incentives so that we can sort of look at a comprehensive approach to modernizing and updating some of these some of these lot. So if you see there was a theme tonight. So we talked about access to farmer's markets.'",
        "'speaker_5': 'We talked about cracking down on vacant lots. And we talked about incentives to encourage urban agriculture. Hopefully, this sends a clear message to the public that our city is serious about making sure we have access to fresh fruits and vegetables.'",
        "'speaker_5': 'We know that in areas where we may not have as many grocery stores, Whole Foods, Trader Joe's Sprouts, you name it, those happen to be the same areas that happen to have too many vacant lots where you don't have a demand on our land and development.'",
        "'speaker_5': 'Those are some of the same areas don't have some of these amenities and services. So the hope is that these all come together in a way that really comprehensively looks at the problem. I want to thank city staff and thank Councilwoman Gonzalez for her support and along this whole conversation, her staff and all the city council.'",
        "'speaker_5': 'Linton here on this. Thanks, Councilwoman Gonzalez.'",
        "'speaker_7': 'Yes. I just wanted to say thank you as well, because I know the same things that the vice mayor Richardson said. I think the vacant lots have been a persistent issue in many of our communities, and it's great that will now have, you know, some movement on some of these, especially with fresh produce.'",
        "'speaker_7': 'And I know are there additional community serving uses that we can look at that have been talked about? Aside from just gardens, is there any other examples that we can take a look at?'",
        "'speaker_3': 'Yes. At this point, we've kept it rather broad to be community serving users at the discretion of the director of development services. But we talked about urban agriculture, other potential greening opportunities that could be, for example, at Pocket Park as well as potentially pop up businesses or programing.'",
        "'speaker_3': 'But that would be case specific as we work to.'",
        "'speaker_7': 'Implement the ordinance. That is fantastic and thank you so much for working on this. I'm excited. We love pop up parks. Any way we can get them. So thanks so much.'",
        "'speaker_5': 'Perfect. Perfect. Thank you. Any public comment on this item saying nonmembers, please cast your vote.'"
    ],
    "Resolution on Memorandum of Understanding with Long Beach Supervisors Employees Association.": [
        "'speaker_5': 'Thank you. I do remember this.'",
        "'speaker_1': 'Item was a report from Human Resources recommendation to adopt a resolution approving the 2016 through 2019 MCU with the Long Beach Supervisors Employees Association Citywide.'",
        "'speaker_5': 'Thank you, Lisa. Have a quick update on this.'",
        "'speaker_0': 'Vice Mayor, council members are really.'",
        "'speaker_4': 'Happy to.'",
        "'speaker_0': 'Report on this memo. You, Alex Vasquez and Ken Walker.'",
        "'speaker_4': 'So Alex, our H.R. director.'",
        "'speaker_5': 'Honorable Vice Mayor and members of City Council. Since October 2016, city management has met with representatives of the Long Beach Supervisors Employees Association to discuss their initial and new terms following the bargaining instructions from the City Council. Tentative agreements have been reached with LPC.'",
        "'speaker_5': 'The proposed merger with LBC and the City Council resolution to approve the memo. You are included with the Council letter. The proposed MRU is for a three year term from July 2016 through September 2019, with the following major provisions.'",
        "'speaker_5': 'General wage increase of 2% effective October 1st, 2016. A 2% within the pay period of council adoption of the MRU and the final 2% on October 1st of 2018. These compensation provisions are consistent with recent agreements reached with the IAM.'",
        "'speaker_5': 'Other major provisions of the IMO. You include the elimination of floor warden skill pay and increase in health care, cost sharing with employees and an economic crisis. Re opener you have before you a resolution to approve the merger between the city and the Long Beach Supervisor Employees Association.'",
        "'speaker_5': 'This concludes my brief staff report. Thank you. As any public comment on this item. Seeing numbers, please cast your vote.'"
    ],
    "Grant Application for the 14th Street Park Project.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_5': 'Thank you, Adam. 13 police.'",
        "'speaker_1': 'And in 13 is report from Parks, Recreation and Marine recommendation to Adobe resolution authorizing the City Manager to submit a grant application to the California Natural Resources Agency for the completion of the 14th Street Park Project and accept such grant funding in a in an amount up to 3.1 million District one.'",
        "'speaker_5': 'Thank you. Let's go. Let's start with city staff, then Councilmember Gonzalez.'",
        "'speaker_0': 'A quick report by our second Marine director, Murray Knight, and we also have Meredith Reynolds.'",
        "'speaker_3': 'Good evening, vice mayor. Members of the Council. On March 2017, the state of California, California Natural Resources Agency began soliciting grant applications for their urban greening grant. There is a total of $76 million available for an urban greening project statewide, and that's funded by the California Climate Investments.'",
        "'speaker_3': 'And this is a competitive grant program, and only one find funding cycle is anticipated. Eligible projects needed to reduce greenhouse gas emissions and grant funds can be used to acquire, create, enhance or expand community parks and green space.'",
        "'speaker_3': 'As a first step in a two phased grant application process, the grant agency accepted one page concept proposals, which were reviewed in advance of the full application, and projects that were clearly meeting the grant objectives and were the most competitive were identified.'",
        "'speaker_3': 'City of Long Beach submitted multiple concept proposals for the park projects, and the grant agency provided feedback that the 14th Street Park Project concept was the most competitive and met multiple grant objectives. As a result of that feedback provided during the concept phase, we submitted an application for the second phase for the completion of the 14th Street'",
        "'speaker_3': 'Park Project. Park Project Scope includes community outreach and completion of the 14th Street Masterplan, as well as design and construction of grant eligible park improvements that could include bike and pedestrian improvements connecting currently separated blocks to adjacent traffic, upgrading irrigation and onsite stormwater capture reforesting park segments, upgrading park amenities to meet ADA and safety standards, etc. We'",
        "'speaker_3': 'are requesting to apply and accept an amount of up to 3.1 to $5 million for this 14th Street Park project. There is no matching funds required in this grant, and there's no minimum or maximum funding request for this grant program.'",
        "'speaker_3': 'That concludes my report.'",
        "'speaker_5': 'Thank you, Councilwoman, because I.'",
        "'speaker_7': 'Guess this makes me incredibly happy because as city manager Pat West knows and I thank you, Mary and Meredith, for your hard work. This has been a neighborhood that I'm really, really passionate about personally, but that I know a lot of our city staff has spent a lot of time in that neighborhood mentoring students at Washington Middle'",
        "'speaker_7': 'School. I myself going out there, I think, every week with my staff just to ensure that the kids know that their support not only at the school but offsite. And so I thank you all for really just committing to investment there in the Washington neighborhood.'",
        "'speaker_7': 'Thanks so much.'",
        "'speaker_5': 'Congratulations and good luck with this as any public comment on this item. Sing. No members, please cast your vote.'"
    ],
    "Amend Agreements for As-Needed Landscape Architecture Services. ": [
        "'speaker_1': 'Christian Curtis.'",
        "'speaker_5': 'Thank you. Number 14.'",
        "'speaker_1': 'Item 14 is a report from Public Works recommendation to amend for agreement for as needed landscape architectures services to increase the aggregated amount by 4 million city.'",
        "'speaker_5': 'Thank you. Brief staff report, please.'",
        "'speaker_0': 'Craig back. As vice mayor, members of the council. What you have before you this evening is similar to some of the other requests that we brought previously. This is for as needed service contracts. This particular item focuses on landscape needs with the passage of measure.'",
        "'speaker_0': 'What we're seeing is a need to do a number of different smaller projects. Some of those are in parks. We'll use landscape firms to do that. We were redesigning certain medians. A good example of that is the work currently going on on Second Street and Belmont Shore.'",
        "'speaker_0': 'So these are, again, as needed contracts for projects that come up. That concludes that report.'",
        "'speaker_5': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'So moved.'",
        "'speaker_5': 'Thank you. Any public comment on this item saying no members, please cast your vote.'"
    ],
    "State Legislation for Long Beach Seat on LA Metro Board.": [
        "'speaker_1': 'Wishing Karis.'",
        "'speaker_5': 'Thank you. We already handle 16. That makes it number 17.'",
        "'speaker_1': 'Item 17 is communication from Councilman Austin, Councilwoman Gonzalez, Councilman Andrews and Councilmember Durango. Recommendation directed this recommendation to direct the city manager to support state legislation that would add a permanent seat to the Metro Board of Directors for the City of Long Beach.'",
        "'speaker_5': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'Thank you very much. And I want to thank my colleagues for signing on on this very, very important item, which is very consistent with our state led agenda that was adopted by this council in 2015. There is and specifically, we stated that our led our agenda was would be to monitor or sponsor state legislation that proposes to'",
        "'speaker_8': 'change the structure of the state and regional boards on which Long Beach is represented and maximize the city's representation. There is currently legislation making its way through the legislature. Specifically, the House of Origin was in the State Senate SB 268 by Tony Mendoza.'",
        "'speaker_8': 'Senator Tony Mendoza and was approved in committee as well as the Senate floor. Now it's in the Assembly. Currently, that bill has quite seeks to to restructure the MTA board, but it does not have a permanent seat for Long Beach.'",
        "'speaker_8': 'And as you all know, Metro serves as the largest metropolitan transportation planning organization in the nation and is comprised of 13 voting members and one ex-officio member. Metro does not include a permanent seat for the city of Long Beach currently, and as the second largest city in L.A. County, inclusive of the port of Long Beach, Long Beach'",
        "'speaker_8': 'shares representation with 25 cities, mostly from the Gateway Council of Governments, but also from surrounding areas. As part of the southeast Long Beach sector, current law prescribes membership on the Metro Board directors to be five members of the Board of Supervisors, the mayor of the City of Los Angeles, two public members and one members of the City'",
        "'speaker_8': 'of Los Angeles, appointed by the Mayor of the City of Los Angeles, and four members, each of whom shall be a mayor or a member of the city council appointed by the L.A. County Selection Committee. And these are from four sectors the North County, San Fernando Valley, San Gabriel Valley sector, the southwest corridor sector in the southeast'",
        "'speaker_8': 'Long Beach sector, which we are a part of. And again, we compete with 25 cities for that seat. I'm really happy to say that currently today, our mayor serves on the MTA board. He was recently selected and he's doing a fantastic job.'",
        "'speaker_8': 'Almost we saw almost immediate results once he was appointed to that board. But the years that preceding that, eight years, we weren't at the table. And we have to ask ourselves what actually happened during those eight years. Measure R was passed and major decisions in terms millions of millions of dollars were planned for transportation throughout the region'",
        "'speaker_8': '. And most recently Measure M was was passed by the voters in L.A. County. Long Beach was not necessarily at the table in terms of setting the priorities for the expenditure plan. I think it's very, very important that that we again and I've said this long before I ever got on the city council that Long Beach have a'",
        "'speaker_8': 'strong regional presence on boards, particularly like the MTA. And I'd like to just move this, this agenda forward to, to, to, to support legislation in any legislation coming out of the Sacramento. And hopefully it's this session that would include a permanent seat for the city of Long Beach.'",
        "'speaker_8': 'Lastly, I would state that a permanent seat through legislation would improve our city's influence regionally and assure long term benefits to local taxpayers who depend on and are impacted by the decisions at the MTA. So I'd like to make a motion to move that the city council direct the city manager to support state legislation that would add'",
        "'speaker_8': 'a permanent seat to the L.A. County MTA Board of Directors for the City of Long Beach without disproportionately affecting representation from the L.A. County Board of Supervisors or adding more than four new voting members to the board, bringing the board membership to no more than 17 voting members again.'",
        "'speaker_8': 'And I appreciate the second by Councilmember Gonzalez. This this is very, very important to the city of Long Beach. It is consistent with our state led agenda. And I would like to also get a. Have input on this as well.'",
        "'speaker_8': 'We have Diana Tang, who has also been working very, very hard with our state led agenda. Mr. Mayor, if I might, my.'",
        "'speaker_3': 'Mayor, members.'",
        "'speaker_7': 'Of the city council, I believe that Councilmember Austin provided a fairly robust description of the bill and what it chooses to do. Currently, the City of Orange does not have a position on this. The bill is in the California Assembly that's been referred to local government and transportation and does not currently include a proposal to add a'",
        "'speaker_7': 'seat for a Long Beach.'",
        "'speaker_3': 'And so the bill must pass.'",
        "'speaker_7': 'Both policy committees by July 14th. We do have an opportunity to ask for amendments that do do what the recommended action tonight here at state. And so we stand ready to implement your direction.'",
        "'speaker_0': 'Thank you. Is there public comment on this? Okay. Councilman Gonzalez.'",
        "'speaker_7': 'Thank you. I just wanted to thank Councilman Austin for bringing this forward. I think it's absolutely needed, especially in addition, as we have millions of dollars of investment along the the metro. And we should certainly, you know, have a seat at the table, an additional seat at the table to be able to talk about so many things'",
        "'speaker_7': 'happening in our city, but also just have a regional seat at the table. But, Diana, I wanted to ask. So July 14th is the the deadline basically. What happens next after that? What is the process? July 14th is the deadline to get out of policy committee.'",
        "'speaker_7': 'The bill is key to fiscal and so it would need to go to the Assembly Appropriations Committee as well. And the deadline to get out of that committee is September 1st. So assuming that it passes both policy committees on the appropriation committee, then it would go to the assembly floor for a vote by the full assembly.'",
        "'speaker_7': 'And because we have heard from Senator Mendoza staff that there will likely be amendments, the bill would need to go back to the Senate for concurrence before it would be eligible for the governor's consideration. So end of the year, we're thinking sometime around then I believe end of October, around that time frame.'",
        "'speaker_7': 'Thank you so much. I appreciate it.'",
        "'speaker_0': 'Thank you. I do want to come to an answer.'",
        "'speaker_8': 'So I'd also just like to add that I didn't mention that this bill got out of of the state Senate, got out of policy committee. It was also voted on on the Senate floor and passed. There have been several iterations of this type of bill moving through the legislature over the last few years.'",
        "'speaker_8': 'And this is the furthest such a bill has gotten. This one has me concerned because it doesn't not prescribe a seat for Long Beach, a permanent seat for Long Beach. And I will just state that, you know, our state senator, Ricardo Lora, did support this bill as well moving forward.'",
        "'speaker_8': 'So there is there's, I guess, support for some sort of change on the MTA board. We just want to make sure that we're not left behind.'",
        "'speaker_0': 'We're going to have public comment in just a minute, I think. But I just want to reiterate, I think what Councilman Nelson's point is that it's been the position of the city, I think both from as mayor and certainly as members of the council, that this body would support changes if, if and when Long Beach was explicitly'",
        "'speaker_0': 'added as a voting member of the Metro Board at Long Beach were to gain a seat. And so I think while this has been discussed, certainly Diana Taylor, government affairs manager, is a thing can be there in the past at former iterations.'",
        "'speaker_0': 'We discussed this last year as well. I think this explicitly puts the city council on record once again and just making very clear that that we would support a bill that would include Long Beach as having an explicit membership permanently on the seat.'",
        "'speaker_0': 'With that, let me invite any public comment.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Members of the council. My name is. Sadly, I'm here on behalf of State Senator Tony Mendoza. On his behalf, I wanted to thank you for your courtesy of letting me speak. Sentiment also has been supportive of the idea of having Long Beach.'",
        "'speaker_0': 'On an expanded.'",
        "'speaker_5': 'And reorganized MTA board. Last year he offered Senate Bill 1472 and Long Beach was listed as one of the seats. There's a historical reason for that. Some of you may remember that before the current MTA was organized, Long Beach had a seat on the previous commission.'",
        "'speaker_5': 'However, last year, Senator decided to hold his bill 1472, which had the provision for Long Beach because there were three concerns that. A lot of organizations raised. They'd had two legislative appointments made by the speaker and the pro tem.'",
        "'speaker_5': 'The people were not happy about that and the size of the board was 25 members and people felt it was too big and secondly, that there needed to be a local process. So the Senate went back to the drawing board.'",
        "'speaker_5': 'He has met at least six or seven times with a working group consisting of the League of Cities, L.A. Division, the Independent Cities, Contract Cities, the County City Selection Committee, the mayor of L.A. and the chair of the MTA board.'",
        "'speaker_5': 'And the current.'",
        "'speaker_0': 'Bill emerged out.'",
        "'speaker_5': 'Of that discussions. And now it's a very simple bill. It essentially expands the board to make sure that the 87 cities other than the city of L.A., the city of L.A. and the Board of Supervisors between them are represented on the board.'",
        "'speaker_5': 'That is proportionate to the share of the population that govern the 87 cities. That includes you represent 52% of the county's population, the city of L.A., around 38%.'",
        "'speaker_0': 'Both of them.'",
        "'speaker_5': 'Have 31%, each of the board seats. So by expanding the board once again, we hope that we can accommodate various groups. What the bill does not do right now, unlike last year, is specify which cities should serve on the MTA board, and that is at the insistence of the three city associations and the city and the county'",
        "'speaker_5': 'city selection committee. So the Senator wanted me to come here to make sure that I explain that to you. And he would very strongly encourage and he would work with you. Mr. Mayor, the council members, if you wish to work with him, to stress his recommendation that language should be accommodated on the MTA board.'",
        "'speaker_5': 'But it is a decision that this time is developed through this consensus process, and I've named the groups to you. The second issue that Senator wanted me to bring up to you is the part of the motion that restricts the size to 17 members.'",
        "'speaker_5': 'If we do that, then the current imbalance which runs against the interests of the smaller cities, 87 cities, will continue. And I'll be happy to get into the details with that. Thank you very much.'",
        "'speaker_0': 'Thank you very much. Thank you. And thank you to the senator. Any other public comment? See? None. Well, there is a motion and a second on the floor to support on as part of our legislative agenda, to support a bill that would have Long Beach as a permanent seat.'",
        "'speaker_0': 'Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Next item. I think that was the last item was public comment. Second public comment period at this time.'",
        "'speaker_5': 'My name is Steven Cardio.'"
    ]
}