{
    "Study Session on Airport Noise Budget and Slot Allocation.": [
        "'speaker_0': 'So now we're back to the airport.'",
        "'speaker_7': 'I think we're going to go there.'",
        "'speaker_0': 'So let's do the airport.'",
        "'speaker_7': 'So again, let me reintroduce the airport. Executive Director Bryant Francis.'",
        "'speaker_0': 'And let's just start from the top, please.'",
        "'speaker_8': 'Yes, sir. Once again, good evening, Mayor Garcia, members of council and everyone in attendance this evening. Thank you for the opportunity to discuss the airports noise budget performance. This is a critical issue for the airport and for the city.'",
        "'speaker_8': 'The annual review of our noise performance is required by the noise ordinance. It is something that we do in the fourth quarter of each calendar year. As you are aware, our noise ordinance is one of few in the nation grandfathered under the Airport Noise and Capacity Act of 1990.'",
        "'speaker_8': 'It is a balance between airline and community interests. It provides unparalleled protection for our community and its residents. One of the strengths of the ordinance is that it accounts for changes in the industry, such as the use of quieter aircraft while holding the noise levels to maximum limits.'",
        "'speaker_8': 'Because of the ordinance, we are able to ensure that our noise levels do not increase. The best way to ensure that we are able to keep the ordinance in place is to abide by it. This is something that we at the airport, along with our city attorney and city prosecutor, worked very hard to do.'",
        "'speaker_8': 'The ordinance requires that we allow a minimum of 41 air carrier flights per day. It also requires that we evaluate the noise levels annually to ensure we are below the noise budget specified by the ordinance and to determine if additional flight slots must be added.'",
        "'speaker_8': 'There are 18 noise monitors located around Long Beach Airport. The noise levels that we will discuss this evening are based on actual noise data from our airport noise and operations monitoring system or enemies. This is a multimillion dollar noise monitoring and flight tracking system that correlates noise levels with aircraft operations.'",
        "'speaker_8': 'Noise monitors are associated with each of our three runways. We have six regulatory noise monitors as depicted in orange on the screen. These monitors are the violation monitors. The ordinance establishes maximum noise levels for individual aircraft at each of these monitors.'",
        "'speaker_8': 'These monitors are important as they serve as the basis for our monetary fines. The noise limits are based on 1989 1990 noise levels and have never been modified. We are not proposing to modify them tonight. Noise levels will be retained at 1989.'",
        "'speaker_8': '90 levels. Noise monitors nine and ten as depicted in red. Are at either end of our primary runway, runway one, two, three zero, and they are our noise budget monitors. In addition to maximum noise levels for each aircraft, the ordinance establishes cumulative noise budgets for these monitors.'",
        "'speaker_8': 'In addition to monitoring the maximum noise levels, we monitor total noise exposure, which is all noise throughout the year at these locations. The ordinance specifies total noise, exposure limits or noise budgets for five aircraft categories, including air carriers, which is the focus of tonight's discussion.'",
        "'speaker_8': 'Remote monitoring terminal or empty nine is located north of the airport and is our primary monitor for departure operations. Our M10 is located south of the airport and is our primary monitor for aircraft arrivals each year during the fourth quarter.'",
        "'speaker_8': 'We evaluate the total annual noise exposure at these locations. The noise ordinance establishes a minimum floor of 41 air carrier flights. As mentioned earlier, under the ordinance, air carriers are encouraged to operate at the lowest possible noise levels.'",
        "'speaker_8': 'This encouragement is provided by requiring an increase in the number of flight slots. If the air carrier category operates below the established noise budget and there is room in the budget to provide a cushion against exceeding that budget.'",
        "'speaker_8': 'Following these steps is critical to protecting the budget based on long term noise monitoring data. We know that aircraft have gotten quieter over time. This graph depicts historical aircraft noise levels measured at RS 89, which again is a monitor which measures departing aircraft.'",
        "'speaker_8': 'Some of these aircraft are no longer operating at the airport. The aircraft in the upper portion of the graph, which are the Boeing 727, the very first aircraft, the DC nine and the MD 80 represent older aircraft and engine technologies.'",
        "'speaker_8': 'The lower portion of the graph depicts new, quieter engine technologies. These newer aircraft represent the vast majority of today's airline fleet. The reduced noise levels and change in the airline fleet is what has prompted me to take this action tonight.'",
        "'speaker_8': 'Based on our consultant's analysis of the noise data and projection of future flight activity, their recommendation, along with an independent peer review of the data and conclusions, is that we must add nine slots. This graph depicts the historical annual measured noise levels at RS 89.'",
        "'speaker_8': 'Since 2003, the highest levels reflect periods when older technology aircraft were operating at the airport, as shown in the graph. With the exception of 2011, when we experienced a period of significant operations of older technology, MD 80 aircraft.'",
        "'speaker_8': 'The airport has been operating significantly below the established noise budget. This graph depicts similar data for our M10. We do not see the prominent spikes in the data that we saw for our mt9. This is because our m t ten is primarily an arrival noise monitor and a rival.'",
        "'speaker_8': 'Noise levels are typically quieter and more consistent than departure noise levels. Our noise ordinance includes an incentive for the airlines to operate quietly. This incentive is the requirement for the airport to add air carrier flights if the noise goals are met.'",
        "'speaker_8': 'These noise goals are based on data obtained from the 1980 990 time period. We believe that we are the only city air airport able to ensure that our noise levels do not increase based on the data and the provisions of the ordinance.'",
        "'speaker_8': 'We must add flights. Next question is how many flights must be added? As mentioned previously, all 41 area air carrier slots are currently allocated. However, air carriers are operating approximately 31 flights per day on average. We need to account for this unused allocation in the noise budget.'",
        "'speaker_8': 'Otherwise, we run the risk of exceeding the budget. If the airlines were to begin flying a larger portion of their allocated slots. Currently our carriers are flying 74% of the available slots. That is part of why our noise levels are low.'",
        "'speaker_8': 'The long term ten year average utilization of slots is 84%. The maximum slot utilization is 93%. And I should note that this occurred one time only for one quarter in the summer of 2005. The maximum utilization in any 12 month period is 90%, which was calendar year 2009.'",
        "'speaker_8': 'And the maximum utilization in a noise year, which is October through September, was 87%, which was from October 28 through September 2009. In order to determine the number of additional slots that should be added, we need to account for the slots that are not currently utilized to be conservative.'",
        "'speaker_8': 'Our consultant calculated what the noise levels would be if the air carriers operated 95% of their available slots, which is above the level we have ever experienced at the airport. The noise levels based on 95% utilization of all available slots are shown in yellow for the period 2010 to 2015.'",
        "'speaker_8': 'As you can see, even if all the current flights flew at 95%, that's across all 41 minimum allocated slots. Because the planes are operating so much quieter, there is still significant capacity in the noise budget. And this is the same data for R.A. ten, which is an a noise monitor.'",
        "'speaker_8': 'This data serves as the baseline for determining how much room is available in the noise budget. Our consultant used a mix of common aircraft types to determine the noise levels from additional slots. These aircraft for the Boeing 737 700, Boeing 737 800, and the Boeing 757.'",
        "'speaker_8': 'They assumed four Boeing 737 700 aircraft for Boeing 737 800 aircraft and one Boeing 757 aircraft. These aircraft are conservatively representative of the airlines fleets today, as the slots may be flown by quieter aircraft such as the Airbus 320.'",
        "'speaker_8': 'As shown in this slide, four are empty. Nine. Even with the additional slots and all slots flown at 95% utilization. The airport would be below the 1989 1990 noise levels. These projections are very conservative, as the consultant used the louder of the representative aircraft flown at utilization rate that is higher than we have ever seen at the'",
        "'speaker_8': 'airport to ensure we do not exceed our budgets. This is the same data for R.A. ten. The data for R.A. ten is a little tighter than for R.A. nine, which is because, as aircraft have gotten quieter, this noise monitor becomes our limiting noise monitor.'",
        "'speaker_8': 'Again, the maximum slot utilization over the last 20 years is 93%, which occurred one time in summer of 2005. And this very conservative model of 95% utilization of all 41 minimum slots and 95% utilization of the nine new supplemental slots.'",
        "'speaker_8': 'We anticipate being near the allowable limit at our empty ten. We will watch this closely as required by the ordinance. The additional slots are valid for a period of one year and if we see the 1989 1990 noise levels that either are empty nine or are empty ten, the available slots will be reduced as the ordinance requires'",
        "'speaker_8': 'active management. To summarize, this action is required by the noise ordinance. The conclusions and recommendations are based on long term data from aircraft operations at our airport. The F-15 analysis conducted by Landrum and Brown was peer reviewed by Harris, Miller, Miller and Hansen, both highly reputable firms in airport and aircraft noise analysis.'",
        "'speaker_8': 'The results of the peer review were consistent with the original analysis and support Landrum and Brown's findings. This action is required in an effort to preserve and protect the noise ordinance. The ordinance cannot be adhered to. In part, we must abide by it in full in order to continue to enjoy its benefits.'",
        "'speaker_8': 'As a result, we must add nine flight slots. As next steps. There's an established procedure for awarding the slots. We will notify all carriers, U.S. based carriers of slot availability. Those carriers interested in additional flying or new flying will submit that interest to the airport.'",
        "'speaker_8': 'And slots will be awarded based on an established protocol per the allocation resolution. And we have 30 days to allocate the slots at that time. Vince M.E., our long time consultant for noise analysis, is regrettably unable to join us tonight.'",
        "'speaker_8': 'However, Cristian Valdez is here with a statement to read on Mr. Masters behalf. He's a member of Mr. Mystery's team, and I'd like to invite him to the podium at this time.'",
        "'speaker_6': 'Good evening. Mayor and council members. My name is Christian Valdez with Landrum Brown Acoustical Consultants to Long Beach Airport. I have a statement prepared by Vince Mastery, the primary acoustical consultant for the airport who couldn't be here tonight.'",
        "'speaker_6': 'You know, I read the statement to you now. My name is Vince Master. I'm a licensed professional engineer in the state of California, and I have over 40 years of aviation noise experience. I have an advanced degree in engineering and have authored numerous peer reviewed journal journal articles.'",
        "'speaker_6': 'I'm sorry I'm on the East Coast at the present time and cannot be here in person. Christian Valdez of my staff is here to represent Landrum and Brown and read this statement. I've been working closely with Long Beach Airport on issues relating to the air and air carrier noise budget since 1999.'",
        "'speaker_6': 'Based on my analysis and review of noise data for October 1st, 2014 through September 30th, 2015, I have determined that the airport is currently operating below the noise budget for air carriers. The ability, the availability of capacity within the noise budget at the airports at the airport is likely due to a change in aircraft fleet mix.'",
        "'speaker_6': 'Specifically in the past, two aircraft have tended to dominate the noise budget calculations at the airport because of their high noise levels on departure. These are the Boeing 7 to 7 historically used for cargo flights and the McDonnell Douglas, MD 80.'",
        "'speaker_6': 'The Boeing 7 to 7 has been decreasing in use and is now essentially gone from the US fleet, although still in use in some charter operations. And the MD 80, while still in some airline fleet, is also decreasing in use by U.S. airlines.'",
        "'speaker_6': 'The number of additional flights at the airports at the airport must allocate to operate within the established noise budget is dependent on the number of new flights, the aircraft type and the time of day of the operations. Since evening and night operations are heavily penalized in the noise budget, using data that reflects the current operations and fleet'",
        "'speaker_6': 'mix at the airport. The estimated number of flights that could be added has been presented to you and is the subject of your discussions. While these estimates are valid for the typical operator at Long Beach, any proposed new operations that are requested through the allocation process would have to be reviewed for the aircraft type and type of'",
        "'speaker_6': 'operations. Time of operation. For example, if a new operator were to reintroduce the MD 80, the number of slots available, available drops dramatically. We are prepared to evaluate any proposed new operations to determine whether the initiation of service utilizing those flights would lead the air carriers, air carriers as a group to maintain compliance with the noise levels'",
        "'speaker_6': 'established in the baseline noise budget. The noise ordinance at Long Beach Airport carefully balances the environmental interest of the community while providing capacity increases at the airport. Although most airports are limited to their ability to control aircraft under the 1990 Airport Noise Capacity Act and Grandfather Clause permits the airport to continue to limit hours of operation, single'",
        "'speaker_6': 'event noise and control over noise overall noise through a noise budget provided that the airport complies with Anka and its FAA grant assurances, including increasing the number of flights to the extent possible while maintaining the noise budget at the airport.'",
        "'speaker_6': 'Essentially, then the airport must allocate flights above the 41 flight limit. If the airport determines that the initiation of those flights would not lead. Two, the air carriers exceeding the noise levels established in the noise budget. We have made our estimates and the additional capacity that is available with these important issues is in mind.'",
        "'speaker_6': 'That's the end of the statement. Thank you.'",
        "'speaker_8': 'Thank you, Mr. Bass.'",
        "'speaker_0': 'Before I turn this over to begin with questions, I know that our city attorney and just so that people are aware, this process in large part was also led through our city attorney's office in making determinations and working with our city manager.'",
        "'speaker_0': 'So, Mr. Parkin, if you want, I know you're going to weigh in on a few things.'",
        "'speaker_7': 'Mayor. Thank you. Mayor Members of City Council. That's correct. Mike Mays and myself and our office have worked closely with the airport on this issue. Mike's been involved with it for 20 years and is very familiar with the ordinance and its requirements.'",
        "'speaker_7': 'We also requested and staff agreed on the peer review of the initial studies and data, and we stand ready to answer any of your questions.'",
        "'speaker_0': 'Okay. Great. Thank you for turning this over now to council for four questions. Councilman Mongo.'",
        "'speaker_10': 'Yes, I appreciate the presentation. And most specifically, I appreciate. Slide ten and Slide 11, which we discussed at our prior briefing, that of how helpful that would be to understand and visualize the noise and what that looks like.'",
        "'speaker_10': 'Many have heard me say that the process where people get to come forward and speak for 3 minutes, we don't get to engage in a dialog and a lot of times there are questions that don't get to be answered.'",
        "'speaker_10': 'So I sent out a request of my constituents 12 12,000 emails and received back a multitude of questions which we've consolidated that I'd like to make sure that are answered in the public forum. So if the city staff are available to answer these, I'm the first question was and I can give the percentage of the answer that'",
        "'speaker_10': 'I know off the top of my head, and then maybe we can work together to answer some of them. How many of the minimum 41 air carrier slots and 25 commuter slots are being used on a regular basis?'",
        "'speaker_10': 'Who are the slots allocated to and how much are they utilized? Specifically, I know that we've discussed that the current slot allocation is 32 to JetBlue, five to American, two to Delta, one to FedEx and one to UPS.'",
        "'speaker_8': 'That is correct.'",
        "'speaker_10': 'Can you answer the the question related to regular basis usage right now?'",
        "'speaker_8': 'Yes. For the most recent 12 month period, JetBlue was at approximately 70% utilization. Both of the air cargo carriers, FedEx and UPS were right at 70% as well. Delta, with its air carrier slots, was in the low 90% range, as was American slash U.S. Airways.'",
        "'speaker_8': 'And in the commuter category, there are three of 25 total slots currently allocated all to Delta, and they are utilizing those that are approximately 65%.'",
        "'speaker_10': 'Thank you. Why is it necessary to increase the number of air carrier slots to 50? If only 30.4 of them are being utilized on an average basis.'",
        "'speaker_13': 'I can try to answer that question. First of all, even though that the utilization is actually lower than historically or historic averages, that's not what we look at when we look at to add supplemental slots. Basically, we look simply at the noise budget.'",
        "'speaker_13': 'All of the carriers that Brian mentioned, even though they are flying at different levels, are all flying legally within the terms of our ordinance and its companion flight allocation resolution. So we simply look at the budget themselves. And as the presentation demonstrated, this addition of nine slots was actually modeled by our noise consultants, as if all of'",
        "'speaker_13': 'the carriers, all 41 of them at the airport or all 41 slots were being flown at a 95% level, which.'",
        "'speaker_10': 'I think you also said was higher than any year. But 19 or 25.'",
        "'speaker_13': 'Historically, the 18 year averages 84% among all 41 slots. So we really look at the budget itself and not the. I was going to say underutilization of the slots because they are being utilized in accordance with the ordinance in the resolution.'",
        "'speaker_10': 'And is this an implied or explicit requirement of the noise ordinance?'",
        "'speaker_13': 'The requirement to add additional slot? Yes, sir. It is an explicit requirement of the ordinance.'",
        "'speaker_10': 'And what's the airport director's role?'",
        "'speaker_13': 'So it's somewhat unique in this particular ordinance, which, as was mentioned in the presentation, was adopted in 1995 after 12 years of litigation in federal court, and basically the consent of the air carriers that were suing the city at the time, together with the federal judge and the FAA.'",
        "'speaker_11': 'For good.'",
        "'speaker_13': 'I forgot the question. I'm sorry.'",
        "'speaker_10': 'The airport directors role versus the city over mayor.'",
        "'speaker_13': 'The airport directors role is called out in the ordinance as the airport director rather than city council or the city manager. That makes a determination on whether or not additional slots can be added. I'm sorry.'",
        "'speaker_10': 'No problem. And who can apply for those nine slots?'",
        "'speaker_13': 'So, as Mr. Francis indicated, any certificated, certificated air carrier could apply for those slots, whether they're an incumbent carrier existing at air airport now or a carrier that's. No, not at our airport.'",
        "'speaker_10': 'Some of these questions were submitted before the the constituents were able to see the presentation. But I think that it's important that they have the answers so that when they do come up to make their three minute speech in case they missed that part of the presentation.'",
        "'speaker_10': 'So I appreciate you still answering them. Must a certain number of outside carriers that are not at the airport or any requirement of current tenants apply for the noise ordinance to be preserved? Or is it open to all.'",
        "'speaker_13': 'The city's obligation? The airport's obligation is to make the flight slots available for allocation. If, hypothetically, no one were to apply for those nine slot supplemental slots, the city would be fully compliant with Anka and its ordinance, and there would be no violation that the FAA would recognize.'",
        "'speaker_13': 'We just have to make them available.'",
        "'speaker_10': 'And if the deadline passed and no one had applied, would we need to extend the deadline and leave it open in case someone asked or would be open at a year later?'",
        "'speaker_13': 'They would be open until the next budget year and we would look at this and go through this exercise again next October, essentially.'",
        "'speaker_10': 'Will JetBlue be able to apply for any of the new slots, given that they're not utilizing their current allocated slots.'",
        "'speaker_13': 'As they indicated? JetBlue, as with all of the other carriers, are currently utilizing their slots in accordance with our current regulations are a flight allocation resolution in the ordinance. So the city does not have an ability to discriminate against any particular carrier in the allocation of the supplemental slots.'",
        "'speaker_13': 'So yes, JetBlue, as with all our other incumbent carriers, could apply for slots.'",
        "'speaker_10': 'And once those slots are allocated, are there conditions of which those slots could be removed or revoked?'",
        "'speaker_13': 'Yes. Again, that's within the purview of the airport director. And what would happen if we allocated the nine supplemental slots at the end of one year or 12 months of operation? We would look at the noise budget again and if the noise budget had been exceeded due to the adding of those nine slots, one or more slots'",
        "'speaker_13': 'would be automatically removed. And the way it works in the ordinance is we would actually eliminate the noisiest slots first until we came below the budget.'",
        "'speaker_10': 'So not in the order they were awarded, but noisiest first. And are there conditions by which a slot could be revoked mid-year?'",
        "'speaker_13': 'There's really no provision in the ordinance for a midyear revocation.'",
        "'speaker_10': 'What if they violated curfew hours at the airport?'",
        "'speaker_13': 'All of the supplemental slots are subject to all of the other existing airport noise, rule and regulations, so they would have to comply with the curfew, the departure and landing, the departure and landing times just like any other carrier.'",
        "'speaker_13': 'And if they failed to do that, they would be subject to administrative penalties or criminal prosecution.'",
        "'speaker_10': 'I know you addressed this, but just to be clear and make it a specific question, when the additional thoughts are added, should JetBlue begin to utilize all of their currently unused slots? What would happen if all the noise exceeds the ordinance limit midyear?'",
        "'speaker_13': 'So we would still look at it at the end of next fiscal year for revocation. But as I indicated with JetBlue, the way it was modeled it suppose that JetBlue was already flying at 95% of their rate. Even if JetBlue were to fly at 100% of their rate, which I believe historically no air carriers ever done at'",
        "'speaker_13': 'the airport. There would still be room in the budget. So really, it is more dependent on the fleet mix. If someone were to come in with an outdated MD 80 or 77, that would be the thing that would more likely put it over the budget.'",
        "'speaker_10': 'And I know you answered that we would not be out of compliance if no one applied. And what effects will the FAA changes to flight paths on Southern California airports under the next gen program have on our noise budget?'",
        "'speaker_14': 'Yes. We've looked closely at the proposed NextGen procedures for Long Beach Airport. There are no changes to the procedures within our noise monitors, so we anticipate no change at all. Given implementation of the FAA, NextGen.'",
        "'speaker_10': 'And is the airport director planning to utilize two five right. With more commercial landings in addition to the current general aviation group?'",
        "'speaker_8': 'I know we are not the primary runaway. Runaway 1230 is utilized for. For all of our air carrier operations, unless it is unavailable for a brief period of time. At that time, runway seven left to five right is the backup runway.'",
        "'speaker_8': 'I should also point out that runway one, two, three, zero. There are no plans to have any extensive rehabilitation or construction of work going on with that runway over the next several years. So aside from very brief periods, we would not utilize any runway other than the primary for the air carrier operations.'",
        "'speaker_10': 'Does this study have anything to do with JetBlue's request that Long Beach add federal customs or an FAA facility for international flights?'",
        "'speaker_8': 'No, it does not is completely unrelated.'",
        "'speaker_13': 'And I could add on to that. Some of the council members that have been here a while will remember that this scenario of adding additional slots was actually studied in the airport area that dealt with the rehabilitation or the expansion of the airport terminals.'",
        "'speaker_13': 'So this was well in advance of JetBlue's request for the federal inspection station, and it was also analyzed in the original air, which was passed in 1980 or certified in 1986, and a subsequent negative declaration that studied the addition of supplemental slots, which was done in 1980, 1995.'",
        "'speaker_10': 'And is this at all related to the ACI and a conference that was held here in Long Beach related to aircrafts this year?'",
        "'speaker_8': 'No, it is not.'",
        "'speaker_10': 'And again, I appreciate you answering the questions despite your presentation, making some of these, because these were sent in in advance. Does the city's noise ordinance have any discussion about helicopter noise?'",
        "'speaker_14': 'No. The the noise ordinance establishes limits at the noise monitors which are associated with our runways. If the helicopters are operating to or from those runways, they are subject to the ordinance. We do not have any noise monitors in our primary helicopter quarters, however.'",
        "'speaker_10': 'And does the addition of nine new slots in any way impact other aircraft carrier usage categories? I think you talked about that already, and that was an explicit no. And what are the lost revenues from commercial airlines who left the airport and or underutilization over the last two years?'",
        "'speaker_10': 'What are the lost revenues? In the past. Public passenger flights, fliers.'",
        "'speaker_8': 'So we've taken a look at this since my arrival, and we've determined that the revenues are off by approximately $2 million in each of the last three fiscal years, and that is due almost exclusively to a reduction in flying, which leads to fewer passengers going through the terminal facility and all of the other revenue generating functions have'",
        "'speaker_8': '. It has a ripple effect, in essence. So it's approximately $2 million annually.'",
        "'speaker_10': 'And have any of the potential, um, interested in any potential of the airlines that are interested in the slots reached out to express their explicit interest or do we have any written correspondence?'",
        "'speaker_8': 'I have met through the course of attending various industry events this year. I have I've been informed by various carriers that there is interest, general interest. But clearly at that time that was a discussion over which there was there was no slot allocation available, no slots available for allocation.'",
        "'speaker_8': 'So that would need to be revisited once the period for air carrier interest is is opened.'",
        "'speaker_10': 'I want to thank the members of the community who consolidated questions with us and made answering these questions possible. I wish I could have gotten back to everyone via phone call or email. As everyone is aware, we have a lot of items on the agenda.'",
        "'speaker_10': 'I think we took 30 phone calls today, and so I appreciate those of you who submitted in advance. I appreciate those of you who have come to any other community meeting and waited afterward to talk with me without interrupting the the cause of the community watch meeting or other matters that we had at the time.'",
        "'speaker_10': 'And I look forward to hearing my colleagues and the public before making additional comments. Thank you.'",
        "'speaker_0': 'Okay. Thank you, Councilman Austin.'",
        "'speaker_11': 'Thank you. And I want to thank my colleague, Councilmember Mongo, for asking many of the same questions that they actually have. And they were submitted to my office as well from many members of the public as I communicated to my constituents.'",
        "'speaker_11': 'I'm not thrilled about this news and potential action of awarding new slots at our airport. And not thrilled is an understatement. But I see this as more of an administrative and legal action as opposed to a policy decision by the by the council.'",
        "'speaker_11': 'That's that's very clear in the process and the ordinance. I do have several questions still, and I would just ask that the council and the public indulge us so we can get these questions out and answered so that people walk away from here with greater clarity.'",
        "'speaker_11': 'And so for the benefit from for everyone here, I'm going to ask, I think, an obvious question. Can you please provide an explanation in layman's terms about the differences between last year and this year, where yesterday the noise ordinance or noise study did not warrant additional flights?'",
        "'speaker_11': 'And this year we are now supposed to add nine new flights. I was reading a an op ed by by an airline executives last year on December of 2014. And he made mention to the fact that we were under well, under the noise allowable noise limit here in Long Beach.'",
        "'speaker_11': 'And so it was clear we were there that last year. Why different this year?'",
        "'speaker_8': 'Yes. Councilman Alston, for roughly the last three years there has been room available in the noise budget, in the air carrier noise budget. However, in the period as recently as late 2011 or early 2012, the airport still had activity by an operator that utilized the MD 80 aircraft, which was by far the the noisiest aircraft among the'",
        "'speaker_8': 'air carrier operations in Long Beach. So when it was determined that there was some room available with the FBI 12 analysis and there was still some room with the next year's analysis, it needed to be determined that there was a trend in place instead of in the very first year that there was a bit of room available'",
        "'speaker_8': '. That room was immediately filled with new flying and then the potential would be there for it to go right back over because that operator had vacated the market. But they certainly could have reentered with the new slots that had would have become available had there been new slots allocated in prior years.'",
        "'speaker_8': 'And so there was a, I think, a real hesitation because of that aircraft type still being very prevalent with various air carriers being actively flown. As the years have passed, that aircraft is being retired at rapid rates, especially by American Airlines, which was formerly the largest operator of the MD 80, with over 400 aircraft in their fleet'",
        "'speaker_8': 'of the MD 80 type. But also, we have now established a trend. We have seen that there have been several periods where there is room available and the budget and the amount of available room has grown. And so we at a point now where it is time to to act to fill the available noise budget with these'",
        "'speaker_8': 'nine supplemental slots.'",
        "'speaker_11': 'So in short, the MDA shows what airline utilized the MDA.'",
        "'speaker_8': 'That was Allegiant.'",
        "'speaker_11': 'And is Allegiant still operating at the airport?'",
        "'speaker_8': 'They're still operating, but not at the airport, not at Long Beach at the present time.'",
        "'speaker_11': 'Okay. So they they are they are no longer operating.'",
        "'speaker_8': 'Correct. And one one great change about Allegiant. If they were to submit interest to return to the airport when they operated here in 2011, the only aircraft type they had in their fleet was the MD 80. Today they have a fleet of 25.'",
        "'speaker_8': 'In addition to the MD 80, they have a fleet of 25 A319 and A320 aircraft. The A320 we're very familiar with as that is what JetBlue flies here exclusively. So Allegiant has an option for an aircraft to put into this market that they did not have in 2011.'",
        "'speaker_11': 'Thank you, sir. So I'd like to, too, I'm going to jump around here with the additional nine flight slots. Certainly, I don't know much about airport operations. I would defer to you, Mr. Francis, but how does that impact and correlate with the FAA and other stakeholders that that that are necessary for airport operations?'",
        "'speaker_11': 'The 30 day window is the FAA prepared with air traffic controllers and TSA to handle.'",
        "'speaker_9': 'Nine more slots.'",
        "'speaker_11': 'So to speak. And how does that work?'",
        "'speaker_8': 'Well, I would I.'",
        "'speaker_11': 'Would say being consulted with in any way.'",
        "'speaker_8': 'They've not been consulted with. But I do not foresee any problem whatsoever in there being an ability to handle a an increase in the amount of aircraft activity by the FAA through the air traffic control system, nor on the ground with the TSA and the the passenger side of of the operation.'",
        "'speaker_11': 'Okay. And so your memo indicates that the slots will be awarded awarded in 30 days or within 30 days of becoming available. Can you describe that process and include when that 30 day clock starts to tick?'",
        "'speaker_8': 'Yes, sir. We'll have Mr. Mays respond to that question.'",
        "'speaker_13': 'Councilman Austin, the airport has a flight allocation protocol in place in the way it would work is that we would set an application time period of 30 days. Let's say hypothetically, it was January 1st. We would open up an application period.'",
        "'speaker_13': 'We would literally send a letter to each of our incumbent carriers at the airport indicating that there were nine slots available. We would also, as Mr. Francis indicated, send a letter, similar letters to all carriers that fly in the United States that may not be at our airport indicating that slots are available.'",
        "'speaker_13': 'At the conclusion of that period, we would see how many applications that we would have, and there could be a number of different scenarios if we had no applications at all because their one year supplemental slots, nothing would be allocated and we just move forward with what we have at the airport.'",
        "'speaker_13': 'If we had more than nine requests for slots or say two carriers each wanted six slots, we would basically go through a lottery process and it's set up to in essence favor slightly a non incumbents at the airport.'",
        "'speaker_13': 'So if you had an incumbent at the airport and none incumbent at the airport vying for slots, the non-incumbent would first be allocated to slots as opposed to the one slot that would be allocated to the incumbent at the airport.'",
        "'speaker_13': 'And so we would go through that allocation lottery process. They would have to submit to the airport what we call slot bonds that would guarantee the fact that they were actually going to utilize the slots. They would then have to demonstrate to us that they would advertise the slots as being ready for use within 90 days.'",
        "'speaker_13': 'They would actually have to, in order to retain the slot, have them up and running within a six month period.'",
        "'speaker_11': 'Okay. Thank you. So how does the appeal process impact the 30 day window?'",
        "'speaker_13': 'So the the appeal period would not allocate would not impact the 30 day window at all. The ordinance is clear that we have to do the allocation. So we would proceed in parallel, in essence. And the appeal period really wasn't discussed much here tonight.'",
        "'speaker_13': 'But basically the other thing I left out of the allocation protocol, in addition to sending notification to the air carriers, will also advertise in the newspaper the fact that we have slots available and set up a period of time in which people can appeal.'",
        "'speaker_13': 'It's a three tier appeal process. Basically the they could appeal directly to the airport director or the airport manager that subsequently could be appealed to the city manager of the city manager's designee and ultimately to the city council.'",
        "'speaker_13': 'But in a situation like this, what I liken to it's not like a C where it would come to the Council with much discretion in order not to allocate the nine slots. Basically someone would have to come forward with information that proved quite clearly that the calculations made by the various acoustical engineers who have presented the studies'",
        "'speaker_13': 'to the city council and the airport director were somehow incorrect. And that's precisely why we requested that at the beginning there would be peer review of our. Mr. Mestre, who's been there since 1999, his work. So in essence, we would proceed in parallel.'",
        "'speaker_11': 'So, Mr. Mayes, when was the last time we actually allocated new slots in the airport?'",
        "'speaker_13': 'So we literally have never allocated new slots under the ordinance that was adopted in 1995.'",
        "'speaker_11': 'Okay. That was a trick question.'",
        "'speaker_13': 'Okay.'",
        "'speaker_11': 'In your next steps, you say we're going to award the slots based on an established protocol and the protocol. How can we have a protocol if we've never done it before?'",
        "'speaker_13': 'That's what we've been working on. So we have put together we use the ordinance as a framework for developing the protocol. And so for the last couple of weeks, when we knew that this was going to come before the City Council, we have developed the protocol and our office did send each of the council members a copy'",
        "'speaker_13': 'of the protocol as an off agenda item earlier last week. So we have a very extensive protocol that lays out quite clearly, clearly what the airport air carriers must do if they want to apply. They have to first indicate to us they have the financial wherewithal to provide a slot bond.'",
        "'speaker_13': 'They have to indicate to us clearly what type of aircraft they intend to bring into the airport if they were allocated slots. They have to demonstrate that they are certificated by the FAA as a air carrier, air carrier and a few other things.'",
        "'speaker_13': 'So all of that is laid out in the protocol. It's about a five page protocol.'",
        "'speaker_11': 'Okay. So I think this this will address some of the concerns that I've heard from many of my residents. Currently, the Airport Advisory Commission receives a monthly activity and noise violation reports, and those reports are made available online.'",
        "'speaker_11': 'However, the findings of the annual noise budget study are not easily accessible as far as I know. And until this year that we have not been made publicly known, I think there's been part of it that's been part of the problem with this announcement about additional flight slots that the public do not have a real context to'",
        "'speaker_11': 'work from. And in the interest of transparency, can the airport staff make the annual noise study publicly available, such as through a report to the Airport Advisory Commission and posted on the airport website similar to the noise violation and activity reports.'",
        "'speaker_11': 'I know we are doing a lot of work and trying to and maybe our I-Team is paying attention here, but trying to create open data. And is that something that we can look at doing? Because I think that is part of what we we fell short.'",
        "'speaker_8': 'Yes, sir. Councilman Ross, we certainly can accomplish that.'",
        "'speaker_11': 'Okay. I think that was been that's been answered. And this question is for the street, for a city attorney. Is it your legal opinion that the airport noise ordinance requires the city to add these additional flights that slots based on the noise data available?'",
        "'speaker_7': 'Yes, that is correct.'",
        "'speaker_11': 'And what could potentially happen if the city did not make these additional slots available.'",
        "'speaker_7': 'That the failure to comply with the noise ordinance is is obviously the greatest risk to the FAA taking action against the city and either revoking the grandfather status. In addition, failure to allocate and follow the ordinance is going to implicate the grants, the FAA grants that the airport and the grant assurances.'",
        "'speaker_7': 'So over the years the city has received the FAA, the airport has received grant money. And in it, it requires that we comply with the terms of our anchor and the city's ordinance. And so that could implicate funding opportunities for the city and the city would maybe not be able to obtain those moneys.'",
        "'speaker_11': 'I think one issue that that concerns many, many people across the city is the fact that potentially our slots, airport slots are being gamed to a degree. And I think it would it would help. The question that I have is, is what what can the council do to prevent slot squadding, whether these are the new slots or'",
        "'speaker_11': 'the existing slots?'",
        "'speaker_7': 'Well, I'll ask Mike to jump in here, too. But I think that, as Mr. Maes pointed out, the slot squatting as described is in compliance with the city's slot resolution requirement and determines the rules on how the airlines must use their slots in order not to lose them or to maintain them.'",
        "'speaker_7': 'And that, as far as I know, that particular section of that resolution has not been changed since adopted in 1995. And Mike, if you want to add.'",
        "'speaker_13': 'We could look the council could look at potentially altering that. But that would take, I would think, a lot of discussion on the council to do that, because, in essence, if you did alter that resolution, you would in essence, be requiring air carriers to fly more frequently than sometimes they currently do.'",
        "'speaker_13': 'And so that would be a policy decision for the city council. I don't think you would get any pushback from the Federal Aviation Administration because they, quite frankly, like to see more planes in the air, but that the way it is structured now is based on when the resolution was passed, I think they tried to create a'",
        "'speaker_13': 'balance between the interests of the public and the preservation of their peace and quiet in their neighborhoods versus the rights of the air carriers to fly. So they came up with that scenario, which allows an air carrier to fly, as you've heard tonight, maybe as low as 64% of their actual slots, or 70% depending on the carrier'",
        "'speaker_13': '. So but that is something that on a going forward basis, if the council wanted to look at that or wanted, we certainly could do that.'",
        "'speaker_11': 'Well, thank you. And I appreciate the the very straightforward answers to the questions. This is a difficult position, particularly for for me and the residents who I represent. This is, for the most part, not been seen as welcome news.'",
        "'speaker_11': 'But we all each and every one of these council members have pledged to do all we can to to maintain our noise ordinance. Noise ordinance. I'm going to be looking at all the alternatives and options available to ensure that the quality of life film in our neighborhoods is protected.'",
        "'speaker_11': 'And then we strike that balance because we do have an airport. We and we do have an obligation in that regard as well. I recognize that. I'm looking forward to hearing from the rest of my colleagues in the public.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember I'm sorry, Councilmember Ringo.'",
        "'speaker_12': 'Thank you. Jesus. The discussion has already taken so long. I lost track of where we're at. But. But bear with me. If. If I. My question is, get a little redundant. Because, like I say, that there's some points of clarification even in some of those that we've already discussed that that I didn't hear.'",
        "'speaker_12': 'And perhaps I want a little bit better clarification on those. But I have to agree with my colleague, Councilmember Austin, with the in regard to a surprise, especially when it comes down to timing. Timing is everything when it comes to issues like this.'",
        "'speaker_12': 'Here we are in the midst of a study to look at a customs facility and then we get a report that says we have to add nine additional flights. The timing on that couldn't have been worse or better in that regard because we're looking at the impacts of what a customs facility will do to our airport.'",
        "'speaker_12': 'At the same time, we're being told that we have to add nine flights because planes are getting quieter. So it doesn't it doesn't really make sense. And there's anything that a local official, especially me, that I don't like, is surprises.'",
        "'speaker_12': 'And frankly, this came as a surprise to us, and it it really threw us back in regards to what we're going to be dealing with in the next few months as the Customs facility study comes forward. So one of the things that I think that's out there that wasn't very clear and I think that needs a better'",
        "'speaker_12': 'clarification for the community because there's this misunderstanding or disconnect with the noise ordinance and what that means with the amount and the number of flights. A lot of people confused. The noise ordinance has been one set and the flights being another.'",
        "'speaker_12': 'In other words, that the 41 flights that we have is the maximum when in reality it's the minimum. So we have to look at and we're talking about as planes are getting quieter, that provides the opportunity for the airport or for us as a city to increase the number of flights.'",
        "'speaker_12': 'So I think that that needs to be made very clear to those who are most of all engaged in this in this discussion, but those who are affected by it as well. We need to understand that where we're at right now in terms of this mandate, if you will call it a mandate.'",
        "'speaker_12': 'Apparently, that's what we're at. To airline flights it go up to 50 is something that's a major concern. Having said all that, is there a limit? As planes get quieter, as as we add these nine flights, more planes will be quieter.'",
        "'speaker_12': 'Is there a maximum? We know the 41 is a minimum. Is there a maximum number of flights that we can realistically add over the next year or two years, whatever, whatever length of time it takes?'",
        "'speaker_13': 'The ordinance itself doesn't set forth a maximum, it leaves it open ended. But as a practical matter, there would be a maximum because it's still ultimately tied to the noise budget that was established in 1989, 1990. I don't know what the exact number would be as a maximum.'",
        "'speaker_13': 'As I indicated when we looked at this issue in the airport expansion E.R. in 2006, when the acoustical analysts looked at it, they projected maybe 11, but it could go a little bit higher than that. It just depends really on how quiet the aircraft get.'",
        "'speaker_13': 'And you know what? Our fleet mix is out of the airport.'",
        "'speaker_12': 'Now, in the previous questioning, there was a discussion about the the types of planes that are currently coming in or are in use at the Long Beach Airport. What was specifically mentioned about the the MD 80 versus the A320, which is the quieter plane and I'm looking at page four of the of the presentation where the MD'",
        "'speaker_12': '80 and the B737 Dash 400 is a borderline when you start with the 80. With the B737, they started getting quieter and we go all the way down to the A320. Would there be a prerequisite, if you will, a requirement for any airline that would be considering having some flights added to Long Beach as a destination or'",
        "'speaker_12': 'departure point to use the acquired planes?'",
        "'speaker_6': 'We can't recall.'",
        "'speaker_12': 'When can we do it? Can we legally do that?'",
        "'speaker_13': 'That's a good question there. We can't legally discriminate against any carrier that's certificated by the FAA as being able to carry passengers or cargo. But what we can do, and it was indicated in the presentation, if hypothetically when we advertise for the nine supplemental slots, one carrier came in and said, I want all nine slots.'",
        "'speaker_13': 'And by the way, I'm going to fly all MD eighties. We would have our acoustical engineer look at that scenario and based on what he has told us thus far, we would be able to ratchet down the number of slots that would be allocated to bring us within the budget.'",
        "'speaker_13': 'We don't anticipate that happening because there aren't that many MDs out there actually being flown by major air carriers. But we would ratchet down the number if the louder planes applied.'",
        "'speaker_12': 'Now there was a reference made to Allegiant that did that one time fly a Long Beach and fly in the eighties. Apparently, they still have some in their in their in their inventory of planes. And, of course, that would be welcome back.'",
        "'speaker_12': 'But if could we tell them. Yeah, but not with your MD 80.'",
        "'speaker_8': 'So, Councilman, you're wrong. The answer is that we we could not require them to operate the MD 80 or anything other than in the 80 or to prohibit the MD 80 from coming into the market. But as I mentioned.'",
        "'speaker_8': 'Allegiant now has other aircraft types in their fleets, which one of which we are very familiar with the A320, and they also have several A319 aircraft. They have 25 of those aircraft in their fleet today. They have already executed agreements to purchase an additional 25 of those A319 A320 aircraft, which will join their fleet over the next'",
        "'speaker_8': 'two years. So they will have approximately 50 A319 and A320 aircraft in the fleet, which will be equal to or greater than the number of MD 80 is that they're operating by the end of 2017. So clearly that's an airline that has evolved, that has taken on an aircraft type that is much more environmentally friendly.'",
        "'speaker_8': 'And I would fully expect that if Allegiant did state interest in returning to the market, that they would state that service would be operated by one of their Airbus aircraft.'",
        "'speaker_12': 'But at the present time, we don't exactly know. If we put those nine slots out there, that they will be. That they will be accepted. Do are there. Has there been any interest up to this point expressed by any of the airlines in saying, yeah, we'd like to look into those 9 to 9 or to our core'",
        "'speaker_12': 'services?'",
        "'speaker_8': 'When we open up the allocation period, which is a 30 day window, that will be the opportunity for the airlines to submit interest in writing. And at that time, they would have to also indicate what aircraft type they intend to utilize for those slots in the market.'",
        "'speaker_12': 'And just for purposes of argument, let's say that all nine slots are not are not filled. Are we still how would we be out of compliance? We did not feel all nine flights. All nine slots.'",
        "'speaker_8': 'No. We would not be out of compliance if there were any slots remaining within those that were made available for allocation, they would remain available for the remainder of the existing 12 month period, which would run through September 30th.'",
        "'speaker_8': 'And then we would conduct this annual analysis again to determine whether those slots would remain available based upon the cumulative noise levels as a result of the 516 analysis.'",
        "'speaker_12': 'Okay. One more line of questioning. There was a discussion also about the closing down of some of the runways for maintenance purposes. Is a noise ordinance suspended during that period of time? And is is it generally is a jet part of general information to the airlines that there's a runway?'",
        "'speaker_12': 'There's got to be no doubt that a runway is closed. There has to be that kangaroo for you can't fly into a runway and. In repair. But. But tell him mostly about the noise ordinance. It is suspended during that period of time.'",
        "'speaker_12': 'Well, how does that work?'",
        "'speaker_8': 'Yes, sir. We will have Mr. Ron Reeves, our noise and environmental officer, respond to that question.'",
        "'speaker_14': 'Yes. Councilman, the the airlines are made aware of runway closures through a procedure called no towns notices to airmen. And our operations department distributes these to the the FAA. And that that does go to to all the airlines.'",
        "'speaker_14': 'During the period. When we do have runway closures, the requirements or the noise levels associated with the runways are exempt. For example, during the nighttime hours, runway 1230 is the only runway that's in use if it is closed for maintenance.'",
        "'speaker_14': 'On those rare instances, runway two five right may be used. We do not have noise levels applicable to air carriers for runway 25. Right. However, these these occurrences are very rare.'",
        "'speaker_6': 'Okay.'",
        "'speaker_12': 'Now, there was also discussion about the appeal process. Does that start immediately or is there does the appeal start after the ninth slots are announced as being made available?'",
        "'speaker_13': 'Because when you arrange it, that's part of the airport's allocation protocol. And basically, we would set a time period in which the appeal period would run and it would be initially a 15 day appeal period, and we would make that known to both the air carriers and the public.'",
        "'speaker_13': 'So if anyone did want to appeal it, if they felt that the noise studies were somehow incorrect, they could definitely bring that to the airport directors attention.'",
        "'speaker_12': 'Now, that would be for the whole budget of nine, nine flights.'",
        "'speaker_13': 'We would do it. We would do it at one time. We would make an announcement that there were nine supplemental slots available. And we would also indicate to the public and the air carriers what the time period would be and how to file an appeal.'",
        "'speaker_12': 'Okay. Well, thank you for your responses. I know it takes a lot of patience. We have a lot of questions and sometimes they get redundant. But yeah, I'm definitely very concerned about the the afternoon surprise, if you will, on this issue.'",
        "'speaker_12': 'And of course, you know, we are looking at a community that is very concerned about what this additional pattern for the airport, what that would bring to the to the noise ordinance and its compatibility and its ability to stay within within the limits.'",
        "'speaker_12': 'We understand that it's quieter planes are made available, that there's probably going to be an opportunity to increase flights. But we want to make sure that it's done in a in a strategic and in a very responsible manner for our community so that their quality of life is not that much affected.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_5': 'Thank you. I do have a couple of questions that Councilwoman Mongeau brought up earlier regarding helicopter noise. I know that's not directly related to this adding of the new slots, but how does helicopter noise impact the noise bucket and what control, if any, does the city have in regards to that?'",
        "'speaker_14': 'Helicopter noise when it is associated with our typical flight paths along the runway over the noise monitors is included in our general aviation noise bucket. So that to say that helicopters are excluded is not entirely correct. However, air helicopters typically use our helicopter corridors rather than the runways.'",
        "'speaker_5': 'Okay. And do you think that additional airplane traffic could impact the request that helicopters fly at a higher altitude, as has been discussed?'",
        "'speaker_14': 'This request will not impact helicopter altitudes. It will not in any way change our fixed wing traffic patterns or the ability to modify those patterns in the future.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Council members who were not.'",
        "'speaker_8': 'Thank you, Mayor Garcia. Before I start, just like to acknowledge some of our airport advisory commissioners in the audience tonight. Thank you for being here. My first question is regarding. I'll just follow up on on a point that councilmember you're on a brought up about allegiant and flying an older louder aircraft.'",
        "'speaker_8': 'My briefing my very first briefing. I think, Mr. Francis, you told me that if there were a violation, we were talking about hypotheticals here. If there were a violator in of that nature, they would be the first to be booted out.'",
        "'speaker_8': 'Can you explain that a little bit? That is correct. If at the end of the 12 month noise year and the preceding noise analysis was conducted and it determined that we, in fact, had gone above the noise budget limit, then we would take a look at the additional flying that was made available through this allocation of slots'",
        "'speaker_8': '. And in essence, the operator with the noisiest aircraft would be the first one that we would contact to reduce the number of slots available. So that is correct, Councilman. Okay. Thank you. Then I have a question about noise monitors.'",
        "'speaker_8': 'So I think they should probably be directed to Ron Reeves. We list monitors on nine and ten and ten is in the fourth Council District. If there are will, we know there are other monitors that don't function all the time.'",
        "'speaker_8': 'For instance, there's one in the art craft manor neighborhood on Quincy Avenue between BURNETT and Vernon Mysteries. How does that affect this calculation?'",
        "'speaker_14': 'The other monitors do not directly affect these calculations other than noise. Data from those other monitors is used to verify the noise levels at nine and ten.'",
        "'speaker_8': 'Okay. Thank you. Also customary raga. How do we characterize the phone call from the city manager? But it was a Saturday afternoon phone call. Okay. Afternoon. Surprise. Thank you. Upon getting that phone call, I actually requested and got a meeting in less than 18 hours.'",
        "'speaker_8': 'So Director Francis, Assistant City Attorney Mays and actually city attorney Charles Parkin and I met in city attorney's office on Sunday morning at 10 a.m.. So I was probably the first councilmember to be briefed. I'm not sure if anyone got there earlier than I, but I think that's how it worked out.'",
        "'speaker_6': 'At that.'",
        "'speaker_8': 'Time. Mr. Francis, explain to me then exactly what he's saying tonight, that all of the slots were calculated on a on a noise value. That and I'll just ask. Nothing changed in between that point and tonight. No, sir.'",
        "'speaker_8': 'Okay. So I'd like to ask a question just about the Landrum report and just one sentence. I'm not understanding how this sentence comports with what we're seeing tonight, and that is the first part of the sentence. I am fine with the reason the budget numbers are well below the permitted levels is due to the reduction the number'",
        "'speaker_8': 'of noisier aircraft. Now, here's the part that I question and the fact that the airport operated well below the permitted number of daily air carrier flights. That seems to be kind of the opposite of what we're saying here.'",
        "'speaker_8': 'So you figured that out. You had the lander report before we met that very first day. So how does how does this make sense to you? Ask Mr. Reese to respond to that, please.'",
        "'speaker_14': 'Yes, Councilman. Super not the. I understand from what is indicated in the report that the reason our existing noise levels are as low as they are is because of the fleet mix, the quieter aircraft types, as well as the low number of flights.'",
        "'speaker_14': 'That's in response to our current noise levels. Our future noise levels, though, were calculated based on a 95% utilization of all slots, which Director Francis has indicated is very conservative.'",
        "'speaker_8': 'Okay. Then that is the explanation. It's not semantics. It's just that we're talking about two different topics. Is it does that comport with the way you're saying it? The well is not factored into that sentence, is the theoretical calculation if every slot were filled.'",
        "'speaker_14': 'That's my understanding. Caltech.'",
        "'speaker_8': 'Okay, great. Thank you. That's all I have. Thanks.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_9': 'Thank you. My comments will be brief. Director Francis, question Does the ordinance prevent you from consulting with the airport convention commission or the city council prior to making this decision?'",
        "'speaker_8': 'I will ask Mr. Mays to respond to that, please.'",
        "'speaker_13': 'It certainly wouldn't prevent the airport director from doing a study session such as we're doing tonight or with the Airport Advisory Commission. But the airport ordinance makes it very clear that is the decision of the airport director to make based on consultation with this noise consultants.'",
        "'speaker_9': 'Right. I would have to just say that, you know something is this major? In the time I've served, in the short time I've served on the council or have worked on the 14th floor, I mean, it's a pretty major decision.'",
        "'speaker_9': 'And again, to get to have no don't no notice and get a call on a Saturday, it seems. It was a bit shocking for that to happen. I would say if the ordinance doesn't if it does not jeopardize our ordinance to be to air on the side of inclusion or transparency.'",
        "'speaker_9': 'My guidance here would be we should air on that side. Moving forward, we all have airport commissioners and, you know, I have an airport commissioner that you know, I have an airport commissioner in District nine that's, you know, pretty engaged.'",
        "'speaker_9': 'And he actually submits a report to the city council after every single meeting. And and I checked with him to say, did you know that this decision was going to come? He said, I've seen the numbers. I'm not surprised.'",
        "'speaker_9': 'But not even we were notified that we were heading in that direction. So I would just offer and hopefully it's received, I would just offer that we can go. It goes a long way to the community to bring the council along through this process.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_8': 'Customer? Richardson If I might, I just wanted to say thank you for those comments, but also to state the fact that this process moved along from the latter part of October through the latter part of November, and not until just literally a couple of days before you were contacted did we have the final information.'",
        "'speaker_8': 'We brought the city manager into the understanding of the situation, and he very soon thereafter made the mayor and council aware of that. So I just wanted you to know that it was not something that was delayed or that we we did not share with the commissioners or the council with that knowledge well in advance.'",
        "'speaker_8': 'We actually went through the process just over the last several excuse me, several weeks.'",
        "'speaker_9': 'Thank thank you. I would say and I'm glad that the city manager did respond and call when he did. I think it would be good that if you knew that this study was going to come back in advance, if the council knew, hey, potentially in December, there will be a study, we will have the final results.'",
        "'speaker_9': 'We do this every year. And based on those results, we may or may not make a decision that that notification would have gone a long way. But I do appreciate the diligent dilutions matter.'",
        "'speaker_0': 'Thank you. With that, we're going to turn this over to public comment. So if you have any public comment, please come forward on this item and make sure you introduce yourself and your address, please.'",
        "'speaker_6': 'Oh.'",
        "'speaker_0': 'And just as a reminder, this is a study session. This is not in a. There's not an agenda item attached to this. Please begin.'",
        "'speaker_6': 'Yes. Because of my name's Larry Boland. Address on file. I was a member of the Portland Five-O study 25 years ago. And I'd like to tell you that this item was never, ever discussed. Those of us who were there, it had so many come up and said, you know, down in the future when we finally quiet this'",
        "'speaker_6': 'airport down and get rid of the noise pollution. If we don't if we get too quiet, we're going to add some pollution back into the equation. It's just ridiculous. Let me tell you. We were not interested in what the noise bucket was.'",
        "'speaker_6': 'The noise bucket does not wake people up in the morning. The noise bucket doesn't pour noise. Pollution into our schools affect our property values. The noise bucket is simply something that the government came up with. What we feel as human beings is the noise event.'",
        "'speaker_6': 'And by the way, folks, you kept talking about 41 flights and nobody brought up the fact that a flight is an arrival and a departure. 81 flights, 81 noise events, rather. That's what we listen to. Nobody here tonight even said that nine is not nine flights is nine flights, but it's not 18 noise events.'",
        "'speaker_6': 'And JetBlue sitting on ten. Well, we had nine. Come on, guys. What's going on here? And nobody would ever have thought that where we have a single event noise level of around 100 DB, which was S.E.A.L. Single event noise of level.'",
        "'speaker_6': 'That was 25 years ago. That's how old that noise level that we're using today is. It's antiquated. It's obsolete. For us to right now, the JetBlue A320 leaves at about 83 DB. Do you know what that level is it at 100?'",
        "'speaker_6': 'Every three decibels is 100% increase. The noise levels that we have set now were 600%. That noise level 600% above what the JetBlue does. But at the time, we made it with all the seven 2017 dedication of DC night, it was right at where it was bought, where it was.'",
        "'speaker_6': 'In other words, it wasn't 600% away. It was right near where the level was. Why haven't we been reducing it so we can enjoy the technological advances that have come from the quieter airplanes? By the way, we also didn't talk about the noise that is not counted at the airport, the thrust reverse noise, the helicopter noise, the'",
        "'speaker_6': 'engine run up noise. The private.'",
        "'speaker_0': 'Thank you, sir. Time's up.'",
        "'speaker_6': 'Okay. I'm sorry. No problem. But I just am flabbergasted at this. This event. And we never heard it. This was never brought before the Portland Five-O study. Thank you, sir. That I recall. Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_7': 'Joe Sopko hushed two neighborhoods. First, Mr. Mayor.'",
        "'speaker_9': 'City Council members and staff. I.'",
        "'speaker_7': 'I really appreciate all the questions that the City Council brought up. Thank you for doing that, asking those questions. You know, it's obvious to Mr. Francis that the neighborhoods are sensitive about the number of flights, the noise it makes when they're woken up at night.'",
        "'speaker_7': 'We're sensitive to that. And to drop this on us, on you at a Saturday afternoon. Reflects. On how Mr. Francis treats us.'",
        "'speaker_9': 'Now we're you're.'",
        "'speaker_7': 'You're talking about an appeal process. Is there an appeal process to relieve Mr. Francis of his job? Mr. Francis, since he's come into office, we've all gone up and introduced ourselves and. And it's obvious that he sees US neighborhood representatives as the enemy.'",
        "'speaker_7': 'And that's what we get from him. I want you to know that. So if he is to represent the airport, represent you, he's doing a very poor job. Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_5': 'My name is Barbara showing. 4120 Locust Avenue. And I was a member of the hash one committee years ago and I was glad that the question of international flights came up. I know it's not on the agenda tonight.'",
        "'speaker_5': 'It's on the agenda next week. But my question is, would international so these new nine flights could be domestic or they could be international? And what about private international flights that might come in and use the same runway?'",
        "'speaker_5': 'How would all that additional sound be calculated?'",
        "'speaker_0': 'So what we're going to do is we're going to make a note of that question and we're going to ask it right after one of the customers will ask that right after the public comment.'",
        "'speaker_5': 'Okay. And one other one other question, and that is when. And I remember the noise footprints of the very, very noisy planes. So now the Douglas Boeing is not sending any more big planes out.'",
        "'speaker_3': 'And I presume that they also impacted the noise calculation question mark.'",
        "'speaker_5': 'Maybe you could answer that as well.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Good evening. I'm David Raichlen at 4300 Cerritos Avenue. And Mr. Mayor.'",
        "'speaker_3': 'Council members.'",
        "'speaker_6': 'Staff, thank you so much for.'",
        "'speaker_7': 'Letting us speak.'",
        "'speaker_6': 'I'm a.'",
        "'speaker_3': 'Medical doctor.'",
        "'speaker_6': 'And I.'",
        "'speaker_7': 'Also work in the entertainment industry.'",
        "'speaker_6': 'And we mix audio.'",
        "'speaker_7': 'For motion pictures and for home use.'",
        "'speaker_6': 'At 85 decibels. So we don't let things.'",
        "'speaker_3': 'Get louder than.'",
        "'speaker_7': 'That certain operators might. What that means is that if you look at the noise level of a single event of 95 decibels, it means that you can't hear what we're mixing. And this is for movies and TV shows.'",
        "'speaker_6': 'That have.'",
        "'speaker_3': 'Explosions.'",
        "'speaker_7': 'And loud arguments. Those become inaudible when those events happen.'",
        "'speaker_6': 'So that gives you a sense of how.'",
        "'speaker_7': 'Loud it still is, even though there's been progress made. Also, since I work on this, it's not just the inconvenience of having.'",
        "'speaker_6': 'Things rendered inaudible. It's also.'",
        "'speaker_7': 'That.'",
        "'speaker_3': 'I have to stop work. We can't have.'",
        "'speaker_7': 'Conversations. Each of these events are disruptive. Also, as a physician, I can tell you that stress comes not.'",
        "'speaker_3': 'From single events unless they're truly extreme, but from the repetition.'",
        "'speaker_6': 'So the more.'",
        "'speaker_7': 'Loud events we have, the more stressful it becomes. So adding these slots and keeping it under the noise bucket misses the point. And the Court of Appeals understood this.'",
        "'speaker_14': 'When they said.'",
        "'speaker_6': 'That the annoyance factor.'",
        "'speaker_7': 'Was more important than the total amount of noise.'",
        "'speaker_3': 'Uh, I'm also really concerned that our standard goes back. So far in time that.'",
        "'speaker_6': 'It no longer represents the the world that we actually live in. Yes, technology.'",
        "'speaker_7': 'Has improved, but the purpose of that technology, of having less noise.'",
        "'speaker_3': 'Isn't to allow us.'",
        "'speaker_7': 'To have more noise. Things were made quieter.'",
        "'speaker_6': 'Because that was the goal, to make things quieter. So there's clearly something wrong with a law that says that we have to make the problem.'",
        "'speaker_3': 'Worse because technology.'",
        "'speaker_6': 'Has gotten better. This does not.'",
        "'speaker_3': 'Compute. Okay. Now.'",
        "'speaker_6': 'One other point that I think it's important to to think about is the way that the noise.'",
        "'speaker_3': 'Levels are measured is at two points. Statistically, that's not a real good sample.'",
        "'speaker_6': 'We'd like to get more than that than two.'",
        "'speaker_3': 'Points to measure.'",
        "'speaker_6': 'And especially because the way sound travels can.'",
        "'speaker_7': 'Vary so much with.'",
        "'speaker_3': 'Temperature.'",
        "'speaker_7': 'And other.'",
        "'speaker_6': 'Environmental conditions. So thank you and good evening.'",
        "'speaker_0': 'Thank you very much, sir. Next speaker, please.'",
        "'speaker_5': 'Hi. My name is Laurie Smith.'",
        "'speaker_10': 'I live in the third district.'",
        "'speaker_5': 'I'm a new resident of Bluff Park neighborhood. And I started looking at this when I moved in and about two years ago. Today, I guess we're we're discussing the noise budget analysis and the goal of the Long Beach Airport noise ordinance is to ensure that incompatible residential land use in the vicinity of the airport are not exposed'",
        "'speaker_5': 'to aircraft noise levels greater than 65 C an L and there's no noise monitors located along the main helicopter routes. This means that the noise ordinance is flawed if it's based on cumulative numbers. I posit that the reason our noise levels are so low is because we are not responsibly nor accurately recording all of Long Beach aircraft'",
        "'speaker_5': 'noise events, specifically helicopter corridors. So I know that you've been talking a lot about daily commercial flights coming in, but I'm talking about what Long Beach residents are experiencing besides major commercial flights. I'm taking a look at an analysis of helicopter operations that were done by the Long Beach Airport.'",
        "'speaker_5': 'They did a short term study and it involved two two helicopter overflights at 500 feet, which is what we experience on a daily basis. And these were taken at Man Elementary School. The sound exposure level was 82 DBA and 83 DBA.'",
        "'speaker_5': 'And I think the gentleman just before me was talking about a jet taking off at the airport at 85. So if you guys are okay with having that go over elementary schools on a daily basis, that's great. Also, this is one of the world's busiest airports in terms of general aviation activity, and that includes helicopter operations.'",
        "'speaker_5': 'We have way too many helicopter training, way too many fixed wing aircraft training going on at this airport. And you adding more flights really concerns me. I'd like for you guys to take a look at the noise monitors along our main helicopter, our main helicopter routes.'",
        "'speaker_5': 'According to this analysis of helicopter operations that was done by the Long Beach Airport, there's 16,000 flights, over 16,000 flights done. And a third of them, according to this report, were along the Redondo corridor. So I'm not very good at math, but I think that somewhere around 5200, 5400.'",
        "'speaker_5': 'So if we do that and we're looking at 82 or 83 DBA, I'm kind of wondering what the analysis is on this. So I just like some responsibility done here today and for some more analysis to be done with regards to the cumulative numbers.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'John Slattery, Long Beach Neighborhoods, First Mayor, City Council. Thank for the opportunity to speak in relation to this. I just have a couple of questions that I guess you guys will answer at the end. The first one is clarify the must versus May.'",
        "'speaker_6': 'As it relates to that, we must add these flights versus May cause as I read the ordinance, it basically says that we must evaluate it. But if the director feels that this may actually increase beyond that, we should not actually add those flights.'",
        "'speaker_6': 'But listening earlier they made it sound like, no, we still have to add it no matter what. The reason I ask that I just did some quick calculations and I guess, you know, trying to look at the LBE report and the other company that took a look at this trying to understand that's very difficult for a layman'",
        "'speaker_6': '. I just took a quick look, though, and Slide five and took a rough average of these newer planes because they're so much quieter. So their rough average is 92.2, a single noise event. So if you calculate that for Monitor nine, that's one of 1.475, just below just below the one or two.'",
        "'speaker_6': 'I think that the noise ordinance calls for. So when you.'",
        "'speaker_8': 'Guys calculated.'",
        "'speaker_6': 'For these additional flights, obviously you're just throwing a number in there. Hey, here's what the single noise was like. So my question is, were those just applied to the 7 to 11 or were they are 7 to 10?'",
        "'speaker_6': 'Or they also applied some to the ten and beyond because a lot of those are calculated at a higher rate and may change that. So that's kind of stuff I'd like to know. Thank you.'",
        "'speaker_0': 'Thank you. Makes me complete.'",
        "'speaker_11': 'Hi. Hi. My name is Good Luck.'",
        "'speaker_6': 'And Gary from. And I would past president of the Bixby Hill Community Association. And just a private homeowner. At the present moment, I had the pleasure of hosting 58 meetings regarding this airport in my home. In the period of time before the airport was remodeled.'",
        "'speaker_6': 'Represented from the city representative from the community and various other interested people who attended those meetings. I also served on the committee that designed the airport. And Ken had several meetings there. And I might tell you that you better look at the amount of slots or gates that you have to accommodate these nine additional aircraft, really.'",
        "'speaker_6': '18. And the the problems that they create pollution wise, besides the sound, if you didn't know it back at that time, I don't know what it is now. But Los Altos had the highest red cancer rate in Southern California, according to the Red Cross.'",
        "'speaker_6': 'Now, these planes are going to add impact more than just sound. They're going to end pack particles going into the air and everything else. So just to merit this increase, just to satisfy the requirements of the of the.'",
        "'speaker_6': 'Sound thing you're dealing with here is not really what it's all about. Can the airport handle are they all going to be passengers? What's the pollution of people getting to and from the airport? This all mushrooms into a big cloud of malarkey.'",
        "'speaker_6': 'So I would just like to tell you that there's more to it than just sound. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_3': 'Good evening, Ray Gable, eighth District. I had the privilege of representing the eighth District. And during that time, as Mr. Mays referred to earlier, there was a 2006 report that stated that we would be able to allow a maximum of 11 additional flights.'",
        "'speaker_3': 'And and the report said if there were absolutely no violations, I'd sure like to see a copy of that and make sure I'm quoting it correctly. But they said if there were no noise violations, which is very, very much unheard of.'",
        "'speaker_3': 'And I'm going to say that because the next thing I'm going to share with you is that in JetBlue, just JetBlue violated the noise ordinance 64 times in 2013, 49 times in 2014 and 12 times in the first quarter of this year.'",
        "'speaker_3': 'The complaints for September of 2015 totaled 1423, and since May 2015, that number of complaints was never under 1100. So statistically, and I'm just going to say welcome to my world, because you're going to see what happens with the community as all of the airport issues begin to unfold.'",
        "'speaker_3': '1983, when the City of Long Beach was sued by over 30 airlines, and then then it was limited. Our noise ordinance limited it to 32 flights. The airlines said that our noise ordinance was unlawful and it was appealed again in 1990 to the Court of Appeals.'",
        "'speaker_3': 'And I'm going to read this to you, because a gentleman just referred to it, but it says that limits the number of daily air carriers to 32. As the district court found, the total noise produced by 32 flights could vary significantly depending upon what sort of planes were used.'",
        "'speaker_3': 'Thus, the District Court concluded that the choice of the number 32 was arbitrary. What the ordinance seeks to accomplish, however, is not simply the limitation of noise for its own sake. Rather, it seeks to limit the annoyance that residents experience as a result of the airport's operation.'",
        "'speaker_3': 'It is not unreasonable to believe that the number of times the disturbance occurs could be as relevant as the cumulative noise created by the total number of such disturbances. Now there's a legal formula that you formula that you have to follow.'",
        "'speaker_3': 'And, you know, if if the legal representatives feel that it's important that you do this, I would urge you, if compliance is of concern, that you do it gradually. You don't jump up to fill the bucket to get to the very top of what was allowed previously.'",
        "'speaker_3': 'And you've heard a couple of other folks refer to why would you do this to impact in a negative way the quality of life for the residents? If you have an opportunity to to balance both sides, it's a slippery slope.'",
        "'speaker_3': 'I hope that you pay attention and that you make your decisions wisely. Thank you.'",
        "'speaker_0': 'Thank you. And are thank our final speaker for study session one.'",
        "'speaker_2': 'My good evening my name is Bill. Get a lottery. I live in the eighth district at 4465 Cerritos Avenue. And I just have another brief follow up question really. And I hope that you will take over that question from me and ask it later.'",
        "'speaker_2': 'There are a lot of concerns, health concerns, stress, heart disease, pollution for the lungs. And and so we really don't want to take this decision lightly. And so it comes down to.'",
        "'speaker_3': 'Must.'",
        "'speaker_2': 'We accept all these negative potential and current negative consequences, or do we have a choice? And I don't know about you, but I haven't heard anything tonight that convinces me that we must. In fact, I have heard phrases such as, I'm just going to look at providing the opportunity to add flights that doesn't sound like must.'",
        "'speaker_2': 'In fact, you're a noise specialist. The letter that was read doesn't say anything but must either. It says, Let's see. Sorry, the consultants I quote, the flight slots could be added. And in fact, that this is the subject of your discussion.'",
        "'speaker_2': 'All these all that verbiage indicates to me that there is a choice.'",
        "'speaker_4': 'So I would appreciate it if one of you.'",
        "'speaker_2': 'Could ask or maybe Mr. Maes might just volunteer.'",
        "'speaker_4': 'It.'",
        "'speaker_2': 'Where is where are the words in the in the in the noise ordinance? Specifically, he says it's explicitly stated maybe he can read it to us or point us to that part. Secondly, we worry about being incompetent or finally, worry about being in compliance with the ordinance.'",
        "'speaker_2': 'I have another question. We are allowing JetBlue to under under utilize the flights. I would think that that might be a question for compliance, too. Maybe you should ask, do we make ourselves open to any kind of lawsuit here?'",
        "'speaker_2': 'Because we are allowing I know it's by agreement and it's JetBlue is not breaking the law, but we are the ones who agreed to that to that rule. We are allowing them to under utilize. So therefore, we are not allowing other airlines the maximum opportunity.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And our final speaker will take it back to the council after this.'",
        "'speaker_4': 'Thank you, Shirley Broussard. Previously, I was a resident of District nine at 6320 Myrtle Avenue. When God called me into service of the homeless. I took up residence in my SUV, and I've traveled just about every district in the city.'",
        "'speaker_4': 'Having moved in this city to 1990. In 1997. I have worked with the homeless community. And they live outside. Let me apologized to each of you Council men and women. Because you're taking up a special interest here. So I apologize on behalf of us.'",
        "'speaker_4': 'I was looking to purchase property on Ocean Avenue. As I get ready to move into housing again after being on the mission field for seven years.'",
        "'speaker_0': 'And this is related to the.'",
        "'speaker_4': 'Yes, it is. Yes, it is. Not one time have I heard any homeless person complain about the noise. Any homeless people here tonight? Have you lived with any have you worked with any? Not one of them have ever complained.'",
        "'speaker_4': 'Above the noise ordinance. If God allows me, I intend to be somewhere in the in Europe or Canada for Christmas. And I'm going get on that plane and I'm like, even wonder who I'm waking up. How many of you are like me?'",
        "'speaker_4': 'You're going to be guilty during the holiday. You're going to climb on that plane. And you won't even wonder one minute who is being bothered by you sitting on that plane with all that noise. And, you know, I'm right community.'",
        "'speaker_4': 'And so we sit here tonight complaining about the noise that we sydnor our condos. Our mansions. Our million dollar pieces of property. The noise. We're complaining about the noise. And not one of the homeless people that I have service in seven years have ever complained about the noise.'",
        "'speaker_4': 'Then there's the kind of weird family community. That may seem kind of strange to you that you're complaining about the noises. You can't hear you commercials because the planes are blocking out the sound volume on your TVs. Oh, come on, now.'",
        "'speaker_4': 'Come on. This is Christmas. This is Hanukkah. We feel a little guilty, at least for four weeks. Commission. Airport Commission. I apologize to you, whoever you are. I don't know you. But this is your job. But it's comical.'",
        "'speaker_4': 'This is where we had a comedy relief tonight.'",
        "'speaker_0': 'If you think you are just another speaker, come forward. That's okay. Just. Okay.'",
        "'speaker_3': 'Sorry about not leaving as a finish, but no worries. Unfortunately, I'm going to complain about the noise.'",
        "'speaker_0': 'You got to give us your name for that. For the.'",
        "'speaker_3': 'Record. I'm Sterling Reagan. I'm currently residing in the 4300 Cerritos Avenue. Uh, so, um, I just wanted to make a comment about this whole study session. So, um. Uh, Mr. Franklin, you were talking about the noise level. And for 11 years, I've attended school here in the Long Beach District.'",
        "'speaker_3': 'And for 11 years, these noise events have occurred. And honestly, I don't even know if it has affected me physically. I doubt it has. But, uh, it it just seems like it doesn't make sense to add even more.'",
        "'speaker_3': 'Now, the events are really bothersome. And to add more because it's more effective doesn't make sense to me. Why? Why, why even need to add more events in the first place? Um, so that's what I wanted to say.'",
        "'speaker_3': 'And thank very much.'",
        "'speaker_0': 'Thank you very much. We're going to take this back to the council closed public comment for for the study session. Just a couple of things. And I want to hopefully we can get some of the questions that were answered answered as well.'",
        "'speaker_0': 'Um, you know, one thing I just want to say and, and, and first, I think it's important to acknowledge for everyone that there's no question that this conversation and this process actually affects people, affects people's quality of life and those that are living, particularly those under the flight path.'",
        "'speaker_0': 'It's a real issue. And so while it's for for many folks and I know for for staff, we're going through an administrative legal process. I get the fact that I think most people get the fact that for a lot of people, this is a real big issue and a huge quality of life issue for them.'",
        "'speaker_0': 'So I just want to put that out there. This is an important issue. And for some folks, this is the most important, most important issue that the the noise ordinance was discussed by a few folks. And I just want to say something.'",
        "'speaker_0': 'You know, it's interesting, the ordinance, while it is this kind of incredible legal document that limits and provides the airport some limits as well. It also has a lot of challenges. And one of the difficulties with our our noise ordinance, while it it literally we are one of a handful, not even a handful of cities that has'",
        "'speaker_0': 'this type of ordinance in. It has been a point of pride, I think, for our community. It's something that we treasure because we are we have such a built out environment around our airport. It's so important to protect it at the same time in in its construction.'",
        "'speaker_0': 'One of the major flaws is our ability to then modify the ordinance post adoption. And I see Council Councilman Gavlak shaking her head and here is the challenge. And so when when we talk about, well, you know, why didn't we make changes or should we have change the noise, the noise levels or the allotment?'",
        "'speaker_0': 'The truth is, is any changes to a grandfathered document could put the noise ordinance in grave jeopardy. And instead, instead of having a conversation about 41 flights or 50 flights, we're talking about 100 flights because we don't have a protective ordinance.'",
        "'speaker_0': 'And I just want to reconfirm with our city attorney, because you and I have had a lot of conversations a. Changing the ordinance or having making adjustments to it could essentially put our noise ordinance in major risk. And we had done it in the past or in the future.'",
        "'speaker_7': 'Yes, I mean, that's correct. And that's why I think why the council has never changed or amended this ordinance since 1995.'",
        "'speaker_0': 'So I just want to mention that the other thing I think is important to note, and I think it's frustrating for a lot of folks, it's frustrating for people up here. They say that as part of the the deal that was put together by JetBlue and as a reminder, listen, when when JetBlue came in, there was a'",
        "'speaker_0': 'lot of turmoil at the airport. There was a lot of issues about its future. They came in, they built out an operation. They were welcomed by the city, by many folks, not not by by everyone, but by many folks.'",
        "'speaker_0': 'And as far as the the legal framework that we created for the amount of flights they had to fly, there were some discussions about, well, you know, I think Councilman Austin called it what was that slot squatting? Okay.'",
        "'speaker_0': 'There was some conversation about about slot squatting. The whether we know whether we like it or not, they are operating in this legal framework that we created for them in the past. And so the issue is that there's concern by a lot of people.'",
        "'speaker_0': 'Will they why aren't they before we start talking about new flights, they're not even, you know, not even maximizing what they've been allotted. And I think while we a lot of folks would love for them to before we have this discussion, for them to actually fill that slot, they are operating in the legal framework that we provided'",
        "'speaker_0': '. And so we're not allowing them to fly or not fly. They are flying what they can within the legal framework we provided. And it's not we can tell them, you know, flier slots all day and all night, but they have the legal right to do that.'",
        "'speaker_0': 'And so that is, I think, as we move forward. Mr. Mays and I had asked you this before as we develop this next set, I think we have to just be conscious of the lessons learned from the last time we did this and just ensure that we are being kind of thoughtful and progressive in how we do'",
        "'speaker_0': 'this next set and what the protections are going to look like, you know, moving forward for regardless of who uses these sites. I have a question about also.'",
        "'speaker_6': 'The.'",
        "'speaker_0': 'The process of who gets the slots, because I think what I would I hope most folks are hearing is this is and I know, unfortunately for a lot of the residents, an administrative process. And one thing that I asked Mike and Charlie is, is it your, you know, 100% legal opinion that we have to fill the slots'",
        "'speaker_0': 'or the noise ordinance is in jeopardy? And your response has been consistently.'",
        "'speaker_7': 'That is correct. I think what you're saying, though, is, Phil, unless we have to make the slots available.'",
        "'speaker_0': 'Correct. I'm sorry. Make the slots available because they may or may not could fill depending on the demand. My question is, is how? When the slots are. Let's say we go through the process here. X amount of slots at nine slots.'",
        "'speaker_0': 'And there's interest from current carriers and perhaps new carriers. How do you how do you make the determination of a who has been good neighbors that are maybe currently in already at our airport or B, what the potential is for another carrier to come in and provide a different service?'",
        "'speaker_0': 'Or is it purely on a lottery random system? And can you can we go into a little bit of that detail? And I think that's important.'",
        "'speaker_13': 'Merits it's a little bit of a combination of that the way it would work under the allocation process. A new entrant at the airport would have the opportunity to get two slots before an incumbent carrier would be allocated one.'",
        "'speaker_13': 'And the idea behind that is the thought being that a new entrant would need at least two slots to make a viable presence at the airport. So any new entrant that would apply would be eligible for two. But other than that, it's basically strictly a lottery if and it really depends on how many applications we get.'",
        "'speaker_13': 'If we get one application and they want four slots and that's it, they would be allocated four slots. If we get five carriers that each want two slots, we would have to do a lottery. And when we've done lotteries before, not for supplemental slots because we've never allocated them, but for our regular slots, we literally draw names'",
        "'speaker_13': 'out of a hat and progress until the slots are allocated in accordance with what they've submitted in their application.'",
        "'speaker_0': 'And I thank you for that. However, is there not at some point in that slot allocation, aren't there interests of the city business, business decisions that are made? And what I mean by that is, you know, if it is in the interests of the airport to ensure that we have a diversified.'",
        "'speaker_0': 'Pool of carriers. And that's obviously a determination that the airport director would would make. Can that not be considered as part of the allocation?'",
        "'speaker_13': 'The way the allocation rows a resolution is structured? It can't be. It's simply if they qualify legally as an air carrier, they're properly certificated by the federal government, then they're eligible to apply. And it's kind of a catch 22 sometimes with the FAA, because when we allocated the 27 slots that we allocated to JetBlue in 2003, we'",
        "'speaker_13': 'did not feel that the FAA would have an issue with that because prior to that time, no one was flying at the airport, even though we had a red team trying to get folks to fly at the airport.'",
        "'speaker_13': 'But the FAA did have an issue with that. And they've since told us that we cannot illegally discriminate among the carriers. So. Based on the input that we have received from them over the years, we are going to do the allocation as a random draw.'",
        "'speaker_13': 'Making them the offer is fine if we make it available to every other carrier, whether they're an incumbent or not. And so we won't run afoul of any of the FAA regulations if we do that, even if JetBlue or one of our other incumbent carriers actually applies for and gets some slots.'",
        "'speaker_0': 'Okay. And then I just want to also make sure that I think we know what you're hearing from some of the community. And I've talked and I've had a chance to talk to a lot of folks about this issue, is clearly they're moving forward on this.'",
        "'speaker_0': 'I think the slot allocation process is really important. It's done incredibly transparent. And I'm looking, you know, Mr. City attorney, you know, and you know, Charlie and we've talked about this is I think that the the community will feel a lot more confident knowing that that process is airtight.'",
        "'speaker_0': 'It's very clearly spelled out how we're doing it prior to the process. We know exactly, you know, who is what the interest is. And the process is then transferring not just for the community's interest, but I think for the carriers that are interested.'",
        "'speaker_0': 'I'm hopeful. I'm not sure legally what what, what, what can or cannot be public. I understand there's but I think the more that can be, I think we should push for for that.'",
        "'speaker_13': 'There's nothing that would prohibit us from being fully transparent and public. As I indicated, we distributed the allocation protocol to the council offline. We can put that on the city attorney's website. We will put an advertisement in the newspaper for all the public to see, probably more than one newspaper indicating when the slots will be allocated and'",
        "'speaker_13': 'what the process is for appeal. So and if people have questions, they can certainly call our office to ask about that process, if it's unclear when they see what how it's set out.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'And just and any information you can add on the or whether or not, you know, judgment can be used by our airport director or city manager on on who is selected or not. I'm just interested in in that piece because, I mean, it seems like, you know, flipping a quarter is not the not the best way to'",
        "'speaker_0': 'do it. But.'",
        "'speaker_13': 'You know, the FAA just has very tight rules against discriminating among carriers. The only judgment that could be used is what we indicated is if, let's say hypothetically, one carrier came in and indicated on their application that they were going to fly all MDs.'",
        "'speaker_13': 'We would immediately consult with our noise experts to find out what that would do to the budget. If it looked like an it would that would break the budget, then we would ratchet down and they were the only carry that applied.'",
        "'speaker_13': 'We would ratchet down the number of slots that carrier could take.'",
        "'speaker_0': 'Okay. Well, I mean, and Mr. Mays, I think in in that kind of that observation, I think there are other observations that we could get to in what's currently happening at the airport that we could use to for that process.'",
        "'speaker_0': 'And we'll explore that a little bit. So. Councilmember Ringa.'",
        "'speaker_12': 'Yeah. I was directed by you.'",
        "'speaker_0': 'Just to ask the question for me.'",
        "'speaker_6': 'For a lady.'",
        "'speaker_12': 'How lucky. Yeah, sure. I had a question related to these two slots and the potential for a Christmas facility and whether that would have or is it in the discussion.'",
        "'speaker_13': 'So is airport director Brian indicated there is no relationship between the FISA process and the allocation of these supplemental slots. If an FISA facility ever did come to fruition, whatever flights flew in and out of the airport that used that type of facility would have to fly within our current noise budgets and within the current slot allocation'",
        "'speaker_13': '. So if there were 41 slots allocated or 45 slots allocated, an FISA would not increase the number of slots.'",
        "'speaker_0': 'Okay. Any other Councilman Austin?'",
        "'speaker_11': 'I do have one quick last question. And based on a question from one of the residents, and I think it was regarding the the methodology of the how noise is measured. I know how long have the has that system been in place and when was it last updated?'",
        "'speaker_8': 'We'll ask Mr. Reeves to respond to that, please.'",
        "'speaker_14': 'Yes counts when asked in the current system was installed as I recall in 2000 for 25. Prior to that, there was an older system installed. The system that we currently have is state of the art. We have type one microphones at each of the locations.'",
        "'speaker_14': 'These are the the most accurate microphones that we can have outside of a laboratory on an annual basis. We calibrate this system traceable to the National Institute of Standards and Technology. So we have a state of the art system.'",
        "'speaker_11': 'Thank you. So you're confident with the measurements that we are getting from from the existing noise measurement system?'",
        "'speaker_14': 'Yes, sir.'",
        "'speaker_11': 'So so the other question was regarding runway 25. Right. And I understood the question or somebody mentioned earlier that we're not measuring noise from from that runway. Is that correct?'",
        "'speaker_14': 'We do measure noise at all of our runways, including runway 25. Right. However, the noise ordinance does not specify budget limits. 4 to 5, right. Because the runway is used very infrequently.'",
        "'speaker_11': 'So can you explain to us why that particular runway is used so infrequently? I mean, we have a runway, and as I've studied and looked into to five. Right. It is is longer than John Wayne Airport's one runway and several others large airports across the country.'",
        "'speaker_11': 'It's a it's a it's a runway that could be utilized that could, I should say, fairly distribute noise from the airport. Why don't we use that runway more often?'",
        "'speaker_14': 'Yes, Councilman, that's that's an excellent question. The ordinance does not explicitly state. That runway to five, right. Should not be used. However, runway 1230 is designed as our primary air carrier runway. It is the only runway that has noise, budget limits, cumulative noise, budget limits associated with it.'",
        "'speaker_14': 'The other runways do not have cumulative noise budget. Runway 1230 is also built out to specifications designed for routine air carrier use in terms of pavement, strength, instrumentation, instrument, landing system, etc., the other runways. That's that's not true for they're designed for infrequent use.'",
        "'speaker_14': 'Runway 25, right. For example. On a standby basis when runway one two, three zero is is not available.'",
        "'speaker_11': 'So the brand new runway two five. Right. That we have is not equipped to deal with frequent flights.'",
        "'speaker_14': 'It is not the pavement strengthening instrumentation. The runway was not designed. For routine use. And the noise ordinance essentially designates runway 12330 as the primary air carrier runway.'",
        "'speaker_11': 'All right. Thank you. We'll revisit that. Thank you.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_10': 'Our Tribal Council member, Austin. Got my questions. Thank you.'",
        "'speaker_0': 'Councilmember Supernanny.'",
        "'speaker_8': 'If I could just follow up on one final question. The one that John Dilatory brought up regarding the legal issue of must versus May, I think. I don't think you can answer that unless you try to quantify it in some way.'",
        "'speaker_8': 'Would staff be able to say, I think the quantification or qualification might be in terms of by not adding these flights? What is the threat to the noise ordinance? And to put that in context, how would that threaten the noise earnings versus building an FAA facility in the threat to noise ordinance?'",
        "'speaker_8': 'Would you would you have outside legal opinions on that?'",
        "'speaker_13': 'We do have outside legal opinions as to whether or not the ordinance is mandatory and the outside legal opinion is clearly that it is mandatory, which coincides with the opinion that has been developed over not just the city attorney, but all of the city attorneys that have been dealing with this since 1995.'",
        "'speaker_13': 'We've tried to put together historical documentation as to this ordinance when this settlement agreement was reached after the. Litigation in 1995, the press release that was put out by then, Beverly O'Neal specifically mentioned that 41 was a minimum and that over time more flights would be added.'",
        "'speaker_13': 'We have no doubt that this is a mandatory requirement there. As I indicated, I hope I'm answering this question correctly about the fees, but there really is no relationship between adding these slots and the request by JetBlue to consider an office facility.'",
        "'speaker_13': 'If an FAA facility were ever built. All of the planes that would use that facility would clearly have to comply with our noise ordinance. They would have to comply with the curfew regulations that we currently have in place.'",
        "'speaker_13': 'We would not increase the number of flights based solely on an office facility or a number of slots based solely on a nearby facility. Oh, and I'm sorry if you're asking, is the FISA mandatory like the ordinance? Was that part of your question?'",
        "'speaker_13': 'The answer is no.'",
        "'speaker_8': 'Okay. So you have outside an outside legal opinion that this is mandatory.'",
        "'speaker_13': 'Correct.'",
        "'speaker_8': 'There's been conjecture that the FISA facility would be of a threat to I noise ordinance building it potentially. And I realize that's an opinion now. But I'm saying we have an absolute versus an opinion. I think that's I was just trying to frame Mr. General Corey's question a little bit.'",
        "'speaker_8': 'I think you've answered it. Thank you.'",
        "'speaker_0': 'Thank you. And just just to conclude, I do. This is a this is a big issue. And I actually just need to thank both our city attorney, Mr. Parkin, Mr. Mays and the airport team, because they've actually worked just in the last month or so on.'",
        "'speaker_0': 'This issue is really consumed. I know, particularly Mr. Mays, who has been all over the place trying to get this thing together. And so I just want to thank you guys for the professionalism and for the information you've been getting to council.'",
        "'speaker_0': 'I know you've been responding to a lot of questions from council members and the community. And like Councilman Superhot said, you know, showing up at Sunday morning, early meetings and whatever you can to get everyone informed. So everyone appreciates that.'",
        "'speaker_0': 'And thank you all for for that. That concludes the study session. As you know, it's not an actionable agenda item. So what we're going to do now is we're going to transition back to the council where we're certainly behind tonight, as probably be expected.'",
        "'speaker_0': 'So we're transitioning back to the council meeting we have. We moved one item to the head of the agenda earlier, which was the El Nino presentation. So that will happen. And immediately after that, we'll go into the hearing on medical marijuana and that ordinance.'",
        "'speaker_0': 'And so why don't we go into why don't we do this? Why don't we do? The El Nino hearing was like a short it's just a short recess and then we'll go into the into the hearing.'",
        "'speaker_8': 'I'm fine with that. It's my item.'",
        "'speaker_5': 'Because Pat said that he wanted us.'",
        "'speaker_2': 'This to me, like we're going to rush it.'",
        "'speaker_1': 'Well.'",
        "'speaker_6': 'I'm going to defer to you because you really like this app information getting out there. Okay. We can be.'",
        "'speaker_1': 'Let let me.'",
        "'speaker_0': 'I know. Hold on 1/2. Mr. West, can you come here for just 1/2?'",
        "'speaker_5': 'You did?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_8': 'We were on TV and everything this morning, so.'",
        "'speaker_3': 'Oh.'",
        "'speaker_1': 'Infamous. It is 7 minutes. It's.'",
        "'speaker_0': 'Okay. We're going to go right into the to this presentation, Madam Clerk, if you can read the item.'"
    ],
    "Emergency and Environmental Preparedness for EI Nino Weather Conditions.": [
        "'speaker_10': 'Communication from Councilmember Supernova Vice Mayor Lowenthal, Councilwoman Price Council Member Richardson. Recommendation to request the city manager to provide an update on the city's emergency and environmental preparedness for the anticipated upcoming El Nino weather conditions.'",
        "'speaker_2': 'Councilmember Soprano.'",
        "'speaker_8': 'Okay. Thank you, Madam Vice Mayor. Um. We had a president today, and I start off by saying this is how government is supposed to work. It's kind of a civics lesson. It starts with residents contacting their councilman with concerns over El Nino or predictions of an El Nino season coming forward.'",
        "'speaker_8': 'And these concerns were legit. Many fourth District residents remember the flooding of 1995, and nearly all of them remember the flooding of January 19th, 2010 along the Atherton, Carter and Termino corridor. And they really.'",
        "'speaker_6': 'Didn't put it together that.'",
        "'speaker_8': 'We did $25 million worth of infrastructure improvements since that time. But, you know, the average resident doesn't remember the context. So what we did is we held a community meeting and I invited Reggie Harrison to come out and speak to our community group.'",
        "'speaker_8': 'And that went so well that I decided to agenda is that for a committee meeting, I happened to chair the Environmental Committee, and since El Nino is an environmental issue, we brought it forward to the Environmental Committee and Mr. Harrison enhanced his presentation and ended it there.'",
        "'speaker_8': 'That brings us to where we are here tonight. And this is a presentation of our El Nino preparedness for the entire city council. So with that, I'd like to introduce Mr. Reggie Harrison, our Director of Disaster Preparedness and Emergency Communications.'",
        "'speaker_11': 'Thank you, Councilmember. Thank you, Mayor and Council members, for this opportunity to provide an update on the city's response and recovery plans for preparations for the El Nino winter storms. The city of Long Beach has staff and all of US departments take seriously the predictions of El Nino induced heavy rains, high tides and rip currents.'",
        "'speaker_11': 'This winter, we urge all residents to also take these predictions seriously. Typically, Long Beach receives about 12 to 15 inches of rain annually. Predictions for this winter are that we will receive 20 to 30 inches almost double the amount of rainfall that we receive in an average year.'",
        "'speaker_11': 'Flooding is predicted as storms are expected to occur in succession, causing the grounds to saturate. However, even as we receive this amount of rain, it is not expected to impact the four year drought that we are experiencing.'",
        "'speaker_1': 'This.'",
        "'speaker_11': 'So the El Nino refers to a warming of the Pacific Ocean off the coast of South America. The warm waters release heat, changing the wind and jet stream, which often brings more and wetter storms. And so we don't typically see this kind of wetter weather pattern in southern California and hence the El Nino and hence the expectations'",
        "'speaker_11': 'are predictions of extreme weather conditions this winter. From a citywide perspective, all three departments are actively engaged in Winter Stones preparations. Earlier this year, we formed a winter storm response team tasked with reviewing storm response and recovery procedures.'",
        "'speaker_11': 'Training staff on emergency protocols and developing new tools for communicating with the public and the media. Departments have updated contracts for emergency equipment and material procurement. All departments are in the final stages of inspecting critical systems and infrastructure and making repairs where needed.'",
        "'speaker_11': 'We are documenting current building conditions to provide a comparison basis for insurance or FEMA claims for reimbursement. Preparation from a regional perspective include collaborating with Avalon, Signal Hill and Los Angeles County on response and recovery plans. We are coordinating and sharing our response and recovery plans with our community partner organizations, including the American Red Cross, local hospitals'",
        "'speaker_11': ', school districts, lobbies, transit and utility companies. In fact, we meet tomorrow with this group over our emergency operations center to share our updated plans and to hear their plans so that we can analyze any gaps and ensure that there is a seamless response.'",
        "'speaker_11': 'We've also upgraded the monitoring capabilities of the Emergency Operations Center to ensure we are in the best position possible to respond to support first responders and the public. Today, we are extremely happy to launch the city's new emergency notification system alert.'",
        "'speaker_11': 'Long Beach Alert Long Beach as a free emergency notification system designed to keep those who live or work in Long Beach informed of important information before, during and after a major disaster or emergency alert, Long Beach provides an opportunity for red for residents to register their cell phone, email address, text message information to ensure that they receive'",
        "'speaker_11': 'emergency alerts. We currently have the ability to provide alerts via landline through 911 carriers. However, we recognize that most people do not work at home and others no longer have a landline. So this so this produces additional opportunities for our residents, for our businesses, for our hospitals, for our school districts to be able to receive alerts from'",
        "'speaker_11': 'us during emergencies. Alerts will be sent to registrants to inform them of what has happened, what first responders are doing, and what action should be taken to protect themselves and put and protect property. And I cannot emphasize enough the importance of residents signing up or opting in for this service.'",
        "'speaker_11': 'Otherwise it will not be available and residents will not have received this benefit. The next few slides. Council members is a summary, including this slide is a summary of an incredible amount of work that all departments have put into place over this over the numerous months leading up to this point.'",
        "'speaker_11': 'This is a high level summary. Earlier this year, you got a more in-depth report from the city manager on all of the activities. So I just want to stress that this is just this is just the top of a huge iceberg in terms of the amount of work that is going in by all city departments here before'",
        "'speaker_11': 'use a slide representing just a highlights from the public works department to inspect 50 and clean 5300 catch basins and and test 28 pump stations throughout the city. They have arranged for sand and sandbags to be made available at various fire stations across the city.'",
        "'speaker_11': 'And they manage the seawall plugs, as you have noticed, during the numerous high tides that we have been expecting, that we have been experiencing recently. And they are, of course, inspecting and repairing city facilities as necessary. Same can be said for power, for parks, recreation and Marines.'",
        "'speaker_11': 'They maintain the berms along the peninsula. These berms are built to specific specification engineering specifications to ensure protection of the peninsula area. They will deploy the debris, broom booms. They're inspecting and removing dead trees and structures. And they have also put into place information protocols to alert level boards, the Marine and commercial operators there in the marinas'",
        "'speaker_11': '. Fire. Marine safety staff are training and preparing for swift water rescues. They're also training urban search and rescue teams and preparing our search teams for activation. The police department are generally the first to know of an incident as it occurs that in our streets their helicopters are made available to provide valuable information and visuals of dangerous situations'",
        "'speaker_11': '. They also work with search and rescue teams to provide support and response activities or resources. My Health and Human Services Department plays a critical role role, rather, in providing outreach to the homeless populations. And this year, we open our homeless winter shelter earlier in anticipation of this rainy season.'",
        "'speaker_11': 'And they play a critical role in operating that facility, as well as providing and issuing water quality advisories as rain falls impacting our beaches and waterfront. So in closing, we residents have urged to prepare now for the rains.'",
        "'speaker_11': 'We recommend that residents follow weather forecasts and local media and social media that they clean out rain gutters and drains their residents, remove items from their property that could prevent water runoff. That they repair leaks in roofs and windows.'",
        "'speaker_11': 'We urge residents not to drive or walk through flowing waters and to call 9114 downed power lines. And that's just a few of the many tips that residents can find on our on our websites and through printed materials that we have provided for residents.'",
        "'speaker_11': 'And you have a copy of the PowerPoint there, along with some informational materials, both on El Nino preparations and recommendations, as well as information on the alert Long Beach system. And so in conclusion, staff is working collectively with our community partners to be ready for the heavy rains that we're expecting this winter.'",
        "'speaker_11': 'Thank you for this opportunity. And I, along with other staff members here, are prepared to answer any questions you might have.'",
        "'speaker_0': 'Make any public comment on this item. Seeing none. Let me turn this over to Vice Mayor Lowenthal. No. Go ahead.'",
        "'speaker_4': 'Surely you saw it. I'm speaking right now as senior consultant of Swarm Group and Associates particularly. My interest is with the homeless population, many of whom. May not be able to get to that shelter if it's open in North Long Beach.'",
        "'speaker_4': 'Similarly, they may not be able to get from behind the buildings where they are sleeping. The restaurants, the banks. I mentioned earlier that I observed one entity that was servicing the nonprofit, picking up donuts at one of their vendors while passing by a homeless person and leaving them sitting in the same place where they found them while'",
        "'speaker_4': 'picking up donuts, taking donuts to their facility. Now, with respect to what you just said, and I don't know your name, so I'm address this to counsel. Who are representative of each homeless person in your district. You are their councilperson.'",
        "'speaker_4': 'You are their mayor. You are their city attorney. You are their city manager. Must more must be done in order to service the people who are homeless, who cannot get to the facilities that are open now. That opened up in November and will close in March.'",
        "'speaker_4': 'But they're going to be homeless eight months later because the permanent housing to facilitate the growing number of homeless people have not been facilitated has not been added. It may seem redundant. But if I am the only one consistently coming, arguing and complaining before council and your numbers are growing, then that may infer that enough is not'",
        "'speaker_4': 'being done yet. And still. And while we would like to say that the villages up Cabrillo have helped the veterans this year. So you've helped a smaller segment of those who are homeless. The thousands of homeless in this city who are not veterans are not being service yet still.'",
        "'speaker_4': 'So somebody God has to provide some opportunity for those who need it here. He has to provide a voice for them. Hence I said yes to that assignment and not knowing when I left my position with the federal government that I would be doing this assignment next.'",
        "'speaker_4': 'But I am here. I will be submitting a proposal not I'm not looking for a job in the city. I'm just submitting a proposal to you. And I will make sure that each of you have a copy, along with the city manager of what what needs to be done to augment the services.'",
        "'speaker_4': 'It's not that you're not doing anything, but we're now discussing tonight raising a protocol for for the airport. We've discussed the multi million dollar structure of development over on busy. All I'm saying is we need to augment those services for the homeless.'",
        "'speaker_0': 'Thank you very much. Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I just wanted to appreciate Councilmember Supernova's attention to this important issue, especially as it impacts coastal communities in Long Beach. I know that it came out of his environmental committee, but he is aware of its impacts to all nine districts.'",
        "'speaker_2': 'And I want to appreciate staff's presentation as well and attention to it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_10': 'I want to take a moment to thank the firefighters. Several weeks ago, I chose not knowing that we would be able to afford to give out sandbags to personally with my neighbors and friends bag 500 sandbags purchased from some of them from Home Depot at $0.34 each with sand and the back laboring, no technology available.'",
        "'speaker_10': 'There's no stands to hold sandbags. You literally are bent over for hours on end, shoveling sand into a tiny opening. And I just want to appreciate the hundreds of bags you're about to bag for the residents of Long Beach.'",
        "'speaker_10': 'I want to thank the neighbors who lined up around the block to come to my house. Personally, from neighbor to neighbor and all the community getting together and bagging those first 500 sandbags. So many of us have sliding glass doors and other flood risks.'",
        "'speaker_10': 'I just want to remind everyone of the opportunity to get flood insurance. It takes 30 days to get it enacted. So if you're thinking about it, the major gust of the storm is late January and early February. So you'd need to do that right now.'",
        "'speaker_10': 'But just a big thank you to the neighbors who pitched in. Hours and hours. It took us three weekends to bag that many sandbags. And to the firefighters who are about to bag those sand through those bags of sand for you, please say thank you.'",
        "'speaker_10': 'It's hard work.'",
        "'speaker_0': 'Councilman Andrews?'",
        "'speaker_7': 'Yes, thank you. Also, I'd like to thank Councilman Supernova for bringing this item forward because, you know, I want to thank the city director, you know, disaster and preparedness, emergency communication. Mr. HARRIS Well, you know, being on top of this situation and continuing the effort to prepare in my city for El Nino, it's coming.'",
        "'speaker_7': 'When? I don't know.'",
        "'speaker_0': 'Councilwoman Gonzales.'",
        "'speaker_5': 'I just want to say thank you to Councilmember Supernova for bringing this forward. It's certainly very important, especially as our one of our speakers had mentioned, about the homeless. I know especially along the river, I now see them, the encampments now moving almost as if they're getting prepared themselves to pay for this.'",
        "'speaker_5': 'But maybe I missed this. But, Reggie, do is is there some sort of notice that they'll be given as well? I mean, I see a lot of individuals camped out along the freeway, but it's not on the top side as there usually are.'",
        "'speaker_5': 'It's along the freeway. But I, I don't know what the differences, but are they being noticed and how is that working out?'",
        "'speaker_11': 'Yeah, I'm going to start this and I see Kelly is here. She can jump in, but on a regular basis, we have an outreach team that goes out into those areas where we have homeless encampments, the non homeless encampments, as well as going out to to look for other areas where we suspect homeless might be in on'",
        "'speaker_11': 'a regular basis. They provide them with information in terms of what's happening with the winter season, the weather, as well as the opportunity to take advantage of the winter shelter.'",
        "'speaker_5': 'Okay, great. Thank you very much and great report.'",
        "'speaker_0': 'Councilman Turanga.'",
        "'speaker_6': 'Take you there.'",
        "'speaker_12': 'And I also want to help excuse me to take control of Superman for bringing this to the council. Attention being a coastal city, we are faced with a lot of other different types of challenges that other cities don't face.'",
        "'speaker_12': 'Basically, we have looking at sea level rise and we're looking at the need for our coastal communities to protect themselves. But I also want to point out that we do have CERT teams out there, community, community emergency response teams that are out there, there.'",
        "'speaker_12': 'They're I'm sure that the fire department's on top of it, getting these teams together, getting them trained, getting them. And this is area equipment to be able to respond to any emergency that may arise in any of the neighborhoods where these or these teams are in place.'",
        "'speaker_12': 'So looking forward to, again, working with the fire department, the police department, to ensure that our communities remain safe. And also what well, thank you.'",
        "'speaker_6': 'To.'",
        "'speaker_12': 'You've got a frog of a to to congratulate the staff. I'm bringing up this alert Long Beach application. It's I hope it's going to be a great tool not only for this event, but for future events as well.'",
        "'speaker_0': 'We go on to Council on Supernova.'",
        "'speaker_8': 'Thank you, Eric. You know, I just want to address one of the public comments here tonight. I'm particularly proud and thankful of all the homeless resources in our fourth district. We've made tremendous strides, I think, of the public meetings we've had with health department personnel.'",
        "'speaker_8': 'Susan Price spoke at our community meetings. Theresa Chandler. Shannon Parker. We formed a fourth District Task Force on Homelessness. We've made and I should mention, our police partners to Claudia. Officer Claudia Lopez. Now, Detective Lopez, what a tremendous job she did with us.'",
        "'speaker_8': 'So I'd just like to say thank you to all the entities that have helped us, and we just made incredible progress on homeless issues. Also, Elsa Ramos from the Multi-Service Center spoke at our press event this morning, and I think she mentioned L.A. County does sweeps of the river areas, too, so they assist us there.'",
        "'speaker_8': 'So we have a lot of features here to assist the homeless during the El Nino season. And the other thing I just want to put out there to the public, look at the debris, look at the trash, that type of thing that we might ignore on a normal basis.'",
        "'speaker_8': 'And again, at this morning's event, Mayor Garcia reminded us of a of a storm event where there was a clog. And, Mayor, if you'd like to carry on that story, I didn't recall it till you said it.'",
        "'speaker_0': 'Is that because we're not you know, some folks will leave a mattress in their alley or trash and debris that they shouldn't be leaving. What happened is the mattress flew in in the water, went right into the storm drain, clogged the drain and flooded the entire neighborhood.'",
        "'speaker_0': 'And so those are the kind of things we have to avoid during the storm, is please make sure that we clear debris and alleys and that folks, well, they shouldn't be leaving mattresses in the alley anyways. But we got to be more vigilant about those kinds of issues.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_9': 'Thank you, Mayor. Thank you, Councilmember. Super now for leading the effort on behalf of the Council on educating the community on this effort. And thank you to Mr. Harrison and City, all the departments who have contributed to this this preparedness strategy.'",
        "'speaker_9': 'My only question is, what are we doing? Have we figured? I know that we're under construction on the North Neighborhood Library. I don't know what else. We're in the construction on another the forest wetlands and those things. How have we factored in El Nino into those construction timelines?'",
        "'speaker_7': 'That's something that we definitely look at. I don't think we know for sure exactly how many days it's going to be rain, but we definitely look at the during the weather months and try to calculate that. But if if you'd like a more specific answer for a specific project, we can certainly look into that.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. With that, I'm going to wrap this up. I just want to re remind everyone. Councilman Supernanny, I had did an event earlier with with Mr. Harrison and the emergency preparedness team. And just to remind people to sign up for alert Long Beach you can access alert Long Beach from Long Beach dot gov, which is the'",
        "'speaker_0': 'homepage of the website. I signed up for it today. It just takes a couple of minutes. It's very easy and that will alert you in case of an emergency right to your cell phone or email. We already have a capacity to call landlines directly, but we don't have a capacity to text you if you want to receive'",
        "'speaker_0': 'an emergency tax in case of a power outage, a flood, all these issues that could happen. And so I would encourage everyone to please go on to lobby sa gov. Sign up for alert Long Beach and you will.'",
        "'speaker_0': 'It only will be used for emergency scenarios. So you know, you ain't going to be receiving a, you know, there's a fare this weekend or anything like that. It's, it's strictly emergency issues because that would be really annoying.'",
        "'speaker_0': 'They're not that either. So so please sign up. And again, thanks to Councilman Super now for leading efforts on this. With that, there's a motion and a second. Please cast your votes. We already did public comment.'",
        "'speaker_10': 'Councilman Austin. Motion carries.'",
        "'speaker_0': 'Okay. So like I mentioned before, we're going to take a quick just recess so people can go take a restroom break. And then when we come back from the recess, we'll go into our rest of the agenda.'",
        "'speaker_6': 'There's a lot of.'",
        "'speaker_1': 'Next.'",
        "'speaker_8': 'I.'",
        "'speaker_0': 'Okay. We're going to get started. So if I can have the council back here. Martin. Martin.'",
        "'speaker_1': 'And you know. So you guys.'",
        "'speaker_0': 'Good. Okay. Can I get the council back here? If I can. Everyone else, quiet down. We're going to get started.'",
        "'speaker_7': 'Okay.'",
        "'speaker_0': 'Okay. We can gather all copies.'",
        "'speaker_10': 'Councilwoman Gonzalez. Vice Mayor Lowenthal. Councilwoman Price Council member Superman. Councilwoman. Mango. Councilman Andrews. Councilmember Muranga. Councilman Austin. Councilmember Richardson. Mayor Garcia.'",
        "'speaker_0': 'Thank you. If we can just plead with read the item, which I believe is a. What's that. I don't know the number, but it's the.'"
    ],
    "WITHDRAWN Ordinance on Medical Marijuana Regulations and Repeal of Chapter 5.89.": [
        "'speaker_10': 'Communication from city attorney recommendation to receive supporting documentation and to the record conclude the hearing and declare ordinance amending the Long Beach Municipal Code all relating to medical marijuana. Read the first time and lead over for the next regular meeting of the City Council for Final Reading City Wide.'",
        "'speaker_0': 'Mr. Mays.'",
        "'speaker_13': 'Thank you, Mayor Garcia, and members of the city council. As you remember, we were all here discussing medical marijuana on September 22nd of this year. At that time, the city council requested that the city attorney present a draft medical marijuana ordinance that would be consistent with the newly enacted state legislation, which is known as Mercer, the Medical'",
        "'speaker_13': 'Marijuana Regulation and Safety Act. The ordinance that you requested also wanted provisions for up to nine dispensaries in the city located in all zones, except those zones zoned exclusively for residential use and subject to buffers of 1500 feet from a public or private high school.'",
        "'speaker_13': '1000 feet from a public or private kindergarten, elementary school, middle or junior school, junior high school, 1000 feet from a public park, 1000 feet from a state licensed child care facility. Only those located on commercial corridors 1000 feet from a location identified by the police department to be a human trafficking high cut crime corridor 1000 feet from'",
        "'speaker_13': 'a public library and 1000 feet from another medical marijuana business. The ordinance that you requested that we bring back also called for allowing cultivation in a city subject to a CFP. Although cultivation would not be a requirement as was required in the previous regulatory ordinance we had in place.'",
        "'speaker_13': 'The ordinance was to permit delivery services in the city, but only by those licensed medical marijuana dispensaries that also have a copy in the city, a requirement that for each dispensary that opens in the city they agree to have in place by the time they open a labor peace agreement.'",
        "'speaker_13': 'And the ordinance that we presented for your consideration today does have all of the items that you requested. And in addition to that, I won't go through all of them because I'm sure there'll be a lot of questions.'",
        "'speaker_13': 'The ordinance contains a number of operational requirements, such as hours of operation testing requirements, very detailed requirements regards in regards to record keeping to ensure that the city's tax interests are maintained. Requirements for the size of the various operations 2000 square feet maximum for a retail dispensary site, 5000 square feet for a cultivation site.'",
        "'speaker_13': 'And in order to attract the best possible operators, the ordinance has a feature that actually has been in there for quite some time where that we have called a priority point system. So when an application process is opened, it would give the Department of Development Services, together with their partner departments, the ability to go through the applications'",
        "'speaker_13': 'and on an objective basis, award points to the various applicants. The thought being that those applicants, with the higher number of points, which we believe would represent the best operators in the city, would move forward until the nine super slots are filled.'",
        "'speaker_13': 'And before I turn it over to Jeff Winkle, I I'd like to acknowledge Tina parmelee from our Tech Services Department, who did an amazing job putting together the maps that were provided to you late last week in which Jeff is going to talk about.'",
        "'speaker_13': 'It's much more difficult to put together those maps with all the buffers and trying to locate all of the various facilities that are within those buffers. And we had her do many, many iterations of those maps. I know that they are not necessarily perfect.'",
        "'speaker_13': 'Sometimes, for instance, with a charter school, we may not have it in our system. If this ordinance were to pass tonight, we would continually evaluate those maps to make sure we have all of the facilities that should be on those maps on them.'",
        "'speaker_13': 'So with that, I'll turn it over to Jeff Winkle pluck to walk you through the maps.'",
        "'speaker_6': 'Thank you, honorable mayor and City Council. As Mike indicated, the maps have been revised according to the council directions. All of the buffers have been maintained, including a 1500 foot buffer for high schools and 1000 foot foot buffers for elementary middle schools, parks, libraries and childcare operations on commercial corridors.'",
        "'speaker_6': 'Human trafficking corridors have also been buffer out. These areas were identified with the assistance of the police department based on crime data related to specific offenses. As directed, the maps had also been revised to include all industrial, commercial, institutional and planned development zones that are not solely residential as eligible areas for medical marijuana operations.'",
        "'speaker_6': 'The maps that were provided were provided at two levels. One was a citywide level, and that showed all of the all of the buffers. We also provided a. Maps at district levels would show the all of the eligible areas.'",
        "'speaker_6': 'So basically we took all the buffers. Took those off. And what we have left are only the eligible areas within each of the districts. Also, as Mike indicated, it was brought to our attention today that there were a couple of accredited non school district charter schools that were not included in the maps.'",
        "'speaker_6': 'These included 400 East Willow, Willow Street, 6596, Long Beach Boulevard, 608 Cherry Avenue, 508 East and 508 East Anaheim as well as a charter school in the 3900 block of Atlantic. All of those were included in the maps were revised and those revised maps were passed out to you prior to this meeting.'",
        "'speaker_6': 'So that is essentially it. With regards to the update on the maps, I will be happy to answer your questions. Otherwise, I will turn it back over to Mr. Mays to highlight any additional information.'",
        "'speaker_13': 'We also stand ready to answer any of your questions regarding the ordinance.'",
        "'speaker_0': 'Eight. Thank you. Five. Summary Law Enforcement.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I want to thank staff for their presentation. I would like to go ahead and. Accept the recommendation as presented with a couple of amendments, and I'll preface my amendment with a recollection on the childcare facilities that we had a discussion about that and we asked staff to bring back maps which are included'",
        "'speaker_2': 'of what that buffer would look like along the commercial corridors. And but it was not my recollection that all child care facilities that that was accepted as an amendment. So with that. Bearing that in mind, I'd like to make a recommendation, a modified motion that one ensures that we have one dispensary per district.'",
        "'speaker_2': 'I know that according to the staff recommendation, it not the staff recommendation, the staff summary of the ordinance. It was mentioned that it's nine dispensaries in the city. There is confusion about whether this would include other uses. And I want to be clear that the council, the prevailing council intent was to ensure that there were nine dispensaries'",
        "'speaker_2': 'throughout the city and one per district. So I'd like to be sure that that's included in this motion. And also to remove licensed child care facilities on commercial corridors as a buffer due to the nature of operations being mostly interior and children accompanied by their parents.'",
        "'speaker_2': 'And so those are the two items I would like to add to the recommendation. And with that, I hope to have a second.'",
        "'speaker_0': 'Okay. There's a motion in a second and just from a process point of view. Mr. MAYS. So I know you have a you have an ordinance presented to the Council as the motion is made by Vice President or any other motion before us today, that would require a first reading of any of any ordinance at a future'",
        "'speaker_0': 'date. Is that correct?'",
        "'speaker_13': 'Correct. We'd have to revise it and bring it back as a first reading.'",
        "'speaker_0': 'Okay. So there's a motion on the floor and I don't see the second on the motion, but I heard someone say it and someone plug in. Okay. There's the motion and a second councilmember during. I do want to speak to your second.'",
        "'speaker_12': 'I agree with Councilmember Lawton in her analysis of the amendments that she has to the current resolution.'",
        "'speaker_0': 'Councilman Anderson.'",
        "'speaker_7': 'Yes, I also approve with that. But there are some, you know.'",
        "'speaker_6': 'Additional things that I would like to do. And possibly there's a friendly I.'",
        "'speaker_7': 'Would like to also ask.'",
        "'speaker_6': 'For in the pursuance of the task force approved recommendation number one, I think all.'",
        "'speaker_7': 'Medical marijuana businesses should be.'",
        "'speaker_6': 'Distributed equally throughout the city with.'",
        "'speaker_7': 'At least two medical marijuana businesses.'",
        "'speaker_6': 'Per district. I do not think that we could have the support on that council for the council for this. But I would like to make sure.'",
        "'speaker_7': 'That those districts that can accommodate more should be allowed to make that.'",
        "'speaker_6': 'Happen. I have one friendly amendment that I would like to make, and in addition, I think that the relationship matters. And pursuant to the task force approved recommendations, six and seven to a lot, 2.2 individuals who successfully completed the L.B. M.S. 5.87 lottery, and two additional points to individuals who continue to purchase their original medical marijuana and'",
        "'speaker_6': 'oppose the original medical marijuana business location or equivalent amount of points. And I would like to offer that as a friendly amendment.'",
        "'speaker_2': 'Councilman Andrews. Actually, let me ask the city attorney, what is the point system right now for those who were in that process?'",
        "'speaker_13': 'So the way the port system is set up now, if you were a successful winner of the 2010 lottery, you got one extra point. And as we caution the medical marijuana task force in the planning commission, if we get into a situation where we allocate too many points to the previous winners of the lottery, and it has'",
        "'speaker_13': 'the effect of basically excluding other entrants from participating because most of the applicants that apply should be able to meet. Hopefully all of the criteria of the 20 point system. Then we are surely inviting litigation by those that are not able to participate.'",
        "'speaker_1': 'You know.'",
        "'speaker_2': 'So it's a maximum of 20 points. And I think. Councilman. Andrews is looking for a total of two points. So that's one extra point.'",
        "'speaker_6': 'Yes.'",
        "'speaker_2': 'Okay. I'm open to considering that. I'd like to hear from other council colleagues. As long as we're talking about one extra point. So it's a total of two as opposed to the one that's written in the ordinance. Out of 20, correct.'",
        "'speaker_13': 'But there was another part, as I understood the second friendly amendment, it was to add two points. So concerning if they have the same business location or something. Yes.'",
        "'speaker_7': 'Original medical marijuana business located according to the Monroe Point.'",
        "'speaker_2': 'So I think that would be a. A significant barrier to entry and. But the one point.'",
        "'speaker_6': 'Okay.'",
        "'speaker_2': 'Would be okay. Okay. Thank you.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_5': 'Thank you. I have a few questions for staff as well as our police chief. So, Chief Luna, if it's possible, I'd like to ask you a few questions as we go through. The evening. So I think all of us are in receipt of staff's fiscal impact report that was issued to us earlier this week, actually on Friday'",
        "'speaker_5': '. And it's my understanding, based on the memorandum that was provided, that the analysis that was performed was based on the proposed ordinance that the city attorney's office has prepared for tonight, meaning nine dispensary storefront locations. Is that accurate?'",
        "'speaker_7': 'Yes, that's correct.'",
        "'speaker_5': 'And my understanding from reading it is that staff projects that the tax revenue that the city will receive at the 10% tax rate would yield a revenue of $3 million for the city of Long Beach. And our enforcement costs for these operations had previously been expected to be $5 million.'",
        "'speaker_5': 'And my accurate on that.'",
        "'speaker_7': 'Yes, we had previously estimated that departments when we asked them what would your needs be estimated that at approximately $5 million. The amount, I believe, of 3 million also includes sales tax and regulatory fees in addition to the 10% gross receipts tax.'",
        "'speaker_5': 'Okay. So just so I'm clear, our expectation as a city is that we would tax and charge fees and bring in $3 million. And our departments had indicated to us that it would cost $5 million to actually allow the operations.'",
        "'speaker_5': 'And then we went back and asked them to reduce their expected enforcement costs. Is that right?'",
        "'speaker_7': 'Yes, that's correct.'",
        "'speaker_5': 'And so they were able to bring their costs down to $3 million so that now it's a breakeven operation for the city.'",
        "'speaker_7': 'Yes. There would not be any permanent structural impact. If these estimates are correct. There would be a short term budget shortfall that would need to be covered with one time dollars, which we've identified a solution to. But then on an ongoing basis, there would not be a structural impact.'",
        "'speaker_7': 'We would manage the $3 million.'",
        "'speaker_5': 'And the one time funds that you're referring to, that's the $1.6 million, is that.'",
        "'speaker_7': 'Right? That's correct. There would be ramp up costs in FY16 that we estimated about $1.56 million.'",
        "'speaker_5': 'So instead of spending year on surplus, the 1.6 million that we expect would be year end surplus. And instead of spending that on infrastructure deferred maintenance for city buildings, we would be putting that towards startup costs for an industry that's going to yield us a break, even result and best case scenario.'",
        "'speaker_7': 'So yes, the funds would be identified from year end surplus in 15 and or in 16.'",
        "'speaker_5': 'I'm curious. Does that seem like a financially prudent decision to anyone? Okay. So in regards to that, how is it that the costs that the city estimated to be $5 million was reduced to $3 million? How did that happen?'",
        "'speaker_5': 'What did we change?'",
        "'speaker_7': 'So the city manager went through and took a look with the financial management department to see what the requests were. We took an approach to say, tell us what your what your needs would be. And then we essentially met with the departments and narrowed that list down to an approach.'",
        "'speaker_7': 'One of the ways that we achieved that approach was to change the regulatory approach that we will take, where in the past we had taken a very police centric model. That is, it requires a tremendous amount of police resources.'",
        "'speaker_7': 'This now is a model that is a team based model. It will be led by the city manager's office. There'll be a dedicated person in the city manager's office who then will assemble a team with development services and business license code enforcement.'",
        "'speaker_7': 'It'll have some police in order to in order to to allow for those inspections. But it essentially be a model where we pursue a business that is illegally operating and treat it as if it were a, you know, any business that does not have a business license or is allowed to operate.'",
        "'speaker_7': 'We would find we would aggressively go out and visit the business. But we're expecting that there would be a significant amount of times where we were not able to gain entry to the business, but then we would go through a lean process and find administrative citations in order to bring it into compliance.'",
        "'speaker_7': 'We do expect it will be a difficult procedure to do to do that enforcement, but it is definitely a cost savings over the model of a police focused model, which is also, you know, was was very impactful in terms of reduced services on available for other or really reduced officers available for other services.'",
        "'speaker_7': 'So in the memo, we identify that if we were to go through a different model, the council has the ability to do that. We can go back to a police model. There would be a cost of, I believe, $1.6 million to do so.'",
        "'speaker_5': 'And that would be basically money that we'd have to come up with out of our general fund because we wouldn't have tax revenue to cover that.'",
        "'speaker_7': 'That's correct.'",
        "'speaker_5': 'So in the past, when we had illegal businesses operating, we used more of a police centric approach to enforcement, is what I'm hearing you say.'",
        "'speaker_7': 'Yes. We also use those other those other departments. The city attorney was heavily involved in city prosecutor and business licensing code, and everyone had a role. But we did have a fairly large response from the police department as well.'",
        "'speaker_5': 'And whatever that level of response we had from the police department in the past was we are now proposing a reduced level of support from the police department to go after illegal operations in order to meet that $3 million break even point.'",
        "'speaker_7': 'That's correct.'",
        "'speaker_5': 'And so before when we had a robust police enforcement structure in place, how effective was that in getting the legal operations shut down?'",
        "'speaker_7': 'So for the specifics at at the turn of the police chief, but we we did have difficulty shutting down dispensaries in some cases that when when we're able to, you know, bring the full resources of the police department to bear, we would have some short term success.'",
        "'speaker_7': 'It would be pretty time intensive, but we would be able to serve search warrants and to go to the to the facility. Often it was the case we experienced that that same facility would open later. So it was challenging.'",
        "'speaker_7': 'You know, we have also had some success on the leans and citation side where we've been amassing those citations and in some cases that has led to compliance. In other cases, it did not lead to compliance because the value of the fines were lower than the, you know, the cost of doing business.'",
        "'speaker_5': 'So maybe if I could route my next question to Chief Luna. Chief Luna, do you believe that spending less money on police resources to enforce illegal operations is going to be more or less effective for the city of Long Beach?'",
        "'speaker_9': 'For clarification when we talk about illegal operations. Just to clarify your question, I'm talking about rogue locations, rogue dispensaries.'",
        "'speaker_6': 'And that's where primarily our.'",
        "'speaker_9': 'Challenge was last time with the rogue locations, which I can get into numbers on that. If we are as a police department to take enforcement action on rogue dispensaries, which I fully expect.'",
        "'speaker_6': 'To do that if this gets approved. The resources that we currently have.'",
        "'speaker_9': 'Are not enough.'",
        "'speaker_5': 'Can you tell tell us a little bit about what you mean by this term rogue dispensary.'",
        "'speaker_6': 'Basically rogue operations who run clandestine.'",
        "'speaker_9': 'Operations behind the city's back with our history. Unfortunately, the last time the council approved this, we had some dispensaries that were sanctioned. And then for every one dispensary that was sanctioned, we had approximately four or five that were unsanctioned or as I call rogue, which the police department had to apply an extensive amount of time, effort and'",
        "'speaker_9': 'resources to close down some of them multiple times. We estimate.'",
        "'speaker_7': 'That in each case.'",
        "'speaker_9': 'Of these rogue dispensaries, we spent at least approximately 40.'",
        "'speaker_6': 'Hours per.'",
        "'speaker_7': 'Rogue dispensary. And just to give you an idea.'",
        "'speaker_9': 'Between February of 2012 and November of 2014, the police department served 142 search warrants at rogue dispensaries. So if you start doing your math between approximately 40 hours and 142 search warrants, you're talking about 5680 hours that were diverted from our core mission in order to deal with these rogue dispensaries.'",
        "'speaker_5': 'And Chief Luna, when we talk about rogue dispensaries. Let's say we have a sanctioned medical marijuana dispensary with a mature. Responsible business partner. Will that prevent rogue dispensaries from establishing in the city of Long Beach just because. The sanctioned business is being run by a responsible operator.'",
        "'speaker_5': 'Do the two have any correlation whatsoever?'",
        "'speaker_6': 'Well, based on our own experience here in Long Beach and from our research in.'",
        "'speaker_9': 'The cities around us, what we're seeing is ratios of.'",
        "'speaker_6': 'About anywhere.'",
        "'speaker_9': 'Between 3 to 1, meaning three rogue dispensaries for every one that sanctioned up to seven rogue dispensaries for every one that sanctioned. I think that we're assuming, based on.'",
        "'speaker_7': 'Long Beach's.'",
        "'speaker_9': 'Experience, that we would experience a ratio of four rogue dispensaries for every one that this council approved.'",
        "'speaker_5': 'Chief Luna in terms of the police department's ability to perform its core function with the establishment of medical marijuana dispensaries in the city of Long Beach, impact the police department's ability to provide current services to the residents of the city.'",
        "'speaker_7': 'Yes, it would be.'",
        "'speaker_6': 'Absolutely.'",
        "'speaker_0': 'Guys, just real quick. Please. None of that. So we're having some council questions. So there's time for public comment after.'",
        "'speaker_9': 'Again, based on our experience. If we're talking of the example I gave you between that time period, 5600.'",
        "'speaker_6': 'Hours, over 56, eight, 50.'",
        "'speaker_9': '600 hours, work hours diverted from our core mission to deal with rogue dispensaries.'",
        "'speaker_5': 'And when we say our core mission, what kinds of crimes or investigations would that take away from.'",
        "'speaker_9': 'Our core mission? In the Long Beach Police Department is considered our patrol calls for service when we're responding to priority one, two and three calls for service. That also includes our investigative functions, both violent and property crime and quality of life issues.'",
        "'speaker_9': 'And it also includes homeland security or national security.'",
        "'speaker_6': 'Challenges that we face.'",
        "'speaker_5': 'And in recent times, I imagine that our police department has had to step up to. Reevaluate and enhance the security measures in terms of the services that it provides to the city with the resources that you have. And what I mean by that is, Chief Luna, you haven't received any extra amount of money in the last couple'",
        "'speaker_5': 'of months in order to better protect us in light of world events.'",
        "'speaker_9': 'Unfortunately, we have not.'",
        "'speaker_5': 'So when we seek the protection of our police department, we're doing that with the money that you've already been given from our budget, our existing budget.'",
        "'speaker_9': 'Yes. We do it with existing resources.'",
        "'speaker_5': 'I'm going to make a substitute. Well, actually, I'm going to make a substitute motion, but before I do. Chief, do you believe that in regards to the medical marijuana industry and the discussion we're having, what is the most problematic component of those operations in the mind of a police department executive?'",
        "'speaker_9': 'With the experience that our narcotics unit has had. I think everybody in this room understands the Compassionate Use Act and that we're trying to find a way to.'",
        "'speaker_6': 'Provide.'",
        "'speaker_7': 'Marijuana to people.'",
        "'speaker_9': 'Who may need it. But with our enforcement action that we've taken. Unfortunately, we see a lot of these businesses who are not being very honest up front, not only with the marijuana that they're selling, but the money that they're taking in.'",
        "'speaker_9': 'So it's it's been a challenge. And we challenge ourselves to make sure that we're thinking differently, that we're thinking compassionately. But when we come up with specific cases or videos of.'",
        "'speaker_6': 'People taking advantage of the system, it's it's pretty difficult to watch.'",
        "'speaker_5': 'Okay. I thank you very much, Chief. I. I. To share the concern for those who want access to the medication. I fear that creating storefront dispensaries at this time in the city of Long Beach is not a prudent move.'",
        "'speaker_5': 'I share that based on the data. The actual data that has been provided for anyone who's sitting in this room who is actually a resident of the city of Long Beach. It should cause us great concern that we are going to spend $1.6 million of one time surplus moneys that we could be using on infrastructure projects or'",
        "'speaker_5': 'deferred maintenance of our city buildings. Roofs that need to be replaced. Infrastructure projects that are. Desperately needing attention. To invest in an industry that is at the very best going to provide us a break even scenario with less effective enforcement of a business that we were not able to effectively enforce using more money in the past.'",
        "'speaker_5': 'To me, that makes no sense whatsoever. And I look out in the audience, I see lobbyists and I see a lot of business owners. And I just wonder if you are if this was your city, would you believe that that was a good financial decision to make?'",
        "'speaker_5': 'The thing that concerns me the most is the storefront locations and our police chief telling us that as a result of storefront locations, they are going to have less police resources to allocate to public safety issues that our residents are struggling with right now.'",
        "'speaker_5': 'We have property thefts, robberies, murders. West Long Beach has had so many gang related murders this past year. It's unbelievable. And we're going to take those resources and put them into a risk. And to me, that doesn't seem prudent.'",
        "'speaker_5': 'So what I'd like to do is offer a substitute motion that I think provides a compromise and really helps the people that it should help. And that's the patients. The patients. This is a substitute motion designed for patients, and I'll be curious to see who opposes it.'",
        "'speaker_5': 'Because I wonder if they're an actual patient or if they have a financial interest, which that's fine if you have a financial interest. But be honest about what your position is. The substitute motion allows for a phased in approach to medical marijuana.'",
        "'speaker_5': 'Under this motion, we will allow for businesses to establish with a home delivery service no onsite sales. Sales tax revenue will be collected from these four businesses that go through the process to get their license to operate in the city of Long Beach.'",
        "'speaker_5': 'This will allow patient access for those who need it most. Six months after the first business is operational, staff will report back with a comprehensive report to Council on the tax revenues collected. The fiscal impact to the city of Long Beach in terms of enforcement costs and any public safety issues during that time period.'",
        "'speaker_5': 'At that time, Council will consider whether or not we should add four storefront locations. To correspond to those for home delivery businesses at that time, we will have accurate data to be able to determine how many patients were servicing what the demand is and the number of storefront locations we think will be necessary to meet the demand'",
        "'speaker_5': '. We will at that point consider adding up to three additional storefronts for a total of seven citywide. That's my emotion.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Sorry. There is a motion. Councilman, if you can just plug in on the motion, please. The second think it was Councilman Austin. Thank you. There's a motion in a second. Councilman Austin that you first want to speak to the second.'",
        "'speaker_11': 'Well, I think Councilmember Price was very eloquent in laying out the reasons why this substitute motion has come forth. I don't want to rehash this. No pun intended. I don't want to rehash this this issue because we have debated this and talked ad nauseam as a council.'",
        "'speaker_11': 'My positions, I think, were clearly articulated in the last the last time we. We met, I expressed concerns with the storefront model. In my opinion, the brick and mortar model was something that is almost something in the past anyway, since we know that many in most of people are probably getting access through home delivery anyway.'",
        "'speaker_11': 'And so I think this is is a huge compromise, particularly coming from our third District Council member who has come a long way in in our viewpoint here. And so I want to commend her in that regard. I do.'",
        "'speaker_11': 'And I did in the last time we we discussed this, the last time it was before the council. I did favor a phased in approach. I think it's most responsible and it also helps our enforcement measures. I think it prevents the and I'm going to use another term here and coin another term.'",
        "'speaker_11': 'It prevents the pot squatting or rogue facilities from from opening up at the rate that they did before. And hopefully they don't do it at all because that actually undermines policy, that undermines progress on this issue. And so I favor the the phase in model a report back after six months a responsible approach to implementing policy that'",
        "'speaker_11': 'would allow us to monitor this and build on it as necessary and as needed. I think it also puts us in line and establishes us for for for the for the future. And we know that this is a ever evolving issue.'",
        "'speaker_11': 'There's there's movement on this every day. I did have a question regarding cultivation because I was recently at a conference with a number of city officials, and the issue of cultivation came up. And as I understand, Mr. City Attorney, do we have to take action on this?'",
        "'speaker_11': 'Is this a time specific issue? We have to take action on cultivation before a certain date. Can you explain that?'",
        "'speaker_13': 'That's actually a very good question. Under the new state law, there is a provision in there that we have heard talk may be repealed but has not yet been repealed. That indicates if a city does not take some regulatory action on cultivation prior to March 1st of 2016, then the state law on cultivation would take over and'",
        "'speaker_13': 'you would lose local control on that issue. And from the research that we've done, if you left a ban in place on cultivation, that would be regulation. And under the scenario that was presented by Councilwoman Price, we would not come back with a report until well after that March 1st date.'",
        "'speaker_13': 'So. We could either leave the ban in place or you could give us specific direction on what you would want for cultivation if it did come in the city so that we could be prepared for the new state regulations in March.'",
        "'speaker_13': 'The current ordinance has certain provisions relating to cultivation. It limits the size of a cultivation facility to 5000 square feet. It includes all of the buffer zones that have been discussed previously tonight. So you could leave that in place and we could write it so that if a dispensary is considered after that six month period that was'",
        "'speaker_13': 'mentioned by Councilwoman Price, that those regulations would kick in and, you know, you'd have the 5000 square foot limitation and the buffers and. You know, a requirement for.'",
        "'speaker_11': 'So so under the current substitute motion that, as I understand it, restricts storefronts but okays businesses for up to four businesses for home delivery with the cultivation component that is already being proposed. Change. Much in terms of that dynamic?'",
        "'speaker_13': 'Well, we'd have to make modifications to the ordinance because as it stands now, cultivation would be permitted under that ordinance. So we would have to recraft the ordinance if that was the direction of council to indicate that the regulations would only become applicable if Council takes further action to allow cultivation in the city at some future date'",
        "'speaker_13': '. But we would lock in place those regulations at this point in time so that if in six months after that first dispensed or first delivery site opened up and a report came back and said, we can accommodate cultivation.'",
        "'speaker_13': 'Those regulations would then kick in.'",
        "'speaker_11': 'So I think it's extremely important for us to maintain local control on this matter as much as possible. Do we have any idea what a state cultivation ordinance or law would look like today, and how would that be different than what we have proposed?'",
        "'speaker_13': 'The state has a fairly extensive regulations, but most of them have to do with licensing. If I remember correctly or if you know Monica. But I believe the state has. Maybe 17 different types of cultivation licenses, depending on the size of the operation.'",
        "'speaker_13': 'There's a requirement to get a separate cultivation license from the state. I do not believe they get into the kind of detail or ordinance does as far as the size and so forth, although some of the licenses are tailored to the size of the operation.'",
        "'speaker_13': 'So you could have some fairly extensive operation operations if the state regulations. Became applicable.'",
        "'speaker_11': 'So I guess I'm looking for some some sort of direction or assistance from from the city attorney to to support the substitute motion, but also maintain local control that we would like to have as a city for cultivation, for when that is.'",
        "'speaker_13': 'So my suggestion would be as part of that motion would be also to direct, because we're going to have to bring back a new ordinance, direct the city attorney to prepare as part of the new ordinance that would be presented, regulations for medical marijuana cultivation that could be implemented only after the city or the city council determines'",
        "'speaker_13': 'that a bricks and mortar facility is appropriate in the city. And we would incorporate regulations much like what we have now requirement for a cup, buffers and so forth. And we would bring that back to you.'",
        "'speaker_11': 'So, Councilmember Price, we're open to such a friendly.'",
        "'speaker_5': 'Yes.'",
        "'speaker_11': 'Thank you so much. I think that's it for questions for now. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Richardson. Sorry.'",
        "'speaker_9': 'Thank you, Mayor. I'm really glad to see how the conversation there's been a lot of movement since the last time we've seen this. And so I want to I want to, you know, applaud Councilmember Price for making that movement in her position.'",
        "'speaker_9': 'Councilmember Alston as well. Just have a few questions and comments about the ordinance and and some of the proposals on the table. So in terms of I'm going to start with because this is the most immediate recommendation. It was the home delivery proposal and.'",
        "'speaker_9': 'We heard a lot tonight about about homelessness. And I know personally that a lot of homeless folks utilize, you know, RV hotels, sometimes public spaces. And so how will we is that with the plan B to deliver allow home delivery to a hotel or to a public space?'",
        "'speaker_9': 'Just thinking out loud how this would work. That's a question for whoever will want to take a crack at it.'",
        "'speaker_13': 'So I'd have to find the precise provision. But we do have in the draft ordinance in front of you fairly extensive regulations in regard to home delivery that requires you to have insurance, you know, proof that you're delivering to someone over the age of 21 and that that person has a recommendation from a physician.'",
        "'speaker_13': 'There are restrictions that would prohibit them from delivering to a federal facility to a publicly owned facility. You could not deliver to a hotel or motel as it is currently structured. And there were a couple other. Restrictions. I just can't remember off the top of my head.'",
        "'speaker_9': 'So in theory, how would someone who perhaps lives in their car acquired.'",
        "'speaker_13': 'Well, under the under the ordinance, it wouldn't be it wouldn't be under the current draft of the audience. It wouldn't be permitted at all to deliver it to a car. You would have to deliver it to a fixed location, some sort of a residence.'",
        "'speaker_13': 'We could if this is the direction council wants to go, we'd have to get creative and figure out a way to provide that type of delivery service. But I don't really know what it would be because based on the discussion of homelessness we had.'",
        "'speaker_13': 'Earlier this evening. I mean. The problem is all over the city, different types of venues. So I don't know what a single point would be where you could provide that kind of service effectively.'",
        "'speaker_9': 'I get it. And I wouldn't encourage anyone to have to deliver, you know, something to a car or an RV. But I do like the idea of exploring home delivery. I have a few more questions. So back to the ordinance that was presented.'",
        "'speaker_9': 'I appreciate the point system, but it seems just a bit simple. Even if there's a point here for, you know, someone who's been in the city before or been a part of the passed process, it just seems a bit simple when you have, for example, a question about you add one point for people who had, you know'",
        "'speaker_9': ', submitted a business. Well. It's a zero point or one point, and it leaves no room for quality or judgment on how quality a proposal might be. And so I would I would ask what how would we approach it if we said instead of a 0 to 1 point, we just allowed some some some bit of flexibility in'",
        "'speaker_9': 'judgment by saying like 0 to 5 points. So you can see if someone submits a business plan to the city that is, you know, high quality page really thoro stands up to, you know, and, you know, an audit versus someone who who draws it with crayons and both of them submit a plan.'",
        "'speaker_9': 'I don't think both of them should still receive the point. So how we approach it if we you know just expand it to point system kept same categories that allowed a little bit for. For a little bit of evaluation on quality.'",
        "'speaker_13': 'So I should talk a little bit about the reason we structured it the way that we did. We tried to structure it in such a way. I mean, the goal of the whole point system is to encourage best practices, best operators that we could possibly get for the facilities that would be licensed.'",
        "'speaker_13': 'And we did keep it rather simple as far as a one point system for most of the items. And the reason for that was to try and take out the discretionary aspect of it, because if we vest discretion in our staff or the city attorney's office or anyone to make determinations who gets a, you know, on a'",
        "'speaker_13': 'floating scale of 0 to 5, we're likely to generate litigation as a result of that because someone who was scored very low is undoubtedly not going to. Be happy with that. So we just tried to keep it simple, straightforward.'",
        "'speaker_13': 'We tried to structure the categories so that they would capture all the things that we would want in a good operator. We could easily end up with a system. If everybody does what they're supposed to do and submits a very thorough application, we might end up because it defaults to a lottery if there's ties.'",
        "'speaker_13': 'And that's actually not a bad thing because then will ensure that whoever gets selected will hopefully be employing their best practices. When they open.'",
        "'speaker_9': 'Next question would be along the same lines. How do we evaluate? Well, both background checks. So if they operate, you know, dispensaries in other cities, how do we check to make sure those cities aren't having issues with this operator?'",
        "'speaker_9': 'How is that evaluated in this selection process?'",
        "'speaker_13': 'So the only thing that is as far as an evaluation, they are required to disclose whether or not they've ever had a permit or keep something like that revoked or suspended in another city. But we don't really have as part of the point system a detract for that, but we would take it into consideration.'",
        "'speaker_9': 'Is there a way to do some level of a background check on, say, the highest scoring applications that are submitted?'",
        "'speaker_13': 'Everyone's require everyone that submits an application is required to go through life scan, but that's basically to determine whether or not they have an inappropriate criminal background. We could, as part of the process, do a due diligence. We could add a category.'",
        "'speaker_13': 'We could add a point for never having had a license or permit revoked in another city. And then as part of that, we'd make them a test to that, certify that that was true, and then staff could do their due diligence and make sure that it was true by doing the best we could to make sure that'",
        "'speaker_13': 'they hadn't had a problem someplace else.'",
        "'speaker_9': 'So that would only make sense if they actually have an establishment in another city. So I wouldn't want to I mean, obviously if someone has never opened the establishment, I don't want them getting a point for never having gotten their license revoked.'",
        "'speaker_13': 'So we would set it up as a minus one. It wouldn't if you had an open anywhere else, you wouldn't get any points at all. But if you had had a revocation at some other location of and it would relate directly to a medical marijuana facility, we would detract one point.'",
        "'speaker_9': 'Okay. So you're a net neutral if you haven't done anything, if you've got some experience and it was a positive experience, you get a plus one. If it was a negative experience, you get a minus one. That's how that works.'",
        "'speaker_13': 'Well, what you were suggesting would just be a subtract one.'",
        "'speaker_9': 'Yes.'",
        "'speaker_6': 'Subtract one. Mm hmm.'",
        "'speaker_9': 'I like that. Next. So I appreciate the the budget and the economic analysis, and I especially appreciate the team based enforcement model so that you get different perspectives. And the last thing I would you know, given how fluid this regulatory environment would be, last thing I would like to do is hire a bunch of sworn officers and'",
        "'speaker_9': 'two years from now, something changes in terms of, you know, the the the regulatory environment, we won't have have the means to support those officers. So using a mix from different departments and spreading it out, I think it's smart.'",
        "'speaker_9': 'The question on the revenue generation, so I know it was I know there was a breakdown as to what types, you know, this was a maximum we assumed maximum tax generation from what what was the breakdown of the type.'",
        "'speaker_9': 'So if we were to change, for example, and say only dispensaries or nine dispensaries, how would that change if we're not doing, say, cultivation or something like that? How would that affect the the analysis?'",
        "'speaker_7': 'So Councilmember, I'll give an overview and then Leo can provide more detail if needed. Essentially, we did do a pretty complex analysis to try to estimate how many were allowed in the ordinance, and then we look at how much would come from if we had cultivation sites.'",
        "'speaker_7': 'I believe we had two cultivation sites in our model. We looked at, you know, if the nine were operating in a low in a low revenue environment or a medium or high and then made some estimates along those lines, there's also an estimate for our sales tax because we would collect sales tax on this as well.'",
        "'speaker_7': 'And then those that's really on the tax side and then there's the regulatory fee. So if you had nine dispensaries and you have a certain amount of cost that gets spread to the permitted or the allowable dispensaries that can only be used to recoup enforcement costs for for those expense for those dispensaries.'",
        "'speaker_7': 'It couldn't go for any of the for the illegal dispensaries. So if we do have a lower amount of facilities, we would have to recalculate and bring that back to you what the what the revenue impact would be and then also what the cost impact would be.'",
        "'speaker_9': 'So in terms of staffing, do we have a scalable staffing model that we can consider? If, you know, there are, you know, more, we can have one level or based on overtime. And if it's less, we have less in part.'",
        "'speaker_7': 'Yes, in part it's it's important to remember that this isn't linear. So if you if you go from X amount of dispensaries and cut that in half, it's the costs don't necessarily get cut in half. We really look at two different costs.'",
        "'speaker_7': 'One is to permit the license dispensaries, which we're hoping are all going to be very good operators. And really, we're just checking and making sure that they're doing what they need to be doing. Then there is the expectation and this has been our experience in Long Beach as well in other cities, that when you open up legal'",
        "'speaker_7': 'dispensaries, you are also going to be seeing activity from illegal dispensaries. And so that we would still have to have costs associated with appropriately responding to those illegal dispensaries. And those two aren't necessarily connected.'",
        "'speaker_9': 'I get. And I just think that some of the calls were represented. As, you know, these are all of these calls are, you know, on day one, we need to have these calls. But in reality, given the timeline, it's going to be a while until we're actually open and ready for business.'",
        "'speaker_9': 'So, you know, we wouldn't necessarily in this next, you know, have to make a mid-year budget adjustment to have this full cost. We can sort of scale or phase it in.'",
        "'speaker_7': 'Correct? Some are phased and some are not. So we would definitely if you give us direction on a different model, we would cast that out and look at those phases. What would need to come on immediately? What could wait until until this model would be implemented?'",
        "'speaker_9': 'Okay. So can you walk me through the timeline?'",
        "'speaker_7': 'So by timeline, I expect you are asking for if this were to pass for implementation. So as what we've outlined in our memo is if the council takes action, we would immediately start the process. We would upon adoption of the two audit of the audiences and the second reading, we would essentially bring on the staff that we'",
        "'speaker_7': 'need right away in order to create the application process. By February, we expect that we could have the design of the application process to be complete. We then this goes through a couple process is how the ordinance is structured.'",
        "'speaker_7': 'We would then in March have applications would be due. There is a process that you have to go through not just for this process, but for any business that goes through a CPA. And it is a lengthy process.'",
        "'speaker_7': 'So we expect that that up process would essentially be completed in October. We then would go through the planning check process with those various dispensaries. And so the plant check process would be completed in December. So if you take action tonight, we do expect and there's also construction that has to happen in these dispensaries.'",
        "'speaker_7': 'So we expect that will start immediately. You know, we wouldn't be delaying anything. It would be immediately getting started, but it would take approximately a year before the first dispensary would be opened.'",
        "'speaker_9': 'Okay. So and my final question and my final question would be if we were to so there were there are two proposals on the table already. One is to set a threshold for nine at one for district one.'",
        "'speaker_9': 'The other is to is predominantly, as I understand it, a delivery based model that phases in four and then four more later, you know, three more after that. How would your timeline change if you have how would your timeline change if you were to adjust opening dates?'",
        "'speaker_9': 'Would you if you were to have different phasing dates with all the all the regulatory stuff and ramp up, would all that be a be affected as well?'",
        "'speaker_7': 'Well, as we understand the proposal, you would still be creating four facilities. They wouldn't be available for walk up traffic, but they would still be for facilities. So and unless a different regulatory scheme was used, you would still go through this process in the setup process.'",
        "'speaker_7': 'So we expect it to be similar.'",
        "'speaker_9': 'Okay. So here's what I'm going to try to do. I'm going to try to merge the motions. And if people are sincere about compromise, let's see what happens. So the delivery options obviously have issues that need to be vetted out as well, but I'm willing to allow staff to try that out.'",
        "'speaker_9': 'So I want I move that. We include the, you know, delivery options on day one and that we I have an issue with opening up just delivery and no walk up space. I think that's not fair to a certain demographic and I don't think that's anyone's intention here.'",
        "'speaker_9': 'So but it seems like there's interest on the council at jumping way ahead at at, you know, nine or some larger number might be too high. So here's I like I also like the elements that Councilwoman Lowenthal mentioned about a per district cap.'",
        "'speaker_9': 'And I believe there was something about the after we looked at the there was some misunderstanding about whether we included child care as a as an example to look at or to be written into the ordinance. And that the original intent was to to take a look at it.'",
        "'speaker_9': 'Well, if if the interest is to remove that, I'm okay with that as well. So to be clear, I move the ordinance as presented include remove child care centers. A cap at one per district to be phased in beginning with five.'",
        "'speaker_9': 'After six months of evaluation. The other four. And delivery on day one. And my hope is that that includes a phase in from the substitute motion and the main elements from the main motion. And so that's my motion.'",
        "'speaker_0': 'Thank you. Mr. Mays, would you repeat the motion just because I want to make sure it's clear?'",
        "'speaker_13': 'Husband Richardson was talking about for me. Sorry, but it. I'm going to have to ask him to repeat it. Sorry.'",
        "'speaker_9': 'So what I'm trying to do here is get the elements from the main motion of you. Repeat to me the elements of the main motion. I'll tell you that I'm going to include those.'",
        "'speaker_13': 'When you say the main motion, do you mean the motion made by Councilwoman Lowenthal?'",
        "'speaker_6': 'Yes.'",
        "'speaker_13': 'So that would be to adopt the ordinance as presented. There would be nine dispensaries in the city, one per district, and remove licensed child care facilities from the buffers that were presented in the district in the ordinance.'",
        "'speaker_9': 'Yes, that's the motion and the caveat the change would be to add a phase in. So we would start with five and six months later adding four.'",
        "'speaker_13': 'So just to be clear, just to be clear, you would start with five. And could those be anywhere in the city in any of those five district or we're still going to risk more than one.'",
        "'speaker_9': 'No more than one per district.'",
        "'speaker_13': 'Okay. No more than one per district. Five total. Mm hmm. And then after six months of the first being in operation, would we incorporate. The provision that would require a report back to the city council as to how things were going at that point in time.'",
        "'speaker_13': 'And then you would consider adding an additional four to bring you up to a total of nine.'",
        "'speaker_9': 'Yes, I'm fine with that.'",
        "'speaker_0': 'So just and just so I'm clear, essentially, the motion is, is Vice Mayor Lowenthal was motion with one change, which is instead of opening up the process directly to two nine dispensaries up to nine I'm sorry, citywide, you would first open it up to five and at six months then you would open it for an additional four'",
        "'speaker_13': '. You would report back to consider adding an additional four.'",
        "'speaker_0': 'Well, that's okay. That's different. So I want make sure I'm clear. So is it is it five? Because quite frankly, the council on any Tuesday can add four at five to, you know, change things. And so is the motion to go five.'",
        "'speaker_0': 'And then after six months you go into four or is a motion only five and then the count the council debates and discusses again and can choose them to go to for up to four more.'",
        "'speaker_9': 'Councilman, what I envision is, you know. If a district if districts. So let me simplify. Nine is the motion is one for district and I want to begin with five to allow some for some evaluation. So that could come back to the council in the form of a two from for a study session.'",
        "'speaker_9': 'If any council council member based on the data would like to take actions and not implement those other four, then they have that opportunity. But my hope is the hope is to allow some sort of a I want to sort of see if there's middle ground here.'",
        "'speaker_9': 'I like the idea of a phase in.'",
        "'speaker_0': 'Okay. So just.'",
        "'speaker_9': 'Like the other ideas as.'",
        "'speaker_0': 'Well. So just to be clear, your motion is, is the Vice Mayor Lowenthal original motion. The difference is that instead of going directly up to nine, you're going directly up to five, and at six months you begin the process for the next four.'",
        "'speaker_0': 'However, there is an update to the council at six months, and if at that point a council member wants to change the ordinance, then they have a right to as they would have a right to any other week.'",
        "'speaker_9': 'Absolutely.'",
        "'speaker_0': 'Okay. So that's the motion on the floor.'",
        "'speaker_13': 'Mayor, I need further clarification. In the six month period we're talking about is six months after the first dispensary actually opens.'",
        "'speaker_9': 'Yeah. So. So how about this? We're going to have six months. We're going to have six month updates every six months. During this, I want to say every six months I update every six months until everything gets open.'",
        "'speaker_9': 'And that and the five the four additional dispensaries will be opened up after six months after. Well, cannot open until six months after the the original five have been open for business.'",
        "'speaker_13': 'Okay. And one further clarification, because you said you want to allow delivery. So I seem I assumed by that the model would be that if we have five eligible for a cup, each of those five as part of their original cup could also ask to do delivery.'",
        "'speaker_9': 'So let me ask you the question. I mean, are there considerations we have? It sounds fine to me if someone would prefer to have home delivery as an add on to their service. I don't have a particular issue.'",
        "'speaker_13': 'And that's the way the current ordinance tonight is structured. So if you apply for a CFP, you can indicate on your application that in addition to bricks and mortar retail sales.'",
        "'speaker_9': 'I don't have to. You could do.'",
        "'speaker_13': 'Delivery. Yeah.'",
        "'speaker_9': 'Yes, thank you.'",
        "'speaker_0': 'I think there's one piece of clarification to that so I can repeat the motion. Is the is the is the additional up to four? Does that timetable is that because does that clock begin when all five applications have been processed and or an open or does that start when the first one open?'",
        "'speaker_0': 'So you're saying after the first five are open, is that. I think that's what you're saying.'",
        "'speaker_9': 'So I mean, yeah, but let me just restate. Um, can you tell me when the first ones would be open? Based on today's.'",
        "'speaker_7': 'Timeline.'",
        "'speaker_13': 'Mr. Modica indicated the likely scenario is that approximately one year.'",
        "'speaker_9': 'So if we were to start their process delayed from today, six months, we would would we be able to, let's say the first five, it was a complete disaster. Will we be able to stop someone in their process if it takes a year to get opened?'",
        "'speaker_9': 'Let's say they'll be six months down the process and we delay it six months, not six months from when they open, but six months by the time they actually get open, we will have six months of data, correct?'",
        "'speaker_13': 'No, you wouldn't, because it's going to take a year for us to open the first ones. And I think the the premise of your motion, if I understood it, is to get an idea of whether or not the ones that you are authorizing the first five would be operating successfully, not causing a nuisance in the neighborhood.'",
        "'speaker_13': 'So you really would want to make the trigger point at some point after at least one, if not all five of them open so that you could see if they were operating appropriately or not. You weren't getting complaints from neighbors or so.'",
        "'speaker_9': 'So what my hope is then will be to create some sort of a a overlap so that, you know, there can be sort of caucus one or cohort one that's in the process that takes a year. Six months into their process, you can start the process on.'",
        "'speaker_9': 'You can stagger and start the second process. If the first by the time the first process is up and running and you have some data, if it's a complete disaster, would we have the ability to stop the process on the others and return any money from the city?'",
        "'speaker_9': 'We have the ability to just stop that in the process before they get open.'",
        "'speaker_13': 'It would be very once you start down that it's very expensive, number one, for the applicant to go through that process. So if we started them down that road and got halfway through it and then said, Sorry, you can't do it again, we would generate, I guarantee you, litigation from everybody that's in that process, even if we'",
        "'speaker_13': 'gave them back the money, because usually by that period of time they have had to identify a physical location where they could go. They have to get capital together, they have to put together business plans. There's a whole lot of work that they would have to do, so it really wouldn't be fair to them to get them'",
        "'speaker_13': 'in the pipeline, only to revoke that at some point in time that the other the initial five didn't work out. It would be better to get some statistical data after you have one or more, 1 to 5 actually operating so that you can see that now we have a good model we can use and you have a'",
        "'speaker_13': 'database from which to draw to know whether or not you really fight for more.'",
        "'speaker_9': 'So so hearing that, I mean, that fundamentally changes my intent of what I wanted to do. I mean, my hope was to try to get some sort of a phase in that was more reasonable. But if you have a phase in that, you know, it takes a year to get one up and going in six months and'",
        "'speaker_9': 'then another year after that. That's two and a half years. That's two that's a pretty long well.'",
        "'speaker_13': 'Presumably they they would be moving through the process in parallel. So I don't anticipate one would take a year and then another one would take another year. You'd have all five of them presumably going through the process roughly at the same time.'",
        "'speaker_13': 'So if everything worked out well, people submitted their applications on time, they were properly vetted. All five of them could be into well into the CFP process by this time next year.'",
        "'speaker_9': 'And so the additional four would not be able to begin their process until we have data back on the on the originals. That would be another year after six months of being open.'",
        "'speaker_13': 'It would take a process.'",
        "'speaker_9': 'Two and a half years.'",
        "'speaker_13': 'So you're saying. Yeah, you're correct.'",
        "'speaker_9': 'So that fundamentally changes what I was hoping to do here. I mean, that said, if there's no realistic way to have a phase in that structurally changes my thought on the substitute motion as well, because we would be subject to the same timeline on the subject to motion as well, correct?'",
        "'speaker_9': 'I mean, if the substitute motion were to open up, you know, in six months from the time that six months from the time that delivery is opened, we begin storefront sales, that would take we we evaluate then begin storefront sales that would take us how long would it take to get delivery up and running a year.'",
        "'speaker_13': 'It would be about a year or.'",
        "'speaker_9': 'So, a year for delivery. Then six months of evaluation and then another year to get the storefronts open. So two and a half years before we getting the storefronts open. If the substance of the motion is.'",
        "'speaker_13': 'Well, yes, that's correct.'",
        "'speaker_9': 'So so I'm withdrawing my motion and I can't support the substitute motion either. I'm just going to support the main motion for the simple fact that.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_9': 'The timeline doesn't make sense to phase it based on what you said, to have a sincere effort at this. So I don't I don't really see any way around it either. We're going to do this because we support it or we won't.'",
        "'speaker_9': 'So there it is.'",
        "'speaker_0': 'Okay. Thank you. Moving on, I still have a list of members and the public. We're nearing 210, so I just want to make sure that we are moving as expeditiously as possible. Count summary ranga.'",
        "'speaker_12': 'I guess that's a veiled hint, to be sure.'",
        "'speaker_1': 'To.'",
        "'speaker_12': 'Be direct. Well. Well, before I begin, I want to thank Councilmember Lawrence out for bringing this forward. I know she and and former council member Oranga Tony have brought this forward many years ago. And now here we are.'",
        "'speaker_12': 'We're almost we're almost there. We're almost there. And I want to also compliment Councilmember Price for coming around a little bit. I mean, it's still complex and it's not an easy topic. It's not easy to grapple with it.'",
        "'speaker_12': 'And of course, I want to thank Councilmember Richardson for. Coming around full circle to where we first started with the original motion that I seconded. So having said all that, I'm not going to ask any further questions. I'm going to just support the original motion.'",
        "'speaker_0': 'Councilmember Gonzales or Councilwoman Gonzales.'",
        "'speaker_5': 'Yes, I have a few questions that I'd like to ask and perhaps I might be interpreting it a little bit differently. But just first, in terms of staffing and costs, how did we formulate these costs and did we look at this?'",
        "'speaker_5': 'I know in some cases we looked at the city of Los Angeles. How did we come up with, you know, $3 million and get a baseline for all that?'",
        "'speaker_7': 'So, Councilmember, what we did is we did look back at prior experience. We have had experience in the past of doing some regulation and doing enforcement. So we know what those what those costs are. We also did a kind of a zero based we asked each department.'",
        "'speaker_7': 'So given the ordinance that the council is considering. So the council passes the current ordinance. Please estimate your cost to do those. And so we asked them to split it into what would it cost to do the regulatory and to approve if there were nine approved, what were the costs that could be associated with those nine and'",
        "'speaker_7': 'only associated with those nine? And then what is the cost associated with stopping some of the illegal ones that we expect would come? We had to make some assumptions in the analysis we assumed, and this is based on our past practice as well as other cities, that for every one that is opened and allowed, we expect up'",
        "'speaker_7': 'to six potentially could be here within, you know, while we're doing this process within that year, those are going to start fairly soon is what our expectation would be. So being able to have sufficient resources to address those departments came up with that that amount of about $5 million.'",
        "'speaker_7': 'And then we essentially estimated what we believe the revenue would be from from the nine from the tax side and also from the regulatory side. And then we managed to that budget. So we did make some reductions. We created a model that we believe the council, if you want to move forward with this, we were hearing that'",
        "'speaker_7': 'it would be paid for by by the amount of funds available. So we managed to that budget and that's how we came up with the 3 million.'",
        "'speaker_5': 'Okay, great. Thank you. And I understand will be using existing employees should this be rolled out. But are there any new will we be looking at new hires or is this because this is such a large undertaking? It wouldn't be.'",
        "'speaker_5': 'You know, it's it's certainly existing within the roles of the city employees. But would we have it would we have any new hires for for this?'",
        "'speaker_7': 'So it would be a combination of both. We would be expecting on a go forward basis that we would be hiring new staff. This is a very time intensive process to do the enforcement. And so we will need new staff and we are budgeting for that in that 3 million, although we do expect that those illegal establishments'",
        "'speaker_7': 'could open very soon and we would need to respond to those using existing staff. And so we split it between how many existing staff we're going to have to pull and that there would be diversion from, you know, other business that those staff normally do.'",
        "'speaker_7': 'And we would have we would have some diversion so we would be mining back to you on what that diversion would be. For example, for on the police side, we're estimating two and a half police officers. It takes about two and a half years to fully train a police officer through the academy, through the field training program'",
        "'speaker_7': '. And so in that interim time, we would have to pull from existing resources in order to, you know, on overtime and others to have those police officers available even at the two and a half additional that we added.'",
        "'speaker_5': 'Okay. Thank you. And now that we're on the subject of police officers, Chief Luna, how many police officers currently are we down at the moment?'",
        "'speaker_6': 'I want to say we're down about approximately 20 or 25.'",
        "'speaker_2': 'Okay. 20 or 25.'",
        "'speaker_5': 'Okay. Thank you. And as far as our approach to enforcement, I know it could be a longer process. Is this due to the fact that we're now taking more of a team approach if we are to implement this?'",
        "'speaker_5': 'Is that the reason why it's going to be called the Collective Health Department, city prosecutor, everybody kind of pulling together.'",
        "'speaker_7': 'So under this model, we would shift away from a police model where we're serving search warrants and showing up with large groups of officers and doing all the work that goes into the search warrants. On the criminal side, we would instead switch to a lean type model where we are assessing fines and trying to, you know, assess'",
        "'speaker_7': 'as many of those fines as possible if there is an illegal establishment. So that requires time to create those. And there's a there's you have to serve them and you have to inspect and you have to get access to the facility.'",
        "'speaker_7': 'So, yes, it would be a different model and one based more on financial penalties than one on criminal enforcement.'",
        "'speaker_5': 'Okay. Thank you. And as far as enforcement as well, I know in here at least I didn't see where we had issues in the past with property. So for for the most part, for the unsanctioned for facilities or properties, the property owner was often a large part, a large piece of this, this issue.'",
        "'speaker_5': 'And so how do we or what more of power do we have as a city to to enforce in those instances?'",
        "'speaker_13': 'So the draft ordinance that is that we presented to you does have provisions in there that makes it illegal for a landlord to rent a property to someone. For medical marijuana purposes unless that person actually has a copy from the city.'",
        "'speaker_13': 'So there would be the potential for criminal prosecution and there would be the administrative fines, as Tom mentioned.'",
        "'speaker_7': 'So essentially, we would be going after both. We would go after the the establishment, the business. But at the same time, we we are going to be leaning you know, the fines and fees were going to be leaned on the property, which is in many times not the same person as the the business that's operating.'",
        "'speaker_5': 'We did that before. Correct. So there's nothing different that we would do this time around. It's going to be basically the same process that we have had used before.'",
        "'speaker_7': 'Correct. Where we would look at additional tools that we could use as well. And we would look for safety violations that we could red tag the building we would look for, be more aggressive with liens. If we had dedicated staff and dedicated city attorney help, we could actually move to a sale of the property potentially, which which'",
        "'speaker_7': 'we hadn't done in the past. So there are some of those tools. But those you know, and just to set expectations, those take a long time. There are there are legal hurdles that you go over to over. You have to have due process.'",
        "'speaker_7': 'And so those those do take time in order to fully effectuate.'",
        "'speaker_5': 'And then lastly, I know it's important that I, I believe it's really important that we gather a lot of data if, you know, whatever takes place tonight. You know, I think data is certainly very important, as Councilman Price said, is as Councilmember Richardson said.'",
        "'speaker_5': 'And so I'm wondering if at all possible, since we are taking this team approach with the health department in looking at patients that we're we're I'm really looking at is as far as if this is to be implemented, is there data we can get perhaps from the health department that would say where we can work with these'",
        "'speaker_5': 'property owners or work with these establishments or these home delivery business owners and say, uh, you know, get some data as to what these ailments are from these patients. I mean, is that I don't know if there's any legal issue there with that or how we would.'",
        "'speaker_13': 'So the state law is actually fairly broad in regards to who can qualify for medical marijuana. And it's really up to the discretion of the physician that issues the prescription. So. It's very broad and we couldn't limit what the state law does.'",
        "'speaker_13': 'We could probably get data, but it would only it would probably be very difficult to get, quite frankly.'",
        "'speaker_5': 'Right. Well, I guess I'm asking the question in the sense of we'd like to know as a city what type of ailments that are more prevalent here in our city and as a health department or, you know, is that without giving, you know, all of the information out, without giving, you know, names and all that, is there'",
        "'speaker_5': ', you know, does this person have HIV AIDS? Is this person have cancer? And what types of cancer and what types of ailments we have out there?'",
        "'speaker_4': 'We we track in the city. We have.'",
        "'speaker_13': 'Data from hospitals around that what different diseases.'",
        "'speaker_6': 'Are.'",
        "'speaker_1': 'We wouldn't be.'",
        "'speaker_3': 'Able to do is identify that is is what the prescriptions are being written for as those data wouldn't be collected. And that's not something that we currently have ability to track. Okay. Yeah. But otherwise, within the city, we do understand what the cancer rates look like in those sorts of things that different age groups and different communities'",
        "'speaker_5': '. Okay. Um. All right. Perfect. Thank you. Because those are all my questions. I appreciate it.'",
        "'speaker_0': 'Thank you. We have to close at the council portion here, Vice Chair Lowenthal.'",
        "'speaker_2': 'Thank you. Thank you, Mr. Mayor. And I wanted to thank my council colleagues for the discussion. And Mr. Mayes, just. Can you restate the original motion or shall I restated?'",
        "'speaker_13': 'So the motion, as I understood it, would be to accept the ordinance as presently drafted, with the exceptions that we make clear that there would be nine per city but no more than one per council district, and that when we brought back a new ordinance, we would also removed licensed child care facilities from the buffer zones.'",
        "'speaker_2': 'Okay. And I knew that I had accepted a friendly amendment from Councilmember Andrews. And in all this time that we had deliberated, I had reflected back on your advisement that that might create a barrier or most likely create a barrier.'",
        "'speaker_2': 'So I'd like to remove that friendly amendment for that extra point and leave it as the ordinance reads. Councilman Andrews, is that acceptable? Thank you. So the only change is the removal of the buffer.'",
        "'speaker_13': 'In the specification of one per district only.'",
        "'speaker_2': 'Correct. Thank you. And with that council members, I hope you can support that motion, I think. I think in the seven years that we've attempted to have some reasonable policy in place, we have come to a place where we can take a measured approach.'",
        "'speaker_2': 'And that measured approach is really a number as small as nine. I don't have any data to support what a city our size would really require if we were to meet all the needs of people that were in need, medical need of of medical marijuana.'",
        "'speaker_2': 'But I don't think we're here to really determine that because none of us is an expert on that. I think what we're here to do is look at land use and look at our. Approach to public policy, this one particularly to try and balance land use issues with public policy that would enable our residents to participate in'",
        "'speaker_2': 'something that they are legally able to participate in and ensure that they're able to do that in a city that they live in, as opposed to traveling great distances and lengths to acquire something that they are legally able to do.'",
        "'speaker_2': 'And in doing so, looking at the buffer zones and the various conversations we've had about the different attributes that we would like to assign to the buffer zones, I do think we've taken on the land use issues quite thoroughly, and I'm satisfied with it.'",
        "'speaker_2': 'And and I have to say that I'm pretty confident that we're moving in the right direction, not because we've spent seven years at it and not because any one of us knows more than the other, but because we truly have vetted this to the extent possible and balanced our public safety interests and needs.'",
        "'speaker_2': 'With this conversation, I don't know that there is anything that we have not considered. It doesn't mean we'll get it right. But that's the beauty of public policy. It's not a one shot deal. You do have an opportunity to correct as you go.'",
        "'speaker_2': 'And I think this measured approach of taking nine at this time and it will sort of be phased in because not nine would be ready to move forward at the same time. So I think we would organically see a phasing in of these nine individual sites.'",
        "'speaker_2': 'And so with that, I request council support and look forward to hearing comments from the public.'",
        "'speaker_0': 'Yeah. And what I'm going to do is before I go into the onto the public, I just want to make sure we have two motions on the floor. We have a substitute motion by Councilwoman Pryce, and then the the initial motion by Vice Mayor Lowenthal.'",
        "'speaker_0': 'Councilman, prices for brief. Repeat your motion that we're the ones on the floor and then vice mayor, repeat hers. We're going to go to public comment and then come back for the vote. Councilman.'",
        "'speaker_5': 'Thank you. And I would ask my colleagues to support my motion, which is to allow for businesses to establish with a home delivery service, no onsite sales. This will allow patient access for those who need it most. Six months after the first business is operational, staff will report back on the tax revenues collected, the fiscal impact to'",
        "'speaker_5': 'the city in terms of enforcement costs and any public safety issues in that time period. At that time, Council will consider adding four storefront locations to be aligned with the home delivery business. Same operator. Six months after the first storefront operation is operational, we will consider adding up to three additional storefronts for a total of seven.'",
        "'speaker_5': 'So that is my motion. Thank you.'",
        "'speaker_0': 'Thank you. And then we have the original motion on the floor. Vice-Chair Lowenthal.'",
        "'speaker_2': 'So the original motion on the floor is adoption of the recommendation, the staff recommendation for support of the ordinance as written with one change, and that is to remove the child care buffers. From the ordinance. Is that correct, Mr. Mason?'",
        "'speaker_2': 'I articulate that correctly.'",
        "'speaker_0': 'I think you also you you made a change on the on clarifying the language as far as one per district.'",
        "'speaker_2': 'Correct? One per district? Correct. So the number is the same as nine, but one per district and removing the childcare buffers. And if I can also add that I appreciate the interest in moving towards starting with just deliveries, but I think if we.'",
        "'speaker_2': 'Asked honestly to our public safety officers, or at least our police chief, there are many, many, many home deliveries that are taking place in the city today that are not being stopped today. And I don't know how we would end up being able to quantify.'",
        "'speaker_2': 'The price of that, what the value of that is, and in the interest of being sure that we're not moving toward a beneficiary pays type model of public safety, we don't put other businesses through that kind of rigor.'",
        "'speaker_2': 'We have a tremendous amount of calls for service to the Wal-Mart in downtown. And I'm not just singling out Wal-Mart, but that's the one that comes to mind. I used to live right across the street. We don't put them through those rigors.'",
        "'speaker_2': 'We also don't put other businesses through the same rigors. And so I do appreciate the conversation, but I I'm fully aware of the various businesses that we do not put through the same rigors in terms of beneficiary pays.'",
        "'speaker_2': 'So with that, council members, I hope you will be able to support the original motion.'",
        "'speaker_0': 'Thank you. Okay. So I'm going to go to the public public comment before we go to public comment. I just want to remind everybody that I. I know that we've got two motions we're going to vote on. Please just know that I think everyone's anxious to move forward, whatever that ends up being.'",
        "'speaker_0': 'And so please come forward. Make your comments. Please try not to repeat the information we've heard. I think most folks have heard these comments many times, which I've argued this and debated many times. And so just ask if we can please refrain from from too many comments, that would be great so that we can actually get back'",
        "'speaker_0': 'to deliberation. And please begin and say your name for the record, please.'",
        "'speaker_6': 'My name is Mike Bartley. I live at 40 409 Charlemagne Avenue, Lakewood Village, Long Beach. And I'm just curious. I want to know if the city.'",
        "'speaker_9': 'Council is aware of The Beachcombers.'",
        "'speaker_6': 'September 18th. This year, article by Stephen Downing. And it says here it says, the criminal organizations operating these systems salaries are alleged to have.'",
        "'speaker_9': 'Been making regular payments, a mere one in money. The cash ranging between 10,000 and $15,000 weekly.'",
        "'speaker_6': 'To members of the Long Beach Police Drug Squad. Now, what is going on here? We can't control the rogue operations, obviously. So why are we voting on this tonight as it is? I think that the priorities of this council is mixed up.'",
        "'speaker_6': 'We need to stop the rogue operations first before we can proceed with legal marijuana for medical reasons. And I don't see this happening. This is a it's a cancer. Really aware of this article here. This is very important.'",
        "'speaker_6': 'It is there. Are you laughing about it? No. Okay. Well, it's right here. And I assume that the editor, the writer of it is. He didn't specify who was by, but I assume is by the FBI. So and you read it further in her article here on the back page, you'll see that more details about the police'",
        "'speaker_6': 'who were paid off and assumed that they were paid off by the these the dispensaries. So. And another thing to Chief Luna says we don't have enough resources. To to come back the rogue dispensary. So if it which evidently will come up, according to Charles Parkin and assistant manager.'",
        "'speaker_6': 'So what are we doing here with this stuff if it's this dangerous and and in light, too, of of 911 and what happened recently at San Bernardino. Where is this money going to this cash flow from? These dispensaries are not accountable.'",
        "'speaker_6': 'We need to come up with a accountable plan before we can proceed. And there isn't any way I mean, if the cash where's this cash going anyway? And I don't have enough time. But Mr. West, the city manager, came up with this plan here about the tax payments are expected to be made entirely in cash.'",
        "'speaker_6': 'So where's accountability in this? Banking accountability. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_6': 'Good evening, Mr. Mayor. Council members. My name is Mark Greenberg. I live in the eighth district. Mr. Austin. And I was your vice chairman of the Marijuana Task Force. I'm a former federal prosecutor, prosecuted organized crime for ten years, then left and been in private practice.'",
        "'speaker_6': 'I've seen both sides of this issue and saw certainly a great deal of discussion about it over the course of 60 hours of the meetings of the task force. I as much as I've seen the law enforcement side of it and have prosecuted organized crime drug trafficking groups, I went to a funeral for a friend on Sunday'",
        "'speaker_6': 'who died of cancer. So I know both sides of this issue. And if what you're talking about is access and that's what you're here to do, there's two issues that really permeate this whole situation. There's money. There's money for votes.'",
        "'speaker_6': 'There's money that people want to make a profit. There's all the cash involved. This is a big money business. But there's also an access issue for some people. As a councilman, Gonzalez asked for the data. There is data and the data is that about 94% of the people that go into these establishments do not have serious illnesses'",
        "'speaker_6': '. They do not have cancer. About 5% do for that 5%. You should have access for people battling cancer. There should be access to this to ameliorate that doesn't cure cancer. In fact, under Prop 65. Smokable marijuana is covered under Prop 65.'",
        "'speaker_6': 'So for every sale in the state, in the state, it must be warned that you are causing cancer. This causes cancer. It doesn't fix cancer. It does ameliorate have since there's benefits, home delivery serves that need of access.'",
        "'speaker_6': 'If what we're really talking about is access for these people that need it, that truly have a need. The home delivery model works. It's been working for quite some time. Quite honestly, there's 30 companies right now that will deliver it to your home that I could have it delivered right here.'",
        "'speaker_6': 'It's not an issue. And so there is plenty of access if you want to have the revenue from that home delivery and allow it within the city, have it controlled from the city. But I live in the eighth District and in the eighth District we had what's been called a rogue dispensary on Atlantic Boulevard.'",
        "'speaker_6': 'I would walk by. Every shop is on the way to synagogue and there was a guy there with a gun here and a gun here out in front. Five things could happen, four of them bad. This guy was a nightmare.'",
        "'speaker_6': 'That dispensary was a nightmare. The police would raid it, close it down. It opened up the next day. There is no team approach that's going to really resolve that problem. They tried. They worked at it. They could not get it closed down.'",
        "'speaker_6': 'I talked to Chief McDonnell over and over again about my concerns with them. But home delivery resolves these issues. It addresses the access without all the problems. Thank you, sir. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker.'",
        "'speaker_6': 'Please. We want to just thank Mr. Mayes for all the time he gave to our task force and Kendra Carney for what I think was unpaid time.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_10': 'Thank you for your service.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_6': 'Honorable Mayor and city council Bill Napier here. If this was about home.'",
        "'speaker_8': 'Delivery, I would not be here.'",
        "'speaker_6': 'All of these many, many times. And even before the new council. This is not about home delivery because I don't trust none of that. And that's what we've been here for the stores. But here's the deal. We asked for a potshot and we got Governor Jerry Brown and instead.'",
        "'speaker_6': 'Now we're here begging again. The governor could have stayed out of it. The appeals court already had this one. But I guess he just couldn't let it be. So here we are. Begging you again for a punch up, please.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you, sir.'",
        "'speaker_8': 'I was going to add that.'",
        "'speaker_6': 'Uh oh. I wish they were all California. I wish they were all California girls. Thank you. Okay.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please. Okay. Let's try to get through this next speaker, please.'",
        "'speaker_6': 'Yeah. Hi, I'm Larry Parks. I was a managing director. Of a medical marijuana facility here in Long Beach. A lot of winter. Lotto winner. Also with a collective and a cultivation. I am. Have adequate.'",
        "'speaker_11': 'Proof here. These are very hard to find.'",
        "'speaker_6': 'Probably the only one that has one as somebody else could produce one. This is a medical marijuana collective permit that was that was presented by the city of Long Beach to us after we followed everything. I went through all the recommendations, spent $100,000 on a facility.'",
        "'speaker_6': 'Facility that was also handicapped facility. Very safe facility and sand in the walls in case anybody tried to come in and shoot anything. We never we had a very sophisticated. Alarm system, a very sophisticated camera system that even several times at the recommendation or the request of the Long Beach Police Department to help on robbery down the'",
        "'speaker_6': 'street at a facility, a liquor store facility, and another one at a small market facility. They used our cameras. So we tried to comply as best we could. We were raided ten times. Each time that cross was $15,000.'",
        "'speaker_6': 'So I would suggest that and certainly that mayor that I think last year you said give us a litigation free ordinance. And I would suggest and certainly recommend that you look at the people that won a lottery, that paid their $14,732, spent probably 100,000 plus in a facility.'",
        "'speaker_6': 'But they should be given the first opportunity. I would hope that you would get it right. So litigation doesn't get it right. And want to hear the economics of one. Councilwoman, if you were to take the budget, which I don't think is accurate, but it could be $5 million.'",
        "'speaker_6': 'But if you were to have to. Our district gets 18. Look at the income you'll have there. And the budget's not going to grow up that much more. So there's your facility offsets your cost. You'll bring in about $3 million more if you had.'",
        "'speaker_11': 'To.'",
        "'speaker_6': 'For district. So again, I urge you to consider the people that won the lotto. That we're here that opened. They should be given the first opportunity. And if not, then I think litigation will be. We don't want we're trying to stay away from litigation.'",
        "'speaker_6': 'Thank you very much, Mayor and city council.'",
        "'speaker_0': 'Thank you, sir. Before we have the next speaker, I'm going to close the speakers list. So the gentleman in the back with the hat will be the last speaker speak. There's more people. Okay.'",
        "'speaker_1': 'Stand.'",
        "'speaker_0': 'Go ahead, Jack.'",
        "'speaker_6': 'Hi. Good evening. My name is Jack Smith. I live at 240 Chestnut Avenue in Long Beach. That's in the first District. I was a representative for the second district because I lived in the second district at the time of the task force, a representative on the task force from the second District.'",
        "'speaker_6': 'This ordinance has a number of inconsistencies that I think need to be cleared up. First of all, I'm very glad that Vice Mayor Lowenthal has, as clarified and specified the maximum of one per district among the.'",
        "'speaker_7': 'Ninth district for a maximum of nine in the city. If that's.'",
        "'speaker_6': 'The number, remember, the number.'",
        "'speaker_7': 'Is very arbitrary. That you choose one per district is what you've chosen.'",
        "'speaker_6': 'As long as it's evenly distributed across the city. I think the most important phrase in this new proposed ordinance was at the very beginning, where it says protection of the public shall be the highest priority for the city.'",
        "'speaker_6': 'Whenever the protection of the public is inconsistent with other interests sought to be promoted, the protection of the public shall be paramount. That is very, very key to remember. With regard to the cups, I'm a bit confused as the ordinance is written right now as to how those cups operate.'",
        "'speaker_6': 'It specifies in here that the cups are for each individual property. That's how I see you normally operate. The previous ordinances had had a scope for two, potentially two properties of a business. So how is that working? If if we have nine cups in the city?'",
        "'speaker_6': 'If a business happens to have a farm and a store, does that mean C to you cups limiting it to a maximum of four businesses in the city? Something to be clarified. I also was confused a little bit about the issue of food.'",
        "'speaker_6': 'Several times, a couple of times in the ordinance it says edible products shall not be considered food. And then it goes on to in another section to say that that in order for edibles to be produced, it must be in a retail food establishment and a certified food handlers with a kitchen.'",
        "'speaker_6': 'So is it food or is it not a food? Some of those things need to be cleared up. So do what else do I have here? Oh, advertisements. This is the one I get the most grief over, I guess.'",
        "'speaker_6': 'Print advertising. I was a recommendation in the task force that advertising not be permitted. I think that needs to be in the ordinance. Right now it is specifically permitted. There are a number of print media already available to minors, and that's the problem.'",
        "'speaker_6': 'And we have the press telegram. We have the single Tribune, The Beachcomber, The Gazette, L.A. Weekly, Aussie Weekly. And we've seen the ads in the U.S. Weekly. So we knew what we were likely to be getting. So I think print advertising should not be permitted.'",
        "'speaker_6': 'So the question of how do you do a copy for a delivery service? How do the cups work with the businesses and yes, to the maximum of one per district? Thank you.'",
        "'speaker_0': 'Thank you. And Speaker, please.'",
        "'speaker_6': 'Good evening, Mr. Mayor. And City Council.'",
        "'speaker_0': 'I've been your name for the record, please.'",
        "'speaker_6': 'John Donahue is the name live in East Long Beach. I've been here since 1952. Now, I consider myself an expert on this subject, and I'm going to give you some of the benefit of my expertize. It seems like you need some.'",
        "'speaker_6': 'I've been here many times and listened to this, going on and on and on and it just doesn't seem to be getting us anywhere. For one thing, I started smoking marijuana in 1946. I just got back from World War Two and I found it very pleasant and I went on using it.'",
        "'speaker_6': 'I didn't get really into using it till I got out here to California. And the Sixties. Remember the good old sixties? And I started using it daily. And I never had any problem acquiring it. And now one thing we have to know about marijuana is if it actually should be calling it cannabis, because marijuana is a phony'",
        "'speaker_6': 'name that they gave the because the Mexicans were using it when they first criminalized it way back was four years ago. But now we have this problem. But one thing I understand that marijuana is not a crime. There are of course, there are laws against it, as there have been laws against tea and coffee and alcohol.'",
        "'speaker_6': 'But marijuana per say is not a crime. A small amount of marijuana is no criminal. I'd like mispriced or explained to me where the where is the crime? If I'm sitting at home with some marijuana and I got a bottle of scotch and I got Cigarets and I don't have a letter, why is that a crime?'",
        "'speaker_6': 'Anyway. It is not a crime. Another thing that I found amusing that we're now concerned about whether the homeless are going to be able to get the marijuana. Well, there's something else. How will they be able to pay for it?'",
        "'speaker_6': 'Because it's outrageously overpriced. It's about two or three, $400 an ounce. If a homeless person had that much money, he wouldn't be homeless.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please. Let's try to stick to, if possible, to the motions on the floor. I think we've heard the obviously the arguments about medical marijuana for many meetings. So we have a couple of motions on the floor if possible.'",
        "'speaker_0': 'Next Speaker Thank.'",
        "'speaker_6': 'You. Hi. My name is Nick Morrow, a resident property owner in the fourth District as a member of the Medical Cannabis Task Force. And I'm a former law enforcement. Law enforcement is not a for profit enterprise. So when we talk about the budget considerations, making money on medical marijuana is probably not the way you want to start'",
        "'speaker_6': 'the argument. The phased approach is is flawed because you have a fixed number of patients who aren't going to phase in their need. So you open the door a little bit. You're going to have problems with smaller and fewer locations.'",
        "'speaker_6': 'So keeping with the minimum of 914 district I support holly. Long Beach PD was very, very effective, very aggressive in closing down not only the rogue operators, but the operators that were doing their best to abide by the state state standards.'",
        "'speaker_6': 'With all that closed down, we don't have any operating medical marijuana locations in the city of Long Beach. The question I would have, has crime gone down as a result of that? Of all those closures, probably not with the the number of delivery services operating right now in the city of Long Beach, but checked it on my'",
        "'speaker_6': 'phone. There's at least 40 that will deliver to the city of Long Beach right now. None of them are actually located in the city of Long Beach. Those tax revenues are going elsewhere. Phasing in the delivery set up in Long Beach.'",
        "'speaker_6': 'You have to know where the medicine is coming from. If you just allow people to do delivery services without a location to verify quality and and strain and all those other issues that are important to patients, maybe not to the to the council per se, because we're looking more for the money than we are for quality of'",
        "'speaker_6': 'medicine for the patients. But the access is first and foremost. You got to open the door and you got to open it. Smart opening up nine locations and starting that process. Right now, patients in the city of Long Beach have got to go elsewhere.'",
        "'speaker_6': 'And so they're going to have to go elsewhere for at least another year. And so we need to open this door up. Take the chance. Open it up. It's working other places. We talked about getting information about patients, actual medical issues.'",
        "'speaker_6': 'City of Pasadena has a requirement on a research collective there that they collect that very information. When they when they put a patient into the system, they get that voluntary information which gets around HIPA laws if you volunteer it.'",
        "'speaker_6': 'So that's always a possibility. So we could make that part of the CFP process that there is a data collection process with the health department. Just a couple of suggestions. We said it was it was a pleasure to serve on the Medical Cannabis Task Force.'",
        "'speaker_6': 'And I hope that I hope that we get this push forward. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. And the last person in line. Raise your hand. That gentleman is the last speaker. Speaker, this is closed. That's it. Yes, sir. We have about a 50 minutes of public comment. If everyone uses 30 minutes still.'",
        "'speaker_0': 'Yes, sir.'",
        "'speaker_12': 'Good evening. My name is Miguel Skee. I'm a resident.'",
        "'speaker_6': 'And voter in Long Beach living in the Wrigley area. And I would like.'",
        "'speaker_12': 'To read a letter that the Wrigley Association sent to our Honorable Mary.'",
        "'speaker_7': 'Garcia, Councilman Andrews and Councilman Durango.'",
        "'speaker_12': 'The Wrigley Association has voted to oppose the proposed ordinance pertaining to the lifting of the present ban on medical.'",
        "'speaker_6': 'Marijuana sales in Long Beach.'",
        "'speaker_12': 'Because the proposed.'",
        "'speaker_7': 'Language specifies allowing nine dispensaries citywide.'",
        "'speaker_12': 'And as such would allow all dispensaries to be established in a single council district.'",
        "'speaker_6': 'Or a single geographic area within the city. It is our desire.'",
        "'speaker_12': 'That this.'",
        "'speaker_6': 'Element in the language of the code be amended to specify no more than.'",
        "'speaker_12': 'One dispensary per council.'",
        "'speaker_6': 'District.'",
        "'speaker_12': 'Respectfully submitted the Wrigley Association. Thank you for your kind attention.'",
        "'speaker_0': 'Thank you, sir. And just that was and that was changed in the original motion. So what you just said is, is there in the original motion? Next speaker.'",
        "'speaker_6': 'Good evening. Council members and Mayor Robert Garcia, it's it is great to.'",
        "'speaker_7': 'See you all again. My name is Joe Sanchez. And I say all this with great pride. I love Long Beach. I live here all my life. I'm a senior Wilson High School, and I carry you chair for your leadership, Long Beach.'",
        "'speaker_7': 'I stand here today against but not completely against medical marijuana dispensaries. By telling you.'",
        "'speaker_6': 'By a little bit about myself.'",
        "'speaker_7': 'By informing you and the public about my experience as a high school student, and how I have seen how medical marijuana experiences have affected our schools and our youth. I'm friends with about half of the people in Long Beach, causing me to know many people of many different backgrounds and personalities.'",
        "'speaker_7': 'With this and some of the people I have came to socialize with, such as friends and acquaintances. Have told me about their use of marijuana. Led them to skip school or come late to school. Because they want to smoke.'",
        "'speaker_7': 'Just this past Friday, I was getting ready to come to city hall for a class they would leadership on bitch causing me to have an excuse absence at school. Well I was getting ready. I looked out the window and I see three students.'",
        "'speaker_7': 'One of them who I mean, when you skipped school because they decided to go smoke marijuana. Since my freshman year, I came to learn from all the U.S. students on how most of the students at our schools come to acquire most of the marijuana and marijuana products, most of which the product name were related to Bob Marley'",
        "'speaker_7': 'or for 20. And I came to know that most of the providers I've heard of were owners, workers and people that have means of acquiring marijuana for medical marijuana dispensaries such as medical marijuana dispensaries. However, I agree with Councilwoman Susie Price with how delivery with delivery systems for these.'",
        "'speaker_7': 'For those who truly need this medication, although this has affected our you in the past, the present, and will affect our future.'",
        "'speaker_6': 'For our youth as our our future. So please take in.'",
        "'speaker_7': 'Consideration when making your decision. Thank you for your time.'",
        "'speaker_6': 'And have a lovely night.'",
        "'speaker_0': 'Thank you. I thank you for doing Youth Leadership Long Beach. It's a great program. Next speaker.'",
        "'speaker_7': 'My name is Brett Johnson, born and raised in the Fort District. Thank you, councilman or councilman and mayor. I just have a couple quick questions to address. The original proposal and the second, how can you calculate an accurate revenue number and city police expenses based on only for delivery services?'",
        "'speaker_7': 'How can you calculate accurate sales numbers that provide city tax revenue from a mobile delivery operation? How can policing be applied with adequate supervision to the safety of delivery service drivers and its patients at home without a brick and mortar location?'",
        "'speaker_7': 'Where would these delivery service store drones and distributors based on a delivery service and how would they be safe without a storefront? How would you award these delivery service licenses on a fair basis without established brick and mortar locations?'",
        "'speaker_7': 'How would city police? Rogue operations differentiate than they do currently. How many rogue operations have been identified and closed since the last numbers released in 2014? What examples of working brick and mortar locations in other cities are you basing tax revenue number estimates with the estimated year lead time?'",
        "'speaker_7': 'What consideration is there from the city to potential dispensary operators paying rent or fees towards locations without an approval from the city? Given location requirement for acquiring a license. How is this structure cost efficient and pro-business to any potential operators?'",
        "'speaker_7': 'How are these? How are these current proposal changes cost efficient to the city in regards to previously spent funds developing the current program? I feel an extensive amount of time and effort and city funds have been put forth towards the current plan.'",
        "'speaker_7': 'The best way for the city to streamline in receiving tax revenue is to implement the current developed plan. And just to kind of give you a relative number based on 2013, 2014. In Denver, they've actually had a 6.9% reduced rate in nonviolent crimes since they've approved their recreational facilities and medical marijuana dispensaries.'",
        "'speaker_7': 'And there are only 100,000 more than we are roughly here in Long Beach. So just some things to think about. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Hi. My name's Stephanie Morris. And so I'm a attorney and former city employee.'",
        "'speaker_9': 'I'm going to go and discuss specifically section of page 41, section Q of this ordinance, it's the.'",
        "'speaker_7': 'Extract ban. There is a host of reasons why this is a particularly bad one, so I'm going to go as.'",
        "'speaker_9': 'Fast as possible on them. The first is the economic argument. By not providing any.'",
        "'speaker_7': 'Regulations, just banning extracts per say, you are at best forcing these businesses. The meeting that the other cities are going to be getting.'",
        "'speaker_9': 'Revenue from it. We are all aware of that.'",
        "'speaker_7': 'And at worst we're going.'",
        "'speaker_9': 'To be encouraging more black market concentrate making, which resulted in a rather large house fire in Belmont Shores recently. Today, however, today we.'",
        "'speaker_7': 'Know that we have licensed both nonvolatile and volatile solvents at the.'",
        "'speaker_9': 'State level. We have chemists and we have professionals who are now.'",
        "'speaker_7': 'Making these making these these.'",
        "'speaker_9': 'Essential oils and every other type of extract you could possibly imagine. Secondly, the public health argument.'",
        "'speaker_7': 'The black market.'",
        "'speaker_9': 'Extractors are not going to have any reasons to abide by OSHA standards.'",
        "'speaker_7': 'Unlike the newly sued the newly created to.'",
        "'speaker_6': 'State licenses. By excluding these these particular.'",
        "'speaker_9': 'Manufacturers from the market.'",
        "'speaker_7': 'Entirely under your ban, again, you're going to be forcing this sort of production either to other cities, meaning more.'",
        "'speaker_9': 'Revenue to them or to the black market. Banning extract encourages unsafe consumption.'",
        "'speaker_7': 'Methods as well. The safest way to consume medical.'",
        "'speaker_9': 'Cannabis is either in an edible format or three vaporized.'",
        "'speaker_7': 'Particular vaporized oil.'",
        "'speaker_9': 'I have an example of one right here that I that that I use. This is not something you can.'",
        "'speaker_7': 'Easily get high off of. I have tried.'",
        "'speaker_9': 'This is something akin to a morphine. To a morphine pump, if you want to think about it, providing a small dose titrated amount.'",
        "'speaker_7': 'To two patients who are experiencing severe pain but at the same time do not want to be intoxicated and incapable of performing their jobs. Additionally, you would be banning topicals entirely non psychoactive substances that would be applied to the skin and help people in extreme pain.'",
        "'speaker_7': 'Alice Huffman of the NAACP.'",
        "'speaker_9': 'Is is helping aid is support it and uses a product very similar to this.'",
        "'speaker_6': 'For her for her particular ailments. So then we get to a.'",
        "'speaker_9': 'Product liability issue by again, not providing the subject.'",
        "'speaker_6': 'The proper regulation.'",
        "'speaker_7': 'For this particular subject. One of the most popular substances on in this market you're going to be making. You're going to be guaranteeing that any customers for it, if they suffer from a product liability issue related to the concentrates, are not going to have any means for recovery at the tort level.'",
        "'speaker_7': 'You're going to be here again putting people in danger.'",
        "'speaker_9': 'Lastly, this is also an issue of discrimination. People who choose.'",
        "'speaker_7': 'To medicate in this particular way are usually from.'",
        "'speaker_9': 'Protected classes. These are people who are already suffering ailments or would be classified.'",
        "'speaker_7': 'Under the Americans, the Americans with Disabilities Act by denying them their medicine of choice.'",
        "'speaker_0': 'You're going to be forcing them on to.'",
        "'speaker_7': 'Pharmaceuticals, which again, debilitate them and deprive them of their ability to live. This is inviting litigation at the civil level. They can have a good day.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening, Mayor Garcia and Council. My name is Lauren Mendelsohn. I am a resident of the third district. I am also a law student right now. And I have just a few assorted thoughts. First of all, I am a medical marijuana patient.'",
        "'speaker_5': 'I moved across the country from New Jersey to come to California so that I could legally medicate because I do not feel that I'm a criminal and I wanted to do it legally. I also am on a full ride to law school and I was able to achieve that while smoking cannabis every single day.'",
        "'speaker_5': 'So just in response to people who say it makes you lazy and don't go to school, that is completely false. Some people have motivation to do things. Some people don't. And whether or not you smoke marijuana will not change that.'",
        "'speaker_5': 'If anything, it's motivated me to go to law school. Ed In regards to Councilwoman Price's alternate motion. A few thoughts that would, you know, allow fewer operators, only seven total as opposed to nine. So you're limiting the amount of people who have opportunity.'",
        "'speaker_5': 'Also, just in general, there's all this talk of rogue dispensaries and how we have to tackle that problem before we have to go forward with legal dispensaries. I don't I don't think that's true. I mean, I think rogue dispensaries are always going to be a problem whether or not you have legal facilities.'",
        "'speaker_5': 'And I don't think that you should hold off on allowing potentially good operators to function in a legal environment just because there were bad actors in the past. And, you know, I also in regards to the comments warning earlier about a lot of people getting delivery.'",
        "'speaker_5': 'That's not always the case. As a patient, I can tell you I prefer to go to a storefront when you order delivery, you don't know what you're getting. It could be some stuff that you don't see the quality testing versus going to a store.'",
        "'speaker_5': 'You can have the opportunity. You shouldn't force these customers to do something that no other customer wants to do. Buyer of any other product can go to a store and choose what they want. You shouldn't make these customers treat them any differently.'",
        "'speaker_5': 'And I also just wanted to caution against the statements someone earlier made about cannabis causing cancer. The science there is really unclear as to whether it causes or whether it doesn't cause it. Studies have actually shown tumor reduction with cannabis treatment.'",
        "'speaker_5': 'So just don't just, you know, don't don't take that at its face, do your own research and do the science of these things. And I hope that Long Beach can serve as a model for other cities in the area and that we can move forward with progressive ordinance.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Hello. Jeff Abrams, one Love Beach Club. Thank you so very much for pushing the ball forward. All of you. I really have to congratulate you. It is hard work, but the fact of the matter is that we have someone very close to us, county of Los Angeles, to just look to what's happening there.'",
        "'speaker_6': 'And I just don't read daily all the problems that seem to be in our minds here. I don't see anything happening in Colorado that's significant. And page one, I don't see anything happening in Lost in Los Angeles, page one.'",
        "'speaker_6': 'But I do have a couple of comments, if I may. Mayor, particularly in this talk about the delivery services that are available right now. If we're talking about codifying for and putting those as the legal, what do we do about the other 36 or more that we don't even know about?'",
        "'speaker_6': 'How do we collect taxes from them? Isn't that somewhat discriminatory? But also, I think, Councilman Richardson, you might have talked last time that I heard about Wal-Mart, hesitation about dispensaries being. I just don't think you understand the numbers involved in in Long Beach.'",
        "'speaker_6': 'It's way more than you think, way more. And I can tell you that with a certain amount of certainty. But if you would, let me just ask you that. When you have a harborside, you all know that name Harborside, 110,000 patients or more in Oakland, California, 110,000 single location.'",
        "'speaker_6': 'You are creating a self-fulfilling police centric policy because you will have lines out the store. Therefore, public nuisance. Therefore, police call there for enforcement efforts. And we've kind of gone backwards. So please, if you would, let's think about that Wal-Mart position.'",
        "'speaker_6': 'The rogue operations will cease immediately if Chief Luna assigns one patrolmen to stand outside of a rogue dispensary. How much does that cost? I estimated the cost. The city about 30,000 bucks a year, not 5.9 million, and all these millions of dollars.'",
        "'speaker_6': 'One cop in front of us, in front of a storefront will prohibit anybody from coming in there. Guaranteed. So I keep hearing comments at the behind the dais here, about a 10% tax. I was under the impression it was a 6% medical marijuana tax.'",
        "'speaker_6': 'Am I wrong? 6%, not 10%, because I heard 10% a couple of times being talked about. And lastly, I believe as I read through the ordinance, it does speak about banking. And as you know, please review that language in the proposed ordinance because it conflicts with the actual federal banking regulations.'",
        "'speaker_6': 'Right now, we cannot write you a check. We would like to write you a check, but we can't even bank at a significant bank. What I have proposed earlier is that we bank with your bank, city of Long Beach Bank.'",
        "'speaker_6': 'That way it can be very well identified. Cash in, cash out. Once again, I thank you so very much for pushing the ball forward.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_6': 'Thank you. My name is Libra. And the Park Estates Homeowner's Association representative and also the East Anaheim Street Business Alliance president. We have 500 businesses in our neighborhood. We have 600 residents. And there's a lot of statistics that I could give you.'",
        "'speaker_6': 'There's a lot of statistics that have been given. The fact of the matter is, I'm not against pot and people are using it. What I am against is people and dispensaries going to dispensaries. First of all, I'm really nervous being up here no matter how much I'm in charge of you guys are used to it.'",
        "'speaker_6': 'But if the biggest issue is that it's against the law and federal and federal law and that being the case. There's a lot of cash involved. There's a lot of cash that can't be used correctly. And that creates danger.'",
        "'speaker_6': 'And the danger, no matter what the statistics are, there is a fact of 6.9% nonviolent crime. What if one person is killed because somebody breaks into a pot place and it's been done with messengers. It's been done in other places.'",
        "'speaker_6': 'Colorado might not have an issue with it. Washington might not have an issue with it. But if it was your sister or brother. Or your cousin. It doesn't matter what the statistics are. One person killed is too much and the federal law prohibits it.'",
        "'speaker_6': 'I don't as long term, I don't know why this is being pushed. To go forward when there's so many problems that it can cut, then it can cause. And I don't bear anybody, any ill will to promote this.'",
        "'speaker_6': 'But it's dangerous and it can cause a problem. It can cause one problem for many people or many problems for for many other people. Thanks for your time.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_6': 'Sam Sams.'",
        "'speaker_7': 'As our first of all, the war on drugs is racist, and anybody advocating for a prohibition policies, especially from a prosecutorial position, is advocating for a racist war on drugs. The war on drugs has decimated many communities. Those communities.'",
        "'speaker_3': 'That have been.'",
        "'speaker_7': 'Destroyed, those families lives that have been destroyed, they know that the war on drugs does to them. They know what prosecuting and promulgating war on drugs does to the individual. And that's far more dangerous than the cannabis plant.'",
        "'speaker_7': 'Now, you guys have done a very good job trying to get us to this point. And I want to encourage you to look at another permitting mechanism or to like laboratory testing, for example. We'd love to help bring in laboratory testing facilities to ensure the quality of cannabis meets the standards for respect best practices, best manufacture, manufacturing'",
        "'speaker_7': 'practices, agricultural practices and laboratory tests in the city. You guys could offer permits for and get some more revenues for if you're looking for revenues from permitting the permitting process. From that same position, if you're looking for increasing revenues, offer us a manufacturing permit.'",
        "'speaker_7': 'We can't offer patients concentrates in any form and topical and non smokable and sublingual and all of the various forms of non smokable, including non psychoactive cannabis. None of that can be offered by our own facilities, with our own strains that we would grow if we don't have a manufacturing license, that we can show that we're following'",
        "'speaker_7': 'the best manufacturing practices, good manufacturing practices. So I'd like to encourage you to expand and zoom out from your approach, what you're trying to do so that we can find a solution at keeping drugs out of the hands of people who should not have them, and keeping lifesaving medicine in the hands of people who need it.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Hey.'",
        "'speaker_8': 'Thank you, Sean Donohoe. I have some questions as well regarding the revenue calculations and the consultant that was hired, 800 active accounts. And I'm not quite sure what sort of a consultant is out there that has access to all of these accounts.'",
        "'speaker_8': 'And in any event, it would seem that the tax revenue calculations that are based for sort of the pan pay out don't take into account new newly available licenses to be issued that were not available prior to the passage of the Medical Marijuana Regulation and Safety Act at the state level.'",
        "'speaker_8': 'I know the state level really well. I worked for the California Cannabis Industry Association, presently local advisor to the California Growers Association, also assisting Ms.. Hoffman of California, Hawaii and ACP on many of the the task force issues that they're appearing over.'",
        "'speaker_8': 'I absolutely also agree with the on the problem with banning concentrates. One of the most used cannabinoid therapies is for children with epilepsy, intractable epilepsy. I don't think anybody is advocating causing those parents to put a joint in those kids mouths.'",
        "'speaker_8': 'But in effect, that's what you're doing here in furthering the the idea of creating manufacturing as well as distributor as well as other licenses. I see within the draft ordinance that it calls for a state permit to be held.'",
        "'speaker_8': 'Those state permits will not exist for two years. You need a local permit to acquire the state permit. So there's a catch 22 that's been created. I think I also commend moving forward on the dispensary, on the retail front.'",
        "'speaker_8': 'What we're doing in the city of Oakland, where I'm sort of appointed by the council president on our Cannabis Regulatory Commission, we've summed up frankly all that which is retail belongs in one ordinance. Anything that that is non-retail in nature up the supply chain, the distributor, the cultivator, the manufacturer, the accredited testing laboratory.'",
        "'speaker_9': 'It doesn't seem that that has the same.'",
        "'speaker_8': 'Sort of deleterious impact that that I've witnessed over the last two years being discussed much of what's been discussed, be they child care facilities, K-12. Um, and obviously the, the, the human trafficking corridors, those all seem to be a matter relating to public visiting these facilities.'",
        "'speaker_9': 'But if a medical marijuana.'",
        "'speaker_8': 'Facility, medical marijuana business is a facility that's not visited by the public at large, I'm not sure why all those sensitive use distance requirements are necessary. Again, the state requirement is only 600 feet from a K-12. I think a simple amendment would be would be possible if you made.'",
        "'speaker_9': 'That nine only only apply to retail locations. Frankly, that seems.'",
        "'speaker_8': 'To be after observing for the last two years where most of the concern has been about having a retail location.'",
        "'speaker_9': 'In your in your district, etc..'",
        "'speaker_8': 'So I would simply recommend deleting in all due course the ban on concentrate as well as applying the the restriction of nine sirups only to medical marijuana businesses engaged in retail.'",
        "'speaker_0': 'Thank you, sir. Next speaker.'",
        "'speaker_6': 'Please.'",
        "'speaker_4': 'Shirley B'stard I address you as senior consultant, pastor for Swarm Group and Associates. I may be representing a host of other pastors who have failed to show up tonight, even though they showed up to light that Christmas tree and menorah Hanukkah candles last night.'",
        "'speaker_4': 'They failed to realize that the war that they were fighting was tonight. The Scriptures say the fear of the Lord is the beginning of wisdom. My father was 51 when I was born, and when I started being disciplined, the first law he laid down is I am the law of the House.'",
        "'speaker_4': 'I entered my adult life that way so that when the God of Israel asked me to work for work for the homeless, it was not what I want to do. It is God, what do you want me to do?'",
        "'speaker_4': 'And I'm following suit to that with that tonight at 55 age of 55. So Mr. Price, you said something regarding financial prudence and I commend you on your your got one to call it a dissertation but I had to make a note and say, what about spirit of prudence?'",
        "'speaker_4': 'Now I understand that not everybody has the same faith. I understand that. But to those of us who celebrate in December 25th, we have an obligation tonight. What are we standing for here? What are we still? What? One of the one of the movies I used to teach is New Jack City Rent, that it's time to pull'",
        "'speaker_4': 'it back out. And then you might want to get a point of no return. You might want to look at those two movies. And if the police can't handle your rogue operations, you've got a serious problem going on.'",
        "'speaker_4': 'Why am I here tonight? Because I heard that the pipe, the sewer pipe leaks started, the gas line lid started to blow off. Right. Then I said, Oh, it started when God gets ready to judge a city, when he gets ready to judge a nation, when he gets ready to judge a town or a person.'",
        "'speaker_4': 'He has to give them due, due process of warning. And he will give you a warning when you're overstepping a line that you should not overstep. I don't know who's voting. How you're voting tonight. I called Mr. Austin the office.'",
        "'speaker_4': 'I called Mr. Price's office, and I wanted to know. And I called someone else's office, and I wanted to know why they voted the way they voted. I believe that you should not move so fast just for financial consideration here.'",
        "'speaker_4': 'This city is not starving for money. And at the point you start making money off of marijuana and you put alcohol then and I'm not knocking it. I'm just saying at some point God is going to say enough and this stuff is going to start happening and you won't be able to explain why it's happening.'",
        "'speaker_4': 'I can. I serve this as a warning. Yes, I am.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'We must obey God's laws.'",
        "'speaker_0': 'Thank you. Next speaker, please. These are our last speakers. And we're going back to the council.'",
        "'speaker_6': 'City Council. Thanks for having me. My name is Chuck Brewer. I'm from the ninth District, and I've been here almost my entire adult life. Hmm. Interesting. You've had a couple of issues. Airport, El Nino, and all deals with quality of life and preparedness.'",
        "'speaker_6': 'I have to compliment Councilman Price. I think you've come up with a very good. Amendment. The current bill that was they came out with 45 pages of nuisances alone, says there's a problem. When I hear that. We could be so far away from a school district or from a resort 1500 feet away from a high school.'",
        "'speaker_6': 'But a thousand feet for a junior high. What does that mean? The junior hires don't have to walk so far. I mean, come on. Why do we have all these nuisances? Why do we have these issues? I am a firm believer in the strength of medical marijuana.'",
        "'speaker_6': 'Under the tone of medical marijuana. Why are we eliminating this nuisance to be away from? Child cares. I don't understand that. Does it make sense to me? I'm going to say child care. Little ones should be exposed to it.'",
        "'speaker_6': 'But the high school kids only 1500 feet away. The whole thing just doesn't make sense to me. Sort of. My councilwoman, I would say. Stacey, please go ahead. Support this amendment. Under the basis that it is serving those who have medical needs.'",
        "'speaker_6': 'Tell us about Orson. I'm going to leave you with just a small story. I am a realtor. I travel this entire city and more cities. Lakewood. Does not have this. They've banned it. I think they're pretty smart about it.'",
        "'speaker_6': 'But in your council, I had a piece of property that I was representing. And in it, it was a commercial piece that was prime for the for a dispensary. I received three phone calls as the agent regarding could we.'",
        "'speaker_6': 'And use this as a dispensary. We will pay extra for it. They they saw dollars. And in the runners, it wasn't for medical needs. It was for recreation. Because I said, well, I'll tell you what, I'll take it to the owner.'",
        "'speaker_6': 'He's an ex-cop, retired cop. You know what I heard at the end of the line? Click. They have no desire to do anything but look towards us as a recreational piece. I don't think we need that in our city.'",
        "'speaker_6': 'I think we need to take care of those who need it for medical purposes. I'm a firm believer the delivery plate is good. So here's my final thought. We have four police stations. Let's put it next to each one of those stations and for those people who do not want it in their district.'",
        "'speaker_6': 'Put it put your vote to your district to the next election. Do you want it in our district? And if District nine says no, Stacey, you know how to vote.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_6': 'Thank you. Next speaker. Hi. My name is Scott Montgomery from District five. Real short. I think mispriced your proposal is wonderful. It's not exactly what I want. I'm going the other way. But I think it's a it's the right step to start.'",
        "'speaker_6': 'Let's follow through to do the due diligence, check the money, check the flow, check the records, do all of that. Stacey, please support it. Thank you.'",
        "'speaker_0': 'Final speaker.'",
        "'speaker_7': 'Good evening, honorable mayors, city council and various city departments. We appreciate the City Council's thoughtful deliberation on the topic of medical cannabis and the opportunity to collaborate with the city to create a fair and balanced regulation. Since the ban went into effect in August of 2012, we have organized on behalf of the qualified patients, stakeholders and voters'",
        "'speaker_7': 'to advocate for safe access. After three years of study sessions and debate. We are thankful that the idea of finalizing an ordinance is finally here, being reviewed and hopefully approved tonight. This is a win for patients and the community as a whole as we look back in the rearview mirror in a few years from today.'",
        "'speaker_7': 'The ordinance in front of the city council has a fundamental flaw and direction, and I don't believe it's from the study sessions conducted or the long debates, but only from the ideology and stigma that is associated with marijuana.'",
        "'speaker_7': 'Not in my backyard. We need to protect the children. We need to protect the community from marijuana. The stigma and ideology is exactly what is keeping a good, balanced policy to be established, which will actually protect the community and the youth.'",
        "'speaker_7': 'Trying to keep this issue in the closet or turning a blind eye to best practices is wrong. We have patients and veterans demanding access to cannabis. We have hundreds of good paying jobs at risk. Tax revenues that have been understated.'",
        "'speaker_7': 'A black market, which is the true public safety issue at hand. Minority groups being jailed and kept from basic rights like applying for a job. Lastly, thousands of voters that are tired of the failed war on marijuana spending, millions of much needed tax dollars on enforcement and courts.'",
        "'speaker_7': 'The state legislation has implemented a robust system to regulate. Let's do the same here in Long Beach. In regards to Councilmember Price's motion, completely appreciate the tolerance regarding.'",
        "'speaker_6': 'Um.'",
        "'speaker_7': 'You know, deliveries. But in all the reality, it will not be able to captured.'",
        "'speaker_6': 'The.'",
        "'speaker_7': 'Market because it's happening every single day here with these deliveries. And it's not being regulated and it's not being tax rights, and it won't even begin to capture the legal markets. With that being said, Please supports the main motion in Vice Mayor Leo Anthony's motion and hopefully review that nine will be in place.'",
        "'speaker_7': 'And if it does turn out that it's a nuisance because the supply does not meet the demand. Please be swift in reviewing you guys as policy. Thank you very much, guys.'",
        "'speaker_0': 'Thank you. And I want to thank everyone that spoke on this issue from all sides. Important issue that the council's been discussing. Take this back to the council where we have a substitute motion on the floor which will take a vote on first.'",
        "'speaker_0': 'Which Councilwoman Price. This is Councilman Price's motion, which he described right before public comment. And so that is that is the motion that's on the floor. And so there's no other comment, which I don't see. We're going to go and take a vote on that motion and.'",
        "'speaker_11': 'Make it a point of clarification. Yes, sir. On that, we have the cultivation component in that piece already.'",
        "'speaker_5': 'Channing is that it was your amendment that we adopt the cultivation regulations so that if we adopt regulation in the future, those regulations would carry the day in terms of those businesses.'",
        "'speaker_12': 'Great.'",
        "'speaker_0': 'Okay. So we're going to go ahead. You have a question, please, Councilman.'",
        "'speaker_9': 'Just quickly. What are the zoning requirements on this motion? Where could those four? Where can they be located? Councilmember the four. The four in the motion. Where would they be located? Is there still a per district cap?'",
        "'speaker_5': 'Well, there's only four.'",
        "'speaker_9': 'I don't want four to land in the ninth district. Yeah. So is there still for the per district? Yeah.'",
        "'speaker_5': 'No more than one per district.'",
        "'speaker_9': 'Just clarify. Just clarify.'",
        "'speaker_0': 'Okay. There's a there's a motion and an a second on this motion. Members, please go and cast your votes on Councilman Price's motion.'",
        "'speaker_10': 'Motion carries.'",
        "'speaker_0': 'Okay. Motion carries. So that's. That's a councilman price motion. Motion carries. Thank you all for for coming out. And again, just just as a reminder, what's going to happen here is this this creates a ordinance that will come back to the council as soon as the city attorney is able to put the ordinance together for discussion and'",
        "'speaker_0': 'approval at that point, correct. Mr.. Mr.. Mays. Okay. Thank you. We're going to go and going to write right to the next item. Madam Clerk.'"
    ],
    "Implementation of the 6th District Trail of Infinite Hope.": [
        "'speaker_10': 'Item 12. Communication from Councilman Andrews. Councilwoman Gonzalez. Vice Mayor Lowenthal. Recommendation to request the city manager to direct staff to implement the Sixth District Trail of Infinite Hope.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Please go ahead, Mr. Andrews.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Let's just keep going. Guys, we just got. Please keep it down on the linguine.'",
        "'speaker_6': 'I think.'",
        "'speaker_7': 'You. Mayor, we have a we have created a very unique walking trail that will not only highlight the city of Long Beach, but focus on the central area as well.'",
        "'speaker_6': 'The walking path will identify unique landmarks within a six digit community. It is designed.'",
        "'speaker_7': 'To raise awareness of our community and to encourage others to keep hope alive. I will be calling the Sixth District Trail of Infinite Hope, which is named after one of Dr. Martin Luther King Jr. Famous quotes that reminds us that we can we can't accept disappointment, but we must never lose definite hope and hope.'",
        "'speaker_7': 'My friends, is what removed the blight at its core. To explain this item in more detail, I would like to ask my staff member, John Edmonds, to give a small presentation.'",
        "'speaker_6': 'Since he's down, probably eating. We will move on. Oh, here he is. I thought he was gone.'",
        "'speaker_1': 'Okay. Right.'",
        "'speaker_6': 'Okay. Sorry. No presentation. Would you smoke, please?'",
        "'speaker_1': 'Yes. Oh, yes. Yeah. Please.'",
        "'speaker_6': 'I'd like to move to approve this item, please.'",
        "'speaker_0': 'Is any public comment on the item? CNN members, please go and cast your vote. I'm sorry, but you're doing a presentation. No. No presentation. Okay. Members discussion. Cast your vote.'",
        "'speaker_10': 'Motion carries.'",
        "'speaker_0': 'Okay. Item number are we do item we're going to the a couple of the liquor licenses that they've been requests. So I, I think it's 15.'",
        "'speaker_10': 'Report from financial management. Recommendation to adopt resolution authorizing the formation of a Joint Powers Authority with the Housing Authority of Long Beach Citywide.'"
    ],
    "Alcoholic Beverage License Application for 4th and Olive Restaurant.": [
        "'speaker_0': 'Item 16, please.'",
        "'speaker_10': 'Report from police recommendation to receive and file the application for an olive restaurant for an original application of an ABC license at 743 East Fourth Street, District one.'",
        "'speaker_5': 'And I think, Commander LeBaron, if you have a staff report.'",
        "'speaker_6': 'Yes. Honorable Mayor and City Council.'",
        "'speaker_9': 'Item 16 is an.'",
        "'speaker_7': 'Application for a new on sale beer and wine ABC license for a.'",
        "'speaker_9': 'Restaurant. The police department is conducting our investigation.'",
        "'speaker_7': 'Do not anticipate any.'",
        "'speaker_9': 'Adverse impact with the issuance of the license. And that concludes my report.'",
        "'speaker_6': 'I'm available for any questions, if you have any.'",
        "'speaker_5': 'Great. Thank you. I appreciate that. I know that this the gentlemen are here from the establishment. And I want to thank you for your patience and and just sticking with us this whole night. I know it's been a crazy night, but I'm looking forward to seeing what this new establishment brings, especially for that corner, which, ironically enough'",
        "'speaker_5': ', was actually a dispensary. So now we have a brand new restaurant here, and it's we're very excited to bring that to the first district, but also the East Village. So. I'm sure the mayor will bring you up if you'd like to say a few words.'",
        "'speaker_5': 'Did you always want to say anything? Yeah. All right. Oh. All right.'",
        "'speaker_2': 'Thank you. There's been a motion in a second with no public comment. Members, cast your vote.'",
        "'speaker_10': 'Motion carries.'",
        "'speaker_2': 'Okay. Next item, please.'"
    ],
    "Alcoholic Beverage Control License Application for Donburi Cafe.": [
        "'speaker_10': 'Did you want to continue hearing the ABC licenses?'",
        "'speaker_2': 'Yes. Isn't that just 17?'",
        "'speaker_10': 'Any team.'",
        "'speaker_2': 'Any team? Yes.'",
        "'speaker_10': 'Please report from police recommendation to receive and file the application of Danbury Cafe for an original application of an ABC license at 245 Pine Avenue, Suite 120, District two.'",
        "'speaker_2': 'We have a second, please. Thank you. Thank you, Madam Clerk. I'd like to make the motion to receive and file the application. I'm sorry. Commander, would you like to address the issue?'",
        "'speaker_0': 'I'm sorry, Vice Mayor, can you repeat that?'",
        "'speaker_2': 'Did you did you have a staff report?'",
        "'speaker_7': 'I'm happy to.'",
        "'speaker_6': 'Let you know what the staff report is. It is an application for a new on sale, beer and wine, ABC.'",
        "'speaker_9': 'License for a restaurant. Once again, we've conducted our investigation and.'",
        "'speaker_6': 'Do not anticipate any adverse impact of the issuance of this license.'",
        "'speaker_2': 'Thank you. I appreciate that. I didn't mean to get ahead of you with the motion. So there's the motion in a second. So any member of the public that wishes to address council and council members you have the motion is to receive and file the application of the cafe for an original ABC with conditions that have been'",
        "'speaker_2': 'placed before you. So our staff cast out the conditions. And with that, I look forward to your support. Cast your vote, please.'",
        "'speaker_10': 'Councilwoman Price. Motion carries.'"
    ],
    "Alcoholic Beverage License Application for Independent Cider House.": [
        "'speaker_2': 'Thank you. Item 18.'",
        "'speaker_10': 'Report from police recommendation to receive and file the application of Independent Cider House for an original application of an ABC license at 601 East Broadway district to.'",
        "'speaker_2': 'Thank you. And Commander, is there any out of the ordinary items in the staff report for this one?'",
        "'speaker_6': 'No. Vice Mayor. It would be equal to my last report.'",
        "'speaker_2': 'Thank you. So I'd like to make the motion to receive and file the application of independent Cider House for an original ABC control license with conditions that are that have been placed before each council member. Is there any member of the public that wishes to address the Council on this item?'",
        "'speaker_2': 'Please come forward.'",
        "'speaker_6': 'Council. I'm Otto Rucker. I'm a resident of District eight. I got so many bras. It's good to see you again. And I'm a co-owner of the Independent Cider House. It's going to be a nice little gastropub. We're both experienced operators who have done this all before, and we look forward to the results of your vote.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_2': 'Thank you. Members, cast your vote.'",
        "'speaker_10': 'Councilwoman Munger. Motion carries.'",
        "'speaker_2': 'Okay. Our next item.'"
    ],
    "Construction of Above-Ground Storage Tank Fuel Site at West Police Substation.": [
        "'speaker_10': 'Do you want to go back to item 14? Yes. Report from Financial Management Recommendation to award a contract to Fleming Environmental for the construction of an above ground storage tank field site at the West Police substation. For a total contract amount not to exceed $708,000.'",
        "'speaker_10': 'District seven.'",
        "'speaker_2': 'Can we have a second, sir? Thank you. Is there a staff report.'",
        "'speaker_7': 'Please? Manager Dan Berlin.'",
        "'speaker_6': 'Good evening, Mayor Garcia and members of council. This project is to award a contract for the replacement of an underground fuel storage tank at the West Santa Fe Avenue substation with an aboveground tank and system. The tank is due for a replacement based on its age and condition.'",
        "'speaker_6': 'The project includes associated piping, fuel dispensers, alarm and monitoring equipment. The Fleet Services Bureau manages the fuel program for city vehicles, which includes both U.S. cities, which are underground storage tanks, as well as aboveground storage tanks or Estes.'",
        "'speaker_6': 'Whenever possible, we seek to replace a USB system with an AC to use. These are less expensive to build and to operate due to their simpler design. There are also less regulated in the case of West PD. We work closely with the police department to ensure the tank would meet their needs in terms of size, location and'",
        "'speaker_6': 'functionality. This tank will be a larger tank to allow for emergency storage of fuel in this part of town. 3000 gallons larger. And it provides unleaded fuel through four dispensers and nozzles available for use. 24 seven. The system is due for replacement this year under our Schedule Tank Infrastructure program and also is only 50% operational currently due'",
        "'speaker_6': 'to a piping problem that cannot be repaired and must be replaced. The Tank infrastructure program is funded through regular collection of funds from city departments using fuel for their vehicles. Funds are available in Fleet Sub Fund for fuel system capital improvements.'",
        "'speaker_6': 'That concludes my presentation. I'm available to answer questions.'",
        "'speaker_0': 'Any public comment on the item? CNN. Please cast your votes.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_10': 'Motion carries.'"
    ]
}