{
    "Agreement with CSULB Foundation for Workforce Development Classes.": [
        "'speaker_0': '. And so I want to I know that President Connolly is already past her time, that she's supposed to be heading out to a next meeting at the university. So, Madam Clerk, if you could please read item 27, please.'",
        "'speaker_1': 'Report from Economic Development Recommendation to authorize the city manager to enter into an agreement with California State University of Long Beach Foundation in an amount not to exceed 1 million. District one.'",
        "'speaker_0': 'Great. Thank you. I'm going to give up before we go into the staff report. I'm going to go out and give some opening comments and then I'll turn this over to Mr. West and another councilman. Gonzales also will have some comments, comments as well.'",
        "'speaker_0': 'I want to just say that I think there's no there's no question that one of the best things we have in this entire city is our university. And Long Beach State is a very, very special place. And we are so fortunate in our city to have a university with the students, the faculty resources that we have, one'",
        "'speaker_0': 'of our faculty members here in the front row, in the front row who does amazing work and so many resources in in the staff and in everyone that works at the university. And so we're lucky with the economic impact that's being made.'",
        "'speaker_0': 'There has been a proposal that the city and the university have been working on for the last couple of years, and that has been to bring the university to downtown Long Beach. And as we know, when universities go to downtowns, the downtowns thrive and the students also open themselves up to incredible opportunities and experiences.'",
        "'speaker_0': 'This has been a proposal that has many parts. One large piece of it is actually bringing faculty, classrooms and teachers and students to the downtown to learn. And there is also a phase that we're talking about that also includes student housing and faculty housing that is affordable and accessible for our students and faculty to also be here'",
        "'speaker_0': 'in the downtown tonight. What we have in front of us is incredible work that's happened between the university and the city as it relates to the classrooms and the educational component. It's a huge, huge step forward, one that everyone should be proud of.'",
        "'speaker_0': 'I have to really thank Councilwoman Gonzalez and her staff for being incredibly supportive and shepherding this deal through the process and really to the work that staff has done and the university to get us here today. So with that, I want to turn this over to staffer one for a minute.'",
        "'speaker_0': 'They're going to do a presentation on this, and then I'm going to over to President Connolly.'",
        "'speaker_2': 'Mr. West. Economic Development John Keisler and our workforce director, Nick Shultz.'",
        "'speaker_9': 'So good evening, Honorable Mayor and members of the Council. The purpose of the recommendation and proposed grant funding tonight is to engage with California State University, Long Beach College of Professional and International Education, CPA to deliver a best offering of classes closer to the city's professional employment center on the city's West Side and downtown business district.'",
        "'speaker_9': 'The downtown location of university classrooms adjacent to the Metro Blue Line will also provide a more convenient university access to the city's central and north Long Beach residents. The proposed ten year agreement of $1 million to the California State University Long Beach Foundation will provide the university with a portion of the resources necessary to establish 16 classroom'",
        "'speaker_9': 'classrooms, with an estimated 25 C each, 400 total seats to deliver CPE continuing education programs to advance the careers of current professionals and to provide additional space for classes provided at its main campus. That will conclude my staff report, and I'm available to answer any additional questions you may have with regards to the agreement.'",
        "'speaker_0': 'Thank you, Mr. Schultz. This time I'm going to have President Connally make a few comments, and then I'm to turn this over to Councilman Gonzales.'",
        "'speaker_5': 'Thank you, honorable mayor and council members. I'm delighted to be here today to speak in favor of this item. And thank you very much for presenting it. It gives us a chance to deepen our partnership with the City of Long Beach and really be part of the economic and cultural development of the downtown area.'",
        "'speaker_5': 'As already mentioned, this is a three phase project. The first phase will be educational. We'll be offering programs such as Human Resource Management Certificate, Emergency Medical Technician, Event Planning Certificate, Cybersecurity, an I.T. program, health science degree completion program, public safety, for example, criminology, social work degree completion programs, and a psychology degree completion program just as initial offerings'",
        "'speaker_5': 'that we've found from serving here would be popular. The second phase will be to establish an innovation center that we feel will spur innovation and entrepreneurship in this city. And the third phase that we're very excited about is to create faculty, staff and student housing that is currently conceptualized as 800, bringing 800 individuals in this in this'",
        "'speaker_5': 'third phase to the downtown area. So thanks for the chance to deepen the partnership. We're fully committed to the development of downtown and really want to be part of it.'",
        "'speaker_0': 'Thank you, President Connelly. And I'm going to turn this over to Councilwoman Gonzalez.'",
        "'speaker_4': 'I just want to say thank you to city staff of Nick and John and, of course, President Connelly. I know this is going to be a great addition to downtown now. This will be one of two innovation centers, the other which will be on third and pine, which will be lovingly called the Sean the McKee Innovation Center'",
        "'speaker_4': 'and connected with Long Beach City College and Blink Spaces. And now we have Cal State, Long Beach and IT services in criminal justice and cybersecurity. I would have never thought ten years ago that we would ever have two innovation centers with both of our academic institutions in downtown.'",
        "'speaker_4': 'And this is very, very exciting. You know, when we were away on behalf of the city, we talked about the patent office, that we have opportunities as well to talk about with in collaboration with Cal State, Long Beach.'",
        "'speaker_4': 'Currently, we have about 300 patents in the city and about a bulk of those are health sciences. So thinking about biotech and other sort of technology areas that we can flourish not only at the at the university but in downtown and creating and research and development is going to be a really exciting element for the area.'",
        "'speaker_4': 'So thank you again, everybody. And I know Tony Shoshoni is here as well, who has been a great part of this. And we look forward to this evolving. And I'm 100% behind you. So thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Councilmember Durango.'",
        "'speaker_2': 'Thank you, Barry. And I want to thank President Connelly for being here today and for allowing us to participate with you. And I hope that we can take credit for this with the college promise that the city of Long Beach also went into into an agreement with the City College, Islamic State and the Long Beach Unified School'",
        "'speaker_2': 'District. And this is a great example of how college projects can and can really do great benefit and great work out the committee. Thank you.'",
        "'speaker_0': 'Absolutely. Thank you. Councilmember Pierce.'",
        "'speaker_6': 'Yes. I, too, want to applaud everybody's efforts for coming together on this. You know, Councilmember Gonzalez did mention. But I think it's your ten year anniversary, Cal State, Long Beach. Yes, mine, too. So it's been ten years this year since I graduated from Cal State, my college before Cal State was the University of Houston, which had another'",
        "'speaker_6': 'downtown location. And that really changed the downtown in Houston. And so I think bringing science together, technology innovation together, where you feel that energy around you is really important and really critical. And I know with our new main library that there also be some synergy there.'",
        "'speaker_6': 'And so I'm just happy to see our city working and thinking outside the box to really change the dynamics. So thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Mongeau.'",
        "'speaker_10': 'Just a big congratulations to Long Beach State and our team for working on this every week. I am so impressed of the opportunities that are coming to Long Beach and what great things we can do when we all work together.'",
        "'speaker_0': 'Thank you, Councilor Richardson.'",
        "'speaker_8': 'I think you're right, Councilwoman Mango. It's like every week there's something amazing coming. This is a great move for for downtown. And I got to say, you know, there's multiple efforts in town and I'm learning more about the benefits when you get college off of campus and into the communities, all the exponential benefits that happen in those'",
        "'speaker_8': 'communities. So I'm excited to see that happen in the downtown. There's other conversations in Uptown, but in general, I'm really supportive of this effort. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Vice Mayor Andrews.'",
        "'speaker_2': 'Yes, thank you. And Doctor, I just want to let you know, these kids talk to my teen years. It will be my 35th. But with that, if programs like this, I think I would have still been there. Thank you very much for bringing us together.'",
        "'speaker_0': 'Yes, thank you. And before I go to comment, let me just also say that Councilmember Pearce's right when when the Arizona State University moved into Phenix and began opening classrooms, it just dramatically changed affordability, student access to affordable housing, the opportunity for faculty to engage with with the community.'",
        "'speaker_0': 'And it was huge benefits. And this is something that I know for for me and for for Councilman Gonzales and others has been a top priority to get lobbied state in a big way to downtown. And not only will the university open up a significant amount of classrooms just across the street on the other side of Long'",
        "'speaker_0': 'Beach Boulevard, where you'll be located, we're building, as you know, a large development where there will be affordable housing for faculty in the arts department. So you will have across the street gallery space, the university will manage. You'll have faculty and residents with earning their MFAs at in the Broadway block project just across the street and on'",
        "'speaker_0': 'the other side of on Beach Boulevard, you will have these classrooms and students and then you have the student housing and now you are adjacent from the Metro Blue Line and you're opening up our students to, you know, to the rest of the Los Angeles region and to the rest of the.'",
        "'speaker_0': 'And so I think it's a it's a really important and special moment. I'm just really proud of all the work. And so thank you again, Dr. Conley, to you and your and your team and to Tony Shoshoni, who is also helping make this whole thing happen.'",
        "'speaker_0': 'So thank you. Any other comment on this item? Seeing nonmembers, please get Ancaster votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'All right. Go beat. Congratulations. Thank you. And let me now go back to the presentation that we have. I'm going to turn this over to Councilmember Durango.'"
    ],
    "Digital Inclusion Roadmap Funding from First Council District.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'I have item 33 last week moved.'",
        "'speaker_2': 'Up.'",
        "'speaker_1': 'Communication from Councilwoman Gonzales recommendation to increase appropriations in the General Services Fund in the Technology and Innovation Department in an amount of 40,000 offset by the first Council. District one time district property or. Funds to support the development of digital inclusion roadmap.'",
        "'speaker_0': 'Councilwoman Gonzalez?'",
        "'speaker_4': 'Yes. Can we have a staff report, please? Thank you.'",
        "'speaker_2': 'Yes. Leah Ericson and Rebecca Calma.'",
        "'speaker_5': 'Good evening, Mayor and members of City Council. I am pleased to briefly.'",
        "'speaker_7': 'Summarize the progress we have made.'",
        "'speaker_5': 'In advancing digital inclusion in Long Beach.'",
        "'speaker_7': 'Since City Council provided policy direction a year ago. First, our.'",
        "'speaker_5': 'Technology and Innovation Commission has been hard at work.'",
        "'speaker_7': 'At the request of Mayor Robert Garcia to analyze the impact of the digital divide in the city of Long Beach. The commission designed and.'",
        "'speaker_5': 'Administered.'",
        "'speaker_7': 'Two surveys in order to understand.'",
        "'speaker_5': 'How residents.'",
        "'speaker_7': 'Access and use the Internet. The analysis.'",
        "'speaker_5': 'Is intended to help inform digital inclusion efforts to make Long Beach a truly.'",
        "'speaker_7': 'Inclusive community where all.'",
        "'speaker_5': 'Residents have access.'",
        "'speaker_7': 'To affordable, internet.'",
        "'speaker_5': 'And capable devices.'",
        "'speaker_7': 'The surveys were administered both online and in-person at 12 libraries, 26 community centers, and at 14 community events.'",
        "'speaker_5': 'Including focus.'",
        "'speaker_7': 'Groups, Community Forum, and other multiple community events. Grant funds from the California Emerging Technology Fund helped support this outreach. The commission's findings from the survey analysis informed a series of recommendations 22 in.'",
        "'speaker_5': 'Total that address digital literacy, access.'",
        "'speaker_7': 'To device and broadband connections, infrastructure deployment, and also recommend ongoing research and evaluation, applying rigorous standards and advocating for local control and privacy standards.'",
        "'speaker_5': 'At regional, state and federal levels. These recommendations will.'",
        "'speaker_7': 'Be used to inform the development of the city's digital inclusion roadmap. In addition to the work of the Commission, the city has made progress in other areas too.'",
        "'speaker_5': 'Including hiring an economic and digital inclusion project lead.'",
        "'speaker_7': 'Convening stakeholder roundtables that include community partners, city departments and internal Internet service providers.'",
        "'speaker_5': 'We also celebrated International Digital Inclusion Week.'",
        "'speaker_7': 'In October with a social media campaign that reached thousands.'",
        "'speaker_5': 'And the outreach included an.'",
        "'speaker_7': 'In-Person campaign where city staff visited over 60 community hubs like laundromats, barbershops, restaurants and libraries to provide information about digital services, resources and tools that the city already has in place. Our work continues in other areas as well.'",
        "'speaker_5': 'And the development of a digital.'",
        "'speaker_7': 'Inclusion roadmap will provide a blueprint to provide equitable access and use of digital resources, services and tools for all residents. I will now turn it over.'",
        "'speaker_5': 'To Rebecca Kwame Koroma, the CS Economic Team Digital Inclusion Project, lead to talk about the digital inclusion roadmap.'",
        "'speaker_7': 'Development process and how we will use the funds that are proposed today.'",
        "'speaker_5': 'Thank you very much, Leah. Good evening, honorable mayor and members of the City Council. The Technology and Innovation Department will be using the funds to co-create a digital inclusion roadmap with the community and local stakeholders. The focus areas of the roadmap are capacity, connectivity and technology.'",
        "'speaker_5': 'With the funds, we plan on hiring two consulting firms to assist the department with stakeholder facilitation, community outreach and engagement for the development of the roadmap, a collective impact approach and equity lens will be incorporated into the governance, planning and development of the roadmap.'",
        "'speaker_5': 'Some of our process actions for the collective impact process and equity lens are first and foremost recruiting cross-sector stakeholders to join the stakeholder committee. This committee will include city departments and commissioners, community based organizations, colleges and universities, internet service providers and technology businesses.'",
        "'speaker_5': 'We will amplify best practices and assets resources from our stakeholders, including community members who are most impacted by the digital divide in the government's governance, planning and development of the roadmap is key. It is imperative that low income communities and communities of color are involved in the decision making process for setting the common agenda and developing shared'",
        "'speaker_5': 'measurements. We want the community to have ownership over the roadmaps, vision, goals, objectives and strategies. Analyzing quantitative and qualitative data is critical for understanding the digital divide landscape. We will disaggregate data to reveal digital inequities by race and ethnicity, geographic area, age and other relevant characteristics.'",
        "'speaker_5': 'We will acknowledge and understand that root causes of the data with the goal of prioritizing communities most in need when developing and implementing this roadmap. We also plan and plan on incorporating an equitable and inclusive community outreach and engagement process where communities who have been historically underserved and marginalized in technology will be uplifted.'",
        "'speaker_5': 'We will draw upon the assets, knowledge and lived experiences of the community as we define the strategies. And most importantly, it is important for us to empower the community in the decision making process so that they have ownership over these strategies.'",
        "'speaker_5': 'The strategies will be rooted in equity and will focus on communities experiencing inequitable outcomes. The strategies will also focus on collective program and system change and largely upon the best practices and expertize from subject matter experts from other cities and local stakeholders.'",
        "'speaker_5': 'We are excited to kick off this process to ensure that everyone in Long Beach has equitable access to digital resources, services and tools. Thank you very much for your time and consideration. And this concludes my staff report.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_4': 'I just want to say thank you so much to both Leah and Rebecca. We have, as I mentioned in this staff report, we've engaged hundreds of residents regarding digital inclusion. And this was a an idea I had some time ago.'",
        "'speaker_4': 'And we finally put it into momentum. And the responses that we've received so far, in addition to the work that the Technology and Innovation Commission had already been doing, has really put this policy in a good place and it still has yet to see its full implementation.'",
        "'speaker_4': 'So this $40,000 will be a great commitment and a great step forward in ensuring that we close the loop and find out what other gaps that we have. I can tell you at these roundtables, President Ramarley from Long Beach City College was personally there.'",
        "'speaker_4': 'President Connelly has also provided her personal commitment as well, and we had engagement from Virgin Galactic, we had engagement from EPS and of course our departments here in the city and many stakeholders across Long Beach who are really invested in ensuring that kids, families, the 50,000 that we've quantified here in Long Beach that are off the grid'",
        "'speaker_4': ', that do not have access to broadband, will finally either have access or we can at least improve educational outcomes. And that's the goal for this. So again, I want to thank you very, very much. I know that the work is still up ahead of us, but we're, in the meantime, getting a lot of analysis where we're ensuring'",
        "'speaker_4': 'that we're creating more data points and sets that will put us in a very good place. And what I always tell people and with this is that you cannot have a smart city without being a smart city for all, and that really means being inclusive.'",
        "'speaker_4': 'When we talk about digital access, thank you very much.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Thank you, Councilman. Mongo.'",
        "'speaker_10': 'I want to send my appreciation to Councilman Gonzalez. I know that when we talked about this many years ago, we didn't know where the money would come from. But she really put her money where her mouth is tonight.'",
        "'speaker_10': 'And I think it's a big deal. And I think we should all stand up for what she's done tonight, cause it's not been the money has not been spent on something small. It's been spent on a plan that will really change the face of the way we look at technology and inclusion.'",
        "'speaker_10': 'So congratulations.'",
        "'speaker_0': 'Thank you. Councilman Richardson.'",
        "'speaker_8': 'Just wanted to chime in, offer some congratulations. And you have followed the digital inclusion conversation from the news articles to Councilwoman Gonzales, his leadership. And, you know, obviously, Rebecca and Leah and I just think that this is very well done.'",
        "'speaker_8': 'And I look forward to seeing where it goes.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Councilman Pierce agreed on everything everyone said. I think it's great that you really came with a lens that some of us haven't had on council around technology. And I think it really demonstrates your commitment to the entire community.'",
        "'speaker_6': 'And I'm looking forward to seeing what's next and how we can continue to engage with corporate sponsors and those to ensure that we do close that digital divide. So thank you.'",
        "'speaker_0': 'Vice Mayor Andrews.'",
        "'speaker_2': 'Yes, thank you. I want to congratulate Council Councilwoman Gonzalez for this item because I think it's really going to wind up in the direction she would be going. Thank you very much.'",
        "'speaker_0': 'Thank you very much. And I just want to thank you, Councilman Gonzales. I know digital inclusion work has been a priority of yours. I want to thank the the Tech and Innovation Commission who's been working on digital inclusion.'",
        "'speaker_0': 'We just received a pretty significant report on their work around really bridging the digital divide across the city. There's significant information in there that I think will be coming to the council for a presentation at some point in the future, which we're excited about.'",
        "'speaker_0': 'And really, again, I think this is a work that's happening here at the council, at the university, the commission, and so many other places. And so we're very excited about it. And with that, let me open this up for public comment.'",
        "'speaker_4': 'Hello. Good evening, Mayor and members of City Council. My name is Gwen Schaefer. I chair the Technology and Innovation Commission and Lia and Rebecca already highlighted many of the points in our report that I was going to mention, but a couple of things that I wanted to highlight some of our key findings that I think are.'",
        "'speaker_6': 'Worthwhile.'",
        "'speaker_4': 'And that have policy implications. So when we asked residents who lack a home broadband connection why they don't have it, not surprisingly, 80% of them said that it was a cost barriers. Either they could not.'",
        "'speaker_6': 'Afford a broadband subscription or.'",
        "'speaker_4': 'A device. That was the main reason why they didn't have it. The vast majority of people we and that participated in our survey said they could not pay more than $20 a month for a home broadband connection. And we know that Apple's typical subscription far exceeds that.'",
        "'speaker_4': 'We asked people, if you had home Internet, what would you use it for? The number one thing people said in the response was educational purposes, followed by work and access to city services. So all things that we would benefit from as a city.'",
        "'speaker_4': 'And the other thing I wanted to mention was the very critical role that our libraries play in providing broadband access for our residents. When we asked people, Ed, in light of the fact that you do not have home broadband, where do you go to get online?'",
        "'speaker_4': 'More than half of them said they rely on our public libraries. So we do hope that this is a resource we will continue to invest in. And then the last thing I wanted to mention is that members of our commission will be getting in touch with you if they have not already.'",
        "'speaker_4': 'We would love to meet with members of council and just briefly spend some time talking about some of the key findings.'",
        "'speaker_6': 'In our report and.'",
        "'speaker_4': 'How we might be able to implement some of the recommendations that we worked really hard on creating. So thank you very much for your support and for your efforts to make Long Beach a more digitally inclusive city. And especially thank you, Councilwoman Gonzales, for your efforts.'",
        "'speaker_0': 'And again, and one I think the commission and obviously another one of our amazing Cassie Long Beach faculty. So thank you for your work and contributions. I want to just also add that oftentimes I think people, you know, the council does it work week to week on a variety of issues.'",
        "'speaker_0': 'And it's important at moments where the commission is this is a substantial report the commissioners are working on for over a year.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_6': 'So we spent.'",
        "'speaker_4': 'All summer doing data collection and then the fall writing in the report.'",
        "'speaker_0': 'And so it's just a lot of work and I really hope the council takes the time to review it. That's really important policy recommendations. It's really important for us to really be a connected city. And so I just want to thank the commission again for for for that work.'",
        "'speaker_4': 'So thank you. And I'm one last thing. I'll say that the report we don't see it as a final or an end point in our work that we see this is ongoing and we want to make sure that we move forward on digital inclusion.'",
        "'speaker_4': 'Okay. Thank you. You have a good night.'",
        "'speaker_0': 'And Councilwoman Mango.'",
        "'speaker_10': 'I also wanted to thank the commission. I've met with some of the commissioners already and I am so impressed with the commitment and dedication and the detail. It was really important to my side of town that seniors were included and I really appreciated that the report really went out and informed the data and it was excellent.'",
        "'speaker_10': 'So thank you again for.'",
        "'speaker_4': 'All your work. Thank you.'",
        "'speaker_0': 'Thank you. There is a motion and a second members seeing the other public comment. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you very much. We have a hearing that we haven't done yet, so we want to make sure that we do the hearing. And so let me read the hearing really quick.'",
        "'speaker_2': 'So this we don't.'"
    ],
    "Report on Traffic and Navigation App Impacts on Residential Neighborhoods.": [
        "'speaker_0': 'If we don't just do a just a I'm sorry. You know, Councilman Price is actually here very kindly, but is actually not feeling well and hasn't been. And so she has one item which shouldn't take too long. So let me hear item 23.'",
        "'speaker_0': 'That way she can get better. And then we will go to the first to the hearing. So if the council doesn't mind, please let me do item 23.'",
        "'speaker_1': 'Communication from Councilwoman Price, Councilwoman Gonzalez, Council Member, Super Knob, Vice Mayor Andrew's recommendation to request the city manager to report back within 60 days on how the city can work with traffic and navigation app companies to reduce traffic routed through residential neighborhoods.'",
        "'speaker_0': 'Thank you very much, Councilman Price.'",
        "'speaker_4': 'Thank you. The item pretty much speaks for itself. This is an issue that other cities have dealt with in terms of how some of the applications that are used for navigation are routing traffic. As we all know, some residential streets are not appropriate for a high volume of traffic, whether it's because they don't have appropriate crosswalks, whether'",
        "'speaker_4': 'it's because the roads are narrow, whether it's because of the noise impacts to the neighborhood, whatever the case may be. A lot of our residential streets are not designed for cut through traffic. And I know that companies like Waze and I'm sure there are other companies as well, have worked in the past with our city, but as'",
        "'speaker_4': 'well as with other cities in collaboration to try to identify streets that would not be appropriate for rerouting commute traffic. So the request really is to have staff reach out to any of these app developers to see if there's a way that we can take some of our residential streets that are being used as cut through traffic'",
        "'speaker_4': 'alternatives out of circulation for these app developers.'",
        "'speaker_0': 'Thank you very much, Councilwoman Councilwoman Gonzales.'",
        "'speaker_4': 'Thank you. I think this is a good opportunity for us to do a little bit more research and report back. And and thank you for counsel to Councilmember Price for bringing it forward.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Ringa.'",
        "'speaker_2': 'Thank you, Mayor. And thank you, Councilmember Price, for bringing this forward. Being in the seventh District, we are highly impacted by a lot of this port traffic and are having this study would be a tremendous benefit to see that make sure that trucks are aren't directed to residential areas where streets cannot accommodate.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Pearce?'",
        "'speaker_6': 'Yeah. I want to thank my colleagues for bringing this forward. I do want to ask staff, you know, I had a couple of community emails on this item around the fact that we're all taxpayers and pay for all the streets.'",
        "'speaker_6': 'And so I'm just curious if there's been cities that have been successful at mitigating traffic through residential neighborhoods. And then I'll say one more thing. Seventh Street, while not a residential neighborhood, has a lot of homes and driveways.'",
        "'speaker_6': 'And so I'm just concerned about the impact of of kind of trying to offset some of that.'",
        "'speaker_2': 'Councilmember. Different cities had mixed success on this. So we'll give it a try and look at what streets are important to us.'",
        "'speaker_9': 'And certainly Seventh Street is one that we can add as well.'",
        "'speaker_6': 'Well, I mean, Seventh Street is a main thoroughfare, right. Like people take it from Cal State to get to downtown. And so I know we've had a crisis, an identity crisis on Seventh Street, but I just think it is worth a fuller conversation about how we absorb traffic on those streets.'",
        "'speaker_6': 'And if there's I know we're trying to do a seventh Street visioning again soon. So I just want to be considerate about those main thoroughfares as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilman.'",
        "'speaker_11': 'Good evening. So I just want a little clarification. I think this is a great item, and I know the intent is to, uh, to improve the quality of our neighborhoods. Right. Welcome, everybody. I got here a little late, but I wanted some clarity on on the app companies.'",
        "'speaker_11': 'Are we talking like ways that Google the for for like what ride share or is it all of the above for anyone that's using an app to get to Long Beach.'",
        "'speaker_4': 'The item is doesn't specify. So if there are if there is a particular interest we have, we can certainly talk about it and include it. I was thinking more the navigation apps like Waze or Google Maps that are routing routing traffic away from hazardous or, you know, not hazardous but congested areas.'",
        "'speaker_4': 'But certainly they can explore beyond that if that's something you're interested in, like rideshare apps.'",
        "'speaker_11': 'Right. And we're probably in an interesting time in our city's history with a lot of construction and infrastructure work going on. I'm sure that there might be a little bit of a I would just say it, like I said, an interesting point in time where we have to take that into consideration as well.'",
        "'speaker_11': 'But I'm looking forward to staff's report and I'm happy to support this.'",
        "'speaker_0': 'Thank you. There is a motion and a second is are public comment on this item saying none, please cast your votes.'"
    ],
    "Study Session on the Climate Action and Adaption Plan.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. Hearing item number one.'",
        "'speaker_1': 'Recommendation to conduct a study session to receive and file a presentation on the Climate Action and ADAPT Adaptation Plan.'",
        "'speaker_9': 'Thank you, Mr. Mayor. Members of city council. So this is a study session that we would like to bring to you to really talk about our climate action and adaptation plan. There's an incredible amount of work that's been going into this.'",
        "'speaker_9': 'This is something the council has told us is a priority to really plan for the future on climate action. And so with that, I will turn it over to the team. We have Linda Tatum, we have Christopher Koontz, and we have Allison Spindler to give the presentation.'",
        "'speaker_4': 'Good evening, Mayor.'",
        "'speaker_5': 'And council members. I'd like to introduce Allison Spindler, who has lived and breathed this project probably for the last 18 months under the direction of our planning manager, Christopher Coons. And one of the things I'd like to bring your attention to during the presentation is that in last year's budget, the city council gave us an additional staff'",
        "'speaker_5': 'person to conduct a lot more extensive outreach. And this project in particular had has benefited significantly from that outreach. And you'll see that as we go through the presentation, given the the significant level of public involvement and not just outreach, but also very specific public engagement on this topic.'",
        "'speaker_5': 'And we're really proud of where we've come. And Allison can give you the details.'",
        "'speaker_7': 'Thank you, Linda. And good evening, Mayor, and members of the city council. I'm glad to be here before you this evening to provide an update on our work to develop the city's first ever Climate Action and Adaptation Plan.'",
        "'speaker_7': 'What is the cap? It will be our plan to reduce greenhouse gas emissions across the city. Prepare our communities for the impacts of climate change. All while using this as an opportunity to improve quality of life health and enhance economic vitality here in the city.'",
        "'speaker_7': 'I would. So first, in terms of using our terms, what do we mean by climate action or climate mitigation? That's really about reducing the impact that we as people have on the future of our planet by reducing our future carbon emissions.'",
        "'speaker_7': 'This photo might look familiar as this is our number one form of emissions is transportation here in the city. And I know we've all been in this freeway situation. On the other hand, climate adaptation is recognizing that we need to adjust our own behaviors or systems and infrastructure to reduce the impact that climate change has on us'",
        "'speaker_7': '. For example, elevating a road to reduce flooding or flood proofing a house. And this is important because a growing body of research is showing that not only is climate change here, but according to the UCLA review of all of the local research, it's already impacting our health in Los Angeles County.'",
        "'speaker_7': 'These photos are all real photos from Long Beach from two January's ago. The one in the middle is kind of fun that someone kayaking down one of the streets during an extreme rain event. The one on the right is a little more sobering.'",
        "'speaker_7': 'That's our police and fire services actually rescuing a wheelchair bound resident here in the city. So why are we here today in particular? We're at a critical point in the cap process. As mentioned in the opening, we've been doing a lot of research and background analysis to understand how Long Beach is and will be impacted by climate'",
        "'speaker_7': 'change. And to be honest, the estimated safety, health and economic impacts are significant. So it's a really important time in the process where we've been gathering and analyzing the data and now we're actually putting together a draft plan.'",
        "'speaker_7': 'So council feedback and direction is requested as we look at other areas of study that we missed. Do you have guidance as to our process as we go about refining the measures being considered for the plan? Any guidance as to how we should think about evaluating tradeoffs regarding funding and financing staffing to implement the actions we're talking'",
        "'speaker_7': 'about? Also, in consideration of the cost of inaction, feedback on our greenhouse gas reduction target, which I'll get into in a few minutes, and other priorities are areas that the Council would like us to look at. So this is not new work for Long Beach.'",
        "'speaker_7': 'We've been a leader in sustainability for a long time. As this timeline shows, starting back in 2006 with the port's first Clean Air Action Plan, in 27, we formed the Sustainability Commission in oh eight, the Office of Sustainability, and then began incorporating sustainability initiatives into our mobility element in 2013 and our land use element in 2017.'",
        "'speaker_7': 'I also want to point out in 2015, the mayor agreed to the what was then called the compacts of Mayors. Now it's called the Global Covenant, which is local jurisdictions and cities around the globe, committing to a low carbon and resilient city structure.'",
        "'speaker_7': 'So given all of those sustainability commitments, you might wonder why? Why a cap? Why now and why in planning? So the answer is that not only will it help us meet our our commitments to the global covenant, but the CAP will help us meet a whole host of state and local requirements, including AB 32 or SB 32'",
        "'speaker_7': ', which requires us to reduce our carbon emissions to 1990 levels by 2020. SB three, 75, 86, 99, 691, which relates to sea level rise and coastal areas and our requirements to the state for that. SB 1000, which requires a general plans incorporate adaptation and address impacts to disadvantaged communities.'",
        "'speaker_7': 'We're also using this plan as a mitigation measure of the land use element. So understanding that our city will continue to grow. How do we do it in the most sustainable way possible? Oops. As Linda mentioned, there's been a lot of research or sorry outreach that's been done, starting with several working groups.'",
        "'speaker_7': 'We have a scientific working group of 13 experts from Cal State, UCLA, the Aquarium and other local institutions that have really helped us make sure the data is correct. A business working group of local businesses as well as a community working group.'",
        "'speaker_7': 'We've collaborated with every city department to gather our data and look at the actions we're considering. We've done over 20 outreach events since June 2018 that were selected in collaboration with each council office and at least one event in every district.'",
        "'speaker_7': 'There was also an equity analysis that informed our outreach strategies, and we've had a real youth engagement focus recognizing that climate change is a multigenerational intergenerational equity issue. And so we're working closely with Youth Leadership Long Beach program, as well as various high school groups who are actively participating in this process.'",
        "'speaker_7': 'Here are a few stats. To Linda's point, we've had over 18 events where we've had cap tables reaching close to 8500 people at some events, large and small, such as Ready, Long Beach or Desert Nights at the Aquarium.'",
        "'speaker_7': 'We've also done 12 cat presentations, hosted two big city wide open houses, and hosted large events such as on the bottom right of the photo from our panel on sea level rise and what residents can do to prepare where we had over 300 people attend.'",
        "'speaker_7': 'We also surveyed every city department and 100% responded that they're already being impacted by climate issues related to infrastructure assets or core services. 88% of departments are engaging in greenhouse gas reduction strategies already. You'll note with the graph on the right that extreme heat is the climate stressor impacting the most number of city departments.'",
        "'speaker_7': 'Here are the climate hazards based on the data and science that are impacting Long Beach. Extreme heat, sea level rise, flooding, drought and poor air quality. Here are the community and infrastructure assets likely to be impacted, starting with our public health, housing and neighborhoods.'",
        "'speaker_7': 'City buildings are transportation, infrastructure, water supply, wastewater and stormwater assets. Our coastal resources. Parks and open space. As well as our energy infrastructure. I'm going to start with extreme heat because the data shows that extreme heat poses the greatest risk of life and health to the largest number of Long Beach residents.'",
        "'speaker_7': 'In fact, approximately 275,000 of our residents are in the high, extreme heat vulnerability zone. Extreme heat is very serious and increases the risk of heat related illness, and even death increases vector borne diseases, tropical pathogens and parasites. Especially vulnerable populations include children, older adults, people with respiratory diseases.'",
        "'speaker_7': 'And those who work outdoors can lead to missed work in school. We've already heard from high school students who have had this happen in Long Beach. Damage to roads, highways and rail from extreme heat. And you may remember the power outage a few years ago.'",
        "'speaker_7': 'That was during an extreme heat wave. The data shows that between 1980 and 2000 in Long Beach, we had four extreme heat days a year. By 2050, we're looking at somewhere between 11 and 16 and by 2100, up to 37 days a year where it's over 95 degrees in a day.'",
        "'speaker_7': 'And with climate change, the cooling effect we get here at night is going to lessen. And this is not a future problem. It's a current problem. This graph shows you how extreme heat days have played out in the city for the past ten years.'",
        "'speaker_7': 'You'll notice we're already well over that for extreme heat day, your average. And you'll notice it was in 2015 that we had ten extreme heat days. And I know that members of the council will remember the power outage that we had here in downtown that lasted several days, impacted many residents, including seniors living in high rises without'",
        "'speaker_7': 'access to medication or keeping things refrigerated, without ability to get up and down the elevators. Our departments were, of course, very impacted. Everything from fire, help and police checking on wellness to our public works partners working on the infrastructure issues.'",
        "'speaker_7': 'Extreme heat is most dangerous in central, west and north Long Beach. As the map shows here, the highest vulnerability zone is and read the existing white dots or cooling centers that will already have. Extreme heat can also worsen air quality.'",
        "'speaker_7': 'So that's another challenge. Here are some of the adaptations we're considering. I mentioned earlier we have 200 adaptations and mitigations we're looking at for the plan, and now we're going through that prioritization process. But some examples include creating shade shelters at bus stops or in parks, increasing the presence of cool roofs or reflective streets, increasing our public'",
        "'speaker_7': 'water supply access, expanding our cooling centers, not only locations, but hours, because, again, it'll stay hotter at night. And developing emergency response plan for power outages and continuing to plant trees through our urban forest management plan. I also want to point out the social vulnerability to climate change map, because we know that some populations are more vulnerable'",
        "'speaker_7': 'to the impacts of climate change due to socioeconomic and demographic factors. For example, those that walk or take the bus because they have no car are have less ability to be resilient in getting out of an extreme heat situation or to be able to stay at a hotel at night when it's very hot.'",
        "'speaker_7': 'Similarly, renters can be more impacted and may not have as much ability to provide some of those protective factors, such as whether weatherproofing. Next, I'll move on to flooding. This is there are three different ways and Long Beach that we experience flooding.'",
        "'speaker_7': 'There's riverine flooding. So when when the rivers get really high and flood over, there's urban flooding. When our storm drain system does not meet the existing storms happening and then sea level rise and the associated coastal storms. So if flooding events can contribute to injury, death and displacement.'",
        "'speaker_7': 'The aquarium analyzed that over 22,000 residents in Long Beach are at risk to flooding by 2050 due to sea level rise. That flooding can include damage to wastewater and stormwater issues, as well as sewage back up that can lead to food and water borne illness and can disrupt, as we saw in the pictures here, the transportation system'",
        "'speaker_7': 'that could impact neighborhood connectivity and getting to work or school. This map shows you where our riverine flooding takes is projected to take place from the blue with the 100 year storm event and the orange and unlikely 500 year storm event.'",
        "'speaker_7': 'That's a 0.2% chance. And then we looked at various scenarios related to sea level rise. This shows you the the mid range projection for 2100. As you can see, the dark blue, our king tides are fairly extensive in terms of potential flooding.'",
        "'speaker_7': 'And the light blue would be a 100 year storm surge on top of it. You'll notice that this is also the first scenario where we see potential daily high tide impacts throughout parts of southeast Long Beach, parts of the of of west Long Beach, north of the port, are potentially helped out by the fact that the port'",
        "'speaker_7': 'is already doing an adaptation plan. And so this is, of course, under a no action scenario if we do nothing. And that's why we're here to develop the plan. We know that over 10 million square feet of residential property, 2 million square feet of commercial property, and another 2 million square feet of industrial property are in this'",
        "'speaker_7': 'flood area. Additionally, additionally, 74 miles of roadway, an electrical substation, three storm drain outfalls, ten stormwater pump stations and nine wastewater pump stations, as well as three portable facilities in that in that flood risk area. There is, of course, considerable uncertainty into the actual timing and extent of flooding.'",
        "'speaker_7': 'It depends on a number of factors, including the extent of any future shoreline or stormwater system improvements. But it's important to consider our best understanding of what these impacts could be. You'll also notice on the map several specific city buildings noted.'",
        "'speaker_7': 'This slide shows you how many city buildings are impacted by the different sea level rise scenarios. And the different scenarios are mapped out on our website in more detail. But you can see, for example, that we have in 2050 potentially three fire stations, a library and a parks building that are impacted.'",
        "'speaker_7': 'These costs would be substantial if needed for full replacement. And in terms of what we do about it, there is a whole host of adaptations we're considering around flooding, everything from updating the emergency response plan to updating our floodplain ordinance so that new building would consider that flood elevation, prioritizing low impact development and stormwater practices, relocating and'",
        "'speaker_7': 'elevating critical infrastructure, especially as we improve that infrastructure, elevating homes or businesses, looking at active or passive dune restoration as well as groundwater monitoring. And it's important to note the costs.'",
        "'speaker_5': 'Of of these.'",
        "'speaker_7': 'Sorry, the costs of these actions are very substantial. And we're already in talks with the financial management department understanding that given today's budgetary constraints, it would be impossible to meet the full cost of all these replacements. And that's why we need to be working together now.'",
        "'speaker_7': 'So here is our greenhouse gas reduction target scenario. We've looked at several different options based on the state guidance and the science available. There are several options here, but the main trend line, of course, is that it needs to go down.'",
        "'speaker_7': 'Staff has been recommending option D, which is a per service population. So that means for people that live or work here, how we reduce greenhouse gas emissions per person. We're recommending that per service population reduction for 2030 and 2040.'",
        "'speaker_7': 'We've also heard a good deal from community members who would like to see that carbon neutrality target in the plan. We think it's important to then consider an aspirational target for 2050, and that would be stocks recommendation because this plan will be something that we're held to in order to meet our SEQUENT obligations and therefore having the'",
        "'speaker_7': 'the D scenario option as well as the aspirational net carbon neutrality option, we see as a good balance for being bold and making a big commitment, but also understanding that as of today, there's no feasible way to get to that net zero given the technology out there, but that we want to continue to to have that aspirational'",
        "'speaker_7': 'target. Here's where our greenhouse gas emissions come from in the city. Over half is from our transportation sector at 54%, followed by the buildings where we live and work. Turning on the heat. The lights, the air. And then our waste sector is the third one.'",
        "'speaker_7': 'Here are some sample actions that we're considering on the transportation side. For example, making transit service enhancements both to improve our bus stops environment and also to increase our service and connectivity. You'll remember I mentioned shade structure. The bus stops on the adaptation side.'",
        "'speaker_7': 'This is where it could be a benefit on both the mitigation and adaptation side. For mitigation, you could help get more people on busses with better service stops. On the adaptation side, it helps reduce the heat for those that are already taking it.'",
        "'speaker_7': 'We're also looking at active mobility actions, such as increasing our bike and pedestrian infrastructure as the city continues to do electric vehicle deployment, as well as transportation demand management, working with large employers and of course land use and transportation planning.'",
        "'speaker_7': 'So increasing our density and mixing of land uses near transit stops is a really important way to achieve this. In terms of next steps, we're continuing to review and get feedback from the public on these actions as well as from other city departments.'",
        "'speaker_7': 'We hope to have a draft plan by the end of next month. We invite you all to our next open house June 1st, and then we'll be going through the Sequa process the latter half of this year and hope to be back before the Council in January 2020.'",
        "'speaker_7': 'We have a whole bunch of ways for people to stay involved. We have a business survey and a resident survey on our website, as well as more information and all of the maps and data that you've got here today.'",
        "'speaker_7': 'You can follow our hashtag Kapu Albee. Sign up for alerts for link. We have a special event coming up March 30th at Silverado Park on extreme heat and how it can impact older adults, children and other vulnerable populations.'",
        "'speaker_7': 'We hope you'll join us. And then you're all invited to our final cap open house. That'll be June 1st at Marine Stadium. There'll be interactive activities. We're going to have high school students running different booths and parts of the event.'",
        "'speaker_7': 'We hope you can all join us. And with that, could my presentation and I'm here to answer any question.'",
        "'speaker_0': 'Well, thank you. Thank you very much. I know you've been working a lot on this, and I know I've had a chance to to read the plan earlier. And it's it's really substantial. I want to thank staff that have been also briefing us on the progress of the Climate Action Adaptation Plan.'",
        "'speaker_0': 'And it was important, I think, to bring this forward and to do the study session as well. Let me start with Councilmember. Let me go through some of the councilmember comments and questions and then we'll go from there.'",
        "'speaker_0': 'Councilmember Richardson. I think he just stepped out and we got to find somebody, Ringo.'",
        "'speaker_2': 'Thank you, Mary. And I want to thank staff for a very comprehensive report on clarity. I mean, we all know that our. Incumbent president doesn't believe in climate change. But I think that a report like this is very compelling and speaks volumes about where we're headed in a very near future within the next 20, 30 years and'",
        "'speaker_2': 'where we're going to be. And many of us who live under and on the plains know that we're probably not always going to be underwater. So a lot of the most important thing that I see in this report, and I know it's only a study, but it's okay, is to basically inform people what's coming.'",
        "'speaker_2': 'And I think that's the most important aspect of this of this report, is that we need to share it as much as we can. We had a discussion earlier today about the digital divide and and needing to increase our access to information.'",
        "'speaker_2': 'So I would like to see that we can get this report out as as far and wide as we can, especially for those individuals who, like myself, who live close to a river or a tributary or a location where we're sea level rise or flooding is very, very impactful.'",
        "'speaker_2': 'One of the things that I didn't see in here, obviously, and it's probably inferred, is that a lot of residents kind of look at their insurance policies when it comes to flooding and and the impact that that's going to have on their future in terms of housing, where they're going to be by any halt or where we're'",
        "'speaker_2': 'going to be constructing new homes and what the requirements are going to be to move into those areas where where flooding or and or a sea level rise is going to be a major impact in those communities. So I want to thank staff for this very comprehensive report.'",
        "'speaker_2': 'Looking forward to your open house and especially looking forward to your event on March 30th at Silverado Park, which is in the seventh District. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_6': 'I yes, I am very excited and I think I've expressed my excitement for doing a community action and adaptation climate plan. I do. I have some concerns. One is that we haven't had a community meeting in the second district and we haven't fully engaged the stakeholders in the second District on this plan.'",
        "'speaker_6': 'I appreciate and totally support all the actions that are that are listed here. And I do think that they seem to be kind of low hanging fruit. And so I would I do look forward to sitting down and meeting with you guys and engaging the second District and making sure that we have a plan that is similar'",
        "'speaker_6': 'to vision with L.A. and other cities that are really thinking outside the box and thinking about different funding sources, different grants. You know, we shouldn't just be, you know, increasing bus routes, but we should be talking about how do we get every single bus to be electric and how do we make sure that we're leveraging our resources'",
        "'speaker_6': 'and community partners as much as we can? So I appreciate where it's at. And I guess I just I'm a little concerned that the data is supposed to come out next month when we haven't had a full engagement yet.'",
        "'speaker_6': 'So I hope to meet with you guys soon. And I know that my staff is working with you guys on a date on April around Earth Day, and I think that's been the talk for the last month. So I hope that we can pin that in and not pencil it in.'",
        "'speaker_6': 'I look forward to hearing from community members as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_11': 'Thank you. I would just. I'm actually going to commence that for the the great report here. I think it's pretty comprehensive and certainly eye opening for for me. I did want to get some clarification and go back to the to the map where you.'",
        "'speaker_11': 'That bet. That map and you mentioned the amount of square footage in terms of is that residential square footage a million square feet?'",
        "'speaker_7': 'Yes. Let me just pull back up the numbers so I'm certain. So this is under the 2100 mid-range scenario, and there is an 80 page assessment on the website that goes into a lot more detail. But under this particular scenario, it would be over 10 million square feet of residential property, 2 million square feet of commercial, and'",
        "'speaker_7': 'another 2 million of industrial in that zone. And that's under a king tide scenario. So that's a couple of times a year flooding as a sub area. That would be the daily high tide scenario. And we can send that map along as well.'",
        "'speaker_7': 'But it is a significant amount of property if nothing is done to prevent it.'",
        "'speaker_11': 'We said nothing is done. The the recommendations in this plan, if we were to fully execute on the local level, all of those those those recommendations where we have an impact on on that forecast and happening now.'",
        "'speaker_3': 'So to do that.'",
        "'speaker_7': 'Thank you for the question. Yeah. So I only gave a few examples, but we are looking right now at about 200 potential actions. I don't know that you would all want to hear every single one, but we are doing the analysis to look at how it would protect sort of area by area on the adaptation side and'",
        "'speaker_7': 'that would have a significant impact in terms of protection. Now as we get to these longer term ranges such as this one, the 2100 mid range, it becomes a little bit trickier when you think from maybe once or twice a year flooding to that more daily high tide, but everything from the sort of natural protections to elevating'",
        "'speaker_7': 'and flood proofing, really, it's going to take a whole variety, but would have a substantial impact in protecting us.'",
        "'speaker_11': 'And Councilmember Austin to expand further in the focus of this effort is to protect city assets and protect our ability to respond to disasters and provide lifesaving services, ticket to life and property. It's also to facilitate the private sector ability to storm proof and relocate improvements.'",
        "'speaker_11': 'But it's not the city's responsibility or intention to be able to to mitigate the potential damage to those millions of square feet of private development. They're privately held, and they'll make financial decisions and their insurers will make financial decisions about the future of those properties.'",
        "'speaker_11': 'And certainly we have an obligation to make that process as fruitful as we can. But the city is not taking on the financial or liability to to respond to the risks to all of that private property. I understood I guess I was looking at it from a standpoint of of being a resident here in the housing and'",
        "'speaker_11': 'neighborhoods impacts and how many families would would certainly have to relocate or thinking about how the city will look in 100 years. It's pretty interesting, pretty thought provoking. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_4': 'Yes. I just want to say thank you for this report. I just wanted to ask, first and foremost, have we done any of the community meetings fully in Spanish or Combi at all?'",
        "'speaker_7': 'To this point, it's only been through translation, which we do provide at our major events in both Spanish and Kimye. But we are in the planning process right now to do a Spanish only event. And I know we've been in touch with several groups, including some groups in the first District, who are willing to help us with'",
        "'speaker_7': 'that.'",
        "'speaker_4': 'Great. I think of a lot of the women in the Spanish speaking community that whose children are suffering with asthma. We have some of the worst asthma rates in the district near the port. And so I want to make sure that they are that they have their concerns addressed in this clean air action plan, as well as'",
        "'speaker_4': 'our Cambodian community members who have also expressed interest in this very much. Thank you. And what I would say is I would like to also see, you know, when it comes back, you know, definitely more specificity on the type of and, you know, maybe it doesn't come up necessarily because some community members see it in such a'",
        "'speaker_4': 'high level. But there are other cleaner action plans that I've seen in other areas that specify the type of pollutants and what it could do in specific neighborhoods. And just to get people educated on and I know it's not always exciting to see those things, but it's important for people to understand, you know, what is in our'",
        "'speaker_4': 'backyard and what is maybe affecting our communities or are affecting our communities. Another thing is, you know, I think as we've talked about open data as well and having two innovation centers that will be coming to downtown, perhaps there's some synergy with creating sort of like, you know, L.A. has the L.A. clean tech incubator.'",
        "'speaker_4': 'It's a think tank of sorts with the private sector and the public sector. And they come together and really think tank on whether it's air quality or it's, you know, sea level rise, what have you. And they they actually through that, those partnerships are able to work with entrepreneurs that want to find solutions for those and or'",
        "'speaker_4': 'work with academic institutions to find solutions for some of these these issues. So just a thought there and thank you very much. I look forward to seeing this evolve and adding my input as on behalf of the First District.'",
        "'speaker_0': 'Thank you, Councilwoman Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Mr. Mayor. So one of these slides show that significant contributor were mobile mobile sources of mobile sources of pollution, you know, automobiles, diesel trucks and and things like that. And so, you know, it appears to me that we should, you know, as we move forward, we yeah.'",
        "'speaker_8': 'That's the one 54%, right. Is mobile sources. And so that just tells me that we should, you know, certainly accelerate our efforts to make sure that we're, you know, expanding transit outside of that just one mile, the last mile, but into the last two miles, for example, in North Long Beach, where I showed the map of the'",
        "'speaker_8': 'urban heat island stuff happening. That area is outside of most of the last mile implementations because it's two miles away from the connection, the two to the blue line in Compton or down at the Wardlow station about three miles.'",
        "'speaker_8': 'And so we need to really think about as we design, you know, I know what a lot of times the best practices get handed down or last mile, but we need to make sure that they make sense for Long Beach.'",
        "'speaker_8': 'You should be last to mile. And I hope that, you know, once this is adopted, maybe I'll frame this as a question. When this is adopted, is this going to ensure that, you know, policies and programs that come out of that, that are coming from staff are already like the lens on climate.'",
        "'speaker_8': 'Our climate adaptation plan will already be reflected there. Is that the way this would be used?'",
        "'speaker_11': 'So Councilmember Richardson, this document would be a binding document. So any action that required a finding with their general plan, so that's planning items, but that's also the copy that comes to you annually as part of the budget would need to be consistent with this.'",
        "'speaker_11': 'So it is intended to translate to better informed and decision making processes, and it is designed to make sure that our our investments, especially our capital investments, are reflective of accomplishing the goals in this plan. Sure.'",
        "'speaker_8': 'Okay. And so maybe we think about, you know, when this gets adopted, how we can, you know, formalize it by having, you know, maybe some sort of a climate action statement on agenda items that are related to this, because there's things separate from the air process, the environmental process.'",
        "'speaker_8': 'There are investments that we make into infrastructure and other things that are public that we would like to know. Does this you know, this is this in a, you know, a red zone? Is it does it help to, you know.'",
        "'speaker_8': 'Does it contribute to our our adaptation plan or is this a bad investment or it doesn't acknowledge the climbing habitation? That's something maybe we could think about. Is that something that's considered like.'",
        "'speaker_11': 'Yeah. So we can certainly we can certainly work on refining. When you receive council letters, there is a sustainability section, but it's pretty streamlined today and we can look at making that a more formalized process that reflects back to this plan.'",
        "'speaker_8': 'I think that makes sense. And additionally, a lot of times when we go after so I serve on the Mobile Source Reduction Committee Board which administers millions of dollars to local governments, transportation authorities to reduce mobile sources of pollution.'",
        "'speaker_8': 'And, you know, we've we funded different grants and the city of Long Beach have gone to, you know, charging stations and and things like that. But I think we should think about maybe coming up with something, something custom, that meet some of our needs that we haven't gotten to yet.'",
        "'speaker_8': 'Like maybe, you know, I don't know, bike share or some of these things. We, we, we work together to customize this proposal and make it because we're, we're creating the three year plan for the MSR, see, right now.'",
        "'speaker_8': 'And so now would be the time to figure out what we can do within the next three years to fund. And there's, you know, millions of dollars on hand. So I just want to, you know, no response is needed, but I just want to raise that up.'",
        "'speaker_8': 'Another thing that's interesting is that, you know, when we look at the extreme heat map and you see that the central and west and north Long Beach areas, you know, are dramatically impacted. And then you flip to the sea level rise the sea level rise map.'",
        "'speaker_8': 'You see that the beach communities are or dramatically impacted. It impacted particularly the peninsula. There's not very many issues that we would see that north west and east Long Beach have in common. And so I think in this case is it's a rare opportunity for us to really just think big about an implementation that's good for East'",
        "'speaker_8': 'Long Beach will be something that's good for West Side or for North Long Beach. And so I know there's there, you know, I mean, to be honest, there's always sensitivity when you talk about sea level rise and climate change.'",
        "'speaker_8': 'And and I think it's good that you acknowledge the fact is that, you know, that much property is susceptible to sea level rise or that much investment. So we should think about how we can sort of lead with the implementation that impacts everyone and makes the most difference for everyone because this is, I think, an opportunity to'",
        "'speaker_8': 'make sure that, you know, the city's unified in terms of its voice on climate change. And so that's something I'll be looking forward to as a move forward, like maybe not having a lot of times there's there's multiple messages in different areas.'",
        "'speaker_8': 'And I think we should look at what's the common message that unifies everybody behind this this issue, because it's not real for a lot of people, but it will have real impacts. And we put up a slide of 2100.'",
        "'speaker_8': 'But I think if we put up the slide of, you know, 2050, which is, you know, 30 years away, I think, you know, frankly, we might get a bigger impact, a bigger reaction from people if we saw that.'",
        "'speaker_8': 'So those are some of my my my initial thoughts on this. I think it's a it's incredibly important. I thank you for the for the study session, I think is needed. I know we have a lot of work to get to tonight, but I think we need we need we certainly need to pay more attention to this'",
        "'speaker_8': '. Thank you.'",
        "'speaker_0': 'Thank you. I just want to add, I think it's important to acknowledge that it's been this council and just in the last few years that the city has been talking about climate change. And I think it's important to recognize that.'",
        "'speaker_0': 'And and it's important to know that the city believes and understand that climate change is real. It's happening. It's a scientific fact. Sea level rise will impact the city, but also know that it's not just about sea level rise.'",
        "'speaker_0': 'The biggest impact that we will face as a city, it directly will impact us. As a report had noted earlier, around heat and around temperature and issues around sea level, sea level rise are critical, but we cannot lose sight on what will be what we will face immediately over the next couple of decades.'",
        "'speaker_0': 'And that is that we will have parts of our city, particularly in many low income communities, that will be greatly affected by rising temperature. And we will have seniors and in particular affected by not having enough access to cooling centers and places to actually eat, to stay cool in these heat and in these in this in this'",
        "'speaker_0': 'increase heat. And so I want to thank the staff for working on this. I do want to thank the the impetus for where we got here today with this cap plan, really started with an initial report that we asked the Aquarium of the Pacific to undergo.'",
        "'speaker_0': 'And I think in the first year that I was mayor and its council formed, we went out, asked the aquarium to do an initial report on climate change. They came back a year later with a study that involved a bunch of really great scientists from across the country.'",
        "'speaker_0': 'That morphed into our signing the Mayors Climate Compact, committing to some targets. And then most importantly, the staff have been working now for a couple of years on this climate action plan very hard. And I want to recognize our sustainability team.'",
        "'speaker_0': 'They are small but mighty. They do a great job. I want to thank our Sustainability Commission, who also does a great job of uplifting issues and and policies. And I want to more broadly just speak to why where the city has made some incredible progress.'",
        "'speaker_0': 'The port, as we're aware, has what I think is probably the most aggressive climate action plan of any port in the United States. And that's something that we continue to push through the port, the airport, things to Councilwoman Mango and and partnering with me and others has embarked on a similar climate action plan that is specific to'",
        "'speaker_0': 'our airport. And then when you look at the expanded park space, our issues of of park equity, that is also been something that's been that has been pushed by this council. In addition to that, I want to note that some of the smaller initiatives of of the body, whether they've been ensuring that we have a strong, active'",
        "'speaker_0': ', multimodal transportation program around bike share, around transit and councilwoman, we do have electric busses. As you know, we've rolled out numerous electric busses on Long Beach Transit. We're actually one of the first cities to have electric busses in the nation.'",
        "'speaker_0': 'And we're our goal is to convert every single bus to electric here in Long Beach. And we're going to be one of the first cities to do so, whether it's been the conversion of all of our LED lights, all of our old I'm sorry, energy inefficient lights to led, which we were one of the first cities again'",
        "'speaker_0': 'to convert the entire city to residential and now going to commercial led. And of course the work that's happening around water quality restoration of both the lagoon wetlands and the expansion of park space I think has been significant.'",
        "'speaker_0': 'That's not to say that we are doing everything right or that we're doing enough to stop climate change. And there's still a lot of work for us to do, as we're all aware around issues, around fossil fuel consumption, around issues about mobility and the seven, ten and around air quality.'",
        "'speaker_0': 'And so these are things that we know are next for us to deal with and that we have to address. They are real and they affect us every single day. But I just do want to commend this this body for the work that's happened, but the work that's ahead, because we have a lot more work to do'",
        "'speaker_0': 'as it relates to climate change in the years ahead. And so, again, thanks to the staff and I want to open this up for public comment.'",
        "'speaker_2': 'My very good. You a firm believer. A firm believer in climate change. Those who don't believe it. Will be out the door quicker than those that saddle up to those that engender the epidemics of corruption. One of the things we should make clear, though, particularly around the waterside area, that our shoreline area is what the rules are'",
        "'speaker_2': 'relative to city employees not fishing off the company pier. No matter where that pier may be, there are some that fail to understand. The downside of doing that. Thank you.'",
        "'speaker_0': 'Thank you, Nick Speaker, please.'",
        "'speaker_5': 'Hi. My name is Julie Jean from the third district. And. I want to thank you very much for including climate change is a very important feature of the change in Long Beach. I wanted to suggest that. But first, let me introduce myself also as a part of a group called No Kill Long Beach.'",
        "'speaker_5': 'And here's the sign in a sign says Adoptions Fosters Behavior, Rehab Volunteers Rescues TNR, which is trap and release. Low cost spay neuter. Pet retention. Community outreach and proactive redemption. That's part of the program. The reason why I brought that up is because the animals at the shelter or the pound on spring are really experiencing severe problems'",
        "'speaker_5': 'from the climate change as well. It's very hot out and last summer it was scorching. These animals sit there in that shelter without. They do have shade, but I mean, they're sweltering. And also, it's been very cold this winter has been the coldest that I ever remember.'",
        "'speaker_5': 'And those animals don't have any warmth, any place where they can find refuge from the cold. So I wanted to bring that up and hoping that in your future consideration of climate change, that you'll give the animals a break in terms of their overheating and being cold.'",
        "'speaker_5': 'Also, I wanted to suggest that you put out water fountains. At key intersections where people walk in the city. They don't just walk downtown, they walk all over the place. They don't walk just in Belmont Shore. They're there in every neighborhood.'",
        "'speaker_5': 'So I think it would really be nice if they could get some water respite. You were talking about adding access to more city water. I think when I was a little girl, there were water fountains everywhere. Now there are no water fountains.'",
        "'speaker_5': 'If there are, I don't know where they are. So I think that might be a nice addition.'",
        "'speaker_0': 'Thank you guys so much. Next week, complete.'",
        "'speaker_5': 'Hello. City Council members, Mr. Mayor. We are from the social work and community outreach, organizing, development of future mental health professionals at Long Beach Poly High School. In addition to all our work and other projects right now, we are working on a project of the utmost importance, which is climate disruption.'",
        "'speaker_5': 'You spend your days fixing problems, developing budgets and trying to make things better for Long Beach. However, now, none of that will matter soon when climate disruption displaces tens of thousands of people from this city and others. We are at a critical point in this process, so changes and decisions need to be made.'",
        "'speaker_5': 'While eliminating fossil fuels and turning to renewable energy is the most important change needed, we have found through research that reducing meat consumption is an easy and extremely effective way to slow down climate disruption. Here are the facts.'",
        "'speaker_5': 'Scientists found that we need to reduce our meat consumption by 90% to slow down climate disruption. Americans are 5% of the world's population, yet we consume 25% of the Earth's resources. It takes 800 gallons of water to make one quarter pound hamburger, and 70 to 83% of all agricultural land is used for meat consumption.'",
        "'speaker_5': 'We cut down 65 trees a minute to create more of this meat consumption related farmland. The average person in.'",
        "'speaker_6': 'America is over.'",
        "'speaker_5': '220 of meat in 2018. This is both physically unhealthy and environmentally. Studies in America and the Netherlands showed that 88 to 94% of people don't understand the connection between meat consumption and climate disruption. And 80% of our students didn't know these facts.'",
        "'speaker_5': 'There are 1 billion humans that are starving and un nourished and 2 billion overweight humans. Another valuable outcome of meat consumption reduction is to help create farmland that directly feeds these people. This food crisis is real. Real leadership does not require a title or an office.'",
        "'speaker_5': 'Leadership is willingness to show courage when others are in fear or despair. Leadership is the extreme example of doing what's right, even when it's uncomfortable. Leadership is risking ridicule from others, even though it will make a huge difference in other's lives now and down the road.'",
        "'speaker_5': 'We are proposing that this city be a leader and become a meat consumption. Meat consumption reduction. To slow down climate disruption city create a campaign to reduce meat consumption by each citizen. Encourage restaurants to increase their non-meat offerings.'",
        "'speaker_5': 'Have contests for businesses that encourage employees to reduce meat consumption. And also please accelerate the Flood Control Synergy project as it is very important to climate disruption. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please. And hold on once again, is everyone in line is going to speak on this item. I'm going to close the speakers list. Everyone's in line. They're going to close the speakers list.'",
        "'speaker_0': 'Okay. Unless and I know we have a very long agenda tonight, unless there's any objection after the gentleman with the hat, we're going to go down to 2 minutes for speaker. Okay. Next speaker.'",
        "'speaker_2': 'Elegans. All that is on file. Um, I really appreciated a lot of the comments made by some of the council members. Um, I, I wanted to say that this will require a great deal of divestment on behalf of this city.'",
        "'speaker_2': 'As everyone knows, Long Beach's greatly invested in fossil fuels. Our city was founded on fossil fuels. We have a city that is actually a tax haven for the wealthy called Signal Hill in the middle of our city.'",
        "'speaker_9': 'All of these are sucking the resources from beneath.'",
        "'speaker_2': 'The planet at the expense of our future.'",
        "'speaker_9': 'At the expense of our water, at the expense of our air. It causes asthma. It causes heart disease. It causes cancer. People die. Babies are born at low birth rates. And this is the reality already. Now the sea level is rising.'",
        "'speaker_9': 'Mother Earth is about to do her due vengeance for all the hell that we.'",
        "'speaker_2': 'Have inflicted upon people, upon communities, for the wealth of our nation and of what we call the developed nation at the expense of indigenous lands and all of the earth. So now that we are at this planetary crisis, the globe is requiring a great cooperation.'",
        "'speaker_2': 'And in this great cooperation, we as a humanity must come together with an incredible amount of courage and speak out against the fossil fuels, the richest industry in the history of money, and tell them that enough is enough that we will no longer drill for oil, no longer drill for gas under our city.'",
        "'speaker_2': 'And I'm asking the members of this city council, do you have that courage for future generations? Do you understand that everything that we love is at stake? And I know that many of you.'",
        "'speaker_9': 'So-Called Democrats tend to say that you believe in this type of stuff. You like our speeches, you show up at our marches.'",
        "'speaker_2': 'You like you like what we're about. But when it comes to you taking the money from these industries, you don't have the courage to say no. You don't have the courage to say enough is enough. When it comes to the.'",
        "'speaker_9': 'Issues of this so-called action plan, are you calling for.'",
        "'speaker_2': '100% renewable energy like the science is calling for, or are you willing to work with some of your donors and find out what works for them?'",
        "'speaker_9': 'Because that's what's at stake. We're talking about asthma, we're talking about air.'",
        "'speaker_2': 'We're talking about everything that we love. We're talking about every precious child that you have ever met. What kind of future are you going to leave behind for them? I want to talk about some of the water that we're selling from the recycled water managed by the water department to the oil and gas industry.'",
        "'speaker_2': 'I believe that that needs to end. If we're going to talk about adapting our climate. Taking climate change seriously, we have to stop drilling. We should.'",
        "'speaker_5': 'At least stop selling.'",
        "'speaker_2': 'Them to water. I believe that we committed a great atrocity to the original people of this land, a people who believed in saving resources for the next seven generations. We are now taking the fossil fuel wastewater because there's a waste that comes from the drilling.'",
        "'speaker_2': 'Now all the good stuff is gone. They use fracking and acid dying to get that last bit from underneath the earth and it produces a.'",
        "'speaker_9': 'Waste and we're pumping that into aquifers.'",
        "'speaker_2': 'Here in California. I bet none of you are receiving any reports about that. That needs to be included into this report. You need to understand what is at stake.'",
        "'speaker_0': 'Thank you, Mr. Gonzales. And the Speaker, please come forward.'",
        "'speaker_5': 'Good morning, Mayor Garcia, City Council Member City Staff. My name is Alice Stevens, I I'm a resident of District four and a registered nurse who works with children in the public school system. I'm also a mother of two middle schoolers of my own.'",
        "'speaker_5': 'Happy birthday, Sophie. Who are very concerned about the climate and their future. So I helped to start a group called Long Beach 350, where a climate justice group that formed in 2015, right around the time, as Ms. been there, said that Mayor Garcia signed on to the Compact of Mayors.'",
        "'speaker_5': 'Now the Global Covenant of Mayors to commit our city to significantly reduce our carbon footprint. It was also the time when the Paris Climate Summit was happening and in which world leaders and later a network of our nation's mayors.'",
        "'speaker_5': 'Thank you, Mr. Garcia. Dr. Garcia. It agreed to work to limit our global temperature rise to 1.5 degrees Celsius. To put that in perspective, right now we are at a rise of point nine degrees. And I can say from based on our past recent summers, that's incredibly hot.'",
        "'speaker_4': 'Especially if you don't have a.'",
        "'speaker_5': 'So the our name the 350 and Long Beach 350 is comes from the parts per million of CO2 emissions in the atmosphere that scientists consider a safe level and comfortable climate in which to live. We're now hovering about 410 parts per million, and if we don't act now on climate change, it's going to climb much, much higher'",
        "'speaker_5': '. My kids don't want that and I'm sure none of yours do either. So I'm here to thank the city for committing us to undertake a climate action plan and having this presentation today. This is a crucial step for the city to protect our climate and also to make good on the commitment Dr. Garcia has made three years'",
        "'speaker_5': 'ago. Several of our Long Beach, 350 members have been attending the community workshops and open houses held by the city. And we've read the documents that are on the cap website. We appreciate having an open and collaborate collaborative process in developing the plan, not just with invested businesses, but with people invested that live here in the community'",
        "'speaker_5': '. Some of these members are here today to speak on the recommendations we have come up with to ensure the city has a plan that is ambitious, effective and built on the firm foundation of social justice principles. Thank you.'",
        "'speaker_0': 'Thank you very much. Next week.'",
        "'speaker_2': 'Good evening, Mayor Garcia. Council members and staff. My name is Erin Peterson. I'm a resident of the third council district and a member of Long Beach 350. I'm also a business major at Cal State Fullerton. It's important to me, as well as all of Long Beach 350, that the CAP include the goal of reaching net zero greenhouse'",
        "'speaker_2': 'gas emissions. A goal of reducing emissions by 60 to 80% would be laudable, but it would not be enough to correct the disastrous course we are now on. Many harmful and catastrophic impacts are already occurring, such as increasing frequency of tornadoes, storms and flooding.'",
        "'speaker_2': 'We must curb carbon completely. But committing to zero carbon is only half the goal. We must also make sure to achieve it as soon as possible and no later than 2045. We recommend this target year based on our reading of the warming of 1.5 degrees Celsius report developed by the Intergovernmental Panel on Climate Change for the Paris'",
        "'speaker_2': 'Agreement. Among the proposals presented by city staff today target option F specified net zero emissions, but not until 2050. We urge you to adopt this option, but modified to specify the year 2045. I'm especially concerned about making the cap as effective as possible because of my young age.'",
        "'speaker_2': 'The actions we take now will be mine and my generation's burden. And the work starts today. Setting a goal of net zero emissions by 2045 will give the city, its residents and businesses 25 years to meet the challenge.'",
        "'speaker_2': 'The consequences of failure will be disastrous. We cannot afford not to set ambitious goals. Thank you for your consideration.'",
        "'speaker_0': 'Thank you. Excellent. Next speaker, please.'",
        "'speaker_2': 'Good evening. My name is Dean Todd. I live in the seventh district. I teach at Cal State, Long Beach. I'm on the Science Advisory Committee to the CAP tonight. I don't have a blue T-shirt, but I'm with the Long Beach 350 also.'",
        "'speaker_2': 'We've came up with four recommendations. So the one I'm speaking on is this. The greenhouse gas inventory should include greenhouse gas emissions from the use of fossil fuels extracted within Long Beach city limits. You know, some people say that it's not our responsibility because the fuel is burned somewhere else.'",
        "'speaker_2': 'But for global warming, it doesn't matter where it comes from. It matters where it's burned. It can be burdened. It could be burned anywhere. We might not use it here, but it's it's only bought in order to be combusted.'",
        "'speaker_2': 'So the fossil fuels from Long Beach will add to global warming. So we need to acknowledge that reality and to include it in the greenhouse gas inventory. I think to do it is necessary, but it's also smart. Here's the necessity.'",
        "'speaker_2': 'We can't avoid dealing with climate change. The world is recognizing that we have to get down to zero emissions really fast. California is creating policies to do the same thing. That means to me that fossil fuels are going to be restricted in a lot of different ways and fossil fuel extraction is going to be restricted.'",
        "'speaker_2': 'That's going to do a lot of good things in making a transition to a different, better energy system. But it's going to be really rough in a lot of ways as well. So we need to start planning to do it.'",
        "'speaker_2': 'That's the smart part. Workers are going to lose jobs when it happens. It's got to be done, but people will lose their jobs. We have to make plans to help them. The city is going to lose revenues. That's going to depend on the budget with a big part of the budget from the extraction.'",
        "'speaker_2': 'We got a plan for that. Residents, workers and businesses will lose services or pay more taxes or both. So we have to make up we have to plan for that. So it's better to face reality and it's smarter to plan for it.'",
        "'speaker_2': 'So we would like to have the the fossil fuels, the emissions from the fossil fuels extracted in Long Beach included in the greenhouse gas inventory. It's our responsibility and it's the smart thing to do.'",
        "'speaker_0': 'Thank you. Thank you very much. Next week.'",
        "'speaker_4': 'Good evening, Mayor Garcia. Council members and staff. My name is Lillia and I am a Long Beach resident and.'",
        "'speaker_5': 'Also a member of Long Beach 350 Gorg. Everyone will be harmed by climate change, but some will be harmed more than others. The city's draft plan and workshop materials show projected flood impacts.'",
        "'speaker_4': 'Concentrated needed near.'",
        "'speaker_5': 'The coast and flood channels and heat island effect concentrated in the communities on the west side of Long Beach, where there are less parks and street trees. In addition to these geographic concentration consideration, residents with lower incomes and more social market.'",
        "'speaker_4': 'Marginalization will surely face more.'",
        "'speaker_6': 'Challenges in.'",
        "'speaker_5': 'Adapting to climate change and coping with climate disasters than wealthier.'",
        "'speaker_6': 'Residents.'",
        "'speaker_5': 'The Climate Action Adaptation Plan and the resources it guides must give priority to those who need them the most. This is common sense. The first step toward doing this would be to identify the vulnerable communities of.'",
        "'speaker_6': 'West Long.'",
        "'speaker_4': 'Beach by name in plan materials.'",
        "'speaker_5': 'They should then follow up with prioritizing the resources. Long Beach 350 Forward recommends an equitable allocation in which the bulk of the resources and funding, such as two thirds, is distributed to the most vulnerable areas where about half of the city population lives.'",
        "'speaker_5': 'There are the areas of high social vulnerability in the language used in the plan. Distributing an equal share to every part of the city would not fully meet the most, would not fully meet the most acute human needs.'",
        "'speaker_6': 'Thank you for your consideration.'",
        "'speaker_0': 'Thank you very much. Next week, Ripley.'",
        "'speaker_5': 'Good evening, Mayor Garcia, council members and staff. My name is Patricia Chen and I'm a resident of the Fifth Council District and a member of Long Beach 350. I'm also an urban planner, so I understand that plans and their implementation can have a major impact on the public some positive, sometimes negative.'",
        "'speaker_5': 'The cap is no exception, and Lillia just described how climate change impacts residences differently in different areas. And the CAP adds another layer to this and has additional impacts on residents. The city must take care in developing the cap to avoid exacerbating the negative effects of climate change.'",
        "'speaker_5': 'Where are the weather? Excuse me? Where there are burdens to be borne by the public, such as regulations or taxes. The cap must include consideration of how the burdens are distributed between residents and take care not to place disproportionate burdens on the most vulnerable communities.'",
        "'speaker_5': 'Similarly, where plan implementation makes benefits available, such as discounts, incentives, job opportunities and training, the plan must be developed to ensure the benefits are not skewed toward the higher income residents that need them the least. Some examples of careful distribution of benefits would be planting more street trees in areas of high social vulnerability and developing community solar'",
        "'speaker_5': 'implementation programs so that residents don't need to own a home to participate in energy that is cleaner, more cost effective and reliably available over the long term. Examples of Avoiding Harm or Disproportionate Burdens. One really big one would be when putting in transportation infrastructure.'",
        "'speaker_5': 'Always combine it with measures to ensure affordable housing to avoid displacement and gentrification. So to summarize. Well, okay, you heard it all. Thank you very much and thank you for your consideration.'",
        "'speaker_0': 'Thank you. Thank you very much. Thanks, Speaker.'",
        "'speaker_6': 'Hi, Karen.'",
        "'speaker_7': 'Recite a resident of the first district.'",
        "'speaker_5': 'Representing the Long Beach Gray Panthers. Mayor Garcia, we want to thank you for your leadership and this initiative. You've been one of the leaders out front and council members that have focused on these target areas. And the staff who Allison, Christopher, Linda and Fiona, you've just been amazing to work with and working on this project.'",
        "'speaker_5': 'The Long Beach Gray Panthers are one of the co-sponsors of the event, along with Councilmember Urunga and Long Beach, 350, and the citizens.'",
        "'speaker_6': 'Climate lobby being held.'",
        "'speaker_5': 'On March 30th at Silverado Park. We are going to focus on solutions that people can do to prepare. One of the reasons the building I live in did so well during the power outage was because we had attended cert training.'",
        "'speaker_5': 'We are going to encourage more people to go through cert training and have more emphasis and emphasis on climate action changes. We know the plan is going to evolve. This first attempt, we will make some mistakes. But the more aggressive we can get on the changes to move to a zero carbon emission city and the faster we'",
        "'speaker_5': 'can pastor, we can do it. We can potentially lower our ASM rates.'",
        "'speaker_7': 'I'm sorry, I have a little announcement.'",
        "'speaker_5': 'Tonight and we want to continue to focus on seniors. The heat really is absolutely critical.'",
        "'speaker_6': 'Libraries don't stay open very late. The building I live in.'",
        "'speaker_7': 'Cinder block.'",
        "'speaker_5': 'Construction. The heat emissions continue.'",
        "'speaker_6': 'Long after the 9:00.'",
        "'speaker_5': 'Closing times. And this is a big problem for.'",
        "'speaker_6': 'A lot of the areas of the community.'",
        "'speaker_5': 'That don't have ocean breezes. If those continue in the future. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'Good evening, counsel. I'm Grace Lorenson from the seventh District, and I'm also part of the citizens climate lobby. And I really appreciate everything that the city has been doing on this cap thing. And every time I go to one of the meetings, I say, And what about national legislation?'",
        "'speaker_5': 'You know, we've got to do something nationally. And the citizens climate lobby is very happy to let you know that there is a national legislation out now that could be promoted. And it's one that was supported by the California State Senate in in 2016.'",
        "'speaker_5': 'Quite a while ago I saw AJ are 43 and they said they approve a joint resolution calling on Congress to enact a carbon based taxed on fossil fuels and return the proceeds to low and middle income families. So that's something that our state, our state Senate and Assembly had approved.'",
        "'speaker_5': 'And the mayor has gone on record with the Council of Mayors. And I think that we need the city to at least look at the national legislation, and it's called Energy Innovation and Carbon Dividend Act. That's Energy Innovation and Carbon Dividend Act.'",
        "'speaker_5': 'It's H.R. 763. And it has been introduced to Congress. It's been supported by at least four religious organizations. I'm also a part of the Unitarian Church and many other organizations, so I hope you will look into it and support it.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Complete.'",
        "'speaker_10': 'Hello, council members. My name is Elizabeth LAMB, and I wanted to open my remarks with a quote that has stuck with me. And I had to research it and remember who originally said these words. And it was our president, Barack Obama, who said, we are the first generation to feel the effect of climate change and we are'",
        "'speaker_10': 'the last generation who can do something about it. It is sincerely admirable and important that the city of Long Beach is working to draft a climate action and adaptation plan. Of course, the low street of the wetlands will be affected because as sea levels rise, what were once wetlands will be converted into marine environment.'",
        "'speaker_10': 'Yet there will be no place for the wetlands to expand because they are hemmed in with housing. And conversely, wetlands are good for mitigating mitigating the impacts of climate change because they can absorb water. I'm here because the low street is wetlands, land trust.'",
        "'speaker_10': 'We concur with Long Beach 350 Dawgs recommendations to you. The one I'd like to talk the most about is incorporating the goal of reaching net zero greenhouse gas emissions and the target date for that emission, we agree, should be sooner should be 2045, which aligns with the goals and the science based policies for the greenhouse gas emissions'",
        "'speaker_10': 'included in the Paris Agreement. I understand from talking to the 350 dawg folks that they sent a letter to the council members with these three main points of zero emissions inventory, gas producing facilities, and then also this additional focus and resources for people who are in the most vulnerable parts of Long Beach.'",
        "'speaker_10': 'One of the things that struck me because I've been to these hearings is the effect it will have on your vulnerable population and also future generations. Thank you for your time.'",
        "'speaker_0': 'Thank you, Ms.. LAMB. Next speaker, please. And there are three final speakers.'",
        "'speaker_12': 'Hi. My name is Kevin Yeager. I'm a resident of Council District two and a member of the Long Beach Democratic Socialists of America. And we also support the letter of recommendations that Long Beach 350 has put forward. I just wanted to hit on a few points from there.'",
        "'speaker_12': 'Mainly the greenhouse gas reduction plan that staff suggest is just out of line with the current science. Unfortunately, the latest IPCC report warns unequivocally that without societal transformation and rapid implementation of ambitious greenhouse gas reduction method measures pathways to limiting warming to 1.5 degrees C and achievable.'",
        "'speaker_12': 'Sustainable development will be exceedingly difficult, if not possible, to achieve. So we need to decarbonize every sector of our global economy over the next 11 years, not the next 30 years that might be in line with the science five years ago, but it's not in line with the science today.'",
        "'speaker_12': 'So Long Beach needs an emergency plan to decarbonize our economy as fast as possible to avoid these catastrophic climate tipping points where it can trigger feedback loops that are become harder and harder to stop or impossible. So laying out multiple greenhouse gas reduction plans and then recommending anything other than the fastest action of those choices is, frankly'",
        "'speaker_12': ', climate denialism lite. And then furthermore, we also need to eliminate greenhouse gas emissions at the source. So that means we need to take into account all the fossil fuel extraction happening right here within Long Beach City limits to ignore the extraction that's happening here that goes on to be burned elsewhere.'",
        "'speaker_12': 'We're asking the poorest, most disadvantaged residents of south I mean, of central west and north Long Beach to take on the burden of these extreme heat days. Meanwhile, letting other corporations continue to profit off of this extraction, and that's completely unethical and just not going to meet the standards.'",
        "'speaker_12': 'So I'll just say that small change, big impact, that's just not true. Small and small change means extinction. We need to be clear eyed of the system change that we need to reach survival and not lie to the public about what will actually save us.'",
        "'speaker_0': 'Thank you. Thank you very much. Next speaker, please.'",
        "'speaker_6': 'Oh. Summer Hansen from Children's Day, An Earth Day celebration, 25th anniversary. We've been we've been on this path since the very beginning, in 1995. We've always had the very same motto since 1995 till 2019. Our motto is always do something wonderful to make our world a better place.'",
        "'speaker_6': 'And Children's Day is a gift that keeps on giving for generations to come. You'll know what your project is. Because you'll feel it in your heart. And my. One of my very best friends. Who is? You know, in her final days said to me yesterday.'",
        "'speaker_6': 'Have you solved all the problems in the world yet?'",
        "'speaker_5': 'Well.'",
        "'speaker_6': 'I mean, we can all have a you know, we all have all these wonderful projects that they're talking about. I mean, and you I know you've been hearing the young people, you know, and and especially Greta. Who is being nominated to get the Nobel Peace Prize.'",
        "'speaker_6': 'And I bet you anything. She's going to get it. And the kids are on the. They're on the path. And Edge share a park on April 20th that's going to be us sell a. You know, for Earth Day.'",
        "'speaker_6': 'And then the following weekend, it's going to be, you know, the Children's Day celebration. And it's all going to be about the environment. I mean, that's going to be the main, main focus. And that's what we all need to to do in every little thing that is thought of.'",
        "'speaker_6': 'It all adds up to. Completely turning everything around. And it's doing good. Is the best friend there is. And so. I know you all have wonderful projects. I hear about them every time I come here. And I'm so proud of all of the things that that you do.'",
        "'speaker_0': 'Thank you so much. Okay.'",
        "'speaker_6': 'Okay. Come on. Let's get with it. Let's all of us together.'",
        "'speaker_0': 'Thank you, Summer, for always promoting Earth Day and Children's Day.'",
        "'speaker_6': 'And we need those. And we definitely need those water fountains.'",
        "'speaker_0': 'Absolutely. Thank you so much, Summer. Our next speaker, please.'",
        "'speaker_2': 'Dave Shukla, resident of the third. As you all know, I've spoken here many times on this issue. The cost of inaction should definitely be calculated. The longer we take to pick an option, the longer we take to get a greenhouse gas inventory to come.'",
        "'speaker_2': 'The longer we wait, the more it costs. Equity is built into this in many different ways, not just through the cost of inaction, but also in what ways? Climate crisis. Can be made an opportunity and made an opportunity for jobs.'",
        "'speaker_2': 'Councilwoman Gonzalez, you had this great idea of replicating something like Lacey, maybe Labaki or something like that. We could be a leader in transitioning these jobs. We could be a leader in changing how we. Fill our budget. But at some point, the ability to choose for ourselves will be taken from us.'",
        "'speaker_2': 'The longer we wait, the more the will get boxed in not only by our own statutory commitments, but by the physics. It's just a reality. It's a reality. It's much more for my life than it is for some some people who are a bit older.'",
        "'speaker_2': 'But from the recognition that extreme heat will hit everyone in the city increasingly as it already has, as we've documented over the past ten years, we're going to need bigger, bolder stages of leadership. I mean, option F with a 2045 zero date would be great, 2030 would be even better.'",
        "'speaker_2': 'And it's it's not only possible to conceive, but it's possible to implement. The question of who pays should be linked with who'll be benefiting. I mean, ultimately, we, we supplement our and we largely have our budget come from the sales of oil.'",
        "'speaker_2': 'What happens when we can't do that anymore?'",
        "'speaker_0': 'Thank you. Thank you very much. Thank you, Richard. That good? That concludes public comment. I do have some speak. I want to just make a couple of comments and then just to react to some of what was said and have a and then it comes from among us going to be some comments.'",
        "'speaker_0': 'So. First, I do think and I'm glad this was mentioned. I think that the 2045 date we have to hit, at a minimum go down to 2045. I think that's been an international standard that's been set. I think some agencies and some some folks are talking about, you know, going earlier than 2045.'",
        "'speaker_0': 'And so can I just ask staff to just react to that? Obviously with presented in front of us is a draft and we're not, you know, we're we're moving forward. But is that something that we can do?'",
        "'speaker_11': 'So we're taking public input and we're taking direction from this council. We could certainly have a 2045 goal in addition to the 2050 that 2050 comes out of the Air Resources Board. So part of what we're trying to do is be aspirational and lead and be a climate leader.'",
        "'speaker_11': 'But part of what we're trying to do is also comply with those mandates that are coming down from Sacramento. So that's where the 2050 number comes from. It's not.'",
        "'speaker_0': 'Now, I know it wasn't just pick that out of thin air. I get that. But I also know that the 2045 date is being really pushed by it, by a lot of folks, you know, internationally. And so I think for us to to be a climate leader, to think that 2045 date mix makes sense for for Long'",
        "'speaker_0': 'Beach. And so I hope that the Council would support, as we receive it, file this to encourage staff to try to hit the 2045 date as part of this. And so that's going be my first request. The second thing is I do appreciate the comments around ensuring that the resources are going to communities that are disadvantaged.'",
        "'speaker_0': 'I think that's when you look at at heat in particular and where that is going to impact the city, it is directly going to impact disadvantaged communities and disadvantaged senior populations especially. And so I think those are issues that I think we have to consider as we move forward.'",
        "'speaker_0': 'And then the request and this is really a broader conversation, I think that we have to we have to continue to have but the request to also look at the the emissions that are coming from locally created into the fossil fuels that were that are happening every single day in the city and the inventory around that and'",
        "'speaker_0': 'the greenhouse gas emissions, is that something that we're also intending at looking at? And can we look at that?'",
        "'speaker_11': 'So, Mr. Mayor and members of the Council, at the request of the public, that analysis is underway. We're having to work with the consultant team to write a methodology in order to do that, because the state guidance says not to do it that way.'",
        "'speaker_11': 'So what we will have is two separate inventories, one that meets the state standards, and one that is what the public requested, which is to look at the extraction side rather than the consumption side. And and that work will be complete this summer.'",
        "'speaker_0': 'That's that's great. You know, let me just say on this issue, because I think it is to me, it's it's it's the issue of the future when we're talking about issues around climate and climate change and climate justice is it's no secret that the history of Long Beach, it's current funding mechanisms.'",
        "'speaker_0': 'And the way we, quite frankly, fund many of the programs that the community enjoy has been through the production of oil. And this is not something that's new or just happened ten years ago. This has been literally how the city was founded.'",
        "'speaker_0': 'When you look at when you look at Signal Hill, when you look at Long Beach, when you look at the Tidelands, the port, and what's happened, not just in Long Beach, I mean, this extends out to the Los Angeles patient and the whole San Pedro Basin as well.'",
        "'speaker_0': 'And we, I think, have and I and I understand and I think that the the the city, not just this council, but the city has been shy in its reaction and in its approach to having a bigger conversations around oil and its impact on us, on climate and on the bottom line of the city.'",
        "'speaker_0': 'And that's a real conversation that that I think we need to have at a more serious and more comprehensive level. I think it's something we've discussed in the past. I know that there's some that would like to change, make changes tomorrow.'",
        "'speaker_0': 'And I understand that so much of the city is is connected to this funding mechanism that we have had for such for decades for since the founding of the city. And so I just think that the climate adaptation process that I've been so impressed with, I think you've done our staff and Mr. West, I think you should'",
        "'speaker_0': 'commend the entire sustainability team for just the process, the fact that the community's been involved. I think there is an opening to have a positive conversation and a planning conversation around one, how we have this broader conversation around the fossil fuels that we are producing every day and to how long term we continue to operate depending on'",
        "'speaker_0': 'a resource that is that is one not not good for the long term life of the planet and our community, but one that that every agency from the state to the country to the city, is focused on trying to diminish its use and what that actually does to impact the parks and the firefighters and the paramedics that'",
        "'speaker_0': 'that we are funding with with this resource. And so I would hope that through this. Process in the years ahead that we that we do, we begin to plan and have an honest conversation about where we're going on on this issue.'",
        "'speaker_0': 'Even though I know it's a difficult one to have, I think it's one we have to have. And it's and it's time. And so if we can. I'd love to see that incorporated into the community dialog. And I appreciate the work that you guys are doing on that.'",
        "'speaker_0': 'So thank you very much. And with that, let me move to Councilwoman.'",
        "'speaker_10': 'So my comments will be short. I have to take a quick mommy pumping break and come back so I might not be able to vote on this item, but know that I'm with you in solidarity. I just want to tell you how impressed I am with each and every one of you and how you've interacted with our'",
        "'speaker_10': 'offices. I really appreciate the way that you've educated us without really chastising any of our constituents or the way that they feel. And the dialogs, both on Facebook and anywhere else have been very positive. And I really appreciate that a lot of people believe in what you're doing.'",
        "'speaker_10': 'I think you've organized well. I think that you brought a lot of important information to the table. And from listening to you today, I took some notes and I'd like to ask that our federal legislative agenda consider supporting some of the items that they've discussed with us tonight.'",
        "'speaker_10': 'And so if that could come back through our committee process, I think that that would be great. And I'd love to see some of you attend that meeting. A lot of the work actually gets done at committee. And so we appreciate you coming tonight and being very informative and especially knowing how long our agenda is for taking'",
        "'speaker_10': 'the 2 minutes and being precise. So appreciate that. And I want to see what you're talking about come to fruition because it's really important for our children and our children's children. And I'll be back in 15 to 20 minutes.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilmember Pearce.'",
        "'speaker_6': 'Yes. I want to thank everyone who came and spoke tonight, everyone that's been involved. I want to make sure that I think staff I know that it's been a big lift. And I especially just want to take a moment to thank Mayor Garcia for your leadership.'",
        "'speaker_6': 'When I think about eight years ago when I came to council on that side, the leadership to really tackle climate change was was not really here. And so I really want to applaud you for that. And I think that's in response to community groups organizing and educating and really working not only on this issue, but on issues'",
        "'speaker_6': 'like community choice aggregation. And so I look forward to working with staff. And again, just want to thank you guys for the work. I know we'll get that meeting in April. Thank you.'",
        "'speaker_0': 'Thank you. And Councilwoman Gonzales. Yes.'",
        "'speaker_4': 'I'll close the loop here by saying also thank you to the organizations LP 350. I was going to say as well, your work with us so many times on community choice aggregation as well as I don't Where's Karen?'",
        "'speaker_4': 'There she is. And I remember downtown going dark for about a week and that was really awful for us and having these opportunities to discuss with you. And I look forward to continuing the discussions with each of you on how we can better this plan and make more detailed and more ambitious goals.'",
        "'speaker_4': 'I agree. I do remember back in 2014 I actually asked for a report on cap and trade dollars that may be coming back to some of our disadvantaged communities here in Long Beach. I'm wondering if we can dig that out of its grave and bring it back and see.'",
        "'speaker_4': 'I know that the state legislature is going back and forth on what defines a disadvantaged community, but it would be really good to get some additional information on that relative to Long Beach and how we can start planning ahead for that.'",
        "'speaker_4': 'So that was back in, I want to say, 2014, 2015. That's some time ago. But I would really like us to look at that and bring that back in a two from four or in an additional forum where we can discuss this with with the public.'",
        "'speaker_4': 'And I believe I worked with Dean on that. That was a long. Do you remember that? It's a long time ago. So we should do that. Thank you.'",
        "'speaker_0': 'Well, thank you very much. And again, thanks to staff. And I know if you keep thinking or sustainability team, but the planning team and the planning department I know are taking the lead on this. So I just I'm looking at the planners over here and I want to also thank our sustainability team because they're doing their work'",
        "'speaker_0': '. You're all working so so thank you. With that that there's a motion to receive and file. But I want to make sure that the motion received properly includes the 2045 target and it and I'm glad that we're already working on the inventory for the city emissions as well on the on the fossil fuels.'",
        "'speaker_0': 'And so please cast your votes members on those on that receiving file.'",
        "'speaker_1': 'Motion carries. Great.'",
        "'speaker_0': 'Thank you, guys. And I want to thank also just, you know, 350 just for the work. You guys are amazing organizers and you're actually making a real big impact. And so I just want to let you guys know that the volunteer hours and coming to council and sending letters and meeting with members of the council and the'",
        "'speaker_0': 'staff, you're actually changing policy by interacting with people and and I believe working in a way that's collaborative. And so just think of just the group and you're certainly impacting the staff in the council. So I appreciate that.'",
        "'speaker_0': 'And let me move on to some public comment here. Thank you, guys. So that concludes me close that hearing. And first up, I have is I'm going to have Summer and Jim who are here for the same item come up.'"
    ],
    "Report on Long Beach Community Paramedicine Program.": [
        "'speaker_0': 'Thank you, Mr. Armstrong. That concludes public comment. We are moving on to item 24, please.'",
        "'speaker_1': 'Communication from Councilwoman Mango, Councilwoman Price, Councilmember Super nor Councilmember Richardson recommendation to authorize the City Manager, Fire Department, Health Department and all other appropriate departments report back in 120 days on the potential costs, benefits and challenges in forming a Long Beach community paramedic and program District five.'",
        "'speaker_10': 'Thank you. So for those of you who are not familiar with the community paramedics model, there are many of them that are in pilot phases across the country. It's a model that's based on a health care system designed to provide more effective and efficient services to our residents community.'",
        "'speaker_10': 'Paramedics in often allows ambulances to drop off at urgent care centers versus the hospital. It also allows them to drop off at sobering centers and other facilities that are appropriate to be allowed to do that. The paramedics kind of it allows them to function outside their traditional role and utilize their specialized training to work in a model'",
        "'speaker_10': 'that can take it from a place where our ambulances are called to holding the wall, which is standing, waiting for admission into our ERs to actually being able to drop patients at the appropriate care facilities. In 2015, the California Emergency Medical Services Authority, the M.'",
        "'speaker_10': 'S.A., worked in partnership with the California Health Care Foundation and conducted 13 community paramedics and pilot programs in a dozen different locations. And under the pilot, the community peer medicines provided short term follow up care after hospital discharges for people with chronic conditions.'",
        "'speaker_10': 'You may remember that our innovation team did a study of the number of individuals who are connected to multiple departments within the city. And sometimes the data related to these individuals is that they're taking the wrong medicines and they are consistent callers to 911 because the issues aren't being resolved, whether it's long lines or wait lists for'",
        "'speaker_10': 'their health care provider or they don't go to the doctor, they only use the nine on one system. And those short term follow up visits have seen significant improvements in the L.A. County model. Case management services to those frequent users of the EMS system also help allow those resources to be freed up for our very important residents'",
        "'speaker_10': 'that are calling in on one and then directly residents and or visitors directly observed therapy for people with tuberculosis. Other collaborations include collaborations with hospice nurses to reduce unwanted transport of hospice patients. I recently did a ride along with an agency and we were often visiting hospice facilities and the caretakers at the facilities weren't sure if a'",
        "'speaker_10': 'transport was necessary. But to be on the quote unquote safe side, then the individuals were being transported, which then in resulted in holding the wall, waiting for admission. So then that unit couldn't get back out into the field.'",
        "'speaker_10': 'Transportation for people with mental health needs to mental health crisis centers, transportation for people who are acutely intoxicated to sobering centers and patients with low acute medical conditions to urgent care centers. The Health Force Center at UC San Francisco conducted an evaluation of the pilot projects and found that community paramedics are collaborating successfully with physicians, nurses, behavioral'",
        "'speaker_10': 'health professionals and social workers to fill in the gaps in our health and social services safety net. So the evaluation yielded consistent findings that programs have improved patients well-being and have yielded savings for both the taxpayer and the health care systems.'",
        "'speaker_10': 'And since Long Beach has its own health department, our own paramedic services and several hospitals, hopefully another one coming back online soon and numerous clinics. Which we also need to talk about the lack of urgent care centers in some parts of our city.'",
        "'speaker_10': 'We have health care deserts that I know some of my colleagues have discussed extensively. This would help us potentially create a new model for community health care for Long Beach residents with a more effective and efficient method of serving high quality health care needs, high quality health care to the needs of our participants.'",
        "'speaker_10': 'So we really appreciate staff taking the time to look into what might be possible and how that could best serve the residents of Long Beach. Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Councilmember.'",
        "'speaker_11': 'So, Councilmember Richardson. Thank you.'",
        "'speaker_8': 'Councilmember. So. So I've learned a little bit about this this presentation. Thank you, Councilwoman Mo Mango Mobile. And I spoke with our local firefighters.'",
        "'speaker_11': '1/2, Councilman. Can is there a second on this motion? Okay. Thank you.'",
        "'speaker_8': 'Thank you for that point of order. So there's you know, so I spoke with our local firefighters about the problem. And it makes sense to me if we see that there's pressure on our local emergency rooms. We've had a lot of conversation about what happens if an emergency room I mean, if you lose, let's say a paramedic'",
        "'speaker_8': ', it puts pressure on the entire system. Or if you you know, if in a trauma center, emergency room shuts down how it impacts the entire system. And so these pilots, one of the it seems like not many of the pilots are going to have an opportunity to advance, except for this one, which is really focused on identifying'",
        "'speaker_8': 'urgent care centers as a space to sort of add into the component. What I think is interesting about that is. It allows, you know, more relief to the system in areas where you may not have very many resources in terms of paramedic rescues or access to emergency rooms, you can deploy to an urgent care center.'",
        "'speaker_8': 'So that makes sense. But it's also been raised to me the issues concerning, you know, the triage process. So in an emergency room, there's training about triage. And these are ins that conduct, that training. And so they're trained about assessing and understanding, hey, is this a stroke?'",
        "'speaker_8': 'Is this a certain type of emergency? And this is how it's treated. And so, you know, the big issue at hand here is figuring out whether, you know, there are things or, you know, people who are trained or if our emergency rooms are for firefighters, if we're hiring Marines to make sure that triage, if it's happening at'",
        "'speaker_8': 'a separate point, is happening at the at the E.R. instead of the emergency room stages happening at the paramedic stage. How do we make sure that the way is designed? You know, it's informed by our trains and nurses and make sure that, you know, we're not somehow creating a bigger issue.'",
        "'speaker_8': 'And so in general in general, I'm supportive of this conversation, exploring it. But I want to I think that we need to make sure that we engage with our nurses, our CNA, our nurses association, WINGARD Engage with our firefighters, the fire department, local hospitals.'",
        "'speaker_8': 'And so as we evaluate this, I think all those people need to be at the table to figure out, like, what are we what are we doing? Is this possible or is this a good thing or are we creating issues for ourself?'",
        "'speaker_8': 'And that's really what we need to figure out. The second thing I would say is we're having a conversation and this conversation has really kicked up and it's really come out of the community hospital conversation about, you know, where where are the areas in town that lack urgent care centers in general.'",
        "'speaker_8': 'I know that, let's say in my district on the east portion of my district, we're adjacent to Lakewood Regional, which is an emergency room and typically urgent care centers locate near emergency rooms. And so on one side of the district is walking distance access to an emergency room and urgent care centers on the other side of the'",
        "'speaker_8': 'district, which, you know, which is interesting. It's, you know, is geographically, economically, racially, very different. And on that side of the district, you know, there isn't you know, there's one paramedic rescue and there's no urgent care center, you know, no emergency room.'",
        "'speaker_8': 'And so the response time in that area of area town is completely different. So we'll be having a conversation about economic development in a conversation at council about how we can identify these sort of urgent care deserts in our city, because we've noticed that they exist on the West Side, they exhaustion exist in North, and they actually'",
        "'speaker_8': 'exist in the fifth District as well, East Long Beach. How can we leverage our economic development opportunities to to figure out how to, you know, bring in these urgent care centers into these other areas of town? And how do we incentivize them to actually stay open in evening hours when people are home from work?'",
        "'speaker_8': 'The idea is how do we make sure if people know that they have these facilities in their community, have the access them to take pressure off the emergency rooms? So I think so. There's a lot here to dig in.'",
        "'speaker_8': 'I'm okay with exploring it, but we all need to make sure that we, you know, engage with our nurses, engage with our firefighters, make sure that, you know, we're very aware of what we're doing as we move forward.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_10': 'Thank you for that.'",
        "'speaker_11': 'Yes. So I'd like to recognize our council member, Urunga.'",
        "'speaker_2': 'Okay. I'm sorry.'",
        "'speaker_11': 'Councilmember Supernova.'",
        "'speaker_2': 'Thank you. I just want to and maybe we get clarification from the city manager. So this is not the report coming back. This is an item that I seconded for you to explore whether or not we can do a report and incur those costs.'",
        "'speaker_2': 'Is that kind of accurate or how would you frame it? We're coming back with a report that outlines what the what this is, how much it costs, the benefits, pros and cons and things like that. So there would be a follow up report to that report.'",
        "'speaker_2': 'So this would be an interim step we're approving tonight. The council tonight is requesting us to come back with a report to see if this type of a program is feasible.'",
        "'speaker_5': 'Not yet.'",
        "'speaker_2': 'Okay. Well, that's differs from the understanding I had yesterday. So I just wanted to say that the fire is listed here. And I agree with Councilman Richardson that we learned so much from the community hospital experience. I never knew there were that many agencies.'",
        "'speaker_2': 'I learned a lot more acronyms of county and state agencies overseeing this. So. Let me ask staff again. Are there any costs associated to you bringing what you are bringing back at this time? Just the time and energy to research this and come back within the time period necessary.'",
        "'speaker_2': 'Okay. So will that be delineated in some form either tonight or at an interim step before you come back? No, we're going to come back. I think it's within 120 days. We'll probably give you an update if we're having difficulty coming back in that time period.'",
        "'speaker_2': 'But we're going to go ahead and just I believe our public safety team is somewhat familiar with this program. So they'll just outline that and talk about the.'",
        "'speaker_9': 'Pros and cons and the costs and a recommendation.'",
        "'speaker_2': 'Okay. Thank you. Come on.'",
        "'speaker_11': 'Councilmember. You want to.'",
        "'speaker_3': 'Add.'",
        "'speaker_2': 'Thank you. Interim vice mayor acting out by acting. You're one of the. Concerns that I had when I first became a council member here was we came in with like slinging guns and we wanted studies on this studies and then we were studying everything and it was costing staff a lot of time for not only doing those'",
        "'speaker_2': 'studies, but also in terms of the resources that were needed to go into it, especially in studies that were not fully vetted in terms of where we were presenting that study. And I'm not very sure that I'm ready for this study yet.'",
        "'speaker_2': 'I haven't heard anything from nurses. I have not heard anything from firefighters or police officers because it involves all our our first responders when it comes to these types of issues. And our first responders are not here tonight that I can ask them whether it's something we should pursue.'",
        "'speaker_2': 'With all due respect to the to the my councilmember in the fifth, you know, I think that we need more information before we can continue on into a study like a pre study type of thing. Because it's it's one of those things where I'm not very clear as to what this is and what its end game is'",
        "'speaker_2': 'going to be. The endgame, I'm guessing, is eventually create some kind of prayer and medicine response team, if you will, and what is that going to entail and how much of a cost it's going to come to the city?'",
        "'speaker_2': 'How much more staff time it's going to take to put someone in a ambulance or in a police car? What what the what the dynamics are going to be of such a such program? It's the first time I've heard about it.'",
        "'speaker_2': 'I don't have any information on it that would be present to me tonight. And so I'm not I'm not ready just yet to to pursue this, but I'm willing to listen to my colleagues.'",
        "'speaker_11': 'Councilmember Pierce.'",
        "'speaker_6': 'Thank you. I want to say I applaud the goals and the intent of this item. Obviously, I think we all kind of had our our run at trying to assist in making sure our response times are better and making sure people have access to health care.'",
        "'speaker_6': 'You know, I guess I have a couple of questions in regards both to that I haven't heard from either nurses or fire, but also questions on any legal concerns. Would we be at risk for any lawsuits? And so when this comes back, if you could outline any legal concerns and then I have a question on our heart'",
        "'speaker_6': 'teams and how would this overlap or would it complement, since we've already, as a city invested in hard teams, we've expanded our heart teams. Is there opportunities there to utilize that and maybe build on that as well? So those are some of my my general questions.'",
        "'speaker_6': 'My my staff gave me about five pages of notes of pros and cons and, you know, sort of respectfully seeing that it's a report to come back. I look forward to those next steps.'",
        "'speaker_11': 'So I will weigh in at this point. I had a couple of things that I liked, the way we are going with this. Councilmember Mungo I think this is a very insightful item and in the conversation should be had about how we can be more strategic in and and utilizing our resources.'",
        "'speaker_11': 'I thought some of the comments from my colleagues.'",
        "'speaker_3': 'Were, were.'",
        "'speaker_11': 'On point and and I think developed deserves some some attention and and exploration. And so, you know, I'm not sure that that all of this is going to be. The study can be done in a six month period.'",
        "'speaker_11': 'I'd like to just offer a friendly amendment or a friendly to you, too, to include in this within that 120 days. A forum during the Public Safety Committee. To allow the stakeholders to weigh in on the process. And and that will that will help us as a council kind of shape where this is going.'",
        "'speaker_10': 'I appreciate the option. I think that one of the reasons I'm asking for the item is there's so much diversity in the way that these are being rolled out. So you have some agencies that want to have like a nurse at dispatch.'",
        "'speaker_10': 'You have some agencies like L.A., FDA, that put a nurse on the ambulance. You have some agencies who have a doctor. L.A. County has a doctor that gets into the ambulance and does the follow up, and they're using them all as pilot.'",
        "'speaker_10': 'So I don't really know what. All the options that are even out there. So I absolutely would love to have it go back to public safety. I just was hoping for a quick gloss over of. What's out there in the area that's moving to the next step?'",
        "'speaker_10': 'What has items looked at and would any of them be even possible in Long Beach and or not? And so I wasn't looking for an in-depth study. I was only giving 120 days because I was being generous. Not that it would actually take stuff, any kind of significant staff time there is a fiscal outline at the bottom'",
        "'speaker_10': 'and I ran it by financial services in advance of the item in accordance with the fiscal policy, and I'm completely open to sending it to committee for a report back. If it's easier on the staff to do a verbal report than a written report, I'm open to all of that.'",
        "'speaker_10': 'I just know that the dialogs are going on out there and I didn't want those dialogs not to have Long Beach. I want us to be informed so we can decide if we want to engage in those conversations.'",
        "'speaker_11': 'And I think the point of me and thank you for accepting the recommendation to opt to send this to public safety committee. And in part of my my rationale for for suggesting that is just to give me the opportunity to for other colleagues to have an opportunity to.'",
        "'speaker_10': 'Absolutely.'",
        "'speaker_11': 'Review this and understand what this is. And and this is actually kind of new to me. But again, I'm I'm wide open. I think this is a this is headed in the right direction. I just want to make sure that we are processes, our arms are are tight, intact, but also that we're offering opportunities for for stakeholder'",
        "'speaker_11': 'involvement. More public comment?'",
        "'speaker_10': 'Absolutely. I think this goes to the point of our long council meetings. It's tipping on 9:00 at night. And the population that's most impacted by this are poor communities that have children at home that need to be in bed, and our senior communities that often don't want to drive after nighttime, much less commute across downtown because similar'",
        "'speaker_10': 'to Councilmember Richardson, we have the farthest drive to the hospital from a paramedic unit. And so those are the constituencies that probably want to be involved in the conversation. But as we know this but this body has quite a lot to hear at the dias.'",
        "'speaker_10': 'And so these conversations get late. I have had several conversations with our Fire Fighters Association over the last two years about the potential interest. He also brought some points to light that need to be discussed before we would be there.'",
        "'speaker_10': 'But I also recognize that as those summer months come and the agendas get even heavier, I mentioned that I'd like to at least get it on on the radar of city staff, and not that it would take 120 days, but just a few hours of staff time to pull that all together so that we at least would'",
        "'speaker_10': 'have the options to know and understand what's being discussed. And even if we do not choose to go this direction, I think it's still informed that other agencies know our opinions and for us to be able to voice those strongly.'",
        "'speaker_10': 'So thank you for the recommendation. Absolutely.'",
        "'speaker_11': 'Great. So we will now go to Council Supernova. Oh. Was that your. You were cued up again. Oh, great. Thank you. Councilmember Silvano.'",
        "'speaker_2': 'Okay. So the friendly on the floor is to send it to the Public Safety Committee. I sit on that committee, and I just have to say that for the next 90 days, my focus will be the community hospital and getting that facility open.'",
        "'speaker_2': 'That's a primary concern that I can't have any distractions from. So. That being said I welcome to support that friendly. Thank you.'",
        "'speaker_11': 'Councilmember Gonzalez.'",
        "'speaker_4': 'Yes. Thank you to my colleagues for bringing this forward. I think the spirit of the item absolutely gets to the heart of the issue, which is ensuring that we're being expedient and efficient with our public safety resources as much as possible.'",
        "'speaker_4': 'I, too, want to just say that I would like us to incorporate the discussion around the triage issue respective to the scope of practice that nurses provide. And I think that's really an important discussion we should have. And Public Safety Committee as well as the who would be who had been conducting these pilot programs, because we know'",
        "'speaker_4': 'that some of them may have been for profit ambulances and we want to make sure that it's done with the right intent for our city so that it it gets to the heart of the issue, as we discussed.'",
        "'speaker_4': 'But I really like this and I know working with firefighters and and everyone at the table, we will get to a good place. Thank you.'",
        "'speaker_11': 'Okay. Councilmember Mongo.'",
        "'speaker_10': 'I want to appreciate Councilman Gonzalez for bringing up that point. I think that that is not being said a lot in the public forum in some of these other cities. And so I think that's one of the reasons that it's so important that we discuss it in a city as big as ours that has the complexities.'",
        "'speaker_10': 'Ours does. Some of these cities don't even have hospitals within their boundaries. Some of these cities don't do bills or transport. And so it's just a very different dialog that is going on around us. And I feel like since we are surrounded by other cities, serviced by other agencies, some of which have started down this path, we'",
        "'speaker_10': 'at least need to know what that means. And so I'm excited to hear what that means. Thank you.'",
        "'speaker_11': 'Members. I think that is there. So have we done public comment on this? Is there any public comment?'",
        "'speaker_3': 'The notion that. Good evening.'",
        "'speaker_5': 'Tiffany Davis speaking. I just wanted to say that I support this.'",
        "'speaker_2': 'Item and I look forward.'",
        "'speaker_3': 'To.'",
        "'speaker_5': 'Also possibly hearing input from.'",
        "'speaker_3': 'SEIU. I know that there's a large contingency. As someone who has been a caregiver for the past decade for chronic kidney disease patient.'",
        "'speaker_2': 'That this would probably alleviate the situation that I.'",
        "'speaker_9': 'Deal with in emergency rooms quite often.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_11': 'Zero. Further public comment. Harry Nunn members, please cast your vote. And let me just clarify the motion. It was to to support this item and send it to public safety. That's correct.'",
        "'speaker_9': 'Right. And just from a staff perspective, so we think we're being asked to have the discussion on public safety, bring what what information we can readily bring, and then receive additional direction of public safety, if that's correct.'",
        "'speaker_2': 'Correct. Okay. Thank you.'",
        "'speaker_11': 'So moved. Please cast your votes.'"
    ],
    "Update on Laura's Law Implementation and Funding by the County of Los Angeles.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Next item, please.'",
        "'speaker_1': 'Communication from Councilwoman Price, Councilmember Pearce, Councilmember Supernormal Councilmember, but ongoing recommendation to request the city manager to provide an update within 60 days on Laura's Law.'",
        "'speaker_0': 'Okay. Councilman Cooper now.'",
        "'speaker_2': 'Thank you. Councilman. Woman Pryce had to leave early, but she asked me to go ahead and forward this on to make the motion. And we look forward to getting our report back. Thank you.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_10': 'No comment. Just supportive of moving adam ford.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_8': 'Thank you. I'm I'm okay with receiving the report here, but I want to make sure that there's a lens on. There was when this law was passed, there was a lot of conversation about patients rights and a lot of the patient rights advocacy groups.'",
        "'speaker_8': 'ACLU opposed it, giving the debate about folks don't really they're not open to services until they're fit, until they're open to receiving them. And it's a fine line when you force services or you commit a patient. And, you know, I know just from personal experience and family members, sometimes you want to just say, I wish I could'",
        "'speaker_8': 'just commit this person, but, you know, for one reason or the other. But there are you know, there are rights. And so it's a it's a it's a it's an interesting balance here. But I want to I just want to make sure that that is reflected in the report, that we have a full understanding of how that's'",
        "'speaker_8': 'being addressed in the L.A. County pilot. So that would be my feedback here.'",
        "'speaker_0': 'Thank you. Accounts will appear.'",
        "'speaker_6': 'Yes, I signed on to this item to get the report, but I want to make it clear for the record that I'm not somebody that condones and supports criminalizing people that are struggling with mental health. And I do know that mental health, patient rights, California Mental Health Coalition, a long list of other organizations have not supported, you'",
        "'speaker_6': 'know, these actions. So I do want to hear the report from city staff and I want to understand other options to be able to support those in our community that are struggling with mental health and how we can incentivize them are receiving support.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Any public comment on the item saying Now please cast your votes.'"
    ],
    "Contract with Acme Auto Leasing for Electric Vehicles and Equipment.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please.'",
        "'speaker_1': 'Report from economic development recommendation to authorize the city manager to enter into an agreement with the California State University of Long Beach Foundation in an amount not to exceed 1 million District one.'",
        "'speaker_0': 'We heard this one already.'",
        "'speaker_1': 'This is. I'm sorry.'",
        "'speaker_0': 'Next item, please.'",
        "'speaker_6': 'It's.'",
        "'speaker_5': 'Item 28.'",
        "'speaker_1': 'Report from Financial Management Recommendation to adopt a resolution authorizing the city manager to enter into a contract with Acme Auto Leasing for a total amount not to exceed 2,000,310 930.'",
        "'speaker_6': 'Citywide.'",
        "'speaker_0': 'With in motion and a second public comment. CNN members. Please cast your votes. Actually, Councilman.'",
        "'speaker_2': 'Cast your.'",
        "'speaker_11': 'Vote. I just wanted to point out that this is for purchase of electric vehicles. So city heading in the right direction?'",
        "'speaker_2': 'Absolutely. Thank you.'",
        "'speaker_0': 'Item 29.'"
    ],
    "Report on Vector Control Funding Measure Survey and Preliminary Development of Benefit Assessment District.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Item 30 Report from Health and Human Services recommendation to receive and file a report on the results of a survey to for a vector control funding measure in areas of the city not currently covered by a benefit assessment, and to proceed with preliminary development of the engineer's report and ballot preparation to establish a benefit assessment district at'",
        "'speaker_1': 'the rate of $8.21 per single family residents per year and returned to City Council for final review and approval in May of 2019. Citywide.'",
        "'speaker_0': 'There is a motion on a second and I do think we need to hear a report on this because this is an important one. So I'm going to turn this over to Mr. West.'",
        "'speaker_9': 'Thank you, Mr. Mayor.'",
        "'speaker_0': 'Councilmember, I may refrain. They're all important, every item we have.'",
        "'speaker_2': 'On every item.'",
        "'speaker_0': 'But this is one of of high interest to the public.'",
        "'speaker_2': 'Just as important as all the electrical vehicles are. Just pop Kelly Collopy and Nelson CR.'",
        "'speaker_13': 'Good evening, honorable mayor and Council Members. The item before you tonight is a continuation of the Vector Control Benefit Assessment Project, which we originally approved by the Council in October of 2018. We've updated you with a memo in January of 2019 to let you know the progress.'",
        "'speaker_13': 'As a reminder, the purpose of this project is to explore the feasibility of establishing a benefit assessment to fund vector control services in parts of the city that are not currently covered by a benefit assessment. This represents approximately 60% of our city and includes areas touching, at least to some extent, on each council district.'",
        "'speaker_13': 'As the world becomes more connected, we're seeing new vector borne diseases and species emerging in Southern California. These present serious and complex public health issues to our community and require intense resources to properly address including coordination, equipment, materials, human resources, door to door efforts and many other pieces.'",
        "'speaker_13': 'This increase in demand makes it necessary to explore this benefit assessment project. This project involves multiple steps which we have shared with you in the past. Includes the survey to gauge the level of support and the priorities of the impacted parcel owners.'",
        "'speaker_13': 'The survey results and recommendations are what will be covered tonight. So with that, I have our Environmental Health Bureau manager, Nelson Kerr, and the SCA president John Bliss, who is our consultant on this effort. And Nelson will present the survey findings and John Bliss and Nelson will be available to answer questions.'",
        "'speaker_2': 'Okay. Thank you, Director Colby. I would first like to acknowledge the engineering consultant, C.I., Maria Adobe and Jean Bless for putting together this information. I would like to give an abbreviated version of this report. You have the full report in front of you, and I'll try to get to questions and answers as quickly as we can.'",
        "'speaker_2': 'Kelly, can you help me advance the slides to number seven, please? Okay. Basically, what we're here to talk about tonight is the results of a survey that Kelly mentioned earlier. The the the two scenarios that we tested were two different rates.'",
        "'speaker_2': 'We wanted to see what the level of support was. So we tested two rates. One was $8.21 per year. And another the other rate was $14.92 per year. We did mail out about 2000 sample surveys, and we did receive almost 3000 back, which is a really good rate of return.'",
        "'speaker_2': 'Normally, we get between eight and 10% back. We received close to 15%, which is a really good rate and creates a good survey result that that is more reliable are margin of error on the survey was plus or -1.75.'",
        "'speaker_2': 'Normally or typically, we'll see a margin of error of between three and four. So we're very pleased with that. The result. Okay. Next slide, please. Thank you. Okay. This is the. The level of support was very strong among the single family home owners coming in at 67.9% for the $8 and 20 $0.01 rate and still strong at'",
        "'speaker_2': '62% support for the $14 and 92 cent rate. Now, that was for single family home owners only. Okay. Now, this next slide does show the different the different property types and the support there. You see, the support is a little bit less than some of the other property types, but still very strong overall for the single family'",
        "'speaker_2': 'residence. And you see on the bottom, the overall support for just supporting an assessment in general is 52.3. Can we skip to Slide ten? Okay. Here we are at slide here. Yep. Okay. So this is the overall support for both rates.'",
        "'speaker_2': 'So you see that there's the the rate of $8.21 has a support rate of 53.7%, which is above the 50% threshold. And that's that mark that we're looking for is that 50%. And the other the other rate is also supported at 50.8%.'",
        "'speaker_2': 'The engineering consultant recommends moving forward with the $8 and 20 $0.01 rate due to the high accuracy of the survey. They're very confident in the survey results and also because it's within the margin of error of 1.7 plus or -1.75.'",
        "'speaker_2': 'The the $14 and 92 cent rate is not within that margin of error. So the consultant recommends the $8 and 21 rate. Can we skip to number 14? Okay. Thank you. So number 14 go is a summary of the the other part of the survey that we looked at, the rate that they would support and we looked'",
        "'speaker_2': 'at the priorities of our property owners. And I just like to restate and remind that this survey only went to the property owners in the impacted district that we serve. So among the property owners, their priorities for for the vector control program are to control the emergence of invasive species such as AIDS aegypti, the yellow fever mosquito'",
        "'speaker_2': 'that can carry life threatening diseases like Zika virus and dengue and chikungunya. Their other priority, the second priority was to prevent future outbreaks of Zika and dengue, West Nile and other diseases. And this tells me that they're very plugged in with this issue.'",
        "'speaker_2': 'And the third priority was reducing mosquito populations, using environmentally sound methods, which we do. And finally, the fourth priority among the property owners and parcel owners was fiscal responsibility, ensuring it was important to them to ensure the proceeds were used only for mosquito and vector control services and they couldn't be taken by the state or the county'",
        "'speaker_2': '. With that, I can turn it off. That's the very abbreviated version. You have all your your slides. Maybe we can bring the map up and just remind. Remind the council that we're only talking we're really addressing the area in pink, the the areas in green that's greater Los Angeles Vector Control District, and that's east of Lakewood.'",
        "'speaker_2': 'That line is Lakewood Boulevard and the diagonal line is Pacific Coast Highway. So if you're north of PCH and east of Lakewood, you're generally in greater Los Angeles Vector Control District. And those residents will not be affected at all by this measure.'",
        "'speaker_2': 'And the other area up there is Compton Creek. It's a really small corner of northwest Long Beach. That's along Susanna Road and Delta, I think up to the up to our city border. And those folks in that area will not be impacted at all by this measure.'",
        "'speaker_2': 'So, again, we're just speaking of about 60% of the city that's in that pink color there.'",
        "'speaker_13': 'With that, we close our report. But one thing I did want to share, so the L.A. Vector District currently charges approximately $12 for their services, and they do only vector only mosquitoes. And we do a much broader range of service.'",
        "'speaker_13': 'So and we are seeking to move forward with the $8 and 14 cent rate. So we'll still be a lower level than the other half of the city moving forward.'",
        "'speaker_2': 'So number 16, just just for a sum up.'",
        "'speaker_13': 'Moving to 16.'",
        "'speaker_2': 'Okay. So so this is just just a brief timeline of what we're looking at with this project. But I just want to reemphasize that tonight is just the survey results. And we are seeking some direction from council in terms of continuing on with an engineering study, but they'll certainly be for city council.'",
        "'speaker_2': 'Another bite at the apple because we'll be coming back in May. But I just wanted to reemphasize that that tonight is just the survey results and some direction to move forward with the engineering report, the May 7th date that you see up there.'",
        "'speaker_2': 'That's the real decision night. That's the go or no go date. So you'll have another opportunity to look at this council. And the final thing that I want to mention is that August 9th date that's really driving this process.'",
        "'speaker_2': 'That's the date that the that the county auditor needs to have all this information in order to get this on on the rolls by FOIA so we can receive funds by December of 2019.'",
        "'speaker_13': 'With that we close the report and we're open question to.'",
        "'speaker_0': 'Thank you. Let me Israeli public comment on this item scene and let me close it. Councilmember Pearce.'",
        "'speaker_6': 'Oh, yes. I want to thank staff for their work on this. I've talked to several residents in my district that are very supportive of this. I don't have any questions at this time. Thanks.'",
        "'speaker_0': 'Thank you, Councilman Ringa.'",
        "'speaker_2': 'I pulled up the Andrews moment. No. One question that I did have in terms of the phones I would rate. How much are we looking at to expect to iterate on this? What with the $8 and 20 $0.01 rate, we would be looking at approximately $700,000 and a lot of most of that those funds would go towards'",
        "'speaker_2': 'what is a general description.'",
        "'speaker_13': 'All those funds would go towards vector control. So the amount coming in would go through, they would be the expansion of services. So at this time, you know, the mosquito season is pretty much focused on the summer. It has been expanding earlier and later.'",
        "'speaker_13': 'We're finding much more much more impact from additional mosquitoes coming in and other sorts of vectors. So these funds would go to expand the operations and the ability to serve the community as well as education, greater outreach, greater education, those kinds of services so that communities know how to respond and that we are doing our response while'",
        "'speaker_13': 'we're out there.'",
        "'speaker_2': 'Would there be any effect on staffing, for example, hiring more vector control specialist or part timers or not careers or anything like that? In that respect, this funding would allow us to continue at the staffing that we have now without we have seasonal vector control specialist assistance that we would be able to keep year round because of'",
        "'speaker_2': 'this funding. That's all. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Richardson.'",
        "'speaker_8': 'Thank you, Mr. Mayor. So I'm familiar with with this and I have a few questions. Just, you know, looking at the map, I see this will be the third ventral vector control special district in the ninth district. And so that raises a question for me about coordination of efforts.'",
        "'speaker_8': 'Miss Colby, have you thought about how we will coordinate, coordinated and coordinate with Greater Los Angeles, as well as Compton Creek to make sure we have one cohesive message.'",
        "'speaker_13': 'Is certainly already coordinating with them. So in Compton Creek, when we had the outbreak, remember that two years ago? Yeah. With the Zika outbreak or the Zika concerns a couple of years ago, that was a very strong coordination between services in that space.'",
        "'speaker_13': 'So we already are and are doing that in the L.A. District. They do primarily mosquitoes and we are already called upon and coordinate and work services within the vector district as well.'",
        "'speaker_2': 'Okay.'",
        "'speaker_8': 'Secondly, there's a lot of education in and around the the Compton Creek. How can we anticipate, you know, looking at the L.A. River, the Forest Park, all the wetlands in this area and creating some sort of will there be an opportunity to create some sort of permanent education apparatus or signage along the river?'",
        "'speaker_2': 'These are these are known breeding sites that we treat on a routine basis, that we're very aware of those as far as posting permanent signs we do, we will post signs when we are surveillance detects positive activity. However, we have not posted permanent signs at this juncture, but it's certainly something we could look into and consider.'",
        "'speaker_8': 'Right. A couple more things. So I heard it. The rate comparison with Greater Los Angeles. How's the rate comparison with Compton?'",
        "'speaker_2': 'The rate comparison with Compton Creek residents pay $9 per year. This rate would be slightly less than that at $8.21 per year and also provide a comprehensive service.'",
        "'speaker_8': 'Rate and then oversight. I know Compton has an oversight board. Greater Los Angeles, I believe, has more oversight board. How we handle governance.'",
        "'speaker_2': 'Sure, Mayor. Members of the City Council. My name's John Blais. I'm president of ACI Consulting. Great question. That's something that we can look at. Typically, when those two are both special districts, not a city or public health responsibility, we'll work with city staff and make recommendations.'",
        "'speaker_2': 'Whether you would have an independent advisory board. Those used to be popular. They're not popular much anymore for county and city programs. So we typically advise against them, but we're open to input and then we'll provide input to staff and they'll ultimately make a decision on that.'",
        "'speaker_8': 'Okay. So if it would defer to the public health board that we have, which I think makes sense, I think we may need to think about, you know, shifting it from I think it's city wide appointees that are getting some district appointees there to make sure that there's actual geographic representation in those areas represented here.'",
        "'speaker_8': 'So we should we should look at that conversation when it comes. Last thing I'll say is just figure 11 really interesting. Not often we can look at something partizan here at at city council and I just see in households that say d d to democratic to do to Democrats and residents.'",
        "'speaker_8': 'Something interesting happens at the 1492 rate, the rate as you go from Democrat to peer Republican, the support for the rate goes down. But when you go from Democrat to double Democrat, the support for the rate actually increases, which is, you know, says something.'",
        "'speaker_8': 'I think it's just interesting to see that there's more support for the higher number in these Dem double Dem households. So that's that's just something I wanted to kind of raise up. Thanks a lot.'",
        "'speaker_0': 'Always the case that I find in almost any survey that.'",
        "'speaker_2': 'Yeah. Yep.'",
        "'speaker_0': 'Uh, let's see. Councilman Austin.'",
        "'speaker_11': 'Thanks. And I appreciate the conversation thus far. I do have a couple of questions. I wanted to just just understand how are vector control efforts? Or just be clear on how our vector control efforts in those peak areas that were identified in the map, how are those areas funded now?'",
        "'speaker_13': 'They are currently funded directly through realignment funding, which is our state funding to the health department we utilize. So while other areas have vector districts and people pay for the service for the for I mean since we started that program, it has been funded out of the Health Department's budget.'",
        "'speaker_2': 'I just wanted to add that throughout our state, the the most common funding mechanism is a benefit assessment for vector control agencies, and that's what we're trying to establish here.'",
        "'speaker_11': 'I get it. I'm just kind of curious as to if it's currently the service is currently happening.'",
        "'speaker_3': 'So.'",
        "'speaker_13': 'Councilmember I think the, the, the key thing is that, um, as you know, the realignment venue within the city of Long Beach is our only source of funding that is not connected to a grant. Right. That has any flexibility.'",
        "'speaker_13': 'Those funds are currently being utilized to support vector control and they will continue to be utilized. This would build our as more strongly build our capacities. Um, because this isn't our extending all of the other. And what we're seeing is a much greater presence of mosquitoes in the possibility of disease.'",
        "'speaker_13': 'We do not have the capacity within the realignment fund to build our staff to be able to address all these issues. So over time, what you would find is a diminished capacity in a space where we're having increased increased increased disease and increased mosquito and other things to be tracking on.'",
        "'speaker_13': 'So what this would allow us to do is to build our capacity. There would still be some realignment funds utilized for this process. Um, and then the also is that realignment at the state level is not a consistent source of funding.'",
        "'speaker_13': 'So as the economy goes up and down, these funds go up and down. And so as we're looking at, as, you know, realignment also funds it funds are the administration at the health department. It funds our labs, Flint, our clinics and other things.'",
        "'speaker_13': 'So as realignment does go down during bad economic times, we would not have those resources to support Vector.'",
        "'speaker_2': 'And just just to add on to what Director Colby mentioned, the emerging diseases that we see with we just in the species that we see with AIDS, aegypti and in the Zika threat are very resource intensive and require enormous amount of revenue to address.'",
        "'speaker_2': 'We have to research it, coordinate with our oversight agencies like CDC in the state in many of the the responses required door to door. So they're very heavy in resources that we that we need this benefit assessment to fund.'",
        "'speaker_0': 'Councilor Rubinoff.'",
        "'speaker_2': 'Thank you. This is always a very important issue to the fourth District. That border line between L.A. County and Long Beach, Lakewood Boulevard and PCH pretty much divides our district perfectly in half. So we're always interested in equity.'",
        "'speaker_2': 'So would this measure bring more equal services to both sides of the district?'",
        "'speaker_13': 'Um, at this time we actually so the mosquito portion of the vector services is provided by L.A. County, by L.A. Vector District. We actually, as the health department already support that area as well. This builds our capacity to support both the additional resources within one portion of your district and to build our capacities overall within the other'",
        "'speaker_13': 'side of your district.'",
        "'speaker_2': 'Okay. Thank you. And whenever this topic comes up, I'm compelled to mention Bob Bryant, who is co-chair of the Stearns Park Neighborhood Association, very active in Wilson High School PTA. And Bob died five years ago, a victim of West Nile.'",
        "'speaker_2': 'So it's been front and center with the residents of Fourth District for the past five years. But as Mr. Nelson Kerr just mentioned, we have emerging issues that are actually more serious than they were five years ago. So thank you for this effort and I'll support this item tonight.'",
        "'speaker_0': 'Well, thank you. Seeing that there was no public comment, please cast your votes.'"
    ],
    "Landscaping Improvements along Long Beach Boulevard Metro Blue Line and Funding Agreement with Metro.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Item 31 Report from Public Works Recommendation to Award a contract to steel landscape for landscaping related improvements along the Long Beach Boulevard. Metro Blue Line for a total contract amount not to exceed 2,106,000 and to execute all necessary documents with the Los Angeles County Metropolitan Transportation Authority in an amount not to exceed 1,800,000 districts one, two and'",
        "'speaker_1': 'six.'",
        "'speaker_0': 'Thank you. This is actually a pretty big deal. Mr. Beck, do you want to just quickly, briefly let the council know what we're doing?'",
        "'speaker_2': 'Yes, certainly, Mayor. Members of the council tonight, we're asking for your approval to move forward. We have a unique opportunity with the.'",
        "'speaker_0': 'L.A. Metro's work that's happening on the blue.'",
        "'speaker_2': 'Line route with the trains not running. We are interested in upgrading the landscape portion of the blue line itself. So what we have before you tonight is an item that would allow us to move forward with the landscaping upgrade, including a new fence throughout the route in the city.'",
        "'speaker_2': 'Through our advocacy with mayor, with Metro and the mayor's leadership. Metro is willing to cover half of that cost. And so what the item before you is to allow the city manager to accept those dollars and to approve a contract and move forward.'",
        "'speaker_2': 'That concludes my staff report.'",
        "'speaker_0': 'Thank you. And this will essentially create an entirely new landscaping and fencing project, the entire length of the metro system in the city of Long Beach. And so it's going to be beautiful and will open in coordination with the new blue line opening up when that project is over.'",
        "'speaker_0': 'So it's going to be a real improvement and change for the entire system, which would be nice. Any public comment on this scene on Councilwoman Gonzalez? Okay. Councilman Pierce.'",
        "'speaker_5': 'I want to say.'",
        "'speaker_6': 'I'm excited and I hope we have landscaping that's similar to what's in front of my Belmont Shore gym. Beautiful. Well-maintained, long lasting. I'm excited things.'",
        "'speaker_0': 'Well, it's all native, I believe it's a combination of California natives. Correct, Mr. Beck?'",
        "'speaker_2': 'Yes. So we're actually looking to add more hardscape as well, so we can go with minimal maintenance and still have a beautiful experience for anyone riding the blue line.'",
        "'speaker_0': 'You have no pretty picture of the part on the screen of how great the fencing is going to look. I think you're going to bring your eyes. I do not have a pretty picture. Okay. And fencing is awesome.'",
        "'speaker_0': 'All right. Thanks so much. Please cast your votes.'"
    ]
}