{
    "Funding Transfer and Appropriation Adjustment for the Long Beach Blues Society Event.": [
        "'speaker_0': 'And so I will do my best. We are going to come back to the budget. We are going to go ahead and do items 21, 22, 27 and 29. All the funds transfers as one item. Madam Clerk.'",
        "'speaker_1': 'Communication from councilman's into his recommendation to increase appropriations in the City Manager Department by 500 to support the Long Beach Blues Society. Blues for All Event. Item 22 Communication from Councilwoman Zendejas recommendation to increased appropriations in the City Manager Department by 10,000 to provide a contribution to social and environmental entrepreneurs to support their youth, sports and mentoring'",
        "'speaker_1': 'program. Books and buckets.'",
        "'speaker_0': 'Not to mention Haas.'",
        "'speaker_1': 'Mayor. Would you like me to add the other two items?'",
        "'speaker_0': 'I thought you had read all of them. No, we.'",
        "'speaker_2': 'Don't.'",
        "'speaker_1': 'The other two items are. Item 29 and 27. Item 27 Communication from Councilwoman Price Recommendation to authorize City Manager to execute all documents necessary to accept and expend grant funding from the Port of Long Beach and Item 29 Communication from Councilwoman Sorrell, Councilwoman Zendejas, Councilmember Your Unger recommendation to increase appropriations in the City Manager Department by 3586'",
        "'speaker_1': 'to support the Rigley Village BLOCK Party.'",
        "'speaker_0': 'Compromise in the House.'",
        "'speaker_4': 'Thank you, Mayor. It takes a strong community to build a strong community. Individuals stepping up, willing to put in the work and willing to work together to create solutions and address the issues they've met and they may see in their community as they live in this community.'",
        "'speaker_4': 'That is why I am proud and a strong supporter of our new books and Buckets program, a youth program that is very much needed in our Washington neighborhood. And I am excited to continue supporting this program. I would now like to give my remaining time to David so he can speak a little bit more about the program'",
        "'speaker_4': 'if David is here.'",
        "'speaker_6': 'I don't see.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'I'm Truman Price.'",
        "'speaker_4': 'It's support this item.'",
        "'speaker_0': 'Councilman Ciro.'",
        "'speaker_4': 'I just wanted to speak to item 29 around the village block party that, you know, that's the first in-person event I was able to host since I've been in office. And I thought that it was a great kick off to doing more in-person event, particularly bringing resources to community and bringing residents together to to connect, but also'",
        "'speaker_4': 'to activate the small businesses in the Wrigley Village area. And looking forward to continuing the work and the celebration in our Wrigley Village area and throughout the other parts of the districts. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion any second by consumers and they have some price. Members, please cast your votes.'",
        "'speaker_1': 'There is public comment on item 22.'",
        "'speaker_0': 'I'm sorry about that. Please. Please come to the comment is your public comment.'",
        "'speaker_1': 'And I can say, please come to the podium.'",
        "'speaker_0': 'And then can can someone from the clerk's office send me the public comment? I don't have any up here.'",
        "'speaker_2': 'Okay. Snake in Faith District six. RESIDENT I'm just coming today in support of books and buckets. I think it's an amazing opportunity. Youth led organization in the Washington district that's really speaking to the needs of the community.'",
        "'speaker_3': 'And I want to say much respect.'",
        "'speaker_2': 'To Councilwoman Zendaya for ushering locals in her neighborhood, in her district, and an opportunity to lead the.'",
        "'speaker_3': 'Youth towards positivity. I, as a person that runs a bookstore, would love to support by donating books. Big fan of David.'",
        "'speaker_2': 'And everything that him and his associates are doing and, you know, feeling very generous. Ms.. And they are so, you know, I don't know if there's.'",
        "'speaker_3': 'Anybody here from the organization, but I would.'",
        "'speaker_2': 'Love to give some money as well, because it is important that private individuals also step up to support the youth and not just the city.'",
        "'speaker_3': 'So thank you. I also wanted to say thank you to Councilwoman Soros. Amazing blog.'",
        "'speaker_2': 'Point. I didn't know if it was you know I liability issue that's why I don't want to say anything.'",
        "'speaker_3': 'But it was a great.'",
        "'speaker_2': 'Block party. I grew up in Wrigleyville. I was born in Pacific Hospital. So it was great to see so many people on Pacific.'",
        "'speaker_3': 'Avenue and lots of children and pinatas.'",
        "'speaker_2': 'And it was a great opportunity to see everyone out. And thank you again, Councilwoman.'",
        "'speaker_4': 'Mayor. I think we may have a video to see that. Do you guys have the books and buckets video?'",
        "'speaker_1': 'Well, cue that up right now.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_6': 'It isn't your typical youth sports program. I'm Christian Longo in Long Beach, where I'll introduce you to the founder who is from this neighborhood and is now back on the courts he grew up in hoping to bring others up with him along the way.'",
        "'speaker_6': 'Ever heard the saying the ball is life? It's definitely a way of life for 12 year old Stephen Sheppard.'",
        "'speaker_4': 'I was playing since I was like three when my grandpa. We were playing in this court right here.'",
        "'speaker_6': 'Since then, he's spent almost every day here dribbling, passing and shooting with his neighborhood friends or as part of a summer program called Books and Buckets.'",
        "'speaker_4': 'Outside, all as a great program.'",
        "'speaker_6': 'With lots of responsibility.'",
        "'speaker_4': 'Because you also have to practice, but also keep your book and read about it. So then you can educate your mind about what's happening.'",
        "'speaker_6': 'And motivate yourself in life. The program was started by another kid from the neighborhood, David McGill Soriano, who used to spend all his free time with friends on this very court.'",
        "'speaker_9': 'I came when I was growing up right here in the Washington neighborhood. There was no youth program, there was no youth center. And I wanted to be a part of something.'",
        "'speaker_6': 'David would take an hour long bus ride out of the Washington neighborhood every week, all to join a youth program he says helped his physical and mental development.'",
        "'speaker_9': 'When I got older, I was thinking like, Man, what if what if our neighborhood had that? You know, what if I had take the bus ride when I had to do all that?'",
        "'speaker_4': 'And so when he got older.'",
        "'speaker_6': 'He did just that, bringing others who grew up in the area back with him. The camp brings an academic side with group discussions, readings and guest speakers and mixes it all together with. Well, I think you can guess what.'",
        "'speaker_9': 'The part that really, really that meant is the basketball part, the basketball academy.'",
        "'speaker_6': 'But more so than just developing for their future, it's a means to keep them safe in the present. This neighborhood wraps with its share of gang violence. Kids as young as Stephen have already experienced it.'",
        "'speaker_4': 'So basically there's there's a lot of gang violence and they want to influence you to do bad things. And it's things like this that motivated David to keep.'",
        "'speaker_6': 'His camp going.'",
        "'speaker_9': 'Our youth know them as well. I know them, but they go to school with them. So if this program wasn't here, they might be a part of that.'",
        "'speaker_6': 'By being here, they gain more than just basketball knowledge. They gain community. You know.'",
        "'speaker_9': 'We'll passing the ball and they take the shot. And the day we give them the tools and they can help solve the problems in the neighborhood.'",
        "'speaker_6': 'Locals coming back to their hometown and putting the ball back in. Kids like.'",
        "'speaker_4': 'Stephen's for. Thank you for that.'",
        "'speaker_0': 'Thank you. With the motion in a second, please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. And just a note for the clerk. I don't have any public comments up here, so I just want to make sure that.'",
        "'speaker_1': 'Currently there is.'",
        "'speaker_0': 'Okay, great. Thank you. Next up is we're going to do item 19. Actually, I'm sorry. Let's do the the the four open public comments because. If you want to call those for the podium.'"
    ],
    "Ordinance to amend zoning regulations of the City of Long Beach.": [
        "'speaker_0': 'Okay, great. So then there's no more public comment. So members, please go ahead. We'll go to the next item. And we're going to go ahead and do let's actually do the item 17 and then 18 to the two other hearings and then we'll go to 16.'",
        "'speaker_0': 'So let's start with item 17.'",
        "'speaker_1': 'Please report from Development Services recommendation to receive supporting documentation under the record, conclude the public hearing and find the project exempt from sequel to the ordinance approving a zoning code amendment to implement suggested modifications by the California Coastal Commission.'",
        "'speaker_1': 'Read the first time and later or the next regular meeting of the City Council for Final Reading. Adopt a resolution adopting amendments to the local coastal program of the General Plan and adopt a resolution authorizing Director of Development Services to submit the local Coastal Program Amendment to the California Coastal Commission citywide.'",
        "'speaker_4': 'This is a public hearing. And the planning manager, Patricia Defender.'",
        "'speaker_6': 'Here will make the presentation for this item.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening, Mayor. Vice Mayor, City Council members. This item is similar to a number of items you have seen recently. This item is a local coastal program amendment for zoning code amendments that were previously approved by the City Council on October 2019.'",
        "'speaker_4': 'As you've seen with those other recent local coastal program amendments, the council has to act on, the Coastal Commission's suggested changes in order for the zoned zoning code amendments to be effective in the coastal zone. This action would allow these amendments to be in effect in the coastal zone.'",
        "'speaker_4': 'These which are these amendments are already a fact in effect in the rest of the city. Just by way of some very quick background. The Development Services Department has undertaken a program to periodically update the zoning zoning code, a program known as the Omnibus Zoning Code Amendments.'",
        "'speaker_4': 'The goal of the program is to modernize the zoning code and ensure that the regulations are up to date updated, to be responsive to changes in development trends and best zoning practices. These periodic amendments are necessary since the zoning code has not been comprehensively updated in more than 20 years, and there are conflicts and outdated provisions throughout'",
        "'speaker_4': 'the code. As previously mentioned, these particular amendments were adopted by the City Council in October 2019. At that time. At the time of the adoption, the City Council also adopted a resolution directing the Director of Development Services to submit submit these ordinances to the Coastal Commission for a finding of conformance with the Certified Local Council program.'",
        "'speaker_4': 'The city did submit the amendments to the Coastal Commission and the Coastal Commission is requiring some modifications to those amendments. And that's what's before the Council this evening. The customary procedure the city council must take an action on these coastal commission modifications suggested modifications within six months of the date of the Coastal Commission's approval, which for this'",
        "'speaker_4': 'item was in March of this year. If the Council approves these modifications this evening, the coastal the local coastal program amendments will be resubmitted to the Coastal Commission before the deadline for final certification by the Coastal Commission. Just very quickly, I won't go over the detail or substance of these code amendments, but they were code amendments that'",
        "'speaker_4': 'involved establishing land use regulations for several new uses, including escape rooms, tutoring centers, animal related uses if established and revised or clarified development standards related to the distance between structures on residential properties. Parking requirements in historic landmark districts, measuring fence height in flood zones, gross floor area definitions and floor floor area ratio calculations, rooftop solar height exemptions'",
        "'speaker_4': ', and some other development standards. It also made some modifications to administrative procedures, exempting hearing items continued to a date certain from re noticing. The these are the description of the modifications that the Coastal Commission was requesting and generally that require clarifying the exemption from additional parking requirements for historic properties undergoing residential expansion.'",
        "'speaker_4': 'Is precluded from use in certain parts of the coastal zone. If this if such an improvement would increase the size or degree of non-conformity with coastal resource protection and shoreline policies. He clarifies that the new uses that are introduced in the code by these amendments are allowed by right and are consistent with the allowable uses in the'",
        "'speaker_4': 'adopted land use plan. It adds a requirement for properties within the certified local coastal program to prevent rooftop solar collectors from adversely impacting public views of the beach, bay or ocean that are preserved in the Certified Local Coastal Program.'",
        "'speaker_4': 'It makes a as a footnote to development standards related to accessory dwelling units in the coastal zone. Notice of public hearing for this hearing was published in the Long Beach Press Telegram on July 19, 2021. Written notices were sent to the Coastal Commission.'",
        "'speaker_4': 'Other notification was provided as required by the code, including posting at City Hall and select libraries. On this slide is a summary of the actions that shows that the City Council is being recommended to approve, which involves concluding the public hearing and finding the project is statutorily exempt from secure, declaring and approving the Zoning Code amendments to'",
        "'speaker_4': 'implement the suggested modifications of the Coastal Commission to adopt the resolution. Adopting the amendments to the local coastal program and incorporating the modifications suggested by the Coastal Commission. And certifying the compliance with the coastal, adopting a resolution certifying compliance with the Coastal Commission March 2021 Action that concludes the staff presentation.'",
        "'speaker_4': 'I'm happy to answer any questions you might have.'",
        "'speaker_0': 'Thank you. There's any public comment on this hearing? I believe so.'",
        "'speaker_7': 'Mr. Mayor, this requires three votes, one for the audience and one for each of the two resolutions.'",
        "'speaker_0': 'Yes. Thank you. And there's no public comment. Correct. Okay. We have a motion on the second councilmember ringer.'",
        "'speaker_2': 'No real comment other than that. Thank you to staff for updating our LCP for lovely.'",
        "'speaker_0': 'First May Richardson. Okay. Can I have somebody else second that. It's it's I think it's I think we're fine. Go ahead and let's take the first vote. Members cast your vote.'",
        "'speaker_1': 'Councilwoman Mongo. For smokers.'",
        "'speaker_0': 'Thank you. I'll take a motion for the second vote. Please cast your votes.'",
        "'speaker_1': 'Second vote.'",
        "'speaker_0': 'Karis Thank you. And we'll take the third vote.'"
    ],
    "New Parking Rate for the Market Street Lot.": [
        "'speaker_1': 'Your vote carries.'",
        "'speaker_0': 'Thank you. Item 18 The next hearing.'",
        "'speaker_1': 'Report from Public Works recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt a resolution amending the master fees and charges.'",
        "'speaker_6': 'Schedule District eight. For this.'",
        "'speaker_4': 'Also a public hearing.'",
        "'speaker_6': 'We will have the director of public works, Eric Lopez and April Walker.'",
        "'speaker_5': 'For Lopez and Romero, members of the city council. We got before your request to monetize one of the lots in north in the north Long Beach area. The revenue from this lot will be used to help us maintain this this new parking asset.'",
        "'speaker_5': 'And as part of that effort, we're here to establish we're asking for the establishment of a master of others of a fee. The fee will be the standard $1 per hour in force from 8 a.m. to 8 p.m. from Monday through Sunday.'",
        "'speaker_5': 'And we have team members on the line that can help answer any questions as well. That includes a report.'",
        "'speaker_0': 'I think any public comment on this?'",
        "'speaker_1': 'There is no public comment.'",
        "'speaker_0': 'Dr. Mark Austin Thank you.'",
        "'speaker_2': 'I support this item and it's been a really pleasure working with our economic development team. The John Kreizler, Oscar, April and the entire team. And I'm thrilled that we'll have an opportunity number one to to have. We have a new parking lot on Long Beach Boulevard in the Virginia Village area.'",
        "'speaker_2': 'But we will have the ability to maintain that with with those fees. And so I support this announcement of support as well.'",
        "'speaker_0': 'Thank you. Vice Mayor Richardson will support. Thank you. Members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Presentation on Children's Village Services by Long Beach Medical Center CEO.": [
        "'speaker_0': 'Thank you. And with that, we will go to the regular agenda and we'll come back to the CIA presentation. Now we're going to go to item number 19.'",
        "'speaker_1': 'Item number 19. Communication from. Councilwoman Sara recommendation to receive and file a presentation from John Bishop Long Beach Medical Center to highlight new services provided at the Children's Village in the Millers Children's and Women's Hospital.'",
        "'speaker_0': 'Actually, I'm going to accept. We're going to come to one song first. Oh, sorry. The problem documents are.'",
        "'speaker_4': 'Thank you, Mr. Bishop. I just want to make sure we warmly welcome you first. So I want to make sure we warmly welcome. Chief Executive Officer Mr. John Bishop here from Long Beach Medical Center to share with us the pediatric specialty care and medical and family support services provided at the Cherise marie Law here at Children's Village'",
        "'speaker_4': 'and how that has positively impacted their work as well as the city of Long Beach. So without further ado, Mr. Bishop, where we want to hear from you.'",
        "'speaker_0': 'All right. Thank you very much. Sorry about the false start. And I want to personally thank the council for all the.'",
        "'speaker_3': 'Support that.'",
        "'speaker_0': 'They've given to the hospitals and to the community through the pandemic. It's been an amazing period, and I think we've been a model across the country. But what I wanted to share with you today is one, something new at Miller Children's and Women's.'",
        "'speaker_0': 'And then talk a little bit about the.'",
        "'speaker_3': 'Services we provide.'",
        "'speaker_0': 'Because children's hospitals and there are only eight in California really provide services that are different from community hospitals. And that's because we have the ability to have multidisciplinary care where we have all the experts in one location, because our children are really not just small adults, they have different health care needs and they need physicians that are'",
        "'speaker_0': 'specifically trained for them. Looks like my presentation may be struggling. So what they're working on in the back. Okay. No worries. No worries. I've got most of it in my head, but I want to talk about the Sharice.'",
        "'speaker_3': 'Marie.'",
        "'speaker_0': 'Le outpatient village. It opened in February and it's really making a huge difference because it took all of our pediatric outpatient clinics and there are many, many specialties. There's endocrinology, there's cardiology, there's surgical clinic, there's there's infectious disease.'",
        "'speaker_0': 'And they were in different places around Long Beach and around our hospital. And that's particularly a challenge for families, you know, that have really sick kids that need to see multiple specialists. They may have transportation challenges. And what we were.'",
        "'speaker_3': 'Able to do.'",
        "'speaker_0': 'Is co-locate them all in one building where you can make one call and make one appointment and have all your your specialist needs taken care of in one location. So for the families and the patients and the physicians who can now make handoffs, and if you think about the advantage of having, you know, a cardiologist handing over'",
        "'speaker_0': 'a kid to an infectious disease expert, it makes all the difference in the world to say, hey, this is what I'm seeing, have the lab tests available in one location. So it's just a tremendous advancement. And thank you for the city for helping us process that through all the approval stages.'",
        "'speaker_0': 'It really has been an amazing asset to the community. And lastly, and I would just save time for my I have a.'",
        "'speaker_3': 'Brief video describing what we do. You know.'",
        "'speaker_0': 'One thing that we've seen over the past 18 months is a lot of people have deferred their care, not just on the adult side, but parents understandably very protective of their children, have not brought them into the hospital until it was it was too late.'",
        "'speaker_0': 'We've seen outcomes that were very avoidable. And so to the extent that you are out in the community, I would ask you to please advocate for taking care of your children. Get them. The preventative care hospitals are professional cleaners for a living or a hospital is a.'",
        "'speaker_3': 'Very, very safe place. If we have.'",
        "'speaker_0': 'Any COVID patients, they are in effectively vacuum sealed areas with negative airflow. Nothing gets out. And so please take care of not just your health needs, but the health needs of your kids. Because it really it breaks my heart to know that sometimes people don't get to the hospital in time because they were scared of something that'",
        "'speaker_0': 'was that was very preventable.'",
        "'speaker_3': 'So we could just see the video.'",
        "'speaker_4': 'Children need health care tailored to their unique needs, like doctors and nurses trained exclusively in pediatrics and in a kid friendly place. That's where children's hospitals come in. About one in 20 hospitals in the U.S. is a children's hospital, making them as unique as their mission, treating infants, children and teens.'",
        "'speaker_4': 'And you have one right here in your community. Memorial Care Miller Children's and Women's Hospital. Long Beach is one of only eight freestanding children's hospitals in California. We are even more unique since we're one of the only hospitals in the region to have maternity and pediatric care under one roof.'",
        "'speaker_4': 'Our pediatric specialty physicians have gone through additional schooling and more rigorous training than a typical doctor. And since our care teams exclusively treat kids, they understand the complexities of a growing body and the need for more than medicine to get well.'",
        "'speaker_4': 'From broken bones to fighting against pediatric cancer, we have doctors who are experts in more than 40 types of pediatric specialties to help kids find wellness again. For some kids, specialized care starts before they're even born. Our maternal fetal medicine specialists, who are experts in high risk pregnancies, provide care for expecting moms.'",
        "'speaker_4': 'Ensure that both mom and baby have a healthy outcome after birth. If the need arises, our neonatal intensive care unit is just down the hall so mom and baby can stay close together. We are one of only a few hospitals in California that provides 24/7 specialized care for moms and babies under one roof.'",
        "'speaker_4': 'But our mission goes beyond the walls of the hospital from the South Bay to Orange County. We have satellite centers that bring our expert care to kids right in their own community. And no matter where they live, we help all kids grow up healthy by pioneering new vaccines, clinical trials and treatments through national research consortiums.'",
        "'speaker_4': 'Knowing the future of medicine is in our hands. We partner with academic institutions across the region to ensure that doctors, nurses and clinical leaders of tomorrow get the advanced training they need today. Because Miller Children's and Women's is a not for profit organization that provides care regardless of a family's ability to pay, it depends on public and'",
        "'speaker_4': 'private support. You can support your children's hospital by visiting Miller Children's Dawgs if.'",
        "'speaker_0': 'Thank you. And in closing, I'll just say Long Beach is a big.'",
        "'speaker_3': 'City.'",
        "'speaker_0': 'But it acts like a little city. You have multiple generations. You have grandparents, parents, kids, grandkids. And that is such an asset because the pride of Long Beach really makes us a special place. And so our commitment to you is to try and keep you and your children out of the hospital and give you the preventative care'",
        "'speaker_0': 'to make sure that that happens. So we call it population health and we are on the journey. I thank you for your time and attention this evening. Thank you, Mr. Bishop. Comes from the price.'",
        "'speaker_4': 'I support this item and thank you very much for the presentation.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_6': 'Thank you. I just want to thank you for what you're doing. You talk about us being a big city and a small community. I think that that is very poignant. And I think that one of the things that we as a council during this economic recovery kind of discussed was that the districts across our city that are'",
        "'speaker_6': 'really job creators, a large share of the jobs of the city of Long Beach are in health care. And I'm sure you've heard from Mr. Heisler regarding the Innovation District and working together with the Economic Development Committee and Councilman Thoreau and the opportunities that we have to really bring people from the community into the medical field.'",
        "'speaker_6': 'L.A. County is doing a pilot project where we're taking individuals from disadvantaged communities and turning them into EMTs. And what does that look like after you become an EMT, to become a paramedic, to become a nurse? You become a all these different things where you talk about getting people to go into the hospital during these times.'",
        "'speaker_6': 'It's easier when they're going into the hospital and they see a familiar face from their community. So thank you for your support and your participation and the upcoming opportunities. I've heard that you've been engaged and we really appreciate it.'",
        "'speaker_0': 'I see.'",
        "'speaker_3': 'Richardson Thanks, Councilwoman, for bringing this forward. And John, thanks so much for the presentation updating us on this memorial. Just an incredible asset to our city. You know, both of my children were born there. One of my oldest spent a little time in that Nick.'",
        "'speaker_3': 'You know, it's one of those places, you know, where, you know, you don't really want to go back, but you had a great experience where you there those nurses are top notch and incredible. We owe a whole we owe so much to the incredible nurses at Memorial Care.'",
        "'speaker_3': 'So I wasn't going to let you come up here and make a presentation without acknowledging the incredible team you have. The children's hospital in the entire Long Beach Memorial family. So thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Sorrell.'",
        "'speaker_4': 'Yeah. Just want to make sure to thank you, Mr. Bishop, for coming out today to giving us this presentation and sharing a little bit of an update and just proud to have you in my district and looking forward to ways in where we can continue exploring opportunities to improve.'",
        "'speaker_4': 'And but I do agree that just having, you know, the medical officers that you mentioned in one space really provides just saves so much time and relief for parents who are stressful and just making sure that it's accessible to the community.'",
        "'speaker_4': 'So thank you so much again.'",
        "'speaker_0': 'Thank you. And I'm just going to add, Mr. Bishop, it's been obviously just really great to work with you for particularly the last year and a half, pretty closely on everything related to the pandemic that we're going through.'",
        "'speaker_0': 'But just thank you and the entire team. I had a chance to be there at the groundbreaking breaking of this incredible facility. I remember it well and just hear kind of what was in store and now having now being able to see the finished product.'",
        "'speaker_0': 'It's really spectacular building and great to see so many, you know, clinicians and nurses and doctors all in one space. And I think you said it best. And I just want to highlight again that being able to bring all of those different specialty clinics to 1 to 1 building, and it really fosters a an ability for folks'",
        "'speaker_0': 'to work together and to have, most importantly, a space where parents and families can go to one building and receive a care for for their children. I mean, one space. And so I think that's really, really important. And we're grateful for memorial for this for this project.'",
        "'speaker_0': 'With that, there's a motion and this second and there's no other public comment. So please cast your votes.'",
        "'speaker_1': 'I'm Don Austin. Motion carries.'",
        "'speaker_0': 'We thank you. Now we're going to do item. Thank you, Mr. Bishop. We're going go ahead and do item number 28.'"
    ],
    "Resolution to Support Union Election for Security Guards at CommonSpirit/ Dignity Health.": [
        "'speaker_1': 'Item 28 Communication from Councilwoman Sara. Councilwoman Zendejas. Councilwoman Allen. Vice Mayor Richardson Recommendation to request City Attorney to prepare a resolution to support a fair and free union election for security guards at common. Spirit. Dignity. Health Facilities.'",
        "'speaker_0': 'Councilwoman Ciro.'",
        "'speaker_4': 'Thank you, Mayor. And first one to think, Vice Mayor Richardson and Councilmember Sunday has an Allen for signing on to this item. You know, during the pandemic, we saw how valuable our frontline workers are and they still are.'",
        "'speaker_4': 'And the security guards at Common Spirit, Dignity, health facilities are part of these workers. They were on the front line day after day, standing side by side to all hospital work. Staff and numerous security officers have reported contracting COVID 19 and have also, you know, it's impacted their family due to inadequate equipment.'",
        "'speaker_4': 'So this has caused many of the security guards to sign on to a petition to becoming part of SEIU. And so I fully support them in their decision in wanting a fair and free election to join SEIU, UAW.'",
        "'speaker_4': 'And, you know, the security guards were some of the many heroes during the pandemic. And they should have the ability to decide to join a unit that's meant to improve their well-being on the job site. I also just want to share to that kind of out of an abundance of caution of the Delta variant and the nature'",
        "'speaker_4': 'of their work, they couldn't be present today. But I know that they're listening and counting on us to stand with them in this fight, to enjoy basic protection or in their workplace. So, so. So I ask my colleagues to support this item, to prepare a resolution to support the security guards at common spirit, dignity, health, to have'",
        "'speaker_4': 'a fair and free election to join SEIU. One point of clarification that I wanted to just make is, you know, on the agenda item, it doesn't it doesn't state. It's different from the subject of what's in my agenda item I submitted and I wanted to clarify that it should be the subject is to a resolution to support'",
        "'speaker_4': 'security officers that common spirit dignity health to join SEIU UAW. Thank you.'",
        "'speaker_0': 'Thank you. Before I turn it over to Vice Mayor Richardson, I just want to make a few brief remarks. So I'm very, very happy to not just support this resolution, but just to say a few brief remarks. Also, I want to thank Councilwoman Sato in particular for bringing this forward.'",
        "'speaker_0': 'But I do want to share a very short story because it means personally a lot to me. And I have a lot of love for the SEIU, UAW family. In fact, I consider myself part of of this family.'",
        "'speaker_0': 'In about a year before my mom passed away, she actually had been working at our same clinic for about almost 25 years. In the time that she worked at her clinic. She was considered a low wage worker, worked very hard, always went to work, rarely called in sick, rarely got a raise.'",
        "'speaker_0': 'But loved her job and had a lot of integrity as an immigrant woman working in her workplace. After about 20, 20 plus years, she continued and continued to wanting to work at her location. I think folks know that as a frontline worker.'",
        "'speaker_0': 'My mom also, unfortunately passed away to the pandemic, as do many women that are in spaces of health care spaces. My mom, just a few months before she passed, actually became a member of SEIU, UAW within the last year of her life.'",
        "'speaker_0': 'As she was approached, her and her her coworkers were approached and discussed the idea of actually forming and joining this union. And this group of six women at her workplace were very nervous to do it. They did not want to lose their jobs.'",
        "'speaker_0': 'They were a little bit nervous about taking a step forward and asking for an election for union membership. But they did it. And I remember my mom came to me and said, hey, you know, you, me, how what do you what do you think?'",
        "'speaker_0': 'I'm really scared to do this. But they are saying that they would represent us and fight for fair wages and represent us at the at the workplace. And my mom was the last person to ever ask for a raise.'",
        "'speaker_0': 'She never did because she would never do it. But she thought here a group or a union that would actually advocate for her on her behalf. And so a year before, about a year before she passed, she began her and these other women organizing and won an election at the site and became the first union at my'",
        "'speaker_0': 'mom's clinic. And they were represented by SEIU, UAW. And so I'm very grateful to to the workers of SEIU, UAW for welcoming my mom. She became a very proud member of the union very quickly. And when I talked to these security guards at this facility and at facilities across the state, folks should know that these security guards'",
        "'speaker_0': 'also are in a similar situation where they don't feel heard. They don't feel they have representation. And and in many cases are the only people on the campus that don't have union representation. And so I'm happy and proud to support this organizing of these workers.'",
        "'speaker_0': 'Just I was proud to support my mom's organizing and her job when she took that step forward as well and was welcomed into the SEIU, UAW family. And so as a proud member of that family, I want to thank Councilman Sauro for for this resolution.'",
        "'speaker_0': 'And I'm very proud to support it. Rosemarie Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And thank you, Councilwoman Ciro, for bringing this this resolution forward. Certainly happy to support it. You know, I think just over the course of the past year and a half, we've seen significant changes in our economy.'",
        "'speaker_3': 'And we've talked about the k-shaped recovery, how low wage workers are feeling the most, the most they've had the most significant impacts. And they show up every day. They show up every day. They protect us, the security officers.'",
        "'speaker_3': 'And very difficult times, you know, when folks you know, many of us have the privilege of staying home and working remotely. They don't have that privileged security officers. They have to step forward and do their jobs. And in this time, you know, folks are leaning going back to what they know.'",
        "'speaker_3': 'Economy is shifting. Significant impacts. They're going back to what they know and what they know that works in difficult times is forming a union. They want to protect their jobs. They want to protect dignity in the workforce. So they're taking steps to do what they never done in forming union.'",
        "'speaker_3': 'And I support that effort. And I think that's something that history has shown us, has worked, and we certainly support those workers. In terms of SEIU, I certainly appreciate the comments by my colleagues have said, you know, I remember when I was, you know, a college student at Cal State Dominguez Hills, my mom went back to school'",
        "'speaker_3': 'to be a CNA, and she worked at Huntington Memorial Hospital and she was a SEIU UAW member. And I remember the pride that she had being a rank and file union member and a nurse's aide. And so these are very personal efforts.'",
        "'speaker_3': 'And so I certainly appreciate Councilwoman Ciro for speaking up and saying we're not just supporting security officers, we're support and security officers that form a union and join SEIU instead of you, because that comes with a certain level of dignity and a certain level of pride.'",
        "'speaker_3': 'So thank you so much and I'm happy to support this. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ellen.'",
        "'speaker_1': 'Thank you, Mayor. And I also just want to say thank you to Councilman Ciro for bringing this forward and Vice Mayor Richardson and Councilman Zendaya's for signing on to this very important item, these workers. Just like your mom did, mayor absolutely deserve the right to organize and collective bargaining.'",
        "'speaker_1': 'We have to make sure that these officers feel safe, valued and taken care of. I just strongly support this item. Union jobs promote safe working conditions. They help workers secure their livelihoods and they make sure that they are treated fairly.'",
        "'speaker_1': 'So thank you again, Councilman Sorrell, for bringing this forward. And I will be supporting this item.'",
        "'speaker_0': 'Thank you. Councilman's in the house.'",
        "'speaker_4': 'Thank you, Mayor. Thank you, Councilwoman Zahra, for putting this item forward. And thank you, Councilwoman Allen and Vice Mayor Richardson also as well for supporting this very important item. The pandemic has exacerbated any inequality ability and unsafe working conditions for many people, and it is so important to support and stand by our workers who are speaking up'",
        "'speaker_4': 'on these injustices. I think creating the opportunity for workers to unionize is a step in the right direction to ensure that our residents have adequate and equitable working conditions. It is also very important to make sure that this resolution include the naming as a union that these that these hardworking individuals have petitioned for, which is SEIU.'",
        "'speaker_4': 'Each of you. So I'm very, very happy to support this item.'",
        "'speaker_0': 'I don't believe there's any public comment. So, members, please go ahead and cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Feasibility Study for a Public Pool in North Long Beach.": [
        "'speaker_0': 'Thank you. Next up is item 20, please.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson. Councilwoman Zendejas. Councilwoman Price. Councilman Austin. Recommendation to direct City Manager and the Parks Recreation and Marine Department to explore the feasibility of a public pool to serve the North Long Beach community and return to council with a report within 120 days.'",
        "'speaker_3': 'RICHARDSON Thank you. And I want to go ahead and get started on this. This proposal two days is really not the beginning of a conversation, but beginning an effort. We're a city that's certainly committed to a climate city that's demonstrated our commitment to equity to invest in our youth.'",
        "'speaker_3': 'And I think this is a bringing this conversation forward as far overdue. And I'm happy to do so tonight in partnership with Councilman Austin and our colleagues on the city council. Councilmembers Price and de Hartzell, thank you so much for supporting this effort.'",
        "'speaker_3': 'I think one of the first questions for me is. You know, where we passed the Climate Action Adaptation Plan and we see the impacts of climate change. We've we're talking about waste and a number of things on the agenda tonight.'",
        "'speaker_3': 'But what does climate resiliency really look like aside from the coastal areas? What does it look like inland? Well, we know if we look at what the data says, the data says that from the California interactive heat map shows that the further away from the coast, particularly North Long Beach, are some of the hottest areas within our'",
        "'speaker_3': 'entire city. North Long Beach contain contain some of the hottest areas. More specifically, we have more days above 85 degrees in a given year than any other area of the city. Every year it's going to get hotter. That's just a reality.'",
        "'speaker_3': 'And the reality is that people, particularly the children that live in the North Long Beach community, live the furthest away from the beach and the furthest away from pools. It's going to get hotter. Kids are hot this summer.'",
        "'speaker_3': 'We need to make sure that we have the resources and we're making the investments so that kids can get to the pool. There's a there's a video circulating on next door in North Long Beach circulating on social media.'",
        "'speaker_3': 'You know, it's a few kids and I'm not going to show the video because, you know, it's a little disturbing. But, you know, the neighbors have seen this video circulating around and it's you know, it's a few kids, five or six kids, some, you know.'",
        "'speaker_3': 'One of them says they live in this apartment building and some say they don't. But they jumped the fence and went into an apartment building to go swimming. These guys have trunks on. They're having a blast. And there's the apartment manager and he's saying, hey, you guys don't live here.'",
        "'speaker_3': 'You need to leave this pool. I'm going to I'm giving you a warning. I want to call the cops. We're going to leave this pool. Think back to myself at that age. I've jumped fences to get to a pool.'",
        "'speaker_3': 'When it's hot, kids are going to find a way to swim. But we have to do it in a way that it removes barriers. If you're five miles away from the nearest pool, four miles away from the nearest pool, it's difficult if you don't have access to the blue line, access to public transit.'",
        "'speaker_3': 'It's going to be difficult to get access to a pool, and you're going to have to go to go to other communities in the north Long Beach community. You have public municipal pools in Lakewood that are closer to us than our own public municipal pools.'",
        "'speaker_3': 'Now, we do have, you know, tremendously grateful for the nonprofits in North Long Beach that have provided this service for a long time. Fairfield Family YMCA. I served on the board there. Councilman often serve on the board there.'",
        "'speaker_3': 'At least four council members I can think of in the recent years have served on the board there. They stepped up and done great work. It's still not a public municipal pool, their various pools of hope. I've served as a volunteer on their board for many, many years.'",
        "'speaker_3': 'Warm water pool accessible to the community. It's really about therapy. It's not really recreation. It's a heated pool for therapy for most of the people that are referred by their health insurance to go to therapy. You have the Jordan High School pool and we've worked through joint youth for many, many years.'",
        "'speaker_3': 'To structure it in a way that it that it works. But we don't necessarily control that agreement. It's difficult to access. And so in the North Miami Beach community, there are significant gaps. It's transportation is a barrier, you know?'",
        "'speaker_3': 'You know, I look at a friend who took a took one of those little scooters up there. Right. The e-scooter up there. It takes some time to get from there to the water. So for me, this is a climate issue.'",
        "'speaker_3': 'It's a neighborhood quality issue. It's a quality of life issue. It's an invest in youth issues, an equity issue. It's time for us to, you know, put a flag in the ground as city staff. And what my ask is today is that we begin the process and the feasibility look at some potential locations that is feasible.'",
        "'speaker_3': 'Look at what cost may be strategies to get it as a priority in the city. Funding strategies state and federal, local and present some opportunities to put the Council in the position to close this this longstanding gap. And for me, that's that's really what this is.'",
        "'speaker_3': 'It's an opportunity. Invest in our youth, invest in recreation, give kids an opportunity to do something safe in their own communities. You know, I'm having a good time watching the Olympics, you know, watching these kids swimming and diving.'",
        "'speaker_3': 'You know, my kids take their two Barbies and we have this little pool and they're doing synchronized diving with their Barbies. It's really cool. People are interested in this, but we have to make simple aquatics, basic, you know, accessible to every neighborhood.'",
        "'speaker_3': 'That's what we should be doing. And that's really the gist, this item. So I'm happy to make this motion tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Thank you. And I want to thank Rex for bringing this forward. I want to just say that I fully support this item. And I know many people in the North Long Beach community have been asking for many years, you know, why don't we have a pool?'",
        "'speaker_2': 'And it makes a lot a lot of sense. A couple of opportunities and options have come forward. And so I certainly support the idea of study in a location, the best location for for such a pool. I know this item was specific to the 90805, which is a pretty big geographic area.'",
        "'speaker_2': 'You know, it's going to require some some community input and as well as some strategic placement and obviously assessing our available space in the community to put a pool in. I think opportunities should be extended to areas of the city where they traditionally haven't been.'",
        "'speaker_2': 'And when given opportunities, young black kids and brown kids can certainly rise to the occasion and take full advantage of the aquatics experience that there's a void of today. On a personal note, I'm hosting as a young college student in my home.'",
        "'speaker_2': 'She's a water polo player at the Women's Water Polo Final at Cal State Long Beach. And she's our niece. She's been involved in aquatics since she was very, very young and probably one of the few kids that look like herself playing at the level that she's playing at.'",
        "'speaker_2': 'But it was because she was exposed to aquatics at a young age. She learned how to swim at a young age and fell in love with the water. And so I think there's there's opportunities beyond just recreation that can be extended.'",
        "'speaker_2': 'There's opportunities for college scholarships and long term career options for for young people. I know we talked about just the last year in our budget process, the junior lifeguard program that should be extended should not be a program that is only specific to a certain area of the city.'",
        "'speaker_2': 'Let's extend those opportunities throughout. I do think that there are some unique opportunities in front of us in North Long Beach and with our community partners. It was mentioned that the YMCA has a pool. I do serve on the board of the Fairfield YMCA.'",
        "'speaker_2': 'Full disclosure, but the YMCA is not a brick and mortar organization either. They can they can extend it and be a resource for us on beyond their borders. And so when it comes to even our school board, our school district.'",
        "'speaker_2': 'I think Jordan High School should be a a target for for ongoing recreation, particularly opening up that pool during these summer months. I know that was a practice for many years that we did have. We may have gotten away from it, but no matter where we are again, we're starting a conversation today about a pool in North'",
        "'speaker_2': 'Long Beach. We need to figure out how to bridge that gap today. Right. And over the next several, I want to say a few years before we actually are able to to get to a reality. And so, again, I fully support this this item.'",
        "'speaker_2': 'I throw out, you know, a couple of options in 90805 that I know of where we have a park in the. They set in the middle of the car milito for three and a half acre park. That is not programed.'",
        "'speaker_2': 'It's never been programed. It's just a big green space. We need to figure out something to do there. Davenport Park, I think, provides options. And I know Rex has been talking about Ramona Park as his options. We can't have this conversations without talking about where the opportunities actually are.'",
        "'speaker_2': 'And so, again, I'm happy to support this item and I would ask that our colleagues do as well.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I wholeheartedly support this item. I'm super excited about this item. You know, we are a beach city with a pathetic. Access to public pools. I mean, we just don't have enough. It's not anyone's fault.'",
        "'speaker_4': 'No one's pointing the finger. But are the children in the city need to know how to swim? Every single one of them needs to know how to swim. And I don't know. I know that we can't mandate that, but we we definitely need to have more pools and provide more opportunities for it to be a norm, not'",
        "'speaker_4': 'an exception. Our special day just needs to be a norm. And so I support this item and I support us building more pools throughout the city anywhere. I think the opportunity for us to enhance some of our joint use agreements with the various schools that have pools is also a good opportunity for us to try to look'",
        "'speaker_4': 'into and take advantage of. There are a lot of assets that are part of the school district and even the community college that perhaps we can try to have more access to for our communities. And I would hope that in the short term we could look into that.'",
        "'speaker_4': 'I think to me where the location of it is. It really to me, I just think we should build more pools throughout the city. It doesn't really matter to me what district it is. It's more about the access that people have to those facilities.'",
        "'speaker_4': 'So the more we can have throughout the city, the more access people will have. And I think as a city, we're stronger together if we're trying to advocate for and obtain more city assets that all of the residents of the city can utilize regardless of district boundaries just as a city.'",
        "'speaker_4': 'So wherever this pool hopefully is built and goes, I think will be a welcome addition. Councilman Austin, you mentioned the Junior Lifeguard program. I do want to just give a shout out to Chief Gonzalo Medina. The reason the program can't really be extended is because it's an ocean swim program.'",
        "'speaker_4': 'So it has some limitations because they're teaching people how to rescue. People in the ocean. But Chief Medina has done more for aquatics and equity during his eight or so years as the chief than this city had experienced for decades.'",
        "'speaker_4': 'The Junior Lifeguard program now is the highest a membership that we've ever had. And we have students from all over the city of Long Beach joining the program. And for those who have had children who go through the program, the initial test to become a junior lifeguard is very difficult.'",
        "'speaker_4': 'My own kids failed, you know, multiple times before they finally were able to pass. It's really hard. So what Chief Medina did was he created a program to allow kids the opportunity to have a smoother introduction into the process.'",
        "'speaker_4': 'So that test wasn't this hard entrance or denial. It was more of a process. And he's just done so much for the area in the area of equity. And that program, I'm I'm so proud of it every time I go and speak to those kids.'",
        "'speaker_4': 'There's black, brown, Asian, white and even Persian faces out there. And it makes me so happy to see the diversity that he has brought to the program, because it didn't always look like that. He's done an amazing job.'",
        "'speaker_4': 'So I think, you know, we use what he did as the example of incorporating aquatics into the culture of everyone throughout the city. We look at the we talked about the Olympics. There's so many aquatics Olympians from Long Beach.'",
        "'speaker_4': 'It's shocking. Wilson High School specifically has had so many aquatics champions go on to the Olympics and it's something to be proud of. When we started our rowing equity program earlier this month. We had such a difficult time finding students to participate from certain parts of the city because they didn't have the basic swimming skills.'",
        "'speaker_4': 'And that to me was really important because they're preventing themselves from the opportunity to get college scholarships because that entry point requiring swimming is not there. So I fully support this, and I think the more our students in the city know how to swim, the better it is for them in terms of opportunities.'",
        "'speaker_4': 'And also we think about our aging population. Water sports is the best type of recreation for people that have joint muscle and back pain, and that's something that I think we really should be increasing for our senior programing as well.'",
        "'speaker_4': 'So I wholeheartedly support this and can't wait to help make it a reality.'",
        "'speaker_0': 'Thank you. Freshman Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor, and thanks to my colleagues for the comments. Some really good things stood out. I want to ask Tom to respond before I do so. I think some really good things that came out, I think it's important to call out, you know, race.'",
        "'speaker_3': 'Black and brown kids need access to both. This is one particular area to give that access. So I think, Councilman Alston, for calling it out and I want to underscore that. But Tom, how would you react to this this direction received from council today?'",
        "'speaker_3': 'I think it's pretty straightforward. It is clear we don't have a.'",
        "'speaker_5': 'Lot of swimming access in our city compared to some other cities. We do have some great assets, but there's not that many of them throughout the city. So happy to look at a feasibility study. We would.'",
        "'speaker_3': 'Take a look.'",
        "'speaker_5': 'At some of the areas that were mentioned here. We'd look at both capital costs and look at a couple of different parks that.'",
        "'speaker_3': 'We could put it in.'",
        "'speaker_5': 'We would also we have some experience on the capital cost. There have been a couple of pools in.'",
        "'speaker_7': 'The region that have been built, so we've got some updated pricing.'",
        "'speaker_5': 'We also need to look at some of the operating and I'll report back to you on on the operating costs of a pool. I would like to explore some of the joint partnerships, if there's any way, because this is a longer term project.'",
        "'speaker_5': 'So a project like this needs to start somewhere and we're starting tonight, but it does take some time to get it done and then we'll get you back information on the next steps, including kind of what a design process might look like.'",
        "'speaker_5': 'And and then I think the.'",
        "'speaker_3': 'Point is to really have a project ready and able in case.'",
        "'speaker_5': 'You know, the funding sources open up and we'll have this kind of already a little bit underway.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Thank you. I just wanted to also. If I had a direction I want to go. But since the city manager talked about partnerships, I think partnerships are an amazing opportunity for us. If you talk about lifeguard programs, the main trainer of lifeguards in our city that is not for ocean lifeguards is the YMCA.'",
        "'speaker_6': 'Because they have so many lifeguards, they need to run their pools. And then I don't know what we can do to find ways to provide scholarships and transportation mapping. There are very few places in the city that provide infant baby swim classes.'",
        "'speaker_6': 'And then the mom groups. There's a lot of talk about how to get to these three or four places in the city. There's one in Bixby in all the area. There's one in the third district, and then there's one in Los Alamitos.'",
        "'speaker_6': 'And I don't think people know how to get to them, even when they find where they are, because the connectivity between where the classes are available and the transportation, there's just a disconnect. And so there's a lot of parental talking of what needs to be done.'",
        "'speaker_6': 'And I think the same is true of senior programs. You look at our senior programs. They're great, but they don't have pools versus the YMCA is who are all connected up to Silversneakers, which are all paid for by Medicaid, Medi-Cal, all of those that allow those senior citizens to participate free of charge.'",
        "'speaker_6': 'And so how we can bring those programs to any school or any pool that we provide, I think is critical. And then I just also wanted to say and while I appreciate all the wonderful athletes that come out of Wilson High School, many of which were my friends back in the nineties when I was in high school'",
        "'speaker_6': '. Will I'm sorry, Millikan High School put out a statistic that we've had an Olympian in every Olympics for decades. And then it just a shout out to Max Ervin on the men's water polo team who's a Long Beach resident.'",
        "'speaker_6': 'And he's been doing great and scoring lots of goals in the Olympics. So we're really proud of him. Thank you.'",
        "'speaker_0': 'Thank you. Members, please go ahead and cast your vote with them for public comment.'",
        "'speaker_1': 'Yes, we do have two speakers for public comments. And I can say and Anna Christianson.'",
        "'speaker_2': 'Aren't you a Lakewood graduate?'",
        "'speaker_6': 'I did go to Lake and BURNETT.'",
        "'speaker_3': 'We got three.'",
        "'speaker_6': 'Republicans in my district and it's also the most bussed to high school in the whole city.'",
        "'speaker_0': 'Of a comment please.'",
        "'speaker_2': 'Definitely took the one or two every day to go to Robert Millikan. I just think it's an amazing opportunity for pool equity. When I live in the common lidos, I learn how to swim at Fairfield as an infant and that program and then later got to level.'",
        "'speaker_3': 'Up when we used to have a pool here on seventh and Long Beach Boulevard, now a McDonalds and Walgreens.'",
        "'speaker_2': 'Go figure. But that being said.'",
        "'speaker_3': 'I would love to see if this could be a plural thing.'",
        "'speaker_2': 'I think the Councilman Austin made a great point with referencing the empty field in the common lidos. I think that there could clearly.'",
        "'speaker_3': 'Be some federal partnership there with respect to.'",
        "'speaker_2': 'The new census coming, you know, seven, seven, eight, nine are going to have the highest concentration of population increase. So it's clear that that's where children are being born. The emphasis in this point in my life at least, is children.'",
        "'speaker_2': 'So it's important that we have some type.'",
        "'speaker_3': 'Of relationship with swimming in aquatics or relation to kids in these areas.'",
        "'speaker_2': 'I think Davenport would be a great idea. Ramona maybe the forests or Coolidge. I'm just thinking about all the places that we can.'",
        "'speaker_3': 'I think it's like two or 3 million on average. You know.'",
        "'speaker_2': 'I figured that.'",
        "'speaker_3': 'You know, so again.'",
        "'speaker_2': 'It's a little bit more. Okay, well, I'll say 5 million. I know it's less than 107 million or whatever we're spending in Belmont. So that being said.'",
        "'speaker_3': 'It would just be great if we could do a plural, you know, maybe like for new parks, new public pools in the park system.'",
        "'speaker_2': 'It's great that we have private entities that help service to the load here, but would be great if, uh, you know, the city could take some of that financial responsibility off their backs.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_6': 'Hi. My name is Ron at MAS. I'm in the Hamilton Neighborhood Association in.'",
        "'speaker_4': 'District nine and I do want to thank Council with all the support of the youth.'",
        "'speaker_6': 'Resources.'",
        "'speaker_4': 'That you've added to.'",
        "'speaker_6': 'Our youth development toolbox in North Long Beach, the library, the youth center. We appreciate those resources very much, and I know that it's going to help many children on the right path moving forward for years to come. And I think the pool is the next step in the.'",
        "'speaker_6': 'Resources for our youth toolbox. And I submitted that video. It was taken.'",
        "'speaker_4': 'Out of 5500 acre field.'",
        "'speaker_6': 'It was five or six children just playing in a pool. And I guess it had a profound effect on me because I saw children having to break the law. To enjoy resources and benefits that other people in our area may take.'",
        "'speaker_6': 'Not in our area, but in our city, in areas of our city that they take for granted. So just want to say that again, children had to break the law, jump a fence, get threatened by the police to play in a pool.'",
        "'speaker_6': 'And that area at.'",
        "'speaker_4': '5500 acre fields is very close to Ramona Park.'",
        "'speaker_6': 'This neighborhood or this apartment building has had these break ins consistently for years. And I don't know how police would feel having to go and arrest kids for playing in a pool. But it's it's embarrassing that we don't have these resources in our neighborhood so that these kids have.'",
        "'speaker_4': 'A place to go play.'",
        "'speaker_6': 'Have fun. And it's public accessible, easy accessible. I know, and I can speak for myself. Being a single mother years ago, I barely had enough money for a gallon of milk, let alone bus fare.'",
        "'speaker_8': 'To a pool.'",
        "'speaker_6': 'Miles away. Thank you for listening.'",
        "'speaker_0': 'Thank you. And please, Castroneves.'",
        "'speaker_1': 'We have one more speaker and I Christians and I.'",
        "'speaker_0': 'Only have two stickers on here, so.'",
        "'speaker_1': 'Now was my mistake. We missed. Miss. I'm sorry.'",
        "'speaker_0': 'It's okay. Go ahead. I had to.'",
        "'speaker_8': 'It's just. I think this always happens with us. There's always a little stress moment. First of all, I'd like to acknowledge that we're all here together on Unceded Tongva land. Good to be here. I have to pinch myself.'",
        "'speaker_8': 'I can't believe I'm hearing this. This is the great. So great. I really appreciate all the council members that spoke today, and especially Mr. Richardson for introducing this resolution. Long Beach Area Peace Network and our everybody in the pool program has been advocating for community pools.'",
        "'speaker_8': 'And I think it's really very important to acknowledge David's words from the Books and Buckets program. What what if I didn't have to take that bus? And you know, as well as the kids that came up here, our skateboard program, and that's what my son said, there are skate parks all over Long Beach.'",
        "'speaker_8': 'It should be the same with pools. And and whereas, basketball and skateboarding are phenomenal sports. Swimming is more than a sport. It's a life saving activity that everybody needs if you live near a large body of water. So this is basically clearly a public safety issue and not just for kids, but for adults.'",
        "'speaker_8': 'So I really appreciate it's just beyond beyond words. This is so important and it's so good to have the community coming together, our representatives coming together around this this matter. And I did send the sponsors some information. USA Swimming Facilities Management is partnering with Coke Total Aquatics programing and they present and they did back in the day'",
        "'speaker_8': 'and they offered to share this information with the city if we could only get to Denver. Well, they have been presenting virtual conferences and information not only on building community pools, but also on maintaining them and and having them be sustainable.'",
        "'speaker_8': 'So I really once again, highly recommend that we get out of our Long Beach bubble and reach out to the experts in both sending people to the Olympics, but also providing equitable public facilities and well designed. And that we we include I would love it if you'd amend the resolution to include funding, but I will at least'",
        "'speaker_8': 'consider funding a city council members and staff who could attend these conferences, at least access the webinar. I just want to say that even though I blame is not that is not that valuable valid. I mean, it might be valid, but it's not that valuable.'",
        "'speaker_8': 'But we do have a history of racism. We do have a history of classism. And we share it with a lot of people in the world. Right. A lot of communities. So how do we become a more equitable and a less racist community?'",
        "'speaker_8': 'We have it. We had a plan. We had a plan. That's our Healthy Communities plan that said we will put new recreational facilities in underserved communities. So not to end on a negative note, but I think this pool must be prioritized over funding the buyback safety before competition.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. We're going to hear the next few items here. I know 23 is a presentation, 20, but 24, 25 and 26, I don't think too not. So let's go. Here I am 24.'"
    ],
    "Widow's Pension Application from Mary L. Johnston.": [
        "'speaker_1': 'Councilman after motion carries at 30. Communication from city attorney, a recommendation to adopt them in order to grant an application from Mary L. Johnston for widow's pension.'",
        "'speaker_0': 'Get a motion in a second place and there is no public comment. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. That concludes the agenda. Now we are going to go back to our budget presentation and our hearing. Budget presentation, please, Madam Clerk.'",
        "'speaker_1': 'It's a report from Financial Management Recommendation to conduct a budget hearing of the proposed fiscal year 2022 budget for the capital improvement program citywide.'",
        "'speaker_0': 'Mr. MODICA.'",
        "'speaker_5': 'Thank you. This is our second budget.'",
        "'speaker_3': 'Hearing and traditionally on this day we go through.'",
        "'speaker_5': 'The capital improvement program. So the first.'",
        "'speaker_3': 'Day we normally give the.'",
        "'speaker_5': 'Overview of the entire budget and then now we're starting to dove a little bit deeper. We have a robust capital improvement plan.'",
        "'speaker_3': 'We know how.'",
        "'speaker_5': 'Important infrastructure is to all of you and your residents.'",
        "'speaker_3': 'So we will have Eric Lopez go through that. We are planning to have a.'",
        "'speaker_5': 'More focused study session just on infrastructure and kind.'",
        "'speaker_3': 'Of our longer term infrastructure later in the month. And so we'll be talking about that a little more as well. If I can turn now to Eric.'",
        "'speaker_5': 'Thank you, Tom. Andrew, honorable mayor, members of the city council. So I'm here tonight to present to you our proposed fiscal year 22 cap budget I to our residents present here today or those watching from home. Thank you for joining us tonight.'",
        "'speaker_5': 'I want to begin by first just highlighting some of the great work that the public works team has completed this current fiscal year. So we have some pictures to demonstrate that work. On the top left hand corner, we have our new Granada Beach concessions, a stand and play area.'",
        "'speaker_5': 'To the right of that, we have our new Atlantic Palms Bridge Community Center, our first year round shelter that opened this fiscal year.'"
    ],
    "Contract with Periscope Holdings for Procurement Technology Solution and Budget Appropriation Adjustment.": [
        "'speaker_0': 'We're actually going to pause 1/2. I think we did not do 23. So I wonder I wonder what the agenda aims for. So if I can have the clock, please. I'm 23, please. It'll be a quick vote.'",
        "'speaker_1': 'Report from Financial Management Recommendation to adopt a resolution authorizing city manager to execute a contract with Periscope Holdings Inc for Procurement Technology Solutions citywide.'",
        "'speaker_0': 'There's a motion or second is for public comment.'",
        "'speaker_1': 'Not on this item? No.'",
        "'speaker_0': 'Mr. Merkel, I don't know that we have of the agenda. Did you want to make a presentation or if you.'",
        "'speaker_7': 'Do, this is a pretty significant effort to really reform purchasing. We've been working on this for a couple of years and I hear from a number of you about how important purchasing is. So we were planning to take about 7.'",
        "'speaker_5': 'Minutes to.'",
        "'speaker_3': 'Go through a presentation on this new system and what we're doing.'",
        "'speaker_0': 'Let's do it. Thank you. All right.'",
        "'speaker_5': 'Thank you very much. I will introduce Sandeep Singh Palmer, our deputy director.'",
        "'speaker_4': 'Good evening, Mayor, and members of the City Council. Thank you.'",
        "'speaker_6': 'For this opportunity to provide you with information about.'",
        "'speaker_4': 'The Department of Financial Management's.'",
        "'speaker_6': 'Proposed procurement technology purchase, along with how it fits into our work to make over procurement and Long Beach. With me tonight are Michelle Wilson, Long Beach's purchasing agent, and Acosta Goodman, our project manager. iPro at its core will manage our prospective vendor database, provide an.'",
        "'speaker_4': 'Online platform.'",
        "'speaker_6': 'For competitive solicitations, like our invitations to bid and request for proposals. Help us manage our small.'",
        "'speaker_4': 'Local and.'",
        "'speaker_6': 'Disadvantaged business data. Assist with important contract management tasks and help with reporting. Are purchasing a business services manager. Terry Mortenson was not able to be here tonight. Under her excellent direction.'",
        "'speaker_4': 'The purchasing division.'",
        "'speaker_6': 'Has worked for the last several years to evaluate and greatly improve its operations and citywide procurement in response to City Council, city leadership and city auditor requests. And iPro is an integral part of the extreme procurement makeover happening in Long Beach to make procurement more inclusive and responsive.'",
        "'speaker_6': 'There are many aspects involved in this comprehensive program update and Michele will be walking you through a few highlights to provide some insight about.'",
        "'speaker_4': 'How tonight's decision fits into that.'",
        "'speaker_6': 'Larger body of work. Thank you, sandy. And good evening, mayor. Members of City Council. In prior years updates we've provided you with information about critical program improvements such as streamlining insurance requirements and better categorization of vendors. Reform accelerated in 2020 with the kickoff of what we are calling our extreme procurement makeover.'",
        "'speaker_6': 'This is a deliberate and comprehensive remaking of the city's procurement operations. We are evaluating our policy process and practice to increase equity and access for vendors, enable better outcomes in our contracts, and to make things more efficient and strategic.'",
        "'speaker_6': 'Our extreme procurement makeover is enhanced by our partnership with Harvard Kennedy School Government Performance Lab, also known as GPL. EPO has a highly sought after fellowship program with hands on technical assistance, specifically in public procurement. They provide dedicated resources for change, along with access to their research and prior results through their work across the country, including recent'",
        "'speaker_6': 'projects in Boston, Chicago and Los Angeles, UPL is well-positioned to support us with the implementation of national industry best practices. Long Beach was seen as being on the cutting edge of a national movement for ambitious procurement reform. Building on our success in Year one, Gcpl has taken the rare step of assigning us not only one but two'",
        "'speaker_6': 'full time fellows to support an expanded scope of work in year two, which was approved by City Council just a few weeks ago. One of our first steps was to formalize our guiding values, goals and metrics into a simplified strategic plan.'",
        "'speaker_6': 'We use national best practices from industry organizations and GPL, as well as important goals and principles from everyone in the framework for Reconciliation and the city's equity toolkit. This document guides our procurement reform, and we hold it to use ourselves accountable for making procurement more inviting, equitable, efficient and impactful.'",
        "'speaker_6': 'Another pillar of our reform was a complete renovation of our request for proposals. This document, which is one of the primary tools the city uses to select vendors for medium or large dollar purchases is now easier and more inviting to the business community.'",
        "'speaker_6': 'Their description of city needs lowers barriers to entry and better positioned small, local and disadvantaged businesses to submit proposals and ultimately to be awarded opportunities. We've been meeting with departments to enhance planning efforts as well. Procurement forecasting will allow city staff to do more and better local outreach for procurement opportunities, particularly important for disadvantaged vendors.'",
        "'speaker_6': 'It also allows us time to better partner with city stakeholders like the Department of Economic Development and the Business License Division to better coordinate efforts to help the local business community to have greater impact on the Long Beach economy.'",
        "'speaker_6': 'Our work this year has largely been internally focused to lay a strong foundation and we are now able to pivot and look outward. We will focus on inclusive procurement trends in three key strategies increasing accessibility to government contracting, improving engagement with the business community, and building capacity for vendors to compete for city business.'",
        "'speaker_6': 'We've throughout our makeover plans is the use of a new procurement management platform E pro which brings us back to the item before you tonight and I will pass it to Agusta.'",
        "'speaker_4': 'Thank you and good evening, Mayor.'",
        "'speaker_1': 'And members of City Council. IPRO will assist us in three critical areas, and the first.'",
        "'speaker_4': 'Is lowering barriers.'",
        "'speaker_1': 'The system is approachable and easy to use and will help us bridge the digital divide. We will expand our language access options and over time be able to help staff better. Source small dollar purchases from Long Beach businesses.'",
        "'speaker_1': 'Contract management tools will aid vendor relationships, improve contract outcomes, and improve compliance to contract terms. This will address some of the city auditor's concerns regarding contract management. And finally, iPro will help us make data driven operational decisions and better answer questions about the economic impact of the city's dollars.'",
        "'speaker_1': 'It will help us track vendor diversity goals. Support us while we continue to identify additional barriers and provide tools for analysis of procurement trends in the city. And I will pass back to Michel.'",
        "'speaker_6': 'Before you conclude, I'd like to take a moment to celebrate one final success with you. We just learned this past week that we won for the second year in a row a national achievement and excellence in procurement. We were one of only seven cities to be recognized and only five other cities that were longer larger than Long'",
        "'speaker_6': 'Beach. The review process for this award was extremely comprehensive. The criteria were designed to measure innovation, professionalism, productivity, e-procurement and leadership attributes of the procurement organization, and included components from the great work the team has done to support COVID 19 pandemic emergency response and recovery efforts.'",
        "'speaker_6': 'Procurement in Long Beach has changed and improved greatly over the last several years. We are becoming a national leader in even more change and improvement is still to come. You pro software before you tonight is an important part of that overall improvement.'",
        "'speaker_6': 'Thank you. And this concludes our presentation and we are available for any questions.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_6': 'Thank you. I want to thank the staff and the team. Contract management systems have been a consistent reporting issue in all of the city auditor's reports and having tools available that automate and ensure timely practices in a city of our size, especially with the turnover and opportunities for people to advance within a local government.'",
        "'speaker_6': 'You have staff that move before the term of a grant or a contract has expired, and it's unrealistic to think that a paper based system is going to be able to be viable in today's day and age when so much of what we do is on the computer.'",
        "'speaker_6': 'So I just want to thank you for ensuring that that was a big part of this. The only comment I have on the presentation, besides the fact that it was excellent, is that you talk about low dollar contracts to local vendors.'",
        "'speaker_6': 'And again, most of the time recently I haven't had to make comments on vendor selection because since Councilman Allen has joined the council, she's really taken the charge on that. And so I would just be repeating her comments.'",
        "'speaker_6': 'But consistently, it's not just low dollar contracts. I mean, there are times where we're buying $1,000,000 in tires from outside of our city. And that extra $0.02 of sales tax revenue is something that we need to compute into that bidding process of that additional value to us as a city.'",
        "'speaker_6': 'So I just want to make sure that's not just for low dollar value. We need to talk about the local jobs and other things that are viable. And a factor of that that I think we found to be particularly impactful during the pandemic is the number of local residents that are employed by a particular company.'",
        "'speaker_6': 'I think the more people in our city that they employ at a fair wage is a big impact. Thank you.'",
        "'speaker_0': 'All right. Thank you very much, Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. So on. First, thanks to staff for this presentation. More importantly, thanks for the context in which you presented this presentation. It's been an ongoing conversation within the city about how we can diversify and leverage our purchasing power to create local jobs, local economic input.'",
        "'speaker_3': 'And we always run into two barriers. One, our software is not designed in a way where we can easily point to and identify where the opportunities are, quantify how much we're actually spending in certain departments, in certain areas.'",
        "'speaker_3': 'And then secondly, it's hard to coordinate when you see you have a harbor department, you've got an airport, you've got different departments or maybe different processes. And implementing this allows a reset and begins to allow us to set some goals, particularly.'",
        "'speaker_3': 'I'm going to go back and do a refresher. So back in 2017, we adopted the Everyone airplane and it asked us to begin to get to a point where we can start setting a goal. L.A. County has a target.'",
        "'speaker_3': 'It's 10% of our procurement, targeted social enterprises, minority businesses, women owned businesses. More specifically, the recommendation is increase the percentage of city of Long Beach spending on local, small and diverse businesses by establishing a streamlined certification process, integrated vendor database and for Long Beach agencies and industry institutions and transparent supplier participation goals.'",
        "'speaker_3': 'Public procurement is one of the most powerful tools that local governments can deploy to foster more equitable Long Beach economies. That's the standard on the city council already adopted. And then last year, in terms of the framework for reconciliation, the framework calls on the city under goal one to ensure budget contracting procurement processes intentionally and equity equitably'",
        "'speaker_3': 'address past and present impacts of systemic racism and build positive futures for those most impacted. It calls for the creation of a resource and support center for new and small businesses to help them get started, participate and succeed in city procurement opportunities.'",
        "'speaker_3': 'It talks about upgrading technology to provide online versions of versions of that center. It also talks about creating and implementing policies and associated programs in addition to the technology updates that help our city ensure that contractors, vendors and consultants embrace and reflect the city's diversity.'",
        "'speaker_3': 'That means the outreach associated with the software and the training and education in our communities to make sure people know how to use the software. And simplifying our processes for participating in city procurement, including adjusting insurance requirements and simplifying and reducing required forms.'",
        "'speaker_3': 'All of these things have been voted on and direction has been given to make them a priority, ensuring that we have an equitable procurement system. What I see today with this adoption of this system makes all of these goals, and we're one step closer to making it a reality.'",
        "'speaker_3': 'And I think that's what's important here today. And so thank you so much. I'm proud to support this and I look forward to the follow up. And you know what the next steps look like in leveraging this to achieve those goals that we talked about.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. Thank you, Mayor. I am super excited about this presentation. As someone in my previous life who has responded to hundreds of RFPs throughout the state, Planet Bids is not fun. It's it's definitely some fun as a vendor.'",
        "'speaker_1': 'And it had a lot of problems. So I look forward to seeing this this rolled out. I also there are several questions that I have, so maybe we can do some of this offline, but just making sure that, you know, the outreach is important, but also that we are tracking, you know, how those awards are given on'",
        "'speaker_1': 'the system right away. And then also, I've had problems in the past, Planet Bids, where people were awarded contracts that weren't registered on Planet Bids. And I think the city has fixed that. But there's just this is just really exciting for our local businesses, and I just look forward to seeing this rolled out.'",
        "'speaker_1': 'So thank you very much.'",
        "'speaker_0': 'Thank you. General public comment. Republican. We will go ahead and cast a vote. Thank you. Councilwoman. I'll.'"
    ],
    "Budget Hearing for the Proposed Fiscal Year 2022 Capital Improvement Program.": [
        "'speaker_0': 'Thank you. We'll go ahead and I'll go back to the budget hearing.'",
        "'speaker_7': 'Okay, Eric. Okay.'",
        "'speaker_5': 'Let's try this again. So let's go through some of our accomplishments and think in the team that worked really hard to deliver our current Y 21 projects and investments. So I just wanted to highlight a few of those projects and, and just pay tribute to our very hardworking team members that make this a reality.'",
        "'speaker_5': 'So I talked about Grenada and the and our Atlantic Farms Bridge Community Housing Project. Next to that, we have a playground renovation that we did at Eldorado Park, our Golden Grove, and that was one of a couple of improvements below that to them.'",
        "'speaker_5': 'In the middle of the of the slide, we also have in an improved Golden Shore, Golden Grove outdoor event center that we were able to renovate great space for outdoor events. Then to the bottom left, we have one of our many street improvements and then to the the bottom right hand corner.'",
        "'speaker_5': 'We have one of many, many curb ramps that we were able to complete this year. Overall, we are proposing a total capital improvement program investment of 146 million. We this consists of a merger of a variety of different sources that are listed on this slide.'",
        "'speaker_5': 'The investment in our ccap this year is an enhancement from from last year. And we can talk a little bit more about that in future slides. Within our capital improvement program budget. We split it up into different categories and we call these investment categories.'",
        "'speaker_5': 'And as you can see from the chart, the largest investments this year are being made within our mobility program, our public facilities program and our utilities program. For the airport and for the airport in Fy22 we are proposing an investment in improvements for accessing the terminal and for rehabilitation of the airfield runways.'",
        "'speaker_5': 'The total proposed budget for this program is 1 million. But in our Beaches and Marinas program, we're proposing an investment of 1.75 million spread about various uses. We're actually going to highlight some of the projects in this program in the later slide.'",
        "'speaker_5': 'We put out the Tidelands projects together in a slide so we can share some of those proposed projects. The mobility program represents one of the larger investments. We are looking at investing a total of $60 million in our city's roads, alleys, sidewalks and curb ramp improvements.'",
        "'speaker_5': 'A lot of this funding comes from not just local sources, but also from state and county sources, including gas tax. SB one measure. R measure and property and property. In. But some of the example we just wanted to show an example of of a local street improvement project the before and after the these these projects truly do'",
        "'speaker_5': 'make an immediate impact within our residential neighborhoods and our just our city overall that we are very proud of. I also wanted to show a before and after of one of our curb ramp improvements. And in our effort to improve accessibility, we've actually been able to implement over 600 curb ramps this year alone.'",
        "'speaker_5': 'That's on top of thousands of others that we've been able to complete in the last few years. One of my favorites. We've been talking about dirt alleys for a while, and we're getting to the point where we're addressing just about all of our dirt alleys.'",
        "'speaker_5': 'Here we have a before and after representation of a of an alley that been repaved and just a significant change from from one to the other. Overall in our mobility program, we're looking at add $59.79 million in investments.'",
        "'speaker_5': 'We laid out the sources on the left chart and the uses on the right. Those are the different categories that represent one or a multitude of projects within those uses. As for our for our local street programs are actually our top three investments are.'",
        "'speaker_5': 'Let me talk about top four investments this year that are being proposed is for our interior corridor enhancements program, our arterial street rehabilitation, residential street improvements and our ADA curb ramp improvements. Those four major uses represents a majority of the investments as part of the EMOBILITY program within our CHP.'",
        "'speaker_5': 'Every year we make progress on the infrastructure investment plan that was unveiled an FY17 1718 this year when we started on our plan, or at least the streets and roadways, sections of the plan. This was our red. And every year as we complete segments, we start converting them into green.'",
        "'speaker_5': 'And as we work on improving those, they start converting. So we made a lot of progress, but there's still a lot of work to do. The remaining red lines are projects that we still need to find complete. And on the right hand chart, I demonstrate the progress we made on our major streets, residential streets and alleys programs'",
        "'speaker_5': '. So a lot of good progress, but some work remains that a team is working extremely hard on. Or Residential Streets. Our Residential Streets program is actually one of our one of our more busy and and I'm going to say effective programs.'",
        "'speaker_5': 'We have a great residential street team that's every year of finishing segments that are consistent with our investment plan. So we continue our work. At this point, a lot of our f y 21 residential streets are already designed and program for construction, and our engineers are focusing on the next set of streets and planning and designing and'",
        "'speaker_5': 'getting them ready for construction in FY 22. Within our parks program, we're proposing an investment of 1.6 million. Spread out. Spread across three different categories. And for our public facilities program, we're proposing an investment of 21.6 million. And we have a variety of sources that comprise this amount.'",
        "'speaker_5': 'And two main uses are our facility improvements and our energy efficiency improvements. And I'm actually going to highlight some of these projects. So for public facilities, we have listed we have proposed specific projects for this year, our police department, academy building renovation, our Queen Mary improvements, critical infrastructure reserves, citywide EV charging city on solar energy efficiency retrofits'",
        "'speaker_5': '. And the other is listed on this chart. For our utility program. The largest investments are made for water and gas and sewer infrastructure. But we also have measure W and measure W revenue this year for capital improvements. That's going to be $3 million for FY 22.'",
        "'speaker_5': 'And as you know, the measure W was passed by the voters in November of 2018 and has been identified to be used to construct new stormwater devices that clean water. When one of our primary examples of such projects are eligible for Measure W projects as the Lbps Mast treatment facility, and we show a couple of pictures of'",
        "'speaker_5': 'that project that were in the slide. I also wanted to note that our Long Beach Energy Resources Department is proposing an $11 million investment through the city's pipeline infrastructure. And the R. And our Long Beach Water Department is proposing a $46.8 million investment through our city's water and sewer infrastructure.'",
        "'speaker_5': 'One of the highlight of some projects within our Tidelands Cap and Program and just AB32 funding. I wanted to show a recent project on the left hand side of the slide that we recently completed solar installation, solar canopies, that we're doing more solar now than we ever have.'",
        "'speaker_5': 'And we're and we look to continue that investment to the right Tidelands project that we wanted to highlight is the junior lifeguard facility that we are proposing to rebuild and we are targeting to start construction this coming fiscal year.'",
        "'speaker_5': 'For our Tidelands funded projects. I listed those projects in the chart to your right. We have a great number of really exciting projects that are being planned, designed or constructed there as as you know, Tidelands Funds is a it's a source that can only be used within a certain geography state defined tidelands areas within our city.'",
        "'speaker_5': 'So when we have available tidelands funds, we, we investment within those defined tidelands zones. For AB 32. We've been we've been investing on our citywide EV charging infrastructure. That investment is set to continue in fiscal year 22, as is our investments in citywide solar and energy efficiency, improvements at our city facilities, where we're also looking at making'",
        "'speaker_5': 'some early de upgrades into the Queensway bridge lighting. And we're looking at investing in our partnership with SCC to really encourage more people to transition to green energy sources and to take advantage of a lot of the programs that exist out there that just some people don't know about.'",
        "'speaker_5': 'AB32 is it's a represents a city of projects that that public works has been focusing on, especially in the last year. And we have a great team that's doing just amazing job at delivering these projects. So thank you to that specific team as well.'",
        "'speaker_5': 'Now I want to take a moment and highlight a measure A and the investment has allowed in our city's infrastructure. Everyone should be familiar by now with our infrastructure investment plan. And we've been able to to complete just over 70% of all the committed projects.'",
        "'speaker_5': 'And we're working hard to complete the remaining ones. What the projects that we're looking at completing this, this, this next year include the North Health Facility, the Alamitos Branch Library, our Eldorado Park Artificial Turf Field, and our recreation park playground, just to name a few.'",
        "'speaker_5': 'And these are major projects are all underway and very exciting to have the opportunity to deliver them. I do want to add a note that we are currently working on the next five year infrastructure investment plan, and we're planning to come back to this body and present some of the details.'",
        "'speaker_5': 'A big part of that obviously is the anticipated federal funding. And we want to talk about funding strategies to address some of the needs. And I will get into some of our needs in a couple of slides. Major accomplishments.'",
        "'speaker_5': 'We continue to be able to do a lot with the funding that's approved each year under Measure A, from community centers to street improvements, to park improvements and even stairways and accessible pathways out in the park system. We've also continued to deliver playgrounds and more curb ramps and and facility improvements.'",
        "'speaker_5': 'The most recent playground that we completed would measure upon this is the cherry part of playground that we were happy to unveil just a couple of weeks ago. The FAA 22 measure a proposed budget or recommend they are recommending to allocate 6.3 million to the mobility program, 1.2 million to the parks program and 14.13 million to the'",
        "'speaker_5': 'Public Facilities Program, which represents a total measure investment of 21.63 million. Our our investments continue to add various the specific projects we mentioned the PD academy earlier but we're also making investments to fire station nine. Some of our facilities that would needs that have been identified in our facility conditions, assessment curbs and sidewalks, arterial streets, programs alleys'",
        "'speaker_5': 'and and many, many other more enhancements. Since the inception of Measure eight in 2017, we invested a total, including the FBI 22 proposed budget. We're looking at an overall investment of just under $160 million. And it's truly hard to imagine where we would be at without this funding source and without them.'",
        "'speaker_5': 'The many projects that Measure A has really allowed us to propose, plan, design and deliver. Total estimated investments. We do have some projects that are that will require additional funding so that we can complete our commitments within the spending plan for our measure.'",
        "'speaker_5': 'And we're working hard on those. I wanted to spend just a moment on our unfunded needs, and as Tom mentioned earlier, we will be having a study session and we'll get deeper into some of these needs, our funding opportunities and potential strategies for funding.'",
        "'speaker_5': 'So by bottom line, we have more needs in our city than we have available budget. And every year we try to balance our needs and available budget and and really push forward projects that that are ready. And also, I think we do work really hard to try to bring in additional state and federal funding, and we're excited'",
        "'speaker_5': 'about the opportunity to be able to continue to do that, to address some of our many, many, many unfunded needs. Challenges and opportunities that we've identified. We do have our our new payment management program. It's been revised. We're working to release the information and the maps with the what the latest and greatest information on our streets.'",
        "'speaker_5': 'Having that data is going to be key in helping us plan, program and execute the that are the many street improvements that that that are in the works. We do have the ADA settlement agreement that we continue to focus on and we're working really hard to make sure we meet our commitments.'",
        "'speaker_5': 'We also have the benefit of our facilities, conditions, assessment and and the and the data that allows us to evaluate our investments within our facility that we didn't have before. So we're looking at releasing those final reports later this year and to updating those reports every ten years so that we know exactly what the conditions of our'",
        "'speaker_5': 'facilities are, and we can use that information wisely. Measure W Investment Plan. Measure W has been a really beneficial funding source as we continue to program the investments to help with stormwater water quality enhancements. And we're working on, on, on our investment plan that we can use to guide us throughout the next few years.'",
        "'speaker_5': 'And as I mentioned earlier, the next infrastructure investment plan does lean heavily on state and federal funding, which we are expecting and hoping that those funds are significant. So it can truly help us make a impact in addressing some of our many needs.'",
        "'speaker_5': 'So that concludes our presentation and we're ready to answer any questions.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Is there any public comment on this?'",
        "'speaker_1': 'There is one public comments and I can say. There's no more public comment on this item.'",
        "'speaker_0': 'Thank you. Before I turn this over to the council, I just want a couple of comments. First, I want to thank the public works team and Mr. Lopez for putting together a good CFP presentation. Always does. And I want to just add how I know I say this almost every year that, you know, for me this the'",
        "'speaker_0': 'CFP and the infrastructure work is some of the most important work that we do every year. And I think there are very few things I'm for. For most of the folks that I talk to that that rank higher oftentimes, then please fix my street or please replace my kids playground, or please take a look at the alley'",
        "'speaker_0': '. These are the kind of bread and butter issues that we as a community, as a council should be focused on consistently is how we're producing for our residents as it relates to playgrounds, for the kids street, for the streets that are safe sidewalks, for to walk down in their neighborhood, trees that are trimmed.'",
        "'speaker_0': 'And I'm just really glad that we're making progress, even though we know the need is is so great. I just also want to just add that once again, I want to just uplift like I try to do every year, just the importance of of measuring.'",
        "'speaker_0': 'And you see it throughout your presentation. The investment that voters made now twice is transforming the city and has led to more investments in infrastructure than has been has happened in the last generation. So that's something we should be proud and celebrate and would not be possible without the people of this community who now twice have have'",
        "'speaker_0': 'now have invested back into into their city. One a note. One of the a lot of investments that I appreciate that happen. I'm focused on a few things. The first is that map. I think we've obviously meeting. We made a commitment to the voters to get that map done.'",
        "'speaker_0': 'And I know we're almost there. And so I look forward. I believe in a month or two or a month or two from now, we're going to have a study session specific to infrastructure and about kind of what's next.'",
        "'speaker_0': 'I understand. I know the Council Committee on Infrastructure is also, I think, digging in and doing some of this work. And so I look forward to that conversation and I look forward to finishing that map, which is an important commitment we made to the community.'",
        "'speaker_0': 'Also want to note that there are a few things that I enjoy more than replacing or installing new playgrounds. I believe that in the last few years we have probably replaced or installed close to maybe ten playgrounds using measure funds.'",
        "'speaker_0': 'They range from smaller playground sets to these just enormous, incredible new playground sets that we put in at places like Los Cerritos Park and Drake. We just opened one at Cherry Park with Country Ranga just a few weeks ago, all measure funded.'",
        "'speaker_0': 'And I want to encourage you, Mr. Lopez, and your team that as we plan for the future. Beyond the swipe at the next five years to prioritize playgrounds for kids in this community. And there's very few, very, very few things that we do where I get more positive feedback from parents and neighbors.'",
        "'speaker_0': 'Then we put out a new playground in their park. And so I just I'm hoping that that is a big focus for us moving forward. I also want to just note for the council that we have an enormous opportunity in front of us with this infrastructure bill that is getting bipartisan support in the U.S. Senate and in'",
        "'speaker_0': 'the House. I've been somewhat involved in it as a advocating on with throughout through the US Conference of Mayors and some of the conversations we're having with the White House and some of the the the infrastructure infrastructure groups I've had a chance to participate with with Secretary Goodridge on some talks, fought for the Port of Long Beach'",
        "'speaker_0': 'and getting resources there. We're coming up with some some asks as it relates to to road money and street money and playground money. And I think what's really critical is that we have an opportunity to get probably the largest federal investment in infrastructure than we've also had in a generation.'",
        "'speaker_0': 'And including in that will be also will be infrastructure investments that we've never had at levels around public transit, around broadband. Closing the digital divide around some some climate infrastructure and the very basics that we need in this community around roads, bridges, ports, airports.'",
        "'speaker_0': 'So. We're going to we're about to see a massive infrastructure investment in Long Beach and across the country. And I plan to be very involved and engaged in ensuring that we get that across the finish line, but then also making sure that we are investing it in where it needs to go in the city.'",
        "'speaker_0': 'And I would encourage us as a council, there's a lot of. A lot of items that come before us and a lot of interest, I think, on this body for issues. But I would challenge us that we should that this issue around infrastructure, we should spend a lot of time talking about and investing the time that I'",
        "'speaker_0': 'think our residents are asking of us. This is a huge issue. And so I'm really looking forward to these next few months where it's all going to be about infrastructure and how we spend those resources. So thank you, Mr. Lopez, for for the presentation.'",
        "'speaker_0': 'And I want to thank you, Mr. Modak, also for for making sure that we're getting these measures put in place. Councilman Austin.'",
        "'speaker_2': 'Thank you. And I think you guys have almost said all that I wanted to say, but not quite. I do want to thank Mr. Lopez for a great presentation. It's always encouraging to see that we have the opportunity to invest in our infrastructure.'",
        "'speaker_2': 'And the city this year was $146 million, and that's going to keep people work working. But also it's going to do a lot of good in our city. You know, I think the mayor here summed it up. I think we all are sitting on the edge of our seats and anxiously awaiting information coming from DC around the'",
        "'speaker_2': 'infrastructure bill that is matriculating through Congress right now. And obviously how we plan and what we. What we do in the future will be driven by that quite a bit. You know, I do love playgrounds, but I honestly, I think if you talk to too many of the residents in our in our city, you know, the pulse'",
        "'speaker_2': 'is around residential streets and alleys. That work is is transformational. That work is greatly appreciated. And and obviously, there's still a lot of need in the city. Measure A was a great shot in the arm. And it gave us the ability to to actually be working toward improvement.'",
        "'speaker_2': 'But it's not enough. And so I'd like to and when we get to that point, have that the conversation and, you know, I'm going to be a hard advocate and going down the gantlet to make sure that, you know, every street, every neighborhood in this the city is is a place where everybody is proud to live no'",
        "'speaker_2': 'matter where they live. In the city, our neighborhoods are all communities matter. And and I think whenever I can see residential streets, curves, sidewalks, alleys being repaired, I know that I'm doing tangible work that's going to make a difference for the long term interest of our city.'",
        "'speaker_2': 'So I would make those comments, but understand that that that's where I'm going to be coming from for for the foreseeable future. When it comes to infrastructure dollars. I'm looking forward to, you know, obviously digging into the rest of the budget presentations that we have, but to the the team, the staff, Mr. Lopez and entire public works'",
        "'speaker_2': 'team, I just want to say on behalf of the residents of the eighth District and I know many, many others, thank you for the aggressive work that you guys are doing.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_6': 'Thank you. Great presentation. Eric knows my favorite topic of all time is infrastructure, infrastructure, infrastructure. I have to agree with Councilmember Austin that the pulse on the street is streets, streets and sidewalks. Streets and sidewalks and playgrounds are great.'",
        "'speaker_6': 'And I have a two and a half year old and playgrounds are fantastic. And I love meeting all the other moms and dads at the playgrounds. But when I'm at the playgrounds, the complaint I hear from parents is my kid can't bike on the sidewalks because they're so broken in our neighborhoods.'",
        "'speaker_6': 'And so I think that there's this intermediary and it's interesting to hear the parents because like when a sidewalk is cracked a little bit, it's difficult for a child to walk on and to learn to scooter on and so on.'",
        "'speaker_6': 'But when the sidewalk is cracked a lot, it's now become a skate ramp. And so while the neighbor kids all love it, the person whose house it's in front of does not. And the fact that I have multiple.'",
        "'speaker_6': 'Skate ramps in 90808 that are in excess of nine inches from where they initially started is just a testament to why we have $600 million in sidewalk need and sidewalks, our health sidewalks, our seniors sidewalks, our children sidewalks are everybody.'",
        "'speaker_6': 'During the pandemic, I know we saw people walking more than ever before. And to continue that, we really need to provide an inviting place to walk. I would even say the one thing I miss most about living in the seventh District was the width of the sidewalks.'",
        "'speaker_6': 'The sidewalks on the seventh district are two squares wide versus one rectangle, and that makes it a more enjoyable family walk at night. And so as we discuss and implement sidewalk repairs, I think that's something important to consider.'",
        "'speaker_6': 'This report is great. I think it would be interesting to dove into at the Infrastructure Committee the determination on priorities based on now that we have a full understanding of street repair need on residential streets, street repair need on Ontario, arterial sidewalk repair need, and our public facilities.'",
        "'speaker_6': 'Then we need to say, okay, what's the total cost? What's the percentages where we go from here? How do we make this happen and how do we deliver for the community now? Because people need those things now. And as we've seen during the pandemic, the cost of materials is increasing at a rate so quickly that we would'",
        "'speaker_6': 'be better off borrowing money and repairing them today, then experiencing continued increased costs over time. So I look forward to bringing an item back on that in a couple of weeks and hearing more from the community on what their priorities are, on how we would make sure that the percentages of funding allocated really meet the needs of'",
        "'speaker_6': 'what our community needs today and tomorrow. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Superman. Thanks. Thanks for the presentation. And I just.'",
        "'speaker_3': 'Want to make a comment on the PowerPoint presentation. We didn't receive the PowerPoint until mid-afternoon. And I just I.'",
        "'speaker_0': 'Want to refer to the streets and roadways map on page.'",
        "'speaker_3': '12. So if anyone out there sees that we have a few inaccuracies, just rest assured will address those. In fact, the director and I have a briefing scheduled for tomorrow at 2 p.m.. Sounds like we planned it, but I was just looking.'",
        "'speaker_3': 'And so also on page 30.'",
        "'speaker_0': 'Of the presentation.'",
        "'speaker_3': 'References the pavement management system. So there are updates to this map that.'",
        "'speaker_0': 'You're that you're seeing in the presentation and.'",
        "'speaker_3': 'We'll get all those straightened out tomorrow. So thank you.'",
        "'speaker_0': 'Thank you. Councilman. Councilman Sorrell.'",
        "'speaker_4': 'Thank you, Mayor. Thank you. I want to thank Mr. Lopez for the presentation. It's really helpful for me as somebody who's new to council to understand. And I do appreciate the visual images because it's the friendly illustrate. You know, how bad it was before and how much it's changed.'",
        "'speaker_4': 'I always appreciate being able to share that with residents when changes are, you know, improvements are made in District six. And I also want a distinctive public works team for all their work on all of this. You know, it's you know, it takes it's every day that, you know, we you know, the moment we leave our house'",
        "'speaker_4': ', you know, we step on the sidewalk and, you know, so we, you know, have a lot of public works things that are in front of us. And I do want to just add to this conversation about yes, I think in addition to streets and sidewalk, playgrounds are important.'",
        "'speaker_4': 'I think it's important we really look at improving all of them because there are neighborhoods that are very dense where they have no yard. And the only source of area for young people to have physical activity and even to play is at the playground.'",
        "'speaker_4': 'So I would just add to that. Yes, playgrounds, too, in addition to the streets and sidewalks. You know, I also want to mention that when I think about streets and sidewalks, I think a lot about concrete. It's just it's a lot of pavement and concrete.'",
        "'speaker_4': 'And I want us to think about to how do we green these areas, right. And how do we ensure that while we want to create these smooth sidewalks for people to recreate, and that we're also conscious that it does create urban heat and it just gets hotter and hotter.'",
        "'speaker_4': 'Right, as we're trying to address climate change. So love for us to be able to consider that as we're going through these planning and now ways you can green alleyways and other other you know walkways. So and I'm just a question around the unfunded needs so you have all these streets and road improvement.'",
        "'speaker_4': 'And so I see $1.77 billion and it has a 2021. Is that just the last time it was calculated as far as the amount of money it would take? It's on page 29. So if you can help me understand these numbers, because it's a lot of money and I just don't know if it's the latest of these'",
        "'speaker_4': 'state indicate they're the latest estimates.'",
        "'speaker_5': 'Councilwoman. So the 1.77 billion number is the cost to that. The amount that it would cost us if we were to fix all of our streets within a five year period. So it's just it's just meant to give us an overall sense of the scale.'",
        "'speaker_5': 'Obviously, the solution is going to be a multi-year effort beyond just five years. But, you know, the study focuses on just, you know, a just a snapshot, a five year snapshot.'",
        "'speaker_4': 'Okay. As well as these others like the alley way paving, is it within kind of the period of like that's the estimates as well, just wanting to understand this.'",
        "'speaker_5': 'Yeah. And I had to go back and check the detail. Some of these are five years. Some of them are within a ten year. So I can follow up with the team and give you kind of the the time frame associated with these.'",
        "'speaker_5': 'But usually it does hover between five and ten.'",
        "'speaker_4': 'Okay. Thank you. No further question on the item. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Excellent presentation. There are some wonderful projects on there. I was just commenting to the city manager, the playgrounds that we've put in all throughout the city. The pop of color. It just screams fresh, new.'",
        "'speaker_4': 'It makes people feel good about their city. And I think that's that's really important. And it to me, like I said, it doesn't matter where in the city we put them in because we're stronger or better together. If we can enhance facilities throughout the city, so any time we put a new playground in, I get really excited'",
        "'speaker_4': 'regardless of where in the city it is because I think it makes it's a it's a sense of pride that people have about the areas where their kids play. It's just it's just really important to people because every single one of us who have kids, our only goal in life is to give them the best life we'",
        "'speaker_4': 'can give them. Right? And so when we live in a city that has newer facilities, we feel like we're doing a good job as parents, at least provide those to them. So I think that helps a goes a long way, like the mayor said.'",
        "'speaker_4': 'The project that I'm most excited about on this list is probably one of the cheapest projects we have and it's the with it that's going to go and Councilwoman Allen's district. I'm so excited about that. I was telling the city manager that has got to be the best return on our investor that we have as a city'",
        "'speaker_4': '. It's an inflatable. And anyone who says that the beach doesn't serve the entire city and the entire region has not been out to see the with it the long line of kids waiting to use it. I mean, it's to me that the engagement of the beaches has magnified since we put the first women in and now we're'",
        "'speaker_4': 'going to put the second one in. So I think it's going to be great. The only concern that I have is I'm excited about the possibility of a federal infrastructure plan. As chair of the Port Transportation and Infrastructure, the Port Transportation and Infrastructure Committee, I hope to really dove deep into what that means for the city.'",
        "'speaker_4': 'But. The streets have got to be a major priority for us. They are a core service. We talk so much about programs that are great to haves, but things like infrastructure. Our need to have roads are need to have.'",
        "'speaker_4': 'If residents are driving on major arteries in the city and crossing over multiple potholes every day to get to work. They do not feel like their tax dollars are being spent in the right way, even if we have amazing programs that people throughout the city are benefiting from.'",
        "'speaker_4': 'There's something to be said for the hardscape the infrastructure projects that appear permanent that make people feel like their city is taking care of them. And it goes a long way. It's kind of like the visual of the fire truck at the block party on 4th of July.'",
        "'speaker_4': 'Residents go out, they see it, they touch it. They feel proud of their city. It's the same thing with infrastructure. People are driving down the road that is paved and they're not driving over potholes. They have a feel good feeling about their city.'",
        "'speaker_4': 'They feel like they're being taken care of. It's a minor thing, but when they're driving over that pothole, they're reminded of all the things they don't like about their city. It's not just about the pothole, it's about the response times, and it's about the climate issues.'",
        "'speaker_4': 'And it's about, you know, services not being open and facilities not being open. They're reminded of all the things they don't like about their city when they drive over these potholes. And so I know it's I'm probably preaching here and on a soapbox that that view as our public works director, Mr. Lopez, don't want to hear.'",
        "'speaker_4': 'But we have, you know, infrastructure and public safety, in my opinion, are must haves for a city. Everything else is a great to have, wonderful to have. But if people are driving over potholes every day and they're paying as much taxes as they are to live in the city, we're not doing our job.'",
        "'speaker_4': 'And so I think about projects on major arteries. I know Councilman Mongo and I, we're probably just one example. Every council district probably has one. So I'm just using mine because I don't know what I don't know. And I know about my district.'",
        "'speaker_4': 'Studebaker We've been talking about Studebaker for six years. Thousands of residents drive every day to go to work a new Studebaker, and every day they're reminded of things they don't like about the city. So I really want to try to focus on getting the biggest bang for our buck in terms of infrastructure and where we can make'",
        "'speaker_4': 'the most impact with the.'",
        "'speaker_6': 'Limited resources we have.'",
        "'speaker_4': 'I hope the federal infrastructure. Package comes through, and I hope we can benefit from that in some of these major arteries. But if not, we've got to figure out how to close those funding gaps. Because I know Council Mungo has been involved in other joint use committee meetings where they voted to fund Studebaker.'",
        "'speaker_4': 'We sued Caltrans. We have some money there. It just seems like we can never make up that that difference. And so I would love to see that happen. Thank you.'",
        "'speaker_3': 'Thank you. Councilmember Urunga.'",
        "'speaker_2': 'Thank you. And I'm really pleased with a lot of the discussion that's taking place today, because obviously it's highlighting a lot of the needs that we have. And I want to thank staff for being straightforward and transparent in bringing what we really are and what we need.'",
        "'speaker_2': 'Very pleased and very happy that the mayor has brought a focus to playgrounds. As I celebrated the ribbon cutting of a new playground at Cherry Park, I also had the this unfortunate incident that happened at Admiral Kidd Park, where we had a playground just completely destroyed.'",
        "'speaker_2': 'Devastating to their community doesn't mean it's over. It needs to be replaced. And I would like to see if we can somehow put out a fast track on their playground, because obviously all my clients are members here. Too, too.'",
        "'speaker_2': 'All nine of us are focusing in on Andy and explaining that we need playgrounds for our communities, where our kids go play. And and it makes for a great neighborhood where there's a there's a park and a playground.'",
        "'speaker_2': 'And obviously, the devastation that we suffered in National Park in the West Long Beach area is it's just I can't I can't express the the heartbreak and the devastation that I feel for for the loss of that park.'",
        "'speaker_2': 'So I really want to have an opportunity to fast track a playground for that area as soon as we can. It needs to be replaced. The the the void that that playground made to the West Palm Beach is just just a devastating.'",
        "'speaker_2': 'That's not to say that the only priority we have. Obviously, there's a lot more. But second to me, and that's very important is about the allies. We I had a lot of very allies in my district. Fortunately, we've gotten to fix quite a few of them.'",
        "'speaker_2': 'There's still a number that that need to be fixed. And obviously, it's important for this virus to be fixed for one major reason. There's no only reason at all. It's access. Access to our facilities, to our trucks, to pick up trash and to be able to have access to other parts of the streets as they go through'",
        "'speaker_2': 'the alleys. That's what they're for. And then finally, of course, I would just mention right now down in terms of our our potholes and streets, you know, when any community that you drive into and you see a nice.'",
        "'speaker_2': 'Nicely paved streets with freshly painted signs and and roadways. It makes you feel good about that city. And if there's anything that talks about what kind of city we have, it's the condition of its streets and sidewalks. And obviously, that's that's something that we were for the most.'",
        "'speaker_2': 'I mean, every every council member has its issues with streets and sidewalks that we all try to prioritize. But we can't unless we work with you with with the with our city management entirely and trying to prioritize that.'",
        "'speaker_2': 'And I know you had a difficult job of saying, you know, you got nine, nine bosses here, if you will, and each one of them has its own needs, his own his or her own needs, and wanting you to prioritize that particular project.'",
        "'speaker_2': 'So I know the difficulty that you're confronted with. However, it's it's about the city as a whole. And we want to make sure that our city is the cleanest, the most mobile that you can use in the region.'",
        "'speaker_2': 'And that's our goal. Our goal is to make Long Beach a better it could possibly be. And the only way to do that is by prioritizing what we want to do, and that's to keep our our streets paved straight and safe and.'",
        "'speaker_2': 'With good playgrounds. So that's my that's my emphasis going to be trying to get that, that playground back up and going. And let's let's try to work together and see if we could find something as soon as we can.'",
        "'speaker_2': 'I appreciate that.'",
        "'speaker_5': 'Yes, sir. I did want to just get kind of an update to the whole council, and that was a devastating fire. I think a lot of you saw it. It was arson. I'm still trying to figure out exactly what happened there, but it was a total loss.'",
        "'speaker_3': 'We are moving immediately to just.'",
        "'speaker_5': 'Clean the site and we need to just find the resources to clean the site and put it back to a sand area. And then we're looking to do some temporary.'",
        "'speaker_3': 'Fixtures just to give people.'",
        "'speaker_7': 'Hope that.'",
        "'speaker_5': 'That is going to be a site, again, you know, very quickly. And then we do need to prioritize finding money for that for that playground so.'",
        "'speaker_3': 'That we can get it restored to what it was before or.'",
        "'speaker_5': 'It doesn't need to be exactly restored to what it was before. We're looking at all kinds of different options.'",
        "'speaker_2': 'Thank you, Mr. Morgan, for that update.'",
        "'speaker_3': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. Thank you, Vice Mayor. And I also want to thank Mr. Eric Lopez for this presentation. I had the privilege of attending last Tuesday's meeting at Mark Twain Library with Councilwoman Sorrow, and I saw a bunch of my residents that were there and very active in the budget process.'",
        "'speaker_1': 'It was really great to see all the staff see our city manager, Tom Baraka, our budget chair, Councilman Austin, all out in the community just interacting with these residents in the roundtables and really listening to their priorities. So that was just great to see.'",
        "'speaker_1': 'I also agree with all of my colleagues about the importance of the roads and the alleys and all of the playgrounds. So I don't know if you can see this big smile that I have right now underneath this mask, but it's big.'",
        "'speaker_1': 'I do. I agree with you, Councilman Price. I love this water playground. I don't know. It looks like it's the size of a football field. And I know that children and kids all over the city are going to enjoy that.'",
        "'speaker_1': 'And then when I look at the end of the basketball courts and just all of the things that's happening here, it's just it's just really exciting. I do have one question for you with regards to the convention center.'",
        "'speaker_1': 'Can I get some type of analysis at some point in the future on what the outlook of the maintenance needs are for the convention center and then how that is going to be funded? Because I don't see that here, but it doesn't mean it's not here.'",
        "'speaker_1': 'So I'm going to ask that. And then one other question. Can you, Mr. Lopez, go into a little bit more detail about, on page 44, the bikeway and pedestrian improvements projects and what they are going to look like.'",
        "'speaker_5': 'So let me answer the first part and.'",
        "'speaker_7': 'Then turned to Eric. And yes, we can certainly dove more into the convention center.'",
        "'speaker_5': 'One of the things that we spent.'",
        "'speaker_3': 'Measure on is really getting data and.'",
        "'speaker_5': 'Analysis on all of.'",
        "'speaker_7': 'Our city facilities prior to measure. We kind.'",
        "'speaker_5': 'Of had.'",
        "'speaker_3': 'To estimate or we had to go look at each.'",
        "'speaker_5': 'One. When it was time to do it. But we didn't have a comprehensive analysis and so we did.'",
        "'speaker_7': 'That with our streets so we could make database.'",
        "'speaker_5': 'Decisions on our streets. We did it with sidewalks, we did it with alleys, and now we are finishing up on our facilities. So we have gone through the convention center as one.'",
        "'speaker_3': 'Of our major facilities.'",
        "'speaker_5': 'It has in the $55 million range worth of need over the next.'",
        "'speaker_3': 'Several years for upgrades.'",
        "'speaker_5': 'Some of.'",
        "'speaker_3': 'Those are things like HVAC.'",
        "'speaker_5': 'Systems that haven't been touched since the nineties and need.'",
        "'speaker_7': 'To be improved so we can get into more of that. That's kind of what our discussion on infrastructure is going to be, is looking at the longer.'",
        "'speaker_5': 'Term things, not things that are funded this year.'",
        "'speaker_3': 'But what are our challenges and what are some.'",
        "'speaker_5': 'Of the opportunities? And Eric, if you can talk about pedestrian.'",
        "'speaker_3': 'Mobility, please.'",
        "'speaker_5': 'Absolutely. Thank you, Tom. And so for the bikeway and pedestrian improvements, we have 1.4 or 5 million proposed for FY 22. The this program is intended to help us repair and maintain bike corridors and for and to reduce future infrastructure expenses.'",
        "'speaker_5': 'So it is a maintenance type of program. We actually our funding for this consist of major measure of county measure R for Metro County Measure M, also from central and some air quality funding that we get. We have a series of locations of focus, including our Orange Avenue backbone bikeway, our Pine Avenue Bike Boulevard, our Pacific Avenue'",
        "'speaker_5': 'cycle track, our downtown walkable streets, the Atherton Street Bikeway areas, the livability initiatives. And we also use some of these funds for grant matching funds. So it's a multitude of uses. I And it does change year to year depending on some of our grants.'",
        "'speaker_5': 'So I'd be happy to give you more details on on that category, if you'd like.'",
        "'speaker_1': 'All right. Thank you, Mr. Lopez.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Councilman Mongo. Thank you. I really appreciate the comments of my colleagues and thought I would add to a couple of comments. A big thank you to Councilman Price. We talk about Studebaker. Studebaker has been a mishmash of funds and trials and meetings in places I'd never been to before.'",
        "'speaker_6': 'We've looked at technology that got us a grant to try something new on one piece of Studebaker, but not on other pieces. And so I think that Public Works has been really creative, and the residents are ready for it to be done.'",
        "'speaker_6': 'So we're very excited to continue to move forward with that. As for Councilman Ciro, she brought up an excellent point when you go to page 29, when you look at this. I noticed it during the presentation, but I'll bring it up.'",
        "'speaker_6': 'It doesn't have a total and I know why it doesn't have a total because that total is a scary, scary number. But I think it's important that we talk about it. This does not include parks and recreation needs unless it is a facility and the need list is $3.54 billion.'",
        "'speaker_6': 'And I think it's important for people to recognize that that is a very, very big number. I think the other thing that's interesting is when you compare it and I think this is a philosophical conversation that Councilman Price may want to lead infrastructure and it's up to her.'",
        "'speaker_6': 'She's the chairwoman. When you flashback to page 27 and you look at mobility, which is 6.3 million of the 21 million, so less than 25. Let's see, I have to use a calculator, but less than 20, 20, just over 20%, maybe 25%.'",
        "'speaker_6': 'But you look at page 29 of what the mobility need is. Streets and road improvements 50%. Alleys 30%. Sidewalk management, 17%. So 777 0% of our need is mobility. But. Only did that wrong. 66.3 divided by 21.63. Only 30% of our allocation is going towards mobility.'",
        "'speaker_6': 'And on top of that. Parks and Recreation is 1.2 million. That just seems like one playground. And I know that we've been working really hard to have one all accessible playground in the city, and I think it's current funding levels under 200,000 were a million short.'",
        "'speaker_6': 'To get to where we need to. And an all accessible playground is going to be more expensive than a typical big playground. And so I just think that from a philosophical standpoint, obviously our commitment to. The five year map was a priority, and maybe I should be making the division out of the final column on the right'",
        "'speaker_6': 'hand side to see where all that money went over time. And I know that there's a lot of different needs that really pushed Measure A, but if we want to fund things, I think the other thing we need to look at too is.'",
        "'speaker_6': 'Councilman Price talks about. Pride in your city. We started a signage program, and that program's now been unfunded for two years. It's great that the convention area or the Tidelands areas can get some signs of the airport, but the rest of our city has identity and entrance points.'",
        "'speaker_6': 'And Councilwoman. Councilman Richardson and I have a lot of entrance points to the city that the community was promised signage and pride, and it just hasn't materialized. And I think we need to make sure that's available. And then my last note is the county of Los Angeles just put out a notice that supplies necessary to make each'",
        "'speaker_6': 'HVAC repairs are not even available. I mean, the wait lists for what we need. If we plan to do something in March of next year. We should be ordering parts now because there's so many back orders. So I think we really need to get a comprehensive economic overhaul, look into our system.'",
        "'speaker_6': 'That and what I'm also hearing is overhead door repairs, the cogs and the wheels and the things that we need from certain countries are just not coming in because of backlogs and supply creation during COVID. And so if we can go into that and figure out what the truth is.'",
        "'speaker_6': 'Postpone some projects that won't have the materials necessary. And then lastly, I want to talk about private funding. We do not lean on our private funding partners enough. We have partners of parks. The moment that that playground burned down.'",
        "'speaker_6': 'Partners of Parks should have had a nonprofit go fund me up. And the Go Fund Me executive director from the organization. They usually put in 20 grand to get you started. There's a lot of opportunities out there that we're just not capitalizing on.'",
        "'speaker_6': 'When you bring in or really invest in your Fire Foundation or your Parks Foundation or your library foundation, the Library Foundation's an amazing things, but our Parks Program and Partners of Parks is sitting on a bench list of donors that want to give five grand each.'",
        "'speaker_6': 'For two, three, five years. And so if we don't give them the opportunities to put in the benches or name a field or name a playground after themselves. Hell, you won't give me $1,000,000. I will make it the Eric Lopez playground.'",
        "'speaker_6': 'I will make it whoever's playground so that we can give the children what they need and get to 3.54 billion because tax dollars alone are not going to get us there. Thank you.'",
        "'speaker_3': 'Thank you. So I'll just add my comments here before we go to public comment and wrap it up. So I agree with everything the council members have said. I think everyone has a good understanding of their districts and their needs.'",
        "'speaker_3': 'I think we all agree on streets and sidewalks. You know, one thing I will say is that, you know, I'm not a big fan of the two year plan. And I remember, you know, and I've got a lot of institutional knowledge.'",
        "'speaker_3': '11 years here. I remember when it was, you know, here's how much every district gets. You go to your community, you make a priority. You pave what it is and you get input on what's in design for next year.'",
        "'speaker_3': 'So people have some sense of what's going on. The two year plan, I'll tell you, I look at the streets in the city. I don't know any resident who looks at that and says, yeah, that's it. Secondly, I think you just used to go further.'",
        "'speaker_3': 'It seemed like, you know, the amount of street we will get. You know, I remember when as a half a mile man and went down to like a quarter of a mile, it just seems like it doesn't go as far as it used to be.'",
        "'speaker_3': 'Maybe as costs have increased, I'm not sure, but I'm not necessarily committed to the system that we have. I think what makes more sense is we've gone through in the last decade two different strategies. And I think we need to just, you know, be very, very clear about when we're starting a new process and when we're stopping'",
        "'speaker_3': '. So people don't say the reset button doesn't get set over and over on residents. As I can tell you, we're just now getting to Artesia Boulevard. Steve Neal talked about Artesia Boulevard when he was sworn into office in 2010.'",
        "'speaker_3': 'And then there's 2021 and we're not breaking ground until Q1 of 2022. That's 12 years waiting on one corridor and South Street is the same story. Market Street is the same story. I mean, it's the same story in these corridors.'",
        "'speaker_3': 'So something's not not working. And we have to really figure out how we can be serious with the residents about what we can actually deliver. And so, you know, I like you a lot, Mr. Lopez. I'd love to see your thoughts on how we address that.'",
        "'speaker_3': 'And secondly, you know, you know, we're knocking out a list of things in in North Long Beach because everybody has a different understanding what need is. At one point, we need a library. We focused on that. We got that done.'",
        "'speaker_3': 'Prior to then, it was the fire station. We had a little one. Then we needed a one that was a decent sized, you know, the community center raining every year, the shelter, it's an emergency every year. The health center finally get in there.'",
        "'speaker_3': 'But, you know, a lot of those decisions are depend are determined by grown ups, adults who are saying this is the priority. And every time we prioritize what the grown ups need and all that time, it's hard to provide for the youth.'",
        "'speaker_3': 'I'm excited for all of the playgrounds across the city. They look great. I take my kids to these programs. We're trying to get to every signature program in the city. But again, my district and this is where I get to just got to speak up for my community.'",
        "'speaker_3': 'My district has more children than any district in the city and still has not built a new playground. And there is plenty of need. There's plenty of opportunity. I don't want to take away from what any other council member said about their needs, but at some point we need to deliver a playground in my community.'",
        "'speaker_3': 'Halton Park. Ramona Park. Prime candidates surrounded by schools and children. So we certainly need to deliver that. The second thing I would say is we certainly I'm almost done. I'm almost done. The second thing I'll say is the most important thing we can do right now together is advocate the Congress.'",
        "'speaker_3': 'Because all the hopes and dreams we just heard as of right now, a local street program is not included in the Congressional Congressional infrastructure plan. I'm not sure if you guys know that today it's not included in the program.'",
        "'speaker_3': 'And unless we get what our members of Congress and advocate, we need to advocate for those things in order to make it a reality. In recent months, you know, through through SAG and through FET ledge, we've had a number of conversations pushing this.'",
        "'speaker_3': 'Alex Padilla, MAXINE Waters and that. Barragan Lowenthal, Sanchez Schiff. We're pushing that. It's hard to advocate now because we can't go to D.C. It's almost you know, our advice from the lobbyists is don't even come. It's not even working.'",
        "'speaker_3': 'The the you know, the virtual lobbying is incredibly important. So we have to get creative in how we do that. Our fit led committee is going to continue doing that. We're going to advocate through our advocacy strategy and Dennis and everybody continue to focus on that.'",
        "'speaker_3': 'But that's the most significant thing we can do. It looks like Cindy is going to take it up very soon. Like in August, the Senate will take it up and then we should have the House take it up and finish it in September.'",
        "'speaker_3': 'That's the hope. So we have a little bit of a window to get to members of Congress and talk about a local road program, because right now it's not a part of the part of the package. So those are my generally my thoughts on this.'",
        "'speaker_3': 'And at this point, we're going to open up, see if there's any public comment. There's no public comment. All right. No public comment. So we're done with this. Members, please cast your vote.'",
        "'speaker_4': 'Motion carries.'"
    ]
}