{
    "Entertainment with Dancing Permit for La Lune Imperial.": [
        "'speaker_5': 'Thank you, Vice Mayor. First hearing involves financial management with a recommendation received supporting documentation into the record, conclude the hearing and grant a permit with conditions on the application of La Lune investments. Doing business as a loan imperial at one four or five eight Atlantic Avenue for an entertainment with dancing by patrons permit.'",
        "'speaker_5': 'This is in District six. The you in each of you solemnly state that the testimony would be given this cause now pending before this body shall be the truth, the whole truth, and nothing but the truth help you God.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Good God, introduce city management?'",
        "'speaker_6': 'Yes. Vice Mayor. Members of the council, denis dakota will provide the staff report on this item.'",
        "'speaker_3': 'Thank you. Assistant City Manager. Mr. Vice Mayor and members of the Council. This is a recommendation for approval from staff for entertainment with dancing by patrons for Live Lune Imperial Investigations. Inspections have been.'",
        "'speaker_0': 'Conducted by fire departments.'",
        "'speaker_3': 'And 20 standard conditions have been issued along with four additional conditions. And this establishment currently does not have a liquor license. They have applied for one which was approved by this council in December, but the ABC has still not acted on it.'",
        "'speaker_4': 'But this is independent.'",
        "'speaker_2': 'Of that action. That concludes my report.'",
        "'speaker_0': 'Okay. Thank you very much. We're going to go ahead and move on to any public comments, if there are any further hearing. See none that we're going to go ahead and take this back to the council for any deliberations and to close the hearing.'",
        "'speaker_0': 'And I'm going to start off with council member Andrews.'",
        "'speaker_4': 'Yes. Thank you. And Vice Mayor, I'd like to move to approve with the agree with the conditions and I would like to move to approve this agenda item.'",
        "'speaker_0': 'Okay. There's been a motion and a second on the item. See no other comments. Members, please go ahead and cast your votes on the item.'",
        "'speaker_5': 'Motion carries nine votes.'",
        "'speaker_0': 'Thank you. Moving on to public comment. Our first member of the public speaking has been Mike McGowan or Meghan Markle Windsor, and then followed by Tom Couch and then Dennis Dunne. Our first speaker, Mr. McGuigan. Can we get the mike on?'"
    ],
    "Ordinance on Living Wage for Airport and Convention Center Workers.": [
        "'speaker_5': 'And 21 is an ordinance from the city, the office of the city attorney with the recommendation to declare the ordinance amending the municipal code relating to payment of living wages to workers at the Long Beach Airport and the Long Beach Convention Center.'",
        "'speaker_5': 'Read the first time and laid over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'There's been a motion and a second. Any public comment on the item? Case? None.'",
        "'speaker_2': 'You know, there was.'",
        "'speaker_0': 'Actually a counselor.'",
        "'speaker_3': 'JOHNSON Well, thank you, vice mayor. I mean, I heard from some members of the community, some of the folks who are advocating for this, that there was some concern about definition of, I think, retail worker. And I don't know, I hadn't heard much more than that.'",
        "'speaker_3': 'But as you may hear from the state attorney's office, as that concern being addressed or some policy questions for the council to look at, or are you aware of this concern?'",
        "'speaker_0': 'Mr. President.'",
        "'speaker_3': 'Vice Mayor, members of the council with Councilmember Johnson. I have not been made aware of a specific concern regarding the definition of the concession worker. We did meet with some of the union groups that were in favor of this, and they had reviewed the language and had had no comments regarding that.'",
        "'speaker_3': 'So as of as we sit right now, I'm not aware of that. As an ordinance, if as adopted by the council, if there was a change that was desired by the council at a future date, it could be amended on a Tuesday to if there's clarification necessary.'",
        "'speaker_3': 'Okay. Well, certainly if there's anyone here in the audience who'd like to offer a clarification, I'm happy to hear it. If not, this will come before us in second reading. Is that correct? So if there is an issue, please voice that concern.'",
        "'speaker_3': 'I think the council has to make sure there's no ambiguity.'",
        "'speaker_0': 'Thank you, Constable O'Donnell.'",
        "'speaker_2': 'Yeah, I think the concern was to add retail that there was a concern. So this is first reading. So it would have to come back for a subsequent first reading or would this be a a non substantive change so that it would not come to that for a first reading and come back for a second reading?'",
        "'speaker_3': 'Vice Mayor Members of the Council. Councilmember O'Donnell. That that would be a substantive change. And so if you I think your options before you tonight are adopted as it is, we could continue the item if if there was direction to change it and bring it back to you for first reading at a later date.'",
        "'speaker_3': 'Or if you adopted it as it is, it would come back, I think, in two weeks to the next council meeting for second reading. And then at any time subsequent to that, it could be amended to a to add additional to retail workers if that was the desire of the council.'",
        "'speaker_0': 'That is my desire. So what I'll do is I'll.'",
        "'speaker_2': 'Make a motion to I do we have a motion currently we do make a substitute motion to add retail workers to the to the ordinance and city hall level for first reading. I believe next week we need to do it two weeks of I'm sorry, two.'",
        "'speaker_0': 'Weeks and we'll have to come back for first reading with that with that change of the retail component is that. That is correct. Okay. And Mr. Parking just so that we're we're clear are you understand what a comfortable bonus talking about as far as the convention work go to include the retail piece, correct?'",
        "'speaker_3': 'I yes, I believe. Okay. I understand that.'",
        "'speaker_2': 'Okay, great.'",
        "'speaker_0': 'So there's the we have a first and second on the substitute motion, which is Councilmember Patrick O'Donnell's motion. Councilmember DeLong.'",
        "'speaker_7': 'City attorney, could explain for me so which workers would be included under the new arrangement that weren't previously included.'",
        "'speaker_3': 'My understanding, we would expand the definition to not only include the concession worker, which would be the food and beverage individuals, but also those working in retail stores or shops at those two facilities.'",
        "'speaker_7': 'Okay. I guess the one concern I will mention is that, you know, we've we've kind of patted ourselves on the back with one of the accomplishments at the restaurant was that you get street pricing for the food, that you wouldn't pay any more at the airport than you would at a restaurant in Belmont or downtown.'",
        "'speaker_7': 'I would tell you, if we increase the cost of the operation, then that's going to change and the airport will become more like a standard airport where you pay a premium price. But we could certainly go in that direction.'",
        "'speaker_7': 'But that will be one of the downsides.'",
        "'speaker_0': 'Okay. So no other council comment on this. I had called for public comment, didn't hear any. So what the motion on the floor is, which is a substitute, is to have this come back in two weeks. Mr. City Attorney, with the change on the retail component.'",
        "'speaker_0': 'Please cast your vote on that motion.'",
        "'speaker_5': 'Motion carries nine votes.'",
        "'speaker_0': 'Moving on to the next item, we're going to do 13 and then go back to the regular agenda.'"
    ],
    "Report on Filming Status, Incentives and Promotion in Long Beach.": [
        "'speaker_5': 'Item 13 is communication from the Office of Council Vice Mayor Robert Garcia, Councilmember Patrick O'Donnell and Councilmember Al Austin with the recommendation to require the city manager to return within 90 days and report on the status of filming in Long Beach.'",
        "'speaker_5': 'A review of the incentives we provide and a proposal is to stimulate further interest from the film companies to locate their productions in within the city of Long Beach.'",
        "'speaker_0': 'Thank you. Mr. Cutouts makes some brief comments and we've had a lot of conversations are here I think get the city at the council level about filming and production here in Long Beach have had some interesting conversations over the last few weeks with members of the industry.'",
        "'speaker_0': 'And certainly there's concern, I think, not just statewide but across the country. As far as what filming is looking like in the direction of our filming here, I know that the state led committee has been doing some really good work on this issue and moving forward some legislation as well.'",
        "'speaker_0': 'And so essentially what this would do is this would bring back Mr.. Mr. West, hopefully sooner rather than later. You can do a presentation to the Council about the changes. I know we've made some staff adjustments in filming and in that area.'",
        "'speaker_0': 'I think it'd be great for the Council to know what those are, kind of who they make contact people are. Now we've created, I know some new roles. I think it'd be good to review those as well as review exactly what the incentives that we provide here in the city.'",
        "'speaker_0': 'Certainly we do some really great filming at the city. We also want to make sure that part of that is respecting the neighborhoods where they're filmed then and then if we could also look at what what other cities are doing out of the L.A. is kind of rolling out some new incentives in this area.'",
        "'speaker_0': 'And so I think it'd be great to review all that and maybe get a get a presentation from the from from all of you on that. So that's the motion on the floor. I'll turn this over now to and I'll make that motion and I'll turn this over now to Councilmember O'Donnell.'",
        "'speaker_2': 'Thank you, Mr. Vice Mayor. And I do want to comment first and start off, you know, by saying, as I understand it, language is very proactive with regard to supporting the film industry. And remember, this is not just about Long Beach.'",
        "'speaker_2': 'This is about supporting our regional film production, how we want to label television sets, whatever you however you want to say it. Our you know, our big employers don't think of the actor in front of the camera and think of the set.'",
        "'speaker_2': 'Think of all the people supporting that set, whether it's the the truck driver that delivers the equipment, you know, the food support and, you know, someone holding the grip above the the actors. There's a lot of people that work on a set.'",
        "'speaker_2': 'If you live in Long Beach, you know that because there happens to be traditionally at least a lot of filming in Long Beach. And again, that's because we've been very proactive. So this is our effort to partner be a partner to our region to support the film production industry.'",
        "'speaker_2': 'And as you mentioned, Mr. Garcia, we're also adding as part of our state ledger to be as supportive and proactive at the state level, the Sacramento level, to support the film industry staying in California, because there are 42 states, 42 nations that are offering film credits and other ways to take our film production and put it in'",
        "'speaker_2': 'their community and put people to work in quality jobs. And we want to keep them here. This is our effort to keep the film production industry present in Long Beach and across our region.'",
        "'speaker_0': 'Thank you. Counts. Membership Scheme.'",
        "'speaker_8': 'I just hope, though, that the public understands that. I think Mr. O'Donnell just said this. We had a conversation on this council. I don't know if you were here, Mr. Garcia, when we did this, but L'image is the cheapest date in the state when it comes to filming.'",
        "'speaker_8': 'We ask for a review of the permit fees. We were one of the lowest. Our special events department has gone to extraordinary lengths to work with the movie industry. One of the difficulties we had when the Boeing property was being used for filming is that many of the movie studios that use that site would bring in outside'",
        "'speaker_8': 'catering. Not in Palm Beach. So we've you know, we're we've got to make sure that we're when we do things, we're not giving ourselves away too cheaply. So I would hope that our our permit fees can be competitive.'",
        "'speaker_8': 'But at the same time, I just don't want to leave the impression with the public that this isn't something that the city staff hasn't been working on. They have extensively. And that is why we've had Dexter and CSI Miami and a number of films that it's done here in Long Beach, because we've been very accommodating, particularly our'",
        "'speaker_8': 'police and fire department as well. And I think that that has brought some extra revenue because those are chargeable hours. So I think certainly a review of what we've done would be very helpful to figure out where we need to go.'",
        "'speaker_0': 'All right. Thank you, Councilmember Landers.'",
        "'speaker_4': 'Yes, thank you, Vice Mayor. You know, first of all, I like to think that I should be in a special event staff. They're doing an amazing job in our city. And I know that the cities across the state and country is seeking ways to enhance their FEMA numbers.'",
        "'speaker_4': 'And I appreciate your team hard work in getting them permit increase since last year. You know, as per this report, I think this will provide us with some useful information. And I would also like to stress that there's a very important to keep the balance of the family company coming in and in the needs of our constituents'",
        "'speaker_4': ', especially in the downtown area where a lot of films are taking place.'",
        "'speaker_0': 'Thank you very much, Councilmember Andrews. We have a motion on the floor. Any public comment on the item? Mr. Dunn. Thank you.'",
        "'speaker_11': 'A picture is worth a thousand words, and particularly film folk. Auditions are the celluloid world, you know, impressed by film. I would recommend, if you haven't already done it, already commissioned a half an hour film to be made about the incentives along each say encapsulate in the cheapest to state the cheapest.'",
        "'speaker_11': 'As far as film goes, as far as things offered. Interview with the directors in a film here would provide incentive. You know, even go a step further. It might strike some as humorous, but it is true. Sometimes the likes are caused by stomach use.'",
        "'speaker_11': 'And what I'm trying to say is it it might sway assuage your appetites if doing one of these film commission movies they may be served salmon and chopped and champagne. There is the royal treatment and and the regal touch my this I think that when you might find it appealing and just at the point of gossip apparently'",
        "'speaker_11': 'is it Isidora won a Golden Globe Award and an Oscar on the basis of what the critics say. Her husband provided them with salmon and champagne. Champagne, and that, likely said, influenced greatly her ascendancy with an Oscar Golden Globe Award.'",
        "'speaker_11': 'It does happen, but I do think that a movie, if it is not really made a movie, should be made to appeal to appeal to movie folk.'",
        "'speaker_0': 'Thank you. See no other public comment. There is a a motion on the item members to go out and cast your votes.'",
        "'speaker_5': 'Motion carries nine votes. Yes.'",
        "'speaker_0': 'Thank you. Back to the regular agenda item 11 a.m..'",
        "'speaker_5': 'Item 11 is a communication from the Office of Vice Mayor Robert Garcia with a recommendation to approve the use of First Council District f y fiscal year 12 surplus funds for neighborhood service projects in the amount of $15,144.'"
    ],
    "Opposition to Weakening the Medical Injury Compensation Reform Act and Membership in Californians Allied for Patient Protection.": [
        "'speaker_5': 'The recommendation for the Office of Council Member Sujatha Lowenthal with a request to the City Council to oppose any bills or ballot measures that would weaken the Medical Injury Compensation Reform Act, thereby increasing health care costs for state and local governments and limiting patient access to health care services.'",
        "'speaker_5': 'And request the city attorney to draft a resolution in opposition to bills or ballot measures that would weaken this act and request that the City of Long Beach become an official non dues paying member of California's allied for patient protection.'",
        "'speaker_0': 'Thank you. I'm going to turn this over now to Councilmember Lenka.'",
        "'speaker_6': 'Thank you, Mr. Vice Mayor. I would like to make the motion to approve and add a few comments. The Medical Injury Compensation Reform Act has protected patients and our fragile health care network in California for over 35 years.'",
        "'speaker_6': 'Its original purpose is still relevant today to ensure that injured patients are fairly compensated, medical liability rates are kept in check, and that physicians and clinics can remain in practice. Treating patients. Eroding Michaels protections to increase lawsuit payouts will hurt community clinics, especially community clinics, doctors, hospitals and other providers by increasing medical liability costs and threatening the'",
        "'speaker_6': 'health care system's ability to take on more patients. As California implements the Affordable Care Act, the timing of the collision of these two items couldn't be worse, especially since we are struggling to implement the Affordable Care Act. Attached to this item is an extensive list of micro supporters that formed the Californians of Allied for Patient Protection.'",
        "'speaker_6': 'More than 800 organizations including hospitals, community clinics, county and city governments, business and taxpayer groups, labor unions and members of public safety that support Micra and oppose any changes. This is a broad coalition across the political and health care spectrum and council members.'",
        "'speaker_6': 'I would like to ask you for your support. Thank you.'",
        "'speaker_0': 'Q Councilmember, I'm sorry, did you make a motion? Did did an emotion on the floor get the motion in a second? Councilmember O'DONNELL. Quick question. I know I've.'",
        "'speaker_2': 'Had a variety discussions on this topic as well. I thought we were listed on the list of micros supporters, my incorrect on it.'",
        "'speaker_6': 'So I thought we had discussed it.'",
        "'speaker_0': 'I did see your name.'",
        "'speaker_2': 'On a list not too long ago.'",
        "'speaker_6': 'I didn't see it on a list. We had brought it up in some conversation but did not formally take a position. And I had checked that. And Mr. Modica or his staff. Oh, there she is. She can respond.'",
        "'speaker_6': 'I know we.'",
        "'speaker_0': 'Yeah. Maybe we can let let's go and look staff respond real quick on.'",
        "'speaker_2': 'That and then you just hang let me just clarify what I know. I saw it on a list and I don't know if it said the city of Long Beach or it said the Long Beach Department of Health or Health Department.'",
        "'speaker_2': 'I don't know. But I, I given that we have doctors and provide medical services, I thought we were already on this.'",
        "'speaker_6': 'List of the city council. The city of Long Beach has not taken a position on this, but we are awaiting your direction.'",
        "'speaker_0': 'Okay. So so you're saying there's been no official position on behalf of the council, correct?'",
        "'speaker_6': 'Correct.'",
        "'speaker_0': 'Okay. Mr. O'Brien, do you want to continue the floor?'",
        "'speaker_2': 'No, no, I just I. I know I saw it on the list at some point. Either it's not there or I'm in. Very incorrect. But we're going to edit, it appears.'",
        "'speaker_0': 'Councilor Johnson.'",
        "'speaker_3': 'Well, thank you, Vice Mayor. There's certainly a very contentious conversation that's been happening since 1975. I think the issue here is how do you balance the rights of injured parties to be fairly compensated, particularly when something goes horribly wrong and people are negligent versus the right of doctors to be treated fairly and certainly the need to keep'",
        "'speaker_3': 'health care costs low and have access. I think my concern about this item is that whether or not Micra was a good idea in 1975, it basically locked in an amount $250,000 without inflation. So if we assume for argument's sake that two or $3,000 is the right figure in 1975, why would that possibly be the right figure'",
        "'speaker_3': 'in 2014 given inflation? So what happens right now in our micros at every year, that amount effectively goes down. And I just don't think that's good policy. I think on a wide variety of issues, for example, along with his Campaign Reform Act, we we build in inflationary adjustments to make sure that once they come to a number'",
        "'speaker_3': ', that number changes with time. You know, and a number of years of assuming we'd never made the change to fit $200,000, you know, might buy a Honda Civic in a number of years from now. Do we really think that's the right number?'",
        "'speaker_3': 'So with that, I'm going to go and make the motion to receive and file this item.'",
        "'speaker_0': 'There's been a substitute motion to receive and file. And a second on that. Councilmember DeLong.'",
        "'speaker_7': 'Thank you, Mr. Vice Mayor. I strongly support this item. I think it's a great idea. It certainly helps in making health care more affordable, which is obviously something very concerning to the community. But I would do a substitute substitute, which is for the city to take a position as recommended in the original item, but also send it'",
        "'speaker_7': 'to our request staff to come back with perhaps a detailed list of actions that the city could take and what some potential time table would be to support it.'",
        "'speaker_4': 'A second.'",
        "'speaker_0': 'Okay. There's been a substitute. Substitute. And can you can you repeat that second piece council word on.'",
        "'speaker_7': 'So the same piece is to direct staff to come back with a list of items that the city could take to advocate on behalf of this item in an associate estimated timetable.'",
        "'speaker_0': 'Councilmember Lowenthal.'",
        "'speaker_6': 'Thank you, Mr. Vice Mayor, and I appreciate the discussion that's taken place. So certainly, given a city such as Long Beach, where affordable health care is not only a challenge but seems insurmountable at times. I think this is certainly the time that we want to ensure access first and foremost, prior to considering any other priorities.'",
        "'speaker_6': 'And right now we have a great percentage of our residents who don't have health care and who are struggling to learn enough about signing up for affordable the Affordable Care Act. And anything that erodes that option is something that frightens me and concerns me deeply.'",
        "'speaker_6': 'You know, I won't trivialize it by suggesting that we're a tale of two cities, but we don't all share the same narrative. Everyone on this dais has health care that is not reflected across the board with our residents.'",
        "'speaker_6': 'And that's an unfortunate fact. And I'd like to ensure that we stand up and be sure that we don't further erode access to affordable care. And I think starting by supporting this is a good start. So council members, I do urge your support.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Councilmember Austin.'",
        "'speaker_2': 'It's just a point of clarification. I wanted to find out exactly where this ballot initiative is in the process. Had the signatures qualify and has it been assigned a number? Where are we in the process? Might we be jumping the gun here?'",
        "'speaker_6': 'I believe it has qualified for the do you have the sufficient signatures for that? And then the language is available as well.'",
        "'speaker_0': 'I'm going to let the city staff come in on that as well.'",
        "'speaker_9': 'Mr. Hanging has a comment.'",
        "'speaker_6': 'I believe this ballot measure is still up for circulation. It has the attorney general's title in summary, but I believe February is when we find out whether or not it has gathered signatures.'",
        "'speaker_2': 'And that is the reason why I seconded Councilmember Johnson's motion to receive and file this just because we are there's a lot of uncertainty as I look at the list of supporters for this this coalition to protect Micra the there are very few municipalities that are that are currently listed here and again I don't want to see'",
        "'speaker_2': 'us jump the gun here I do understand the merits in the of the argument to to to to support this initiative. But at the same time, I'm not sure if it will even qualify. And by doing so, what message are we sending?'",
        "'speaker_0': 'Constable Lowenthal.'",
        "'speaker_6': 'Thank you. And I just wanted to add that we are one of the few cities in the state of California that has a health department. And perhaps our concern and obligation as a municipality would be greater in that regard.'",
        "'speaker_6': 'And so I take that very seriously. Hosting a Department of Health right here in the city of Long Beach and see it as a privilege and also see that it is our obligation to send a message, especially because we have a health department here that is working to ensure that the Affordable Care Act is is is something'",
        "'speaker_6': 'that our residents have access to.'",
        "'speaker_0': 'Got somewhere, Austin.'",
        "'speaker_2': 'So are we asserting that if we don't support this, our residents won't have access to the Affordable Care Act and Affordable Care if this somehow goes awry?'",
        "'speaker_6': 'No, I'm drawing the nexus between affordable care and the dangers that bless you and the dangers of increasing the meritless lawsuits and the amounts that can be paid out. There is that nexus. So the higher those costs are, the more primary care providers we drive out of that business.'",
        "'speaker_6': 'And so that's the nexus. But no, no, to answer your question specifically, absolutely not. By not supporting this, it doesn't mean that people won't be able to sign up for the health care. The nexus I'm drawing is to the affordability.'",
        "'speaker_6': 'There's a direct link to affordability by ensuring that certain costs are kept down.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Johnson.'",
        "'speaker_3': 'Well, thank you, Vice Mayor, and I certainly appreciate the diversity of opinions on this very contentious issue. But I think it's important to note that meritless lawsuits lose. This is not about that. The question is for the lawsuits with merit, where there's been proven negligence and we have major damage to somebody's someone who's perhaps in a wheelchair'",
        "'speaker_3': 'for life or has lost vision or has had some other horrible thing happen to them that shouldn't have by definition or negligence. We're telling that person that under no circumstances can you have more than two or $3,000 for your pain and suffering, even though that was the same amount in 1975.'",
        "'speaker_3': 'So I guess I'm just kind of curious from the body I haven't heard so far what the possible reason is for basically not having an inflationary adjustment. Do we really believe that that person who's been permanently disabled, for example, should every year receive less and less just by the nature of inflation?'",
        "'speaker_3': 'I mean, I don't understand the reason unless we just don't believe in medical negligence lawsuits. And maybe that's what we're saying here. So I do oppose the motion. And keep in mind, this is not about meritless lawsuits. This is about people who've been seriously harmed and have a jury has kind of conclusion that they are merited, some'",
        "'speaker_3': 'compensation, further tremendous harm. And whether or not that person should have an award that's adjusted for inflation or whether you should pretend like this is 1975. So I urge a no vote. And I'd be curious to hear if anyone has a reason why we oppose basing inflationary adjustments here and we support it for virtually all other policies'",
        "'speaker_0': '. Counter Ron Paul.'",
        "'speaker_6': 'Thank you, Mr. Vice Mayor. And. Well, all meritless lawsuits don't lose. You and I both know that. So but that's that's not to be debated. Actually, on the second page of the agenda item, there is a cost implication there on how local budgets would be increased as a result of raising the cap from $250,000 to 1.1 million'",
        "'speaker_6': ', as the item suggests. And so that's not inflation since 1975. That's more than that. But I'd like to go ahead and just vote. Yeah, I'll call for the question.'",
        "'speaker_0': 'Okay. The question has been called, is any objection going to go to public comment?'",
        "'speaker_11': 'It is somewhat oblique, but it does. Is of concern on the part of the appropriate bill to keep medical costs down and to prefer and to make medical capacity even further. I would suggest that they be made a health certificate, emergency aid certificate, given for two hour sessions of the procedures to be had.'",
        "'speaker_11': 'It often takes 10 minutes for the paramedics to get there, or even a lot more time. During that time, a person could die or suffer up the agony if not served. That should be done at the school and biology class.'",
        "'speaker_11': 'But I would guess that we should be even open to the public to have to have these training sessions issued. It could be covered monetarily by the Red Cross and by funds given to the fire department. Those two entities could contribute to be the sponsors of it, or just be a health official, a nurse at school.'",
        "'speaker_11': 'How often have we wondered? What would we do if somebody was giving birth to a baby or is choking on food or had a seizure epileptic? I dare say not even the council knows what to do. What you do could be covered in a couple of intensive 2 hours at the most to cure this problem in medicine'",
        "'speaker_11': '. I think that this would reduce the cost of medicine. Might she not show? I would also affirm competency for these dire situations.'",
        "'speaker_8': 'Mr. Vice Mayor, I want to point out to Mr. Dunne as the registered nurse practitioner on this council, I could respond to any of those problems. Thank you.'",
        "'speaker_11': 'Well, certainly glad that I think I'm in good hands, but I just want to. Not my district today. Thank you, madam.'",
        "'speaker_0': 'Okay. Thank you. The question's been called. So we're going to go out and take any public comment. I don't see any other public comment. There is a there is a substitute substitute, which was Councilmember De Long's motion. And we're going to take a vote on that.'",
        "'speaker_0': 'I'm sorry. The substitute substitute was wrong. You want to repeat it?'",
        "'speaker_7': 'Yes, it supported the original motion but added directions to staff to come back with recommended list of items that we could advocate as well as an estimated timeline.'",
        "'speaker_0': 'Okay. So that's the item on the floor. Members, please go ahead and cast your votes.'",
        "'speaker_5': 'Council member, Neil. Motion carries seven votes. One vote no.'",
        "'speaker_0': 'Next item, Johnson.'",
        "'speaker_7': 'The attorneys.'",
        "'speaker_5': 'Adam 14 A report from the city manager in the Financial Management Department, along with Parks Recreation Marine to approve the award of a contract to biotech construction company for Bixby Park Bluff. Improvements in amount not to exceed $2.450 million.'"
    ],
    "Commercial License Agreement for Farmers Market at Bixby Park.": [
        "'speaker_5': 'Please cast your vote. Motion carries eight votes. Next item 13 is a report from Parks, Recreation and Marine with the recommendation to authorize city manager to execute a commercial license agreement with the Austin DAW for the operation of Farmers Market.'",
        "'speaker_5': 'It basically park for a term of three years. In with with three, two, with two, two year renewal options at the discretion of the city manager. This is in District two.'",
        "'speaker_0': 'Can I get a motion? Second, there's been a motion in a second. Any public comment on the item seen on councilor length of the June ad?'",
        "'speaker_6': 'Something we voted. And and I thought I thought it was read as item 13, but it's item 16. And I'd like to thank Parks, Recreation and Marine for bringing the item to council. This was another initiative that benefited from stakeholder input.'",
        "'speaker_6': 'I know we have Leigh in the audience here and I want to thank you personally for all your work on this. Leigh and local Harvest Farmers Market have been a great fit at Bixby Park, bringing the Bandshell and Plaza to life every week with the sounds and smells of the community.'",
        "'speaker_6': 'It's become a Tuesday tradition for many residents to meet, and the fact that it's a late afternoon, early evening event also makes it much more accessible to folks that have a different schedule. Feedback has been overwhelmingly positive ever since this opening their opening day and the market, if I could remind everyone, is open every Tuesday when we're'",
        "'speaker_6': 'at council from 3 to 7 in the winter and 3 to 8 in the summer. So thank you. It is a credit to you, Lee, and your staff that the market runs so smoothly and you have been a fabulous partner.'",
        "'speaker_6': 'I'd like to make the motion to move. I think we've already been second.'",
        "'speaker_0': 'We've got we have a motion to cut somewhat along. Did you have a comment?'",
        "'speaker_7': 'It's real quickly, Lee. I just want to thank you very much for the great work you do, not only at Bixby Park, but in the third district as well. Thank you.'",
        "'speaker_0': 'Thank you. There is a motion on the floor. Please cast your votes. We already did. Public comment.'",
        "'speaker_5': 'Motion carries eight votes.'",
        "'speaker_0': 'Next that I pleased.'",
        "'speaker_5': 'To report from Parks, Recreation, Marine and Marine with a recommendation to authorize city manager to execute any documents necessary to accept a non-monetary donation valued at approximately $150,000 from the Long Beach Friends of Long Beach Animals for installation of a dual purpose veterinary clinic at Pitchford Companion Animal Village and to execute any documents.'"
    ],
    "Agreements for As-Needed Real Estate Broker Services and Listing of City-Owned Property.": [
        "'speaker_5': 'Is a recommendation to authorize the city manager to execute four as needed. Real Estate Broker Services Agreement with four commercial real estate firms in amount not to exceed $200,000 so moved.'",
        "'speaker_0': 'There is a Councilman Lipski.'",
        "'speaker_8': 'I think Vice Mayor. Mr. Parkin, I understand there was a comment to the clerk about the concern that the city is contracting with black commercial real estate and that its principal is on our planning commission, and that they raised the issue of conflict of interest as the city utilizes their services but then has a planning commissioner.'",
        "'speaker_8': 'So I'm wondering if you could address that, because that was brought to the clerk's. It was one of the comments on online with the clerk.'",
        "'speaker_3': 'Members of the council. Yes, we received that comment and we are looking at that. We believe that there is not a 1090 violation. We've had this situation in the past with architects who have served on the planning commission and then have applied for other various work with the city.'",
        "'speaker_3': 'The issue is, as we see it right now and will continue. If anything changes, we will certainly notify the Council. But the if there was work that was provided to Blair real estate and Mr. Blair is over 51% of the company, then she would be required to recuse herself on any action.'",
        "'speaker_3': 'A city item that came before the Planning Commission. This could and has in the past created a problem with a quorum on the Planning Commission. But as we currently understand the facts, it would not raise a 1090 violation.'",
        "'speaker_8': 'Can I ask if if at some point certainly you could send a memo just back outlining that so that it's very clear if there's other people that have questions about it that you've you know, you're absolutely vetted.'",
        "'speaker_3': 'We will do that. Yes.'",
        "'speaker_8': 'We appreciate it.'",
        "'speaker_2': 'Because that hadn't been moved. Was there a motion that's been moved and seconded? Any public comment on that? I'm hearing no public comment. Members, cast your votes. I am? Yes.'",
        "'speaker_5': 'Motion carry said vote yes.'",
        "'speaker_2': 'Item number 19, the clerk will read.'"
    ],
    "Contracts and Appropriations for Video Surveillance Cameras and Components.": [
        "'speaker_5': 'Her 19 is a report from Technology Services and Financial Management with with recommendation to exit contracts with federal CIGNA Signals Safety and Security Systems of University Park, Illinois for the furnishing and delivering a video, surveillance cameras and related system components the amount not to exceed 500,002nd.'",
        "'speaker_2': 'The other was moved and seconded. Any public comment? No council comment. There is a council membership scheme.'",
        "'speaker_8': 'Thank you, Mr. O'Donnell. In terms of where these are going to be placing them. Mr. West, you and I were talking about this today. Is is the department going to the police department going to solicit some requests for locations?'",
        "'speaker_8': 'Because we know in the Ranchos area, as I mentioned, because of the high fences, people, cats, they can't see out in the street and we're having a number of auto burglaries. And they actually did request if we could have some cameras placed in the area.'",
        "'speaker_8': 'So is that is that something that's going to be entertained?'",
        "'speaker_0': 'We can certainly have.'",
        "'speaker_9': 'The police department reach out to each of the nine council districts to see where the council districts think these would go. But again, the bottom line, these are for crime and law enforcement. So.'",
        "'speaker_8': 'Yes, well, we have a number of crimes being committed. So if this could help the department, we certainly, certainly will.'",
        "'speaker_0': 'Reach out.'",
        "'speaker_8': 'All right. Thank you very much.'",
        "'speaker_2': 'Let's just do me a favor. Don't put them in front of my my house or my window with that. Why? Why? Well, a lot of reasons with that. I didn't want moved in second in any public comment on item number 19.'",
        "'speaker_2': 'I know public comment members cast your votes. I am a yes. And item number 19, item number 20, the clerk will read.'",
        "'speaker_5': 'Councilmember Austin, please. The motion carries a vote yes. Employees report from Technology, Services and financial management with a recommendation to contracts with recommended firms to provide as needed professional and technical services related to systems analysis, systems, systems development and implementation, project management and technical support for IT projects and systems in amount not to exceed $950,000.'"
    ]
}