{
    "Overview of Proposed FY 2018 Budget for Harbor and Water Department.": [
        "'speaker_0': 'So I just we made that one change because there's so many folks here for four Alba. And so we're going to go back to the start of the agenda and finish up the budget hearing. And I will turn this over to the clerk.'",
        "'speaker_0': 'We can please read the first item.'",
        "'speaker_2': 'Report from Financial Management Recommendation to receive and discuss an overview of the proposed fiscal year 2018 budgets for the following departments harbor and water and receive supporting documentation into the record. Conclude the public hearing and take the actions necessary to adopt the fiscal year 2018 budget citywide.'",
        "'speaker_5': 'Okay. Thank you, Mr..'",
        "'speaker_0': 'Mr. WEST. Mr. Mayor, Councilmembers. This is our last series of departments for budget hearings. We're going to hear from the harbor department and also the water department. So first up is the chief financial officer with the harbor department.'",
        "'speaker_0': 'Welcome back, Sam. Sam, Joe Blake Thank you. Good evening, Mr. Mayors. Members of the City Council, the harbor department is pleased to present the proposed budget for fiscal 2018. As Wayne mentioned, my name is Sam John, but I'm here on behalf of our executive director, Mario Cordero, who is currently traveling on port business.'",
        "'speaker_0': 'Our proposed fiscal 2018 budget is conservative, reflecting the financial challenges and ongoing uncertainty facing the maritime industry. The budget projects a modest revenue growth while keeping operating expenses in check and headcount flat. It reflects investment in the community and our commitment to be a good steward.'",
        "'speaker_0': 'It is important to remember that the harbor department is not a taxing authority and does not rely on tax revenue to fund its operations. Our operating revenue is derived from private businesses leasing port properties. Looking back, fiscal 2017 was a year of transformation within the shipping industry, with new alliances being formed, which has a significant impact on'",
        "'speaker_0': 'cargo volume and a major shipping line ceasing operation which impacted the port directly. Our industry leading capital investment program to modernize the port infrastructure and to provide world class service to our customers today and in the future is about 3 billion over the next ten years.'",
        "'speaker_0': 'Among our projects is the ongoing construction of the iconic Gerald Desmond Bridge replacement. We have 215 million for this project, which is about half of our total fiscal 2018 capital project budget. It's a major project and we are making progress.'",
        "'speaker_0': 'As you know, Long Beach container terminal at Middle Harbor is among the world's most technologically advanced and greenest. And our fiscal 2018, we have budgeted about 94 million for continuing construction. Part of the new terminal opened in 2016 and more acreage comes online later this year.'",
        "'speaker_0': 'Port staff is excited about moving to downtown closer to the port and other city staff in fiscal 2018. We have over 5 million budgeted for the Civic Center. We have 30 million budgeted for safety and security programs in 2018.'",
        "'speaker_0': 'This year we have seen delivery of the second of our two new Firebirds. These are the protector and the vigilance appearing in the slide, putting on a very impressive show which were commissioned to update our fire protection and safety capabilities and this big ship age.'",
        "'speaker_0': 'These state of the art vessels are two of the most advanced and powerful fire boats in the world. Our proposed fiscal 2018 budget is conservative, reflecting the fiscal prudence of the harbor department leadership. The budget protects modest revenue growth while keeping our headcount flat.'",
        "'speaker_0': 'The proposed budget totaled 748 million, which include for 57 million in capital investments, or about 61% of the total budget. As part of our investment and a multibillion dollar modernization program that is the largest of any seaport in the country, we expect operating revenue to slightly increase to 380 million or about 2% compared to fiscal 2017 budget'",
        "'speaker_0': '. This comes as we faced increased competition from other gateways and the expanded Panama Canal. Here's a breakdown of our sources of funds comparing the proposed 2018 budget to the 2017 budget. Of course, the biggest source of funds is our operating revenue.'",
        "'speaker_0': 'Some of the users highlights, again, modest operating revenue growth. We have also 225 million and planned new bond issuance in fiscal 2018. Of course, we will come to the City Council and seek approval before issuing any new debt.'",
        "'speaker_0': 'Our fiscal 2018 proposed budget of 748 million represents a 3% decrease from fiscal 2017 budget, mainly due to slightly lower capital spending. Still, the for 57 million capital program in fiscal 2018 leads the industry. And here's a breakdown of the uses of funds compared to 2017.'",
        "'speaker_0': 'Some of the highlights of our expenditures. As you know, the Tidelands transfer of about 19 million for fiscal 2018 was recently requested by the City Council. Protecting the environment continues to be a top priority for the port. Our air quality programs have reduced emissions dramatically compared to 2005 levels.'",
        "'speaker_0': 'This slide shows our very impressive report card. We are currently working with the Port of Los Angeles to update our joint pioneering 2006 Clean Air Action Plan to continue to reduce emissions and to aim for zero emission operation in the future.'",
        "'speaker_0': 'Public comments on the draft updated cap clauses on September 18 and the proposed plan is scheduled to go to a joint session of the two boards on November 2nd. And we continue a multi-year program that will provide 400,000 and fiscal 2018 for community mitigation grants to reduce the health effects.'",
        "'speaker_0': 'Of pollution. We continue to partner with the community and the city to make Long Beach a better place to live and work. One way is through our community sponsorship program, where we work with local groups to help reach residents.'",
        "'speaker_0': 'For fiscal 2018, the Board of Harbor Commissioners has budgeted 1 million for sponsorships. The first round of call for applications is open this month. So far in fiscal 2017, we have awarded 911,000 and sponsorships to 272 community groups.'",
        "'speaker_0': 'In addition, we also conduct education outreach. Since 1993, the port has awarded 721,000 and scholarships to 425 students pursuing careers in international trade and goods movement. Lastly, I would like to highlight our commitment to service, which really sets us apart.'",
        "'speaker_0': 'As you may have heard, we were ranked the top North American Seaport for the 19th time in 22 years at the annual Asian Freight Logistics and Supply Chain Awards in Singapore held earlier this summer. We are committed to provide the highest level of customer service to all those who interact with the port, from our customers to our'",
        "'speaker_0': 'community. This concludes my prepared remarks along with other staff. I'm happy to answer any questions. Thank you, Sam, and welcome back. So we're happy to have you back. I'm going to go ahead and Lester's objection to take the water presentation and then do questions for both that there's questions.'",
        "'speaker_0': 'So, Mr. Gardner.'",
        "'speaker_5': 'First, I want to point out there is no harbor without water.'",
        "'speaker_6': 'So is this on?'",
        "'speaker_5': 'Can I get my presentation, please? There we go. How do I do this?'",
        "'speaker_3': 'Right.'",
        "'speaker_5': 'Oh, there we go. Thank you very much. It's my pleasure to present the War Department's Fy18 budget. We are forming the citizens of Long Beach in 1911, and the White Port Department now provides water and sewer services to 90,000 service accounts, along with the delivery of safe drinking water.'",
        "'speaker_5': 'Customer service is our top priority for the Water Commission. For myself and for 220 employees. We are staff to handle water and sewer emergencies. Calls 24 hours a day, 365 days a year, handling over 10,000 such calls annually.'",
        "'speaker_5': 'With all the recent concerns across the nation regarding the quality of drinking water, our residents can be assured that Long Beach's drinking water meets or exceeds all federal and state regulations. To ensure this is the case, the water department has a team of highly skilled scientists, technicians and engineers who perform nearly 60,000 water quality tests annually.'",
        "'speaker_5': 'The backbone of our system is our 2500 miles of water and sewer pipelines located underground in every street in Long Beach. We have a strong pipeline replacement program, having replaced over 225 miles of water main pipelines since the early 1990s.'",
        "'speaker_5': 'For fiscal year 2018, we will be reinvesting $17.5 million of our ratepayer revenues back into the system for pipeline replacement and other critical infrastructure improvements. This chart demonstrates a great success story in the 1990s. We averaged about 150 water main breaks a year, with some years reaching nearly 200 main breaks in the late 1990s.'",
        "'speaker_5': 'The water department strategically targeted the long range replacement of our aging castor and pipelines as they were the most vulnerable part of our system. As you can see on the chart, our main breaks have dropped by 80% and now number about 30 year compared with the average of 150 a year previously.'",
        "'speaker_5': 'We're wisely reinvesting our customers water revenues back into the infrastructure, resulting in reduced long term costs. Another key area of investments in the area of technology. On the screen are three examples. This next fiscal year, we'll be assisting Parks and Rec by installing 20 smart meters to locate leaks in their irrigation system.'",
        "'speaker_5': 'As you've heard, they have quite a bit of leaks in the system. And with the smart system that we'll be installing, we hope that they will be able to help locate them and monetize the value of the lost water.'",
        "'speaker_5': 'On the sewer side, we have trench list technology, so sewer pipelines are below the ground, much lower in depth than water gas pipelines. And so we're using this new technology where we unfurl a sock, if you will, into inside the old damage pipeline and then we put treated water through there.'",
        "'speaker_5': 'And what it does is forms a brand new resin coated pipeline within the old pipeline that prevents us from having to trench the entire alley or street. And it's something that we're looking at doing on the water side also as we go forward.'",
        "'speaker_5': 'The last is a something called the smart cover. So on our sewer system, we have certain areas where we have rising sewer levels and we've installed these new smart covers which use sonar technology that hangs down from the lid of the manhole cover.'",
        "'speaker_5': 'And it will give us a text message in advance of the sewer level rising up to the street level. And so we'll get that either through text mail or email or through text messages. We get it. We installed at a local hotel and they receive a text message a few hours in advance, and we're able to prevent'",
        "'speaker_5': 'a sewer spill. With the full support of the wider commission, we have reorganized the Department so as to increase focus on quality control. Specifically in our pipeline work, we have created two key positions. One is the director of field operations to oversee both our water and sewer field planning and operation.'",
        "'speaker_5': 'The other is a superintendent of water construction to directly manage our water pipeline crews. Another key changes we have contracted back in the inspection responsibilities, increasing our team from two inspectors to now having eight inspectors on the team.'",
        "'speaker_5': 'They oversee the quality of both in-house and contract work. In the past, our in-house work was not subject to inspection and quality control suffered accordingly. Importantly, from the standpoint of the public and their neighborhoods, this reorganization includes much more attention on how we impact and leave the streets when we do our pipeline work.'",
        "'speaker_5': 'Previously, work was separated by main and service work performed by two separate field crews under two different supervisors. The work was poorly coordinated, resulting in lengthy interim period during which temporary patches could be left in place for up to a year rather than the preferred maximum of ten days.'",
        "'speaker_5': 'This was the chief complaint that we had from our neighborhoods. We're now treating all pipeline work as one project from start to finish and under one field supervisor and reviewed by one inspector. The result will be a finalized project with permanent paving that will be completed a much shorter period of time and fully in compliance with public'",
        "'speaker_5': 'works projects, without exception. What long drought has officially been declared over. I'm glad to say that the efficient use of water is a normalized way of life in Long Beach. Our Long Beach residents and businesses continue to use the water wisely, resulting in double digit reductions in water usage every month this past summer.'",
        "'speaker_5': 'As I mentioned before, Long Beach residents and businesses use in total about the same volume today as they did back in the 1950s, despite a 40% increase in our city's population. Most people don't realize it, but about 65% of a home's water usage is for outside irrigation.'",
        "'speaker_5': 'As such, Long Beach water continues to provide Lundegaard incentives up to $3,750 for eligible customers. The details are available on our website. Our successful lawn and garden program has resulted today in 6 million square feet of thirsty lawn being replaced with drought resistant plants.'",
        "'speaker_5': 'For future capital needs are utility constantly plans ahead to meet the long term water and sewer needs of our customers. On the near horizon, we expect to be investing in the development of new local water wells to maintain or at least expensive source of water, expanding the availability of reclaimed water to additional areas of the city, greatly'",
        "'speaker_5': 'increasing our replacement of our large and medium valves to enable better control of our pipeline system and the possible transition to smart meters for 90,000 customers, similar to what the gas utility has done. In terms of dollars, our fiscal year 18 budget is roughly $106 million in expenditures, with a forecast of $103 million in revenues.'",
        "'speaker_5': 'The bulk of our expenditures are tied to the purchase of imported water supplies. The cost for pumping locally produced water. The treatment of the water to ensure safe quality. And then the delivery of the water with all aspects of customer service.'",
        "'speaker_5': 'Some of the cost drivers include what we paid to the Metropolitan Water District or MWD for the purchase of imported water supplies from Northern California as well as from the Colorado River. This cost is increasing by 4% next year.'",
        "'speaker_5': 'Likewise, we pay a fee to the water replacement district or D to replace the groundwater we pump locally, which makes up about 60% of our water supplies. The cost paid to our D is increasing by 5% in 2016 I'm sorry, 2018.'",
        "'speaker_5': 'And the suicide or expenditures are about 22 million and our revenues are about 19 million. Sure costs are fairly stable. However, some costs are increasing primarily due to regulatory requirements for inspecting and maintaining our nearly 1000 miles of sewer pipelines, as well as the department responsible.'",
        "'speaker_5': 'Paying down some outstanding debt in the sewer fund. To keep the needed rate adjustments moderate and affordable. We will be drawing down our reserves in both the water and sewer funds. This allows us to keep our rate adjustments to 4% for water and 2% for sewer for the average residential household.'",
        "'speaker_5': 'The impact for water service will be a dollar 71 per month, while the sewer increase is only $0.23 per month. The chart behind you shows the combined average water sewer bill in Long Beach in comparison with similar usage in the other major California cities.'",
        "'speaker_5': 'As you can see, Long Beach is average residential bill. Even with the proposed rate adjustment included, it's far below those incurred by residents in other major cities. Thank you for your time and attention and will try to answer any questions you may have.'",
        "'speaker_0': 'Thank you, Mr. Gardner. Excellent.'",
        "'speaker_5': 'Oh, you know.'",
        "'speaker_0': 'That that's. That's actually true. Let's just give them more money. Okay. You're so funny. Okay, let's out. Any questions for for your presentation? And we'll start with Councilwoman Price.'",
        "'speaker_3': 'Q I have a question for Harbor. So, Sam, thank you very much for the presentation, and thank you very much for the briefing that you provided to me and presumably other council members as well. So I appreciate that.'",
        "'speaker_3': 'One of the questions that I talked with you about during our budget briefing that I know is something that I get asked a lot about because of press coverage and things like that is can you explain in terms of revenue sources and revenue expectation the fluctuation we've seen and how the sources of revenue that we are committing'",
        "'speaker_3': 'to our capital projects are going to assist us with future revenues, hopefully in the years to come?'",
        "'speaker_0': 'Absolutely. First of all, if I may, I would like to just mention that, you know, in the presentation I mentioned that we are striving for eventually a zero emission operation. We are also working on waterless harbor. So that may also come to pass.'",
        "'speaker_0': 'So the as far as the operating revenue is concerned, as you may remember, in about a year or so ago, one of our major tenants filed for bankruptcy, hanjin shipping, and we were able to replace that tenant with another major shipping line, which is really the second largest shipping line, and that stepped into Hanjin shoes.'",
        "'speaker_0': 'However, that caused a major hiccup as far as our operating revenue is concerned. So for 2017 we are slightly trailing behind, but we expect to close that gap by the end of this fiscal year. The predictability of operating revenue, which ties directly into the transfer to the Tidelands Fund, it's at the mercy of what happens in the'",
        "'speaker_0': 'shipping industry. So in April of this year, there was a major change in the shipping alliances. And shipping alliances really determine what cargo goes to what port having shipping lines. It took them quite some time to figure that out.'",
        "'speaker_0': 'So there was as well a bottleneck in the Far East that was caused by the confusion that the shipping lines were trying to figure out who goes where and and what. So hopefully all this is behind us. It is still unfolding as we speak, but that is part of the reason our operating revenue is very conservative, that'",
        "'speaker_0': 'we are only budgeting 2% one given what happened in 2017, but also given all the competition that we are getting from the East Coast Port and Panama Canal. And North West ports and Canadian ports and Mexico. My God.'",
        "'speaker_3': 'Thank.'",
        "'speaker_0': 'Okay. Thank you. Absolutely. Any other questions, Councilwoman Pierce?'",
        "'speaker_4': 'Oh, sorry about that. Yes, you can go ahead and stay. Stay. Yes. Thank you very much. Appreciate it. Sam, I really enjoyed meeting with you and the team, I believe, a little over a week ago. And I appreciate the budget and the conversations that we had around how our sport has adjusted to a very, you know, uncertainty'",
        "'speaker_4': 'that we've had. We also I was going to ask if you could talk a little bit about the TARP program.'",
        "'speaker_0': 'Sure. So the two ports allocate what's called technology advancement program funds and projects come in front of a committee that's formed of the two ports, and I think it has outside members as well, HMD and possibly CARD. And they decide those projects as which ones are technologically advanced that merit funding them.'",
        "'speaker_0': 'So a lot of these projects are innovative. They're projects that cannot find funding otherwise without the ports help because they are out there that they're not proven technologies. They're at the cusp of trying to, you know, breakthrough into something that is great and that will be of great benefit in the future.'",
        "'speaker_0': 'So the two ports fund those projects and those are very vital component.'",
        "'speaker_4': 'Thank you. And I just for my colleagues, a little bit of context. I think as we're talking about what a great resource it is to have the port in our city. We also talk about some of the high asthma rates we have.'",
        "'speaker_4': 'And I know that in Long Beach our asthma rates are still exponentially higher than L.A. County. And some of the conversation we hear from our port is we don't have the technology to go as fast as we'd like.'",
        "'speaker_4': 'And some of the community conversation is, you know, we'd like to see more advancements to get to zero emissions quickly. And one of the pieces that we don't talk about publicly enough.'",
        "'speaker_3': 'I believe, is the fact that we invest.'",
        "'speaker_4': 'In technology and that that is something that our port on top of being, you know, a huge economic engine is that we do have money allocated to do some of that. And so as we're moving forward, I think that we need to make sure we educate our community about the resources that we're doing and that we're investing'",
        "'speaker_4': 'in technology and trying to help create opportunities to move that technology faster. And any conversations that we can have in the, you know, with council or folks here at the city to to help assist that I think is really, really important.'",
        "'speaker_0': 'Good point.'",
        "'speaker_4': 'Second. I know we had some conversations around the fire station and I didn't ask the question before the council. But could you did you get an answer on whose property that is?'",
        "'speaker_0': 'So whose responsibility that is partly funded by by the port that's fire station five and partly by the city. So we are working with the fire department on some renovations there.'",
        "'speaker_4': 'Great. So I know that, you know, for our city, obviously, as the Queen Mary development gets built out, making sure that we have fire, I think our new fire boats are fantastic. But I know there's still some challenges with how they get in and out around that area.'",
        "'speaker_4': 'So anything we can do to make sure that our investments are protected. Thank you very much, Sam. I appreciate it.'",
        "'speaker_0': 'Thank you. Thank you. Those are the two comments. Is there a second on the motion? Mayor, just to receive and file?'",
        "'speaker_4': 'Yes, I did have. Please go ahead for. For water.'",
        "'speaker_5': 'Mr. Gardner?'",
        "'speaker_4': 'Yes. You want to go first?'",
        "'speaker_3': 'You know, I had a couple of questions, too. I apologize. Just one. In regards to the in assisting Parks and Rec with the smart meters to locate leaks in the irrigation system, have you identified where those smart meters will go?'",
        "'speaker_3': 'And do you know whether any medians will be included?'",
        "'speaker_5': 'I don't believe I don't believe medians will be included. But we met with Parks and Rec last week and we asked them to give us the list of 20 sites that they would like us to put the smart meters on.'",
        "'speaker_3': 'Okay. Because I know that I mean, obviously, there's a great need throughout the city, but in some of our medians, we've recently and not just in my district but throughout the city, we've invested a lot of money in plants, new plant palettes and some design work and things like that.'",
        "'speaker_3': 'And it would be nice if we could have some way to monitor that and be able to be more efficient with that. I know they're doing a great job, but that's something to keep in mind. Maybe a smaller smart meter for the medians cheaper will.'",
        "'speaker_5': 'Eventually mini eventually. But we're looking at IS and we're studying it right now whether we should install smart meters on all 90,000 accounts and so we may get there fairly soon.'",
        "'speaker_3': 'That's great. Thank you very much. And I apologize. I did have the question earlier. So council woman Peirce was very kind to let me jump back in. Thank you.'",
        "'speaker_0': 'All right. Councilman Pierce?'",
        "'speaker_4': 'Yes. I also want to thank you for the meeting that we had last week and this powerpoint looks awesome. Nice changes. I the same comment. I think that our water department has done a phenomenal job and technology like we just talked about.'",
        "'speaker_4': 'We don't share that information with all of our constituents and making sure that we're talking about how we as a city are saving saving those dollars. And so I think that that's really important. And I wanted to just ask if you could give an update on the California Water Fix and if the city has taken a stance'",
        "'speaker_4': 'on that yet?'",
        "'speaker_5': 'Actually, we're going to be having the general manager of the Metropolitan Water District come speak to our Water Commission on 26th, September 14th, I believe, at 9 a.m. at the Water Department. And so we have issued a press release and trying to get the public aware of that so that they can come out and hear directly from'",
        "'speaker_5': 'the general manager. All aspects of the California Water Fix. They expect that there will be a vote of the Metropolitan Water Board at the end of September. It may be pushed back a bit, but right now it's scheduled for the end of September.'",
        "'speaker_5': 'Gloria Cordero, our water commissioner, is on the board from Baltimore district and she'll be voting. She does not represent the water board. She represents the city of Long Beach on that board.'",
        "'speaker_4': 'Great. And then my last question is, we talked about recycled water and capture storm runoff, is that I know that we have some of the infrastructure in place. How are we with applying that citywide and what projects are?'",
        "'speaker_5': 'Stormwater under public works, but we're certainly in discussions with them on ways that we can assist them.'",
        "'speaker_4': 'All right. Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Casey, no other questions for the reports if have a motion in a second to receive and file both of those reports. Any public comment casher votes.'",
        "'speaker_4': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. We're going to go we're going to go ahead and go on to item 1.2.'"
    ],
    "Ordinance to Approve Water and Sewer Rates and Charges Effective October 1, 2017.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_5': '1.30.'",
        "'speaker_2': 'Report from Financial Management. Recommendation to declare an ordinance approving resolution establishing the rates and charges for water and sewer service to our customers as an emergency ordinance read and adopted as red and laid over in the next regular meeting of the City Council for final reading.'",
        "'speaker_0': 'It is a motion in a second is any public comment? So please. You can you can do it from up there if you like. The fact that Mike's on it. Are you going to tell you what to come down here?'",
        "'speaker_0': 'Come down. Come down, sir.'",
        "'speaker_1': 'Be patient and you will be in New York. Donald Trump in 18. We had a sign for you to write here. Can I put it right here? Go ahead, sir. Hey, why do you start my time already? I mean, of seconds back.'",
        "'speaker_1': 'Okay, I'm getting character. Okay, now, doesn't this. I believe this means more charges, right? This is going to be more charges for the people. And I know everything has to have charges, but you have screwed everything up so much by making this sanctuary and all the stuff you did with all this communist stuff and you're making it'",
        "'speaker_1': 'bad on the property owner. So that's the only reason why I don't like that. Like good water. But when it comes down to it, I remember the time you call them Trump and you had all the illegal aliens and you're proud of that.'",
        "'speaker_1': 'And then you try to set me up. So every little thing you do now without that won't be a Jet Blue, but you flip on them. Okay. And you did this here? None. The movies here, you keep on 25 million for the homeless every time I talk to them.'",
        "'speaker_1': 'They never heard nothing about it, you know, to manifest. You messed me up and put my life stream on. But I'm to have it on before foolishness and we're going to do this anyway. So no, you need to get all the property, in this case, double communists.'",
        "'speaker_1': 'And that little trick about sending Janine Pearce, I don't know if you did it at that time. You think you did it to some my friends who had an organization and then they're not going together and I'm not with them because she went in telling a white woman to dissolve the organization.'",
        "'speaker_1': 'You know what I'm talking about. Yes, you do. And then you told of make sure you address that.'",
        "'speaker_0': 'You can address me.'",
        "'speaker_1': 'Yeah. I'm dressing up in her cooking, sir. That's it. That's your goon or whatever. So you don't do, then you can pick her.'",
        "'speaker_0': 'Yeah, I think. I think it's not appropriate to call people names, but please address me.'",
        "'speaker_1': 'I all the names. I said you're good.'",
        "'speaker_0': 'You can direct direct your comments towards me.'",
        "'speaker_1': 'Well, no, I don't like nothing. You do. And I think you're a bad mayor. I think you're a socialist. I think you like Fidel Castro because you took money from conservatives that I know. And then you flipped and went straight socialist.'",
        "'speaker_1': 'So you need to be strong for Americans and start trying to say, look, I care where your family came from. You're an American. Now, act like it. That's what you need to do. No. As far as, hey, you know, why are you still here?'",
        "'speaker_1': 'You need to be worshiping Karl Marx somewhere. You need to get them out of here. And then somebody else had that. See, now, hey, I like your program at the park, Mr. Andrews. I'm helping, you know everything. But stop voting this way so soon you can have his job.'",
        "'speaker_1': 'You be better than him. So anyway, Miss Mongo, you look good in them dresses as well. That save you as far as I've been. You got to.'",
        "'speaker_5': 'Go.'",
        "'speaker_1': 'You get your stuff, right? You still represent Americans. That's all I got to say to you. Stay out of my face, Case. Don't be intimidated. Nobody else, man.'",
        "'speaker_0': 'Thank you, sir. Any other public comment on this item, Mr. Good? Him?'",
        "'speaker_1': 'Very good, Hugh. This is the third.'",
        "'speaker_0': 'Time this evening, I believe, that we've heard the word and an emergency exist. And that goes to the issue of why I believe it makes sense to put a freeze on all.'",
        "'speaker_5': 'Of your traveling period.'",
        "'speaker_0': 'Again, if you want to.'",
        "'speaker_5': 'Further your political.'",
        "'speaker_0': 'Career by traveling all over you, do that on your own expense, not on the taxpayers dime until such time as we do, do not have an agenda.'",
        "'speaker_5': 'That has real world emergency.'",
        "'speaker_1': 'On it. Thank you.'",
        "'speaker_0': 'Q Sir, we're going to go out. Please calm down. And this is on item 1.3.'",
        "'speaker_3': 'Yes. And it's a better time than when I had sent in a speaker card. So thank you. And I wanted to thank Councilmember Richardson, Pearce and Gonzalez. My name is Jessica Sullens. I'm a summer intern with Food and Water Watch.'",
        "'speaker_3': 'And I wanted to speak to the California Water Fix and thank you to your offices for meeting with us already. We really appreciate it.'",
        "'speaker_4': 'So if you want to watch as a national nonprofit consumer watchdog.'",
        "'speaker_3': 'We take no dollars from corporations and the government allowing us to stay accountable to public interests. Food and Water Watch made a public records request, which revealed that 6.6% in total of its residential customers of Long Beach water had their water shut off in the last two years.'",
        "'speaker_3': 'And while Long Beach has done a really great job in water conservation, it also needs to continue making the best investments. Which means this Council should take a strong stance in opposition to the proposed 17 to $70 billion Delta Tunnel project.'",
        "'speaker_4': 'Metropolitan is geared to vote on the tunnels on the 26th of this month. Food and Water Watch looks forward to formally presenting our concerns to this Council on behalf of Long Beach.'",
        "'speaker_3': 'Constituents who will.'",
        "'speaker_4': 'See no new additional water from this project yet will have their water rates.'",
        "'speaker_3': 'Drastically increased.'",
        "'speaker_4': 'This month. Food and Water Watch is slated to give presentations to Pasadena, Burbank, Glendale.'",
        "'speaker_3': 'Compton and L.A. City in addition to Santa Ana, San Fernando and other agency municipalities on the Metropolitan Water Board.'",
        "'speaker_4': 'So we look forward to including.'",
        "'speaker_3': 'Long Beach in that calendar of events and we will also see everyone on the 14th. You know, the public really doesn't know a lot about this project. I just tried to Google that, the press release that he mentioned prior about the 14th meeting and I didn't find anything online, so hopefully that'll be out well three days prior'",
        "'speaker_3': 'to. But the public really.'",
        "'speaker_4': 'Doesn't know anything and really deserves to know since it will affect.'",
        "'speaker_3': 'Their dollars. Thank you for your time.'",
        "'speaker_0': 'Thank you. There's a motion in the second member. Please go and cast your votes.'"
    ],
    "FY 18 Budget for the Long Beach Community Investment Company.": [
        "'speaker_2': 'Councilman Andrews. Motion carries.'",
        "'speaker_4': '1.7 recommendation to adopt a motion to prevent fiscal year 18 budget for the Long Beach Community Investment Company formerly known as the Lumbini Housing and Development Company, in the amount of $3,324,867. Eight seven. Any member of the public wished to make a comment on this item.'",
        "'speaker_4': 'Please come forward. Are you coming down, sir?'",
        "'speaker_1': 'Very good. Can I go down? Those bad guy. Okay. Well, one thing hit me on this. So they get my sign, right?'",
        "'speaker_5': 'Okay, whatever.'",
        "'speaker_1': 'Okay. One thing hit me on this. Soon as I get my life to one. Okay? Yeah. Okay. One thing that hit me on this that came to my mind is it says Long Beach, housing, development, community development, housing, development, housing.'",
        "'speaker_1': 'Because you're pushing for rent control and rent control is going to bring housing down. So that seems like a deception here. Just cause eviction, you can't get dope dealers out. You can't get molesters out of this communist agenda.'",
        "'speaker_1': 'And it's just bad for the people, period, is bad for the property owners. And that's the only thing that people know when they talk. And I mean, you're in the wrong you need to look. They taught me that when I was young.'",
        "'speaker_1': 'Look at people. Respect them. So the thing is, there's no Long Beach house and I don't even know how to spell. But they read me wrong just because of the things you doing. Said one of them to. Yeah, well, you talk.'",
        "'speaker_1': 'And you and this Karl Marx, you're the one that needs to be listening. Oh, stepping down. Come on. At least try to do your job that's eating up there and everything. So, you know. Oh, I don't even have enough to say.'",
        "'speaker_1': 'I'm really keen to get here. Get on your case, because I wish you would quit. That's what I wish you would really do. You're not a good mayor. You're socialist. You felt like you were a conservative. Whatever. You got people's money.'",
        "'speaker_1': 'The same thing Fidel Castro did. He took American, sir. So you see what? Yes.'",
        "'speaker_4': 'You were really kind. In the meeting at this time, that's not really pertinent to the item at hand, so it would make sense.'",
        "'speaker_1': 'To do it this way. I talked about a Long Beach housing development and a big development like that because, you know, rent control lowers housing, lessens housing. So that's what I'm talking about. And with that, I'm sorry to have to say about him.'",
        "'speaker_1': 'So why are you trying to talk about my seconds up? I like this guy. He needs to be out of here. I want to see him, Senator. Definitely want this to be the end of the road for you.'",
        "'speaker_1': 'Just like this. That Bill is the man at the end of the road. No more. No fouling lava, no foul on motel three, though. Go back to wherever. And by the way, you're the highest paid man in the land.'",
        "'speaker_1': 'Why you get so much money? You're a money man. That's what it seems like to me. So I'm through. Yeah, yeah, yeah, yeah, yeah. So you're sucking money out of this town. Make it for the people. Stop doing what you're doing.'",
        "'speaker_1': 'Let me put this back on me so you could see me telling you. Yeah, that's what I said. I ain't got no good lighting here. We got to get rid of this mayor. He's no good. That's what I have to say.'",
        "'speaker_1': 'Oh, man. Okay.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Say no more public comment. Please cast your votes. The motion case will next move to item 1.8 recommendation to adopt a motion approving the estimated transfer of $18,661,550 from the Harbor Revenue Fund to the Tidelands Operation Fund.'"
    ],
    "Approval of Financial Policies Recommended by the Budget Oversight Committee.": [
        "'speaker_4': 'See none. Members. Cast your vote. Motion carries. At a 1.10 recommendation to adopt a motion approving the financial policies as adopted by the Budget Oversight Committee. Earlier this evening, September 5th, 2017. Any member of the public wish to approach the Council on this item?'",
        "'speaker_4': 'See none. Members. Cast your vote. Oh. Oh. So this is in regards to this. No. Okay. Go for it. Actually, fiscal policies. Just the fiscal policies. Okay. This was just.'",
        "'speaker_3': 'Because of this one.'",
        "'speaker_4': 'We actually discussed that several weeks ago, a budget oversight committee and provided it via memo for any council member. A few weeks ago, a councilmember price.'",
        "'speaker_3': 'And this is with the understanding that or approving the fiscal policies except as to the grants. Correct. Which will come back at a later time.'",
        "'speaker_4': 'It'll return to the DRC.'",
        "'speaker_3': 'Okay, great.'",
        "'speaker_4': 'Any member of the public wish to approach the Council on this item? Seamen Members Cast your vote.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Mandatory General Fund Budget Saving Targets and Mid-Year Progress Report.": [
        "'speaker_4': 'And the next out of turn, we're going to take item 23. Click we read the item. Sure. It's long. I can try.'",
        "'speaker_2': 'Communication from Councilwoman Mongo and Vice Mayor Richardson. Recommendation to direct the city manager to implement mandatory general fund budget saving saving targets for fiscal year 2018 and direct city manager to work with the Department of Financial Management to provide a mid-year progress report.'",
        "'speaker_4': 'So I want to thank the community for the overwhelming support and feedback that this Council is doing a fiscally appropriate job in setting out goals and targets so that we can fend off the currently anticipated shortfalls in the next fiscal year.'",
        "'speaker_4': 'We want realistic opportunities for savings, and we look forward to working hand in hand with our department partners to ensure that the future ahead is bright and that no city services will be cut in the future fiscal years.'",
        "'speaker_4': 'Because we know that those are the kinds of services that our quality of life is dependent on. Vice Chair. Vice Mayor.'",
        "'speaker_5': 'Thank you, Councilmember. And I second this motion strongly. I think we all know we've seen the three projections that we may have to make some difficult decisions in the years to come. You know, having worked in the city through some very difficult budget years, I remember those those were tough choices.'",
        "'speaker_5': 'And so as we, you know, adopt a budget tonight, I think we immediately look to the future by identifying ways to sort of balance our budget next year and diminish limit the impact of the programs that are important to all of us by starting to identify those efficiencies today.'",
        "'speaker_5': 'You know, this is a tool. I think this is a smart tool. So thank you, Councilwoman Mongeau, and all the budget staff and city manager staff that have advised our advisors through this conversation. The budget savings target is a great tool to start.'",
        "'speaker_5': 'You know, with the carrot approach, you get to set a target, keep that money in your budget, but try to find ways where you can spend a little bit less without major impacts to staff or major impacts the program to where in a year from now.'",
        "'speaker_5': 'When we come back, the homework has been done. So we're taking the problem of stretching over a year and figuring it out over a year's time, because we know that this budget conversation, it comes up on it pretty quick every year.'",
        "'speaker_5': 'So it has my strong support. I encourage the city council and city staff to really embrace this and build support. Thank you.'",
        "'speaker_4': 'I actually have had some dialog with some of our department heads already and they did targets even this year and created some scenarios before we knew where we were. And so some of them are already a year down a path and hopefully halfway to the new goal.'",
        "'speaker_4': 'So we like to set ambitious goals so that we can achieve them. So I urge my colleagues to support this item.'",
        "'speaker_6': 'Public comment.'",
        "'speaker_4': 'Oh, public comment on this item. See CNN.'",
        "'speaker_1': 'She? I was saying this time I got a public comment on the part that he moved without eliminating jobs or programs. Well, as a black man in Long Beach, too many jobs for black folks. Everywhere I look, black folks sitting around doing nothing.'",
        "'speaker_1': 'But everywhere I see you can almost look at it. You can't always tell who's illegal and who's not. But everybody who has a job seems to be Hispanic. Is that your doing, mayor? I'm pretty sure he didn't do it, so I didn't do it.'",
        "'speaker_1': 'So the thing is, is what I'm here to ask you as mayor is when are you going to try to help black folks out? When are you going to do it? Yes. Rhetorical. Because I really don't think you're trying to do it.'",
        "'speaker_1': 'You know, so I'm here to represent that. Help us, Mr. Mayor, because you go about Section eight office. Look right across this all over. When you walk right out here, when you walk right out here, they're laying right by the library.'",
        "'speaker_1': 'You got those? You passed $225 million bills. I went with my camera asking and nobody heard nothing. They couldn't get in shelters. Right. So I don't know where the hell that money's going to. So you got the we fought a civil rights movement.'",
        "'speaker_1': 'We came over as slaves and we ain't got work. We came here to work and we ain't got work. This ain't the white man's fault. You talk about the gentrification, all the little groups that you find in everything.'",
        "'speaker_1': 'This is your fault. You're the mayor. The white people seem to be on Main Street with cops. They got a problem, just like the black people. But that's your problem. I just did a thing over of Chair in the Alamo, and there was a three foot dam high.'",
        "'speaker_1': 'There's so much. This place is starting to look like what? This place is looking like. What? You got people up and down. Cherry Guy Cab. You can't even be a citizen. He's selling watermelons. Ever since. I've been living here for four and a half years, and everybody got to see him.'",
        "'speaker_1': 'But let me get my ass out there with a barbecue pit. See if I can stay out there for two days. Get out of here. So maybe I should start selling barbeque fried chicken and potato salad out there and see, you know, see if you protect me.'",
        "'speaker_1': 'I know you've had to pass it. So what I'm saying is I'm asking you to make sure there's some justice. Justice? You see something legal? You drive around this place, you see this ghetto that you make. And I never heard of a Republican get all my life.'",
        "'speaker_1': 'And I say these Republicans, we have a PR angle, miss. No names start voting like Republicans and act like Republicans because well, we call them as rhinos when you vote like that. You vote everywhere with a Democrat and a liberal.'",
        "'speaker_1': 'First of all, Democrats have nothing for black folks in Iowa. How many years away? I'm just saying, change your ways as far as brothers. Start helping brothers and Republicans start acting like you and Janine Pearce leave town or something.'",
        "'speaker_1': 'That's what you need to do and change your ways. Do something for somebody else. Thank you for your time.'"
    ],
    "Budget Oversight Committee's Funding Recommendations for FY 18.": [
        "'speaker_4': 'Senior Fellow Public Comment. Members cast your vote. Motion carries item 1.1 to recommendation to adopt the budget oversight committees proposed funding recommendations as amended to the fiscal year 18 proposed budget. And I will read those now. So as mentioned, Budget Oversight Committee, the budget process has changed considerably over the last several years.'",
        "'speaker_4': 'There was a time in many members recent memory that there wasn't even a budget oversight committee, and so the budget appeared and the council would pass it. I want to thank my committee. We took a great amount of time to start off our year with some thoughtfulness around fiscal policies that every few years we need to visit'",
        "'speaker_4': 'those and ensure that we are ensuring that the policies of this Council and the committee of this Council, as passed a few moments ago, represent our priorities. And so I think that that started with a great tone. I think we had healthy dialog throughout the process.'",
        "'speaker_4': 'It's difficult to do in a year where we know that we're tightening the belt, and so most of our allocations this year are one time. And so I appreciate that community who came out to council meetings, to budget oversight committee meetings, to individual budget meetings in each of our districts, and then also to approached us wherever we'",
        "'speaker_4': 'are, where we work in play, whether we were at concert in the park or in line at ground bakery, people had questions and they were excited to ask them. And I think that that says a lot about my colleagues, that we are approachable and open to answering those questions because we actually study the materials presented to us'",
        "'speaker_4': 'by the city staff and that they put countless hours into to make sure that we have the information necessary to make the tough choices. So here are our proposed tough choices. Motion to use 700,000 and general fund one time funding, including 300,000 from fiscal year weapons funds, year end funds available, and 400,000 from expected election cost savings'",
        "'speaker_4': '. This funding to be appropriated for the following one time purposes. 454 Business Corridor Improvements in order to spur, enhance sales and revenue for the city in the following three business corridors at 150,000 each Pacific. Anaheim in Carson 100,000 and Health and Human Services Department to support My Brother's Keeper and limitation of 10,000 in the Health and Human'",
        "'speaker_4': 'Services Department to leverage grant funding and fund community health programs, furthering the 125 and ongoing funding for the 125. An ongoing funding from Proactive Homeless Initiative can also be used to support the community health programs in addition to the homeless rapid response activities.'",
        "'speaker_4': '50,000 in Parks, Recreation and Marine Department to address the results of the City Auditor's Animal Care Services audit findings with a goal of increasing adoption rates for the city of Long Beach Ocean to use special advertising and promotion funds revenues in order to show that again motion to use as AP funds, special advertising and promotion funds to'",
        "'speaker_4': 'appropriate 114,000 and ongoing funds in Parks, Recreation and Marine Department for the following purposes 54,000 to support nine community concerts, one in each district similar to those outlined in the two from four 20,000 to leverage matching funds for dealers, supporters and event 20,000 to leverage matching funds for Jazz Festival Annual Event 20,000 as supplemental matching funds for'",
        "'speaker_4': 'additional community concerts throughout the city. The entire plan for community concerts should be revisited annually based on equity and return on investment for a proposal and consideration of the Budget Oversight Committee, including, but not limited to leveraged funds, attendance, etc..'",
        "'speaker_4': 'Motion for first contingent appropriation of fiscal year 17 General Fund one time year end surplus in amount of 750,000. Subject of funding availability for capital infrastructure. Existing city programing to be divided equally between the city council districts for district priorities.'",
        "'speaker_4': 'Any exception must go to the Council for review and approval motion for contingent appropriation for fiscal year 17 time one time year in surplus in the amount of 1 million subject to funding availability in the Public Works Department for one time improvements to the Convention Center, which will free up 1 million in measure funds.'",
        "'speaker_4': 'Motion for contingent appropriation of the 1 million in measure funds is freed up based on the contingent appropriation aforementioned in the Public Works Department for Sidewalks, Sidewalk Repair Replacement Rapid Response Program on a go forward basis. The city shall make city wide investments in streets and sidewalks based on need at any additional fiscal year.'",
        "'speaker_4': '17 year and surplus in the general fund should be set aside for the fund to fund the city's critical one time needs for fiscal year 19. Again, looking forward subject to the Budget Oversight Committee review and recommendation motion that the city staff return to the Budget Oversight Committee with recommendations to allocate any additional fiscal year 17 table'",
        "'speaker_4': 'fund one time year in surplus above the million in a manner that is fair and balanced and consistent. With the reprioritisation criteria established by City Council in 2015. Oh.'",
        "'speaker_0': 'Have the question for you.'",
        "'speaker_4': 'I guess I did not make the motion. I thought I did make of the motion. Mr. AGAGU Maybe they did a second part of the motion. Councilman Austin.'",
        "'speaker_5': 'Oh, thank you. And thank you for the.'",
        "'speaker_6': 'Very detailed rundown of.'",
        "'speaker_1': 'The Budget Oversight Committees recommendation.'",
        "'speaker_6': 'Second, in this motion, as a member of the Budget Oversight Committee. I also want to commend my colleagues on the committee, Chair Price and Chair Mungo and Vice Chair Price for their due diligence and patience and.'",
        "'speaker_5': 'You know, really working to.'",
        "'speaker_6': 'Collaborate with all of the city departments and other federal council members to get to this point. We know that as a vice mayor, Richardson would say winter is coming, and so we need to be prepared for it. And I think this budget recognizes that.'",
        "'speaker_6': 'But it's also one that is responsible and balanced and that.'",
        "'speaker_1': 'Meets the needs of.'",
        "'speaker_6': 'Services that we try to all of our constituents depend on. So I'll be supporting this motion.'",
        "'speaker_4': 'Thank you. Member Price Pierce. Thank you, Councilmember Pierce.'",
        "'speaker_3': 'Still a.'",
        "'speaker_4': 'Year. We still get confused, huh? I want to thank the BRC for all of their effort and the work that you guys have done. I think as a city we've talked a lot about equity and that shows through the commitment that we've made to our health department around community health programs, around My Brother's Keeper, and also the'",
        "'speaker_4': 'work around our homeless community, which I think is really important. I wanted to to clarify a couple of things and and ask a couple of questions for our homeless conversation. Can you address for me? Well, let me let me clarify this for the heart team.'",
        "'speaker_4': 'I know that Councilmember Price, it was a conversation that you brought up. And so I would like to know, where are we having conversations outside of the budget around that? I know I've I've met with our county supervisors and we're having some of those conversations about how can we find dollars to make sure that we make this'",
        "'speaker_4': 'heart team the strongest team that it can be. And so is there a plan already from the BOC on a next step for that? So the first step is that this budget includes structural funding for the heart team, which is the first time, and that's as a large one, large commitment.'",
        "'speaker_4': 'It also includes the one time costs associated with the vehicle and other components of the heart team. Additionally, it asks that the Finance Department bring back some information to Budget Oversight Committee for consideration so that we'll be in a better place to discuss that a few months from now.'",
        "'speaker_4': 'Great. Thank you for that. And on the conversation around the other funds, one time you said around the convention center. I just want to you know, I think that our convention center, the numbers I have is $300 million in economic impact in our city, that this is something that generates a lot of revenue for our city, and'",
        "'speaker_4': 'that any time we have a conversation around Tidelands, that we really need to make sure that we're being careful about having those conversations with the two council members that take over or that that governance in that area. I think that this is smart and I support this because we should be using Tidelands funds where available on our'",
        "'speaker_4': 'convention center and freeing up $1,000,000 for Measure A to go back into infrastructure I think is smart. Where I'd like to make a friendly is you have on here that it just goes to sidewalk replacement and I've heard the comments for that and that on the back it says that moving forward the city would make citywide investments'",
        "'speaker_4': 'on streets, alleyways and sidewalks based on need. I would only feel comfortable with freeing up those measure $8 if this is based on need, whether that's if it's sidewalks, if it's alleyways. But I think we need to give that discretion to those that have worked on the measure plan for a long time.'",
        "'speaker_4': 'So let me also you're not the only one to ask that question. So we have already committed to a certain set of maps and that set of maps. We want to continue that commitment. They've been presented at this council, whether it was for measure or whether it was for a measure and whatever it was, maps have been'",
        "'speaker_4': 'seen by the community and the public, and we don't want to ever put ourselves in a position where we promise something and then take it back. So that is why there's that there will be wording in there to ensure that the maps that have been seen are protected on a go forward basis.'",
        "'speaker_4': 'The city shall make citywide investments in streets, alleys and sidewalks based on need. That really speaks to funding that has not yet become available and will become available in the future. With regard to the sidewalks, the rapid response program for Sidewalks is to fund programs on a as needed basis for repairs that are a safety issue.'",
        "'speaker_4': 'And there are currently there used to be $9 million over the three year period that were available for allocations. There are considerable number of sidewalks within the community that have not been repaired and so they have an extensive list.'",
        "'speaker_4': 'I believe that the city staff will need to come back to us with a two from for on the specifics of what that would look like. ERICKSON Did you want to comment on that? Yes, Chairman, go. Traditionally, the city staff does return to city council with a timeframe for explaining how we plan to implement the city council'",
        "'speaker_4': 'approved changes, and we would do so in this in this regard as well. I hear your your concern. I guess my concern is I'm taking $1,000,000 out of the convention center, you know, taking that millions of dollars that was allocated to the convention center to free that up for city wide use for the measure.'",
        "'speaker_4': 'A The priority in my district, I don't want to set a priority for the city. That's why I would rather give it to city staff to say is is sidewalks a priority or is the dirt alleyways a priority?'",
        "'speaker_4': 'So alleys under this plan would be prioritized. I guess the way it reads on the front pages, it says sidewalk replacement. So if we could make a friendly to say so this as a. Are a part of motion, a component of what I mentioned.'",
        "'speaker_4': 'And all alleys would be paved with the $5 million in allocation that are outlaid. So all the alleyways would be paved with the 5 million. That's just a checklist stuff. I have another document on the that. Hold on.'",
        "'speaker_4': 'Just because I got some really bad alleyways, guys. Okay. I just wanted to make sure that I guess what my point chair is just making sure that we're not saying that sidewalks are a priority for one councilmember. Therefore, we're taking that money and putting this is city wide.'",
        "'speaker_4': 'And specifically here it is. This is city wide. And if I wanted it, there were some recommendations that we move this money into park bathrooms. But if anyone looked at the park bathroom list, the next three park bathrooms on the list are all mine.'",
        "'speaker_4': 'And I was trying to be equitable as chair and ensure that all citywide priorities are managed. I want to fight for my district and city wide and make sure that when we're doing that, we're doing it equitably. And so that's why sidewalks were chosen.'",
        "'speaker_4': 'This council had to make a very tough decision several months ago in light of a lawsuit that drained all of our sidewalk funding for the whole city for three years. And so that was something that I made a commitment to back then, that I would go out and work hard to find some supplemental funding.'",
        "'speaker_4': 'It's no $9 million, but it's a small step for those that have been on less waiting for sidewalks for six and seven years. And so it is a safety concern and I wouldn't put a non safety concern over a safety concern.'",
        "'speaker_4': 'So I appreciate that. You know, that's that's fine. I mean, as long as it's included in there, where it's driven on what we've already said as a priority and that support that was important for me. And then moving forward that those conversations around if additional funds come up.'",
        "'speaker_4': 'I think Councilmember Price's suggestion at the BMC is one that I support and making sure that the two of us are having these conversations around the Tidelands funds moving forward. I think the other statement that I wanted to make is I think that it's exciting to see our city as a whole looking at community concerts in the'",
        "'speaker_4': 'eyes of economic development. We are excited out of our office, have worked on a couple of the entertainment items with city staff. So I would hope that outside of just working with the body on these items, that we're also including our economic development team because we will be coming back soon with some recommendations and how we talk'",
        "'speaker_4': 'about entertainment as a whole. And I would want this to be separate from that when I feel like there's likely some dollars that we can use out of that outcome.'",
        "'speaker_3': 'To support.'",
        "'speaker_4': 'Entertainment as a whole in our city moving forward. So noted.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Great job on a budget, guys. Councilmember Gonzalez.'",
        "'speaker_3': 'Yes. I want to thank you as well. I know I definitely do not envy you. You get a lot of requests. And so I just want to thank the effort from the Budget Oversight Committee for putting together what I think is a really great plan.'",
        "'speaker_3': 'And so thank each and every one of you as well as our city staff. I may I make them every year we conduct an English budget meeting and we conduct a Spanish one. So we have to.'",
        "'speaker_4': 'You know, look at all of our.'",
        "'speaker_3': 'Spanish language and make sure it's translated correctly. And it's really tough, let me tell you. So I want to thank staff for just being available to our residents in the first District for that. I appreciate it. Just a couple quick questions.'",
        "'speaker_3': 'I know.'",
        "'speaker_4': 'The business core.'",
        "'speaker_3': 'Corridor improvements, which will be divided evenly among Pacific, Anaheim and Carson. That looks to be about $150,000 each. Are we because that doesn't stretch far, but are we looking at additional funds on top of that? I know.'",
        "'speaker_4': 'So some of it's actually gap funding. So some of the corridors when discussing economic development opportunities. The first thing I always sit down and talk about is what can we do to increase revenues? Because if we can increase revenues, we don't have to cut costs and especially revenues in areas where we have visitors ship and likes.'",
        "'speaker_4': 'So the original intent was to take a SIP funds and hopefully use them in some corridors that we thought we could activate for visitors. It didn't end up working out that way, so we ended up finding this other opportunity in working with the Economic Development Department head.'",
        "'speaker_4': 'There are some corridors that already have funding, but there's gaps between major areas. And so to make a contiguous look and feel and to amplify the effectiveness of the money that's already been spent. Some of these are the adjacent, so every one of these has something adjacent to it that's already exciting and funded, and that's how these'",
        "'speaker_4': 'were funded.'",
        "'speaker_3': 'Great. Thank you very much. And I look forward to that. I'll also say as well, the community concerts, which I know have been a big priority in my area, but I appreciate them certainly, and making sure that we are looking at the whole city.'",
        "'speaker_3': 'And so I really appreciate the efforts there. And then I want to make sure with that that this is an ongoing use. So it will be structural.'",
        "'speaker_4': 'Correct. So what we did is we put in the plan that the community concerts as a whole would be revisited, because a component of this is that this year the mini band is funded. And perhaps looking at what that looks like and putting all the numbers together are really going to be able to provide a bigger, broader'",
        "'speaker_4': 'picture for consideration. I know that this dialog started late in the year and so we want to ensure that the city staff work to ensure all of these are successful and then bring back the areas for improvement in case additional funding is needed in certain gaps as we go forward.'",
        "'speaker_4': 'Because what we set up was matching funds. So theoretically, every council district could submit that they wanted to fund and then it would be matched. But that is unlikely to be the case. And so when we look at that, we'll know better.'",
        "'speaker_4': 'So this is a test pilot on the fourth component of that, which was the supplemental matching.'",
        "'speaker_3': 'Okay, so we'll rereview, but hopefully they're all successful like UPS in and then we'll go from there.'",
        "'speaker_4': 'And some of them are already independently successful without the funding. And the challenge is that they would be even more successful if the community didn't have to spend as much time fundraising and could spend more time advertising and getting out the word and bringing people in.'",
        "'speaker_3': 'I couldn't agree with you more on that one. So thank you. Perfect. And then the last the last question or basically comment that I have is similar to Councilmember Pearce with the sidewalks and alleys. So I'm just wondering in terms of I wasn't really clear as to how that was going to be.'",
        "'speaker_4': 'So there's two different items in there. There's two different sub motions and the master motion, the one related to on a go forward basis, the city shall make citywide investments in streets, alleys and sidewalks based on need. According to my dialog with Mr. Beck, that would mean that the $5 million that we as a council have set'",
        "'speaker_4': 'aside for alleys would first and foremost go to need based turning our dirt alleys into paved alleys. Okay. I think that was in alignment with your comments at a prior council meeting. Right.'",
        "'speaker_3': 'And you're saying we expended, of course, our the ADA lawsuit that happened that was expended. So this is so the convention center, just so I'm getting it clear in my head, will be used for sidewalks based on need priority as well as all of our other streets alleys which are already in the process.'",
        "'speaker_3': 'Okay. Just want to make sure I'm clear on that. That is it. Thank you very much. I appreciate it.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'But let me let me add to one one piece of matches to be very clear for for staff as well.'",
        "'speaker_4': 'And I know I while you were gone, but go ahead.'",
        "'speaker_0': 'Okay. And Councilwoman, go. I want to mention this, but I just I know I was asked by staff to clarify all of the maps that were already presented, both the measure maps, as well as the Capital Street Map overlay that this council saw about a month ago or so at the at the.'",
        "'speaker_0': 'All of that is already locked in. And this is for additional streets or sidewalks in this case beyond that, correct? Yes. Okay. Thank you.'",
        "'speaker_4': 'Councilman Price.'",
        "'speaker_3': 'Thank you. I just wanted to echo a comment made by Council member Pearce regarding the Hart teams. I think having Hart teams in every battalion in the city would serve the city very well. Our council colleagues were not privy to the presentation that was made earlier today regarding the budget survey, but we had 485 surveys submitted as'",
        "'speaker_3': 'of yesterday, and among the top priorities for the residents who completed the survey are public safety concerns, response to homelessness, issues that are presented by transient activity. And I think the Hart team can really go a long way for us in terms of identifying opportunities to get people into long term services and care.'",
        "'speaker_3': 'And so one of the issues that I had raised at BMC, I think it's something that will come back for us to consider, is really evaluating what funding opportunities may be available for Hart teams. There was mention of of possible money from the county coming that that I'm not personally aware of.'",
        "'speaker_3': 'But I do know that the first responder fee is is performing better than projected. And it would be my intention as we move forward and continue to look at that source of funding to put that money back into the fire department, to have more Hart teams servicing the entire city so that each district has a Hart Team'",
        "'speaker_3': 'presence, so that these individuals with our fire department have the opportunity to build the relationships with folks who are homeless and build that credibility that's necessary to get them into long term sustainable programs so that they can make long term life changes.'",
        "'speaker_3': 'I think I think there's a lot of opportunity there for us to see meaningful change and. So I'm just putting that out there. I know it's not one of the recommendations. I wish it were, but I realize that it's not yet.'",
        "'speaker_3': 'And I hope that my colleagues will consider how we can find more moneys to fund additional heart teams for the entire city. So thank you.'",
        "'speaker_4': 'Vice Mayor Richardson.'",
        "'speaker_5': 'Thank you, Chair Mungo. I wanted to chime in and just say what a what a wonderful job. You and both members, Austin and Pryce, on the Budget Oversight Committee did on making sure that there's you know, you take in consideration, you know, the city manager's budget, the mayor's budget recommendations, and now I see a whole bunch of'",
        "'speaker_5': 'council recommendations here. So I see a real intentional effort to really build a bridge, really build consensus. And I want to just acknowledge that. So. So good job. I do want to say, you know, we want to maintain our focus, you know, over the course of the next year on what we can do around things like expanding'",
        "'speaker_5': 'our our fire academy and expanding the Hart team. And so as revenues or fees are adjusted and we look at those things as a.'",
        "'speaker_6': 'Conversation, I'm.'",
        "'speaker_5': 'Certainly looking forward to having once we once we conclude this. But again, thank you to all the members of the council. This this recommendation, I think, is very balanced and has my full support.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Thank you. Any member of the public wish to comment on the proposed motion?'",
        "'speaker_5': 'I fully support any moneys that can.'",
        "'speaker_0': 'Be put into concerts that I would also like to see some money put into some opera. APRA and I hadn't heard that word all evening. What if we have to find some money? Put it into get three or four opera productions.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Honorable mayor and council members. Thank you for helping me out today.'",
        "'speaker_4': 'I'm Janet Powell, small.'",
        "'speaker_3': 'Business owner and Long Beach animal advocate. I'm here today.'",
        "'speaker_4': 'Because I partner.'",
        "'speaker_3': 'With and support several incredible Long Beach based nonprofit volunteer run animal rescues. I believe Emily Gosh has already spoken with several of you about our comprehensive report and the programs and staff support we're asking for for Long Beach Animal Services.'",
        "'speaker_3': 'Thank you for earmarking $50,000, which is a great start, but it cannot be won and done. We must look long term.'",
        "'speaker_4': 'Allow me to pose.'",
        "'speaker_3': 'Two questions and I'm willing to bet you don't hear them very often here. First question What can we do to bring more money to the Long Beach economy nationwide? The industry has grown by $2 billion every year for the last ten years, and it's already at $69 billion this year.'",
        "'speaker_3': 'How much of that is being spent in Long Beach? How much of it is growing in Long Beach? If we implement better adoption, facilitation and educational programs at the animal shelter that directly results in economic benefits, more adoptions and more responsible pet owners.'",
        "'speaker_3': 'I mean, more money being spent at the hundreds of businesses in this city that specialize in vet care, pet supplies, pet grooming and setting services.'",
        "'speaker_4': 'This is a significant market with a lot of room for revenue growth. On average, a pet owner will spend $1,000 per.'",
        "'speaker_3': 'Pet per year. 15 years means up to $15 million additional spending coming into the Long Beach economy. If we just get 1000 more residents to adopt, more spending means more sales tax dollars cumulatively, far more than what we're asking for to get these improvements started.'",
        "'speaker_3': 'Second question how can we help the city of Long Beach save money? Better spay neuter enforcement services and educational programs mean fewer unfixed animals dumped onto the street, which creates.'",
        "'speaker_4': 'Even more.'",
        "'speaker_3': 'Homeless, ill and dying animals.'",
        "'speaker_4': 'Already, their presence.'",
        "'speaker_3': 'Is lowering property values, and that means fewer property tax dollars coming in year after year. Unless you empower us to implement flood gates and might not significant savings be made if animal behavior educational programs help to prevent potential lawsuits against the city?'",
        "'speaker_3': 'Why wait until a police officer shoots a pet dog based on a misreading of its behavior? Just last year, the City of San Diego was sued for.'",
        "'speaker_4': 'A half million dollars because their dog was shot by a.'",
        "'speaker_3': 'Police officer who came onto their property and reacted too quickly out of fear. The dog bled slowly to death for 2 hours while the police officer failed to respond to the family's pleas to get immediate help. Also last year, two cities in Colorado and Michigan have already paid out over $360,000 combined to two families whose dogs were'",
        "'speaker_3': 'shot by police officers. Why wait until something like that happens in Long Beach? Education is the key to prevention. Help us make a meaningful, tangible, long term difference in animal rescue. And we will be your champions. This can be your legacy to your family and to your community.'",
        "'speaker_3': 'Long Beach Animal Advocates Members. Please stand up.'",
        "'speaker_4': 'Thank you. Thank you.'",
        "'speaker_3': 'Well done, Janet. Mr. Mayor. Council members. Good evening.'",
        "'speaker_1': 'Of course.'",
        "'speaker_3': 'Also. Thank you. My name is O'Reilly. Vander Hook and I have been a proud member of the Long Beach community since 2001 and an even prouder member of the rescue.'",
        "'speaker_4': 'Community since.'",
        "'speaker_3': '2012. I am the founder of Zoe's Place Rescue, and I would like to address my concerns over the budget consideration for the Long Beach Animal Services.'",
        "'speaker_4': 'Since I started to get involved in rescue five years ago, it seems that the.'",
        "'speaker_3': 'Shelter's need for help has not decreased. And every year we, the rescue community, feel that we are not making a dent.'",
        "'speaker_4': 'In 2016, Long Beach Animal Services killed 2360 animals.'",
        "'speaker_3': 'Or 22% of its intended.'",
        "'speaker_4': 'Statistics to date. Long Beach Animal Services has already killed.'",
        "'speaker_3': '896 impounded animals, knowing that 500 of.'",
        "'speaker_4': 'Which were cats due to kitten season.'",
        "'speaker_3': 'This is not a 90% live release rate.'",
        "'speaker_4': 'This is a staggering.'",
        "'speaker_3': 'Number that can be prevented if the shelter and the city can issue adequate programs and budgets. It is shocking.'",
        "'speaker_4': 'That adoptions only contribute to the success rates by.'",
        "'speaker_3': '6%. That is not enough. We cannot sit here and pretend these numbers are okay simply because we are lower than the Downey shelter.'",
        "'speaker_4': 'That should not be a.'",
        "'speaker_3': 'Consolation by any means.'",
        "'speaker_4': 'Let's also be clear that without the help of the rescue community, this these numbers would be far higher.'",
        "'speaker_3': 'In 2016, rescue support, 1161 animals from the shelter, or 11% of its intake. And already in 2017.'",
        "'speaker_4': 'We have saved.'",
        "'speaker_3': '1121 lives, or 18% of the intakes rely on us to continue.'",
        "'speaker_4': 'Making those statistics bearable is simply.'",
        "'speaker_3': 'Not fair.'",
        "'speaker_4': 'The rescues are full to the.'",
        "'speaker_3': 'Gills and completely trapped financially.'",
        "'speaker_4': 'As well as.'",
        "'speaker_3': 'Emotionally. The amount of.'",
        "'speaker_4': 'Debts each of us have accumulated just to weather.'",
        "'speaker_3': 'Keep animals from being turned into the shelter or save them from the dreaded red list is simply not sustainable.'",
        "'speaker_4': 'The City of Long Beach should instead look to put pressure for relief.'",
        "'speaker_3': 'On another contracted partner in SPCA with an annual rent of $120 to.'",
        "'speaker_4': 'The city. SPCA should be pulling a lot more from the shelter than the 15%.'",
        "'speaker_3': 'Rate it is currently holding. The Protection for animals.'",
        "'speaker_4': 'Their organization stands for. Good start there.'",
        "'speaker_3': 'Long Beach is an animal friendly city. And I believe we if we empower.'",
        "'speaker_4': 'Their residents.'",
        "'speaker_2': 'And give them the opportunity to rise to the challenge.'",
        "'speaker_3': 'We can come together and do significant change.'",
        "'speaker_5': 'Thank you. Thank you for your time. Next speaker, please.'",
        "'speaker_3': 'Good evening, everyone. Honorable Mayor City Council.'",
        "'speaker_4': 'I would like to give a special.'",
        "'speaker_3': 'Thanks to the BRC for listening to our concerns and making a little bit of wiggle room there. You know, it's encouraging to get $50,000. It's obviously not exactly what we need, but we're encouraged by that and we really do appreciate it.'",
        "'speaker_3': 'So, yes, thank you to the BBC. I can assure you that your attention to this matter means more than to just me and the animal rescue founders. It means a lot to the community members and they are watching what's happening here.'",
        "'speaker_3': 'Our team will wholeheartedly continue our efforts to support the city shelter and the rescues will continue to make our city look good and our mayor look good by keeping those kill rates as low as we possibly can. The shelter team, as I've.'",
        "'speaker_4': 'Said before, are a really dedicated.'",
        "'speaker_3': 'Group of people, and it's our honor to support them in this $50,000 will help us to do that more effectively. Our group are looking forward to the completion of the city.'",
        "'speaker_4': 'Audit at our backs.'",
        "'speaker_3': 'We have full confidence that the audit findings will be accurate, informative and therefore will influence further initiatives to increase funding and implement programs.'",
        "'speaker_4': 'Also allowing us to reach our goal.'",
        "'speaker_3': 'Of a 90% or greater live release rate for shelter pets. Thank you again for your support of shelter animals. I know that we're a unified city of animal lovers, and together we will continue to deepen our efforts and make Long Beach a progressive animal shelter city.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Okay. Robert, repeat once again. Represent Jesus. No organization. But one thing I have on this, I heard somebody mentioned homelessness. Now we had to $25 million. I know it wouldn't last two years. Bills or something, you know, for the homeless.'",
        "'speaker_1': 'Now I'm hearing about homeless in here and then people talking about dogs. I mean, I love dogs. You know, that's cool. But, you know, so many people out in the streets coming from L.A. Fitness on Carson and Terry at night, I would go late to get my workout.'",
        "'speaker_1': 'And as I'm leaving, I go around, I forget what restaurant there is. There's a guy right on the concrete. When it was freezing and I got pneumonia last year, I could see I could see fog coming up. That guy just had a blanket wrapped.'",
        "'speaker_1': 'I mean, the dogs are cool. I want to help that guy. There's so many people out there really hurting, and we need to help the people. Now, all my life, mainly, I seen minorities out there. But now in the last well, since and at Long Beach, I never seen white folks like this out in the middle of'",
        "'speaker_1': 'the street asking for money. We have an epidemic. We got white folks have same problem black folks do. We got to get together and stop just catering to the outside. And I mean, dogs are cool, but hey, we got to take care of people for dogs.'",
        "'speaker_1': 'We got too many people out there that messed up off of meth. Heroin. And this is serious, you know? Oh, I hear all the stuff talk what I heard, I see what has been passed for this money being passed everywhere.'",
        "'speaker_1': 'But we got to do something about it. So I'ma say I'm I'm not going to spend too much time on this, but let's do some. America for Americans is help the veterans. Let's help our citizens. And as far as these jobs and all this stuff, listen, I want to see I like to see blacks and whites working'",
        "'speaker_1': 'again everywhere I go. I have nothing against Latinos because I'm not Tino Cubano, you know? But damn, I want to see blacks and whites working. It was a day when blacks and whites had jobs in America. Not anymore.'",
        "'speaker_1': 'Every time I see anything going, I mean city jobs. I said where they only want to do it there nobody else to do it. Not want to see city jobs, want to see counter top jobs. What is the every job?'",
        "'speaker_1': 'It used to be back in the seventies when you got a construction job, you started out at $20. You could buy a house, look at a construction site, see if you could find a see if you could find the right guy in there, a little black guy.'",
        "'speaker_1': 'So 28/2 use. The rest is up. Remember that. Hey, that right? Martin Luther King said we better do black and white together. He said it back in the sixties, black and white today. That's what this nation started. I'm everybody in between to break.'",
        "'speaker_1': 'We're going to have this race war stuff because it ain't no nine, no Nazi KKK. I never been that. I worked Trump on me and I'm Nazi KKK. Fascist. I mean, all fascist meant to it not long ago.'",
        "'speaker_4': 'But thank you.'",
        "'speaker_1': 'Thank you for your time. Please Americans and remember you book.'",
        "'speaker_4': 'Thank you. Next speaker, please. Oh.'",
        "'speaker_5': 'Good evening, our honorable Mary Garcia and council members. My name is Patrick Goddard. I am president and board member of Action Sports Kids Foundation, also known as Ask Long Beach. Tonight, I am here as a private citizen and resident of the fifth District to request $100,000 in next year's budget to be set aside as seed funding for'",
        "'speaker_5': 'skate park improvements, specifically for the Michael K Green Skate Park at Pacific and 14th. After attending a few budget briefings and talking with parks, I believe that seed funding and commitment to this project from the city will help get matching funding from outside.'",
        "'speaker_5': 'Sources will.'",
        "'speaker_6': 'Be able to use this to leverage.'",
        "'speaker_5': 'Funding that I know is out there. The city council and staff have an incredibly difficult job allocating funds and support for an overwhelming amount of needs and interest. I fully recognize this, but I think skate park improvements are very worthy cause and urgent at the time.'",
        "'speaker_5': 'At this time, during last the last week, I visited several of our local skate parks, particularly in the evening hours at Osoba, Robert Gunn, Byner, Eldorado and Michael K Green. These skate park spots were the only amenities in the parks that they were located in to be fully utilized.'",
        "'speaker_5': 'During my visits, there were kids and scooters, adults with skateboards and bikes, all respecting each other, exercising, engaging in healthy activity. And while the basketball courts and other amenities were empty, I know that's anecdotal, but I see this again.'",
        "'speaker_5': 'Again, I just want to drove here past Robert Gunn Byner again. Most of the park is empty, but the skate spot was being fully, fully utilized. Skate parks helped keep our parks activated. And with the talk of parks shuffling funds for afterschool programs, keep in mind that skate parks are, in a sense, outdoor community centers that act'",
        "'speaker_5': 'as areas where youth can recreate, socialize after school. A well-placed, well-built, well-designed, all concrete skate park is a fiscally conservative investment that requires very little maintenance and years of benefits for the community. It's time to improve and build the next chapter of Michael K Green Skate Park, a spot that has already provided benefits, great benefits for well'",
        "'speaker_5': 'over ten years. Thank you for your consideration of $100,000 in seed funding for skate park improvements, and thank you for your time. I'm here with a group of other parents and skaters that are in support of this, including my son Dylan, who skates in.'",
        "'speaker_6': 'Long Beach every day. Thank you.'",
        "'speaker_5': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, counsel. Thank you for your time. My name is Amber Sullivan. I'm a resident in the third district with Councilwoman Pryce. I've lived there for the last 12 years with my son, who is also a skateboarder and as a single mom, having a place for him to go and get actively and be social and be active'",
        "'speaker_4': 'and not sitting in the house saying I'm bored is priceless. He he skate for 8 to 10 hours at a time every week and every Saturday, every Friday through skateboarding. He's had opportunities to travel, to go to Minnesota, to compete to compete in the California state games.'",
        "'speaker_4': 'Having these opportunities available in Long Beach is I can't thank you enough. And so I'm here to show support in getting additional funding to help renovate and improve the Michael K Green Skate Park and the other skate parks within Long Beach.'",
        "'speaker_4': 'Thank you. Thank you. Next speaker, please. Hi. Hi. My name is Nicole Stewart and I live in the third district and I like really like skateboarding. It gives me something to do and there's different skate parks. But personally for me, I don't have a car and there's not a safe way for me to get to a skate'",
        "'speaker_4': 'park. And I feel like we should get a new skate.'",
        "'speaker_3': 'Park that is concrete.'",
        "'speaker_4': 'And have something for the community to do. And it'll be used for things. Think in a speaker, please.'",
        "'speaker_3': 'Hi, my name is Steffie Hans and I'm a resident of the fifth District and I'm also here in support of improving our skate parks, not only the Michael Green Skate Park, which really needs a lot of help, but also a lot of the other skate parks and that it's included in the annual budget.'",
        "'speaker_3': 'My son has Scooter did at the Michael K Green Skate Park when he was eight years old. And I go hang out there when my brother comes into town. He's 40 years old and he still skates that park.'",
        "'speaker_3': 'So I really see the skate parks as something that brings together our community, brings together our kids, brings together the parents that have the kids there. And it's it's an integral part of our community. I was here with McDonald and when he started that first skate park and how tough it was to get that one going.'",
        "'speaker_3': 'And now we have several. And they really do need maintenance. They do have safety issues. And I understand the challenge with that that the director of Parks and Rec has, but we would like them included in future budgets.'",
        "'speaker_3': 'And we appreciate the work that you have done on this budget. I know it has been very difficult and a lot of work has been put into it. So thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'All right. Hi. Thanks. My name is Mike Stewart, resident of the third district. I'll be really brief for as brief as I can be. I just want to reiterate, I'm also here for skate parks. A couple of things that were not mentioned.'",
        "'speaker_5': 'Skating is an Olympic sport. Due tour is awesome. It's brought 30,000 people as an event this year. Due tour is also used for snowboarding for an Olympic trials. It's very likely that the Dew Tour in the future will be used for that here.'",
        "'speaker_5': 'There's it's good visibility. It's good good opportunities. If new skateboard parks and rambling. Excuse me. Long story short, there are a bunch of us that realized recently and it's hard to organize over a long weekend to even show up on a night like this.'",
        "'speaker_5': 'But a lot of us leave the city in order to go take our kids to skate. I attended a meeting last week.'",
        "'speaker_1': 'With with.'",
        "'speaker_5': 'Councilmember Price and brought up the idea of working with developers to help retail retailers suffering. We've got a lot of really interesting retail projects going on in the city. Entertainment is going to be key for the success of retail.'",
        "'speaker_5': 'I'm sure you know this, but there's there's a lot of research out there that suggest if retail is going to survive entertainment, you needed you need a draw. You need a reason for people to go out. So I'll quit.'",
        "'speaker_5': 'I'll quit again. Skate parks. We'd like to see more. And I know I've missed ten things. I urge you strongly. One of the main things, main points that Pat had mentioned earlier is the utilization. It's extremely cheap versus the utilization.'",
        "'speaker_5': 'So it is a conservative investment that lasts for 20 years.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Instead of him into a war zone. The third district again just reiterating proposed funding for specifically the Michael K Green Skatepark. As a professional skateboarder since 98. You know, I've been there many times and the city.'",
        "'speaker_5': 'Has helped shape my career.'",
        "'speaker_6': 'That park is made of prefab material. And it's a it's at this point, it can be kind of dangerous. There's holes. You know, if they were to re-implement that, I don't think it would be that much of a budget for whatever you guys can do.'",
        "'speaker_6': 'It would be really appreciated just to implement a concrete park.'",
        "'speaker_5': 'Well designed.'",
        "'speaker_6': 'I did have some snow in the McBride skate park. Believe injuries as a part of that one.'",
        "'speaker_5': 'Anything you can do to concrete.'",
        "'speaker_6': 'Well this last a.'",
        "'speaker_5': 'Really long time and again it it.'",
        "'speaker_0': 'It's.'",
        "'speaker_6': 'Good for the kids. It gets them off the street. It teaches them perseverance, patience, so many things. Thank you for listening.'",
        "'speaker_4': 'Thank you. Thank you for coming back. We appreciate you. Next, teacher, please.'",
        "'speaker_5': 'Good. Good evening, Vice Mayor Richardson, City Council Member, City Staff Rich Gardner, District four. I want to thank the city for approving the $125,000 for the Commission on Aging. I just got news from Karen from the Long Beach Gray Panthers that that happened.'",
        "'speaker_5': 'And I implore the citizens out there to get behind any efforts to increase activities with the seniors. Some people call it the silver tsunami. I don't know if you've heard of that phrase, but let's face it, a tsunami is an underground earthquake that happens all of a sudden.'",
        "'speaker_5': 'And basically the baby boomers are growing at such a rate that it's more appropriate to call it an iceberg. And if we look back at one of the greatest disasters in the history of mankind, which is the Titanic, basically our technology is so much better nowadays.'",
        "'speaker_5': 'We have the ability to see that iceberg. We know it's there. The problem is, just like with the Titanic, I don't think America or the world has really put enough lifeboats on this ship called the World. And that's the main reason that I'm sorry that 1500 people died on the Titanic because they only had 20 lifeboats and'",
        "'speaker_5': 'they had the capacity of 64. So I encourage the council members. I'm sure a lot of you have assisted living facilities in your own districts to go and visit and find out some of the needs and concerns and the citizens out there that are caring for the people.'",
        "'speaker_5': 'Let's face it, it's an overwhelming responsibility. A lot of you know, I know this firsthand because I took care of my wife who had Alzheimer's disease. And I can tell you that it's just it's more than you guys can even imagine.'",
        "'speaker_5': 'So with that in mind, the Gray Panthers are also going to be having a booth. They just looked it up. It's called the heart of Ida Walk, which is September 23rd. I haven't been there yet, but I hear Rosie the Riveter park is pretty nice.'",
        "'speaker_5': 'I'm not sure whose district it's in, but it's going to be a senior safety walk to help raise awareness. So I encourage the citizens out there to come on out, help, support and once again and I organized the Purple City Alliance, Riverside, California.'",
        "'speaker_5': 'We recently got the city of Corona to partner in with us. I'm inviting the city of Long Beach. Whoever can make this happen to come and share our information. Last year, we put together five symposiums on the issues of dementia and Alzheimer's.'",
        "'speaker_5': 'And October 22nd, San Cornelius Church. We're going to have a little throwdown from 2 to 5, get some people out there to celebrate life with those that are struggling. Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening. My name is Vince Poggi, and I'm a 40 year resident of the third District and an alumni of.'",
        "'speaker_6': 'Long Beach State Beach.'",
        "'speaker_5': 'I'm also an animal.'",
        "'speaker_6': 'Activist, and I just wanted to acknowledge.'",
        "'speaker_5': 'Some of my fellow activists who are here tonight in support.'",
        "'speaker_0': 'First of all.'",
        "'speaker_5': 'Thank you for allowing me an opportunity.'",
        "'speaker_6': 'To express my views.'",
        "'speaker_5': 'In a Grunion Gazette article from August 24th of this year. The writer Ashley Rule cites there have been three straight years of record low in LBS and euthanasia and at Animal Care Services. These are important and positive results.'",
        "'speaker_5': 'This is a result of the hard work and commitment of Ted Stevens and his staff and his willingness to work with volunteers and rescue groups. These steps are to be applauded and are a step in the right direction.'",
        "'speaker_5': 'But as the article mentioned, there is more work to be done. There is a national and international movement to stop killing healthy, adoptable animals in shelters. There are 35 states currently with programs to include 420 cities that have successfully achieved their target goals.'",
        "'speaker_5': 'They are saving taxpayer dollars, city resources and lives. There are 13 cities in California, including Palm Springs and San Francisco. This goal.'",
        "'speaker_0': 'Is not the.'",
        "'speaker_5': 'Sole responsibility or burden of animal care services. It is a city wide community endeavor requiring cooperation from residents, volunteers, foster families, adopters, donors, related nonprofits and rescue groups, fundraising endeavors and grants, spay neuter education programs. Of course, some of these require funding.'",
        "'speaker_5': 'Congressman sorry, Councilman Mondo's proposal for 50,000 in additional funding is truly, greatly appreciated. But realistically, it's just going to take more. Just to give me an idea of some of the cities that are doing this are really quite diverse in size and economic.'",
        "'speaker_5': 'But Kansas City, Missouri. Charleston, South Carolina. Jacksonville, Florida. There are quite a few. Des Moines, Iowa. They're all different, except they have an openness and a.'",
        "'speaker_6': 'Willingness.'",
        "'speaker_5': 'To try and change this antiquated belief that this cannot be solved. So again, I say Congressman Councilperson Mungo's increase is appreciated.'",
        "'speaker_6': 'But it's just a step in the right direction.'",
        "'speaker_5': 'Lastly, I would say that it's going to take a while and a lot of work and cooperation, but I personally would be very proud if we were able to add our great city to the list of compassionate communities that I had mentioned.'",
        "'speaker_5': 'Thank you for your time.'",
        "'speaker_4': 'Thank you. Next speaker.'",
        "'speaker_3': 'Good evening, everybody.'",
        "'speaker_4': 'Can we say to us that is not the first district and a proud member of.'",
        "'speaker_3': 'The Long Beach Gray.'",
        "'speaker_4': 'Panthers? Budget processes are hard. We have to make hard choices about.'",
        "'speaker_3': 'Where our money is.'",
        "'speaker_4': 'Going to go and balance all the needs in the community. And there's always more needs than there is money available to address all the needs within a community. I want to commend Stacie Mongeau for chairing the Budget Oversight Committee.'",
        "'speaker_4': 'I've gone through a lot of budget processes. She did an amazing job and the people comments and discussions that Susie Price in Austin. The questions you brought really made me feel that this is a shift in the way we do our budget in our community, that we're going to consider the needs of all of our community going'",
        "'speaker_4': 'forward. Personally, I want to address and.'",
        "'speaker_0': 'Thank you all.'",
        "'speaker_4': 'For including the money for the establishment of the Office of Aging within our.'",
        "'speaker_3': 'Community.'",
        "'speaker_4': 'As Richard said, we have this huge tsunami coming of seniors and.'",
        "'speaker_3': '10,000 nationally every day and not a large number in.'",
        "'speaker_0': 'Our.'",
        "'speaker_3': 'Community.'",
        "'speaker_4': 'We don't get the acknowledgment of what we contribute to the community. We're huge economic engines for the community. Seniors own 80%.'",
        "'speaker_3': 'Of the United States.'",
        "'speaker_1': 'Wealth.'",
        "'speaker_4': 'Something that we need to think about. We're often discounted, but we feel that this office and aging is the first.'",
        "'speaker_3': 'Step to.'",
        "'speaker_4': 'Really, truly engaging seniors in the processes of our community. And some of you.'",
        "'speaker_3': 'Are on the council are seniors.'",
        "'speaker_4': 'Just barely. But we look forward. We always think that we're the age that we will at some point in time. And we want to be. Great Panthers look forward to working with the Office of Aging to make our community truly an age friendly community.'",
        "'speaker_4': 'And Mayor, we accept your.'",
        "'speaker_3': 'Challenge at the you did at the aging in.'",
        "'speaker_4': 'Mount Maginnis event to make Long Beach the best community for seniors in the U.S.. Thank you. Thank you. I appreciate everyone for coming out. There are some really amazing things in this budget, $2.65 billion. And here we are at the end discussing the final 20,000, 50,000, 70,000.'",
        "'speaker_4': 'If we could get a quick answer to a question from Ms.. Marie Knight. I know that the comments made here tonight related to skate parks are something that I have experienced. I'm very fortunate. I have a concrete skate park in the fifth District, Eldorado Park.'",
        "'speaker_4': 'I was at Michelle Obama Library the other day and in route I passed a skate park in the ninth district. Then it was 9:00 at night and leaving the event it was still activated. So I do appreciate that they are a activated component of our city.'",
        "'speaker_4': 'Ms. Night What are the repairs needed and or conversion process to concrete that is being discussed by the community today?'",
        "'speaker_3': 'So, Chairman Go Members of the council, the 14th Street Skate Park is a combination of concrete elements and as one of the gentleman mentioned.'",
        "'speaker_4': 'Prefabricated.'",
        "'speaker_3': 'Elements.'",
        "'speaker_4': 'The prefabricated.'",
        "'speaker_3': 'Prefabricated elements do not last, obviously, as long as concrete, concrete is ideal. So although I was not here at the time that that skate park was constructed, I can't tell you the logic behind that. But we just recently spent about $12,000 doing some.'",
        "'speaker_4': 'Repairs to the.'",
        "'speaker_3': 'Prefabricated elements, and they take a lot of wear and tear. That is a very highly utilized skate park as all of our skate parks in the city are. And so without the conversion to concrete, those elements will continue to need repair.'",
        "'speaker_4': 'As a matter of fact, we.'",
        "'speaker_3': 'Were unable to convince the original manufacturer to make those repairs, and we had to find an alternative contractor to do that. So I don't see that.'",
        "'speaker_4': 'We will.'",
        "'speaker_3': 'Be able to continue to have such success with that in the future. I have talked to some of the skate park advocates as well. As far as you know, depending on funding that's available, we have looked at grant funding.'",
        "'speaker_3': 'There isn't a lot of grant funding available.'",
        "'speaker_4': 'For skate parks.'",
        "'speaker_3': 'They're generally in the realm of 5000, 10,000, 25,000 at the most. But potentially, as funding is made available, we can phase in the replacement of the prefab elements.'",
        "'speaker_4': 'I appreciate that. I see that two councilmembers are queued up from that area of town. Councilwoman Gonzalez.'",
        "'speaker_3': 'Yes. Thank you, Marie. And thank you to Councilwoman Mongo for bringing that forward. And I want to thank the parents and Patrick for being here and the kids. I know Michael Kay Green is a big park in the first district and for the area.'",
        "'speaker_3': 'And so I just want to thank you for bringing light to the fact that, you know, I remember when Mrs. King was out and we put it all together in the very beginning stages when it was Vice Mayor Robert Garcia then at the time and now being the councilmember, I know how important this is for the Washington'",
        "'speaker_3': 'neighborhood. I actually have a meeting coming up with both Pat West and Marie very soon to talk specifically about parks in general, but just also about Michael K Green and what we can do there. I'm wondering, though, and knowing that we have this contingent appropriation, I'm wondering if we can even just take a third 100,000.'",
        "'speaker_3': 'I think the figures for Michael K Green may have been around 300,000 or so. We're not give or take quite a bit, but if we're able to expand on 100,000 and provide that as part of the contingent appropriation, if we should have surplus for Measure A, if that is a friendly amendment, I would.'",
        "'speaker_4': 'Actually not be for Measure eight. So what what we could potentially look at is so contingent appropriation. What that means is if we come in under budget and there's money available, it goes to a set of priorities in a priority order.'",
        "'speaker_4': 'And so we've started to outline what those priorities are. I think 100,000 is a stretch. But I think that if we have a commitment that we use it in partially to match and or phase in an approach I see nods on that side of the table.'",
        "'speaker_4': 'It's also important to know, though, that you won't know if that money is there for quite some time. It's not available October one. It's not available until the budget closes. And we actually know there is money. We can't spend money that we don't have.'",
        "'speaker_4': 'And so you're not the first in the list, but I think that it is important to send this message. And I think that. The city staff can work even harder to come in under budget. Yes, they're nodding as well.'",
        "'speaker_4': 'So I'll accept a friendly for 100,000 towards matching and moving towards a concrete skate park at 14th.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'And I know a second. Want to accept that friendly as well.'",
        "'speaker_6': 'Well, as one of the I think the few districts without a skate park.'",
        "'speaker_4': 'Aren't you getting one soon, though?'",
        "'speaker_1': 'I don't know.'",
        "'speaker_4': 'Is anyone coming to a park near.'",
        "'speaker_6': 'You those days?'",
        "'speaker_1': 'Of course I do. Those funds have not been identified.'",
        "'speaker_6': 'And I would just.'",
        "'speaker_1': 'Just say that I know that we also have a firm in the the General Fund.'",
        "'speaker_6': 'For Capital Infrastructure or existing city program to be divided equally for the city council districts. That one could be used for for that purpose as well.'",
        "'speaker_4': 'It could that would only amount to 70. The 78,000.'",
        "'speaker_6': '83,000 only. That's all.'",
        "'speaker_1': 'Could get you. Almost there.'",
        "'speaker_4': 'I understand if we can't do it at this time. But then I would ask that the IOC look at it again in our. Are you in close? Is that.'",
        "'speaker_3': 'That works? I just want to start.'",
        "'speaker_4': 'Let's do that. That would be great. Then let's put that at the top of our agenda for the b0c when we come back. Okay. That helps us. I know that it's an important need. I want you guys to know that you're heard and that it's in a a list.'",
        "'speaker_4': 'I think that part of it is that we're here at the last minute. And I appreciate you all coming out. And the process of the budget takes several, several weeks. And so I think that as numbers firm up and we have a better plan and where some of those matching funds could come from, I think that at'",
        "'speaker_4': 'prior community meetings there was a talk of matching funds that would come in in larger quantities. So the research needs to be passed on to our Parks and Rec department because part the report, they're coming in a little bit lower.'",
        "'speaker_4': 'So let's talk through that over the next several weeks and when we come back mid-year. And let's look to find a positive way to make that happen. Wonderful. See? No further comment. I have one more, Councilwoman Pierce. Thank you.'",
        "'speaker_4': 'I just wanted to say, you know, someone that has a skate park in her district and have talked to a couple of you guys, I couldn't think of a better program.'",
        "'speaker_3': 'That we can add.'",
        "'speaker_4': 'To parks that don't require too much staff time, but have a lasting impact. I recently had a conversation with our assistant city manager and Marie Knight, our parks director, around how to how do we partner better with community organizations to invest in our parks, in areas that we might not have the funds to do so.'",
        "'speaker_4': 'And so I would encourage you guys to have a conversation both with the council member and our Parks and Rec around our Peps program and possibly drafting a proposal for what that skate park would look like and possibly reaching out to, you know, the Mountain Dew event that happens and saying, can we get some funds that would'",
        "'speaker_4': 'help us have a program? Maybe it's a Mountain Dew program in the in the community that helps fund our skate parks because as I think the PSC chair mentioned, we all have those projects and I think that an area that people like to put money.'",
        "'speaker_3': 'To is investing in youth and.'",
        "'speaker_4': 'That there's a lot of corporate opportunity and professional skaters out there that say, I want to invest back in. That's an opportunity that you guys can help us partner with where we might not have direct access. So I encourage you guys to have that conversation.'",
        "'speaker_4': 'Likely you could get something done faster than waiting to see if we have some extra money in that aspect. So I just wanted to put that out there for you guys. Absolutely. Councilman Price.'",
        "'speaker_3': 'Thank you. I do want to say I want to thank Mike is still here. He was at my community meeting the other night and it prompted me to reach out to a developer who is working on the second and PCH project in my district about bringing in a Vans type private facility like they have at the block'",
        "'speaker_3': 'over at the second PCH site. I think that actually would be a really great offering to have at that development. I think it would like Mike said, it's got to be an experiential retail experience for people to go and for it to sustain.'",
        "'speaker_3': 'So I'm hoping that that's a possibility. If we are allocating money citywide for skate parks, I would love one as well. I don't have one and our district doesn't have one. We get a lot of requests for them and I actually think Rec Park would be a beautiful site for a skate park facility because there's no homes'",
        "'speaker_3': 'around it. And so we're not going to have concerns from residents. I think we could build a fantastic one there. And it's a place where we've seen a lot of recent transient activity, so it would really activate that space in a positive way.'",
        "'speaker_3': 'So I think the idea of looking at this for future funding would be great. It would be fantastic to have skate parks all throughout the city because I agree it's a great way to get the youth engaged. So thank you.'",
        "'speaker_4': 'Thank you to all my colleagues for your club. This process. I know it's not easy, and I appreciate so many members of all the communities and constituencies coming out. I think that what we've put together today is fiscally responsible and very collaborative, and I'm appreciative to everyone who was a part of it, especially the staff who have'",
        "'speaker_4': 'gone through many iterations with me, I think run like iterations 74 or something of of different multipliers of where we could put different things. So thank you to everyone and I urge everyone to support this motion.'",
        "'speaker_2': 'Motion case.'"
    ],
    "Contract Award for Managed Services for City's Utility Systems.": [
        "'speaker_0': 'KING Next item, please, is item number 23.'",
        "'speaker_2': '26.'",
        "'speaker_0': 'I'm sorry, 26. My bad.'",
        "'speaker_2': 'Report from Technology and Innovation and Financial Management Recommendation to Award a contract to Utility Solutions Partners LLC to provide maintenance and integration support related to the city's utility systems in a total amount not to exceed 4,044,595 and authorize the city manager to execute all documents necessary to enter into the contract citywide.'",
        "'speaker_0': 'Kitties in and a second attorney public comment on this item.'",
        "'speaker_1': 'Circling. This is a 20. 20. So, you know, if you didn't do 23 years, right.'",
        "'speaker_4': 'A long time ago, you spoke on it.'",
        "'speaker_1': 'You slip.'",
        "'speaker_4': 'You spoke on it.'",
        "'speaker_1': 'Oh, we are okay. Okay. Okay.'",
        "'speaker_0': 'There's a motion and a second. No other public comment. Please cast your votes.'",
        "'speaker_1': 'Tony.'"
    ]
}