{
    "Co-sponsorship and Support of Assembly Bill 1771 on Human Trafficking Penalties.": [
        "'speaker_2': 'Madam Clerk, can we take up item 28.'",
        "'speaker_0': 'Communication from Councilman Austin, Councilwoman Gonzalez and Councilman Andrew's recommendation to request that the City of Long Beach become a co-sponsor of Assembly Bill 1771 to increase the penalties for human trafficking.'",
        "'speaker_2': 'Councilman Gonzalez.'",
        "'speaker_5': 'Yes. I want to thank, uh, my council colleagues for bringing this forward, particularly council member Austin. So we're asking the council to sign on as a co-sponsor to HB 1771 by Assembly member Patrick O'Donnell. AB 1771 would increase the penalties for human trafficking and give our prosecutor more tools to combat this terrible crime.'",
        "'speaker_5': 'The city is already on record in support of this bill, and the mayor has sent a letter of support by becoming a co-sponsor of the bill. The city would then be able to work actively in support of its passage, including helping to get support from other cities.'",
        "'speaker_5': 'The bill is currently co-sponsored by our city prosecutor Doug Halbert, and the city of Long Beach is Human Trafficking Task Force. I would like to on behalf of Councilman Austin, I'd like to thank Doug Halbert for being there, being here, as well as Assembly Member O'Donnell's district director.'",
        "'speaker_5': 'I think Marisol, is she here? There she is. And members of the Human Trust Trafficking Task Force. I would also like to acknowledge our manager of government affairs, Diana Tang, who coordinates all of the city's efforts with legislation.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Councilman Andrews.'",
        "'speaker_7': 'Yes. Thank you, Vice Mayor. I also would like to thank our councilwoman, Mrs. Lena, for bringing this forward, because the fact that I am very supportive of the Assembly bill O'Donnell bill, to have closed it. You know, this is a loophole that has, you know, admission and AB 1771 and is a bill that likes this will help'",
        "'speaker_7': 'us prosecute human trafficking and criminals to the fullest while prosecuting, you know, like protecting and excuse me, the innocent victims that they prey on. I think everyone is really aware of that because this is something that's so prevalent in our city and all over.'",
        "'speaker_7': 'So I'm really, really excited about this bill and I hope it really shows what we can do to help our young individuals who's a part of this. Thank you very much.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_8': 'Thank you. And I'm proud to join the chorus of support for this. You know, many people know that a lot of times this human trafficking network is directly linked to gang activity and other underground trades and such. So it's only important that we're smart and innovative and that we have our state supporting on the ground efforts and'",
        "'speaker_8': 'we have our local prosecutor at the table as well. So I think this is completely smart and the type of legislation that we should be supporting.'",
        "'speaker_2': 'Thank you, Mr. City Manager. Would you like to turn it over for a report from your staff and then as well as comments from our city prosecutor?'",
        "'speaker_7': 'We certainly would. We have Diana Tang and then, of course, the city prosecutor.'",
        "'speaker_5': 'Vice mayor, members of the city council, thank you for the opportunity to give a brief report on this. The city, as Councilwoman Gonzalez mentioned, is in support of the bill. And we've been working closely with the city prosecutor here on getting support for the legislation.'",
        "'speaker_5': 'It is currently headed for the Assembly Appropriations Committee later this month, and we hope to bring on San Diego and a number of other cities in support of the bill as well. That I'll turn it over to our city prosecutor.'",
        "'speaker_7': 'Thank you. I'd also like to thank Councilwoman Gonzalez, Councilman Andrews, Councilman Austin for bringing this forward to today's agenda. People may not know this, but the city of Long Beach has been a leader in the fight against sex trafficking.'",
        "'speaker_7': 'I want to commend the City Council for fully funding the city's vice department so they can operate sting operations to try to catch some of the people who are behind human trafficking here in Long Beach. This bill came about as a result of a case that happened here in Long Beach, where a gang member was found at'",
        "'speaker_7': 'a hotel supervising a prostitute. There was not enough evidence to present a felony charge in court. So the only thing that was remaining was a misdemeanor, capped at six months in county jail. And we know that the way the county jail, the situation with the county jail this time is one that results in early release or quick'",
        "'speaker_7': 'release of misdemeanors. This bill will help add give teeth to the city's efforts. It's important, but I didn't I didn't want to end before acknowledging the commitment of the leadership of the city council. I also have with me tonight Alan Miller, who is a deputy city prosecutor and leads our human trafficking division.'",
        "'speaker_7': 'She was a deputy district attorney in Fresno before coming to my office. And also Tracey McGee, who provides services to women who are victims of sex trafficking, wherever you are. Could you raise your hands right behind me? But I wanted to just acknowledge their good work and also the good work of the police department and acknowledge the'",
        "'speaker_7': 'city's leadership in this. You're all to be commended. So thank you.'",
        "'speaker_2': 'Thank you. There's been a motion and a second. Is there any member of the public that wish to address the Council on item 28? Please come forward.'",
        "'speaker_1': 'I am Frances, Emily Dyson Harris and I reside in District one and I wholeheartedly support the recommendation you have, and I want to commend you for bringing this forward. I have a background actually in nursing from Penn State University, and my specialty was children.'",
        "'speaker_1': 'And I saw when I worked in Washington, D.C., this type of thing going on and is just. There's no words to describe it because the person's life, that's the victim. You know, hopefully they'll not have scars. Physically, mentally, psychologically, for the rest of life.'",
        "'speaker_1': 'But it affects our family, their friends. But I want to say to you that I commend the city of Long Beach for this, and I urge you to go get every city in the state of California that you can tap to support this, because the more cities that support it will be a message basically to say, get'",
        "'speaker_1': 'out of the state of California. This is unacceptable. We will not tolerate it. And we're look, we're watching you and you will be found. Thank you very much.'",
        "'speaker_0': 'Good. Good evening, Vice Mayor. Members of the City Council party sold by the House District Director for Assembly Member O'Donnell. Some of the members sense his regrets that.'",
        "'speaker_5': 'He cannot be here tonight to encourage.'",
        "'speaker_0': 'Your vote to support his bill AB 1771, which will help judges keep human traffickers behind bars. Criminal street gangs have.'",
        "'speaker_5': 'Been continually evolving new methods to fund gang.'",
        "'speaker_9': 'Activities.'",
        "'speaker_0': 'For decades.'",
        "'speaker_9': 'In recent.'",
        "'speaker_0': 'Years, they have turned to commercial sexual exploitation as a new source to illicit.'",
        "'speaker_5': 'Income.'",
        "'speaker_0': 'While law enforcement has had success limiting human trafficking operations. Their efforts can be hampered by witnesses refusing to testify due to the threat of retaliation. In these instances, prosecutors must ultimately settle on a charge of supervising, supervising prostitution for those clearly in charge of these operations.'",
        "'speaker_0': 'The maximum penalty for this crime is only six months, the same as the prostitutes they oversee who.'",
        "'speaker_5': 'Are often victims.'",
        "'speaker_0': 'Themselves. Judges need discretion to recognize when this crime is part of a larger operation and deal the necessary blow to those operations. Abbie, 1771, does so by increasing the maximum penalty for supervising.'",
        "'speaker_1': 'Prostitution to one year and clarifying.'",
        "'speaker_0': 'The activities that can be used as evidence when prosecuting this crime. In closing, some remember O'Donnell is proud to author this bill with the support of city prosecutor Doug Halbert, a true advocate for Long Beach, as well as the Long Beach Human Trafficking Task Force.'",
        "'speaker_0': 'Thank you to Councilman Austin, Councilwoman Gonzalez and Council Member Dee Andrews for your leadership in bringing this forth.'",
        "'speaker_5': 'On behalf of Assembly Member O'Donnell, I.'",
        "'speaker_0': 'Respectfully ask for your vote in support of this bill.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Good evening, vice mayor and council members i'm virginia isn't here representing the Long Beach Human Trafficking Task force. I want to thank you for bringing this bill forward on the agenda this evening. As you all know, the task force is a collaboration of different organizations and agencies.'",
        "'speaker_5': 'And the task force and we've worked with with each of you and with the city on various things. In the past, we focus on three P's prevention, which includes education. In our event, the Youth Exploitation Safety Symposium, which we held in February.'",
        "'speaker_5': 'We also focus on protection, offering services and resources to survivors such as humanitarian bags and transportation. And the third P that we focus on is prosecution. And that is where cosponsoring HB 1771 comes into play for our task force as part of the collaboration to work to longer sentences for traffickers, which will also provide time for the'",
        "'speaker_5': 'survivors to rebuild their lives. We're proud to be a partner with the city prosecutor's office and with with Assembly member Patrick O'Donnell to bring a 1771 to Sacramento. And we hope to have the city of Long Beach co-sponsor the bill as well.'",
        "'speaker_5': 'We're working with different task force and organizations across California to help support this bill as well. The task force is about collaborating to fight this issue, and by working together, we can set an example of how we can make a change.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Councilman Mongo.'",
        "'speaker_0': 'I just want to thank everyone who worked hard on this. And I know that my colleagues and I joined Assemblymember O'Donnell at the symposium you mentioned, and it was a worthwhile event and all the things that you're doing a very valuable.'",
        "'speaker_0': 'So thank you for that.'"
    ],
    "Lease Agreement with Killing Fields Memorial Center for a Community Memorial Garden.": [
        "'speaker_2': 'Thank you. There's been a motion and a second. Members, please cast your vote. Motion carries. Thank you. Madam Clerk, if we can go to item 21.'",
        "'speaker_0': 'Report from Economic and Property Development Recommendation to execute a lease with Killing Fields Memorial Center for city owned property located at 1501 East Anaheim Street for the development and operation of a community memorial Garden District six.'",
        "'speaker_2': 'We have a second. There's been a motion and a second.'",
        "'speaker_7': 'Yes. Yes.'",
        "'speaker_2': 'My Councilman Andrews.'",
        "'speaker_7': 'Yes. Thank you, Mayor. Before we get started, I'd like to do a staff report on this. And Mr. Mike Conway, would you please? Thank you. I'd like to introduce our director of Economic and Property Development, Mike Conway, Vice Mayor Lowenthal, members of the City Council.'",
        "'speaker_7': 'This item relates to former RTA property located at 1501 East Anaheim Street, the northeast corner of Anaheim Street and Peterson Avenue. The property was originally purchased for use as a community garden, Open Space and Killing Fields Memorial to commemorate the victims of the Cambodian Genocide.'",
        "'speaker_7': 'Killing Fields Memorial, Inc, a California nonprofit organization, seeks to develop this property at its cost into a memorial that includes a memorial structure, restroom facilities and storage area, along with open space and garden areas. The nonprofit organization intends to raise funds in order to construct the improvements and proposes to operate and maintain the facilities as a public'",
        "'speaker_7': 'open space. Staff has negotiated terms and conditions of a lease that provides for rent of $1 per year during a fundraising period of three years and an additional two year period to allow the nonprofit organization to construct the improvements.'",
        "'speaker_7': 'If either the fundraising or the construction is not diligently pursued to completion within the stated timelines, the city may terminate the lease. However, if fundraising and construction proceeds within the provided timelines, the nonprofit organization will then have an option to purchase the property for $1.'",
        "'speaker_7': 'If the option is exercised, the land will be conveyed with a covenant in perpetuity, requiring the nonprofit organization to offer the property as a public open space to maintain all improvements and fund all capital reinvestment. Failure to comply with the covenants could result in the reversion of the property back to city ownership.'",
        "'speaker_7': 'This structure provides an opportunity for city residents to enjoy a public open space serving as a Killing Fields memorial with all construction, maintenance and capital reinvestment reinvestment funded by a nonprofit organization. We had a behind you on the screen some images as conceptualized by the nonprofit organization providing, again, some open space.'",
        "'speaker_7': 'Some garden areas, structures related to a memorial killing fields memorial commemorating the genocide of the Cambodians and kind of an aerial vision as well. So this concludes my report, and I'm available to answer your questions. Thank you very much.'",
        "'speaker_7': 'First of all, I'd like to just speak on this item because the fact that I think is the first killing feel memorial outside the state of California. So these are the things that I think I really wish most people would take time to take a look at, because being that the Cambodians have been here for 30 some'",
        "'speaker_7': 'years, and I think this is something it's very something I totally support because this is the project will be the first in a memorial outside of Cambodia. And many of our Cambodian refugees will never go back to Cambodia.'",
        "'speaker_7': 'But with this memorial, they will be able to have a place to heal, to reflect, to meditate, and to honor those that they have lost in the war. This is a memorial is for them. And because the fact that this I would like to have a mr. SA who will come up and speak on this issue very'",
        "'speaker_7': 'shortly. See you on Thursday. Good evening, Madame Vice Mayor and members of the City Council. My name is Pauline Sot. I am a member of the Killing Fields Memorial Center. Our organization is dedicated to commemorating the Cambodian genocide.'",
        "'speaker_7': 'Every April 17, we pay respect to the victims of the killing fields and hope to bring public awareness by making a program, the Genocide Awareness Month. For many major genocides namely the Armenian genocide, the Jewish Holocaust, the Cambodian killing fields, and the Rwandan genocide.'",
        "'speaker_7': 'What a great night from a dream. Yes, a little dream of her. When your rock or a tree to walk around, to worship, to touch, to have to cry on, to feel the suffering of our innocent people with, to remember and pay respect at.'",
        "'speaker_7': 'You have made this dream come true. Now we have a place we can call home. The Killing Fields Memorial Garden will be adorned with landscapes and waterfalls. It will be a gathering place decorated with Cambodians artifacts and designed and built by Cambodians.'",
        "'speaker_7': 'The Killing Fields Memorial Garden will be the first of its kind outside of Cambodia in our beautiful city of Long Beach, the third largest city in the US, the seventh largest city in California, and the greatest city to the largest Cambodian community outside of Cambodia since 1975.'",
        "'speaker_7': 'This will be a great place of love and kindness. It will welcome people from all walks of life to come in and enjoy peace and tranquility. Find solace and closure. Learn about the history of the killing fields. Learn about the Khmer culture and worship.'",
        "'speaker_7': 'Remember and pay respect to millions of victims of the Cambodian genocide that became well known as the killing fields. Thank you, Councilman Lee Andrews. You made it happen. Your life and legacy will live forever in our hearts. Thank you, John Edmonton, for voicing the dream ten years ago and for making it happen a reality tonight.'",
        "'speaker_7': 'Honorable Vice Mayor and members of the City Council, the spirit of millions of victims of the killing fields. They are descendants, friends and supporters of the Killing Fields Memorial Center. Forever grateful for your decision tonight. This may seem a small step to some, but it is a giant step in a world that clamor for peace and above'",
        "'speaker_7': 'all, kindness. On behalf of the survivors of the killing fields, we thank you for standing up for humanity and kindness. So. Morgan Palmer, thank you very much. God bless you. God bless. Long Beach. And God bless America. Thank you.'",
        "'speaker_7': 'Thank you, Pauline. I would just hope that everyone in this city and all the other cities will embrace this memorial for all the people to have a chance to come and see that where people can sit down and pay their tribute to someone who was such a tragedy.'",
        "'speaker_7': 'And again, I'd like to say Jimmy Blair, welcome. Probably, yes.'",
        "'speaker_2': 'Yes. Give us 1/2. Council member Urunga.'",
        "'speaker_4': 'Yep. Perhaps this would be a good opportunity to hear from the public regarding this project. Or you want.'",
        "'speaker_2': 'Yeah. Let me hold for 1/2 now. Let me hold for 1/2. I know that we'd like to take a photo.'",
        "'speaker_7': 'Yes, but.'",
        "'speaker_2': 'But we can. Let me take the councilor comments. Do you have comments?'",
        "'speaker_4': 'Thank you to the vice mayor. I too want to lend my support for this project. I think it's a wonderful one. I was, as many of you might know, especially those in the cabaret community, I participated in a groundbreaking ceremony back in 1978, actually 80, 82 or 83, when the UCC center was was being built.'",
        "'speaker_4': 'It was a at that time a Latino center. It was the the North it was the Long Beach Neighborhood Center, the Centro de la Raza, it was called. And I was I was very proud to be part of that transition.'",
        "'speaker_4': 'And it was the center that opened up that welcomed the Cambodian community into Long Beach. And since then, we know that the community has grown significantly and that it is the largest community outside of Long Beach. And I'm very proud that we're here today, that I'm here today to welcome you back, welcome you here, keep you here'",
        "'speaker_4': ', and to help you get this project off the ground so that we can start the healing that we need to do and the healing that should have been done a long time ago. And I think that this memorial would be a big step in that direction.'",
        "'speaker_4': 'And you mentioned some other tragic events in our history, in the history of the world. And I think that your dedication to those tragic events, as well as your own, is what happened in the killing fields is a make it a big testimony to your commitment for humanity and for making and building a better world here in'",
        "'speaker_4': 'Long Beach and around the world as well. So I want to lend my support to this project as well.'",
        "'speaker_2': 'Let's go ahead and hear comments from the public and then we'll take it behind the wheel.'",
        "'speaker_7': 'Thank you. Good evening, Honorable Vice Mayor, Member City Council. Ladies and gentlemen, my name is Brian Bell, reside at one sixth of Ohio Avenue in the fourth District. As a survivor and currently president of the Killing Fields Memorial Center.'",
        "'speaker_7': 'I'm honored to be here tonight to offer my sincere appreciation and gratitude for the decision you will make tonight toward the Cambodian Genocide Memorial Garden Project. According. To the RAND Corporation study ended in 2005 in the Cambodian community in Long Beach by interviewing more than 500 survivors Senate.'",
        "'speaker_7': 'The study found 62% of the Cambodian people have post-traumatic stress disorder, PTSD, and 51% have major depression disorder. The action by the City Council today further strengthened our city commitment to diversity. The Cambodian Genocide Memorial Project will not only be a place for.'",
        "'speaker_7': 'The Cambodian to reflect on the journey that brought. A to our new home, but it will star them space for a community that share similar story of struggle and survival. The Cambodian Genocide Memorial is an immigrant story. And from our mayor, who is an immigrant from Peru to the residents who live and work in the city, the'",
        "'speaker_7': 'memorial paid tribute to our heritage. And so to demonstrate that diversity, our strength. This is a major step forward in a long journey from the killing field to the promised land. It is a step toward healing and uniting our community.'",
        "'speaker_7': 'By approving staff recommendation tonight, you will have a hand in waiving. The Cambodian experience in the rich tapestry in our great city. Furthermore, I would like to share with you a brief history of the Cambodian genocide. Madame May.'",
        "'speaker_7': 'I would like your permission. It might be a little bit longer than three minute.'",
        "'speaker_2': 'In your comments?'",
        "'speaker_7': 'Yeah, just a brief.'",
        "'speaker_2': 'Can you make it brief?'",
        "'speaker_7': 'Okay. I think. Thank you. Between 1975 and early 1979. The Khmer Rouge, headed by pulpwood, supported Cambodian citizens through arena terror, aimed to create a truly Marxist utopian society. This societal experiment quickly turned into a nightmare of warfare.'",
        "'speaker_7': 'Execution, starvation for hard labor. Brainwashing. Political repression. Physical appearance, threatening asphyxiation and or the kind of torture that claimed the life of. An estimated 1.5 to 3 million or 20 to 40% of the entire population of Cambodia. And that attacks on a Cambodian were forced to flee the party to the Cambodian border, losing their home and their'",
        "'speaker_7': 'homeland. And resulting in the further breaking apart of family. They face additional traumatic experience during their life threatening flight to Thailand. And many live for a year in condition characterized by material scarcity, poor sanitation violation and certainly in the camp children.'",
        "'speaker_7': 'Who sometimes spent a year in this camp. Opportunity for normal childhood. In early 1980, approximately 200,000 Cambodian displaced refugees live in the United States. The single largest concentration of the Cambodian anywhere outside of Cambodia reside in the Lilongwe area.'",
        "'speaker_7': 'Relocation to a new country entailed foot separation from family isolation and further stress related to adjusting to a new country, language and culture. Cambodian have exhibited tremendous courage and resilience throughout this trauma and challenge. We are not allowed Cambodian refugees a limit among the general public and also among the younger generation of Cambodian living in Israel that'",
        "'speaker_7': 'did not live through the Khmer Rouge regime themselves or were very young when they left the country. Frequently, though, survived the Pol Pot Khmer Rouge regime, period. I found it too painful to share their experiences, even within their own family.'",
        "'speaker_7': 'There is strong desire among many Cambodian in Long Beach to educate the younger generation and the Cambodian about their family and community history, as well as the larger public. At this moment. I would like to recognize and thank you on behalf of the board of the director.'",
        "'speaker_7': 'To the people that who work very hard behind the scenes to restore information experience. Please help me give warm welcome to the champion, newly reelected. Councilman Andrew. Former Councilwoman Tonya Durango. I see you here. Thank you for being here.'",
        "'speaker_7': 'And our chief of staff, John Edman, and Republican. And Attorney Bill Shibley. And especially the board of directors. Yeah. I'm leaving friends. I could. Thank you very much.'",
        "'speaker_2': 'Thank you, Brian. Next speaker, please. Interview.'",
        "'speaker_1': 'Well, I hadn't planned on speaking, but I just had to come forward. I'm Francis. Some of the in Paris. And I was inside in district one. Councilmember Dan. Thank you for all your diligence and passion, love, understanding. And moving forward on this matter.'",
        "'speaker_1': 'And what a phenomenal way for the city owned property to have the Killing Fields Memorial Center. I hope that everybody that's watching this on TV and of course, all of you that are here, I have a heavy heart.'",
        "'speaker_1': 'I'm kind of visualizing what all happened. But I believe that the Killing Fields Memorial Center, when people see it, hopefully. They'll take a moment and they'll think about what happened. And then they'll move forward to try to help bring love, peace and understanding among our men in equality.'",
        "'speaker_1': 'And the gang members. Maybe you'll start looking at things a little different and look at the fact of what you can do to individuals and the fact it has on them their families and society. So I want to commend you.'",
        "'speaker_1': 'And this this is an absolutely historical moment. That's the reason why I was sitting there and I saw, no, I won't come forward to speak, but it's such a historical moment. I had to speak and say thank you.'",
        "'speaker_1': 'Thank you. Thank you. So you.'",
        "'speaker_2': 'Thank you. Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Vice Mayor. And I'll be brief. I'm simply honored to take part in this historic moment. It's no question that this project will certainly add to our rich cultural tapestry in our city. And it means a lot to see that the whole, you know, that this community is really and embrace this and champion this.'",
        "'speaker_8': 'Over the last decade, it seems like. So this is really a good statement to your leadership. Councilmember Andrews And the fact that this was former redevelopment space that is going to be, you know, a vacant lot that's going to essentially become an amazing, amazing landmark in the community.'",
        "'speaker_8': 'I think it's fantastic. So I'm honored to cast his vote in support of this tonight.'",
        "'speaker_2': 'Council member now.'",
        "'speaker_7': 'Thank you. I am too honored to support this vote. I'd like to thank Councilmember Andrews for bringing this project forward, and I look forward to the fruition of this project and a ribbon cutting. I also like to thank Vice Mayor Lowenthal for allowing my friend Bryant Bennett to take a little extra time speaking.'",
        "'speaker_8': 'And it Bryant Bean, thank you for speaking tonight.'",
        "'speaker_7': 'Thank you for your service to the Cambodian community and to consider the service you continue to provide to our fourth district community. You were in my newsletter last week, so just proves you're still doing things today. Thank you.'",
        "'speaker_2': 'Councilwoman Price.'",
        "'speaker_5': 'Thank you. I, too, want to thank Councilman Andrews for his consistent attention to the needs of the Cambodian community. He has ever since the moment I met him, he's advocating for the community and trying to make us all more educated about the issues that are of importance to his constituents and to such an amazing group of individuals'",
        "'speaker_5': 'who always come out and so gracefully and respectfully share your thoughts and your positions. And I really appreciate that. As someone who sits here and makes decisions, I really appreciate the manner in which you advocate for things. So it's it's something that is very respectful.'",
        "'speaker_5': 'And and certainly this is a huge accomplishment. So congratulations to you as well.'",
        "'speaker_2': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'I'm glad that we're able to honor the Cambodian community. I know that it's been so very long. I'm looking at a lot of these reports and it's going back to 1998 that you had been starting this work. I'm sure it's been much longer than that.'",
        "'speaker_5': 'So congratulations on all of your hard work. And also to my colleague, Councilman de Andrews and his staff, who I know has been very dedicated to this through and through. So congratulations again.'",
        "'speaker_2': 'Councilman Mongo.'",
        "'speaker_0': 'I want to agree with my colleagues and what an example you are to members of the community that have a cause. You unite, you stand together, you turn out the numbers and you work together no matter if the issue is controversial like a few weeks ago or today.'",
        "'speaker_0': 'And I just want to tell you how much I respect each and every one of you. I'm in your opinions, and you're always welcome here. Thank you.'",
        "'speaker_2': 'And I also wanted to extend my congratulations to everyone that has worked very hard to bring this forward. It has taken a very long time, but it's the next installment in our shared narrative. I know that this particular memorial is to recognize the suffering as well as the prosperity of the Cambodian American community, despite the challenges that'",
        "'speaker_2': 'it faced and being here in your new home. But it is our shared narrative. It's a shared tapestry, as Councilmember Richardson mentioned, of our great city. I want to thank you for honoring us with the dignity, as Councilwoman Pryce mentioned, as well as the opportunity to share in your story and giving us the opportunity to celebrate together'",
        "'speaker_2': '. What a dedicated and motivated and inspired group of people can do despite the hardships for all of that. Thank you. Bryant Bean. Thank you. Thank you to all the members of the community that are here, as well as those that are not here, that have been working very hard to have a place here for the Cambodian American'",
        "'speaker_2': 'community. Starting well before Cambodia town and going back to the U.S. in the seventies. And for your tenacity and for your stamina. I thank you. With that, there's been a motion and a second. Members, please cast your vote.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_2': 'So I know that many of you were here for that item. And if you did not want to stay with us till midnight, you are free to go if you'd like, or you can stay and hear the rest of our items.'"
    ],
    "Ordinance Amendment on Billboard Regulations.": [
        "'speaker_2': 'Madam Clerk, I think we go back to item two. Is that correct? That's correct. Okay. There's no oath required. So I'd like to turn this over to our assistant city manager, Mr. Tom Modica.'",
        "'speaker_7': 'Thank you, Vice Mayor, members of the City Council.'",
        "'speaker_2': 'Mr. Modica, maybe we can give folks about a minute to.'",
        "'speaker_7': 'Absolutely.'",
        "'speaker_2': 'Take our leave.'",
        "'speaker_4': 'Madam Vice Mayor, can you say something real quick? Yeah. I also want to recognize the presence of my former chief of staff, Ray Polk, up on top over there, who was one of the only Cambodian chief of staff's in the city of Long Beach with the only one.'",
        "'speaker_4': 'So thank you for being here and your support.'",
        "'speaker_5': 'Read this article and.'",
        "'speaker_7': 'Oh. Part of.'",
        "'speaker_3': 'The conspiracy.'",
        "'speaker_2': 'Thank you, Mr. America.'",
        "'speaker_7': 'Thank you, Vice Mayor, members of the City Council. The staff report would be given by Amy Beauregard, Director of Development Services.'",
        "'speaker_9': 'Mr. Mays just told me that there better be a stellar report because he's not expecting any questions.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_9': 'Madam Vice Mayor. Members of the city council. Tonight, we're here to give some of you a tutorial on our billboard ordinance and others a refresher on what we've been doing for the last year and a half or so.'",
        "'speaker_9': 'The city actually two years. The city council adopted a brand new billboard ordinance in June of 2014, and it was a very laborious process to get to that point, but it resulted in some very significant changes to our existing to our previously existing billboard standards.'",
        "'speaker_9': 'We essentially modernized the code and required that any new billboards require a conditional use permit. We did allow for electronic billboards to be considered in specific places. But as a caveat to that, there was a requirement for taking down existing static billboards in priority order in specific neighborhoods and commercial districts.'",
        "'speaker_9': 'Clearly, the purpose of the billboard ordinance was to incentivize the removal of the approximately 400 plus nonconforming billboards that exist throughout the city and to allow electronic billboards as a legitimate land use within the city of Long Beach.'",
        "'speaker_9': 'So what have we been doing since then is we have removed and had installed through a couple of applicants, a number of electronic billboards. There are two double sided electronic billboards currently in operation one on the 710 Freeway near 12th Street and the other one on the 91 freeway right near the 710.'",
        "'speaker_9': 'We have a another double sided electronic billboard that's approved but not yet constructed. And that would be on a portion of the MTA site that is adjacent to the 710 Freeway. And we have a two single sided billboards that have been conditionally approved, but they do need your concurrence in order to get those approvals.'",
        "'speaker_9': 'Tonight's request is that we make a change to the existing billboard ordinance that essentially amounts to a half a sentence that would allow us a little bit of flexibility in where we place the electronic billboards within the landscape freeway segments.'",
        "'speaker_9': 'And if we move forward with that, we have the ability to remove up to 138 static billboards with that half sentence change and potentially more to come in the future. I want to give you an idea of the progress that we've made to date.'",
        "'speaker_9': 'These are all estimated numbers. We think we have a handle on most of the billboard inventory. But as you probably know, billboards tend to pop up where we least expect them or they've been hidden by trees that get trimmed.'",
        "'speaker_9': 'And suddenly there's a billboard that we didn't realize was in the inventory. So to the best of our knowledge and with the help of of the majority of the billboard industry, we have been able to determine that there's approximately 500 billboard faces in the city as of 2011.'",
        "'speaker_9': 'We believe that last year's inventory, we got it down to about 456 and that if we we get your approval tonight on this ordinance amendment, we will actually be able to get that inventory down to approximately 320 billboards throughout the city.'",
        "'speaker_9': 'We also think that there's a pending application that would remove another 36 plus or minus faces. So that would get us down to approximately 284 billboards in the entire city in exchange for allowing a few electronic billboards on certain locations in the freeway.'",
        "'speaker_9': 'So I want to give you some visuals for what what this billboard program has done for neighborhoods and for corridors. This is right on Artesia Boulevard. You can see that it's a small space, but squarely on the street.'",
        "'speaker_9': 'And this is what it looks like when it's been removed. This is 2069 Long Beach Boulevard. Again, right along the commercial corridor. Notice that it was actually in somebody's front yard. And now the woman sitting on her porch, this one is on the west side, 1400 West Wardlow.'",
        "'speaker_9': 'It was a very large double faced sign. And this is what it looks like now with just one of the billboards removed. The other one on the far right of the screen was also removed as part of a conversion project.'",
        "'speaker_9': 'This is my personal favorite. This was a pretty significant billboard at 1320 Anaheim. I used to orient myself that I knew I was coming up to Atlantic because of this billboard. It is now gone.'",
        "'speaker_5': 'You can see.'",
        "'speaker_9': 'It went over the entire parking lot. So that's my favorite. So what we ended up doing is working with the billboard industry and many of the manufacturers to craft a very tightly worded ordinance. And it was only with the cooperation of the billboard industry and your cooperation that we were able to get there.'",
        "'speaker_9': 'However, we do believe that we are more restrictive in state law in one area and that is causing us some challenges in removing additional billboard inventory. If a billboard is freeway oriented and is within 660 feet of a landscaped freeway segment that's defined by Caltrans, it is considered adjacent and is subject to additional restrictions.'",
        "'speaker_9': 'So essentially, if Caltrans says that a freeway segment is a landscaped freeway segment, regardless of the condition of the landscaping, it cannot have billboards within 660 feet of that landscape segment. This map shows in Gray the landscape freeway segments that are within the city of Long Beach.'",
        "'speaker_9': 'All of the six or five freeway within the city, the majority, essentially all of the four or five freeway as it traverses our city, the majority of the 710 freeway and the majority of the 91 freeway, all of those are considered landscape freeway segments.'",
        "'speaker_9': 'I've overlaid that with our zoning classifications on where we would actually allow billboard conversions and it's a very, very small defined area. So normally billboard development is not allowed in these 660 feet of the landscape freeway segments. However, state law allows Caltrans to give billboard companies credits if they've removed billboards somewhere else in the state, either because'",
        "'speaker_9': 'Caltrans had to acquire it for a street project or they, you know, they just bought the billboard company out for some other reason. When that credit is obtained, then the billboard company can get a Caltrans permit for somewhere else in the state.'",
        "'speaker_9': 'Unfortunately, our city code is more restrictive than the Outdoor Advertising Act, and the use of these Caltrans credits to allow for electronic billboards is actually prohibited within our code. We believe that the proposed change would recalibrate the city's billboard or an ordinance to match state law, allowing the use of Caltrans credits and very specified, very specific landscape'",
        "'speaker_9': 'freeway segments in order to do that. Certainly, if you did not have Caltrans credits, you would not be allowed to construct in those landscape freeway segments. All the other criteria within the zoning code would apply. They are restricted to residential properties.'",
        "'speaker_9': 'They're only allowed in industrial properties. I l I am ig IP and commercial highway and commercial storage zones. So it's a very limited universe of locations that in an electronic billboard can go all. All new electronic billboards would still have to meet the requirements of removal and takedown.'",
        "'speaker_9': 'And there are still the remaining billboard size, height, shape, directional influences, lighting. All of those restrictions still remain. They're not allowed in residential zones. They're not allowed in park zones. Those would remain still off limits. We believe that the only affected areas.'",
        "'speaker_9': 'Again would be a very limited area on this 91 freeway and a small area on the four or five freeway. With that, I am open to any questions you might have. I believe the clerk passed out the red line of the ordinance, and you can see that it essentially just lines up our code to the State Outdoor'",
        "'speaker_9': 'Advertising Act. I'm available for any questions.'",
        "'speaker_2': 'Thank you, Miss Borough Councilman Mongo.'",
        "'speaker_0': 'Yes, Miss Bodak, while I think you said it would still comply with the regional blah blah blah, just in plain language, you would not be able to remove billboards elsewhere and then put a billboard in Long Beach. I just want to be clear on that.'",
        "'speaker_0': 'That that's what the legal easement.'",
        "'speaker_9': 'Correct. You have to remove existing static billboards within the city of Long Beach and use Caltrans credits in order to be able to construct a electronic billboard within the landscape freeway segment.'",
        "'speaker_0': 'Wonderful. I think that this is a great move in the right direction. I know that we still have some billboards in places that they we would rather not have them. I'd like to make one modification to the motion.'",
        "'speaker_0': 'I'd like to include that new freeway oriented billboards shall not be more than 50 feet above the nearest freeway lane. But if my seconder is okay with that, I see a nod. Then I'm very comfortable with the motion and the work you've done.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_9': 'May I just suggest that there may be situations where the billboard company might require a variance due to sound walls or other topographic issues related to that.'",
        "'speaker_0': 'I think that that would go through the COAG process, wouldn't it.'",
        "'speaker_9': 'It would actually be a variance as well as a. If you do put a specific height limit on it.'",
        "'speaker_0': 'Are you stating that there are occasions where we where people would apply for them to be higher than 50 feet?'",
        "'speaker_9': 'Yes.'",
        "'speaker_0': 'I would be open to that. So 50 feet. And then anything above that would require a. Will you remind me what.'",
        "'speaker_9': 'It was there? Variance.'",
        "'speaker_0': 'I wanted to say if you've a variance, that sounds reasonable. Wonderful that I'll take that as my new ocean.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Vice Mayor. And so the 91 freeway runs entirely through Council District nine. This has been something that we've. This has been an ordinance that we watched closely for years. And the intent was really to remove blight.'",
        "'speaker_8': 'A number of blighted billboards, particularly on our corridors. And I remember a number of years back, we literally put up images, some of the same images that we saw today and said, hey, if this ordinance doesn't accomplish our goal of removing these, you know, taking down these blighted billboards, then it didn't make sense.'",
        "'speaker_8': 'And I think it's safe to say that this has been a success. We've seen just the number of conversions so far to the digital. We haven't received any complaints from the neighbors. We've been very open and transparent, particularly with the neighborhoods adjacent to the 91 about this.'",
        "'speaker_8': 'And frankly, residents are really excited to see a number of lots that have been on, you know, vacant lots with billboards in them on Atlantic in the middle of our business district, on our on Artesia in the middle of our business district.'",
        "'speaker_8': 'Those billboards are gone now. And now we can sort of talk about possibilities, community gardens, development, things like that that are possible on these lots. So so I'm very happy with where we are in terms of the changes I'm comfortable with, with what they are based on.'",
        "'speaker_8': 'I truly believe past experience is the best indicator of future performance if we make these adjustments. I'm really excited to see what can particularly what boards can come down. With respect to the The Lamar Project. So, so I'm going to be in support of this and I'm glad to see that the credits for addition will not be'",
        "'speaker_8': 'in lieu of local takedowns. So so I'm glad that that was clarified tonight that, you know, we can't use credits, Caltrans credits, in lieu of the formula that we've established as a council. Thank you.'",
        "'speaker_2': 'Councilmember your anger.'",
        "'speaker_4': 'Longer take you right there. I want to say that this this whole remake of this ordinance is a step in the right direction. And I think it's something that we need to look at carefully. There is a lot of blight out there with the preponderance of billboards that don't serve a real good function or just a lot'",
        "'speaker_4': 'of simply old. There's a lot of those billboards that are not maintained and not updated. So I think this is this would be an excellent way of taking care of that and removing some of those billboards that basically serve no purpose other than as blight.'",
        "'speaker_4': 'In regards to the the amendment, I totally agree with that. I think it's a good it's a good way of being able to not only address the concerns that some communities might have in terms of their height, but also be able to address the the the advertisers who are going to be using those billboards to send their'",
        "'speaker_4': 'message. So I actually support this amendment. Thank you.'",
        "'speaker_2': 'Councilwoman Mongo.'",
        "'speaker_0': 'I just want to thank my colleagues and Ms.. Bodak for the modification and the support. I think that this is a step in the right direction. I think that the less blight we have in our communities, the better.'",
        "'speaker_0': 'I want to thank the our predecessors who started on this path many years ago, and I think that we're moving in the right direction. So thank you very much.'",
        "'speaker_2': 'Thank you. There's been a motion and a second. Is there any member of the public that wishes to address Council on hearing item two? Please come forward and state your name.'",
        "'speaker_1': 'Laurie Angel. I'm pretty familiar with the Billboard situation. I worked on it for years and we made a point of trying to eliminate blight on our landscaped freeways. So now we're going to give that up for the purpose of removing a few more in our neighborhoods.'",
        "'speaker_1': 'And, you know, there are states that don't even allow billboards on their highways at all. But we're going to give up our landscaped freeways for the purpose of taking them off of our corridors. When, in fact, that may occur.'",
        "'speaker_1': 'That's all right. You can look at me or you can look down. That's fine. So I'm just concerned that I mean, the other thing the irony here is that people are earning credits by removing billboards on landscaped freeways.'",
        "'speaker_1': 'And so now they can put billboards on our landscape. Freeways. I mean, what is the logic in that? So I don't really believe in giving up a nice, open, beautiful stretch of freeway for the purpose of accelerating a process that's going to happen anyway over maybe a little bit more time.'",
        "'speaker_1': 'I just think it's extremely short sighted. We have a nice looking freeway now. It's one of the best ones around. But we're okay. We're just going to give it up.'",
        "'speaker_2': 'Thank you. So anyone else seeing no further comment? Members, please cast your vote.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. At this time, we can take up concert calendar items 3 to 14 zero motion. It's been in motion in a second. So any member of the public that wished to address counsel on consent. See members cast your vote.'"
    ],
    "Update on the Proactive Rental Housing Inspection Program.": [
        "'speaker_1': 'Item 15.'",
        "'speaker_2': 'Thank you. Sorry about that.'",
        "'speaker_0': 'Item 15 Report from Development Services Recommendation to receive and file an update on the proactive rental housing inspection program citywide.'",
        "'speaker_2': 'Okay. It's an emotion. And a second. Mr. City Manager.'",
        "'speaker_7': 'Yes? We have a report on the status of this program by our development services director, Amy Barack and her team.'",
        "'speaker_9': 'Madam Vice Mayor, members of the City Council, I'd like to take this opportunity to introduce to you Kurt Keating, my code enforcement officer from the city of Long Beach. And then Lisa Fall, my administrative and Financial Services Bureau manager.'",
        "'speaker_9': 'They have been intimately involved in the implementation of the ordinance since last year, both from a financial perspective, a strategic perspective, and then also the actual implementation of the program. Approximately a year ago, a year ago next month, the City Council adopted an ordinance amending the municipal code by adding a brand new chapter to the municipal code'",
        "'speaker_9': 'related to proactive rental housing inspections. The the program had previously existed. It had been codified under the California Health and Safety Code and had resided for a number of years in the Health Department. But as part of government reform in 2013, that function shifted to the Department of Development Services to better align it with our existing code'",
        "'speaker_9': 'enforcement functions. As a result of the move to development services, there was a desire to go above and beyond what the state's health and Safety Code requires at a bare minimum, and to enhance the program. So we embarked on about a 12 month effort to work with stakeholders on crafting an ordinance that would enhance the type of'",
        "'speaker_9': 'inspections that we do on rental housing. The Council had very robust discussions about this last year and had a number of specific recommendations that were included in the ordinance that was ultimately adopted by the City Council and that we're attempting to implement.'",
        "'speaker_9': 'We have since. So I want to step back and give you an idea of the volume that we're talking about. The city defines rental housing as four units or more. So if someone owns a duplex or a triplex, that is not considered a commercial property within the city's definitions, and this program only inspects or attempts to inspect'",
        "'speaker_9': 'those those units that are either a four plex or greater. We have within the city approximately 7500 buildings that are either a four plex or greater. And it totals about 67,500 units, individual units. And that's just for plex's and above.'",
        "'speaker_9': 'If we were to consider the stock of Triplexes and duplexes, that would result in approximately 17,000 individual properties and 88,000 individual units. We have a goal in the ordinance of inspecting these units in these buildings once a year.'",
        "'speaker_9': 'I will tell you that we have been having a very difficult time with the implementation of the program. Meeting that task, I had hoped that in year one, when we rolled out the program, that we would be inspecting approximately half of the buildings.'",
        "'speaker_9': 'We're closer to a third than a half of the buildings, or I should say we're on target to inspecting about a third of the buildings by the end of this fiscal year. However, we have done a number of other things that the City Council had asked of us last year, and that includes coming up with a comprehensive'",
        "'speaker_9': 'outreach program and a comprehensive communications program related to the to how we let people know about it. We developed a series of door hangers, fliers for both tenants and landlords, translated those into our four language access program languages that the City Council has directed and are distributing those when we go out on inspection calls, when we attend'",
        "'speaker_9': 'community meetings, when we attend resource fairs. We have within my department not only code enforcement, but we also have our affordable housing division. And we have a very close relationship with the health department as well. So these fliers are getting distributed by all of those resources as well.'",
        "'speaker_9': 'The city council also asked us to allocate some of the department's general fund moneys last year to conducting an RFP and selecting a consultant who would actually help us reach out to the more disadvantaged neighborhoods and really get tenants and landlords aware of the program.'",
        "'speaker_9': 'We have recently contracted with the successful bidder, which is going to be the Orange County Fair Housing Association, and we're working with them on. A scope of work that would allow us to reach out to specific neighborhoods in particular.'",
        "'speaker_9': 'The city council also asked us to to prioritize the those landlords that may be more challenging to deal with, that may have units that are subject to frequent complaints or are habitually substandard in some of their compliance issues.'",
        "'speaker_9': 'We do have a a working list of of those that we believe are the more challenging landlords that we're working on. We've also prioritized our inspection areas based on census data that focuses on the age of the housing stock, the population density, the density of the housing units and other census factors, so that we are focusing on'",
        "'speaker_9': 'where we think the most area of need may be. The City Council also asked us to consider a, um, an incentive program for inspections for those landlords or property owners who are better at maintaining their properties, tend not to get code enforcement violations and are generally providing much more habitable conditions for our residents.'",
        "'speaker_9': 'I will tell you that since the rollout of the program has been much more slow than we anticipated, we are not at the point where we we believe that we're capable of of providing a recommendation to you on what that incentive program would be.'",
        "'speaker_9': 'We also discussed the potential for a fee increase. Currently, there is a. I'm looking for. I'm blanking on the word. There is an annual fee that is a tiered fee process so that there are three or four different fee categories, three fee categories.'",
        "'speaker_9': 'So if you own a four plex up to a ten plex building, you pay one fee. If you own an 11 plex to a 20 unit building, you pay another fee. And if you own a building that is 21 units or higher, that's a third tier of a fee.'",
        "'speaker_5': 'The fees equate.'",
        "'speaker_9': 'To about $26 per unit. And I will tell you that that allows us to support a program with approximately 11 full time employees, nine inspectors and a couple of clerical to actually run the program with that level of staffing.'",
        "'speaker_9': 'As I said, we are about a third of the way through the 7500 buildings that we have to inspect on an annual basis. We do believe that a fee increase at some point is necessary. We also believe that a restructuring of the fee so that it is a flat per unit fee is going to be warranted.'",
        "'speaker_9': 'But I'm not coming to you today with that suggestion at this point. We still need to do additional analysis on that fee. We still did commit to having meetings with stakeholders on those fees, but it is something that would be necessary in order for us to continue to move forward with these inspections.'",
        "'speaker_9': 'That summarizes my report. We've provided you a lot of information as part of your staff report, and I and my team are available to answer any questions you may have. Thank you.'",
        "'speaker_2': 'Thank you, Councilman Gonzales.'",
        "'speaker_5': 'If it is okay, I'd like to defer to public comment first.'",
        "'speaker_2': 'Sure, we can do that at this time. We can go ahead and take public comment on item 15, please. Queue up. State your name.'",
        "'speaker_7': 'Good evening. I'm Dr. Ken Roth. You might remember me from December 1st when I appeared before you over housing stability issues at that time. I think that this is a gross waste of money to thank you. This is a gross this is a gross waste of money to inspect these properties.'",
        "'speaker_7': 'What you should do and what this council should do is to enforce state law. I was evicted on and actually won in court because it was I was evicted because I didn't want to have mice in my home.'",
        "'speaker_7': 'I paid for rent for ten months with mice in my home. I paid for rent for ten months with backed up sinks in my home. And so after ten months, I refused to pay rent any further. Given the law, the state law says I can withhold rent until those things were fixed.'",
        "'speaker_7': 'What happened? Instead, they came in, they fixed them and they evicted me. They took me to court and I beat them. I have a student here tonight that is no longer in my classes because she has been fighting the same battle in another district.'",
        "'speaker_7': 'She is a veteran. She is suffering from PTSD. Her sinks are backed up. She can't cook in her home. And when she went out and paid the plumber herself to pick to fix the house and ask her landlord to reimburse her, she was evicted or received eviction that has now been rescinded because I've stepped in and helped'",
        "'speaker_7': 'her with that. I also want to let you know that I have a number of my other students here, journalism students. And could you raise your hands? These are journalism students who are paying attention to what's going on and will probably be future watchdogs in our in our community.'",
        "'speaker_7': 'And I think it's important that that this this council begin to look at the 54%, the majority of residents in this city who are living in untenable conditions, because this body will not simply pass an ordinance to enforce state law.'",
        "'speaker_7': 'All you have to do is enforce the state law. Thank you very much for your time.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'My name is Lianna Noble. I'm a homeowner in the downtown area on fourth near Pine. I'm very active in the North Pine Neighborhood Group. And I found as I was getting ready to think about what I wanted to say tonight, I really thought it was very ironic that in the Long Beach Post today we had a great'",
        "'speaker_5': 'article about how the Newberry Lofts are going to soon be on the market. And that's great. That's one that's a neighbor building. But at the same time, we've got a story in the Long Beach Post about a renter who had similar horrible story to tell and has been living.'",
        "'speaker_1': 'That horror since.'",
        "'speaker_5': 'December of last year. I'm here as a homeowner because what.'",
        "'speaker_1': 'You do.'",
        "'speaker_5': 'Or do not do is are elected officials.'",
        "'speaker_1': 'Impacts.'",
        "'speaker_5': 'My neighbors who are tenants. And that impacts me and my entire neighborhood. And I'm very concerned that while I can hear the the hard work that staff has done, that they're telling us that only 30% of the units have been inspected that need terribly to be inspected.'",
        "'speaker_5': 'I am interested as a homeowner, as an activist in my neighborhood group, to know who the heck are these 87 properties? That evidently must be pretty darn bad that the staff has made a list of them. I'd like to know how many are in my neighborhood, and I understand that there's limitations to what the city staff can'",
        "'speaker_5': 'do or what you, as our elected officials can do about those kinds of slumlords, because that's what they are. They're ripping off my neighborhood and our city. And I would like to know who are the owners of those 87 properties?'",
        "'speaker_5': 'I would like to know what are the targeted neighborhoods based on the criteria that you were using? Because I know that there are many blocks and thousands of renters in my neighborhood who need not only these inspections, but also they need to be protected.'",
        "'speaker_5': 'I'm here tonight as a homeowner because the people who are my neighbors, who are tenants will not speak up because they know if they do, they will be evicted or they'll be threatened with eviction. So there are very important problems here, and they're urgent.'",
        "'speaker_5': 'And I urge you to take stronger and stronger leadership and utilize the public. Think you know what is going on so we can play a role and get rid of these slumlord.'",
        "'speaker_2': 'Your time is up. Thank you. Next speaker, please.'",
        "'speaker_7': 'Yeah. Hi. My name is Bill Hui. I'm the president of the Fair Housing Coalition. We are a civil rights organization for L.A. landlords, and we believe in equality under the law for landlords and renters. This rip and skip thing is very corrupt.'",
        "'speaker_7': 'It lends itself in L.A. Let me just tell you what's happened in L.A. landlords. We have a very unfair rent control system. So you have landlords who are collecting $400 a month rent for an apartment that's worth 15.'",
        "'speaker_7': 'I know the renters like that. That's okay. But what the city does is they come around and they cite landlords for not making repairs and they want the building in pristine condition. When you're collecting $400 a month, you can't do it.'",
        "'speaker_7': 'So what they do is they prosecute the landlords. So a lot of these landlords have put two and two together, say, hey, I'm getting out of L.A. So they sell their older buildings to developers. Now, in the last 15 years, 200,000 apartments, rent controlled older buildings have been torn down.'",
        "'speaker_7': 'At the same time, the homelessness population has exploded in L.A. The L.A. City Council doesn't have a clue how this happened. Just read the numbers. The cities own numbers. They've driven the landlords out of business who were making affordable housing available to poor people by overregulating them.'",
        "'speaker_7': 'So it's a good idea. Going bad now in the state of Minnesota, some of the renters got together with their landlords and they challenged the concept of these forced inspection skip and they won in court. And in Minnesota, scrap inspections are declared illegal.'",
        "'speaker_7': 'So now what's happening is predatory law firms are going Minnesota saying, hey, your your right to privacy was violated. That's like rape. Why don't you sue the city? So now all these people are suing. So we're doing that in L.A. We're going to start running some TV ads to inform renters that their rights to privacy have been'",
        "'speaker_7': 'violated and they're entitled maybe some money from the city. Imagine if a few thousand renters start suing your city for step inspections. We're going to turn the tide. And who doesn't like free money? I mean, people have principles where they can bend them a little bit for free money.'",
        "'speaker_7': 'So what I'm saying is get rid of Skip. I mean, sure, if a landlord there's good and bad landlords, there's good or bad renters for landlords are scum. Lord could go after it, but don't go in every apartment.'",
        "'speaker_7': 'Enforce your way in. Tenants don't like that. Tenants don't like them anyway. And if anybody wants to write to me it's fair housing coalition dot com Bill Hui BLM Joey White EarthLink dot net This is government out of control this step and reap thing and in L.A. the whole reap thing you have a person who's not even'",
        "'speaker_7': 'a lawyer sit in a courtroom, put on a judge's robe and adjudicates to take your rent money away. This is a denial of due process. We're going to Supreme Court with this. In the end, the city of L.A. is going to have to pay a lot of money to a lot of landlords and a lot of renters'",
        "'speaker_7': '. I don't know if you want to bring that kind of liability down in Long Beach. So what is thin ice here? So walk softly. Thank you very much.'",
        "'speaker_2': 'You.'",
        "'speaker_3': 'Good evening. My name is David Kinsler and I am a property owner in both the fourth and second district. And I am one of those people that take the. Being a property owner rather seriously. And as far as I know, since 1992, I have not been.'",
        "'speaker_3': 'No one has ever called code enforcement on any problems in my buildings, since for the last six years, I've been a member of a community group in the fourth District that has gone out on every fourth Saturday to pick up trash from, you know, couches and things from the alley.'",
        "'speaker_3': 'I've painted out graffiti. I've cleaned up weeds and trash from other properties around me. So I'm telling you all this to let you know that whatever decisions you make on this matter are going to affect people like me who are conscientious.'",
        "'speaker_3': 'And I represent the majority of property owners in the city of Long Beach and everywhere else. So I agree. You should be going after the number of people that are consistently violating code, that are constantly getting, you know, things like that.'",
        "'speaker_3': 'But you might consider for people like myself and the majority of other people in my position that maybe if there's an inspection and there's no violations and there's no people calling, maybe we get an inspection every three or five years.'",
        "'speaker_3': 'It'll save the city money. I can take the money that you would have put in inspecting my building into maintaining it the way you'd like to have property maintained in the city of Long Beach. And if any of you ever have any, you know, questions about.'",
        "'speaker_3': 'Anything related to, you know, owning and managing rental property. Again, my name is David Ensler. Thank you.'",
        "'speaker_2': 'Next speaker, please.'",
        "'speaker_5': 'Hi. This has been enlightening. My name is Linda montgomery. I am a property owner. I'm a landlady. And I'm also a realtor in Long Beach for Main Street real estate. We're going to have a problem with investors is one of the things that has not come up here.'",
        "'speaker_5': 'If we have to let them know that any property that they purchased is going to be inspected annually. I agreed with him saying that if a person is inspected and there's no problem with the property, why would you do it every year other than to collect fees?'",
        "'speaker_5': 'And again, with the fees being from 4 to 10 units, I think that's that's kind of excessive and bottom the bottom line on it is, is that if you have had complaints, everyone thinks that, you know, if their tenants complain that we can just snap our fingers and evict them and good luck with that.'",
        "'speaker_5': 'You can't just snap your fingers and evict anybody. It takes months. It takes a lot of money. You you lose money on rent, you lose a minimum of 3 to 6 months rent. And you've got to, you know, go to small claims court.'",
        "'speaker_5': 'It's a nightmare to evict them. And of course, if someone has a clogged up sink or has a problem with their property, if you're a good landlord, of course you're going to fix that because it's your property, it's your business.'",
        "'speaker_5': 'And a good landlord should not be penalized for for the bad ones. And I see that's what's happening here. And you're starting to police the properties. And the next thing we're going to be looking at is rent control.'",
        "'speaker_5': 'And nothing's going to hurt the city more than rent control. I'll tell you right now, it's the only reason we're getting investors to buy now in Long Beach.'",
        "'speaker_1': 'Because we are the last.'",
        "'speaker_5': 'Haven. And let's learn from other cities that made big mistakes. And let's let's stop this ball that's rolling down a hill that's going to cause us a lot of grief for.'",
        "'speaker_1': 'A lot of really good people.'",
        "'speaker_3': 'That's it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Hi, Nashville. I came off stealing the domains here. I'm also United States that, um. I had a situation where slumlord. I'm still going through it. And in retaliation, she didn't ask me to move. Initially, I thought she had rescinded it, but then I found out when I went pay my rent this month on time like I always'",
        "'speaker_1': 'do. Never been. Never been short that she told me she had already rented my apartment to someone else. And I'm trying to figure out how she doing now. What I'm still living in there. But the situation came about retaliation because I asked her to fix the sink and she sent somebody to fix it.'",
        "'speaker_1': 'But two days later it was clogged up again. So I paid for it. And then it was the gas leak. The gas company came out and shut the gas out. She got pissed off at me about that and she said some rinky dink guy to come out there and fix it.'",
        "'speaker_1': 'And I still haven't use my stove. Now, this has been going on a year and my lease has been up and she waited for the lease to be up. She finally fixed it tub, which basically he had painted it with wild paint and it was peeling up and leaking.'",
        "'speaker_1': 'And that's a lead poisoning issue possibly. She ran a motel with that and once she glazed it, she did it the day before in inspection because I call for special inspection. That's why they came out and it didn't pass.'",
        "'speaker_1': 'So then it went to abatement and then, of course, housing authority is gonna pay for that. And it's a game. But it's our retaliation. Just because I actually have something fixed that should have been fixed, I should be able to cook.'",
        "'speaker_1': 'I should be able to come out in my house and have. PS As a student, I couldn't even think my grades was affected. They still affected. My PTSD is affected. And now I got to decided to fight this lady on this eviction, which I know is crap.'",
        "'speaker_1': 'Or try to move, which I got to pay for because I've already used a security. My last place I was in seven years. No complaint. No problems. This one is she's a bully. Any time you fix something, it's a threat.'",
        "'speaker_1': 'I got cussed out when I went in and I pay my rent the month before that. Literally cussed out and slandered. Crack it. I don't drink. I don't smoke. I don't do drugs. I don't even fornicate. For real?'",
        "'speaker_1': 'Yeah, I'm serious. So I don't understand why you driving test drives and trying to lie to me now just because. I'm a college student and I know how to do my research and take pictures and document evidence. She met.'",
        "'speaker_1': 'So I just want peaceful, peaceful. And I know everybody out there ain't a slumlord. But I'm dealing with one. And as of May 31st, I will be homeless if I don't find a place because she refused to rescind it and she won't extend it.'",
        "'speaker_1': 'And like I said, I don't know how you go round from now when somebody's already living in their blessed city came out and found out that the building is unlevel.'",
        "'speaker_2': 'Ma'am, your time is up.'",
        "'speaker_1': 'So she needs. She got some other issues, too. Thank you for.'",
        "'speaker_2': 'Listening. Thank you.'",
        "'speaker_3': 'Sorry.'",
        "'speaker_1': 'My name is Celia McGill. I embraced it in the Long Beach for 29 years. I am here to speak on behalf of a number of the residents who do it to their workstations are enabled to be here in voice their experience.'",
        "'speaker_1': 'Long time ago I was limited, living under the same circumstance, some large conditions where the basic needs of a healthy home are not accessible for a number of residents of Long Beach. The residents could do it or will fear the local landlord.'",
        "'speaker_1': 'Retaliation have indicate they are building copper mine maintenance. It smell like a rats during an infestation they vermin and there is no response to these issues. We had to pull out the rental housing inspection program as a step forward since Broadway this week.'",
        "'speaker_1': 'We need more inspectors in. We need to haul this stuff. Well, thank you very much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Hi. I'm Francis. Emily Dyson Harris and I was driving district by law. I want to commend you for having a proactive rental housing inspection program and listening to everyone talk. There's some very concerning issues and concerns that everybody has.'",
        "'speaker_1': 'I'm sitting here trying to figure out how amicably everyone can be satisfied. The owners, the city and the residents. And it was mentioned that only one third of the inspections had been done. In order to move forward, more money's required.'",
        "'speaker_1': 'Well, maybe you'll have to have some kind of special call meeting to have an emergency thing, to try to figure out a way to get somebody to move forward on the inspections. You know, there's two sides to every story.'",
        "'speaker_1': 'And then the matter regarding concern of retaliation, that is a legitimate concern to the matter, concern of having a rent increases. That concern the matter. I'm wondering, you know, whether or not about having rent control. You know, some people want and some people don't.'",
        "'speaker_1': 'So I just want to say that I'm willing trusting you. You might have to have some type of special commission or task force where you have landlords, renters and people from the city, you know, all together to come up with a solution that's gonna resolve this matter in the fashion that we can move forward.'",
        "'speaker_1': 'Because every human being has a right to shelter, food and water and should be able to have contentment in their spirit. Thank you.'",
        "'speaker_2': 'Thank you, Francis.'",
        "'speaker_1': 'Good evening, Karen. Or Eastside. And I live at seven Pacific at the Park Pacific Towers, which is a subsidized, affordable housing unit owned by the Wylie family. And I'm very fortunate with my housing. I was very lucky to get in.'",
        "'speaker_1': 'It took me a year to get in to my affordable housing, and our building is really well maintained. I know other buildings within the city are not and there is a lack of information on the part of people that live in the affordable housing buildings.'",
        "'speaker_1': 'They're all under the impression if they complain about anything about their units, that they can be evicted. We tried to work with them and tell them, no, that's not going to happen. But I've also lived in a variety of housing throughout the city.'",
        "'speaker_1': 'One place I rented, I discovered, had no hot water, and the person that was in the building in that unit before me had not had hot water for seven years and never complained because her rent was low. She boiled water to wash her dishes every night and she boiled water to bathe her seven, her daughter, which I'",
        "'speaker_1': 'don't know how she could live in that way. Retaliation is a real problem. If you complain about issues. I've had buildings where I have complained and it was not pleasant afterwards. We do have. Major housing issues are starting to have major housing issues in our community as rents escalated and they have been escalating over the past several'",
        "'speaker_1': 'years. People have discovered what a bargain it is to live in to buy property in Long Beach. And we're starting to see incidents. I have friends that are being evicted from their property because new owners have come in and they've decided they're going to redo the property.'",
        "'speaker_1': 'So there's no compensation for them, even though they may be entitled to moving assistance. They're just given the eviction notices. And this is happening more and more in our community. It's really scary to me about what's going on, particularly in the lower income neighborhoods where the property is reduced and people don't understand what their rights are about'",
        "'speaker_1': 'housing. So I think an inspection program is really a great thing to have and maybe might need some adjustments. It's it's new and see and I live next across the street from one of those problem landlords. My gosh, if you can do anything about him.'",
        "'speaker_1': 'Yeah, the neighborhood would love you.'",
        "'speaker_2': 'Thank you. Next speaker, please. My name is Alejandro Costa.'",
        "'speaker_3': 'I live in your district.'",
        "'speaker_5': 'And I'm a property owner. About two years ago, I called code enforcement because one of my tenants was having the ceiling falling down from the water in the bathroom upstairs. It actually took about a year before everything could be resolved, and they ended up finally arresting the man upstairs.'",
        "'speaker_5': 'It was very interesting. Seven police cars in riot gear because they didn't know what kind of a nut that was after he was supposed to go to court, didn't show up in court, got a bench warrant and all that stuff.'",
        "'speaker_5': 'They got a locksmith at 100 and some dollars an hour to sit and wait. Then they were going to bust down the door. And I when they were starting to bust down the door, the guy opened it, said, Oh, hello.'",
        "'speaker_5': 'He ended up going to jail for one night and finally ended up buying out of the building. But the problem was not with the court wood coming out and.'",
        "'speaker_1': 'Having the inspection. It was being backing it up.'",
        "'speaker_5': 'Has an owner. There was nothing I could do. I gave my tenant.'",
        "'speaker_1': '$100 off a month. I built some sort of mechanism to divert the water.'",
        "'speaker_5': 'Very interesting.'",
        "'speaker_1': 'Tubing.'",
        "'speaker_2': 'Taking the.'",
        "'speaker_1': 'Water that stripping off the ceiling.'",
        "'speaker_2': 'Into the toilet very had to be.'",
        "'speaker_5': 'Replaced every month. So just the fact that you're doing.'",
        "'speaker_1': 'Inspections and if you increase.'",
        "'speaker_2': 'Your rent, the.'",
        "'speaker_3': 'Inspection fees, we will just pass it.'",
        "'speaker_5': 'On to our tenants who will be very unhappy. So do you think they really want to be inspected? I have one of my buildings, never had any legitimate inspections. It just seems as though people when they get to the point that they can't pay the rent, they find.'",
        "'speaker_2': 'Odd things to call code.'",
        "'speaker_5': 'Enforcement about. I guess that might surprise you, but it does happen. Thank you very much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'Josh Butler housing language. It's had a few questions about the report and I don't expect them answered at this moment. But we did have a question with regards to the list of unresponsive and non-compliant landlords. There had been initially a request that that list be published and put online, I think in an effort to shame those slumlords'",
        "'speaker_7': 'who are providing inhabitable conditions. There were non-working plumbing facilities, rats, feces, problems that I know these good landlords are not are not putting upon their tenants. But we do have landlords that are and there is a list. And so we have heard that there are legal issues with publishing that list.'",
        "'speaker_7': 'Our question certainly would be, what is that opinion based upon and how are other cities able to publish their lists? The city of Chicago, New York City, they're able to publish their list of bad landlords when people come to their communities and they know who to avoid, what landlords to stay away from, and if there are bad'",
        "'speaker_7': 'landlords, folks that move here should know. We've anecdotally talked to a lot of tenants who are moving down to Long Beach because as people have said, it is affordable and they're ending up in terrible situations and they're ready to go.'",
        "'speaker_7': 'And these are folks that are the first time here. This is their impression of our city, and they think it's lousy. So we think that that's something that we'd like to see happen, is a list of our landlords that should be published, they should be shamed, and people should avoid wanting to be on that list rather than'",
        "'speaker_7': 'taking the time to incentivize the good landlords. Let's use our resources to go after the ones that are really bad, that are causing the problems. If they're good, then there's not a problem. We also have questions about the data that's being collected currently on the inspections and if we're actually what data is being collected so that we'",
        "'speaker_7': 'can measure the success of this program going forward. Are inspectors actually getting in to talk to tenants and what constitutes a completed inspection? When we say that we have completed one third of the of the inspections as that buildings, are we actually getting into the properties and to the units on the properties?'",
        "'speaker_7': 'And if we're not, then I think we have to reexamine why we're not. And I think that we all know that there's been a lot of trust that's broken down between tenants and landlords. We have tenants that are afraid to call their landlord for repairs.'",
        "'speaker_7': 'They're afraid to call the city for repairs because they're going to be they're going to be retaliated against. Those people here tonight that have said they've been retaliated against, you've heard people that have come forward for months who've been retaliated against for making simple, simple requests for simple repairs.'",
        "'speaker_7': 'And they end up out on the street. They end up and they don't go to court. They don't they can't take that risk. It's high risk, low reward for them. They go to court. The high risk is that they lose and they end up on a ten year blacklist.'",
        "'speaker_7': 'And if they win, they could stay in the slum, slum conditions. So they tend to walk away from those situations and try and move on with their lives. And so I think that we owe it to our residents to figure out a program that's actually going to hold our slumlords accountable, that is going to require our landlord'",
        "'speaker_7': 'to do some basic needs if they want to have a Goldstar program and needs to be included in more than just our code enforcement department, you need to include the health department and it's include the police department. If we're going to give out a gold star, it needs to be a true gold star.'",
        "'speaker_7': 'Otherwise it's just a Bronze Star. Thanks.'",
        "'speaker_2': 'Thank you, Josh. So just to let you know, I know that a couple of us have similar questions and so we will have those addressed during our discussion behind the dais. Next speaker, please.'",
        "'speaker_7': 'Hi, my name is Julio Ura. I'm a resident here in Long Beach in the Wrigley District, and I am a real estate broker and also a property manager. I manage properties throughout the county of Los Angeles, so I actually have experience in communities that are both rent control and not rent control and it is very frustrating.'",
        "'speaker_7': 'The whole situation here is very frustrating because even when we were talking about enacting this inspection program. I thought that it wouldn't go that route, and when it did, I felt blindsided. We do have properties that have issues.'",
        "'speaker_7': 'However, we already have large. That if they were followed through, they would take out the players that are harming these properties. Right now we are in a situation where we're listening to a report about being unable to. Do all the inspections when we already knew how many units were going to be inspected.'",
        "'speaker_7': 'We already knew how many people were going to be doing the inspections. It should not have been a surprise that there's no way that you could have done all the inspections in one year. And now you're talking about redoing these things every single year.'",
        "'speaker_7': 'How is that possible? And now you're talking about increasing. The fees so that you can hire more people to do it. It just keeps perpetuating on itself. We live just a few miles away from Los Angeles and looking at communities that already have rent control laws and there are disaster.'",
        "'speaker_7': 'They're a disaster because the program does not work. The units are being taken off of the market. There's less housing. There is increased homelessness. People do not want to invest in Los Angeles. I've got plenty of clients that want to sell their properties and bring them to Long Beach.'",
        "'speaker_7': 'And now we're talking to them about the possibility of bringing those same programs here. It just doesn't work. The intention is good. We want to take care of properties. We want to take care of tenants. But I believe it is short sighted.'",
        "'speaker_7': 'And I believe as you move forward, please speak with people that already have experience working in these programs to see what works and what doesn't. Because right now it seems like we're just kind of paddling along and saying, Let's try this, let's try that.'",
        "'speaker_7': 'It's not a good way to go. Thanks.'",
        "'speaker_3': 'Katie.'",
        "'speaker_0': 'I counsel. My name is. I'm going to read this because I get a little nervous. So. My name is Johnny Weir and I'm a property owner and now a resident of Long Beach. I've been managing and purchasing properties in Long Beach since 1998.'",
        "'speaker_0': 'I've sat in.'",
        "'speaker_1': 'This room and listened to many council meetings I've never shared until now.'",
        "'speaker_0': 'Because I feel that there is a need for me to share. I am.'",
        "'speaker_1': 'Very against rape or whatever.'",
        "'speaker_0': 'You want to call it proactive rental, PR, HIV, whatever you want to call it.'",
        "'speaker_1': 'It's not a good plan. I have a friend in Long in L.A..'",
        "'speaker_0': 'Melissa Cohen lost both of her properties to this.'",
        "'speaker_1': 'Rape. And she was not a slumlord.'",
        "'speaker_0': 'And she was not a greedy landlord, which I've heard people who work at the city refer to us as, which I don't think that that's a very positive way to refer to property owners.'",
        "'speaker_1': 'This ordinance can also be used and abused to defraud good property.'",
        "'speaker_0': 'Owners of their buildings. I urge you to do a little more research before you adopt more legs to this dangerous ordinance. If you'd like to speak with Melissa and a couple other people that have lost their buildings, I can arrange a meeting for you.'",
        "'speaker_0': 'I've heard a lot of tenants here and many other meetings talk about bad landlords.'",
        "'speaker_1': 'I'd like to talk a little bit about.'",
        "'speaker_0': 'Bad tenants because I've had my share of many of them. I'd like to talk about tenants who have have come to my properties and I've given them beautiful units.'",
        "'speaker_1': 'They've just destroyed.'",
        "'speaker_0': 'My beautiful units, brought bedbugs. They've hoarded and I've had to get them out of my properties. These are difficult things to deal with, and I deal with them all the time. It's hard being a good landlord and I do appreciate good tenants.'",
        "'speaker_1': 'Just a couple more things and I'm done.'",
        "'speaker_0': 'Tenants are my customers and I really work hard to give them a good service and product. It's not always appreciated by bad tenants there. There may be a few bad landlords who do not take care of their properties in Long Beach.'",
        "'speaker_1': 'But I know a lot of wonderful property owners.'",
        "'speaker_0': 'In Long Beach and this ordinance is not fair to them or me. This is not the answer to make Long Beach a better city. I've experienced abuse of power.'",
        "'speaker_1': 'With code enforcement several times, and I'm not a slumlord. And this opens up a door that can really harm property owners. I don't think code enforcement needs more power. I think they need less power. Please think about the damage.'",
        "'speaker_0': 'Your actions may cause.'",
        "'speaker_1': 'In strengthening a bad ordinance, and the lawsuits are going to follow that.'",
        "'speaker_0': 'Which is what's happening in L.A.. So thank you for your time. I know I'm a little passionate, but I.'",
        "'speaker_1': 'Also printed out.'",
        "'speaker_0': 'I don't know if you've already got the 13 pages of this ordinance, and I made a copy for everybody in this audience. If you'd like a copy after, I can.'",
        "'speaker_1': 'Give you one so you can read it. One thing in it that's a little creepy.'",
        "'speaker_0': 'Is that.'",
        "'speaker_1': 'We can be imprisoned or put in jail or $1,000 fine, which. Yeah. And we done. Yes. I'm sorry. I'm done. I'm passionate. Thanks so much. Appreciate it.'",
        "'speaker_7': 'Hi. My name is David. We see. I don't know if this is the right forum. How many?'",
        "'speaker_3': 'They've done a third of the inspections.'",
        "'speaker_7': 'What have they found?'",
        "'speaker_2': 'So we don't do question. We don't.'",
        "'speaker_3': 'Do questions. Okay. So we have where do we find that information to?'",
        "'speaker_2': 'We can have a staff member talk to you after.'",
        "'speaker_7': 'Thank you. They never mention that in the council meetings. What they find they do. Thank you. Good evening. My name is Harris Lawless, and I'm a small property owner. I like to share with with you tonight a little personal story which is related to, you know, what is going on with the new ordinance that you try to'",
        "'speaker_7': 'go through with. I believe it was about ten years ago. I was also an owner of a couple small fast food places. And the council woman, Oropeza, decided that she wanted to switch the grading system from the health department to the restaurants from what was then and now to ABC.'",
        "'speaker_7': 'So anyway, there were some meetings in the council on the last do that I win and I talk there was leaning towards changing the system and going to ABC. So I said, Why people want to change the ABC?'",
        "'speaker_7': 'The argument was that couple older people, older people, when they walk by a restaurant, they cannot see the list of, you know, the grading list that the city of Long Beach had the health department. So I said, well, it took you almost three or four years to set up this law.'",
        "'speaker_7': 'And I think me as a business owner and original owner, it's a pretty nice system that you had because you had seven categories food preparedness, maintenance, blah, blah, blah, and everything else. So I said, How much is going to cost you to make the switch?'",
        "'speaker_7': 'I mean, she says $200,000. I said, the city is going to pay $200,000 to change something that, you know, they studied for years. And it works very well because all of a sudden, you know, somebody from the council decided that, you know, so.'",
        "'speaker_7': 'I guess after after the meeting, the vote was 5 to 4 in favor to leave the system the way it was. So now coming to what you're trying to do, this is a very, very touchy subject. I owned the property since 1978.'",
        "'speaker_7': 'I had a property on called a unit and the tenants that were there. After five years, they left and they called the city inspector. So I met him over there. The prop. The apartment was destroyed. So a young person came in.'",
        "'speaker_7': 'He says, What's going on? Look at this. Look at this. Look at this. I said, Just a minute. Let me take you to a unit just.'",
        "'speaker_2': 'In a few seconds. So do you want to summarize?'",
        "'speaker_7': 'Yes, that is for rent. So I work with him on a unit for rent and he says, this is beautiful, you know. I said, Well, that's how this unit was when I rented to these people.'",
        "'speaker_3': 'So anyway, I think.'",
        "'speaker_7': 'Getting into this inspection situation here, you should study it a little bit deeper. Okay. Thank you very much.'",
        "'speaker_2': 'If there isn't any further public comment, I'll take it behind the dice. Councilwoman Gonzalez.'",
        "'speaker_5': 'Yes. First, I have a few questions, and then I do have, um. Some some suggestions and thoughts. So first, I want to thank everybody for their comments. I certainly appreciate the dialog and the comments that we've been talking about.'",
        "'speaker_5': 'Many of this is certainly it's very a hot topic, but it's definitely something I'm very passionate about because I've worked in the city for seven years. I've seen pretty much everything when it comes to housing, both great landlords, bad landlords and everything in between.'",
        "'speaker_5': 'So I'll have a few questions first for city staff. What was the criteria by which their housing was selected?'",
        "'speaker_9': 'So we did a request for proposals and we got a couple of respondents and they were actually the one that met the needs the best. We believe that they had a qualified staff to deal with the translation issues and that they have had similar experiences doing something like this in Orange County.'",
        "'speaker_5': 'Okay. And what are the the what's the time frame for them to work with both the Apartment Association and housing Long Beach?'",
        "'speaker_9': 'So we have been negotiating with them what the scope of work would be and where we would do the outreach. And so we're actually in that conversation right now.'",
        "'speaker_5': 'Okay. So we'll be updated at some point. Yes. Okay. Thank you. And then I noticed in looking at the memo, there were only since there's nine worst landlords, only four were included in the memo. So where are the other five?'",
        "'speaker_9': 'I'm not familiar with that property address.'",
        "'speaker_5': 'Just it says landlord one, two, three, four. But just shows property address cases violations. But there's only four landlords. So I don't feel like we have the full list.'",
        "'speaker_9': 'I do not know if you have a full copy of the memo.'",
        "'speaker_3': 'Oh, okay.'",
        "'speaker_5': 'That could be it, too.'",
        "'speaker_9': 'Because we have. We have a memo that was provided to the city council that does have all nine landlords.'",
        "'speaker_5': 'Listed options and. Mm hmm. Okay, perfect.'",
        "'speaker_9': 'We can get you a copy of that. It does not have the landlord name, but it does have landlord. One, two, three, four, five through nine.'",
        "'speaker_5': 'Perfect. Well, thank you. And then we have over 7500 units to be inspected. That's just including the four plex is in above. We only have nine full time inspectors. And so that would mean that if you were to attribute for each person to be about over 800 units, that each inspector would have to, uh, you know, they'd'",
        "'speaker_5': 'be delegated about 800 units each. So realistically, what would the time frame be to cover all of these inspections? I mean, we're only in, you know, 30%, a third.'",
        "'speaker_9': 'We we are also dealing with a situation where we're also getting reactive calls in as well. So we are figuring those into, um, we have to deal with those cases as well. If they are reactive code enforcement complaints, meaning that an individual has called to lodge a code enforcement complaint if it is for a four plex or'",
        "'speaker_9': 'more. We actually forward that over to the inspectors as well. So the inspectors are not only having to do the inspections on the 7500 buildings, but they're also also responsible for any of those reactive calls that come in over the course of the year.'",
        "'speaker_9': 'We have looked at some averages on what would be appropriate for an inspector caseload, and we think that ranges somewhere between 250 and 300 per year. But given the complexity of of cases, it could be lower or higher.'",
        "'speaker_9': 'We don't quite have that that sweet spot yet with the program.'",
        "'speaker_5': 'Okay. So it seems like it'd be maybe 3 to 4 years until we got through everything with the current staffing model that we have.'",
        "'speaker_9': 'Yes, at our current staffing model, it would take me probably three years.'",
        "'speaker_5': 'Okay. And what kind of technology are we using? I know and I don't know if it was the last budget or a budget before we had, uh, I think we allocated funding for iPads of some sort. So how are those being utilized?'",
        "'speaker_5': 'Because you know what a lot of the comments have been talking about was data collection. Yes. Importance of how are we collecting all that data?'",
        "'speaker_9': 'We are actually doing better data collection because we've updated our forms that have more specificity on the type of information we're collecting when we go into a unit. So we start assessing things like the the number of windows in a unit, the type of flooring materials that may be on it, whether it's carpeting or linoleum or tile'",
        "'speaker_9': '. So we're getting into more of that specificity that we previously did not have. We do have iPads in the field. We are looking to do some internal enhancements with them and link them with our building inspectors on the other side so that we're using the same technology.'",
        "'speaker_9': 'So I do expect that in the next year that we will actually be upgrading our technology for the code enforcement inspectors in the field.'",
        "'speaker_5': 'Okay. Does that mean like new software or.'",
        "'speaker_9': 'Probably more connectivity with our Hanson system, which currently we don't have the ability to do in the field. So that's a key priority for us.'",
        "'speaker_5': 'Okay. Thank you. I appreciate that. And I have a few, uh, suggestions, recommendations I'd like to make, but I just want to, I'd really like to just reframe the discussion because, you know, I know that we're, we've made this some people have made this about landlord against tenant, tenant against landlord.'",
        "'speaker_5': 'And really, I think the spirit of it from what I gathered was to ensure that there were inspections, to fully understand the lay of the land relative to people's quality of life. And essentially, of course, like we've talked about, become more proactive versus reactive.'",
        "'speaker_5': 'Especially serious issues and concerns, and especially with those those landlords that are not taking care of their properties, that are unresponsive to landlords, that are doing a good job in many cases, that are going above and beyond to ensure that their tenants are living in not just good conditions, but great conditions.'",
        "'speaker_5': 'I commend them. I think it's great. We have many of them in the audience as well. And, you know, I've talked to some of them that have said I wouldn't rent a place out in a place that I wouldn't mind living in myself.'",
        "'speaker_5': 'And I truly believe that. And I think if that's the landlord vision for that area, then great. That's exactly what we want here for the city of Long Beach. And I would say, you know, most landlords are taking care of their properties.'",
        "'speaker_5': 'They're doing everything they can to ensure that police isn't coming to their door every 5 seconds. Code enforcement isn't knocking on their door, but it's those landlords, that small percentage that are worsening our neighborhoods, the ones that are cheapening our neighborhoods, they're creating blight.'",
        "'speaker_5': 'They're adding additional city resources that, you know, definitely don't need to be expended on these on these properties. And so I believe that it's time to do a little bit more in that sense. I've suggested some things in the past, but I'd like to do more.'",
        "'speaker_5': 'There's three things I'd like us to work on in looking at this. First, the worst landlord list I believe needs to be implemented. We currently have. So this is a I wanted to share visual with my council colleagues.'",
        "'speaker_5': 'I wasn't happy with the response we received as to why we couldn't implement this list. There's other cities that are doing this. And clearly, as you can see here, we have nine of the worst that have been identified in the city of Long Beach.'",
        "'speaker_5': 'And we could come up with options similar to New York City. These, as you can see here, great visual, but you can see the actual landlord name if there's a property management and the various code violations. These are.'",
        "'speaker_5': 'Massive code violations that are happening. Uh. I think we can I think I can click here. If we go to the next one, you can see 100 worst landlords in New York City. It has a list. Again, their names, the buildings, units, violations similar to what we have on paper.'",
        "'speaker_5': 'But I think it needs to be publicized via a website. And however else we need to publicize it. Last slide. Uh. This is. So when you click on the name, you get this information. You can see the violation.'",
        "'speaker_5': 'You can see the details. The buildings. So I think that with these slumlords slumlords, I'll just call them that. Just like tenants have to be screened. They have to go through a whole process in getting an apartment. I think we should also know and screen certain landlords that are not taking care of their properties too.'",
        "'speaker_5': 'We should be given that opportunity. So. I would suggest that we can come back with some information that would create options similar to New York City, to Chicago, that would look at this worst list. We have nine. If there's more.'",
        "'speaker_5': 'Great. We can add them to the list as well. And also, I would say some of these landlords have commercial property that are the worst in the whole city. And I know I've talked to you, Amy, about a particular person that has the worst in the whole city.'",
        "'speaker_5': 'And he's gotten away with a lot. And a lot of these landlords have gotten away with a lot. So I'm hoping that in addition to this list, that we have their commercial property information as well, because I think that's important.'",
        "'speaker_5': 'To include here. Secondly, it's just an an over kind of view but I think with it's tied into this as well but in. I don't know if it's in here. But there's a link that you click on in New York City.'",
        "'speaker_5': 'And essentially what it does is it gives you a threshold of after so many serious conditions, whether it's you don't have water, you have live wire hanging over your shower, something deeply affecting quality of life. They should automatically be put into nuisance abatement or there should be some sort of threshold because I feel like we don't have'",
        "'speaker_5': 'any standard or threshold whatsoever. So I don't know how that how we do that, but that's my recommendation to the city staff to look at that and see what type of options we have and in that sense. And then thirdly, I do believe in the Gold Star program myself.'",
        "'speaker_5': 'I've been looking at a few different programs for incentives for good landlords. I spoke with the Apartment Association today. We talked about Utah. There's a good it's called good landlord ordinance. And so there's options that we can look at.'",
        "'speaker_5': 'It will lessen the load if you're doing well, and it may take quite a few of those inspections out or lessen some some fees. But I think it's a good way to look at what else we can do for those landlords that are going above and beyond.'",
        "'speaker_5': 'That information. I'd love to get back as well to counsel. And then overall, I would just say working as a field deputy in the first District, I want to know where these properties are on a continual basis. And I think I would assume that many of my council colleagues would agree that during council briefings it'd be good'",
        "'speaker_5': 'to get this information as well to know when, how or why, who these people are. I mean, hopefully we can get to this point where we have a slumlord list, but to have information at each council briefing that gives us a good working knowledge of who these people are.'",
        "'speaker_5': 'And that is it. I want to thank again everybody for their information. I want to thank everybody for their comments. I'm trying to be as comprehensive as possible here because this is very, very important. And I know I've talked to a lot of you on this issue, not just today, but ongoing for many, many years.'",
        "'speaker_5': 'And I want to be very clear. The focus is on those who do not take care of their properties. The focus is is that people are getting retaliated against. I mean, I disagree with some of the comments that it's hard to evict.'",
        "'speaker_5': 'People are getting evicted. I've seen it. I have the information. They're contacting my office. And you just put the eviction notice up and you don't even have to go to court. People will move out because they think they have no other option.'",
        "'speaker_5': 'So I want to leave it at that. I do hope we come back with this information. And I want to thank staff for the information.'",
        "'speaker_2': 'Thank you, Councilwoman Gonzales. Councilwoman Price.'",
        "'speaker_5': 'Thank you. So I want to thank Councilwoman Gonzalez for. One, introducing us to some models that other cities are using that we could use here. I fully support us exploring that option and also for framing the issue in the way that she has.'",
        "'speaker_5': 'I have a couple of questions and was hoping staff could answer these for us because I think I've received a lot of misinformation today, and I think there's a lot of misinformation out there. But can you explain a little bit more in detail the outreach component of this and when that's going to kick off specifically?'",
        "'speaker_9': 'So we are we're instructed by a council to craft an outreach strategy that would go into more disadvantaged neighborhoods or areas. That language has language difficulties and reach out to those tenants in particular to inform them of code enforcement programs in general.'",
        "'speaker_9': 'And so the idea was to be able to provide resources and information to those tenants who may be either afraid to approach the city and call in complaints or don't know how. And so that was what the outreach strategy, the intention of the outreach strategy is.'",
        "'speaker_9': 'We did do an RFP, as I said, and we have selected a vendor that we're intending to work with, and then we'll be working with them to focus our outreach on on specific areas. In addition to that, code enforcement staff goes regularly to community meetings.'",
        "'speaker_9': 'Just next week we're going to the Hamilton community meeting. We have regular meetings with AOC staff, for example, in district to West to all sorts of organizations. Call us and ask for updates on code enforcement issues. We go to those meetings and we receive complaints from the members of the neighborhood associations.'",
        "'speaker_9': 'That's not part of the formalized community outreach program, but that is something that we do on a regular basis. As I said earlier, we've also attended resource fairs, both by the request of housing advocates as well as at the request of apartment association in order to continue that outreach.'",
        "'speaker_5': 'Can you tell me a little bit about the annual inspection component? What is that? What's the scope of that?'",
        "'speaker_9': 'So there's an annual fee and the ordinance calls for periodic inspections. Our goal is to do that annually in order to get rid of a backlog of inspections that we've been carrying since the program transferred over to development services in 2013.'",
        "'speaker_9': 'We are required to and what we do is we schedule inspections with the property owner so that they know the property owner or the management company, so that they know in advance when we will be on site. We we usually give them three weeks notice that allows them the opportunity to notify the tenants that we will be'",
        "'speaker_9': 'on site. We are required to inspect the common areas where required to inspect a minimum of 10% of the units. If we find units that have more than one violation, we have the right to inspect all of the units within the building and look for violations throughout the entire building.'",
        "'speaker_9': 'Part of the data collection is that we are now treating each unit as an individual case instead of lumping it into the same building so that it is allowing us to separate out the data with a finer grain of detail on the inspections and on the potential violations.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'I have to say, I agree with Councilwoman Gonzalez's comments regarding incentive programs. I think those are worthwhile and something that we should be looking into. I personally have an issue with the annual inspections and that component, especially when we haven't even given the outreach and opportunity to to work to see if there's any data that we can'",
        "'speaker_5': 'collect after the outreach. I think that it would be prudent to allow I mean, it's kind of an unusual outreach partnership that we've created. So I think it's it's it's going to be interesting to see what these organizations come up with working together.'",
        "'speaker_5': 'And I actually think that's that's an exciting opportunity for us. So that that's the only kind of component. I'd love to see the outreach get into effect, see how that's working before we start imposing additional restrictions on people who really aren't the subject of this.'",
        "'speaker_5': 'This regulation shouldn't be the subject of this regulation, the good actors. So those are my only comments.'",
        "'speaker_2': 'Thank you. Councilwoman Price, I actually like to go back to Councilwoman Gonzales, the maker of the original motion, and ask if the three items that you had outlined, are you looking for those to be part of the amendment to your motion?'",
        "'speaker_5': 'Yes. I'd like them to come back to the city council within. I would say, uh, 90 days if we can do that, to ensure that we're taking care of the options for the slumlords list or the worst landlord list.'",
        "'speaker_5': 'Looking at strengthening our our thresholds, which also ties into the landlord list. So similar to what New York City is doing, creating a threshold which I think would all be one in the same. And then thirdly, looking at options for a gold star list.'",
        "'speaker_5': 'And that is it.'",
        "'speaker_2': 'Thank you. Council member Yarrawonga.'",
        "'speaker_4': 'Thank you, Mary. One of the most important things about any program that we're going to be implementing is obviously the communication and getting the information out. From the way I understanding this is going is we want to initiate that communication and that information to get it out in various languages.'",
        "'speaker_4': 'So having said that, it appears to me that we are not fully informed in terms of what the impact that program is going to have between once the information is being implemented. So I would I would support that this motion for now, not only because we do need more information, we need to know what's out there, what's'",
        "'speaker_4': 'happening, what's occurring. And having this kind of consultant doing the outreach and get and gathering the data is very important for us at this point. It's also obviously important to know that I think there's from what I heard today, Nancy, seeing people in the audience that there's there's generally some support for this in response to having to'",
        "'speaker_4': 'go out and get that information. Let's let's let's get a lay of the land, so to speak, and then take it from there in terms of how what direction the city wants to take, whether we implement a go step program or not.'",
        "'speaker_4': 'The data will tell us and the information will tell us whether we should implement the A We're Slumlord List or a policy that staff will let us know about that. In terms of what would be the legal ramifications of having such a list being printed and what are the potential liabilities that we would be under if we'",
        "'speaker_4': 'were to do this? And basically, it's it's a situation that lends itself to needing meeting the additional 80 days or needing the more time so that we can look at this more carefully and make a better analysis as to how we want to go.'",
        "'speaker_4': 'I realize that there are some programs out there. People mentioned L.A. not wanting to take up their program here. Does it work? Well, you know, Long Beach, we always consider ourselves very special. That I look at it the other way around.'",
        "'speaker_4': 'I, I see L.A. has been part of Greater Long Beach. But, you know, having said that, you know, we we have to be creative and we have to be innovative in many ways for our own special circumstances. We are a coastal city and we're one of the largest coastal cities in California.'",
        "'speaker_4': 'So we need to look at what the implementation we're going to have when it comes to rental properties and having a monitoring system that would ensure that people who come to live and work and play in Long Beach are getting the best experience they possibly can.'",
        "'speaker_4': 'And that means controlling our landlords and rephrase it, not controlling the landlords, ensuring that our landlords are responsible and being, uh.'",
        "'speaker_7': 'You know.'",
        "'speaker_4': 'I hope, but I opened up a can of worms right there.'",
        "'speaker_7': 'Okay. Let me let.'",
        "'speaker_4': 'Me just say that we I would like to see a program implemented that works for everybody. And I'll leave it at that.'",
        "'speaker_7': 'You know? Fine. Thank you. To Mango.'",
        "'speaker_0': 'Yes. Lena, I want to thank you for recognizing the good landlords, because good landlords that are burdened with less fees can afford to provide better units, more affordable rent. All of the things I know that you and I have had a couple of conversations, a couple of conversations about the things that would be valuable in a Gold'",
        "'speaker_0': 'Star program. And we've talked through that. While some individuals might find it valuable to sit in a meeting that learns about public safety because of where their unit is, another unit on the other side of town might benefit from an incentive program that provides incentives if you reduce the water usage of your unit.'",
        "'speaker_0': 'So for an example, we've talked a lot about conserving water in California in the drought. And when you are a owner of a property and you live in a property, you of course want your water bill to be lower.'",
        "'speaker_0': 'But when it is your tenant's property and your tenant pays the water bill, there's not as many incentives really to go out and change out all the faucets and all the toilets and the drought tolerant plants. So there could even be I know we talked about where Josh go, a Bronze Star, but really a gold star in'",
        "'speaker_0': 'terms of other things that are in the possibilities of setting everyone apart. So I just want to be sure on a couple of things. One, I to stand that bad landlords need to go. They make a bad name for all of us.'",
        "'speaker_0': 'They make it more difficult for us to get valid and good rent. And we need to make sure that bad landlords are out. And so we need to focus all of our attention on them. And with the number of inspectors that we have, we need to be focusing on the bad landlords.'",
        "'speaker_0': 'And therefore, I'm really confused about the word annual. So here's my my comment section of the ordinance passed by this body in June of last year states that it will be periodic inspections. There is an annual fee, but periodic inspections and what I'm hearing was proposed tonight was annual, but we do not have the staffing.'",
        "'speaker_0': 'So we're currently at approximately a three year cycle unless we change staffing. However, what I hear from Councilwoman Gonzalez is that we are not looking to go to an annual inspection program yet. We need to talk about the data.'",
        "'speaker_0': 'We need to talk about the facts. We might never want to go in that direction. We might want to focus on what Councilman Gonzalez eloquently said back in June of last year, which is a more ramped up fee and fine based penalty program for landlords that are bad, bad landlords.'",
        "'speaker_0': 'And to free up the resources, our incentive program, which I think we discussed extensively at the last meeting, is not included here. So when this comes back in 90 days, I would like to see some incentive programs proposed and I would like us to I know you said we're on an annual basis to get through the backlog'",
        "'speaker_0': '. I think that we just need to stop using the word annual. We are not on an annual basis. We are not going to an annual basis. The ordinance instructs periodic and that is the policy made by this Council and nothing else at this time.'",
        "'speaker_0': 'So before we move forward on any regularly scheduled inspections of any time, whether it be every three years, five years, ten years, whatever it may be, I'd like to see the incentive program back before this body implemented and then data evaluating if it's been effective.'",
        "'speaker_0': 'Because I know that a lot of the individuals who came up here today that want to get rid of bad landlords also said, what does the data show? How many units have we inspected already in this year and how many were bad and were the bad?'",
        "'speaker_0': 'The bad actors because of reports in the community, some of which I've been out looking at property and I've made a few myself. Or are they because of random inspections? And so once we know that data, we can be in a better position.'",
        "'speaker_0': 'So just to be confirmed. I did not hear that we are doing annual inspections. Is that. City attorney, would you be able to verify where we are on this motion?'",
        "'speaker_7': 'You're correct in that the ordinance calls for periodic inspections.'",
        "'speaker_0': 'Wonderful.'",
        "'speaker_7': 'Whatever that I mean, that could be annually. It could be every three years. It's whatever the staff they currently said, staff doesn't isn't able to do it annually. The inspection fee is collected annually.'",
        "'speaker_0': 'Well, what I heard from this body today is that we are not looking to move in that direction. If I'm incorrect, I would love for someone to come in and say otherwise. But otherwise. I think the policy direction from this council is to continue to get through the backlog, see where we are, and to have a aggressive'",
        "'speaker_0': 'and supportive incentive program and an even more aggressive bad landlord program. And the reason I say that is because a staff report calls for annual inspections and they did not hear that from this body. And this body makes policy.'",
        "'speaker_2': 'If I could turn this back to the staff, Mr. City Manager, and get a clarification on what staff is proposing, and then we can have a follow up with what the council direction is.'",
        "'speaker_7': 'I'm going to turn that over to Amy.'",
        "'speaker_9': 'Staff is proposing, receive and file of this report that was requested to come before the city council.'",
        "'speaker_2': 'And that's my understanding as well.'",
        "'speaker_7': 'But those three had it.'",
        "'speaker_2': 'No, no. So I just asked the question. Sorry, I didn't mean to do a tennis back and forth. I just wanted to know from staff what they're proposing, which is accurate. And that's in our in the staff report.'",
        "'speaker_2': 'They're just asking they're asking for a receiving file of their report. The motion that was made by Councilwoman Gonzalez is to adopt the report, in addition to adding the three items that she mentioned to come back to the council with information in three months.'",
        "'speaker_2': 'Within 90 days. Correct. Within three months.'",
        "'speaker_5': 'And I think I failed to include in their. If we are going to enhance just some information as to how we're going to enhance our data collection. So what that will look like in terms of Hanson or additional software that will be using to ensure that we are getting the effective information on units.'",
        "'speaker_5': 'Also, just inconsistencies. I know that some code enforcements have gone, code enforcement officers have gone out, no violations found. Another code enforcement officer goes out, 11 violations found. So there's from what I understand, there can be inconsistencies there.'",
        "'speaker_5': 'It will help, I think both landlord tenant, just to have that streamlined, better technology, more information and better data collection. So I would include that as well.'",
        "'speaker_2': 'If I might just go back to the staff again. And so misspoke in the report as staff outlines what the recommendations are. Can you go over what staff's recommendations are as it relates to the subject of annual inspections?'",
        "'speaker_9': 'So based on past discussions with the city council, it was our understanding that the idea was to move towards annual inspections. In order to do that. We are not able to do that with our current staffing levels. We do not make recommendations in this staff report for enhanced fees.'",
        "'speaker_9': 'We do recognize that enhanced fees would be necessary in order to add the additional staff that would be necessary to do the additional annual inspections. As the city attorney did point out. The ordinance calls for periodic inspections that could be every three months, every six months, every 12 months or every three years, depending on on the will'",
        "'speaker_9': 'of the city council. In addition, we do have a reactive code enforcement program that we often visit the same units and do have information and will have information and data on the number of violations that we we record on both a proactive and a reactive basis.'",
        "'speaker_9': 'Our recommendation was to provide an update on the the initiative of the proactive rental housing inspection program, including where we were with hiring the community outreach component and then having a discussion, if you so wish, about adding duplexes and triplexes to to the inspection program.'",
        "'speaker_9': 'We have not previously recommended that in the past. I know that has been a point of discussion with the City Council. So we did again raise that issue in our receive and file report for your consideration.'",
        "'speaker_2': 'So, Mr. Barak, I appreciate that. And just bear with me on page two of five. In the second paragraph where it starts, staff recommends an expanded PR h IP that conducts annual inspections of all 7500 residential. We're often not sure what I said that to us.'",
        "'speaker_2': 'To some of us sounds as though it's a recommendation. And then when you go into the next paragraph, in addition to considering higher fees to increase the number of annual inspections completed, the Council directed staff to consider expanding the program to cover duplexes and triplexes.'",
        "'speaker_2': 'And I do recall that conversation, but hear how it's written. It sounds as though it's a recommendation. And so I think it would be very important for us to clarify that.'",
        "'speaker_9': 'Clarify that in terms of our recommendation or.'",
        "'speaker_2': 'Yes. Yes. The first part the first paragraph I outlined.'",
        "'speaker_9': 'So we were asked last year to provide a statistical report showing the numbers of triplexes and duplexes. We were then further asked in it via a two from four whether or not we recommended moving towards triplexes or duplexes.'",
        "'speaker_9': 'So that is our recommendation. That is for your consideration if you wish to pursue that conversation at a later date. We are not attempting to set policy with this staff report. We're attempting to be responsive to counsel's previous requests for information.'",
        "'speaker_2': 'Okay. So, Mr. City Attorney, in this staff report, when the council receives and files the staff report, it's not taking action on the recommendations that staff is making. We are taking it into consideration.'",
        "'speaker_7': 'That's correct. In order to change this ordinance, you would have to put something else on the agenda to amend the ordinance to either change it from periodic inspections to annual or tri annual or whatever it is that the council would desire.'",
        "'speaker_2': 'Okay. I appreciate that.'",
        "'speaker_0': 'Councilmember Mungo misspoke to reference the paragraph that Vice Mayor Lowenthal said. Would it be fair to state that maybe it was intended to say staff recommends an expanded wrap that conducts periodic inspections of all 7500 residential rental properties, as aligns with Section D of the ordinance passed by this body.'",
        "'speaker_9': 'I'm not really sure where this confusion is. We were asked to report back. We are. We're asked to consider what it took to do annual inspections. And that's what this report contains.'",
        "'speaker_0': 'So you are you are recommending annual inspections.'",
        "'speaker_9': 'We were asked to consider what it would take to do an annual inspection. If we were to if you were to tell us to do an annual inspection, we're recommending to you what it would take for us to do that.'",
        "'speaker_0': 'So as long as we do not approve additional inspection staff, we will not be moving towards an annual inspection program.'",
        "'speaker_9': 'As long as you do not make an amendment to the ordinance requiring annual inspections, annual inspections will occur on a periodic basis based on existing resources.'",
        "'speaker_0': 'Perfect. Thank you.'",
        "'speaker_2': 'And. So just to answer your question, Ms.. Burdick, the confusion comes from the sentence structure of those three lines, because the way it reads, I understand what you would like, where you are stating that the staff recommendations, you are basically responding to our question what it would take.'",
        "'speaker_2': 'And your statement is that it would take additional staff, but the sentence structure says something else. And so that's where the confusion comes from.'",
        "'speaker_9': 'Yes, ma'am.'",
        "'speaker_2': 'Okay. Councilmember Richardson.'",
        "'speaker_8': 'Thank you, vice mayor and and thank you so much to staff for for presenting this tonight. And and I attempted to the tone was really productive in my opinion hearing, you know, both sides housing advocates and apartment owners sort of saying the same thing.'",
        "'speaker_8': 'And what I heard was, you know, we should be more intentional about cracking down on bad landlords. We should protect tenants and we should encourage good, good landlords. And I think that makes sense. And that's sound public policy.'",
        "'speaker_8': 'I have a I have a question about process. My understanding was that initially there was interest in, you know, expanded stuff like reap the program with then this prep was recommended. Initially they came to council through the housing element and this pilot program.'",
        "'speaker_8': 'We were we asked questions and asked for recommendations because this was placed in front of us to consider. Now, I'm unclear on we have a proceeding filed tonight, but I'm unclear on whether we have a pilot program or not.'",
        "'speaker_8': 'So that my first question is moving forward, is there a program? If there is, when does it begin? And and what are the next steps for the city council?'",
        "'speaker_9': 'Yes, sir. There is a program we have been implementing it since last June when the City Council adopted the ordinance into the municipal code. It requires us to schedule inspections on a proactive basis with owners of properties that have four or more units.'",
        "'speaker_9': 'That is a completely separate function from someone calling in a complaint. So we are proactively going out and scheduling inspections of property units, which is a base requirement in the Health and Safety Code of the state of California.'",
        "'speaker_9': 'But this council did expand that program to add a little bit more teeth to it, and that occurred last year. So we do have a prep program. We do do proactive inspections of units in addition to our reactive inspection program, which is complaint driven.'",
        "'speaker_8': 'Okay. So in our proactive inspection, how often are the inspections?'",
        "'speaker_9': 'On our current schedule, it would be once every three years approximately.'",
        "'speaker_7': 'Okay.'",
        "'speaker_8': 'And the recommendation that was outlined in this and I understand the confused confusion about it's not the staff recommendation, but it's a recommendation from staff. This is this says that if we were go to one year, this is what it would require in terms of from a budgetary and staff standpoint.'",
        "'speaker_9': 'It is not proposed fee at this point because we've not had those fee discussions. If you are interested in going to an annual inspection, we would be requiring additional staff.'",
        "'speaker_8': 'I'm comfortable with the recommendation. I think sound public policy means let it do a little bit and work on it. I'm happy with coming back with some of these recommendations, looking at a Gold Star program. But ultimately, I want to have some finality to this on whether we have periodic inspections.'",
        "'speaker_8': 'To me, a proactive program means everyone gets inspected at some point, but it does not make sense to me if, you know, unless there's some trigger, like a transfer of ownership or something like that, it doesn't make sense to go to two annual on every single unit from a workload standpoint.'",
        "'speaker_8': 'Frankly, it doesn't make sense. So I want to make sure that we are clear in our process. So in the next three months we will receive a report on these recommendations will be when will we be in a position to have some finality on what what we're doing in terms of our program?'",
        "'speaker_8': 'Would that be an appropriate time or or do actions need to be taken within our budget?'",
        "'speaker_7': 'Let me jump in right now. Vice Chairman, Council members I think the direction that we have from the council and Councilwoman Gonzales provides that finality will come back within 90 days, answer those questions and the Council will have the opportunity to then give us direction on where they might want to go.'",
        "'speaker_7': 'Anything that would require any type of fee adjustment would be later on in the budget process. But at this stage, I think we can just lay out exactly where we are with rate and then talk about opportunities for the council to give us more direction.'",
        "'speaker_7': 'If they want to go a one year or a three year or two year in implementing and we'll have information on the Goldstar program as the councilwoman asked. And I think we have an out. Thank you. Great.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_2': 'Councilman Gonzales.'",
        "'speaker_5': 'Yeah. I was just going to clarify as posted is that, you know, the hope is that in these three months, we're finally getting to a place where we can come back and see what it is that we can do with incentives, but more importantly, with this worst list.'",
        "'speaker_5': 'And in the meantime, I mean, we're still giving them three months, this worst landlord list. It's still being very generous. So I'm hoping that in these three months, we're really cracking down on these individuals for everything that they've gotten away with, in essence.'",
        "'speaker_5': 'And so I just hope that we're committed to that. I know we will be. But in the three months that come back, I look forward to seeing, you know, options for that, more data collection options. And then, of course, like I mentioned, the opportunities for gold incentives.'",
        "'speaker_5': 'So thank you again.'",
        "'speaker_2': 'I wanted to also follow up on the data collection piece. We had Mr. Butler come to the mike and ask about specificity, Mr. City Attorney, about what data is kept. Are we going to look more deeply into publishing the list that the Councilman Gonzalez mentioned, or there are some legal barriers to it, considering that we've heard that'",
        "'speaker_2': 'other and we've seen with the slide that other cities are doing it.'",
        "'speaker_7': 'You may remember vice mayor remembers the council. Yes. We'll certainly work with staffing and put a report back together. Our concern is where in the process do you release those names? And the further you are in the process, the better we feel.'",
        "'speaker_7': 'Our office feels about the ability, legal ability to.'",
        "'speaker_4': 'Release the names.'",
        "'speaker_7': 'You just can't do it. If there's simply an allegation, you'd probably want to wait for the inspection to be completed, the violations to be reported at some point. There is is the possibility if council wishes to release those names.'",
        "'speaker_7': 'We're just concerned about the due process.'",
        "'speaker_2': 'And I think I can say with confidence that this entire body would support due process and ensure that this doesn't become just a shaming site for allegations made. But really sometimes the last resort for individuals who struggle with the worst case scenario.'",
        "'speaker_2': 'Landlord. And so I do think that that's that's where this council is going.'",
        "'speaker_7': 'Understood. We will work to get something back to you.'",
        "'speaker_2': 'Okay. Thank you. So there's been a motion and a second in the motion is with councilwoman. Councilwoman Gonzalez has three items for request for information to be back to this council in 30 days. Our understanding is also that based on Councilmember Richardson's request is though we are not taking action on defining what periodic inspections are, but at'",
        "'speaker_2': 'at some point in the very near future, that does have to be addressed. With that councilmembers, please cast your vote. Motion carries. Thank you. Okay.'",
        "'speaker_3': 'Okay.'"
    ],
    "Participatory Budgeting Process in Council District 9.": [
        "'speaker_2': 'All right, Madam Clerk.'",
        "'speaker_0': 'Item 16 Communication from Council Member Richardson Recommendation to approve the use of Council District nine Fiscal Year 2016. One time funds in the amount of $10,000 to support the participatory budgeting process in the ninth District.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_8': 'This is a pretty straightforward request. We're in second year of participatory budgeting. We're having wild success with civic engagement. And we want to support that process. We want to continue to support that process. Thank you.'",
        "'speaker_2': 'Councilwoman Mongo.'",
        "'speaker_0': 'I support your protest.'",
        "'speaker_2': 'Thank you. Is there any member of the public that wish to address Council on Item 16? Seeing None members cast your vote.'",
        "'speaker_0': 'Councilman Andrews. Motion carries.'"
    ],
    "Bus Shelter Modernization and Partnership Options.": [
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Item 17 Communication from Councilmember Richardson, Councilwoman Gonzalez, Councilwoman Mongo and Council Member Oranga recommendation to request the city manager to work with the Long Beach Transit Agency to explore partnerships, costs, feasibility and options to update and modernize at varying bus shelters and return to City Council with recommendations within 90 days.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_8': 'This, again, is a straight forward request. You know, we we when we travel to other cities, we like to take take a look at what they're doing this this innovative or interesting or what we can learn. And and, you know, I was just sort of blown away by the ad shelters in Washington, D.C. at the last Fed'",
        "'speaker_8': 'ledge trip. So we did a little bit of research and had some conversations, initial conversations with Long Beach Transit about what can we do to take another look at our our bus shelter, our ad shelters and their condition?'",
        "'speaker_8': 'The public's expressed the need to improve these shelters. I know that we do it. There are you know, we have contracts with CBS and or upfront to advertise and all that. But what we want to do right now is perhaps explore, maybe have a joint committee with Long Beach, Long Beach Transit to explore opportunities to maybe integrate'",
        "'speaker_8': 'some technology or better signage or something that really improves this program that we have. We just tonight discussed, you know, removal of blighted billboards, and that was a focus. And we were able to partner with the industry to achieve that goal.'",
        "'speaker_8': 'And this is something that I'd like to explore here tonight, to partner with the industry, to explore the goal of improving these ad shelters to perhaps, you know, their ideas of having wi fi stations at ad shelters. There are ideas of perhaps doing digital digital displays at shelters.'",
        "'speaker_8': 'And so those are some of the things that I want. I want the city to go ahead, partner with Long Beach Transit to explore.'",
        "'speaker_2': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'I think this is a great program and I look forward to hearing what they come back with.'",
        "'speaker_2': 'And Mr. City managers and staff report on this.'",
        "'speaker_7': 'No, we'd be happy to comply with the request, though.'",
        "'speaker_2': 'Q Councilman Gonzales.'",
        "'speaker_5': 'I just want to thank Councilmember Richardson for bringing this forward, because we've talked about this numerous occasions and how they need to be maintained, just a basic level. But then we can go a bit further and make it a little bit more creative.'",
        "'speaker_5': 'But, you know, some of them there's one on Anaheim in Long Beach Boulevard that, you know, is just in in I think it's the most utilized in all the city are pretty well utilized. And it'd be nice to have an extra element of shade.'",
        "'speaker_5': 'I mean, I know we have some easement issues with the property owner, but some shade or I've even seen like where you've had bookcases. I mean, we can get really creative here and I think it's an opportunity to do that.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_2': 'Councilman Price.'",
        "'speaker_5': 'So, yes, on that note, I wanted to also include the possibility of having art or local art at these shelters, because we often get requests from people to do that. So the scope can be broader than just advertisements that be great.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. I appreciate that. And Councilmember Richardson, thank you for bringing this forward. I wanted to just add a word of caution to staff. I think staff is aware of this. I don't see I see our public works director here as well.'",
        "'speaker_2': 'So the city of Los Angeles expanded its bus stop improvement program with bus shelters and contracted with CBS Taco, which I think is a fine company. And recently it was stated in the paper that many of those agreements fell apart because the city fell short in approving the permits and doing things in a timely manner.'",
        "'speaker_2': 'But in addition to that, I also want us to know that we may have priorities as a council and a city to have amenities at certain bus stops that we believe are high volume, perhaps depressed, economically depressed areas, but they don't necessarily align with advertiser's goals.'",
        "'speaker_2': 'So that might not be the best location for advertisers. And so there is a inherent there can be an inherent conflict between advertiser goals, bus shelter, company goals, city goals, councilmember goals. And so I'd like to hear. How you hope to balance out or ensure that where we think.'",
        "'speaker_2': 'The bus stops near the greatest treatment, as well as limited transit based on volume of activity. How how would you try to ensure that that is what CVS would do?'",
        "'speaker_7': 'Well, a lot of what you're talking about would not be CVS. It would be actually Long Beach Transit. So how they could work to enhance their build their areas in other areas of the city, whether they, you know, back in the day, they did a lot of art, as you're aware of.'",
        "'speaker_7': 'They haven't done some art for a while. So we could talk to Mr. McDonald about that and then also get his ideas about about what we're doing with our ad programs as well.'",
        "'speaker_2': 'Right. So when we look at partnerships as transit agencies, oftentimes we give the opportunity to advertise to companies so that they pay for the infrastructure. So unless you're telling us that Long Beach transit is going to pay for the infrastructure.'",
        "'speaker_7': 'That this transit does, the infrastructure for the non ad bearing busses.'",
        "'speaker_2': 'For the non end.'",
        "'speaker_7': 'And then we help through the advertising company make sure that the ad bearing bus shelters are clean and safe and all that. So those are the things that we're going to pay a lot of attention to, given what Councilman Richardson said, and we'll sit down with them, Mr. McDonald, next week to see where this takes us.'",
        "'speaker_2': 'And that's great. My word of caution from my own professional work is the ones that are ad bearing. We have to be forthright and be sure that there is an equity because what will happen is you'll have bus treatments that are better in places that have greater impressions for advertising.'",
        "'speaker_2': 'And we want to make sure that locations such as the one that the councilman mentioned are addressed. And I know lobbies transit well. We are very different from other cities. I know this. Thank you. Councilman Richardson.'",
        "'speaker_8': 'I think you're right. There is a balance. But we have at varying shelters today, and it looked terrible. And frankly, wherever they are, we need to do something better. Even if it's a static it even if it's what they have today, the standard has to improve.'",
        "'speaker_8': 'We just have to I mean, this conversation needs to happen fairly, but, you know, it's going to take some time, I imagine. So I think we start on it sooner than later. So when this contract comes up again, we have a plan or maybe we even in that contract early and have a strategy.'",
        "'speaker_8': 'But but I tend to agree with your words of caution. I think this will be complex, but we should try it.'",
        "'speaker_2': 'Thank you. Thank you. And is there any member of the public that wish to address Council on item 17? See Nunn members cast your vote.'",
        "'speaker_5': 'Oh, I'm sorry. Something. I apologize.'",
        "'speaker_2': 'Yes, that's okay.'",
        "'speaker_5': 'We're just talking here about add bearing. Is that correct? That's it. So would it be possible to add a friendly amendment for all bus shelters.'",
        "'speaker_7': 'That we were going to talk about all bus shelters with Mr. McDonnell, because specifically the one that you had mentioned is not an ad barring location of. It's certainly very, very busy. We talked a lot with transit before to enhance that station.'",
        "'speaker_7': 'They probably need to do some type of a eminent domain, take on the business to provide more seating or shelter and things. We've had lots of conversation there at that because that's a key bus station there. So we will talk to lobby students about all of our bus our bus shelters on this.'",
        "'speaker_7': 'But again, primarily, we'll look at the ad bearing ones as well.'",
        "'speaker_5': 'Okay, great. And I will say, you know, working with transit, it was great forth. And we were able to work with the Arts Council years ago to get a really nice art piece there. So there's other opportunities available.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_2': 'And there are examples of that in the East Village, too, at the bus stop there. So they do do great work. Thank you for that clarification. Members, cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "EV Charging Infrastructure Policy Update and Implementation.": [
        "'speaker_2': 'Item 18.'",
        "'speaker_0': 'Report from Development Services.'",
        "'speaker_2': 'Recommendation to.'",
        "'speaker_0': 'Receive and file the Sustainable City Commission Staff. Report on electric vehicle charging infrastructure policy and drag the City Manager and Development Services to implement the recommendations relating to EV infrastructure as part of the triennial update to Title 18 of the Long Beach Municipal Code Citywide.'",
        "'speaker_2': 'Councilmember Richardson, would you like a staff report first? Yes. Staff report first.'",
        "'speaker_7': 'Amy Burdick.'",
        "'speaker_9': 'Madam Vice Mayor, members of the City Council, back in November, you asked that the Sustainable City Commission look at recommendations for expansion of electric vehicle infrastructure within the city. The Office of Sustainability in the Department of Development Services worked with the Commission to provide some recommendations to them, which they adopted in March.'",
        "'speaker_9': 'And that's attached to your staff report. If you so approve this, these recommendations that the Sustainable City Commission is forwarding, we would then implement them as part of the Title 18 update, which is required to be adopted by January of this coming January 2017.'",
        "'speaker_9': 'If you have any questions, I'm here to answer them.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_8': 'Great work and thank you.'",
        "'speaker_2': 'Councilwoman Mongo.'",
        "'speaker_0': 'Looking forward to it.'",
        "'speaker_2': 'And Council member Supernormal.'",
        "'speaker_7': 'Yeah. I have just a question of staff in terms of the location. Signal Hill is included here and I was just kind of curious why circle.'",
        "'speaker_8': 'Audi in the fourth district would get one station and then human Nissan in signal hill gets.'",
        "'speaker_7': 'Three. And if.'",
        "'speaker_9': 'So we were looking at the maps of where the available stations are. The Nissan Human actually provides three charging stations on their site. That is a service that they provide to their lessees of electric vehicle cars. It is not free.'",
        "'speaker_9': 'You have to go and actually provide. You can go and charge your electric vehicle there. But you do have to pay a fee. There is a statewide network, an informal network that advises all EV owners of where the nearest charging stations are, and they're clearly listed in that.'",
        "'speaker_7': 'I appreciate that clarification. Thank you.'",
        "'speaker_2': 'Thank you. And I have one question. I'm just scanning the report, see if it's jumping out at me. What is the number of charging stations that the plan includes?'",
        "'speaker_9': 'We currently have 107 throughout the city. What we're looking at is really beefing up the the private sector requirements in the future to exceed the state requirements. So that's the main thrust of our plan. What it would essentially require is that almost all new construction would have to require ev ready infrastructure, which is the conduit at a'",
        "'speaker_9': 'minimum for the EV, but not necessarily the charging stations. So the bigger your construction is, the more conduit and actually the more charging stations you would actually have to implement.'",
        "'speaker_2': 'And then thank you. And then my follow up question regarding the Southern California Edison program, their initial announcement of 30,000 or so new charging stations within the service area, are they still on track for that? And if so, how many would Long Beach get under that?'",
        "'speaker_9': 'We don't have that information. I can provide that to you. I'll have to talk to the Office of Sustainability. Who's tracking that?'",
        "'speaker_2': 'That would be great, because 30,000 sounds like a lot, but I have a feeling these scaled back. So if we could get that back to council in a certain way from that would be great. Is there any member of the public that wishes to address Council on Item 18?'",
        "'speaker_2': 'Seeing None members cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Donation and Distribution of Electric Vehicle Charging Stations from Mercedes Benz USA.": [
        "'speaker_2': 'Item 19 Report.'",
        "'speaker_0': 'From Development Services recommendation to accept a donation of 350 electric vehicle charging stations from Mercedes-Benz and direct staff to develop a program to distribute the charging stations free of charge citywide.'",
        "'speaker_9': 'Madam Vice Mayor, you'll see a theme here. So not only are we going to be boosting our EV requirements in the triennial building code update, but now we have the benefit of a donation by Mercedes-Benz USA of 350 high speed charging stations.'",
        "'speaker_9': 'If you accept this donation, we will be working with the Office of Sustainability to create a program to donate these to eligible property owners. They would be these are residential grade EV charging stations. The property owner would have to pay for the electrical permits.'",
        "'speaker_9': 'Some properties may require upgrades to their electrical panel because these this is to 40, not to 20 and not 110. So we would have to deal with that as well. But the value of this donation is is fairly considerable.'",
        "'speaker_9': 'And we do want to thank Mercedes Benz for their consideration in allowing us to to bring this opportunity to you.'",
        "'speaker_2': 'Great. Thank you, Councilman Mongo.'",
        "'speaker_0': 'Yes. I just am so thankful that Mercedes Benz has continued to be a good community partner since they've moved into the district. They are continually striving to support our neighborhoods, and I think this is just another great example of the work that they're doing.'",
        "'speaker_0': 'So I look forward to that. I do have a quick question. If someone wants to change their. Electrical, what would it cost of a permit of that magnitude?'",
        "'speaker_9': 'B It's about a seven $52,000, but it depends on whether you have to change out your electric panel as well. So if it's an older house, you might have to change out your electrical panel as well and upgrade it.'",
        "'speaker_0': 'Well, I think that considering what a charging station would have cost the homeowner, I still think this is a significant value. So I look forward to hearing the distribution model that will be considered. Thank you.'",
        "'speaker_2': 'Councilwoman Gonzales. Councilman Price. Councilmember Richardson.'",
        "'speaker_7': 'This is this.'",
        "'speaker_8': 'Is a pretty cool program, I think. I just want to say that.'",
        "'speaker_7': 'I.'",
        "'speaker_8': 'Would I would hope that when we craft the program to give them away, we do consider and I have to say this, we do consider equity. I mean, this is a huge investment. Somebody might potentially get 20 $500 charging station.'",
        "'speaker_8': 'So we should think about, you know, making this available to, you know, community, you know, low income communities or communities who may not be able to afford it and afford it otherwise and may consider an electric vehicle because we make this available.'",
        "'speaker_8': 'I don't know how we do that, but I think we should certainly explore it when we craft this program.'",
        "'speaker_9': 'Certainly, I think the Office of Sustainability is very good at providing resources throughout the city, so I'm sure that they're going to come up with something creative.'",
        "'speaker_7': 'Awesome. Thank you.'",
        "'speaker_2': 'Thank you. Thank you, Councilmember Richardson, for raising that. Would you like those metrics or the program design brought back to the council? Not not formally, but as you know to for from.'",
        "'speaker_8': 'I think we should when this happens, we should launch this thing.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Yeah. Okay. So Councilman Mongo and Councilwoman Gonzalez, as part of the instruction to staff, would you be okay with asking them to outline what the lottery program. Framework is and and then have the council involved and in being supportive and active in the launch of the program.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'Sure.'",
        "'speaker_2': 'Is that fine, Ms.. Burdick?'",
        "'speaker_9': 'Absolutely.'"
    ],
    "Ordinance to Adopt and Amend the 2016 California Building Standards Code.": [
        "'speaker_2': 'Thank you. Is there any member of the public that wishes to address Council on Item 19? CNN members cast your vote. Motion carries. Okay. Item 20 Report.'",
        "'speaker_0': 'From Development Services and Fire Recommendation to request the City Attorney to prepare an ordinance amending Title 18 of the Long Beach Municipal Code in order to adopt and amend the 2016 edition of the California Building Standards Code Citywide.'",
        "'speaker_9': 'Madam Vice Mayor, Members of the Council, we are required by state law to update the building code, which is in Title 18 of the municipal code. Every three years the state will come out with their new building code standards on July 1st.'",
        "'speaker_9': 'We need to get the new triennial code in place by January 1st, 2017. We are requesting your permission to work on an ordinance to do that.'",
        "'speaker_2': 'Thank you, Councilmember Richardson. No. Thank you. Is there any member of the public that wish to address Council on item 20? Seeing None members cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Agreement with California Community Foundation for North Long Beach HEAL Zone Initiative.": [
        "'speaker_2': 'We took item 21. Item 20. To.'",
        "'speaker_0': 'Report from Health and Human Services recommendation to execute an agreement with the California Community Foundation on behalf of Kaiser Foundation Hospitals to accept funding in the amount of $1 million to implement the Heals Zone Initiative. District nine.'",
        "'speaker_2': 'Councilmember Richardson.'",
        "'speaker_8': 'I think this is a really proud and proud moment. I was on the on the ground floor as the chief of staff, working with my current chief of staff, Shauna, on crafting heels on phase one. And that was $1,000,000 initiative over three years that really activated and helped and was a driving force with with a lot of'",
        "'speaker_8': 'excitement and engagement with the Uptown Renaissance. And then here we are three years later, we have evidence we can show that we have, you know, active fitness stations in two out of our four parks in our district. We have tremendous things to show.'",
        "'speaker_8': 'And this has been recognized by being renewed as one of a few communities to be renewed for another million dollar commitment. So this is important. This is this is big. This this is you know, we should tip our hats to all the community members involved, to our health department that's involved and really led this because this is'",
        "'speaker_8': 'a this is really a tremendous moment. So so I'd like to just have quickly a quick staff report on some specifics on what how far this funding will go with this grant and what this really means for our department.'",
        "'speaker_6': 'Cleaning. The hills zone to the phase two will allow us to really move forward in terms of transforming the community so we have opportunities to engage in healthier behaviors. We're going to be looking at walking and biking for safer routes, buying affordable fruits and vegetables, fresh fruits and vegetables that are close to home, exercising in parks and'",
        "'speaker_6': 'participating in active afterschool programs. So we had a large you know, a lot of community members come together and determine what the next strategies would be. And as we all know, it's a lot easier to be healthy when you have access to healthy options and you're encouraged to use it.'",
        "'speaker_6': 'What The Hill's on funding is doing is really it's really providing those opportunities. So the key programs for this round are creating a fruit and vegetable exchange where residents can come and sell and exchange their own, the things that they grow, fruits and vegetables in their own yards.'",
        "'speaker_6': 'Activating Northbourne Beach Bike Hub, where we'll be working with community members so that they can maintain their bicycles. They'll participate in bike safety workshops and then do community bike rides. So really making sure people are out exercising. We'll be working to beautify the roads to schools so that students are more encouraged to walk into bike to school'",
        "'speaker_6': 'more often. We're working on street improvements to make sure it's safer for community members to walk and bike. We'll be working with the Jordan High School students to increase healthy eating on campus, creating more opportunities for community gardens and North Long Beach, providing free fitness and nutrition education opportunities in Halton Park.'",
        "'speaker_6': 'Working to increase our access to work and fresh or cal fresh so that people have access to food in locations where they may not otherwise be able to get to them and then enhancing their children's chronic lifestyle prescription program, which means they actually write prescriptions for healthier eating and active physical activity moving forward.'",
        "'speaker_6': 'Um, so those are the key things for the next three years that will be moving forward, building on what was achieved last time. Thank you.'",
        "'speaker_2': 'Thank you. Council member Urunga.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Just a quick question, perhaps, for the council member. A lot of the areas that we look at when we're talking about health zones, there are also a lot of fast food establishments. McDonald's. For your local.'",
        "'speaker_4': 'Those types of stories. We have a lot of fast food and there a lot of temptation because it's convenient. I mean, people don't have to go very far to get food. Is there eventually going to be a through this program to look at the types of new businesses that will be coming in that that are less unhealthy'",
        "'speaker_4': ', less healthy? Well, that's.'",
        "'speaker_8': 'A fair question. We didn't get to focus on that so much in the first round. We did, you know, support a farmers market that lived lasted two years and a mobile farmstand that was at Grant Elementary School. I think there are some opportunities with round two, with phase two giving, you know, the momentum around the success or'",
        "'speaker_8': 'agency properties are finally being developed. So there might be some opportunity that weren't available before that we can explore now in terms of bringing in or having health play a role in the development that takes place in the hills zone.'",
        "'speaker_8': 'So that. So thanks for asking. But yeah, that's an opportunity.'",
        "'speaker_4': 'Because obviously that that is the the biggest issue there is the availability of fast food and and people taking advantage of it because it's convenient. And that's where our health problems arise. But I want to congratulate you on this.'",
        "'speaker_4': 'And, of course, I want to commend the health department for their work in putting this together. There's nothing more meaningful than having an increased ability to exercise. And and that when you exercise you here, you're working your body and you're working your mind as well.'",
        "'speaker_4': 'So congratulations.'",
        "'speaker_2': 'Thank you, Councilmember. Is there any member of the public that wish to address council on this item?'",
        "'speaker_7': 'Good evening, honorable members of the Council and Vice Mayor. I just wanted to find out if I have a suggestion that the program, which Mr. DAVIES and Jose had at Halton Park, be continued. Maybe if that could be a model for bicycle repair, etc..'",
        "'speaker_7': 'I don't believe he's doing that anymore, but it was an excellent program and I just wanted to make that suggestion.'",
        "'speaker_6': 'That program actually is part of this event. Sorry, I'm over here.'",
        "'speaker_7': 'It was called piece 90805.'",
        "'speaker_8': 'It's got a name. It's now it's operator but is back.'",
        "'speaker_6': 'Yeah. So it's back.'",
        "'speaker_8': 'Thank you. Was a part of this.'",
        "'speaker_6': 'Yeah. Thank you.'",
        "'speaker_8': 'It's called, it's called bike uptown instead of bike. 90805 now. Yes.'",
        "'speaker_2': 'Thank you. Is there anyone else that would like to comment on item 22? SINGH None. Members Cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Third Amendment to Contract with Alliant Insurance Services for Healthcare Consulting and Actuarial Services.": [
        "'speaker_2': 'Thank you. Item. 23.'",
        "'speaker_0': 'Report from Human Resources Recommendation to execute a Third Amendment to contract with Alliant Insurance Services for health care consulting and actuarial services and increase the annual contract amount to $325,000 citywide.'",
        "'speaker_2': 'The City manager.'",
        "'speaker_7': 'Our H.R. director, Alex Bass, was.'",
        "'speaker_1': 'This is a recommendation to authorize the city manager to execute a Third Amendment with a contract with Alliance Insurance Services. Alliance provides consulting and actuarial services for a health benefit program. This amendment would extend the term of the contract through October 31st, 2017, and it also increase the annual contract amount to 325,000 on an annual basis.'",
        "'speaker_2': 'Thank you. Councilmember Richardson, you keep.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Okay. Councilmember Urunga. All right. So any member of the public that wishes to address Council on item 23. See Nunn members cast your vote.'"
    ],
    "Response to Request for Proposals for Transit Law Enforcement Services.": [
        "'speaker_0': 'Motion carries. Item 24 Report from Police Recommendation to provide a response to L.A. Metro four RFP Solicitation for transit law enforcement services citywide.'",
        "'speaker_2': 'Councilman. Councilwoman Gonzales.'",
        "'speaker_5': 'I'm just thankful for this information. I know it's been a long. Discussion and having PD possibly enforce our metro stations. And I'm glad to see that we're moving in that direction. Thank you.'",
        "'speaker_2': 'Thank you, Councilmember Your Honor.'",
        "'speaker_4': 'It makes sense. Let's go for it.'",
        "'speaker_2': 'Mr. City Managers or staff report.'",
        "'speaker_7': 'By senior council members. We don't have a lot of information to share yet tonight, but what we're basically asking tonight is just for permission to respond to the RFP. Commander Rich Conant is here and he'll be in charge of that.'",
        "'speaker_7': 'Commander Conant has any brief remarks. Good evening, Madam Vice Mayor and City Council. Item 24 is for an RFP for transit law enforcement services for the Metro Blue Line. The police department is currently completing our staffing model and we will be prepared to present the staffing model on May 28th per the schedule for Metro Metro's RFP.'",
        "'speaker_7': 'We're looking at policing ten stops in the city and it's a great opportunity for the police department to improve the quality of life for our Long Beach residents with our services on the blue line. And I'm available for any questions.'",
        "'speaker_2': 'Thank you, Commander. I appreciate that. I wanted to congratulate city management and the police department for continuing to pursue this. This has been a long running discussion, as Councilwoman Gonzales points out, probably the entire time that we have had the blue line in the city and.'",
        "'speaker_2': 'Definitely not in. In any criticism of the county's efforts, but really acknowledging that it is too much to do. The system is very big and it is a lot of work. And for us to be able to have the opportunity to.'",
        "'speaker_2': 'Patrol and protect the stations that are in Long Beach would be tremendous. And I have to imagine that it can only have a positive impact on our public safety efforts. So thank you for keeping with the goal and I wish us luck.'",
        "'speaker_2': 'The deadline is May 28th, is that correct?'",
        "'speaker_7': 'Yes, ma'am.'",
        "'speaker_2': 'And do you know when they will let us know?'",
        "'speaker_7': 'I do not at this point.'",
        "'speaker_2': 'Okay. That's fine. Is there any member of the public that wishes to address the Council on 24?'",
        "'speaker_7': 'I don't think I can ask questions, but right now the county has the exclusive contract to patrol metro lines and bus metro bus service. And there had been some problems right here in Long Beach that lasted for years with an errant deputy.'",
        "'speaker_7': 'His name was Deputy X. I can't really tell you his real name because probably I could get sued. But he did racial profiling. And I just wanted to know if the sheriff was still going to be involved in this or was Long Beach going to be pretty much taking over unless it was a back up type of'",
        "'speaker_7': 'issue because there were some really serious problems that that defied solution for over two years.'",
        "'speaker_2': 'Okay. So thank you for that. I can answer that briefly and just wanted to share that. The Metropolitan Transportation Authority is the funding agency for the Law Enforcement Services, and so they provided the exclusive contract to the county.'",
        "'speaker_2': 'It seems that as of February 2016, they made. They established an opportunity for local law enforcement agencies to provide transit law enforcement services to support bus and rail operations in the entirety of the L.A. Metro Service area. Sorry, that is a mouthful.'",
        "'speaker_2': 'And so we have the opportunity to bid for that. And so my understanding is that they are interested if local agencies are interested. Is that correct? Commander.'",
        "'speaker_7': 'Yes, ma'am, it is.'",
        "'speaker_2': 'Okay. Thank you. Would that members cast your vote?'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Lit Services Pilot Program and Lease Agreement with Famous Dave's of America.": [
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Item 25 Report from Technology and Innovation Recommendation to authorize the implementation of a lift services pilot program for the provision of Internet services for a period of one year, and to execute a lease agreement with famous Daves of America for the lease of lights lit lit services in an annual amount of $11,988.'",
        "'speaker_2': 'District two may have a staff report.'",
        "'speaker_7': 'Brian Stokes, our technology and innovation director. Vice mayor, members of the City Council in order for the city to provide possible Internet service function to local businesses. The Technology and Innovation Department is proposing a limited one year pilot program to provide broadband services are commonly known as lift services.'",
        "'speaker_7': 'This proposed lease agreement under the pilot program would provide these services to famous Dave's Long Beach. As the initial participant lists, services are including the provision and equipment installation, the management and support of all services that are required to provide high speed Internet access.'",
        "'speaker_7': 'These lift services will allow FEMA's Steve to receive the high speed Internet connectivity while sharing the same conduit as the city's municipal fiber. We are completely segregated. Segregated, and the city networks do not pose any risk for any type of security breach.'",
        "'speaker_7': 'Famous Dave's was primarily chosen for this because of their inability to obtain high speed Internet services from other providers. Also, the proximity of unused city fiber and a minimal cost for the city to configure it. Install the proper equipment on Fima Stephen's premises.'",
        "'speaker_7': 'With that, I'm open to any questions.'",
        "'speaker_2': 'Thank you for that. I wanted to ask just a basic question, but why don't major internet service providers provide service to that location? That is the Pike Circle. And there's a tremendous amount of enterprise going on there. So I'm a little surprised.'",
        "'speaker_2': 'Do we have an answer to that?'",
        "'speaker_7': 'That's that's a very good question you think would be very profitable. But we do not know why they do not, you know.'",
        "'speaker_2': 'Interesting. Okay. And then. Are there other pockets similar to this in the city?'",
        "'speaker_7': 'Yes, we are looking at other areas that could potentially benefit from a municipal run, fiber and connectivity. That's part of an assessment that we are taking. And as the infrastructure the city grows, it could be potential openings for other people to join in on this pilot.'",
        "'speaker_2': 'Okay. And sorry. I don't mean to appear startled. I'm just a little surprised that that that exists. But are there any assessments during the pilot phase of reassessing anything during this phase?'",
        "'speaker_7': 'Primarily for us. It's making sure that we have the capability to provide that type of service. We are bringing an additional capacity to our current broadband access and then we're bringing that over to them. So if it's something that we're able to maintain and that they can use efficiently, then that shows that it's been a successful initiation'",
        "'speaker_7': 'and something we would want to grow from there.'",
        "'speaker_2': 'Okay. Thank you. Thank you for that. And I wanted to mention and he's not here in the audience, but Mr. Schneider, Kurt Schneider, who's the owner of Famous Dave's. I'd like to thank him and his team for being as diligent as they had been in their efforts to get Internet service to their restaurant and hopefully eventually to'",
        "'speaker_2': 'the rest of Pike's Circle. It was quite a surprise for me and my staff to find out that. That was a black hole of sorts for connectivity. So Curt came to our office sometime ago and presented the lack of service and the great need to get it somehow soon.'",
        "'speaker_2': 'While I realize he was speaking specifically for his establishment, I do think opening up this issue to the light of day gives us an opportunity to make sure that the circle is served somehow, one way or another. They have done a tremendous amount to make that a much more attractive location for all of us in Long Beach'",
        "'speaker_2': 'and our visitors. And so I think working on getting connectivity is something that we should do. And I know you're working on it, and I want to thank our team that has continued to try to make this happen.'",
        "'speaker_2': 'And I'd like to applaud you for getting us to our current position. And I'm hopeful that the outcome of this pilot will be positive and that we're able to continue moving forward. I know that a couple of councilmembers have mentioned that there are similar pockets that they're aware of.'",
        "'speaker_2': 'And so it's a good direction for us to move and. Councilman Gonzales.'",
        "'speaker_5': 'I just want to say thank you as well to Brian and his team for staying on this. I know a lot of us have been prodding and asking you about what the next steps are, so I appreciate it.'",
        "'speaker_5': 'Do we have a map of the fiber that we have currently? I know there's been one kind of floating around, but I don't know that we have to have a formalized map at this point.'",
        "'speaker_7': 'We we do have a map of where Cityfibre is currently running. What we don't know or aren't able to yet to provide is what's really available, because we're not yet to the state where we could provide this services to other parts of the city.'",
        "'speaker_7': 'The primary map is mainly covering areas that we do service for our own public inter or our private internet such as police substations, the ECAC, other city facilities that we would want to grow on as part of that master fiber plan to expand and then decide, is this something that the city is capable of performing and moving'",
        "'speaker_7': 'into that arena in the future?'",
        "'speaker_5': 'Okay, great. Thank you for the clarification.'",
        "'speaker_2': 'All right. There's been a motion and a second. Is there any member of the public that wish to address council on 25? SINGH None. Members Cast your vote.'",
        "'speaker_3': 'Bass, man.'"
    ],
    "Report on Drinking Water Quality and Safety in Long Beach.": [
        "'speaker_0': 'Motion carries. Item 26 report from Water Commission and the Water Department recommendation to receive and file a report from the Long Beach Water Department regarding the excellent quality and safety of the drinking water in Long Beach Citywide.'",
        "'speaker_2': 'Councilmember Urunga.'",
        "'speaker_4': 'Yes. Thank you, Vice Mayor. I'd like to postpone this item to next week. I think it's an important public health issue that we need to ensure everybody receives. And given the late hour of tonight's meeting, I think it would be more appropriate if we do it next week.'",
        "'speaker_2': 'I would second that. So there's a motion to move this item to next week. And so any public comment on that? None. Members, cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Ordinance to Require Communications Infrastructure in Excavation Projects.": [
        "'speaker_2': 'New business item 27.'",
        "'speaker_0': 'Communication from Councilwoman Mango Councilwoman Gonzalez and Councilmember Richardson. Recommendation to request the city attorney to draft an ordinance amending the Long Beach Municipal Code to require the installation of communications infrastructure in excavation projects in the public right of way where the city has determined that it is both financially feasible and consistent with the city's long term goals'",
        "'speaker_0': 'of furthering economic opportunity through connectivity.'",
        "'speaker_2': 'Councilwoman Mongo.'",
        "'speaker_0': 'Yes, thank you. I am excited. This policy intends to minimize the number and scale of. The projects that when we install telecommunications infrastructure in the public right away and coordinate efforts to reduce deployment time and duplicative work at the same location.'",
        "'speaker_0': 'So what that really says is when we're lifting up the street to pave it, let's just make sure we have as much infrastructure as we can in that road so that in the future, when we start rolling out this fiber and all the rest of it, that it's already in the ground, and whether we decide to take'",
        "'speaker_0': 'that on ourselves or we decide to lease it out to others, it costs us a minuscule amount to put it in the ground while the ground is already open. So let's just get it done. While an ordinance is being contemplated similar to other local jurisdictions, there's merit to considering changes to the municipal code after a report comes'",
        "'speaker_0': 'back from the city manager. As I am requesting or as we are requesting, laying out the potential roadmap based on current capabilities and the future excavation permit requirements, criteria and options that would align with our goal to prioritize and improve local broadband infrastructure.'",
        "'speaker_0': 'I think that all of us know that connectivity is the next real hurdle. And when you look at the studies of students in school, in their abilities and their achievement, often connectivity is the new barrier. And we need to make sure that every community, every child and every business is connected.'",
        "'speaker_0': 'And so to get to that point, we need to make sure that in that process, we do not overly impact the neighbors by tearing up those streets multiple times and costing extra tax dollars. So. I think I have two or three quick questions that I have on here.'",
        "'speaker_0': 'How might the gas and oil and water departments play a role in the big ones policy, taking into account the objectives of creating synergies and efficiencies across the city departments when planning these large scale capital improvement projects?'",
        "'speaker_7': 'Craig Beck, our public works director, will talk about that.'",
        "'speaker_0': 'Great.'",
        "'speaker_7': 'Vice Mayor Councilmember Mongo I think the best opportunity would be to engage the Water Department Commission directly to have a conversation with them. Both the gas department and Water Department use different methods. Gas Department does a lot of boring when they lay their pipe, unless it's a large diameter pipe.'",
        "'speaker_7': 'Water department typically does open trenching and that might provide more opportunity. So I think part of the staff report would be that we would go to those entities, have a discussion with them and bring that back to council.'",
        "'speaker_0': 'Thank you. My staff have done extensive research in deploying fiber optic cable and we are under the understanding that it would be approximately $27,000 per mile, which has a huge return on investment for us as a community. And so depending on the region, density and specific locations.'",
        "'speaker_0': 'How realistic is it for the city of Long Beach and the Technology and Innovation Department in there working on the financial modeling tool to assist in these cost determinations so that we know exactly what we're getting into in advance.'",
        "'speaker_7': 'Councilmember Mongo, from what we tell with the $27,000 is an estimate is when you do have an open trench and you have the capability to just lay the specific fiber when you do not have that, the prices can range depending on the density and so forth, anywhere from $97,000 per square mile upwards to almost 200,000 per square'",
        "'speaker_7': 'mile.'",
        "'speaker_0': 'So I think that it's important that we look at the DOT numbers and the standards that are across the region in the impact and costs, because the research we have is a bit lower. But either way, what we are finding as Santa monica is 1998 telecommunications master plan stated, and that's still a really good investment for our'",
        "'speaker_0': 'future. So my motion is to have the city manager report back with a road map that would inform an optimal dig once policy before proceeding with an ordinance. Thank you.'",
        "'speaker_2': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'I just want to thank Councilmember Mungo for bringing this forward. I think it's really looking at efficiency in terms of digging once and adding this fiber, and it's in alignment with what we're working on already at Famous Dave.'",
        "'speaker_5': 'So I think it's a great step in the right direction. Thank you.'",
        "'speaker_2': 'Thank you, Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Vice Mayor and and Councilmember Mongo. This is you know, we have we've had conversations. I'm glad to see this item finally come forward. I think it's it's smart timing given there will be hopefully a bunch of trenches in our city.'",
        "'speaker_8': 'And we should really be thinking about digging once and laying down some some smart infrastructure while we're at it. We talked about in addition and thank you for adding this into the into the body of the item. But think about within this roadmap a community broadband strategy so that that helps bridge the digital divide, not simply providing'",
        "'speaker_8': 'to businesses, but expanding, you know, looking at expanding opportunities to disadvantaged communities or perhaps residential potential residential Wi-Fi program. And there's a lot of already great things happening. You know, for example, last year's participatory budgeting, we invested in cameras and Wi-Fi on the Atlantic corridor.'",
        "'speaker_8': 'And that's been you know, we've been working hand-in-hand with technology innovation department to to implement that and is making great progress. Well, how can we make sure that that is a part of a larger citywide strategy to offer broadband or Wi-Fi access to the public?'",
        "'speaker_8': 'Right. We already doing our part. We already do in our libraries. But where where do we go next? So so I'd love for that to be included in in this in this plan. But again, I think this is the language that we need to begin to speak now.'",
        "'speaker_8': 'And this is when we think of infrastructure, we have to think about technology. Thanks.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'Thank you. I had some major work done in my district and for Willow. But it was not us. It was sort of California Edison. So is there a possibility of getting their plants also included in this? Because they're doing some major rewiring, I guess, of their of their services and making them out underground.'",
        "'speaker_4': 'And I don't know if there was any coordination with the city in regards to their program, but it was very disruptive in Willow on Wall Street for about a month and a half, two months. And if we are going to be doing this, I think we need to also include Southern California Edison in terms of what's their'",
        "'speaker_4': 'plans when they want to. Do a major project such as that when they did a will? Is that something that we can do? Are we two separate entities that we can coordinate together on that?'",
        "'speaker_7': 'Got to remember your anger. I think that is a good idea. Certainly in our response back to council, we'll talk about our efforts to coordinate with Edison. We believe it's important to dig once and maintain the structure of the street as long as possible to save our investment and as many utilities as we can coordinate with the'",
        "'speaker_7': 'better.'",
        "'speaker_4': 'I appreciate that. I'm guessing that what they tore up, they put back. But at the same time, I think that would be an opportunity that we can take as well to implement this kind of program. If they're digging it up, let's let's do it together.'",
        "'speaker_4': 'That's where we can put any kind of infrastructure that we need to put in at the same time.'",
        "'speaker_2': 'Councilmember Mungo.'",
        "'speaker_0': 'Thank you. I think that my colleagues brought up a very good point. Where's the future going? And I think that we've seen some great demonstrations recently, a big news article about Huntsville. I know the team is working on lots of things that this will connect with, so I'm just really thankful that my colleagues are supporting moving forward'",
        "'speaker_0': 'with this because as Councilmember Suranga said, let's tear up some streets and well, while we've got them open, let's make sure we provide access. Thank you.'",
        "'speaker_2': 'Being. Q And Mr. City Manager can staff remind me when this is coming back? The draft ordinance.'",
        "'speaker_7': 'They will come back with a two from four perhaps to the city council, as well as the city attorney, and then the city attorney will draft the ordinance. So. Brian and Craig. I think we would request 60 days to turn that all around.'",
        "'speaker_0': 'I'm very comfortable with that. And I think the two from four will at least set the direction that we're going. And I think that that'll get us prepared. And I think that the ordinance is something that's a nice to have and maybe we'll get there.'",
        "'speaker_0': 'But I'm really just looking forward to a policy setting the groundwork of opening up and one day things.'",
        "'speaker_2': 'Thank you. Is there any member of the public that wish to address the Council on 27? See CNN members cast your vote. Motion carries. Madam Clerk, what do we have left?'",
        "'speaker_0': 'Public comment.'",
        "'speaker_2': 'Okay, so any member of the public that would like to address council on items not agenda ized at this time, please come forward.'",
        "'speaker_7': 'Peter Rosenwald I would like to address something that was agenda ized, but I missed it. It was the Tesoro Grant to Labor Leadership Program. Why don't you find out if I could speak on that?'",
        "'speaker_2': 'I'm sorry. Would you? Yes.'",
        "'speaker_7': 'It's permitted.'",
        "'speaker_2': 'If you can speak on.'",
        "'speaker_7': 'The Neighborhood Leadership Program. Grant. It's okay. Yes. If I could just maybe get my 20 seconds back. Of course. I'm truly concerned about the possibility, the fact that the Navy leadership program accepted a grant from Tesoro again this year and the 2013 graduate of the program.'"
    ]
}