{
    "Public Walkways Occupancy Permit for Starling Diner Restaurant.": [
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_0': 'Pushing case.'",
        "'speaker_2': 'Thank you, adam. 14, please.'",
        "'speaker_0': 'Item 14 is a report from Public Works Recommendation to authorize City Manager to execute a public walkways occupancy permit for sidewalk dining at Sterling Diner Restaurant located at 411 fourth is third street district three.'",
        "'speaker_2': 'Thank you again to Councilman Price.'",
        "'speaker_1': 'Thank you. I recommend my colleagues support this item. This is. I know normally we don't have patio dining permits on. We don't take them out of consent. But this is one where the community was very involved and it's at the request of the community that we've pulled the item.'",
        "'speaker_1': 'So I imagine they would like to come and speak to it. I'm not sure. But I will say that we've worked very closely with the community on coming up with the particular design for this patio dining area. I believe the architect is also here.'",
        "'speaker_1': 'The business, the community and our public works department have worked very closely to address the concerns in this for this particular location, because it's located within close proximity to a lot of homes. Have also talked with the business owner who has been very receptive in terms of making some operational improvements that will continue to enhance the relationships'",
        "'speaker_1': 'between the business and the community with this expansion into the patio dining area. So with that, I'd recommend approval by my council colleagues.'",
        "'speaker_2': 'Thank you. Is there any public comment here?'",
        "'speaker_1': 'Yes. Very quickly. My name is Maureen Neely. I'm the president of the Belmont Heights Community Association. And I'd just like to state that we really appreciate the opportunity that the councilwoman prices allowed us to have a public opportunity to speak.'",
        "'speaker_1': 'Fortunately, I think we've covered all of the the bumps and areas that could have been controversial. And we're at the point where we've got a design we can live with. And like the councilwoman said, she's also committed to working with the operator to make sure all of the other smaller bumps about having an operation and right inside'",
        "'speaker_1': 'a neighborhood next door to residences is as painless as possible. So thanks again and appreciate the opportunity to speak. I don't see the architect here, but the design looks pretty good, so. Oh, hey, Nathan. Okay, thank you very much.'",
        "'speaker_2': 'Thank you. Fantastic. And I love to see the see some images at some point. Sounds like a great project. Members, please cast your vote.'"
    ],
    "Presentation on the Century Villages at Cabrillo Social Impact Report.": [
        "'speaker_0': 'Gets motion carries.'",
        "'speaker_2': 'Thank you. 18, please.'",
        "'speaker_0': '18 is communication from Council member Urunga. Recommendation to receive and file presentation on the Century Villages at Cabrillo 2017. So Social Impact Report.'",
        "'speaker_2': 'Thank you, Councilmember Younger.'",
        "'speaker_5': 'Thank you, Vice Mayor. The Villages, the Cabrillo is a wonderful nonprofit organization that provides housing for 2000 individuals there and then the 900 of which plus are veterans. So I'd like to invite members of the association to come up and make a presentation and to cover a little bit more about what they do.'",
        "'speaker_5': 'And it's in the seventh District and they'll welcome.'",
        "'speaker_2': 'Come on forward. You have you have the floor.'",
        "'speaker_1': 'Thank you. Good evening. My name is Kimberly Wee. I am the director of residential services at Century Villages that Cabrillo. And I want to thank you for the opportunity to be here to present our 2017 Social Impact Report.'",
        "'speaker_1': 'As you can see, it looks wonderful. And this is our sixth iteration, and you've probably seen each, each and every one of them. But I wanted to just take a few moments to go through it with you. Of course, I can't go through the entire report, but I want to call your attention to a couple key areas'",
        "'speaker_1': '. And really I'll walk you through the process and give due credit to all of our wonderful partners that help make this wonderful report possible every year. So this is truly a collaborative process at the Villages that Cabrillo, we have more than 20 partner agencies that contribute to this report by providing data, photos, clients, stories and their time'",
        "'speaker_1': 'to make sure that this comes together. This is a ten month process, and we work really hard to make sure that we can give you a really good, succinct, but really vibrant picture of what happens at the villages that Cabrillo and all of this successes.'",
        "'speaker_1': 'So as the councilman mentioned, in 2016, century villages at Cabrillo provided housing and services to more than 2000 individuals, including 980 US veterans. We provide these services with the help of all of our partner agencies and 283 staff throughout the year.'",
        "'speaker_1': 'In addition to the staff people, we have over nine with 995 volunteers and interns that help contribute their time to the villages at Cabrillo. That equates to about 30000 hours of in-kind services that are provided to our residents.'",
        "'speaker_1': 'And all of this support and all of this data that's in this report really is to show you that all of the work that the staff does in all of the work that the residents do to stay housed is a really a collaborative process.'",
        "'speaker_1': 'And it requires a collective impact, the collective impact model that century villages that Cabrillo follows. So we are proud to show, to present this report to you and show you that we have achieved all of our goals in many ways.'",
        "'speaker_1': 'Again, I can't go through the entire report with you, but I hope you will take a moment to go through and and look at the successes. I think one of the things that I like to pull out, especially as my role as director of residential services, is out of the 742 adults that were permanently housed on our'",
        "'speaker_1': 'campus, 99% of them stayed housed after six months, and 91% of them were still housed a year after coming off the streets. That's a huge accomplishment that we credit our partners for. We credit the staff, and most importantly, we credit the resiliency and the hard work of our residents and our community.'",
        "'speaker_1': 'While that number can seem like a very small number and a report, it really represents a lot of hard work on everybody's part. There's also a few new concepts in Social Impact Report this year. It's our civics guiding principle, as I said, is collective impact.'",
        "'speaker_1': 'We've updated that a little bit, and one of the key pieces that we've worked really hard to include is the community's voice and so which we have worked very hard to have authentically engage the community and our residents in our decision making processes on site.'",
        "'speaker_1': 'And as you can see on pages eight and nine in the spread, we really we really engage the residents in focus groups on really what what safety means to them and how we can create a safe environment for them to live and with respect and dignity.'",
        "'speaker_1': 'So the feature story really represents the three focus groups that we did with staff and residents across all of our programs to make sure that we really understood what they need. And several themes that emerged from that is that safety is relative.'",
        "'speaker_1': 'They do feel a lot safer than they did when they were on the streets, that they need to feel connected to their community, to feel safe, that everyone needs to work together to make the community safe. And most importantly, what we found is that the residents.'",
        "'speaker_1': 'We're ready to jump right in there and do what they needed to do to make our community feel safe. And we've we've worked with those concepts and we've expanded on them in our monthly town hall meetings and our community watch initiative and our Pathways to Health Initiative.'",
        "'speaker_1': 'So we are really taking heart all of the recommendations that come from our residents. And as soon as our next building opens, we will be having at least 1500 people on any given day there. And to say that the majority of those residents feel safe and respected, it makes century villages at Cabrillo and all of our partners'",
        "'speaker_1': 'proud. So on behalf of Century Villages and Gabriel and our villages, that Cabrillo Collaborative Partners, I want to thank you for taking the time to look through our report.'",
        "'speaker_2': 'Thank you. Council meeting, wrangling. Final comments.'",
        "'speaker_5': 'Mr. D'Andrea Thank you, Vice Mayor. Council Staff Thank you, Kim. I just wanted to share a few thoughts as we've shared many a time, the magic of what we do out in West Long Beach doesn't reside in any one organization, but it really reflects the rich fabric of organizations public and private, big and small, that have come'",
        "'speaker_5': 'together and banded together around a common goal of of ending homelessness. This report that you had before you really celebrates what was achieved out in West Long Beach over the past year. And the city is a really big player in that in a lot of ways is the is the ultimate backbone to the work that we all'",
        "'speaker_5': 'do. That support comes in many different forms, shapes and sizes and from many departments across the city, whether it's capital support from housing and neighborhood services, rental subsidy, support from the housing authority, supportive service funding from Health and Human Services, general support from planning or building public works.'",
        "'speaker_5': 'The city manager's office there. The city really should be incredibly proud of what's been accomplished out of Long Beach. It's been 20 years since 1997 was when that property was conveyed to our our nonprofit organization. And so next year, we're actually going to be celebrating our 20th anniversary and we'll be looking forward to sharing that with you'",
        "'speaker_5': '. And so much has been accomplished. Clearly, we have lots of work to do, as we all know. And reading the papers and and participating in, you know, council meetings and many community meetings around the city, we're encouraged by some of what's happening.'",
        "'speaker_5': 'We have a wonderful new development called Anchor Place that'll be coming online here within hopefully about a month or so, providing homes to 120 formerly homeless households, including veterans and families. We've just updated our master plan that will hopefully shape development at the villages over the next 15 to 20 years.'",
        "'speaker_5': 'We have lots left to do there and then I think our work in West Long Beach has really served as a springboard for our work throughout the rest of the city. We're excited about the beacon that we just celebrated the groundbreaking for a few weeks back.'",
        "'speaker_5': 'We have another project. We're working very closely in Council District one called Beechwood, a really nice renovation of A and all HUD property. So like like many communities around the state, Long Beach clearly has has challenges. We're encouraged by the leadership of the council, the mayor and the staff in terms of the the Affordable Workforce Housing Study'",
        "'speaker_5': 'that was recently published. And we look forward to continuing to play a role with the city and helping make a difference. Thank you.'",
        "'speaker_2': 'Thank you. Any closing comments?'",
        "'speaker_5': 'Yes. I want to thank the members of the Villages DiCaprio team, Renee Castro, Steve Coleman. And there is a step rather wonderful work they do. It's a wonderful project to have in West Palm Beach. And and it's the holistic approach that you use in making sure that your residents receive all the services that they need to keep'",
        "'speaker_5': 'them on their feet and keep them striving and and and being a good citizens for the Syrian army. So I wanted to commend you and thank you for your work. Thank you.'",
        "'speaker_2': 'Thank you. So we have a few comments from the council. I'll just say this is once again another great social impact report. You had a few people behind the dais breaking it down as soon as it was handed out.'",
        "'speaker_2': 'So continue this good work. And, you know, and just, you know, switching hats to my AG folks, I mean, you guys are leading the way on cap and trade. People are still trying to figure it out. And here we are in Long Beach, the century villages.'",
        "'speaker_2': 'Cambria has been successful twice. And while while communities are still figuring out how to get their fair share. Long Beach, Southern California. Although we make up 65% of disadvantaged communities, we only receive 30% of the of the cap and trade funding.'",
        "'speaker_2': 'So you're doing something right and it's a model that other communities can pay attention to. And so continue the good work. We have a few speakers here. Next is Councilwoman Price.'",
        "'speaker_1': 'Thank you. I want to echo the comments of the vice mayor and Councilman Aranda. This is really impressive. I can't wait to actually be able to read it and pay attention to it. So thank you very much. You know, I was reflecting and I was just talking to Jack.'",
        "'speaker_1': 'He's going to reach out to you because I think it would be really worthwhile for my community to have you guys come and do a presentation at one of our community. Meetings and educate them because we talk about you a lot and we reference you a lot.'",
        "'speaker_1': 'But the great work that you're doing every day, I think a lot of the residents don't know about. They often will post things on social media that points to other cities. You know, why don't we try this or why don't we do that?'",
        "'speaker_1': 'And I have to go back and say we are actually doing that right now, and I want them to your website so that they can see things. But I think it would be worthwhile to have you do a presentation if, well, obviously our district would want one.'",
        "'speaker_1': 'But even citywide, I think it's really important and I know that you have taken the time to give tours of your facilities to staff of council members. I know that my team and I would like to come and do one soon.'",
        "'speaker_1': 'We've heard nothing but amazing things. The work that you do and the products that you provide in terms of sustainable, long term support and a life changing infrastructure is really to be commended. So thank you very much for everything that you do and addressing an issue that's really complex and presenting a lot of public policy challenges to'",
        "'speaker_1': 'cities all around the nation. You're helping us really address some of the long term sustainable tools that we all should be mindful of. So thank you very much. I appreciate you being here tonight. I thank my colleague for bringing this forward and educating us and reminding us of the great work that you do.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Pearce.'",
        "'speaker_3': 'I yes, I also, of course, would like to echo a lot of the same comments. And I think what makes you guys so unique is that you are that hub for partnership. You know, that you have so many organizations at the villages that are working on a holistic approach to a population that really, when they have the'",
        "'speaker_3': 'support, thrives. And it's an honor to see this in Long Beach and I, my first year in office has been a exciting year in office and frustrating year and trying to get my hands around the homelessness challenge, the mental health challenge and all the resources needed and all the things have to fall into place to make magic'",
        "'speaker_3': 'happen. And that is why the Villages experience is so unique and so amazing for us to look to as a model and to learn from. And so I want to thank you guys for being a resource to me and my staff for the tours that we've been able to take and understanding everything that goes on and anything'",
        "'speaker_3': 'that we can do, as you guys know, thinking outside the box around resources and dollars, and how are we as a city saying, let's invest in this model, whether it's at your location or other locations where we can really capitalize on the success that you guys have have laid out.'",
        "'speaker_3': 'And I want to say congratulations also for being forthright and honest and doing surveys and relaying that information in these surveys around how residents feel and what you guys are doing to address that. And so just congratulations on on being really thoughtful and thorough.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_2': 'Thank you. Councilmember Gonzalez.'",
        "'speaker_1': 'Yes. I, too, want to say thank you for all the work that you do. The Social Impact Report. I tell my residents that it gives us a really good snapshot of who are serving in the city of Long Beach and not just to the cost benefits, but the people that we're serving.'",
        "'speaker_1': 'You know, we see here single mothers, single fathers with children. We can never even imagine children being out on the streets. But unfortunately they are and they have been in our city. And so we're serving those individuals needs.'",
        "'speaker_1': 'And we couldn't thank you enough for all the resources you provide. Very excited about Beacon and very excited about Beechwood. Two other fantastic projects. Thank you again.'",
        "'speaker_2': 'All right, so any public comment on this item? Now be a time. Come forward. Please come forward. You have 3 minutes.'",
        "'speaker_4': 'All right.'",
        "'speaker_2': 'Thank you. Please give your name and you have 3 minutes.'",
        "'speaker_8': 'Oh, can I get going first so I can get a light on, but I can't. It's like he wants to rush. Hey, you did that last time the mayor was in New York. Don't hassle me this time, anyway.'",
        "'speaker_8': 'Give an honor to Jesus. I mean, I hear what everybody's saying, and that's good with villages of L.A., Mr. Andrew. All right, I hear that's cool. You know everything. But then you talk all this good, comfy stuff. I asked last time, what happened to the 50 million?'",
        "'speaker_8': '25 million? You pass 25 and then the homeless ever heard of this stuff? So I hear all this nice talk and I see no action because I see money bleeding from this piece every week. Bleeding. I hear the people blaming gentrification is the rich white folks, but it ain't the rich white folks.'",
        "'speaker_8': 'Because I see a man whose parents is illegals. He's always bragging on that. I see a vice mayor who I don't see doing anything for black folks. Straight up, man. I'm beyond the jokes. I see another black guy, they told me Muslims are Christians.'",
        "'speaker_8': 'Heads, offices, brothers. Yeah. You, Al, you say that by the elevator. Don't try to.'",
        "'speaker_2': 'Address the chair, please.'",
        "'speaker_8': 'I'm addressing you. And the chair is the chair.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_8': 'Anyway, I'm doing stuff. Then we got. Oh, Karl Marx. Always eaten up at first.'",
        "'speaker_2': 'Just keep it focused right here on the because.'",
        "'speaker_8': 'I'm focused on the whole lot because this is what we deal with communism. I don't like this comment.'",
        "'speaker_2': 'I don't think that's on subject. I think you're off.'",
        "'speaker_8': 'Communism is a subject you try to change the government from. The Great White time is too ism. So this is subject. That's what I'm saying. And so all this all this mumbo jumbo and stuff you talking, you cannot keep it real.'",
        "'speaker_8': 'You on a socialist agenda. The man that was mayor, he took money from conservatives and turned. Indeed, if he failed Castro, which I miss, Mongo stopped me from saying that.'",
        "'speaker_5': 'Mr. Mayor, this topic is off topic, but, you know, every priest is.'",
        "'speaker_2': 'You actually. You don't have.'",
        "'speaker_8': 'To shoot nobody up. So you can turn around, walk away, whatever. You ain't running nothing.'",
        "'speaker_2': 'So let's try to be more secure.'",
        "'speaker_8': 'In Jesus name. There is justice. And there will be justice. So change your ways up. And as far as you Republicans are up here. When Republicans start going unanimous with them every time. I'm serious.'",
        "'speaker_2': 'We went off topic list.'",
        "'speaker_8': 'I know this is on top. Okay, I'm back on topic. Thank you. It's a nice thing, but get it right or we're getting rid of you and I'm especially being a bum watching you. I'm especially why she stood for the union for black people.'",
        "'speaker_8': 'That's what you do. Hey, well, you know. All right, these people, you didn't prosecute to prosecute.'",
        "'speaker_2': 'This, right? That's enough, so you better get rid of it. Thank you for remaining.'",
        "'speaker_8': 'You know.'",
        "'speaker_2': 'Right. So, yeah, we're done. So let's move forward. So saying no further is any further public comment. You guys tell the same non members. Please cast your vote. Trump.'",
        "'speaker_8': 'Donald Trump. That's what I'm saying. I'm coming back.'",
        "'speaker_0': 'Catch my reprise, which in case.'"
    ],
    "Agreement with County of Los Angeles for Bioterrorism Preparedness and Public Health Infrastructure Development.": [
        "'speaker_2': 'Thank you. We will move politely and delightfully on to item number 19.'",
        "'speaker_0': 'Item 19 is a report from Health and Human Services, a recommendation to execute an agreement with the County of Los Angeles for a contract term effective June 1st, 2017 to June 30th, 2018, and accept funding in the amount of 898,000 to provide bioterrorism preparedness and public health infrastructure development citywide.'",
        "'speaker_2': 'Thank you. And this is a great item. Councilman Austin, would you like to speak to it?'",
        "'speaker_7': 'No, but I'd like to get a staff report.'",
        "'speaker_2': 'All right, let's have a staff report. Mr. West.'",
        "'speaker_5': 'So Mayor council members, this is a county grant that we getting to help us with funding in the amount of $890,000 to provide bioterrorism preparedness and public health infrastructure development. The additional allotments for fiscal year 1718 will be used to build on these efforts, strengthening the city's capacity under the core public health preparedness capabilities established by the'",
        "'speaker_5': 'CDC, including community preparedness, emergency operations coordination, emergency public information and warning, emergency information sharing and mass care, medical countermeasures, dispensing medical material, management and distribution. And we recommend approval.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_7': 'Thank you for reading that back. Mr. City Manager.'",
        "'speaker_2': 'But a fantastic staff report.'",
        "'speaker_7': 'This is for the public benefit to get the past staff report we all have in front of us. And I think it's a great item and I encourage us to support it as well.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Tells me Ranga, as a former employee with the Department of Health and Human Services, I'm very proud of the services that they provide and the grant that they go after to make sure that we have that we are prepared if in the event of any major catastrophe.'",
        "'speaker_2': 'Thank you. I think probably comment on this item.'",
        "'speaker_5': 'Very good. The way that the phrase it captured my attention was bioterrorism. On hearing that and my sense is what we should do is take the U.S. flag, turn it upside down and fly it. This city can't even deal with normal day to day crime, let alone bio terrorism.'",
        "'speaker_5': 'That came that was self-evident a few weeks ago. And the good Councilwoman Pryce had the city staff present their views relative to budgets in policing and so forth, and it was clearly evident to any reason to mind. That the our police department now.'",
        "'speaker_5': 'It's a classic case of denial of the first order. It's not that they don't know. They don't know. They don't know. They cannot even control simple crime in this city. They cannot clueless as to the problems with the MTA.'",
        "'speaker_5': 'Period. How in God's name are they going to deal with bioterrorism? This turns to the argument into the case. For asking for before it's forced upon you, a federal master to oversee the city's, oversee the city and the police department until such time as it gets itself squared away.'",
        "'speaker_5': 'Period. We're a sitting target. For any of biotech, for anybody interested in that type of product, all they have to do is look at this functionality. Other police department. And too often too many members of this council. Period.'",
        "'speaker_5': 'I'm very serious on this. Step up to the plate. Request a federal master to guide you through and to show you the things that you don't know. You don't know. Thank you.'",
        "'speaker_2': 'Thank you. I see one additional person in line. Two additional people in line. Speaker's list is closed.'",
        "'speaker_1': 'I can't let that go.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'My name is Karen Whiteside and I'm a resident of the First District. And as someone who has gone through the training and gone to training sessions at the Emergency Preparedness Center, I can totally say that the previous speaker does not know what he's talking about.'",
        "'speaker_1': 'This city is incredibly prepared. And one of the reasons that the building I live in, a 200 unit, senior building, low income, and one of the reasons that we were able to survive without serious injury or discomfort was because seven of our members had gone through the training right before the power outage.'",
        "'speaker_1': 'We were able to respond and take care of all the needs of the tenants in our building. And that's just one small example of the services that the city provides. Jay Kaplan, who coordinates for the fire department, and David Ashman, the staff.'",
        "'speaker_1': 'Reggie Harrison, they all do an amazing job to help our community be prepared. And there's a safety fair that they put together the last couple of years that's incredibly valuable in terms of connecting with resources. So I think our city is actually more prepared.'",
        "'speaker_1': 'And actually I went through training in the city of L.A. at one point in time, too, and the training that Long Beach offers is better than L.A.. So I feel.'",
        "'speaker_5': 'Comfortable.'",
        "'speaker_2': 'Thank you for your time. All right. So, Members, please cast your vote.'"
    ],
    "Measure H Funding Agreement and Appropriation for Homeless Initiative Strategies.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. And we have item number 20.'",
        "'speaker_0': 'Item 22 Report from Health and Human Services. Recommendation to execute all unnecessary documents with the Los Angeles Homeless Services Authority to accept and expend measure H funding in an approximate amount up to 2.8 millions. To implement homeless initiative citywide.'",
        "'speaker_2': 'Thank you. Will go to the city manager.'",
        "'speaker_5': 'Kelly Connell, FBI director of Health and Human Services, has been the point of the spear working with the county for Measure H and to try to bring homeless initiatives here to the city of Long Beach. So Kelly will walk us through the measure.'",
        "'speaker_5': 'Measure H money.'",
        "'speaker_6': 'Good evening. The $2.8 million that we are accepting tonight is a focus on prevention for single adults, rapid rehousing, enhancing the coordinated entry system, enhancing our outreach efforts, and also our emergency shelter system. Approximately $1.8 million of that is specific to direct services now.'",
        "'speaker_6': 'And the remaining funding will allow for the ability to provide physical enhancements to a building for a year round shelter, as well as services for the year when those are identified. We're looking at hiring a number of case managers, including an opportunity to actually support those who are have experienced homelessness, who are currently living in Section eight'",
        "'speaker_6': 'housing and the ability to support them so that they remain in their housing, as well as more housing, navigation and being able to support people as they're moving into housing and helping keep them there and housing, location services.'",
        "'speaker_6': 'We'll also be doing more outreach with the possibility of adding a public health nurse or psychiatric nurse to those teams for increased outreach opportunities. In addition, some of the funding will be utilized to help support the administrative functions with within the Homeless Services Division.'",
        "'speaker_2': 'Thank you for the staff report. Councilmember, you can get anything. Thank you. Councilman Austin.'",
        "'speaker_7': 'Yes. I just want to congratulate the city and also commend. Ah, ah, director of health services for for some excellent work working with the county to secure these funds. Is this on top of the 11.5 million that we budgeted already, or is.'",
        "'speaker_6': 'This is on top of the continuum of care funding as well as the others that we brought in from other grants? Yes.'",
        "'speaker_7': 'It's also we've heard some public comment about where the money is going. And I just I wanted to be clear on that. We have a full breakdown as to how those funds are going to be spent and where they're going.'",
        "'speaker_7': 'And also, I wanted to just recognize Supervisor Janice Hahn's deputy, who is here. And obviously our supervisor has been instrumental in helping us secure those funds, the sorely needed funds for our homeless. So thank you very much and thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilmember Pearce.'",
        "'speaker_3': 'Yes. I also just want to say thank you so much, Kelly, for your work on Measure H. We know that this is a huge asset to Long Beach and I think it really shows how important it is to have our own health department advocating for Long Beach to not only get funds that were already prioritized, but from'",
        "'speaker_3': 'what I understand, there's also five specific strategies specifically to Long Beach that these funds are going to. And so I wanted to ask, let's see, the process for negotiating for next year. Yeah. Is that how often is the group meeting and what does it look like in deciding where the funds are going to for the future year'",
        "'speaker_6': '? So those conversations have not yet started. So they're just now sort of finishing and we are in the process of contracting for this year, I believe probably starting sometime in the spring, that they'll start to look at what are the resources coming in.'",
        "'speaker_6': 'By then the tax increment will begin, will be coming in, they'll have a better feel for what those amounts will be. I believe that the strategies will stay the same, but that within those strategies there'll be a line different amount of resources, one based on what's been able to be spent in the past.'",
        "'speaker_6': 'So what were they really be able to utilize and then what would be needed in the future? So those conversations, I believe, will start in the spring.'",
        "'speaker_3': 'Great. And I know the answer, but I want to make sure we talk about it. There's been a lot of discussion around the heart team and trying to identify different resources. It's my understanding that Measure H cannot go towards public safety.'",
        "'speaker_6': 'That is correct.'",
        "'speaker_3': 'And is that specific? Does it say just general public safety or does it say PD and fire explicitly?'",
        "'speaker_6': 'One of the strategies within the 19 strategies overall focuses on a team similar to quality of life. And in that spectrum, the waste is designated as that. That police officer is not covered by Measure H, but the support behind with the outreach or mental health or support person with that police officer is covered by Measure H.'",
        "'speaker_6': 'So it's that it's, it's the breakout between those two.'",
        "'speaker_3': 'So you could put together a team similar to a heart team that has funding from Measure H.'",
        "'speaker_6': 'No paramedics here. There's nothing that's outlined that talks about paramedics that's very much about outreach and navigation.'",
        "'speaker_4': 'Okay.'",
        "'speaker_3': 'Great. That's that helps me. And so, again, just congratulations. I think having a health department here, making sure that we have a supervisor that is advocating and prioritizing homelessness. I think, you know, seeing our numbers decrease by 20% and being able to partner this with the 14.1 million towards homelessness this year demonstrates, I think, to so many'",
        "'speaker_3': 'of the constituents that said, 80% of them said that homelessness was a priority. And so this demonstrates that we're listening and we're prioritizing that. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Pryce.'",
        "'speaker_1': 'Thank you. I want to echo the comments of my colleagues and thanking our health department for being involved in the discussions regarding this county resource. And of course, I want to thank our supervisor and her representatives. Mr. Chico is here for being a partner with us on this huge project.'",
        "'speaker_1': 'She she has expressed a commitment to partnering with us on this even before she was elected, and I'm very appreciative of that. I did have a question for our health department, and that is, was there anything that, based on the amount of funding we got or the limitations on the funding that we got, we would have liked'",
        "'speaker_1': 'to have accomplished but were unable to fund. So was there anything that we that's kind of outstanding that we just don't have the resources to fund? We could have if we had more?'",
        "'speaker_6': 'I think the dynamic under Measure H is that some of those funding is coming directly to us to manage and to engage with the outreach and those kinds of things that doesn't fund areas around, clean up and more of a response that cities face.'",
        "'speaker_6': 'It is very focused on service. However, there are other funding streams through Measure H that are coming that we have access to that may or may not come directly to us. So, for instance, permanent supportive housing, which we know is one of the key things that we need to provide to start to reduce homelessness is that we'",
        "'speaker_6': 'are in negotiation of a process that we have greater access to that. So the funds don't come directly to us, but the system is in place at the county level that will be able to operate through and to engage in those services.'",
        "'speaker_6': 'So there are a number of other things that are like that. So it may not be dollar value specifically, but there are places that we're increasing our partnership to be able to increase access.'",
        "'speaker_1': 'And I know you and I have talked about this and, you know, we've we've written reports and and summaries read reports and summaries regarding in regard to this. But generally, from the public's perspective, one of the biggest issues in this area is rehabilitation services and what measure H moneys are available specifically either directly to us or, as'",
        "'speaker_1': 'you just stated, with the kind of ancillary type services that could support rehabilitation efforts by the city.'",
        "'speaker_6': 'You know, under permanent supportive housing. Those supports include access to substance use treatment, but there's not a space that is, you know, unless it's tied to permanent supportive housing. I don't believe that there is a sort of substance use treatment availability in terms of the rehabilitation.'",
        "'speaker_6': 'The same would be true for mental health services. There are there are some services and supports for those coming out of incarcerated settings who are homeless. That also would be able to connect to some of those services that are being operated out of the county jail.'",
        "'speaker_6': 'But they're not available specifically to the city jail at this time. But there isn't sort of a path that says substance use treatment on it. As part of the strategy.'",
        "'speaker_1': 'Do we expect that through any other source? If it's not in Measure H, can we expect to see that with Prop 47 or Prop 64 or any other moneys that could help with that?'",
        "'speaker_6': 'Yeah. So the so the county, L.A. County wrote for Medicaid waiver for what they're calling drug Medi-Cal. Drug Medi-Cal kicked into place in July. And so we are tracking on that. They're really just sort of getting things going.'",
        "'speaker_6': 'But what that does, it expands the number of services, the types of services that can be provided and covered under Medi-Cal, which is the primary funder for low income folks. And then from that, we so where we are connecting at the county level with the director of substance use services there and to sort of determine greater access'",
        "'speaker_6': 'and how we start to build our capacity that way within the city. But those contracts all run through the county. But it does it does mean that we'll have greater access to substance use treatment within the city of Long Beach, hopefully within the next six months or a year or so.'",
        "'speaker_1': 'As that for adult substance abuse treatment are also youth.'",
        "'speaker_6': 'You know, I'm not sure about that. Okay, great.'",
        "'speaker_1': 'Thank you. Thanks for the report. I appreciate it.'",
        "'speaker_2': 'Thank you. Councilwoman Gonzalez.'",
        "'speaker_1': 'Thank you as well, Kelly, for your work in this. And I'd also like to thank Supervisor Janice Hahn's office, her Linda Chico as well for your work. I have a question. I know in here it specifies homeless prevention for single adults.'",
        "'speaker_1': 'And so we that's who we're focusing on. Correct. There's no.'",
        "'speaker_6': 'The. Yeah, well so the the funding that we get specifically at the city level for our continuum of care is for adults. There is also prevention services for families, but that model is being determined at the county level and they're providing services.'",
        "'speaker_1': 'Perfect. Okay. And then I believe at one point we were talking about and I know it's not explicitly stated in here, but employment efforts working with Pacific Gateway in some sort. So is that I'm sure that's underway. What is that looking like right now?'",
        "'speaker_6': 'So the planning is in place. We're actually meeting in the next week or two. So through the workforce investment networks there, there is funding directly through Measure H to the I think I said to the L.A. County workforce and they'll be partnering with our local provide with our local feed unit.'",
        "'speaker_6': 'And so we'll be in a conversation there to figure out what that can look like and provide some employment training and supports moving forward. But I don't know what that looks like yet.'",
        "'speaker_1': 'Okay, great. Thank you very much. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Super nice. Thank you. Just a quick follow up to Councilmember Austin's point about the total budget. Now, it's actually the second to the last sentence in the report. And a figure we can use now is the 14.1 or we can have it this.'",
        "'speaker_2': 'We spend over $14 million a year on all those issues.'",
        "'speaker_5': 'Does that sound fair?'",
        "'speaker_6': 'Yes. Yeah. So part of that is, you know, is our work with Parks and Recreation, the hurt teams, quality of life, it's citywide. All of the funding that we spend as a city. Yes. And with it and with the grants and measure H coming.'",
        "'speaker_2': 'Okay. Thank you. Thank you. And I'll just I'll just say, you know, it was from what I hear from the director of homelessness, the homelessness initiatives, the homelessness initiative in the county, is that this was a pretty hands on process to get all the partners to consensus.'",
        "'speaker_2': 'And you were a part of those conversations, and everyone didn't get exactly what they what they asked for. But you got unanimous support at the end of that process. So that really says something about the direction of this initiative.'",
        "'speaker_2': 'I'm very hopeful that the measure process will reap real, real benefits and rewards and that we can really stem the issue. And then I'd say and, you know, I would just say, I know that a portion of this is the funding that we were waiting on, a fully implemented landlord and savage incentive package in the housing authority'",
        "'speaker_2': '. So it's all good stuff. So, you know, no questions, just came with the good work. Is there any member of the public would like to speak on this item? Now be a time. Please come forward. Let's form a line.'",
        "'speaker_2': 'So we have an idea how many people we have. Okay. So I see three in line. Thank you.'",
        "'speaker_8': 'Okay. Give an honor to Jesus. Okay. I hear you. All the stuff you said on this one and work on the Pacific Gateway. That's the first thing that got me out of this Pacific Gateway. I don't like that at all because I remember a few meetings ago.'",
        "'speaker_8': 'Everything about Pacific Gateway was to give money to train non-English speakers. And I saw that whole agenda with Pacific Gateway is for illegals to give them jobs. It was something, man, I forgot. That agenda was about three meetings ago.'",
        "'speaker_8': 'But no, I'm not with the Pacific Gateway and I don't see them talking about anything for everybody else in first. Mr. Pearce over the you mentioned Janice Hahn. I'm talking about this. She gave her that job on the board of the crazy people.'",
        "'speaker_8': 'You know, all that after she did that thing on, you know, with that little thing in the middle of the night, drunk driving and she got favoritism and everything. And then she called later and then I guess you scratch the man's face up.'",
        "'speaker_8': 'I don't know. That's how I heard it, you know. So if I do something like that, I go to jail. But she gets special treatment.'",
        "'speaker_3': 'The things on the border is not correct.'",
        "'speaker_8': 'You know what? I'm talking about you. And you ain't going to shut me up because you're the one that did it criminal.'",
        "'speaker_5': 'You're spirit point of order. He's on a tough topic. Well, then you. This is not.'",
        "'speaker_2': 'Public. So respectfully, if you guys don't hold us together, how you expect me to get them though, anyway? Anyway, don't speak out of turn. Please don't be recognized. He has a flaw at this point. That's what this is.'",
        "'speaker_2': 'If you remain on topic, you have 3 minutes to speak. It's that simple. Okay, so just stay on topic.'",
        "'speaker_8': 'Thank you. My seconds. Back from the talking.'",
        "'speaker_2': 'No, you cannot because you were way off topic. But you have the rest of your time.'",
        "'speaker_8': 'Thank you. Stop me no more then shut up. So. So anyway, she gets this thing from Janice.'",
        "'speaker_2': 'Now you're off topic.'",
        "'speaker_8': 'Oh, no, no.'",
        "'speaker_2': 'That's it.'",
        "'speaker_8': 'No, no, it.'",
        "'speaker_2': 'Is city attorney about to cut him off. Okay, well, I'm.'",
        "'speaker_8': 'On topic now, so you.'",
        "'speaker_5': 'Need to stay on the topic. It's not public comment.'",
        "'speaker_8': 'Okay. The topic is measure H and everything. Yes, that's the topic. Thank you. This I don't see how it's going to work with the same old thing even dealing with her. And then if that's not my best, that's part of the topic.'",
        "'speaker_8': 'She spoke so I can speak. I want you to retire. You'll retire and I want you to stay in your place and let me talk. That's what you do. As for the time taken. Yeah, I know it's thick and you need to be quiet.'",
        "'speaker_8': 'So, Janice Hahn, I'm not with her. She's a sellout. She's alive. She's for illegals and everything. She's a one term and she's going to have her time. And so is everybody here that keeps on doing what you doing?'",
        "'speaker_8': 'Section eight, you mention Section eight. You're doing everything it takes to run Section eight out because Section eight has a limit with this with this rent control, everybody's boosted up to 300 and that's run a Section eight along.'",
        "'speaker_8': 'These is not is not gentrification from these rich white folks. It's black folks like you, black folks like you doing this to your own people. And it's like that mayor, the son of illegals is doing it. So don't blame it on white folks.'",
        "'speaker_8': 'If anything, homicide up with the white folks against you and that illegal mayor. That's the best way to go.'",
        "'speaker_2': 'So first I'll say I think we have a fantastic county supervisor and thank you for our support with with respect to this issue. Secondly, I know that it's difficult for members of the council sometimes during public comment, but there is a fine line that we have to sort of follow to make sure that we don't skirt the'",
        "'speaker_2': 'law as an open public meeting. And so we we work very closely with our city attorney. Sometimes it's difficult sitting up here. I get it. You are just, you know, the object of of some other people's frustrations at times.'",
        "'speaker_2': 'But that's our job as public officials sometimes take those take those hits and it's not okay. I just want to say it's not okay. But we have to stand in front sometimes and take those hits. So no further public comment.'",
        "'speaker_2': 'We will. Okay. One final public comment.'",
        "'speaker_5': 'Sarah going back on the item 24 again, I would suggest.'",
        "'speaker_2': 'I'm sorry. You have to speak on item 20. This is. I'm 20.'",
        "'speaker_5': 'Oh, I'm sorry. Wait a minute.'",
        "'speaker_2': 'Measure is funding.'",
        "'speaker_5': 'I apologize. I thought you were an item.'",
        "'speaker_2': 'You don't have to speak on it if you are prepared to speak on it. Thanks. Members, please cast your vote.'"
    ],
    "Ordinance to Approve and Adopt the City Budget for Fiscal Year 2017-2018.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. Item 24, please.'",
        "'speaker_0': 'Item 24 is a report from financial management. Recommendation to declare ordinance approving and adopting the official budget of the Long Beach of the City of Long Beach for fiscal year 2017 through 2018. Creating and establishing the funds of the municipal government of the City of Long Beach and appropriating money to and authorizing expenditures from state funds for'",
        "'speaker_0': 'safe fiscal year, declaring the urgency thereof and providing that this ordinance shall take effect on October 1st, 2017. Read and adopted as read.'",
        "'speaker_2': 'Is there any public comment on this? Please come forward.'",
        "'speaker_5': 'Very good. I'm suggesting, again, as I referenced earlier, that you really get some guidance relative to the bioterrorism, notwithstanding the comments from a well-intended lady speaker earlier there referenced a situation where, quite frankly, it's a city we're doing the job in the first place.'",
        "'speaker_5': 'A lot of that wouldn't have been necessary. But but. A well-trained Eagle Scout troop could have addressed those issues. I'm talking about bioterrorism. I'm not going into the specifics of them because I'm not planning I don't want to plan any ideas, but that's an entirely different world.'",
        "'speaker_5': 'And again, it goes back to the fact that, again, the classic example came up 3 to 3 weeks ago. It's not that you don't know. You don't know. You don't know. And I would strongly suggest you reach out and get some experts in that field and get some guidance.'",
        "'speaker_5': 'Right now, as I pointed out. The police department fully can't grasp how to deal with the broken window paradigm, let alone bioterrorism. So I think you should take the needed steps. Spend what money you have to if you have to get out.'",
        "'speaker_5': 'Since consultants are work with the federal government zero in on specifically that. Don't wait for it to happen. As too often is the case. Just like you waited too long. Why do we had all these power outages? You didn't zero in on the electric companies to see and find out they were skimping and not bringing everything up'",
        "'speaker_5': 'to code. As a result, many buildings were out of power. Now, that's not a catastrophe, the first order. It's something they can work through with a good group of Boy Scouts to help solve that immediate problem. But I think you have to come into the 21st century.'",
        "'speaker_5': 'Spend some money, find some experts to guide you through that. Thank you.'",
        "'speaker_2': 'Thank you. Next speaker, please. And so first, just before you begin.'",
        "'speaker_8': 'To talk.'",
        "'speaker_2': 'About.'",
        "'speaker_8': 'My time.'",
        "'speaker_2': 'The moment you get off topic, let's talk the time for a moment. The moment you get off topic, this exercise is over. Okay, so I order. Time out. You let me explain this to you the way this is going to work.'",
        "'speaker_2': 'You have 3 minutes to speak. You can speak and say what you want to say, but you need to remain on topic. There is an opening public comment at the beginning of the meeting, a closing public comment at the end, and you can speak on whatever topic you like, but this one just stick on this particular issue'",
        "'speaker_2': '. And that way you can get your 3 minutes. Okay. So now it's time to start.'",
        "'speaker_8': 'Yeah. Anyway, so given that it's a law in which you need to start reading the Bible so you can be fair. Remember what you were taught when you were young. Okay. Now, as far as dealing with this term fiscal year, we need the budget and everything done right and we need the many money spent right.'",
        "'speaker_8': 'We need the money spent for the people, money spent for the city. Not all this finagling help. The homeless are not going to go off and just say anything. This is real. That was real to do for the people.'",
        "'speaker_8': 'The people really need it. I keep on hearing about these bills for the homeless in everything I do for the people. Every time you ask Where's the money going to go to? Yeah, somebody says, okay, we'll figure that out.'",
        "'speaker_8': 'The third time I heard it was $225 million bills before, and I heard it. And like I say, hey, I guess I am about to go off topic because you need to quit now. I'm about to quit this off topic.'",
        "'speaker_8': 'Quit. Ginny Pierce.'",
        "'speaker_2': 'Thank you for your time. So, members, please cast your vote.'"
    ],
    "Incentive Package Development for Corporate Headquarters Recruitment.": [
        "'speaker_0': 'Bush in case.'",
        "'speaker_2': 'Thank you. Our next item is 25.'",
        "'speaker_0': 'Item 25 is a communication from Councilwoman Gonzalez, Councilmember Sabina and Councilwoman Mango. Recommendation to direct city manager to assemble a recruitment team. To develop an incentive package to entice a large corporation such as Amazon to consider the city of Long Beach as the location for its next headquarters.'",
        "'speaker_2': 'Thank you. We'll go to Councilwoman Gonzalez.'",
        "'speaker_1': 'Yes, thank you. I brought this item forward and I first want to thank my council colleagues, Councilmember Super Non Councilmember Mongo, for joining me on this item. I believe that our economic development department has done a fantastic job.'",
        "'speaker_1': 'I know that they're already in the works, working with many large corporations to see what may be interest, who may be interested in Long Beach. And I know that Amazon, we've all seen it in the news as a potential.'",
        "'speaker_1': 'They are currently listed as the third most innovative company in the world with over 350,000 employees worldwide. It doesn't even take into account seasonal or temporary workers, and the company continues to add more employees. And this is primarily brought on by the company's higher fulfillment activity, its growing transportation, logistics network and products like Echo and Alexa, which'",
        "'speaker_1': 'we may all have in our houses. Five years ago, Amazon only employed about 65,000 people, so their growth is significant. And now that Amazon is seeking to open a new headquarters with the promise of 50,000 new jobs, it's imperative that we assemble a recruitment team, this team that has already done such great work to ensure that Long'",
        "'speaker_1': 'Beach is a place where people look to us as major investment. And so I just have a couple of questions for John Keisler. If you we're going to put you on the hot seat for a second, because I know as we are not even at our peak yet in terms of our local economy getting better and better'",
        "'speaker_1': 'and better. But, you know, we obviously are seeing new corporations seeking second, third location. So what are we doing to just outreach and recruit other corporations similar to Amazon or. Businesses that are looking elsewhere.'",
        "'speaker_5': 'Members of the city council. Councilmember GONZALES Yes, there's there's a number of things that that that we do on an ongoing basis in the Economic and Property Development Department. We cover real estate development, property development and workforce development.'",
        "'speaker_5': 'And so depending on what the needs are of the business, if they're existing and they want to expand, they have workforce needs or they might want to relocate to the area. We help on an ongoing basis businesses to to understand where we have opportunity sites for, you know, available land, whether it's owned by the city or owned'",
        "'speaker_5': 'by a private entity, how to how to navigate and prepare for, say, the entitlement process. We also have on the workforce development side, a number of programs that are federal federal programs that help businesses that might have recruitment or hiring needs on job training funds to help them to grow or recruit the workforce they need to locate'",
        "'speaker_5': 'here. And then finally, with business attraction and retention there, depending on the size of the company, depending on what what assistance they need, they might they might need anything from market analysis. Taking a look at the demographics or consumer spending, the population, they may also need help with identifying a site to locate their business.'",
        "'speaker_5': 'And so there's there's a range of issues that that we take in.'",
        "'speaker_1': 'Or intake every.'",
        "'speaker_5': 'Single day. And typically, it's a team of both in the economic and property development department staff, as well as staff in other departments such as Development Services. It could involve our fire department, public safety health, who we bring to.'",
        "'speaker_6': 'The table to facilitate.'",
        "'speaker_5': 'The business either starting or growing in the city.'",
        "'speaker_1': 'Great. Well, thank you so much for the report and congratulations on being most innovative per the Long Beach Business Journal. I saw your face on LinkedIn. Congrats and thanks for all your work, both you and Sergio, the whole team do a great job and I appreciate you entertaining this item.'",
        "'speaker_2': 'Thank you. Councilmember Mongo.'",
        "'speaker_1': 'Yes, I want to thank the team. It is exciting when we're talking about new businesses that are coming to town. I know that we can't always fully disclose all of the people that are interested, but I know that we're working hard.'",
        "'speaker_1': 'I appreciate the easy access to our supervisor's office, who was here today and directly after my meeting with economic development on all the potential businesses that are moving here and hearing more about your efforts with working with the government business team to go to the office and the governor's business team, that we are going to put together'",
        "'speaker_1': 'a great package because we allow businesses to work here and to bring their jobs here and to run their companies as efficiently and as effectively as is legally available. So excited to support that. Thank you.'",
        "'speaker_2': 'Thank you, Councilman Andrews.'",
        "'speaker_5': 'Yes, thank you, Vice Mayor. You know, I really think that this sounds like a wonderful idea, especially since I'm a firm believer that, you know, a job can stop a bullet. You know, with our economic development blueprint, we want businesses, good paying jobs and a diverse workforce.'",
        "'speaker_5': 'I hope an incentive package can encourage large corporations to come into our city and hire locally and with respect for working conditions. And I want to thank you, Councilwoman Gonzalez, for bringing this to Bobby. Thank you very much.'",
        "'speaker_2': 'Catherine Ashton.'",
        "'speaker_7': 'Yes. Also, I'd like to thank the members for bringing this forward as well. This is a no brainer in terms of support. I think I would be hard pressed to find anybody that would argue against the possibility of bringing 50,000 jobs to Long Beach.'",
        "'speaker_7': 'I can tell, as many of you know, I came to Long Beach, my family came to Long Beach, you know, at the heyday of the aircraft industry here in Long Beach with McDonnell Douglas and Boeing. Those facilities, I think there's a footprint that is already in place to employ thousands of people.'",
        "'speaker_7': 'And, you know, I think it it doesn't hurt to make to ask and be aggressive about it. And so I'm confident that, you know, Long Beach will be favorably considered. So good luck and I'll be supporting.'",
        "'speaker_2': 'Thank you, Councilman Pearce.'",
        "'speaker_3': 'Great. I want to thank my colleagues for bringing this forward. I think that it's important that we as a city, we've been talking about how do we bring tech, how do we bring big business here to help our tax base to ensure that our city is continuing to grow and to thrive?'",
        "'speaker_3': 'And I think any package, incentive package should be aggressive. I'm curious on issues with 50,000 new jobs, if there's issues of housing and things like that that they're looking for cities to be innovative in. And how are we thinking about a community benefit that includes local hire and housing when we're trying to attract these big companies?'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. I'll just say, you know, anytime we can roll our sleeves up and try to find a land, something like that. You want to roll out the red carpet? Be as creative as possible. But frankly, e-commerce is the direction of the future.'",
        "'speaker_2': 'Miles, we're closing down these e-commerce distribution centers, opening up. So we we should think about the other other pieces to this industry, too. So you don't land a headquarters. I mean, you're saying distribution centers and things like that with that are creating 2000, 3000 jobs at a time.'",
        "'speaker_2': 'And that's the direct that's what's opening up people. We're literally replacing shopping malls with distribution centers. And we have to, you know, have our land use codes and things up to speed to be able to prepare for those things.'",
        "'speaker_2': 'And they're not just warehouse work jobs. Some of these are engineering jobs, logistical jobs, very technical jobs. And and there are real opportunities. You know, one of these sites just opened up in the city of Compton. The old brick brickyard became an e-commerce site for UPS.'",
        "'speaker_2': 'And I know that we're engaged in some of those conversations here in the city, but thank you to the both to the maker of the motion and the centers on this item. Is any public comment on this item?'",
        "'speaker_2': 'Now based on who's come forward.'",
        "'speaker_8': 'Okay. Give an honor to Jesus again. Only because he's the only good one. Okay. This is a this is a good thing. I can't speak against it. I'm not speaking against. The only thing I wonder about is I remember when Jet Blue was coming around and a lot of people here with JetBlue, that was $1.4 billion.'",
        "'speaker_8': 'You know, I know some people people like people came in T-shirts and everything and some people didn't want the noise, but that was 1.4 billion that the city needed. And knowing that, you know, you guys are going to be going for sanctuary city status and everything and we're going to lose like over $1,000,000,000 from the feds.'",
        "'speaker_8': 'We needed that. JetBlue. So I just hope you stick with this one and don't do an about face on them either, you know, because you did it before the JetBlue. They were people. And then when it's time, people backed out.'",
        "'speaker_8': 'So you know the opportunities. Yeah, but who's going to get the job? Pacific Gateway was talking about non-English speakers and all those things. Those things I've read in the past that when they want to train non English speakers and this and then everybody I see with jobs I said last week, hey they they nothing but basically Latinos'",
        "'speaker_8': 'I guess Latinos have jobs. It's a good thing I'm Latino myself, Cubano, you know, but we support Trump because he let Reagan let us stay in in 80. So that's the difference. So we for Donald Trump, Donald Trump, Donald Trump.'",
        "'speaker_8': 'Now, as far as how you keep this going and opportunities, I hope the opportunities are real because I hear a lot of mumbo jumbo. I've been here for a while. Well, I only been here for about ten months.'",
        "'speaker_8': 'Yeah, about ten months. But since I'm here, you know, I hear a lot of talking and I don't see the walking. So I hope you keep your word on it. And you know what I always say? She got to go.'",
        "'speaker_8': 'She got to go. She can. Thank you for your.'",
        "'speaker_2': 'Time, sir.'",
        "'speaker_8': 'I know you're thanking me for my time, but you got to get rid of her. We don't want communism.'",
        "'speaker_2': 'All right. I think your comments are concluded, but thank you for your time.'",
        "'speaker_8': 'That's the goal. Everybody in the.'",
        "'speaker_2': 'World know any further public a public comment saying no. Members, please cast your vote.'",
        "'speaker_8': 'To go, everybody.'",
        "'speaker_0': 'Councilmember Andrews. Motion carries.'",
        "'speaker_2': 'Thank you. That concludes our final agenda item. So we now move to our second public comment. As any member of the public like to come forward and address city council. Thank you. Have the floor.'"
    ]
}