{
    "Charter Commission Appointments and Reappointments.": [
        "'speaker_6': 'Adam, 12, is communication from the Office of Mayor Bob Foster with the recommendation to receive the Charter Commission appointment and reappointment pursuant to Section 509 of the City Charter and Section 2.6 moved 3/2.'",
        "'speaker_1': 'Moved there by way of explanation. The Police Citizen's Police Complaint Commission has one new appointee and three reappoint these and they have an awful big workload. That's why I'm doing this. A little out of order. It does require two votes.'",
        "'speaker_1': 'The first is to move the appointments to the council from the Civil Service Committee. I think that's correct. Mr. part. You want to describe this.'",
        "'speaker_7': 'Mayor. Thank you. The pursuant to the language municipal code, these appointments need to be reviewed prior to placing on the council agenda by the Personnel and Civil Service Committee. That action did not happen, and the Council has the authority to waive at its discretion that requirement.'",
        "'speaker_7': 'So the first motion would be to waive the requirement to present it to the personnel in civil service.'",
        "'speaker_1': 'So moved, moving, seconded and any member of the public to address council on that motion. Seeing the members cast your votes on that motion.'",
        "'speaker_6': 'Motion carries eight votes.'",
        "'speaker_1': 'And secondly, we would we would vote on the nominees. The way I'm buying them is here. And she's the nominee to fill the about one year left on the term at the Harbor Commission. And then there was a big baby with the first district representative.'",
        "'speaker_1': 'Mr. Garcia, you might want to say something about. And then three re appointees, Raul of Norway, Brian Ryder and Emmanuel Walker from the second an at large and ninth district, respectively. So.'",
        "'speaker_3': 'Mr. DELONG Yeah, I just want to make a comment that I'm extremely supportive of all your nominations, but in particular, Lou Ann Bynum. I've known her for a decade, and she's going to be an outstanding addition to the Harbor Commission.'",
        "'speaker_3': 'So thank you in advance for your service. Lujan.'",
        "'speaker_1': 'Thank you, Mr.. Whoever you are, Mr. Neal. And a brain cramp there for a moment.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And I concur with my colleague, Mr. DeLong. I'm in complete concurrence, but I would like to acknowledge Mr. Manuel Walker, who has been a tremendous leader, and Nawaf Lone, beaten in the ninth District and commend him for his exemplary service to your community.'",
        "'speaker_10': 'Thank you so much, my friend.'",
        "'speaker_1': 'Mr. Garcia.'",
        "'speaker_3': 'Thank you, Mr. Mayor. First, I'm going to start off with congratulating and welcoming Terry. Terry has been a fantastic advocate in the Long Beach area, particularly in Wilmore and the historic area. So we look forward to having you on board and thank you for your for your service and for serving the city of Long Beach.'",
        "'speaker_3': 'I also want to add my my remarks also to Luann. I think, Luann, you and I have known each other for probably 15, 20 years or so. And it's been a pleasure to work with you at Lombard City College as colleagues and as as friends as well.'",
        "'speaker_3': 'And so I welcome you to the the Port of Parma commissioners. You could do a fantastic job. The mayor made a good choice. And so good luck because a lot of work to do.'",
        "'speaker_1': 'Mr. Johnson.'",
        "'speaker_10': 'Well, thank you, Mayor. And I want to thank all the nominees for your service. You know, we've said it before, but really couldn't do the work of the city without people like you willing to step up and volunteer.'",
        "'speaker_10': 'So I want to thank you in advance. I would like to. Mayor, if it were okay, just maybe invite Ms.. Bynum up to say a few words. And I just had a one question I want to answer.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_10': 'I think one thing we've done very well over the city or at the port last few years is reach out to the community, particularly the west side. And I just wanted to hear from his Bynum. I know you've had already done a lot outreach at Lumbee City College, but your thoughts on how because the port is so'",
        "'speaker_10': 'tremendously important from economic development perspective, but also because of the effects, the negative effects on the West Side, what your thoughts are in terms of reaching out to that community and and having kind of a sustained dialog over the next few years.'",
        "'speaker_2': 'Thank you. First of all, I want to thank Mayor Foster and all of you for this consideration. I consider an honor. I think it's an awesome responsibility to be involved with the harbor and be a harbor commissioner. But your question is, is right on the harbor and the port is a major economic engine in this community, and'",
        "'speaker_2': 'there's a lot of jobs tied to it. It's jobs creation. It's job retention. I think our future in terms of where jobs are going is tied as well to the port and advanced transportation. But having said that, the port is also doesn't operate in a vacuum.'",
        "'speaker_2': 'It operates with the city of Long Beach, and it's tied to the residents in our community. And I applaud the work that the port and the commissioners have done in the past to take leadership to mitigate the environmental concerns that our our citizens have to deal with.'",
        "'speaker_2': 'And I would anticipate I don't think those two things are mutually exclusive. I think they can be done together and I think they can be done. Both of them, you know, to make sure the port's competitive at the same time ensure that our citizens have clean, healthy environment and are able to to coexist well with the port'",
        "'speaker_2': 'and the means for both of them.'",
        "'speaker_10': 'I want to thank you for for the answer and very excited to see your service. And I would invite you to know when you have a chance to sit down some of the West Siders and I can help facilitate that.'",
        "'speaker_10': 'And I think we've done some great things in the past. The West Side plan is one thing you may have heard about that I think really creates the conditions for a win win, that the poor can grow and succeed in the neighborhoods and get better at the same time.'",
        "'speaker_10': 'Just like you talked, I don't think we need to have a zero sum game. So thank you for being who was willing to serve and I look forward to working with you in the coming years.'",
        "'speaker_2': 'Well, thank you very much. I appreciate it.'",
        "'speaker_1': 'Mr. Neal.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And I would also like to I don't see Mr. Northey in the audience, but I would like to publicly commend him as well. But prior to him moving into District two. He was a vital asset in District nine, serving on the Human Rights Commission.'",
        "'speaker_10': 'And I would like to acknowledge his service to the city as well.'",
        "'speaker_1': 'Thank you for doing that, Mr. Neal. He is all over the place and he's a he's a great citizen to have in this city. He's always willing to help. And I'm glad to bring that because I have all the nominees stand up, please.'",
        "'speaker_1': 'If you're here, I. I want to publicly thank you for your willingness to serve me. A lot of people don't realize this. It is time consuming and a lot of energy to serve on commissions. These two in particular take a lot of time.'",
        "'speaker_1': 'And I want to thank you for being civically responsible, willing to give your time for the betterment of the community that we could not do this without you. So thank you very much in advance for your service. Appreciate.'",
        "'speaker_1': 'We have a motion and a second. Any comment on this? This motion? My members cast your votes on the nominees.'",
        "'speaker_8': 'It's.'",
        "'speaker_6': 'And this motion is to appoint the nominees. That is.'",
        "'speaker_1': 'Correct. We already dealt with this as the appointment.'",
        "'speaker_6': 'Motion carries eight votes.'",
        "'speaker_1': 'Thank. Thank you, members. Congratulations to you all and thank you again for your service. Item 20 clerical read.'",
        "'speaker_6': 'Item 20 is a report from the Long Beach Airport and the city manager with the recommendation to authorize the city manager to execute documents for a new lease with cinema aircraft. Executive Transportation for property located at 4301 Douglas Drive in Long Beach.'"
    ],
    "Settlement of Lawsuit Dorian Brooks v. City of Long Beach.": [
        "'speaker_6': 'She has a report from the city attorney with the recommendation to authorize the city attorney to pay some $50,000 in settlement of the lawsuit titled Dorian Brooks versus the City of Long Beach.'",
        "'speaker_1': 'Mr. Johnson.'",
        "'speaker_10': 'Well, thank you, Mayor. And tonight, it looks like we're discussing a settlement of $50,000 for alleged police misconduct, although I know it's only alleged. I guess my question for Mr. Parkin is moving forward from tonight, what are we doing in terms of risk management for preventing this from happening again at PD and preventing this kind of litigation'",
        "'speaker_10': 'in the future?'",
        "'speaker_7': 'Mayor, our members of the council, Mr. JOHNSON. As with all cases and all settlements, we discuss the issues that arise in this case with the appropriate client, in this case, the police department. And they would then review their training techniques and tactics on this particular type of search and make any changes that they deem appropriate to their'",
        "'speaker_7': 'policies and procedures.'",
        "'speaker_10': 'I will certainly, you know, I hope we make some changes and this is only $50,000. But my concern is if it got a jury trial would have been could have been a lot more so. So now to support the settlement tonight.'",
        "'speaker_10': 'But I think the question isn't the settlement. The question is what are we doing to prevent these kind of issues from coming up? Not just for the money, but also protect innocent parties. So with that, I'll go ahead and make the motion to approve.'",
        "'speaker_1': 'Second moving second to Mr. Austen.'",
        "'speaker_11': 'Yes. I just wanted to comment on I serve on the NF, along with Councilmember Neil. This came before our committee. It was discussed and the same question was actually asked in committee before we recommended for it to be approved.'",
        "'speaker_11': 'I want to applaud the city attorney's office for working to get a settlement and potentially saving the city a great, great settlement or lawsuit. And so, again, I think you were asked a very pertinent and real question, the question that necessitated a response.'",
        "'speaker_11': 'And the public should know that the city attorney's office, as well as our PD, work to try to minimize this and mitigate this as much as possible.'",
        "'speaker_1': 'Okay. Thank you. We have a motion in a second. Any member of the public would suggest councilor outside. And please come forward. Identify yourself. Has to be on this item. Thank you, Mr. Mayor.'",
        "'speaker_9': 'Honorable members of the Council. My name is Stephen Downing. I am a resident of Long Beach living in Belmont Shore area. I hope that in accepting this recommendation for a settlement, that you reject the transmittal from the city attorney that serves the city and the officers deny using excessive force.'",
        "'speaker_9': 'I agree with the recommendation of settling for $50,000 as a good deal for the city. In light of the brutality, the egregious violation of Mr. Brooks's constitutional rights and the over destruction of property executed under the color of authority.'",
        "'speaker_9': 'However, the City Attorney's Letter of transmittal establishes the city's position that the city and the officers deny any excessive force was used. Judging from past actions, including the recent false and misleading representations and election law crimes perpetrated by the Long Beach Police Officers Association upon the electorate and the continuing influence they have perpetrated and have maintained the'",
        "'speaker_9': 'status quo within the City Attorney's Office. I fully expect that the officers would deny that any excessive force was used, but it would be a travesty for this Council to let stand the position taken by the city attorney that supports the legitimacy of involved officers actions in the eyes of the Long Beach community.'",
        "'speaker_9': 'To do so would to would be to denigrate the police department, its leadership, and the rank and file professionals whose reputation and hard work have been tainted by those few incompetents who were able to worm their way into the ranks of the police department and remain there, remain there because of the vested interests of the police union'",
        "'speaker_9': 'that continues to outweigh the interests of the people. The city attorney's office, since the time the brutality of this case was first shown on that screen to this council, the entire city council two years ago saw it. He's tried to obfuscate this incident, as well as threaten those who tried to bring the scope of its horrors to'",
        "'speaker_9': 'the attention of the public. The Long Beach Post first wrote about the incident, and the city attorney Robert Shannon retaliated by sending a letter to the publisher demanding that the article be retracted, threatening unspecified legal action if the publisher failed to do so.'",
        "'speaker_9': 'Shannon was most upset with the fact that the Long Beach Post revealed that one of his own deputy city attorneys was present at the raid, which gave rise to the question that the officers.'",
        "'speaker_1': 'Had to conclude.'",
        "'speaker_9': 'I'm sorry.'",
        "'speaker_1': 'You need to conclude your time has expired.'",
        "'speaker_9': 'All right. Let me conclude.'",
        "'speaker_1': 'Now, quickly.'",
        "'speaker_9': 'I'm sorry.'",
        "'speaker_1': 'Quickly, please. Okay. 3 minutes. I'm sorry.'",
        "'speaker_9': 'That's okay. I've been a while.'",
        "'speaker_1': 'I think we get. I think I.'",
        "'speaker_9': 'Saw a few other moments this evening go for more than 3 minutes. But I've asked the city clerk to enter my letter into the record and offered it to the press. I think this is going on too long in this city.'",
        "'speaker_1': 'Thank you. Thank you very much, Mr. Parkin. It sounded as if you were describing something, not advocating something, just. Can you put some color on that?'",
        "'speaker_7': 'Thank you, Mayor. This evening, the action before you tonight is a recommended settlement. There was no admission of liability by the city of Long Beach. And Mr. Dowling is incorrect. So the. The action speaks for itself. It's a favorable settlement.'",
        "'speaker_7': 'We recommend settling this matter.'",
        "'speaker_1': 'You were conveying to us that the officers still deny any wrongdoing.'",
        "'speaker_7': 'That is correct.'",
        "'speaker_1': 'I want to make that clear. In the interest of fairness here. All right, we have a motion and a second. Any additional public comment? All right, members, cast your votes.'",
        "'speaker_6': 'Motion carry six votes. Yes.'",
        "'speaker_1': 'Item 13 Cllr Cary.'"
    ],
    "Resolution in Support of Senate Concurrent Resolution 115 Honoring Senator Oropeza.": [
        "'speaker_6': 'Out of 13. That's communication with the office and Vice Mayor Robert Garcia, Councilmember Susan Lowenthal and councilmember James Johnson with the recommendation that the rec to request the city attorney to prepare a resolution in support of Senate Concurrent Resolution 115, which affirms support for the accomplishments of Senator Jenny Oropeza.'",
        "'speaker_1': 'All right, Mr. Vice Mayor.'",
        "'speaker_3': 'Thank you. This is just a basic resolution of support for a Senate bill. That Senate discussion is happening right now. As we all know, the late Senator Oropeza served our city council, served on the school board, got elected to the assembly, and then moved on to the state senate.'",
        "'speaker_3': 'She's served Long Beach very well from her early days at Cal State, Long Beach and and and beyond. And so this is just a way for us to support what's already happening and try to move it forward. I like the motion with that moving.'",
        "'speaker_1': 'Seconded any member of the Public District Council on this item? Mr.. Austin.'",
        "'speaker_11': 'Thank you, Mr. Mayor. I fully support this. I think this is long overdue. Senator Peyser was a early role model and a very good friend of mine. She really introduced me in many respects to politics here in Long Beach when I was an aerospace worker with the UAW Local 148, and we were in support of her very'",
        "'speaker_11': 'first city council run. Became very close friends with her thereafter. Like I said, I support this greatly and I think it's long overdue. She made an indelible impression and having be the Freeway 17 freeway named after her, I think is appropriate.'",
        "'speaker_1': 'Mr. Johnson.'",
        "'speaker_10': 'Well, thank you, Mayor. And I will thank the vice mayor for inviting me to co-sponsor this item. Many of us knew Center or A and remember her many years of service from the Times and the school board to her time as state senator.'",
        "'speaker_10': 'And I think, you know, naming part of the 710 Freeway after her is particularly appropriate because of the many improvements we're in the process of making of that freeway. Many of you may know that we're talking about the future of that freeway, creating better air quality for our residents by incentivizing zero emissions goods movement, saving lives by'",
        "'speaker_10': 'making that freeway safer, particularly the lives of low income communities who disproportionately use this freeway. So I think center or a paisa would smile on us from from above. Thinking about her name will be a part of this freeway, which hopefully in the coming years will be part of saving lives for residents, decreasing congestion and also improving'",
        "'speaker_10': 'air quality, which I know overall goals of. Senator Peyser.'",
        "'speaker_1': 'All right. We have a motion in the second. Members cast your votes on item 13.'",
        "'speaker_6': 'Motion carries six votes out of 14. Click to report Ant Financial Management with the recommendation to be seen for the investment report for the quarter ended March 31st, 2014.'"
    ],
    "Resolution to Approve Loan and Note for Harbor Department.": [
        "'speaker_6': '15 is a report from Financial Management, the harbor department with the recommendation to adopt a resolution approving the incurrence and issuance of by the Board of Harbor Commissioners of a loan provided by the United States Department of Transportation.'",
        "'speaker_6': 'And related subordinate Harvard you harbor revenue vote you know aggregate amount not to exceed $325 million.'",
        "'speaker_1': 'So moved move moving seconded any member. The public was just outside of 15. Any council discussion, Mr. Johnson.'",
        "'speaker_10': 'Well, thank you, Mayor. And I guess I just want to hear from the director. I think Mr. Morrow is here. My understanding I remember we originally talked about the bridge, the ports contributions would be around 10%, which I think was $90 million.'",
        "'speaker_10': 'And then that became 180 million. And now it sounds like it's higher. So I'm just kind of curious, what is the port's share right now and what are efforts, if any, to kind of contain those costs?'",
        "'speaker_4': 'Yes. Thank you, Mr. Mayor and council members. My name is Al Moreau, acting executive director of the Harbor Department. The current budget for the bridge is approximately $1.2 billion. When we initially initially started the project, the budget was about $950 million.'",
        "'speaker_4': 'So roughly $350 million increase in in cost. A lot of that was associated with the revenue clearance for clearing. Right. Excuse me right away. Clearance clearing the right of way for the new bridge immediately north and adjacent to the existing bridge.'",
        "'speaker_4': 'The majority of that work is behind us, so we feel very confident with the current budget of $1.2 billion. We are similar to financing schemes where we look for low interest loans that help repay the the the debt that we've incurred on this bridge.'",
        "'speaker_4': 'We are also working with state and federal government to find any kind of transportation grant funds that are available, and we'll continue to do that through the life of the project.'",
        "'speaker_10': 'Now things tomorrow. So I guess on that last point. Right now we're bearing that additional cost, but you're exploring every avenue to see if state or federal partners may be willing to chip in, maybe given the escalations that what I'm hearing.'",
        "'speaker_4': 'That's correct.'",
        "'speaker_10': 'Okay. Thank you.'",
        "'speaker_1': 'Okay. Any other any other questions here? Cast your vote tonight at 15.'",
        "'speaker_6': 'Motion carry six.'",
        "'speaker_1': 'Voted item 16 Clerk read the report.'"
    ],
    "Agreement with AAAE to host 2017 Annual Conference and Exposition.": [
        "'speaker_6': 'Report from Long Beach Airport with a recommendation to authorize city manager to execute an agreement with the American Association of Airport Executives to host the 2017 annual conference.'",
        "'speaker_3': 'Call moved.'",
        "'speaker_1': 'I can move and seconded. Do we want to do this, Mario? Good. And here them.'",
        "'speaker_3': 'The city council. This is a very good conference for everybody.'",
        "'speaker_1': 'I know you worked hard on this. And I want to thank you for that's a great thing to come to the city. Thank you very much. Any any member of the council any council discussion. Mr.. Austin.'",
        "'speaker_11': 'Well, I think this is a great accomplishment, and I support it. I just want a commitment from our airport director, outgoing airport director, Mr. Rodriguez, that he'll be here to attend.'",
        "'speaker_3': 'And yeah, most definitely I'll be here.'",
        "'speaker_11': 'All right. We look forward to.'",
        "'speaker_1': 'It occur, Mr. Rodriguez. 2017th September.'",
        "'speaker_4': '2017. Honor about the weather's good here.'",
        "'speaker_3': 'Better than where you'll be.'",
        "'speaker_1': 'Hey, thanks again. Mary did a great job. And as I was there when we first pitched this and it was this terrific.'",
        "'speaker_3': 'Thank you. Thank you very much.'",
        "'speaker_1': 'All right. A council discussion. Members cast your votes on item 18.'",
        "'speaker_6': 'Motion Carry six vote yes. Item 19 to recommendation to adopt specifications award a contract convergent technologies for the airport security system.'"
    ],
    "Resolution to Condemn the Abduction of Female Students in Nigeria.": [
        "'speaker_6': 'Of correspondence from the Office Council Mentorships Key Council Member Lost and Council Member Stephen Neal with a recommendation to the City Council to contend the inhumane treatment and abduction of female students by our militants from the government. Government Girls Secondary School in the north defense northeastern province of Borneo.'",
        "'speaker_1': 'Distrusted.'",
        "'speaker_11': 'Yes. By now, most of you may have heard about the kidnaping of almost 300 female students that took place in Nigeria on April 14, 2014. Most of the students, these are students, most of whom are in the ages of 18, 16 and 18 and are thought to have been abducted by armed militia group Boko Haram, a well-known'",
        "'speaker_11': 'group known to oppose the education of girls. While few of the girls managed to escape, most almost two of 200 of them remain missing. The Senate recently passed a resolution condemning the abduction. And we're asking this is body language city council to adopt a similar resolution tonight.'",
        "'speaker_11': 'Joining the mothers, the U.S. Senate, the U.S. Senate and communities around the world in protesting this this atrocity, Russia's crime. This resolution outlines the situation in great detail. But let me provide you with a few details to help explain our request and add the voice our voice to the international community on the issue.'",
        "'speaker_11': 'As I mentioned, the girls were abducted in the middle of the night from a boarding school in northeastern Nigeria. Hundreds of students have been killed in the past year by this terrorist organization in this region of Nigeria. Boko Haram is known to oppose the education of girls and has targeted schools, mosques, churches, villages and in a violent'",
        "'speaker_11': 'campaign of terror based on extreme interpretation of Islam. The leader of the organization has taken responsibility for the abduction and has said that the girls will be sold into sexual slavery. With this resolution, the City of Long Beach expresses its strong support for the people of Nigeria, especially the parents and families of the girls abducted by the'",
        "'speaker_11': 'terrorists. Recognizing that every individual, regardless of gender, should have the opportunity to pursue an education without the fear of discrimination and reaffirms its commitment to ending discrimination, violence and violence against women and girls. I ask for unanimous approval.'",
        "'speaker_1': 'So we have a motion to have a second. Second. All right, Mr. Neil.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And I stand with the coauthors of this resolution. And also on a secondary note, in regards to the issue of sex trafficking and sex slavery.'",
        "'speaker_3': 'Which is a.'",
        "'speaker_10': 'Huge issue here in the city of Long Beach. Many of our residents are not aware, but this city happens to be one of the areas where the the sex trafficking occurs right through our corridors, particularly Long Beach Boulevard.'",
        "'speaker_10': 'So on several levels, I stand in agreement with this and I asked Councilmember Austin for unanimous approval. Thank you.'",
        "'speaker_1': 'Mr. Austin.'",
        "'speaker_3': 'Yes.'",
        "'speaker_11': 'And I'd be remiss if I did not recognize a council member who was not here for her, her or her leadership in putting this this item forward.'",
        "'speaker_1': 'We have a motion. And second, any member of the Public Trust Council inside of the council discussion members was cast your vote tonight and 23.'",
        "'speaker_6': 'Motion carry six vote. Yes.'",
        "'speaker_1': 'You business, Mr. Neal.'",
        "'speaker_10': 'Thank you, Mr. Mayor. I would like to inform everyone to please join me this Saturday for the third annual Latin Jazz and Blues Festival. This event kicks off at 2 p.m. and we will have nonstop music, food, fun until 8:00.'"
    ]
}