{
    "Appointment and Compensation for the City Clerk.": [
        "'speaker_0': 'Thank you. With that, we're going to go ahead and begin with the first item we're going to be taking up tonight, which is the appointment of our new city clerk. If I can have the clerk, please read item.'",
        "'speaker_0': 'I believe it's 23 items. Item 3131 I'm sorry about that. Yes. 31.'",
        "'speaker_1': 'Please report from Human Resources recommendation to adopt a resolution approving the appointment and terms of compensation for the city clerk said.'",
        "'speaker_0': 'Okay. There's been a a motion. Can I get a second? Okay, there's a motion, a second. And we'll have an opportunity for, ah, the City Hall Department to come and say a few words after the vote. But is there any public comment on the motion in front of us?'",
        "'speaker_0': 'Casey. Nonmembers, please go and cast your votes.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Great. Well, first of all, everyone just give a round of applause and welcome. I want to welcome our new city clerk, Maria de la Luce Garcia. No relation, by the way. Please come forward and I'm going to say a few opening comments and then turn this over to a few of the council members.'",
        "'speaker_0': 'And then finally we'll end with with our new clerk. Begin by saying that, as most people know, we've had an incredible city clerk in the city of Long Beach. For many, many years, those that new Leroy Herrera Cabrera have been impressed with his leadership.'",
        "'speaker_0': 'But most importantly, he also left behind an incredible staff of skilled that love Long Beach. And we're very proud and honored to have that entire team as part of our city family in conducting our search. I think the council was looking for a lot of qualities in our new clerk and in Maria Garcia, we certainly found those'",
        "'speaker_0': '. And so our new clerk comes to us with a lot of experience from the city of Los Angeles working in the elections office there. And before that did a lot of work with voter engagement for a national elected official organization, as well as was very involved in election reform, engagement in the city of Los Angeles, as well'",
        "'speaker_0': 'as she is a masters master's degree student currently at USC. So right on and did her undergrad at Vassar, I believe, and came with a lot of really great recommendations. And so we want to welcome you to the Long Beach family.'",
        "'speaker_0': 'In many ways, she is part of the family cause she's a Long Beach resident and has been, I know, for some time. And so we want to we want to thank you for your new commitment to Long Beach.'",
        "'speaker_0': 'We'll be seeing you here week after week and day after day in the interactions that you have with our office and and the offices of the council members. And it's not often that you get to select a new city clerk for your city.'",
        "'speaker_0': 'It's a rare occasion. Usually they they're around for a while because they love the job and we love having them. But it is a special moment, I know, for you and for your family and certainly is for the city of Long Beach.'",
        "'speaker_0': 'And so, Clark Garcia, we want to we want to welcome you officially to the city of Long Beach and elect like to have the council say a few words and then if you wouldn't mind saying a few words as well.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_4': 'Thank you. I am particularly proud that we at the Council came to the decision to hire you. There are very few positions in the city that the council has direct control over and we took this process very seriously, and you and your family should be very proud of what you've accomplished to date.'",
        "'speaker_4': 'And we expect many, many more things from you. I know that I'm first at reading your resume. I was very impressed. And as we got to meet you along the way and throughout the process, you just continued to dazzle us.'",
        "'speaker_4': 'And I know that what was most important to me is how, through getting to know you and your resume and your cover letter and all the interviews you went through, I believe that you believe in transparency and fairness and encouraging every single person to exercise their right to vote.'",
        "'speaker_4': 'And I know that through the engagement processes that you've already been a part of across the country, bringing that to Long Beach, we have a very bright future ahead. So from the very active voters of the fifth District, we welcome you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_2': 'I, too, want to welcome you. The the pool of applicants that we reviewed and those we interviewed were all extremely qualified. Every single one of them would have made an amazing clerk. And we believe that of you. We believe that you're going to do a great job and that you fit with our city.'",
        "'speaker_2': 'And you're a resident of our city, I believe. Are you in the third?'",
        "'speaker_4': 'I'm in the seventh.'",
        "'speaker_5': 'Okay.'",
        "'speaker_2': 'By the seventh, yeah. Councilman Super. And I just asked me if I want to change my vote. Well, we welcome you, and I look forward to working with you for many years. So thank you. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman.'",
        "'speaker_2': 'Congratulations, Madam Clerk. It's very exciting. I know just speaking with you during your interview was very impressed. And I look forward to working with you as the chair of the Elections Oversight Committee. It's exciting to be able to talk about how to engage our voters and our residents a little bit more.'",
        "'speaker_2': 'So thank you very much and congratulations.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Councilman Turanga.'",
        "'speaker_6': 'I knew you were in a sense when I read your address. I just. One simple word. Bienvenido. Looking forward to working with you.'",
        "'speaker_5': 'Good.'",
        "'speaker_0': 'Councilmember Richardson.'",
        "'speaker_7': 'I think the council all said it best. Welcome to the Long Beach family. I think voter engagement is certainly an art as much as it is a science, and I think you have a knack for it. And so we're really excited to see that see you of our our team in helping us lead and lead our effort'",
        "'speaker_7': 'to engage more engage more people in government. So thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I, too, want to extend my congratulations and welcome to our city family. Your joining this family at a time when the entire council is interested in innovation. You are coming to a city that's put a new innovation team together.'",
        "'speaker_8': 'And every effort you make to engage voters in as. Interesting away as possible, unsuspecting way as possible is something that we're all looking forward to. Thank you.'",
        "'speaker_0': 'Thank you. And I have Council Member Andrews.'",
        "'speaker_9': 'Yes, thank you. First of all, I'd like to congratulate you. And I hope you can work for your colleagues, like, you know, our former, you know, city character. But the biggest part about you will be seeing me more often.'",
        "'speaker_9': 'You will see the other individuals, because I like to come down and just surprise people and see what they know, who I am. Thank you.'",
        "'speaker_0': 'Council embarrassed them.'",
        "'speaker_10': 'Thank you very much and welcome to this. Garcia, you want a very competitive process. There were a lot of very good candidates and you stood out among the crowd and it was unanimous on this council that you were the obvious choice to be our next city clerk.'",
        "'speaker_10': 'And so I wanted to take this opportunity to welcome you, congratulate you, and just say how great it is to have a Long Beach resident, somebody who who has a real stake in the game as our next city clerk.'",
        "'speaker_10': 'I look forward to working with you.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_0': 'Councilmember Super.'",
        "'speaker_11': 'Thank you. Well, I've already congratulated you privately before the meeting, so I just like to say welcome, welcome aboard. And just give you a lot of assurance that you have a great staff here. And if you ever need my help, I'm the newest guy up here, but I'll be glad to assist.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'Thank you. And now I'll turn this over to our new city clerk, Maria Garcia.'",
        "'speaker_5': 'Well, first of all, I'd like to thank all of you, council mayor, for entrusting.'",
        "'speaker_4': 'Me with this great responsibility. It's a responsibility that I don't take lightly, and I will do my best to represent this city and my department in the best way possible.'",
        "'speaker_5': 'More importantly, I am going to work really hard to make voter engagement a top priority for our department.'",
        "'speaker_4': 'Making sure that all of our residents, especially those that are hardest.'",
        "'speaker_5': 'To reach.'",
        "'speaker_4': 'Because of language, access or access, physical accessibility.'",
        "'speaker_5': 'I will be paying attention to the to those issues.'",
        "'speaker_2': 'As well as bringing more innovation to our department.'",
        "'speaker_4': 'And making sure that.'",
        "'speaker_5': 'We are walking hand-in-hand into the digital age with the rest of America. Moving forward, it will be all about the residents of Long Beach and.'",
        "'speaker_4': 'Providing them with municipal services that are inclusive.'",
        "'speaker_5': 'Transparent, accessible and.'",
        "'speaker_2': 'Reflective of the diversity of this great.'",
        "'speaker_4': 'City.'",
        "'speaker_5': 'Earlier today, I had a chance to meet my new city family. The staff of the city clerk department. And I got to say, I'm really excited. I'm excited to be working among such a hard working, talented staff.'",
        "'speaker_4': 'And I can't wait for August.'",
        "'speaker_5': '31st to come. It can't come fast enough. So thank you.'",
        "'speaker_4': 'I want to acknowledge some special people in the audience here today to accompany me on this special occasion. Family. My mom. If I could ask her to please stand. Christina. My father. Javier.'",
        "'speaker_5': 'My uncle Filiberto. My brother Ramon. And his wife, Nancy. I don't know if my sister's here as.'",
        "'speaker_2': 'Well, but.'",
        "'speaker_4': 'She didn't tend to come. Assemblymember Garcia and I, I know that she would have loved to be here if she's not in the audience right now. So I want to also acknowledge her. Thank you.'",
        "'speaker_0': 'Thank you. And thank you all very much again. And congratulations. And with that, the your boss, I'm sure, to celebrate with your family and friends. And we'll continue the meeting. Thank you. Okay. Next, we're going move on to our commission appointments.'"
    ],
    "Charter Commission Appointments Confirmation.": [
        "'speaker_0': 'And we have items 24 and 25. We're going to do item 24/1.'",
        "'speaker_1': 'Communication from Mayor Robert Garcia. Recommendation to confirmed charter commission appointments.'",
        "'speaker_0': 'Thank you. I'm going to turn this over actually to Councilmember Austin. Okay.'",
        "'speaker_10': 'So thank you, Mr. Mayor. As a chair of the Personnel and Civil Service Committee, we met a little earlier today and we unanimously voted to accept the recommendations for charter commission appointments. There were a number of eight members either appointed or reappointed to the Citizen Police Complaints Commission.'",
        "'speaker_10': 'And to give them honor, I'd like to at least acknowledge them. To see PCC Josie Josephine Castellanos is the eighth District resident. She's appointed to a second term, if I can ask you to please stand. Alvaro Castillo, a fifth District resident appointed to a first term.'",
        "'speaker_10': 'David Clement, a third district resident, reappointed to a second term. Jose Flores, a sixth District resident appointed to a partial term. Richard Lindemann, a fourth District resident appointed to a first term. Miles Nevin, a second District resident appointed to his first term.'",
        "'speaker_10': 'Jeff Pryce, the seventh District resident, is reappointed to a second term and Tooley Sorrell is At-Large and a seventh District resident is appointed to a partial term. Let's give all of the new PCC commissioners a.'",
        "'speaker_6': 'Round of applause.'",
        "'speaker_10': 'We're not done yet. On the Civil Service Commission, which is also a charter commission. We have Ms.. Phyllis areas. She's an eighth District resident, and she's been appointed being appointed to her first term on a term on the Civil Service Commission.'",
        "'speaker_10': 'And she has more than 30 years of experience in higher education in Long Beach City College, including work on personnel policies and procedures, budget management, governance structures, planning processes and curriculum development. And she served on the college's academic Senate Synod Executive Committee, Academic Council and College Planning and was elected President of the Academic Senate.'",
        "'speaker_10': 'Congratulations, Ms.. Areas. You are also on the civil service commission. We have Mr. Rick middleton, mclemore. He currently serves on the service. Civil Service Commission is being reappointed to a third district to a second term to his first full term.'",
        "'speaker_10': 'And he's a third resident. Excuse me. Rick has 25 years of federal government experience serving as an equal opportunity specialist with the U.S. Air Force and the U.S. Customs Service. And Mr. Middleton McLemore was also appointed to the Civil Service Commission by Mayor Foster in 2014 to fill the final year of an open term.'",
        "'speaker_10': 'Congratulations, Mr. McLemore. And we also have one. Parks and Recreation Commission appointee. And that is Ms.. Stella Ursula. She's filling in At-Large seat. She is a second district resident and she's been appointed to a partial term. She's the president of the Green Education Inc. and principal at Stellar Sustainable Consulting.'",
        "'speaker_10': 'She has served as a commissioner with the Long Beach Sustainable Cities Commission, with the Long Beach Community College District Citizens Oversight Committee, and a steering committee member with Building Healthy Communities. Ms.. SEWA is a founder of Local Earth Day Events and Green Praise Festival and launched the Southern California Green Art Council.'",
        "'speaker_10': 'Very impressive. Congratulations to your appointment to the Parks and Recreation Commission and. And lastly, we have four new members or appointed or reappoint members to the Planning Commission. I would like to recognize Mr. Ronald Cruz to win that large seat.'",
        "'speaker_10': 'He's a fourth District resident and it's appoint an appointment to a partial term. He graduated from Cal State University, Long Beach, with a degree in geography and took his first job as a city planner here in Long Beach.'",
        "'speaker_10': 'He spent five years at City Hall before moving into a private development firm and has no nine years of planning experience. He lives in the fourth District and has a master's degree from Cal State University, Long Beach. Andy Perez is being appointed to a At-Large seat.'",
        "'speaker_10': 'He's a second seventh District resident. He's been reappointed to his first full term, and he currently is a public affairs bureau manager with Union Pacific Railroad as a director of port affairs for Long Beach, Los Angeles, Oakland and San Francisco.'",
        "'speaker_10': 'He's a graduate of Cal State University, Dominguez Hills. Mr. Perez served long has served long on the board of directors with the Long Beach Boys and Girls Club and the Regional Hispanic Chamber of Commerce. Congratulations, Mr. Perez. And I'd also like to recognize the re-appointed Mr. Anita van Warwick to an at large seat.'",
        "'speaker_10': 'He is an eighth District resident and is a Long Beach City College scholarship recipient and graduate of Columbia City. She has also attended Cal Poly Pomona with a B.S. cum lady in business management. She has had many years of leadership and volunteer experience in many organizations, including the Long Beach Nonprofit Partnership.'",
        "'speaker_10': 'She's volunteered with the Long Beach Day Nursery, Long Beach League for John Tate, John Tracy Clinic, the Long Beach City College Foundation, Board of Governors and the Long Beach Museum of Art. Thank you, Mr. Van Horn, for your service and congratulations.'",
        "'speaker_10': 'And our final appointment to the Planning Commission and we're asking for a component of this full city council is Mr. Eric Verdugo Vega, Brazil's produce. Go figure. I'm sorry. He's being appointed to an at large seat. He's a sixth district resident.'",
        "'speaker_10': 'He's been reappointed to his first full term. He's the president and CEO of the South Bay Latino Chamber of Commerce and a South Bay Latino Community Development Corporation. He also manages real estate and restaurant investments and has served on the Los Angeles County Workforce Investment Board as his vice chair.'",
        "'speaker_10': 'Congratulations, Mr. Reduce Gall Vega. And so with that Council, it is the recommendation of the personnel of the Civil Service Committee that we accept the mayor's nominations for all these charter commissions. I want to just add my personal comments that all of them are very well qualified and a very impressive group of commissioners who definitely have the'",
        "'speaker_10': 'city's best interests at heart, and they all are true public servants. And so with that, I would recommend full support.'",
        "'speaker_0': 'If you want to put the motion in council member short for. It's done. Okay. It will get some. Someone sick in there. Okay, great. We have a couple folks I want to do public comment. Councilman Gringa.'",
        "'speaker_6': 'As a member of the Personal Civil Service Commission, I want to welcome all the new appointees. As I looked into the crowd, I got to see some old faces and new friends. Let me change that. Some old friends and new faces that that are that are coming and joining the city family and their service on these commissions'",
        "'speaker_6': '. So I welcome you and look forward to working with you. And I always know that my office is available to you at any time. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Price.'",
        "'speaker_2': 'I want to welcome all of you as well. Just Alvaro Castillo and I have been friends for 20 something years, and I'm very proud to see that he's getting he's always been very involved in his community. But to have him be involved in the city is it's an honor.'",
        "'speaker_2': 'And I'm very proud of you. So thank you. And of course, Ricky Rick is as a resident of the third district. And I fully support your work and all the things that you do for this city and your service on multiple commissions.'",
        "'speaker_2': 'This isn't your first one and not your first term, so thank you for your service. I'm grateful to have you in my district, and I'm grateful that you're a resident of Long Beach. So thanks, everyone else.'",
        "'speaker_0': 'Thank you. And Councilwoman Gonzalez, I.'",
        "'speaker_2': 'Wanted to thank each and every one of you for your commitment to Long Beach and your service. I know many of you have full time jobs for doing this. In addition to is just commendable. But I've talked to a few of you as personal friends and you're so very excited to serve and that is what makes this'",
        "'speaker_2': 'position most amazing. So thank you.'",
        "'speaker_0': 'Thank you. Okay. And I want to also thank you all for your service before we take the vote. And, you know, it's interesting, one of the interesting things that Councilman Price oh, actually have one more Councilman Mongo and then I'll see my comments.'",
        "'speaker_4': 'I, too, want to take a moment to thank each and every one of you. The the citizen engagement process is one of the most important processes that we have next to our right to vote. And so thank you for each and every one of you for first going online and applying to serve.'",
        "'speaker_4': 'And I encourage anyone watching at home to take a moment and see the new revamped online website where you can apply to serve your constituents, your neighbors, and the city of Long Beach as a whole. Because without the citizen participation model, we're up here representing all 500,000 people.'",
        "'speaker_4': 'And so we really appreciate the ability to work through each and every one of you each and every week. So thank you very much for your service.'",
        "'speaker_0': 'Thank you all. And before we take the verdict, I want to say I love seeing so many folks that I kind of knew through college when I was in school, including Councilman Price and Alvaro and Ron and Eric and all guys and gals that we all knew each other through our Cal State Long Beach days in some'",
        "'speaker_0': 'way or another. And so it's it's it's nice to be here at this point and to see everyone working, working together 20 years later. So with that, we can go ahead and take a vote. It'd be great. Great.'",
        "'speaker_0': 'Congratulations to all of you. And now we have our second set of commissioners, which is 825.'"
    ],
    "Establishment of the Midtown Business Improvement District.": [
        "'speaker_0': 'Some turn this over to the clerk to read item hearing.'",
        "'speaker_1': 'One report from city manager recommendation to receive supporting documentation into the record. Conclude the hearing to consider the establishment of the Midtown Business Improvement District. Direct the City Clerk to tabulate the ballots and report the results of the tabulation to the Mayor and City Council during tonight's meeting.'",
        "'speaker_1': 'And if a majority of ballots received are in favor of the establishment of the bid, adopt a resolution to establish the bid for an initial term of five years. District four and six. The city clerk is still accepting ballots.'",
        "'speaker_1': 'If there's any member of the public that has a ballot, they'd like to surrender. Please come down to the counter.'",
        "'speaker_0': 'Okay. I'm going to start off with a staff report from the city manager.'",
        "'speaker_13': 'Thank you, Mr. Mayor. Members of the city council. The staff report will be conducted by Mike Conway, our director of Economic and Property Development.'",
        "'speaker_0': 'Mayor Garcia. Members of the City Council. Property owners of record along East Anaheim Street between Raymond Avenue and Alamitos Avenue. Who will pay more than 50% of the proposed assessment, have submitted petitions to the city for the establishment of a business improvement district to be identified as the Midtown Business Improvement District.'",
        "'speaker_0': 'The new business district will be compromised or comprised of property owners within the proposed boundaries, and the district plan details the boundaries of the bid and the improvements and activities for which the assessment funds will be used. And the bids engineer's report details the amount and method of assessment for each parcel.'",
        "'speaker_0': 'If established, the bids shall commence on January 1st, 2016, for the initial five year period of January 1st, 2016 through December 31st, 2020, and City Council will annually review and consider approving the renewal of the levy budgets and reports submitted by by the bid.'",
        "'speaker_0': 'As approved by the City Council on June 16th, 2015, and to comply with California Constitution, a notice of assessment and an assessment ballot were mailed to property owners who are proposed to be assessed. At the conclusion of this public hearing, an independent third party will tabulate the votes and will return to City Council later during this meeting'",
        "'speaker_0': 'to announce the results. If a majority of ballots received with a weighted assessment amounts are in favor of the establishment of the bid, the City Council may proceed with the adoption of the resolution establishing the bid. If a majority of the ballots received do not support the establishment of the bid, then the bid cannot be established.'",
        "'speaker_0': 'Ballots may be accepted up to the time that the public hearing is closed, at which time no more ballots will be accepted. And any member of the public may observe the tabulation process according to the guidelines that no cell phones shall be used.'",
        "'speaker_0': 'No questions shall be directed to supervisory staff. Observers shall not interrupt or speak to the ballot processing staff, and observers shall not approach the ballot the ballot processing staff. So with that staff requests that counsel will receive the reporting documentation into the record, conclude the hearing to consider the establishment of the bid director, city clerk to a'",
        "'speaker_0': 'tablet to tabulate the ballots and report the results of the tabulation to the Mayor and City Council during this meeting. And if a majority of the ballots received are in favor of establishing the bid, adopt a resolution to establish the bid for the initial term of five years effective January 1st, 2016, through December 31st, 2020.'",
        "'speaker_0': 'And that concludes my report. Okay. Thank you. With that, I'm going to turn this over to those that made the motion. And then remember, this is a two part process. So we're going to have the motion. We're going to take a vote.'",
        "'speaker_0': 'Mr. City Attorney, is that correct? On the on the hearing motion? Is that right? Mr. City Attorney.'",
        "'speaker_14': 'Yes. We would come back.'",
        "'speaker_0': 'We would conclude we take the vote first and then we come back on the second.'",
        "'speaker_14': 'No, we take the vote after the tabulation of the ballot.'",
        "'speaker_0': 'Okay. So and we would also do can we do public comment now?'",
        "'speaker_14': 'We do public comment and any protest now they want to come forward and discuss it for the council and then we adjourn to candidates.'",
        "'speaker_0': 'Excellent. So let me take let me begin by saying if there's any protests on the hearing from the public. Any comment on it? Saying None. I'm going to allow both Councilmember Andrews and Councilman Superhot to make a few comments.'",
        "'speaker_0': 'Oh, sir, please. Yes. Come forward. Or if you'd like to go up there, you can do your comment from the top as well either either way. Okay?'",
        "'speaker_9': 'Yes.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'No worries, sir. Just please give us your name for the record and please begin.'",
        "'speaker_13': 'Mayor Garcia, this is Bruce Palmer Koch Cash Register Company, 1900.'",
        "'speaker_6': 'East Anaheim Street. I am against the Business Improvement District because I.'",
        "'speaker_0': 'Don't know how you could.'",
        "'speaker_6': 'Possibly improve my business. I talked to many people on the last two days. The businessman did not even get a say so in it along Anaheim Street.'",
        "'speaker_0': 'There are many small Cambodian.'",
        "'speaker_6': 'Businesses that are just barely.'",
        "'speaker_0': 'Making it and can't afford to have their rent increased.'",
        "'speaker_6': 'By this.'",
        "'speaker_0': 'Operation. It won't help their businesses, but yet we're getting it thrown at us. And the city owns 40% of the property. We need 51% say no.'",
        "'speaker_6': 'I don't see how we can possibly do that. I feel that the engineering.'",
        "'speaker_0': 'Of the project where they cut the lines. Was instrumental.'",
        "'speaker_6': 'In the.'",
        "'speaker_0': 'Fact that we would not be possible to obtain enough of a vote. The people that I talked to yesterday and today. Do not want this extra taxation type issue that is being thrown upon us. Myself. I'm 73. You want to charge me $5,000 over the next five years?'",
        "'speaker_0': 'And then I doubt that you would.'",
        "'speaker_6': 'Discontinue this operation.'",
        "'speaker_0': 'I imagine you would continue it on for as long as I would live, which may not be that long.'",
        "'speaker_6': 'Luckily for us.'",
        "'speaker_0': 'But I would like to have.'",
        "'speaker_6': 'Some relief in my old age, and I'd like to see everybody here. Think about all the people that came here from Cambodia. And the small businesses they have started. I don't think any one of you has walked this a district and talked to them.'",
        "'speaker_0': 'And asked them, do you want to pay extra money on your rent? For us to make the city.'",
        "'speaker_6': 'Clean, safe and beautiful. How are you going to do that? How are you going to guarantee me that you are going to improve my business? $980 a year. Is there any guarantee on that? That's a question for you, Mr. Mayor.'",
        "'speaker_6': 'Can you answer.'",
        "'speaker_0': 'That? This is not an opportunity to ask questions, but when you're concluded, I'll make some comments.'",
        "'speaker_6': 'All right. Well, like I say, after talking to so many of the people. I have noticed that all the blank. Places on this, which is over 60, were not even notified.'",
        "'speaker_0': 'I have a Filipino friend that.'",
        "'speaker_6': 'Is in the.'",
        "'speaker_0': 'A and cherry liquor store.'",
        "'speaker_6': 'He owns that property. He did not even.'",
        "'speaker_0': 'Get a ballot. Whoever did this job. Thank you, sir. Thank you, sir. Okay. Thank you. Thank you. So I'm going to turn this over to Mr. Andrews to make a few comments. I just want to just before he goes, you want to make sure that we're clear what the what the item is.'",
        "'speaker_0': 'This is a hearing to count the votes of those business owners in the proposed assessed property improvement district. And so this is obviously this is a democratic process that those that are in the assessed area have votes and they're weighted by size of property and so forth.'",
        "'speaker_0': 'And so we have, as you all know, a handful of these throughout the city, including in Bixby Knolls, the newest one being in North Long Beach, Belmont Shore downtown, and as well as Fourth Street. And I believe one of our newer ones is also on Anaheim, on east east Anaheim.'",
        "'speaker_0': 'So let me turn this over to Councilmember Andrews and then we'll begin the process of counting the votes.'",
        "'speaker_9': 'Thank you, Mayor. You know, first of all, I'd like to say I'm very happy to see that we have come to the point of counting ballots for the midtown bid. For many years, I worked with the Cambodian Town Inc business owners, the community in establishing this bid.'",
        "'speaker_9': 'As a result, a recent extensive work by stakeholders, city staff, consultants and state required stakeholders have been met and that if this final vote tabulated, conducted this evening indicate a majority support, the Council will ask to vote in favor.'",
        "'speaker_9': 'But established in Midtown Business Improvement District, I sincerely hope that my colleagues will support this item so that we can move forward with the beautification on nine corridor. The District will provide new improvement and activities, including a clean, safe and beautiful corridor that will encourage new business and development and attract additional business and they service.'",
        "'speaker_9': 'And I think the most important part about all of this is that people will get a chance to vote and that will make final decision about all of it. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_4': 'Yes. With staff be able to provide us information on whether or not there are any opportunities for businesses that are having financial challenges to be able to apply for support on their bid fees.'",
        "'speaker_0': 'Council member Mungo That is not an opportunity. These are assessed through the property tax, through the county and they will be.'",
        "'speaker_6': 'Collected along with.'",
        "'speaker_0': 'Property taxes. And there really isn't an opportunity for abatement.'",
        "'speaker_4': 'So the bid, once it has a board in place, would not be able to refund those or give credits towards the business in any way.'",
        "'speaker_0': 'That's correct.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Vice Mayor Alonso.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I wanted to just show my appreciation to staff and everyone that's been involved in the bid to date when we worked with community members to create Cambodia Town in 2007. It was my hope that a business improvement district would in fact be formed to support the goals and aspirations of business and property owners'",
        "'speaker_8': 'along the corridor. So I wanted to share with everyone that I am extremely supportive, continue to be extremely supportive of this bid, and look forward to seeing this corridor evolve into a destination beyond its current success. Thank you.'",
        "'speaker_0': 'Thank you. I'm going to close the hearing now. We've done public comment. So what happens now is the clerk's staff will begin the process of tabulating the votes over the course of the meeting. Once the votes come back, if there is an affirmative vote, then the council then records that into the record by having the vote at'",
        "'speaker_0': 'that time. Is that correct?'",
        "'speaker_14': 'That's correct. At that time, the council will then consider the resolution establishing.'",
        "'speaker_0': 'Okay, great. And so we'll then go ahead and do that. So the clerk will go begin counting the ballots. And I know we're going to be transitioning to minimum wage in just a minute, but I want to get two things out of the way quickly.'",
        "'speaker_0': 'Consent calendar. Can you get a motion to approve? There's some staff here that we can clear a couple of seats probably. Can I get a motion in a second for consent calendar, please? Madam Quirk. It's a good thing they're putting it up.'"
    ],
    "Report on Citywide Minimum Wage Feasibility and Business Incentives.": [
        "'speaker_0': 'All right, so great. Congratulations. All appreciate that for being out here. So we're going to move on to the next item, which is item 27. Madam Clerk.'",
        "'speaker_1': 'Communication from Vice Mayor Lowenthal, Councilwoman Gonzalez, Councilman Andrews and Councilmember Richardson recommendation to request a report from the L.A. County Economic Development Corporation regarding the feasibility of any potential benefits and risks of implementing a citywide minimum wage. And proposals for incentives to assist businesses and nonprofit organizations in complying with a higher wage.'",
        "'speaker_1': 'Higher minimum wage.'",
        "'speaker_0': 'I'm going to turn this over to Vice Mayor Lowenthal.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I'd like to make the motion to move this item. And I want to thank my co coauthors as well on this item. We have. Sorry, I have to adjust my seat. We have numerous reports from cities regarding the growing gap between the rich and the poor.'",
        "'speaker_8': 'I don't think that's a surprise to anyone while the economy is certainly improved. For many of us, it hasn't improved. For all of us and various investors and companies in certain lucrative sectors continue to accumulate wealth. Cities and counties.'",
        "'speaker_8': 'What ends up happening is we are left to deal with the impacts of a growing class of residents living in poverty. Throughout the years that many of us have been on this council, we have noted that our city tends to be a tale of two cities, and I think that continues to be palpable here in our city'",
        "'speaker_8': ', even when many of us have. Experienced an increase in our economic benefits, increase in our household income. We don't see that across the board. What ends up happening when cities and counties are left with the burdens of this disparity that exist among those living in poverty?'",
        "'speaker_8': 'It affects our health. It affects our housing. It affects emergency services, which ends up costing more tax dollars to be used in a reactive manner rather than proactively through people's wages and in the local economy. As a result, the subject of minimum wage is being discussed and decided upon in numerous state and local council chambers throughout the'",
        "'speaker_8': 'nation, including the county and the city of Los Angeles. So Long Beach, as a city, doesn't have the luxury nor the reputation for shying away from this conversation. It's at our doorstep and it's here. Whether all of us like it or not, it is at our doorstep.'",
        "'speaker_8': 'I believe that the mayor, as well as my co-sponsors and I wish to approach this issue in a methodical and logical manner. We welcome any conversation that may improve the health and well-being of our residents. But we also believe there's another element to be considered here, and that's the impact on small businesses and nonprofits.'",
        "'speaker_8': 'That's why this study has another component to determine whether incentives or fee reductions could help local businesses. In as much as we have economic engines such as the port and downtown. We also know that small businesses, residents and our local economy are connected to one another.'",
        "'speaker_8': 'And so we'd like the study to look at the different perspectives and provide us with feedback and before any decisions made whether to move forward or not. And I encourage everyone to engage in this conversation and to engage in it in a way where our city can improve.'",
        "'speaker_8': 'And the quality of life of our residents and workers who don't live here can improve. Thank you, Mr. Mayor.'",
        "'speaker_0': 'Thank you. I'm going to turn this over to Councilwoman Gonzales. And if there is any objection, what I'd do is after the maker of the motion in the second or I'm going to open up the public comment and then I'll come back to the rest of those cued up.'",
        "'speaker_0': 'Councilwoman Gonzales.'",
        "'speaker_2': 'I, too, want to thank my colleagues, Vice Mayor Lowenthal, Councilman Richardson, Councilman Andrews, for bringing this forward. I know it's been said before she said it so very eloquently is that we still do have a problem with poverty and people trying to make a living for not only themselves, but their families, but also businesses that are trying'",
        "'speaker_2': 'to do the same thing as well. And while this is a current theme in adjacent cities and counties, I think we certainly still need to look at this and we need to take a really comprehensive look at this, a very mindful approach, as the vice mayor had mentioned.'",
        "'speaker_2': 'And for that, you know, I will be supportive of, of course, of this study as I'm a coauthor. But I hope that my colleagues can be supportive of this as well, because this is certainly not going away. The people that you see here work very hard.'",
        "'speaker_2': 'I know that as well. My father worked very hard and he still continues to work very hard to this day. And sometimes it's just not enough. And so I commend every single one of you for taking a stand and to to advocate for your for your what you believe is right and also for our business owners as'",
        "'speaker_2': 'well. And so I hope that this study will look at this comprehensively and so that we can so we can create something that means what is most for Long Beach? I know with other plans that we've done before, similar to like our project labor agreement, we wanted to make sure it was something that was that made sense'",
        "'speaker_2': 'for Long Beach. And so I look forward to seeing what the study will bring and I look forward to working with my colleagues on this. So thank you.'",
        "'speaker_0': 'Thank you. And as we begin public comment here in just a sec, I want to just say a few words that hopefully will set the stage for for the conversation. And so that we're clear about what is actually happening tonight with what the council is being asked to do tonight is to support a study that will be'",
        "'speaker_0': 'conducted by the L.A. EDC, which is the Los Angeles County Economic Development Corporation. That's this is an organization that's widely respected, not just within the in the business community, but in the workforce development sector as well. They did considerable work with the county's proposal.'",
        "'speaker_0': 'And so they will also be and already have a lot of the information on the issue that will be incorporated into Long Beach. So the idea, of course, is for them to take a look not just on what's going on with wages across the region and state, but also on how we can do things here that could'",
        "'speaker_0': 'support small businesses and our nonprofit community. I just want also everyone to know that it's very important. I know to the vice mayor and to the council members that have signed on to this, that the process be inclusive, that it includes obviously workers, but also small business owners and our nonprofit community, and that we collect, most importantly'",
        "'speaker_0': ', data. This is about collecting data and information in a way that's open and transparent. In the end, the final thing I'll say on this is one thing I pride myself in is that we do things in our community in the Long Beach way and we are going to do this our way.'",
        "'speaker_0': 'And I include and welcome everyone to be part of that process. L.A. did there, there, there process. The county did theirs. And the county was a little different than LA's. There were differences. We'll go through our process. And our process may also be different than the others.'",
        "'speaker_0': 'And I think that's important to note. But we will do we will complete this data and we will be open and transparent. And so I want to thank you all for being here tonight. This is a very important conversation.'",
        "'speaker_0': 'There is no question that there's a need and there's no question that wages and the growth of the economy have grown at a very different level. And so thank you all for being here. And with that, I'm going to open it up for public comment.'",
        "'speaker_0': 'Please come forward. Yeah. Feel free to line up. And when I say begin, I'll let you guys go ahead and and start. So please go ahead.'",
        "'speaker_15': 'Um, good afternoon, city council. My name's Alyssa Salazar. I'm the student body president for Cal State. Long Beach. Um, we are here today excited about the prospect that the Long Beach City Council will be tasking the Economic Development Commission with assessing the feasibility of increasing the minimum wage here at this great city.'",
        "'speaker_15': 'With recent alarming statistics about unemployment rate of college students and recent graduates aged 18 to 24, we believe it is necessary for students to be part of this process. Reasons that statistics state that unemployment rate among recent graduates is nearly 20%, nearly 40% among the Latinos and nearly 50% among the African-American community.'",
        "'speaker_15': 'Clearly, this is unacceptable for our country. We are passionate about this subject, and we would like to encourage the city to require student representation as part of this study. Thank you for your time, city council. Have a great day.'",
        "'speaker_0': 'Thank you. You know, you've got two former senator presidents up here, so congrats. Next speaker.'",
        "'speaker_5': 'Mayor. City Council representatives. My name is Susan Blair. I was born in Long Beach, and I've lived here my entire life. And I'm here to speak against the raising of the minimum wage and the study. Only one third of the workers of Long Beach live in Long Beach.'",
        "'speaker_5': 'So why in the world would our city council want to spend tens of thousands of dollars of my dollars and the city's citizens of this city, $2 for the two thirds that live outside of the city? Why are we worried about them?'",
        "'speaker_5': 'They're not going to spend the money here because our business owners are going to have to raise their their rates. To be competitive or to be able to afford to weigh the the increase in the wage. So one third of the city workers in Long Beach live in Long Beach.'",
        "'speaker_5': 'So they're going to take that raise back to wherever they live and they're going to spend it there. Why should an individual's pay be put on the back of business owners? If you don't like what, you make better yourself and go find another job.'",
        "'speaker_5': 'So what I did. I'm sure that's what most of you did. Raising the minimum wage will put teenagers out of work. Caused problems for seniors having to pay for home health care needs. Nonprofits in every other industry in our small business community.'",
        "'speaker_5': 'Raising the minimum wage also has huge rippling effects. What about the social programs that you provide and that government provides us with a minimum wage? All the taxpayers are going to have to pay more to compensate for the rise in the minimum wage.'",
        "'speaker_5': 'Long Beach will never be able to overcome their image of not being business friendly. If they pass this language as a small business community, it has been my entire life and it still is. You can count on both hands the number of large, large corporations that are in Long Beach.'",
        "'speaker_5': 'This is a small business community. This is not Los Angeles. This is not Seattle. This is Long Beach, California. Small Business Community. And that's as if that's not enough. The labor unions did everything they could to get the minimum raised to the minimum wage, raised to $15 in Los Angeles.'",
        "'speaker_5': 'And from what I understand, they're going back this week and asking the L.A. City Council to exempt them from the $15 minimum wage. Now, what's sad about. Are we supposed to believe that's fair? Raising the minimum wage is a serious issue.'",
        "'speaker_5': 'In a small business community like Long Beach. And I ask you, mayor and city council representatives, to not simply take this on because it's trending politically. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Mary Garcia.'",
        "'speaker_6': 'Councilmembers. My name is Bill. I did not plan on speaking on this topic. I came here for other reasons, which will be later on in during council members. But on this particular topic, I just want.'",
        "'speaker_0': 'To encourage extreme.'",
        "'speaker_6': 'Study on this and foresight. Our neighbor to the north, Seattle, had put the $15 minimum.'",
        "'speaker_0': 'Wage into place. Some hours got cut for some employees.'",
        "'speaker_6': 'Our new employees, their hours are like limited to 30 hours or 30 and a half hours or trying.'",
        "'speaker_0': 'To stay below 40 hours a.'",
        "'speaker_6': 'Week for employees. The other thing is the current issue of Fortune magazine has a very good.'",
        "'speaker_0': 'Article on the future of the workforce in our country as our workforce moves towards a more technologically.'",
        "'speaker_6': 'Advanced economy. Robotics will take away some of these jobs.'",
        "'speaker_0': 'So we need to find out how we're going to replace those workers. So the article here in Fortune magazine, which.'",
        "'speaker_6': 'I will scan and send to Clark to distribute to all of you folks, emphasizes that human.'",
        "'speaker_0': 'Values and collaboration are really.'",
        "'speaker_6': 'The human commodity of.'",
        "'speaker_0': 'The future.'",
        "'speaker_6': 'As we move towards technology. So I.'",
        "'speaker_0': 'Kind of want to discourage the $15 minimum wage because some employees that are already making higher wages.'",
        "'speaker_6': 'Within a business, they may and this is already happened across the country are leave the business because it's like, well, this.'",
        "'speaker_0': 'Person is not doing as much job as I am. Their job is not worth that value. I'm giving more value.'",
        "'speaker_6': 'To the company. So it's a really human study here.'",
        "'speaker_0': 'Aside from the actual wage itself. So thank you very much for let me say my $0.02. Thank you. Next speaker, please. Good evening, Mayor. Council members. My name is Mike Murchison. And a while back, several months ago, we formed the Long Beach Business Alliance, Gary DeLong and I did.'",
        "'speaker_0': 'We hosted a forum at the Long Beach Airport, Marriott. There were 50 business owners and executive directors from nonprofits to a person that left that. They were, number one, shocked and surprised by the developments are moving forward and city of Los Angeles at the time and now with what's going on this evening, they recognize that a study'",
        "'speaker_0': 'is needed. However, they want to make sure that it's a comprehensive study. Mayor, as you alluded to and as the vice mayor alluded to, but some of the things that you will read in the L.A. EDC report and I've shared that with about 100 different business owners already because we've met with the Belmont Shore Business Association and'",
        "'speaker_0': 'other various groups, is that teenagers are going to be impacted. It was mentioned.'",
        "'speaker_6': 'Earlier, a couple of minutes ago. Social service workers will.'",
        "'speaker_0': 'Be, in fact, impacted. In-Home health care workers will be impacted. So we all focus on restaurants and the owners. And to a great degree, they're going to be impacted. You're going to hear about it from them as they form their groups and they come together and tell you their stories individually, how they're going to.'",
        "'speaker_6': 'Be increased in disability insurance, unemployment.'",
        "'speaker_0': 'Insurance, payroll taxes, workers comp. But some of these other areas, I don't think everybody takes into account teenagers. What are they going to do when they can't compete against experienced.'",
        "'speaker_6': 'Workers for.'",
        "'speaker_0': 'That same hourly wage? How is that going to work? How are you going to address the Boys and Girls Club and the Boy Scouts here in Long Beach when they have to cut workers and they have.'",
        "'speaker_6': 'To cut programs.'",
        "'speaker_0': 'Because they can't afford to keep that kind of budget moving forward. Ultimately, I think you need to see what's going to happen with Senate bill. I think it's Senate Bill three up at the state of California. Maybe your city attorney can chime in.'",
        "'speaker_0': 'What's going to happen when the state passes that bill and its impact on the city of Long Beach? Last but not least, the city of Long Beach has hourly workers. What's going to happen with your own budget here in the city?'",
        "'speaker_0': 'How does that impact the general fund? You have hourly workers just like restaurants do. I ask you to include that in your studies. I encourage you to reach out to business owners, to nonprofits.'",
        "'speaker_6': 'Into the in-home health care workers. They need to be heard.'",
        "'speaker_0': 'Thank you very much. Thank you, Mr. Richardson. Next speaker, please.'",
        "'speaker_5': 'Hello and good evening, Mayor. Members of council and city staff. I'm Christy Allen, chairman of the Long Beach Area Chamber of Commerce and vice president of hotel operations for Ensemble Real Estate on behalf of the Chamber and our leadership.'",
        "'speaker_5': 'We welcome the opportunity to give comments tonight. First and foremost, as we move this process forward, the chamber remains committed to protecting its members and businesses from any type of ordinance that puts them at a competitive disadvantage. But given the momentum for increasing the minimum wage around the region and in some parts of the country, we know'",
        "'speaker_5': 'this conversation needs to take place in Long Beach. Also we are extremely appreciative that is that it is currently a conversation and discussion of process rather than an outright ordinance per the agenda item. We agree that empirical data needs to be collected and in a way that is relevant to Long Beach, not to any other city or'",
        "'speaker_5': 'region. The hiring of L.A. EDC is a favorable approach and we appreciate the direction of including the potential benefits and risks of implementing a citywide minimum wage in Long Beach. Even more important is the fact that the study will include proposals for incentives, tax breaks, fee reductions and or process improvements to assist businesses and nonprofit organizations in'",
        "'speaker_5': 'complying with a potential higher minimum wage. The Chamber is proud to be part of this process and offers its assistance in coordinating, outreach and public input as the EDC study calls for it and sees fit. In fact, we would like to start the process by partnering with the business improvement districts such as LBJ, Bixby Knolls, Belmont Shores'",
        "'speaker_5': ', East, Anaheim, Uptown, the new Embiid Midtown and other business areas not represented by a specific bid. Included in this process as well. We would like to reach out to you, the mayor and the city council members, to work to keep the study moving in a direction that would benefit all.'",
        "'speaker_5': 'As you know, a majority of businesses operate on a relatively small profit margin, especially restaurants when wages increase. Many forget the employer has to account for payroll taxes and increases to employer contributions such as Social Security, Medicare, unemployment and disability insurance.'",
        "'speaker_5': 'As wages go up, so do these additional contributions by the employer who has to take into consideration the overall payroll cost. This impact on employers and this aspect of raising the minimum wage is rarely talked about and is something we would like to discuss when the time is right during the study.'",
        "'speaker_5': 'Thank you for the opportunity to address you tonight and for allowing our comments on this item.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'Good evening, Mayor, and members of the city council. My name is Hilda Sanchez, and I'm honored to be the chair of the downtown Long Beach Associates. I'm also a small business owner here in downtown Long Beach. I appreciate the opportunity to speak tonight on this agenda item.'",
        "'speaker_5': 'The need to address the issue objectively is paramount. Without empirical information that shows valid possibilities rather than pure speculations about the impact of any wage adjustment. We demonstrate that we're only engaging in the emotional side of the issue, that this can be harmful to both workers and employers.'",
        "'speaker_5': 'It is for these and the following reasons that the debate supports this proposed study, as presented by the Vice Mayor and its coauthors. And then we look forward to the results to determine what we can support in the future.'",
        "'speaker_5': 'The passionate side of the issue cannot be entirely ignored. While the majority of citizens may feel strongly about this matter one way or another, the issue deserves the respect of having accurate information that is authoritative and verified. The proposed study isn't just for workers or just for business owners.'",
        "'speaker_5': 'It's for everyone in Long Beach. The implications of a recent wage adjustments in the city of Los Angeles and in the unincorporated parts of L.A. County have yet to be realized. It is because of that uncertainty that we must approach this matter with utmost caution in regard to Long Beach, whose economics are different from other areas.'",
        "'speaker_5': 'The proposed study enables us to conduct our proper due diligence and find the most benefit both for both the worker and employer. It is identifying the advantages focused on the worker, as well as recognizing any and all business initiatives that will best further and create a healthy public policy.'",
        "'speaker_5': 'In the spirit of collaboration, it is encouraging to take these important and necessary steps to engage in an open, inclusive and balanced process that will make Long Beach stronger and just as importantly, help create a public policy that reflects the needs and interests of everyone.'",
        "'speaker_5': 'Our workers, small business owners and nonprofits. We place trust in the mayor and our elected officials to pursue this process and encourage you to also consider convening to the same table the leadership representing business, nonprofits and workers to discuss any potential wage adjustments and business initiative that the study reveals.'",
        "'speaker_5': 'This practice could be could produce a template for all future discussions between these parties. Recognizing that it would be difficult to ensure that all involved will receive 100% of what it wants or seeks from pending deliberations. Dolby appreciates the opportunity to work with all sectors of our city and its civic partners and remains committed to stay engaged'",
        "'speaker_5': 'with this issue while participating in an open discussion that embodies a constructive discourse to ensure a positive and equitable outcome. Thank you for your opportunity and we encourage your support on this study.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'A la Jeanne's Long Beach already has a reputation for not being business friendly. Raising wages that would double would kill many businesses, especially the small mom and pop ones. Have you even considered what would happen with the seniors who are on unlimited incomes?'",
        "'speaker_5': 'I'm one of those. I have five grandchildren. I have five great grandchildren. I'm not a spring chicken and I'm on a limited income. In seven years, we have only had approximately a 1.5% raise per year. Yet looking at 100% raise plus on a worker raise, the prices would have to rise.'",
        "'speaker_5': 'Money doesn't grow on trees. How will those on limited fixed incomes survive? I guarantee if this kind of a wage is put through all at once or even, you know, in a small period of time, I guarantee there's going to be layoffs.'",
        "'speaker_5': 'Closed businesses, higher youth employment, unemployment, and a very strong downward quality of life, especially those who have worked all their lives to put into Social Security and to contribute to society. You have to think about the entirety of the picture.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_15': 'Hello. My name is Tori Baker. I'm a resident of Long Beach.'",
        "'speaker_5': 'California.'",
        "'speaker_6': 'Have been a resident for.'",
        "'speaker_0': 'The mike. Right next to you there. Thank you. Perfect.'",
        "'speaker_5': 'I've been a resident over 50 years. I am a home care provider for the city of long before my consumer that lives in Long Beach. I feel that the minimum wage should be raised because we work hard at the jobs that we do.'",
        "'speaker_5': 'It is a very stressful job. I love the job that I do. That's why I'm not looking.'",
        "'speaker_15': 'For other.'",
        "'speaker_6': 'Employment.'",
        "'speaker_5': 'I love. I have compassion and.'",
        "'speaker_4': 'A loving heart for those that are not able to take care of.'",
        "'speaker_5': 'Themselves. And I feel that if we have a better wage.'",
        "'speaker_15': 'That the cost of living would be much greater in the city of Long Beach, because we will be able to contribute more to our city to.'",
        "'speaker_6': 'Help it thrive and grow. That's all I have to say.'",
        "'speaker_0': 'Thank you. Right to the point. I appreciate that. Next speaker, please.'",
        "'speaker_13': 'Mr. Mayor and council members. My name is Jerry Stinson. I live on Los Altos Avenue in the third district. I'm the senior minister emeritus at the First Congregational Church of Long Beach, about a block from here. I'm here tonight on behalf of Clue Clergy and Laity United for Economic Justice, which is an interfaith network of clergy and'",
        "'speaker_13': 'faith leaders here in Long Beach. We meet regularly here and throughout Los Angeles County. We are committed to good jobs for everyone. And a number of our clergy and lay leaders are here tonight from CLU. If you're part of CLU, if you'd stand up.'",
        "'speaker_13': 'I know several of them have had to leave, but we do have folks all around the room. We're here tonight to let you know that we strongly favor a $15 minimum wage that will include sick leave. And that in addition, we hope in your study you find ways to enact strict measures for ending wage theft in our'",
        "'speaker_13': 'community. I was part of the Proposition N campaign, and I saw the Chamber of Commerce and others try to frighten people into opposing a living wage for hotel workers, saying that Long Beach hotels would close if we passed Prop eight and the people in Long Beach would lose their jobs, even that there would be fewer police on'",
        "'speaker_13': 'the streets. None of that happened, and it won't happen with a decent minimum wage. Almost two thirds of the voters in Long Beach saw through those arguments and voted to support a living wage for our hotel workers. But mostly I'm here to say that those of us in faith communities see the issue of a living wage as'",
        "'speaker_13': 'a moral and a spiritual issue. Our traditions and sacred texts, whether it's the Koran or the Torah or the Christian Scriptures or others, call for justice and making sure that workers are not locked into poverty. So I hope as you continue this process, you will listen to those who bring you lots of facts and figures.'",
        "'speaker_13': 'You've heard that already tonight. But don't lose sight of the moral imperative of a just minimum wage, of adequate sick leave, and for making sure that employers don't steal the wages and the tips and the break times of their workers.'",
        "'speaker_13': 'Doing what is morally right will make this a stronger, a better and a more just city. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please get in.'",
        "'speaker_2': 'My name is William Ferris. I am the co-director of the Warehouse Worker Resource Center. We are part of the Long Beach Wage Theft Coalition, and we are here supporting a raise to the minimum wage, paid sick leave and also an effective, strong local wage theft enforcement mechanism.'",
        "'speaker_2': 'We work with warehouse workers, which is over 300,000 warehouse workers in this region and growing and particular. We've been working with warehouse workers from California Cartage, which is at the port who's most of the workers. Temp and Durex are residents of Long Beach and the headquarters of California Cartage is here in Long Beach.'",
        "'speaker_2': 'And the owner, Bob Curry, has close ties to Long Beach as well as Los Angeles. This warehouse, which is located at the port, the Los Angeles Living Wage Ordinance, does apply, which says that they have to be paid higher than the Los Angeles the California minimum wage and have paid leave for vacation and sick.'",
        "'speaker_2': 'That hasn't been the case since it started there. So that has been millions of dollars have been stolen from over 400 families that are struggling to make ends meet. And because of this, in December last year, workers had to file.'",
        "'speaker_2': 'They saw no other recourse but filing a lawsuit against the company. And this shows clearly that them fighting to have good jobs for our community, the need and example they need to have a strong wage theft mechanism. And sadly, this example at the warehouse, it's not unique to warehouse workers.'",
        "'speaker_2': 'We stand in solidarity with home care workers as well as restaurant workers, hotel workers and port truck drivers that are having their wages stalled daily. And with this, it clearly shows the need that Long Beach we cannot allow and should not allow employers to see this as a safe haven to still wages from workers that they've earned'",
        "'speaker_2': 'and that the moment is now to take a stand against this and raise the minimum wage. And we ask you to do so. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Hello, everyone.'",
        "'speaker_15': 'My name is Carlos Rodriguez. I'm a father of four kids and I have a live in LA mitchell for many years. I'm also a warehouse worker and a California college. Oh. I earn minimum wage and I don't receive any benefits like like publications or sick days or health benefits.'",
        "'speaker_15': 'It's a place where every every day you have to show up through the warehouse to see you will you will want to work, but you will not be allowed to work. If you call sick, you are punished by not being allowed to work two or three days.'",
        "'speaker_15': 'This means that. When you have the being a really sick. Oh. For example, the fever. And it went to work because. And I knew I didn't, you know, go to work was I was going to lose days of peace, which will hurt my family.'",
        "'speaker_15': 'And that will mean not having having enough to pay food or bills. I will be working hard every day. But the company shows that they don't care or they don't respect you. Because that makes it does that make it easy enough to provide or basic needs or wages that are stolen?'",
        "'speaker_15': 'And I can't afford to even be sick. Our community, my family deserve better. And we want an end to stolen wages and to have paid paid sick days in my family, my coworkers and I as far as support to make this happen.'",
        "'speaker_15': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you. Next speaker, please.'",
        "'speaker_6': 'When I know J.M. Barrie is Alberta somewhat. I think I'll sink when you talk my your mom.'",
        "'speaker_2': 'Good evening. My name is Adalberto Small. My name is said live at the Sonora Inn. I have a work five years, approximately year.'",
        "'speaker_6': 'Through a handle in Calgary, California, Puerto Beneficio Medical. In the nearby case, your name not political or not. I hope that they do not you want retired or optional?'",
        "'speaker_2': 'I have work for the company of Cal Cartage for approximately five years and we don't have any benefits there.'",
        "'speaker_6': 'You can see reparation talaga on the left person not great doesn't talk girlfriend and also prostitute around month. And so for me like on salary or minimum I know what I poor pervert forgot got those.'",
        "'speaker_2': 'I would like to ask everybody sitting here in front of me if you will be able to pay your bills in all your expenses with a minimum wage of $9 an hour.'",
        "'speaker_6': 'We've got awesome at the mall now. Amanda, a control companero control contract accompanies the California Kakadu in the hands of temporal porro and beyond that the Salado. I look at the Metro 100th parliamentary.'",
        "'speaker_2': 'Back in December 2014, we filed a wage and hour complaint for stolen wages that the company has been stealing from us.'",
        "'speaker_6': 'Chopper collector Melissa Harris Well, those. KAGAN I'm going to throw out the mantra, Genesis, it's almost only a monsoon system. I think the way your DeNardo.'",
        "'speaker_2': 'Our fight is to is to make a living wage ordinance a better pay and to have a better system.'",
        "'speaker_6': 'But completely is the role of the salary source in caso de novo.'",
        "'speaker_2': 'So the company has to comply with with the law and not to steal wages from us.'",
        "'speaker_0': 'Bless you. Thank you. Thank you very much. And next speaker, what I'm going to do also is so I have the gentleman in the back who's the last speaker, because I'm going to cut off the speaker's list. I think we're we have a long list here.'",
        "'speaker_0': 'So that gentleman, our last speaker, they're waiving and no one is taking their full 3 minutes, which we appreciate because we want to get to deliberation. We have another very long item after this as well. So if you want to continue that process, that that thoughtfulness, we would appreciate it.'",
        "'speaker_0': 'But you obviously, you're entitled to your 3 minutes, but please continue.'",
        "'speaker_6': 'When I. You know Rodriguez.'",
        "'speaker_2': 'Good evening. My name is Rosa Rodrigues.'",
        "'speaker_6': 'And I think one of the real.'",
        "'speaker_2': 'I am 65 years old.'",
        "'speaker_6': 'People bought into those. I knew how they got to Calgary and Alberta.'",
        "'speaker_2': 'And I have worked for 22 years in Coal Courage at the Port.'",
        "'speaker_6': 'I got to go with this korando content. A lot of them are considered a manual. But when? But alas, the various Diferentes companions came out of theaters Lowe's, Amazon.'",
        "'speaker_2': 'Loading and unloading containers by hand for different companies such as Lowe's, Kmart, Amazon and some the other ones.'",
        "'speaker_6': 'LDS in whether they marched or they may not seem to know and they trace implicit trabalhando. And if the company ganondorf was already Laura.'",
        "'speaker_2': 'The 19 of March of 1993, I started to work in this company, and I was making $9 an hour.'",
        "'speaker_0': 'I'm puzzled almost.'",
        "'speaker_6': 'Having people signs here, civil, incremental, those dollars go out into centavos.'",
        "'speaker_2': 'It's been more than 20 years in. I have got a raise of only $2.40 in all this time.'",
        "'speaker_6': 'Mr. Duval is the owner of all our warranties and order.'",
        "'speaker_2': 'I actually make $11.40 per hour.'",
        "'speaker_6': 'ES Una Volta rispetto para mi. He promised companeros. CASTANEDA Meanwhile, sitwasyon the authorities companies get un Rwandan monitors.'",
        "'speaker_2': 'That's lack of respect from the company for me and my other coworkers that they're stealing our wages.'",
        "'speaker_6': 'Mr. Skill as company alpha and rigorous in color. The mass nosotros trabajadores sugimoto viviendo in la materia.'",
        "'speaker_2': 'While these companies make themselves richer, we are living on their misery.'",
        "'speaker_6': 'And there is the pencil, then there is a composite it a longer parable by that narrator.'",
        "'speaker_2': 'It's very sad and it's embarrassing to have to share a space. They have to have to be able to pay for it for a rent.'",
        "'speaker_6': 'Bell Country. There's a. The whole country states a. Okay. Look, I know they wouldn't miss complete withdrawal. Normal cancer.'",
        "'speaker_2': 'But I sadly see that even with my salary of a whole month, it's not I'm not able to to afford the dentist.'",
        "'speaker_6': 'A number at all of our calories list below can offer you within a configured will not allow you use these channels.'",
        "'speaker_2': 'On behalf of my coworkers, I'm asking you to help us to. To get better, better salaries, better pay.'",
        "'speaker_6': 'You system are effective against you. The I guess a complaint alleges control contract with salary.'",
        "'speaker_2': 'And an effective system that help us to punish the companies that steal the wages from the workers.'",
        "'speaker_6': 'You'll see people there that are monstrous chameleons. When was they're either.'",
        "'speaker_2': 'And our way be able to give our families a better quality life.'",
        "'speaker_6': 'Gracias.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Russia's crisis on your watch. Yes, sir. Hi. My name is Rick Linder. I live in the seventh district.'",
        "'speaker_6': 'It has been estimated that.'",
        "'speaker_0': '40% of Long Beach residents.'",
        "'speaker_6': 'Earn less than.'",
        "'speaker_0': '$15 an hour. I urge you to conduct this study to verify this. But by raising the minimum wage in Long Beach to 15 an hour, you would have more disposable income among the residents in your community. This would assist.'",
        "'speaker_6': 'Local businesses and the economic business.'",
        "'speaker_0': 'Corridor by having more disposable income spent there, and that would improve the quality of life and standard of living of most of the residents in the city of Long Beach. Some employers don't want to pay 15 an hour, but if they cannot afford to pay above poverty level wages to their employees.'",
        "'speaker_6': 'And.'",
        "'speaker_0': 'Can't turn a profit.'",
        "'speaker_6': 'Maybe they don't deserve to be in business.'",
        "'speaker_0': 'They're not competent as businesspeople. And as for younger workers, possibly tax.'",
        "'speaker_6': 'Incentives and other devices.'",
        "'speaker_0': 'Would. Encourage employers to hire younger workers to gain some work experience. But anyway, this is a great opportunity for you to improve the quality of life, standard of living of the residents in your community, enhance your business and commercial corridors.'",
        "'speaker_0': 'So I urge you very much to approve.'",
        "'speaker_6': 'This study.'",
        "'speaker_0': 'And approve a $15 an hour minimum wage. Thank you. Thank you, sir. Next speaker, please.'",
        "'speaker_6': 'Good afternoon, esteemed mayor and council members. My name is Carlos Quintero and I am a port truck driver. I've been a port truck driver for the past five years and currently working for Pacific nine transportation, moving cargo from the from both ports, L.A. and Long Beach.'",
        "'speaker_6': 'On behalf of my coworkers and their families, honestly, thank you. Thank you for introducing the idea of raising the wage in the city of Long Beach. I know from personal experience just how transformative this could be for workers in the city and their families and just.'",
        "'speaker_6': 'As we support raising the wage, we are also here to support wage enforcement. Many of you have heard the stories of wage theft at the trucking companies that do businesses in your ports. Just two weeks ago, we came here to tell you our stories to the Harbor Commission about our low paychecks, horrible safety conditions and extreme workloads'",
        "'speaker_6': '. Many of us have gone on strike up to seven times to demand justice for all moms and dads who are being stolen their wages through illegal misclassification. I have been a misclassified driver for the entire time. I've worked for Pack nine.'",
        "'speaker_6': 'I have filed a claim against him for over 170,000. But the problem is, how do we make sure we enforce those claims? You know, we talk about the money, but we never talk about what's behind the money. In my case, I am fighting for my four children and my wife.'",
        "'speaker_6': 'My oldest son is 13 now. He's officially a teenager, which we all know how scary that can be. He loves playing soccer, playing music. He's been practicing the violin for the past two years in the school orchestra. He's respectful.'",
        "'speaker_6': 'He's helpful around the house, helps his brothers with their homework, irons, their clothes, talk to them about the dangers that they will find out on their life. All that time away from my family has pushed my son to take a fatherly figure.'",
        "'speaker_6': 'He should enjoy his childhood, explore and invent. I have not spent enough time with him. My boy is growing up too fast. I've been pushed to work over 70 hours per week. I have slept in a truck a day camp for days at a time to make enough trips to cover our expenses.'",
        "'speaker_6': 'This is just not fair. Raising and forcing the wage can be life changing for thousands of families in Long Beach. We're not fighting for dollars, but for opportunities to send our kids to college, spend more time with them, taking them to the parks, and be sure as they grow they will remember the experiences they had with their'",
        "'speaker_6': 'mom and dad. Thank you for your time. Let's collect, protect and enforce the wage. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'I will be translating for hospital. When I started snorkel the innumerable Consiglio me no cause Portillo is soy joe fair del Puerto de Lomas is some plus era etc. kicking status e competition nuestras stress condition this. Hello and good evening major members of the council.'",
        "'speaker_6': 'My name is also party owner, more port truck driver, more than 13 years working for several companies and it is a pleasure to be here with you and share our current working conditions. I mean, there's some places that I would stress.'",
        "'speaker_6': 'So it is possible to get La Ciudad a Long Beach. I went there in salary or minimum, but first it gives me a great pleasure to know that Long Beach will be the next city that will increase the minimum wage.'",
        "'speaker_6': 'E. Key personnel maintain. On the walls. It puts on possibly poor care. Say you that I would show him to the British Parliament. They are less familiar among many more men than Liberal areas. I personally support this proposition because I know it will help thousands of people.'",
        "'speaker_6': 'We are hardworking people and we deserve a fair wage and that compensates all of our sacrifices. The only person that saw you. So you know, that person, that middle class, if he got in a rowboat, is you. I am a misclassified.'",
        "'speaker_6': 'I have been misclassified as an independent contractor.'",
        "'speaker_0': 'Somebody.'",
        "'speaker_6': 'He is close to Fido for multiples company as they purchase their the Long Beach Los Angeles is unpalatable. This means that the last couple of years have been cheated by multiple trucking companies that abuse our community here in Long Beach.'",
        "'speaker_6': 'Our nosotros estamos pro. Leonardo Nuestra. Mr. Company. Intermodal Breeze Transport. On that campaign. Yeah. But as they would argue see almost correct them into classify Carlos Como Empleados. Now in our company Intermodal Transport Bridge, we are in a campaign to ensure that we are properly classified as employees.'",
        "'speaker_6': 'Most voters see one man the most. And that's what's going on here. Well, think in terms companero the pug naim or Cee Lo Afectados por el mismo sistema. The company get $10 mil, as in Emile, as they do all areas in Caracas, the ville de la de la.'",
        "'speaker_6': 'The talk is calm, money harmless. We, like our colleagues in Pag nine, have been affected by the same broken system. The company has stolen thousands and thousands of dollars in deductions and usage of their trucks. Is the system a crook or ruthless combo of you who likens the whole law with hell?'",
        "'speaker_6': 'Low, low, low quintile. Una semana. Si said Serbian reporter, contrary to this corrupt system, was well explained by Councilwoman Lowenthal a few weeks ago. Servants by contract. Estamos trabalhando. The internship for. Cinquanta says Santa Rosa tend orders La Semana but up or their mountain there unless they're familiar.'",
        "'speaker_6': 'We are working days and nights putting 50, 60, 70 hours a week in order to provide for our families. Tanto trabajo. Tanto sacrificial. No sol, no. Solo. May affect our mission more than being an mi familia. All of this hard work and sacrifices not only affects me, but my family as well.'",
        "'speaker_6': 'So it's still there. The commercial is still the huddle. Army is boss. Anyhow, though, I must pause. I'm sequencing Siguro Mariko. As a answer investor in Mr. Medecine. I am a witness of how this has left my wife and children without health insurance or access to our medicines.'",
        "'speaker_6': 'Joy while Kim's companeros Carlos. But people thought those lost these, but that our pirate trial is a total loss and still is. Lord Necesario but up in the air. Una Vida Como. I like my colleague Carlos fight every day to bring you what is required for you to live a comfortable life.'",
        "'speaker_6': 'But inside Kenya is the ample thumb being gay nuestro maestro that is a ballgame for nosotros get them being no menace nomadism resembles. It seems to me that it's time that our leaders to advocate for us. We deserve it.'",
        "'speaker_6': 'A remarkably long mental this allowed you know a Allah Malakal efficacy on suicide. Pretty good access to your call. And we stand with a wage increase. Let's end domestic, miscast, misclassification. Apartheid. Yes, we can.'",
        "'speaker_0': 'Thank you. Next speaker, please. Good afternoon. Uh, Major Garcia, City Council members, workers and community. Community members. My name is Daniel Injuries. I'm a father and proud port truck driver. I have been working in your port for the last 15 years.'",
        "'speaker_0': 'I have much history here and how much things have changed. Not much has changed for the positive. I have seen how the trucking companies have grown and how much more poverty exceeds exists with my coworkers of Pacific, Knight Transportation and other companies.'",
        "'speaker_0': 'Many people think that truck.'",
        "'speaker_6': 'Drivers make a lot of money, but that is a lie, a myth. I'm here to give you.'",
        "'speaker_0': 'Just one example. I have been working for Pacific Night Transportation.'",
        "'speaker_6': 'For the last eight years.'",
        "'speaker_0': 'During the whole time I have been misclassified as independent contractor. I have worked day cheap, sometimes working 14.'",
        "'speaker_6': 'Hours per day so that I can afford all the expenses that they forced on me. Many times these charges are more than what I make during the trips, which means that I take.'",
        "'speaker_15': 'Home.'",
        "'speaker_6': 'A.'",
        "'speaker_0': 'Negative paycheck. What that means is that I owe the company for working for them. I have fought for years to change this, but I can not.'",
        "'speaker_6': 'Do it alone. Me and my coworkers are Pacific and.'",
        "'speaker_0': 'I have filed claims with the Department of Labor. We estimate that my claim is worth over one for $200,000. The company has.'",
        "'speaker_6': 'Retaliated against.'",
        "'speaker_0': 'Us by not giving.'",
        "'speaker_6': 'Us work. Fortune is more and more into debt, more and more into poverty. Two weeks ago, I gave testimony to the Department of Labor.'",
        "'speaker_0': 'To defend my claim and force the company.'",
        "'speaker_6': 'To pay.'",
        "'speaker_0': 'What they owe.'",
        "'speaker_6': 'Me. This is where you can play your role. We need senior leaders to help protect us against.'",
        "'speaker_9': 'Companies like.'",
        "'speaker_0': 'Pacific now. They are not just.'",
        "'speaker_6': 'Stealing from us, but also from the city.'",
        "'speaker_0': 'State and federal governments. In unemployment.'",
        "'speaker_6': 'Insurance. Workers compensation. And taxes. Are are. There's a bunch of drivers that they bought the truck up from.'",
        "'speaker_9': 'Pacific and air transportation.'",
        "'speaker_0': 'Under their.'",
        "'speaker_6': 'Companies.'",
        "'speaker_0': 'Promise that they will.'",
        "'speaker_6': 'Make a lot of money.'",
        "'speaker_0': 'But so far, these drivers are jumping from.'",
        "'speaker_6': 'Company to company, still looking for that money.'",
        "'speaker_0': 'So there's a big lie from the companies that, you know, under being a independent contractor.'",
        "'speaker_6': 'They will make more money, be more happy. But that's a big lie. Yes.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_5': 'Hello. My name's Laura Simon. I'm a local business owner. Thank you for having me tonight. Regarding the issue of minimum wage, $15. We've been in business in Long Beach for 11 years now, and most of our employees are not at minimum wage.'",
        "'speaker_5': 'They're significantly above that. If we raise minimum wage, all of those employees are going to expect a raise to justify the imbalance, which as a business owner increases our worker's comp, it increases our payroll taxes, it increases all sorts of things that we need to take into consideration from the small business perspective.'",
        "'speaker_5': 'I was talking with one of our employees about this and she said, Well, what's going to affect me is now this my landlord is going to think that I'm making more money, therefore they're going to raise my rent.'",
        "'speaker_5': 'So in reality, I make no more money as a business owner, if our wages go up, our prices have to go up because we cannot. Totally directly take all of that increase and all of those prices. So although we think that raising the minimum wage will increase.'",
        "'speaker_5': 'The living standard of people in reality are our economy goes up. To help balance out those increase in wages. So thank you for having me tonight. I appreciate it.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, Mayor. City Council Members My name is Gary Hetrick. I'm a sociologist and a professor of sociology at Cal State University, Long Beach, and I'm also a member of the steering committee of the Long Beach Coalition for Good Jobs and Healthy Community.'",
        "'speaker_6': 'And I'm here tonight to speak in favor of the citywide minimum wage study. I believe this is a reasonable and our coalition believes this is a reasonable first step towards developing a policy that can address the persistent high level of poverty in Long Beach, a level of poverty that has continued despite a decline in the unemployment rate'",
        "'speaker_6': 'and driven in large part by the growth in low wage service sector jobs. Yet raising the wages for the lowest paid will do little if those workers do not see that money. And herein lies an issue that's come up a couple of times already tonight.'",
        "'speaker_6': 'The idea of wage theft or the deliberate nonpayment of money or underpayment of wages owed to employees. Some of the most common occurrences include include working off the clock, not receiving rest or meal breaks, not receiving overtime, not receiving tips.'",
        "'speaker_6': 'Illegal deductions are simply just not paying minimum wage. And so the question is how pervasive is wage theft? In a 2010 study of 4387 workers in low wage industries in Chicago, Los Angeles and New York, the study broken laws, unprotected workers, found that 26% were paid less than the legally required minimum wage in the previous workweek, 60%'",
        "'speaker_6': 'by more than a dollar an hour. And 43% of those who complained experienced one or more forms of illegal retaliation from their employer or supervisor. For example, workers were fired, suspended, threatened by by their supervisor that he would call immigration services or threatened to cut workers hours or pay.'",
        "'speaker_6': 'A more recent study in 2014, UCLA found that Los Angeles was the wage theft capital of the nation. Estimates place the amount of lost wages to low income workers in Los Angeles at over $26 million per week. Not surprising, wage theft drives workers deeper into poverty.'",
        "'speaker_6': 'And with lower incomes, workers find it difficult to afford adequate housing, healthy food and other resources that Vice Mayor Lowenthal mentioned earlier. And these conditions put workers at risk for chronic illnesses such as diabetes, hypertension, mental health issues.'",
        "'speaker_6': 'It also means that they often can't afford medication for serious health conditions. As an educator, I've seen how wage theft often forces my students to work more hours to support their families. While these students that we're often told, we know that students get financial aid, their families do not.'",
        "'speaker_6': 'And this, in turn, creates greater stress on these students as they try to maintain good GPAs and stay on track to graduate. Some even postpone their studies. As a city, we cannot afford to ignore wage theft in the impact of poverty wages on families.'",
        "'speaker_6': 'As we move forward with this discussion, we need to be sure that any policy recommendations include mechanisms for workers to recover their wages and retaliation protections for them when they speak up about wage theft. Such a comprehensive policy will improve family well-being of low wage workers, and this will positively affect all who.'",
        "'speaker_6': 'Thank you to be.'",
        "'speaker_0': 'Long Beach teams all up. Thank you very much. Next speaker, please.'",
        "'speaker_6': 'Yeah. Thank you. I'll be real brief. Good afternoon, Council. Good afternoon, Council members. My name is Donald Blackwood. I work at the Hilton Hotel and I've been working there since 2000. Five of embezzlement. And B, I just wanted to talk about the impact of the measure.'",
        "'speaker_6': 'M Before measure. M I was I was paying child support. At the same time. I was taking care of my mother who was on it, Social Security. So she did. She had a disability during that time. When I was putting in child support, I was getting paid $9 an hour at the Hilton.'",
        "'speaker_6': 'And I was told, because I'm a living wage. I mean, I'm I was a tip employee. I would never get a raise. So from day 25 to the living wage, I made whatever the minimum wage was. During that time some checks because I got child's face, child support, which I volunteered for.'",
        "'speaker_6': 'I wasn't forced to volunteer. I was sometimes take home $237. Sometimes I'd have to rely on my tips. If I didn't make tips that day, I couldn't buy food or I would just get a bag of potatoes. I get, you know, some butter or whatever I could do to do to handle that.'",
        "'speaker_6': 'What I was really grateful for was the living wage and being able to participate in that because it actually changed my life for the better I can now because of the living, the measure M and the minimum living wage, I'm actually can give my mother an allowance.'",
        "'speaker_6': 'She can buy clothes, she can we can have, we can buy furniture, you know, just basic stuff. I couldn't even for basic stuff I really didn't have. I couldn't afford a medical. So I had to go to free clinics before, you know, when I was only making them when I was paying child support, I paid all my'",
        "'speaker_6': 'child support, the living wage pass and now making just $13 an hour. I feel much better. I mean, it just makes me feel more like I'm a regular person, you know, like, I'm not poor, I'm not living. Check the check.'",
        "'speaker_6': 'I'm not scraping change, I'm not counting pennies, even though and I just want that for everybody else in the city because. Because I mean, really, if, if you were working in a restaurant, in a hotel and you're getting a living wage and in a look in a restaurant right across the street and you get them a minimum'",
        "'speaker_6': 'wage. It doesn't seem fair to me. It seems like everybody should get a basically a living wage. That's what it is. It allows you to live even though it's a minimum wage. And it shouldn't be just a minimum wage.'",
        "'speaker_6': 'It should just be a living wage. So we can basically buy the necessities you need to live and work for your company. And that's all I want to say. Thank you. Thank you at the time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening. My name is Joanna Conception. I am a voting resident of the First District and also the executive director of the Filipino Migrants Center, a nonprofit organization here in Long Beach, serving low income Filipino families in the city.'",
        "'speaker_2': 'And I'm also here representing the Long Beach Coalition to End Wage Theft. We want to thank Mayor Robert Garcia, as well as the council members who are supporting this study. We think that it is an important step today for the advancement of the economic well-being of thousands of struggling Long Beach families.'",
        "'speaker_2': 'We want to ensure that the diverse, low income communities we serve will have a voice in this process because because it is they who will be the most impacted and often are the ones who disproportionately suffer during times of economic turmoil and changes.'",
        "'speaker_2': 'Our communities deserve a minimum wage that meets the basic needs of our families. It is not only about an increase in the number, but about seriously considering the average cost to live in this city and the rising costs of basic expenses.'",
        "'speaker_2': 'We also urge you to give priority to combating the widespread practice of wage theft because as it currently stands, many employers continue to violate existing minimum wage and other wage and hour laws, placing law abiding businesses business owners at a disadvantage.'",
        "'speaker_2': 'According to the Department of Labor Standards Employment in the Long Beach Office. From 2008 to 2011, they have found that over $31 million worth in wages were stolen from workers who have filed cases. And that does not count the number of workers and residents here in the city who do not have the resources or information to be'",
        "'speaker_2': 'able to file in the Department of Labor. And out of that stolen wages, only 8% were collected from employers. It can take an average of one year or more to resolve a case, but once a judgment has been determined, there is no guarantee workers will be able to get a single cent.'",
        "'speaker_2': 'We need to create easy, simple and efficient tools for hard working employees to collect the wages they have earned. We need to protect courageous workers who speak up when they face wage theft so they do not go to work in fear.'",
        "'speaker_2': 'We need the city to create the authority to take charge, to enforce wage and hour laws correctly and efficiently. It is time to level the playing field so that responsible business owners can compete. And we want to work closely with you to make this happen.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_13': 'Good evening, Honorable Mayor Garcia and city council members. My name is Chandler Kemp. I am a ninth district resident in Long Beach and president of the Long Beach City College Political Science Student Association. This is my first time addressing you as our city leaders, and today I feel motivated to share with you why I care about this'",
        "'speaker_13': 'campaign to raise the wage and protect workers against which stuff. Waste us. Death is very common and it has happened to many of our community members, especially the immigrants and youth population. I'm one of five children in my family.'",
        "'speaker_13': 'I immigrated to Long Beach from Cambodia in 2001 at the age of seven to live with my sister. In Cambodia. My dad worked as an insurance claim adjuster for 15 years. My dad left Cambodia and emigrated to Long Beach in 2009 to find better opportunities.'",
        "'speaker_13': 'My dad worked for a local Chinese food restaurant. He worked for 12 hours a day. Six days a week. It was paid $3 an hour. He has received numerous, no lunchbreak, no overtime. When my dad was working for the Chinese food restaurant, we barely saw each other.'",
        "'speaker_13': 'I was either at school or I'll be studying and he would be working. I know working at that restaurant took a toll on him and he was always tired and his day off it would catch up on his sleep.'",
        "'speaker_13': 'He was not living. He was just going through the motions. His help support us. I'm also I used to be a restaurant worker. I work at La Lune Palace by the Long Beach Airport, a local Cambodian restaurant. We were always short staffed servers at different special events, and we worked from 6 p.m. to 3 a.m. in the'",
        "'speaker_13': 'morning with no uninterrupted breaks, lunch or overtime. Wage wage stuff. It's not only affect my family financially, but it affects many aspects of our lives. I am a full time student at Long Beach City College and I also work part time.'",
        "'speaker_13': 'My days are spent attending classes, working and studying for classes. My time and money are very precious to me. The money I earn from working is just not to paying for groceries and bills. When I work until 3 a.m. at La Lune Palace on Saturday nights, I usually be exhausted on Sunday.'",
        "'speaker_13': 'My day to study. Then I am usually. Then I usually have to play catch up on my schoolwork when I'm exhausted from working at Loveline. It is a perpetual downward cycle. When I finally realized that La Luna was committing waste towards me, I was shocked.'",
        "'speaker_13': 'That was a crime. I was raised on the idea of working hard without complaining. Working without break was normal for me and I realized it shouldn't be that way. The solution to weight stuff is accountability. I want employers to be more accountable and stop committing waste stuff while we should adopt rules to make sure waitstaff does not'",
        "'speaker_13': 'happen. We need the city to enforce wage and hour laws.'",
        "'speaker_0': 'Thank you. Thank you. Hey, good luck on your studies at Long Beach City, by the way. Thank you. Thank you. Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, Mayor Garcia. City council.'",
        "'speaker_0': 'Members. My name is.'",
        "'speaker_6': 'Tanya O'Malley Nelson IAU and I am the founder of Project Alpha, which is a Long Beach nonprofit focused on.'",
        "'speaker_0': 'Supporting formerly incarcerated Pacific Islanders and Asians that reintegrate back into our community. I'm here tonight because I was invited by our friends at the Filipino Migrant Center to speak on why raising the minimum wage to $15 an hour and enforcing it matters to all of us.'",
        "'speaker_0': 'Never would I have thought wage.'",
        "'speaker_6': 'Theft would have occurred with me. I speak on behalf of my community members whose policy and cultural humility is often mistaken as a weakness and taken advantage of. This is an important issue to me.'",
        "'speaker_0': 'Personally, because I understand what it means to live paycheck to paycheck. Counting on every dollar.'",
        "'speaker_6': 'Earned while an employer decides not to pay all wages. A multitude of feelings begin to.'",
        "'speaker_0': 'Manifest and they're not nice. I grew up with both my parents working two jobs, watching them come home tired and go without. Just so we could have food and the basic necessities growing up, as you've heard with so many others.'",
        "'speaker_6': 'I started to help out when I was 11 years old by delivering newspapers and pulling my weight. I knew I had to contribute to my family. Eventually, I worked hard enough to become a food and beverage director.'",
        "'speaker_0': 'At a hotel in a room. Revenue ROOM's Revenue Manager. But unfortunately, I made the mistake and I made the choice, and I made a few bad.'",
        "'speaker_6': 'Decisions that placed me in the custody of the law and under the governance of.'",
        "'speaker_0': 'The law.'",
        "'speaker_6': 'Still today.'",
        "'speaker_0': 'After my first incarceration, I found myself in the struggle of finding a job that would hire me with a criminal background.'",
        "'speaker_6': 'It was very discouraging. And at times the anxiety and angst took a toll on me. I did become homeless, but I eventually found a job that acknowledged at least some of my qualifications. I was hired as the night auditor.'",
        "'speaker_6': 'I climbed the management ladder, but within a month I found myself taking on upper management duties and all that. The humbling hour of $10 an hour working 60 plus hours a week. I asked our ownership Would I be getting.'",
        "'speaker_0': 'Overtime with an answer?'",
        "'speaker_6': 'Pathetic. No straight time. I'm here to tell you that wage theft needs attention. I speak for Kuia.'",
        "'speaker_0': 'And the other brothers that I work with at the.'",
        "'speaker_6': 'Hotels who don't have this voice who won't speak up. Their choice of.'",
        "'speaker_0': 'Voice is to be that past a person. I'd like to be that choice of voice today to support this. Raising the minimum wage would.'",
        "'speaker_6': 'Incentivize those of us in the API and formerly incarcerated community to attain employment and become healthy, productive assets to our families and not be seen as liabilities while we have statewide labor laws in place. We need stronger local enforcement mechanisms.'",
        "'speaker_0': 'That protect workers.'",
        "'speaker_6': 'Like myself and increase increasing penalties against employers. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening. My name is Bianca Sauvage. I own a business in Long Beach. I've been in business for 18 years, so I've contributed to this community that I love so much. I came from Orange County 31 years ago and fell in love with the city.'",
        "'speaker_2': 'And I'm never leaving. And I know a lot of you guys like Susie and Stacy and Darrell and. I love that you guys are all here and can listen to us. And so I came as a business person and I've heard.'",
        "'speaker_5': 'Some really heartbreaking.'",
        "'speaker_2': 'Stories here tonight about wage stealing and theft and stuff.'",
        "'speaker_5': 'Like that. I've never heard of such a thing. It's horrible. People need to have a compassion.'",
        "'speaker_2': 'Everybody needs to have be able to put.'",
        "'speaker_5': 'Food on their table and clothes on their back and on their children's back. But I just my I'm just here to tell you that there are you know, there's the other.'",
        "'speaker_2': 'Side of that equation. And then there's people like me who put out my personal money. I mean, I'm going to have to retire a little later than I wanted to because I used a lot of my money to pay all my rent and.'",
        "'speaker_5': 'And all the insurance that I had to carry.'",
        "'speaker_2': 'And my business license and all that stuff that goes with being a business owner. And I chose that because I wanted to be I wanted to be a business in Long Beach. So it wasn't what I had planned to do.'",
        "'speaker_2': 'I. Had a.'",
        "'speaker_5': 'Completely different.'",
        "'speaker_2': 'Dream but anyways ended up being.'",
        "'speaker_5': 'A business. So I think that may be perhaps a consideration regarding public.'",
        "'speaker_2': 'Policy on this issue might be done by industry or something like that. I mean, it sounds.'",
        "'speaker_5': 'Like the port has a whole different moral issue.'",
        "'speaker_2': 'Going on over there that has nothing to do with people like me.'",
        "'speaker_5': 'Or, you know, friends like my Mario who owns La Traviata. He's going to have he's going to be impacted by this.'",
        "'speaker_2': 'And so a lot of other people who are business owners. So this there's a lot to consider here. And I know what we're talking tonight is about the feasibility study.'",
        "'speaker_5': 'My only concern is that this organization.'",
        "'speaker_2': 'Did they do the study for Los Angeles and for Los Angeles County? Because if they did go ahead.'",
        "'speaker_0': 'They did the study for Los Angeles County.'",
        "'speaker_2': 'They did okay.'",
        "'speaker_0': 'For Los Angeles.'",
        "'speaker_5': 'So I'm concerned that they might be predisposed to think this. I mean, if they advocated for it or if they did a study and the result was to go ahead and do an increase.'",
        "'speaker_2': 'Then I just hope that they're fair. And like you said, I loved your opening statement when you said that this is going to be balanced and all the consideration is going to be is going to be given to everybody and that everybody is welcome to come to the table.'",
        "'speaker_2': 'And so I just want you to know that as a business owner, there's another side of the equation and some hopefully something will come out of this that can benefit everybody thinks.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, council people. Mayor Garcia My name is Peter Savage. And if you didn't catch the last name, I'm married to the last speaker who was just up my wife, Bianca. And like any good husband, I'm going to agree with about 95% of what she said.'",
        "'speaker_6': 'But no, I got a couple of more points.'",
        "'speaker_0': 'I'm not leaving just yet.'",
        "'speaker_6': 'Anyway, on a serious note, I guess my big question is, after hearing all this, it sounds like a big can of.'",
        "'speaker_0': 'Worms has been opened.'",
        "'speaker_6': 'This wage theft issue sounds like a really huge issue. I'm not sure it's directly related to the minimum wage, so I'm not sure whether you guys, including that in this study, are going to have your hands full and that maybe be a whole separate thing, I don't know.'",
        "'speaker_0': 'But it sounds like a real administrative.'",
        "'speaker_6': 'Legal quagmire for the city to develop a system and a way to stop this wage theft, which it sounds like they should or somebody should. But I don't know how that happens without the city maybe spending millions of dollars out of its budget in order to study that and.'",
        "'speaker_0': 'Remedy it sounds like an easy remedy.'",
        "'speaker_6': 'And I don't know how you do that. I really don't. The other thing is, I'm not sure what the hurry is. Yeah, we had a couple people talk about. Well, other cities are doing it. Seattle, san jose, new york, l.a.'",
        "'speaker_6': 'Well, okay, you got five cities, six cities, a dozen cities. How many other cities are there in the country that are not doing this because they realize it's not that.'",
        "'speaker_0': 'Good for business?'",
        "'speaker_6': 'So before you jump into this whole hog like you're doing, you got the wage theft issue to think about. I'm not sure what the hurry is because you need to get the facts. This study here. Is is a month old.'",
        "'speaker_6': 'And how long is the wage increase started or been in effect in L.A. County? L.A. City, less than a year.'",
        "'speaker_0': 'New York, less than a year. There's no hard facts.'",
        "'speaker_6': 'And how can you guys make a decision until we have hard statistics and facts to go on? Right now, everything's anecdotal and emotional. We need to wait some time. I don't think you guys need to act on this right away.'",
        "'speaker_6': 'Maybe wait a year or two. I don't know until you get some facts and statistics to back the emotions that are present in this room tonight. So that's the last thing I want to say. Haste makes waste. And just be careful.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Next week, police.'",
        "'speaker_5': 'I am going to be.'",
        "'speaker_4': 'Translating for Mr. Bartholomew Prez.'",
        "'speaker_6': 'When I notice Senor Garcia Miembro de la la la la la la la.'",
        "'speaker_5': 'Good evening. Mayor Garcia and members of the council.'",
        "'speaker_6': 'In Paris think of it resigning as Carla Hondo para la comida rapida and principalmente de magdalena.'",
        "'speaker_4': 'My name is Bartholomew Perez and I have been working for 23 years in the fast.'",
        "'speaker_5': 'Food industry, specifically of McDonald's.'",
        "'speaker_6': 'Oh, is that the employer, Ms.. Alario? Meaning whether the assistant I think.'",
        "'speaker_5': 'My current salary is 1075.'",
        "'speaker_6': 'Throwaway. You also realize a monopoly represent like a s corporation DNS over some organism.'",
        "'speaker_5': 'I only work for a total of 22 hours for that company as they are observing our hours as a big corporation.'",
        "'speaker_6': 'Organizers is that the simple tell me more press you'll get the NL combo numero uno on the lot in the morning or cycle unless you are Long Beach, Pasadena, California, either. Those who need more here.'",
        "'speaker_5': 'At this moment. The combo number one is cost the same at Long Beach, Pasadena. And in California.'",
        "'speaker_6': 'Seniors throw caramel carton the way it was only through the late. Tell me more presciently loud on the way.'",
        "'speaker_5': 'Wherever you go, you can also get eggs and milk at the same price.'",
        "'speaker_6': 'Oh, yes. Oh, yes. We rounded up our restaurants. You are as well. Now, the laboratory principles that all Californians. We know the total price.'",
        "'speaker_5': 'Today is a big day for Long Beach as well as California, if not the entire country.'",
        "'speaker_6': 'Oh, yes, a little like a cake like Lassie movie and also a World War poverty.'",
        "'speaker_5': 'Today is a day where we can make sure that the middle class does not become the lower class.'",
        "'speaker_6': 'Logo. We are no longer called capitalism because you are like an object and I look forward.'",
        "'speaker_5': 'For a long time, government has helped inject benefits to the rich, and now we hope that this is an opportunity to inject rights to the poor.'",
        "'speaker_6': 'Oh, yes. The implication is there is a pointless repetition and are companies are not so keen to let us in not annoy Roberts a lot you get get permitting meeting when the owner then throw lostrillionhoc but will not be the Worcester.'",
        "'speaker_5': 'Today is the day that we hope that you can help us get a better salary and then to wage theft, as well as allowing workers to organize should they choose to.'",
        "'speaker_6': 'Always meet the actual guarantee that they will. Captiva Cargo Studios. Sorry. Look, a significant salary or minimal yanking or proving salaries, Larry. But we are beloved remote bahauddin developer Reza.'",
        "'speaker_5': 'We encourage I encourage any educational facility or to make a study and to prove that $15 is needed. But even 15 is not enough. We'll probably still be in poverty.'",
        "'speaker_6': 'Menstrual cycle, says Rwanda alone. The serious calamities will be the end of those yellow futuro poverty surrounding the youth.'",
        "'speaker_5': 'Our youth and children are graduating from college in that, and they are the future of the next line of poverty. Generation of poverty.'",
        "'speaker_6': 'But I'm over like on loan me on this thumb up in the air. All power and loopholes are parakey even for comedy. Also awesomeness.'",
        "'speaker_5': 'If we're going to improve the lives of workers, we have to give them an increase so that they can take better food to their tables.'",
        "'speaker_6': 'Or you sultanpur senor del Gobierno, you are the killer. Boondoggle pueblo is pointless. A law around which aggressive.'",
        "'speaker_5': 'This is a time for the governmental bodies to please inject money back into the workers, into the community. And the community will respond back with a big thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening. I'm, uh, I'm with the five for 15 campaign. I'm also speaking on behalf of a factory workers here in Long Beach. And I know that there's a lot of.'",
        "'speaker_0': 'Can you give us your name, please?'",
        "'speaker_6': 'Oh, my name is Samuel Homer Williams.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_6': 'And I know that there's a lot of workers who are needing of this. This, you know, 515, this money that they need. And there's a lot of workers who've been going through wage theft. And with this wage that I mean, you have to think about, there's taxes that have been taken out.'",
        "'speaker_6': 'You take away taxes. You take away, you know, their expenses and need for the necessities. And then you take away or their money has been stolen from them. And it's not just money that is not stolen from the missile.'",
        "'speaker_6': 'It's also these workers futures and their children's futures that have been taken away from them. And I know I'm only 21 years old, but I've seen these workers go through so many hardships and struggles and. It's really hard for me to watch my coworkers work so hard and yet have nothing to take home.'",
        "'speaker_6': 'And these moms that have children, they take care of, but they can't because they don't have enough money. And they have to think, do I take my child to the doctor or do I pay my rent? It's a lot of things that go on and people don't see that.'",
        "'speaker_6': 'And having these voices come up and speak, I hope that each and every one of you have heard these stories and it's coming from another young person. But it is these stories are true. And it's also true for myself, because I'm a student that had a drop out because my tuition was too much and I couldn't afford'",
        "'speaker_6': 'schooling. So I ended up in a job like this. And there's a lot of students that end up in the same way. These jobs, you know, they're there to help. But I still can't afford schooling because, you know, because I don't make enough to pay my tuition.'",
        "'speaker_6': 'And there's a lot of students who are stuck and they can't move forward on their financial ladder. And I am one of those students standing here before you, and there's many other students like that. I just want to speak upon also that there's a lot of, you know, businesses, small business that we're talking about that are, you'",
        "'speaker_6': 'know, they're going to have to like cut back, just throwing out hypotheticals. But these people can't wait for, you know, for for that, you know, they need this now. It's very urgent for them because the more we talk about this, you know, bills go up, rent goes up, and we're still stuck in the same place and we'",
        "'speaker_6': 'can't move further. So something has to be done because if it's not done, then we can't just stay here and be still and be quiet. We have to move forward and we have to bring it forward to you to help fix the problem, because that's why you are here, to fix the problem that we're bringing before you'",
        "'speaker_6': '. So the problem is to fixed, which is that you hear our problems and that you do something to actually fix it. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, mayor people. My name is Alex Bass. I'm a port truck driver for over nine years. Right now, I'm currently working for a company called Equal Fraud that properly classify their drivers as employees. And I once was misclassified driver.'",
        "'speaker_6': 'And I know firsthand what it is to be a misclassified driver. When you're taking negative paychecks home.'",
        "'speaker_0': 'You can put you can't provide for your family.'",
        "'speaker_6': 'Can't take them to the clinic, to the hospital, or even when it comes to Christmas season, you can't really blame the gives because y you're your employer takes all your check and illegal deductions for fuel expenses, truck repairs for a truck that's not even yours.'",
        "'speaker_6': 'And I'm also here to support the workers out here, the city of Long Beach workers. It's time to raise the minimum wage. I mean, this is Long Beach, not a third world country. Now, you know, people need they're over here trying to support their families, okay?'",
        "'speaker_6': 'They're here to support their families.'",
        "'speaker_15': 'And, you know, provide the proper.'",
        "'speaker_6': 'Education with the young man said is true. He's a young man and they're getting better with with their tuitions. We all know this. What's going on? It's time to change everything. Reach the way is stop wage theft, raise the minimum wage and paid sick days.'",
        "'speaker_6': 'That's all. That's all.'",
        "'speaker_0': 'We want. Thank you. Thank you. And our our final speaker, Mr. Mayor and Council, I commend you that we're having this conversation. There are a lot of cities in America that should be doing this. But if swept it under the rug.'",
        "'speaker_0': 'I want you to know the ten of you you represent. 50,000 people, a lot of whom are voters.'",
        "'speaker_6': 'But before they were voters.'",
        "'speaker_0': 'Their souls were gods. He said, All souls are mine. He also said Mazel, not the ox that traded out to coal. The world will see us as the.'",
        "'speaker_6': 'Grand Prix City with lights.'",
        "'speaker_0': 'They see us as the largest port combine.'",
        "'speaker_6': 'Los Angeles, Long Beach. God see a lot of these people here. Where our night out.'",
        "'speaker_0': 'Is a Costco hotdog and soda for a dollar at $0.64. That's not a good balance. I believe if you take it into your heart, you can help bring that together somewhat. You may not be able to fix it all.'",
        "'speaker_0': 'But most of all, not the arcs that shredded out the corn. Every business that makes a profit.'",
        "'speaker_6': 'Somebody is working.'",
        "'speaker_0': 'In that business. Those people should not be muzzled. They should get a fair day's pay.'",
        "'speaker_6': 'For a fair.'",
        "'speaker_0': 'Day's work. I spoke to the Los Angeles City Council on this subject to the Los Angeles County Board of Supervisors. And I ended with these words. For God's sake, do the right thing. Thank you, sir. Thank you. And I want to thank all the all the speakers that came out.'",
        "'speaker_0': 'Obviously, the workers and the clergy and the business owners and obviously the organization leaders. We really appreciate the the input. I'm going to go now to go back down to some of the council members. I also wanted to note, and I may have missed this the first time, the proposal before us is is a two part proposal'",
        "'speaker_0': '. One, of course, is moving forward with the L.A. County Economic Development Corporation feasibility study that looks at both the benefits risks of implementing a minimum wage. And then the second piece of that is, which I think is also as important, is we're also asking our own city's economic development commission to also take public input and review the'",
        "'speaker_0': 'study's findings and make possible recommendations to the council. And so I want to make sure that that is said as well. That's an additional opportunity for public dialog and input. There's some great folks on that commission. And with that, I'll turn it back to the council.'",
        "'speaker_6': 'Councilmember Reynaga Thank you, Mayor Birmingham, and take care of the gracias those days giving it and keep it to the actual test eagle story is the demo. First of all, I want to thank all of you who came here tonight to provide testimony on this subject.'",
        "'speaker_6': 'Very important that that you're here. And I want to not only thank you, but welcome you here and for sharing. You know, I have a favorite quote from Benjamin Disraeli, and it says, Change is inevitable. And in a progressive society, change is constant.'",
        "'speaker_6': 'And every time that we talk about change, I always hear the same the same other refrain as well. And that's the refrain from Chicken Little, saying that the sky is falling and it's not falling. It's change, it's progression.'",
        "'speaker_6': 'It's a movement that takes us forward into the future. And I think that when we talk about minimum wage, we talk about minimum wage, we talk about wage theft or we talk about horrible working conditions. Those are all part of what we need to look at and what we need to study and what we're proposing to do'",
        "'speaker_6': 'tonight. And what this motion is, is to study what's what's going on, to study what's feasible to study if we need change. We all know we need change because change is progressive and we are a progressive society. And I'm very proud to be part of a progressive city council that has brought this forward because we need to'",
        "'speaker_6': 'look at what's going on with our wages. I have my own story about when I started working at the age of 12 and I was a as I always say, I was a petroleum transfer engineer. I push gas, I check the oil.'",
        "'speaker_6': 'I clean windshields in a checked tires. And I was doing that for $1 a day. Of course, there's about child laws and all that type of business. But the person that I was working for didn't care about that.'",
        "'speaker_6': 'All he cared was that I was pumping gas, cleaning windows, checking tires. Not not aware that I was working there for a reason. I wanted to buy a bike, but I had the but I had the the gumption to go out there and say, you know, can you use some help?'",
        "'speaker_6': 'And I said, sure, but you have to do it for a dollar a day. And I did for a whole summer. And I bought my bike but eventually got stolen. But that's that's that's another story. But I think what's important is that we look at this rationally, that we not think like Chicken Little, that the sky is'",
        "'speaker_6': 'not going to fall. A lot of the testimony I heard tonight is compelling. There was some history given. We know a couple of years ago we we worked for Measure and we heard that the sky was falling and in fact, tourism went up.'",
        "'speaker_6': 'The businesses are doing. The hotels are doing very well. Hotel workers are spending their money in Long Beach. But we talk about what's gone up. What has gone up? Prices of gasoline has gone up. Prices of groceries have gone up.'",
        "'speaker_6': 'Medical costs has gone up. What has not gone up? Minimum wage. So we need to look at that in regards to how it fits within our economy. And I think that this study, with the help of our own Economic Development Commission, will work at that.'",
        "'speaker_6': 'And I encourage you to participate in those hearings, give your voice so that we can provide what we come back with. This comes back back to us as the city council that we have basically all the information we need to make it well informed and and the right thing decision for everybody in Long Beach.'",
        "'speaker_6': 'One final thing I want to say. Is that when we talk about the minimum wage. We're not talking about changing the minimum wage from night into morning. It's an incremental change. Everybody talks about the minimum wage is going to affect businesses and that and that people are that the business owners are going to fire people.'",
        "'speaker_6': 'There's gonna be more unemployment. There's going to be more kids out in the street without jobs, that the business owners are going to raise their prices. And it's going to be the sky is falling. It's not. Let's be real when we're talking about a minimum wage.'",
        "'speaker_6': 'And when we looked at L.A. and we look at L.A. County, when they're talking about a $15 minimum wage, you're talking about 2020, folks. They're not talking about tomorrow. They're talking about 2020. They have five years to implement that change.'",
        "'speaker_6': 'And when we look at it realistically, $15 an hour in 2020 is going to be 13 or $12 an hour in today's prices. So let's be realistic. Let's look at this from a objective point of view and look at it from a perspective that if we raise the minimum wage, we're raising families, we're raising kids, we're raising'",
        "'speaker_6': 'businesses, and we're raising our economy. That's what it's all about. All right. So finally and just one last point. I encourage my colleagues to support the study.'",
        "'speaker_0': 'Thank you, Councilmember. Next up is Council Councilwoman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I'm going to be voting in favor of the study tonight. Anyone who has followed me in the way that I think in regard to these issues is I think that data is good. And I think it's important for us to get information before we move forward on policies like this.'",
        "'speaker_2': 'I absolutely reject the argument or the suggestion that because we're concerned about what the outcome of the study reveals, we shouldn't study the issue at all. I think that that is a mistake. It's a flawed form of thinking.'",
        "'speaker_2': 'And I think about many issues that become that come before the city of Long Beach. And some of those issues are issues that some of us may have expertize in. Some of those issues may be issues that we have constituencies who feel passionately about.'",
        "'speaker_2': 'But unless we do studies, objective, comprehensive studies to find out what the true impacts will be, it's I think it's irresponsible for us to make decisions. So I doubt that there would ever be a situation that I would vote against studying an issue and getting more information, because I think that's, generally speaking, a very good idea and'",
        "'speaker_2': 'a good practice. To those to those who say that this item is politically driven. I have a few comments for those because I did receive a few emails today. First of all, the city of Long Beach is not the first to initiate this discussion.'",
        "'speaker_2': 'And anyone who's been watching the news or reading the paper knows that this is a nationwide discussion. And in fact, in our very own state, SB three is now pending before the Assembly's Appropriations Committee. So this is not this novel concept that's coming before the city of Long Beach out of the blue.'",
        "'speaker_2': 'It's certainly something that is a nationwide discussion. And as the seventh largest city in the state of California, it's reasonable and foreseeable that we would engage in this discussion, if not now, within the near future. So I think it's important for everyone to to have a little bit of a reality check in terms of where we are'",
        "'speaker_2': 'as a nation, where we are as a city, and where we're headed moving forward. I think the key to any study that we do has to be that the study needs to be objective. And I think Bianca Soviet, she made some some good points regarding that.'",
        "'speaker_2': 'You know, we don't want a study that's preaches predisposed to certain conclusions or recommendations. And I don't I've reviewed the LA ATC reports and studies, and I believe that this is an objective study that we're going to be engaging in.'",
        "'speaker_2': 'And I and I hope that proves to be true. And I personally intend to reach out and be present for any discussions on this topic with workers and with businesses. I happen to represent a district that has many successful business corridors.'",
        "'speaker_2': 'And we can speculate all day long about what a raise and minimum wage would do to the businesses in those communities. But what's important to me is not to have that discussion where we're speculating about what might happen, but that the business community and the people that operate these businesses for their livelihood and to help raise their'",
        "'speaker_2': 'families, that they not have angst and anxiety about what this might do to their business, that we try to weave in some mitigation measures that would incorporate some of their concerns into any policy that might eventually be considered by the Council.'",
        "'speaker_2': 'I hope that. When the study commences that the following recommendations are considered and looked at in terms of the study, because I agree with Mayor Garcia, who said it best, which was, you know, we want to do this the Long Beach way.'",
        "'speaker_2': 'We want to do the study and recommend policy changes that are unique and specific to the city of Long Beach. We don't want to do what everyone else has done. And what I've heard over and over again. There's no new issues with this minimum wage debate that affect Long Beach differently than any other cities.'",
        "'speaker_2': 'I disagree. I disagree. I think that there are some unique opportunities for us as a city to fashion some remedies that would mitigate some of the concerns that our business community has. So I'd be looking for a study that considers the impacts of proposed minimum wage on our businesses and specifically our small businesses and our nonprofit organizations'",
        "'speaker_2': '. And some of those options that I'm hoping we get feedback are on are, as Councilman Durango mentioned, whether or not any proposed increase would be incremental in nature so that it would allow for a smooth transition. That's something that's easier for our business community to absorb.'",
        "'speaker_2': 'I'd want to know what the risks are of the dialog that we're hearing about the possibility of losing businesses to nearby cities. That's a very real thing that we have to look at as a community. When businesses say to me, Well, you know, if you do this, our businesses are going to move to another city.'",
        "'speaker_2': 'What I say is, well, you know, possibly that's something we need to study. But we also know that the City of Long Beach offers certain opportunities to businesses, especially certain types of businesses, and given their proximity to the beach and different areas that other cities don't give.'",
        "'speaker_2': 'We are in a place where a lot of businesses like to do business as as much as I often hear that we're not as business friendly as we could be, and we're definitely working on that. But it's certainly a city that offers a lot of opportunity to businesses.'",
        "'speaker_2': 'It really is. It's proximity to the beach, the diversity of the population, the income potential and the sales tax revenue potential in certain parts of our city provides a lot of opportunity to businesses. It is a great place to do business.'",
        "'speaker_2': 'So I want to know, you know, what is the risk of losing businesses to nearby cities and what cities would those be? I'd want to know also whether or not there are any exemptions and delayed implementation opportunities for small businesses and nonprofit organizations that we might want to consider.'",
        "'speaker_2': 'And also whether or not applying any of our state exemptions that are currently exist for minimum wage, such as an exemption for a parent, child or spouse to the employer, exemptions for employees who have no previous similar or related experience below the minimum wage during a training period.'",
        "'speaker_2': 'Exemptions that might apply to our local businesses the size of the business and whether or not an exemption might apply. Those are real things that I think we need to take a look at in the study. And I know that the study will look at those, and I hope that we work together collaboratively to come up with'",
        "'speaker_2': 'legislation that really addresses some of the fears and the risks that businesses feel that they're taking with this kind of legislation. I think anyone who is following council and can count would be able to conclude right now that the policy would probably pass today if it was presented as a sort of a legislative change for the city'",
        "'speaker_2': 'of Long Beach. I think that the mayor is trying to get us all together so that we can communicate and have a conversation that allows for a balanced approach, so that when the legislation impacts the city of Long Beach, it impacts the city of Long Beach in a very balanced and fair way, the best to the best'",
        "'speaker_2': 'extent possible. So with that, I will be supporting the study tonight.'",
        "'speaker_0': 'Thank you. Counts Counsel Councilmember Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I want to just first thank Vice Mayor Lowenthal and Councilmembers Gonzalez and Andrews for allowing me to sign on to this this recommendation tonight. I want to thank all of the public who came out and testified on From All Perspectives.'",
        "'speaker_7': 'And I'm really proud of Long Beach in this moment. And I'm particularly proud of the tone and the tenor that this discussion is taking so far. I know that there are a number of stories that we heard tonight, a lot of misconceptions about this population called low wage workers or the working poor.'",
        "'speaker_7': 'I heard a man say that he received a $2 raise over 20 years tonight. To me, that means that the system is broken. The minimum wage is in place to ensure that people aren't taken advantage of in the system.'",
        "'speaker_7': 'And I also understand that our small businesses and our nonprofits might be afraid of this conversation. And that's why I think I'm very proud of the tone that our city has taken, our mayors taken, our fellow council members have taken, and ensuring that small business and nonprofits are at the table as we have this conversation.'",
        "'speaker_7': 'I think that that's a step that. That's the reason I'm proud tonight, is that Long Beach is taking this step and doing it the right way and doing it in ways in a collaborative manner that other communities might not have done it.'",
        "'speaker_7': 'Tonight is about facts and not rhetoric. Who are the people who actually make up this group of low wage workers and the working poor? I think that the study is important for a number of reasons, but there are particular a few, particularly a few misconceptions that I'd like to talk about tonight.'",
        "'speaker_7': 'So first, I heard one of the first speakers say that this is something for teens or young people. But the fact is, 27% of breadwinners residing in Long Beach make less than $15 an hour. That's 39% of our Latino breadwinners in this community.'",
        "'speaker_7': '28% of our African-American breadwinners in this community. And 29% of our women women breadwinners in this community. These are people who are heads of household. 85% of our low wage workers are not teenagers. Well, I guess if you count a 19 year old, but 85% are between the age of 1955.'",
        "'speaker_7': 'They're adults. They're held accountable by our laws. They're adults. Secondly, I think that so we have to acknowledge where we fit in in terms of the national conversation. 22,600 of our workers residing in Long Beach who actually work and live and work in Long Beach have incomes below the federal poverty level.'",
        "'speaker_7': 'Third, the the I heard a concept about use this as a stepping stone to get to another job. And I understand that concept of pulling yourself up by the bootstraps. But I think that that conversation is a bit unfair considering that the middle class jobs that maybe our parents might have known that you might not have needed'",
        "'speaker_7': 'a high school, that you might not have needed a college education, those manufacturing jobs, those are those are gone. And a significant amount of our jobs that we have now are service based jobs. Our industry is particularly changed.'",
        "'speaker_7': 'In fact, 36% of workers living in Long Beach. So a over a third of all of our workers make less than 15 an hour. And so in that, 69% of all bar and restaurant workers, 60% of all home care workers, that's 60% of all childcare workers, 55% of retail trade workers.'",
        "'speaker_7': 'So a significant part of our population is considered low wage workers. Fourth, we can't really look at minimum wage in a silo. I think we have to look at everything that's happening. Councilmember your Ranka mentioned this. Families who make minimum wage still have to pay rent.'",
        "'speaker_7': 'The affordability gap between housing affordability and wages continues to grow. And the reality is, we can't just say that we raise the wage, and that's the way that you fix the problem. We have to get serious about affordable housing in this city.'",
        "'speaker_7': 'We need to get serious about thinking about ways to connect our disconnected population in this city. So I think there's a larger part to this. Another another point misconception. Folks say that raising the wage is a handout. I would say that folks who make a certain wage work oftentimes harder than than in management level or higher level'",
        "'speaker_7': 'level people. They work really hard to make that living. And the fact is, statistics and data will show you that a minimum on a minimum wage, every dollar that you raise the minimum wage, these folks aren't investing them into IRAs.'",
        "'speaker_7': 'And for one case, these people are spending in their local community on daily needs. That's a local economic boost to our local economy, to Long Beach. So so finally, I was moved by particularly a lot of the stories today about wage theft and enforcement.'",
        "'speaker_7': 'And I do understand this in a in a deep and personal way, how what it means to live paycheck to paycheck. Many folks might not know, but my mother was an in-home care provider and an a nurse's aide.'",
        "'speaker_7': 'And and my my stepdad was a a contract truck driver. And the reality is, they were able to make ends meet, make it work, and get to be two kids through college. But what we need to remember is that raising the wage, enforcing this wage is just as important as raising the wage, because we can raise a'",
        "'speaker_7': 'wage as much as we want to raise it. But if we become someone said, I don't remember the words someone said, but if we'd be a safe haven for wage theft, then I guarantee you we're going to have significant legal issues to look at.'",
        "'speaker_7': 'So. So here's what I know and here's what I'd like to do tonight. I know that that raising the wage so the Fed and feds have a responsibility at enforcing federal minimum wage. State has a responsibility to enforce state minimum wage.'",
        "'speaker_7': 'And my understanding is that local it's incumbent upon the local community to rate to enforce any elevated level of of wages. And I know that a number of cities that did go through the process of raising their wage, they didn't have the comprehensive conversation about what it means to actually enforce.'",
        "'speaker_7': 'I know that this conversation won't fix all the issues of wage theft that we heard with truck drivers and so on and so forth. But we could make sure that we're not opening ourselves up to be more susceptible to wage theft.'",
        "'speaker_7': 'So so I want to ask I want to ask our vice mayor if she'd be open to asking our city staff, which would be city manager, city attorney, city, whoever that might be, to really make sure that while L.A. EDC is evaluating their study, we can also internally do the work to make sure that we're prepared to'",
        "'speaker_7': 'enforce the wage that we we raise here. And in general terms, what I think is really there's certain elements I'm looking for to hear back on. I think we know what our. I'd like to better understand what our legal authority is today.'",
        "'speaker_7': 'And if we were to raise the wage, what would be our legal authority in our city? What are the tools that we can count on from other agencies, perhaps the state, maybe adjacent cities who are tackling this way?'",
        "'speaker_7': 'The county is developing its enforcement measures. What tools can we utilize in partnership with others as well as internally? What tools can we utilize through our department's financial management, so on and so forth, to ensure that we are not opening ourselves up and we have a robust enforcement system?'",
        "'speaker_7': 'And I'd like to understand the costs, the cost, the fiscal impact of that as well. I'd like to I think that's the general gist of it. I want to see what we can do internally with our systems, what we can do across agency boundaries and and what our legal abilities are today and what they will be moving'",
        "'speaker_7': 'forward. So that's something you'd be amenable to in your motion.'",
        "'speaker_0': 'Before we go to the vice mayor, I just want to just just add to that because I think I think what you're talking about is actually some of that's happening already. And I want to just just mention that over the over the last few weeks, as we as staff is know this is coming, there have been actually'",
        "'speaker_0': 'multiple conversations between staff and the city attorney already, because if obviously where we are right now is at the study phase, but if this were to go anything beyond the study phase, the city is responsible for the enforcement piece.'",
        "'speaker_0': 'I mean, that's just that just law. And so I think what what you're asked what you're requesting is something that the staff is already is committed to doing. And so I think vice mayor, I think I certainly make sense to begin looking at enforcement.'",
        "'speaker_0': 'It would be our responsibility regardless.'",
        "'speaker_8': 'I agree. I think it's important to raise that issue tonight. And I'm very glad that Councilmember Richardson did. Tying excuse me, tying those two issues together tonight may not be the best approach, but we heard from several speakers who also attended the Harbor Tidelands Committee meeting on that issue.'",
        "'speaker_8': 'So it is a critical issue for our local economy, and I believe staff will do that.'",
        "'speaker_7': 'So what I'd like to do is make sure that we divorce the larger issues that we've heard maybe at the Harbor Titans Committee, but really focus in on those things I mentioned in relation to this minimum wage. I think it makes sense that as ladies study, we do our diligence as well.'",
        "'speaker_7': 'So tonight is really about fact finding. I would feel more comfortable if I just heard that. Yes, this is a part of our intentionally a part of our effort as a friendly amendment or just hear from staff that they hear me.'",
        "'speaker_0': 'Mr. West, we hear you.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_8': 'That's all I need.'",
        "'speaker_0': 'Okay. Thank you, Councilmember Austin.'",
        "'speaker_10': 'Thank you. And I want to thank the full chamber here. Obviously, this is a momentous occasion for the city of Long Beach. It's a historic day that we are actually talking about raising wages. I just want to lament, I've been involved in the labor force as labor for many years, for over two decades, well over two decades'",
        "'speaker_10': '. We've witnessed the economy change drastically in Long Beach over the past 20 years. Thousands of manufacturing jobs in aerospace and the shipyards were lost. And when I say thousands, I mean tens of thousands of jobs. And I can remember, as a young labor organizer fighting the North American Free Trade Agreement and such trade agreements in the nineties'",
        "'speaker_10': '. Today, our economy and our workforce is really a result of those agreements. And, you know, I want to speak to some of the comments earlier. Teenagers are truly competing for similar jobs as their parents today. We need to change that.'",
        "'speaker_10': 'I'd like to leave my support to this item because I think it merits our attention. We are a progressive city that values both business, but we value our workers as well. Our neighborhoods and our neighbors in L.A. and L.A. County have already adopted a minimum wage increase that would, over the next five years, will increase the minimum'",
        "'speaker_10': 'wage to $15 an hour. I. I. I want to speak to the. The famous aphorism mentioned by President John F Kennedy. Kennedy. A rising tide lifts all boats. I would like to believe that every time we wait, raise the minimum wage, we advance the vanguard on the war on poverty and all wage earners benefit.'",
        "'speaker_10': 'Our economy will adjust and have done right. Small businesses, retailers, restaurants will benefit by creating more disposable income for consumers. Low income workers will have more disposable income to pay tuition at our community colleges and our classrooms to advance their education and advance their situations.'",
        "'speaker_10': 'And and and to a point raised earlier regarding potentially losing business by raising the minimum wage, the risk of not taking action on this conversation about wages and moving forward with this study, we may lose workers to nearby cities as well.'",
        "'speaker_10': 'It was mentioned that SB three is before the legislature, which would address minimum wage and there is work on a statewide level to do that. There's also signature gathering going on for potential ballot initiative in 2016. And and so the work that we're doing here as a city council tonight, the the the study that we, I would'",
        "'speaker_10': 'hope are moving forward with is timely and necessary. We it's it's our responsibility to have this conversation. I want to speak to the process because I'm encouraged by this process for the proposed study as well. It includes labor and includes big business and legitimate stakeholders throughout our city.'",
        "'speaker_10': 'I think the Los Angeles Economic Development Corporation is a credible and biased partner that can provide us with facts on the feasibility and impacts of the minimum wage increase on our local workforce. Small businesses in Long Beach and surely using local data, right?'",
        "'speaker_10': 'Long Beach data. I'm also pleased that the minimum wage increase will be vetted through our Economic Development Commission. This is a citizen participation process as well. It doesn't, but I still do have a few questions. I think Councilmember Richardson addressed one of them because I was really concerned about the the the enforcement of measures.'",
        "'speaker_10': 'Are we considering that? And is that being studied in this measure? You know, we heard from the city manager that that he'd heard that also from many of the speakers here. I know that there is a sick leave component that is being requested.'",
        "'speaker_10': 'And I was curious to know, was that included in the L.A. City and L.A. County measures and will certainly be studied in this study as well. Can anybody from staff answer that question?'",
        "'speaker_0': 'Actually, vice mayor or the. I think there was a I think there was a question about about sick leave.'",
        "'speaker_8': 'So I think in terms of this item, it should be separate. It is something that's of concern. When we did the living wage for hotel workers, sick leave was included in that. Assemblymember Lorena Gonzalez had passed legislation statewide regarding sick leave as well.'",
        "'speaker_8': 'So. On this issue or on this particular item. If we can hold that separately, I think it would be best it would be a best approach.'",
        "'speaker_10': 'Okay. And is there a speaking of a measure in. I'm curious to know how the minimum wage increase will affect the measure in measure that was approved by the voters in 2012. Would that include them or would we have to go back to the voters to to address their wages in any way?'",
        "'speaker_0': 'I think the city attorney is probably going to be looking into that, from what I understand.'",
        "'speaker_14': 'Yes, mayor or members of the council. I think that if the council were to pass a citywide minimum wage ordinance, that's higher than the than the living wage, the minimum wage ordinance would be the floor. And if that the living wage for the hotel workers, based on how it was written, whatever increase above that, it would apply'",
        "'speaker_14': 'to them.'",
        "'speaker_10': 'Okay. We don't want to leave anybody behind. And is there an expected timeline for the study? I didn't see any any timeline associated with this.'",
        "'speaker_0': 'I don't know that there's a timeline per se. We actually do have someone from the L.A. EDC that's here in the audience. Please, if you want to come forward. I know that. If you can answer that question, I know there isn't a timeline asked, but I know you've done a lot of the work prior.'",
        "'speaker_0': 'What it's for is how much time do you need to present something to to the council?'",
        "'speaker_5': 'So thank you. I don't think we've had any discussions yet on starting work, but I would anticipate it would be around 60 days because we have done a lot of the foundational work for it on behalf of the county.'",
        "'speaker_0': 'And that would be a minimum of 60 days maximum.'",
        "'speaker_5': 'And 92. It would be hopefully within 60 days. From a contract.'",
        "'speaker_0': 'From a contract point of view. Okay, Councilman.'",
        "'speaker_10': 'And lastly, I just would maybe offer some consideration for possibly a friendly amendment. Because my point regarding youth employment, I think, is extremely important. We want to make sure that we are preparing the workforce for the future as well.'",
        "'speaker_10': 'And and I would love to to know that we are giving some consideration to our youngest population, our youth workers, as well as we are studying this this minimum wage. And so in that study, I would love to at least have some figures, some information about how if in any way raising the minimum wage impacts youth employment'",
        "'speaker_10': ', because I think that that's merited for discussion as well. And lastly, I would just offer my support and ask that the entire council support this this measure as well.'",
        "'speaker_0': 'Thank you. I think that youth employment piece is going to be looked at as part of the study. Vice Mayor So I think it's a part of your motion, yes. Okay. Thank you, Councilman Andrus.'",
        "'speaker_9': 'Yes, thank you, Mayor. You know, I know it's getting late and everybody's kind of sitting around wondering what the outcome is going to be. That's going to take some time. But I think a lot of this is very well put.'",
        "'speaker_9': 'I've heard a lot of, you know, conversation here tonight. And I think a lot of us really are very compassionate about, you know, the minimum wage. And, you know, what we're trying to do here is really let individuals know that our compassion, our concern not only for you as an individual, but for your families, for your kids'",
        "'speaker_9': ', because this is something that we all need and we know we need it. It's just think about time. How long is this going to take? This is what you weren't about it. We're talking about, you know, year after year after year, people are still in school and everything is still going up.'",
        "'speaker_9': 'So where do we get to the point that we're going to have to hurry up and make a decision to let these individuals know that we're here for you and we're going to try to come up with some type of solution to be able to help individuals here in the city of Long Beach.'",
        "'speaker_9': 'I don't think we're trying to follow a trail any other city. This is for Long Beach. And I know the business people are looking at it also. But I think the more they make, the more they're going to put back in.'",
        "'speaker_9': 'And I'm totally in support of this. And I want to thank my colleagues for allowing me to ride in on this. And thank you very much.'",
        "'speaker_0': 'Thank you. Councilmember Superdome.'",
        "'speaker_11': 'Thank you. And I'd like to thank all those who attended tonight and especially those who spoke. And I'd also like to thank Mayor Garcia for his comments that this should be a Long Beach focused study. And I believe he's in alignment with Georgia Economy and he's of the Language Business Journal and thinking that Long Beach is unique'",
        "'speaker_11': '. We're not L.A. and the study should reflect that. I believe that all the speakers here tonight spoke in favor of the study, and that's been the commentary I've gotten from the business community in recent weeks that everyone would like to go forward with the study.'",
        "'speaker_11': 'So I will be supporting that tonight, and I thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Councilwoman Mongo.'",
        "'speaker_4': 'Yes. I am so thankful that we have been able to have such an equitable discussion today. It really means a lot to be able to talk with both business leaders and our employees alike to discuss the opportunities and risks with raising the minimum wage.'",
        "'speaker_4': 'I think that it's important that our businesses have a voice in the process and generally speaking, when wages increase, what does that do to the prices of the things that you're purchasing? And does that mean that people purchase their goods and services outside the city of Long Beach?'",
        "'speaker_4': 'And what does that mean to our businesses and potentially lost clients? So when we talk through I really appreciated the comments from so many of our neighbors that discussed that raising the minimum wage does not necessarily increase your discretionary income.'",
        "'speaker_4': 'When you talk about the business owner, they cannot change their lease agreements very quickly. They cannot change the requirements for inventory. They cannot change a couple of the other things. But what they can change is the number of hours that they allocate and how much goes out in payroll.'",
        "'speaker_4': 'And a lot of our business owners have told me stories of the times when they chose not to take a paycheck so that they could meet payroll for their employees and how important that is. But that, in turn, some of those employees, whether they're making $13 an hour or $15 an hour or $20 an hour, depending on'",
        "'speaker_4': 'where you work. The costs of working there are so much higher in Los Angeles to park in downtown L.A., a monthly permit is $120 a month. And so to no one understand that if we increase the wage, that does not necessarily mean that there's additional money for these individuals to spend in our local businesses, and we have'",
        "'speaker_4': 'to be mindful of that. And so I appreciate the so many that came out on both sides of the matter. I, like my colleagues, have said before that I am always in favor of a study, even if I do not feel that I would be in favor of the end result.'",
        "'speaker_4': 'Because I think data and a fair and balanced approach that I know the L.A. EDC will bring to the table is is what we need before we make any big and crucial decision. So thank you to ladies EDC for being a partner on this and so many other matters of bringing business to L.A. County.'",
        "'speaker_4': 'Your work on so many of the initiatives of bringing major businesses to the region has been phenomenal. I think that your organization is really plugged into the industry specifics that many of our neighbors talked about here today. There are certain limitations within the state law that are really limiting for our restaurant owners.'",
        "'speaker_4': 'For instance, there are waitresses that make minimum wage, but still with tips at some of our high end restaurants. Clear six figures a year. And yet state law doesn't allow them to tip out the back of the house.'",
        "'speaker_4': 'And what that means is your cooks, they can tap out the servers and they can tap out the bartenders. But there are certain state laws that are that are really restrictive in allowing that balance. And so finding a way to take into account those tips and service charges and other things like that, I think are really appropriate'",
        "'speaker_4': 'in finding that balance. And then specifically in looking for the small business programs that we have already started to initiate and other tax credits and incentives that we can provide to open businesses here in Long Beach are really part of the exciting things that will keep it attract businesses here, regardless of what we decide on the minimum'",
        "'speaker_4': 'wage. And so and with that, I hope that we can have a fair and balanced discussion and be really involved in the process of understanding the impacts to our neighbors because our neighbors come first.'",
        "'speaker_0': 'Thank you. And Vice Mayor Lowenthal, finally.'",
        "'speaker_8': 'Thank you, Mr. Mayor. And I just wanted to close our discussion by thanking everyone that came forward today with the diverse perspectives on the issue. And I think we are headed toward a great path to study this issue.'",
        "'speaker_8': 'And similar to what Councilmember Price indicated, I think all of us are very interested in studying issues regardless of where we are personally on the issue or where we may believe we may land. I can attest that. This council is honestly looking at this issue not just to follow suit with what other cities are doing, but really'",
        "'speaker_8': 'to look at this issue and see what's good for Long Beach. We don't believe. I don't believe and I think it's fair to speak on behalf of our entire council and mayor. We don't believe that what's good for workers is mutually exclusive from what's good for business.'",
        "'speaker_8': 'I think we we see the shared commonalities in in both groups being able to prosper. And so I'm hoping that as we continue this dialog, we don't bifurcate the two qualities of life between business and workers and business and families.'",
        "'speaker_8': 'They can't be mutually exclusive. They have to be shared. And so I, too, am concerned about any potential impacts to small businesses. It is not one that I would intended, is not one that this council wants to see.'",
        "'speaker_8': 'We also, as it was said earlier today, we also do not want to be a labor market that is unattractive because we are not competitive. And so there is that concern. So I trust that the EDC will look at all of those components and all of us know that when the state and federal minimum wage was established'",
        "'speaker_8': 'and all of the increases it has gone through, the value of the minimum wage itself has fallen dramatically. But everything else and you've heard this from real, real life testimony tonight from workers who struggle and whose families struggle, the cost of everything else has far too far surpassed the value of minimum wage.'",
        "'speaker_8': 'And I think it is fair to do a study and to determine where we are and how we are benchmarked against those items and those and really the cost of living. And so with that, I am hopeful that we can continue that dialog as we've had today.'",
        "'speaker_8': 'I'm hopeful that we all consider and empathize with families that are not one able to live in our city or not able to live in our city independently and are living in situations where we see bedroom splitting and all of the negative impacts of poverty that spreads society wide and certainly citywide.'",
        "'speaker_8': 'And so I'm hoping that we are all positive in how we go through this study of this conversation and regard that everyone's while being really is our own well-being. With that, I thank you, Mr. Mayor.'",
        "'speaker_0': 'Thank you, Vice Mayor. And that concludes the deliberation. We have a motion on the floor and a second. I want to thank everyone who came and spoke tonight. I think it means a lot to have valuable public input.'",
        "'speaker_0': 'And I just want to remind everyone that the tonight is the beginning of a discussion and will go in over the next few months and go out to the community and begin a a dialog that will be inclusive and open and transparent.'",
        "'speaker_0': 'So thank you. Thank you all for being here for that issue. Please cast your votes.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Thank you. We're going to take a two minute recess and then we're going to the item on coyotes next.'",
        "'speaker_5': 'Well.'",
        "'speaker_8': 'Really, that's next.'",
        "'speaker_3': 'I really got I got. Really?'",
        "'speaker_0': 'All right, um, let me see what I can do.'",
        "'speaker_9': 'We'll get back to you.'",
        "'speaker_3': 'Yeah, that was. Yeah, yeah, yeah. Yeah.'",
        "'speaker_0': 'That's where they go.'",
        "'speaker_3': 'It's gonna be, you know that. You know, you go in there.'",
        "'speaker_9': 'George and George.'",
        "'speaker_0': 'Jimmy.'",
        "'speaker_3': 'The other one is the.'",
        "'speaker_9': 'Other one I was getting mixed up with week. Well he doesn't work his his brother at the door. He's the one that goes that didn't want to do that.'",
        "'speaker_6': 'He didn't remember.'",
        "'speaker_0': 'Me. Well, who cares?'",
        "'speaker_3': 'Yeah.'",
        "'speaker_9': 'He gets everybody. He's got good.'",
        "'speaker_3': 'Yeah. Yes, I know how you got to work.'",
        "'speaker_5': 'Working.'",
        "'speaker_0': 'Okay. We're going to call the the city council meeting to order. If I can have everyone, please take their seats.'",
        "'speaker_3': 'Oh, there's no cake.'",
        "'speaker_5': 'Then it's cupcakes.'",
        "'speaker_0': 'Madam Clerk, if we can just have the roll call.'",
        "'speaker_1': 'Councilwoman Gonzalez. Vice Mayor Lowenthal. Councilwoman Price, Councilmember. Super. Now here. Councilwoman Mango. Councilman Andrews. Council member. Yarrawonga Councilman Austin. Council Member Richardson. Mayor Garcia.'",
        "'speaker_0': 'Thank you. We are now moving on to item 26.'"
    ],
    "Entertainment Permit Application for Tailgate Bar. ": [
        "'speaker_0': 'I'm here. Thank you. We're going to do we're going to do the budget next. But right before the budget, we got to do hearing item number one, which should be fairly quickly. So, Madam Clerk, hearing one.'",
        "'speaker_5': 'Man. Oh, man.'",
        "'speaker_1': 'Report from Financial Management Recommendation to receive supporting documentation into the record. Conclude the hearing and grant an entertainment permit with conditions on the application of Tailgate Bar located at 2503 Santa Fe Avenue for Entertainment Without Dancing District seven.'",
        "'speaker_0': 'Thank you. Is there a quick report from from staff?'",
        "'speaker_13': 'Yes, Mr. Mayor. Members of the council, this is hearing item two and the staff report would be done by Jason MacDonald, our purchasing and Business Services Manager.'",
        "'speaker_0': 'Mayor. Council Members. Jason MacDonald. Purchasing and Business Services Manager.'",
        "'speaker_6': 'Bureau. Bureau Manager for the Financial Management Department. Tonight you have in front of you the application for entertainment without dancing for James Sheppard doing business as the Tailgate Bar 2503 Santa Fe Avenue in District seven. All the necessary departments have reviewed the application.'",
        "'speaker_6': 'The application of proposed conditions are contained in the packet that was provided. We are prepared to discuss any questions or concerns along with the police department regarding the application.'",
        "'speaker_0': 'Or.'",
        "'speaker_6': 'Conditions. Our office has not been made aware of any complaints regarding this application or the business location. That concludes my.'",
        "'speaker_0': 'Report. Thank you. Thank you. And wanting to be sworn in. Do we know on the for this item or no oath? Mr.. No oath required. Correct. Okay. So let me go ahead and then now turn it back over to Country Ranga to comment.'",
        "'speaker_6': 'Thank you, Bear. Then. Thank you for that, for the staff report. I think that it shows that the business is doing well. And I would like to thank the city of Long Beach, the Development Services, Health Department, Financial Management, Police and Fire for their diligent efforts in addressing the needs of both our residential and business stakeholders in'",
        "'speaker_6': 'this area. I do not think that I could have been more proactive with provided with a more thorough understanding of the situation at hand and of our options for moving forward. You have allowed me to somewhat tenuously ensure the quality of life for our community while remaining business friendly.'",
        "'speaker_6': 'Furthermore, I am encouraged by Mr. James Shepherd's willingness to operate under the specific recommendations of the City of Long Beach to address the concerns of the West Miami neighborhoods and who live near in the Sugar Cove area. I am hopeful that in adhering to these recommendations, the tailgate bar will not only operate as a conscientious community partner'",
        "'speaker_6': ', but will have the tools to become one of the go to venues in the seventh District and the city of Long Beach. Last but not least, I would like to thank the West Miami Sugar Code residents for their continued advocacy on behalf of their community, and especially for patiently working alongside my council staff and city departments as'",
        "'speaker_6': 'we progress through this lengthy process. And with that, I'd like to make the motion to approve the berm.'",
        "'speaker_0': 'It has been in motion. And a second, is there any public comment on the item? CNN members, please cast your vote to be close to hearing.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Thank you. I'm going to go ahead. And Mr. City Attorney, you wanted to make an announcement from earlier?'",
        "'speaker_6': 'Yes.'",
        "'speaker_14': 'About 6 hours ago in the closed session, we were reporting out from the closed session regarding the hearing on the item for the address of 53, 70/42 Street by a vote of the City Council of 9 to 0.'",
        "'speaker_14': 'The Council voted to reject the offer to purchase the property, thus concluding any real estate negotiations. Thank you.'"
    ],
    "Budget Hearing for Harbor Department and Water Department.": [
        "'speaker_0': 'Thank you very much. Okay. So we are now going to go into our budget presentation or budget item and. I'm going to turn this over to. Mr. West. And obviously we're all mindful of what has to get done tonight still.'",
        "'speaker_0': 'So let's just try to. Be, as you know. Let's get on with it. How about that, Mr. West?'",
        "'speaker_6': 'Yes, Mayor. Council members.'",
        "'speaker_0': 'Can we get to the first line? So what we're planning to do tonight, we have two departments here. We have public works is going to go first, then Parks, Recreation and Marine.'",
        "'speaker_13': 'Each of their presentations should be under 10 minutes.'",
        "'speaker_0': 'And what we want to do is we tie these to police and fire in.'",
        "'speaker_6': 'Our public safety continuum. We've talked about this in the past. Parks, recreation, Marine play a.'",
        "'speaker_0': 'Large role in the public safety of our community, providing activities.'",
        "'speaker_6': 'Opportunities for youth to be busy.'",
        "'speaker_14': 'Opportunities to have open space in our and in our areas for seniors and everyone else. Public Works, of course.'",
        "'speaker_0': 'Plays a huge role in our.'",
        "'speaker_13': 'Community, in keeping our infrastructure looking good, also eliminating graffiti and just keeping a calm demeanor.'",
        "'speaker_6': 'And having our city look.'",
        "'speaker_14': 'Good and things like that. So again, I just want to highlight that both of these departments play a.'",
        "'speaker_6': 'Large role in helping police and fire keep our community safe. Our Malloy and our public works director is going to go first.'",
        "'speaker_10': 'Thank you, Mr. West. Good evening, Honorable Mayor and City Council. Thank you for the opportunity to provide a brief overview of the Public Works Department's Fiscal Year six proposed budget. During the city manager's presentation last week, he provided the public safety continuum.'",
        "'speaker_10': 'I have included how Public Works coordinates with other departments on supporting the strategy. The regularly scheduled meetings, which each of you have, has been invaluable to maintain constant communication and ensure were on the track with service delivery. In addition, I would like to thank the city manager and staff for day to day support to deliver quality programs'",
        "'speaker_10': 'and CIP projects. Finally, I take pride in our 442 employees. These are the silent heroes who are working diligently every day to maintain and enhance the city's infrastructure and environment for the benefit of the public. In order to maintain a structurally balanced operating budget, we focus on our key services.'",
        "'speaker_10': 'Although our four bureaus have very diverse functions related to quality of life and safety issues for residents, businesses and visitors. Our key services include provide for and maintain safe and adequate infrastructure for the community, provide for sustainable environmental protection and a positive service environment and safely and efficiently design, construct, deliver, protect, and maintain services for public facilities'",
        "'speaker_10': ', public ride away and stormwater management. This includes building and roadway design and construction, infrastructure maintenance, refuse and recycling and stormwater management. It is through the performance of our valued employees that we envision a better tomorrow by serving and exceeding the expectation of the public.'",
        "'speaker_10': 'Our department is a critical component in the public safety continuum. Public Works addresses the more manageable issues such as litter pickup and graffiti to prevent blight when called upon. Our staff is trained to respond quickly with the necessary equipment.'",
        "'speaker_10': 'Our notable example of our safety and emergency response services are the recent Southern California Edison power outages. Public Works was one of the main responders to to support the city's EOC and field operations. Our dedicated staff worked around the clock to support the city.'",
        "'speaker_10': 'As a follow up to the mayor's budget message, Clean Streets team will remove litter and perform other clean up activities along major streets, such as pick up and dump. Pick up dumped items. Finally, our graffiti program removed 95,000 square feet of graffiti with 98% of a service request completed within 24 hours.'",
        "'speaker_10': 'In addition to supporting city's public safety continuum, fiscal year 15 has been a very productive year for public works, with the ongoing and one time funding provided by you, the City Council Public Works shortly staffing accomplishments include constructing 86 million in capital improvement projects, including airport library parks, public facilities, streetlight storm drains, streetscape streets, sidewalks and traffic'",
        "'speaker_10': 'improvements, completing 9.3 million and arterial street repairs 4.5 million and sidewalk repairs and 9.2 million residential street repairs. This includes 55 miles for major than residential streets and 15 miles of sidewalk repairs, repairing 42,000 potholes, trimming 25,000 trees, removing 200 tree stumps, replacing 9000 traffic signs and 700 street named signs.'",
        "'speaker_10': 'Repainting, repainting 19 miles of red curbs and re striping 40% of miles of streets. Continuing on our accomplishments, we have collected 183,000 tons of trash from 117,000 residents and commercial accounts responding to 2200 facility, 9000 traffic signals and signs and 12,000 Long Beach requests for service.'",
        "'speaker_10': 'Mobility programs continue to be a significant focus for the department. One of our recent events in the successful beach streets uptown that saw an estimated 30,000 attendees completing the Class One Beach pedestrian path, as well as Class three bike lanes on chestnut and orange.'",
        "'speaker_10': 'Finally, the department is currently in design on an estimated 38 miles of bike boulevards and lane miles for construction planned through fiscal year 16 through 19. Public works is nearly $140 million budget includes nine funds. I'll briefly mention a few key funds as shown on the pie chart, starting at the right side and going clockwise.'",
        "'speaker_10': 'Refuge and Recycling Fund is for refuge collection and contract recycling Operation Waste Diversion Programs as well as litter free Long Beach program. Public Works General Fund totals 35,000,009% of city's total general fund budget. The department's general fund expense is offset by 23 million from various revenue sources, including parking citations, permit fees and parking meters.'",
        "'speaker_10': 'The Civic Center Fund is for the Civic Center's ongoing maintenance and operation. This includes custodial and parking operations. Gas stock, street improvements, funds or moneys received from the state for right of way improvements in addition to capital funds also support eligible general fund street related programs such as street sweeping traffic signals and street signs.'",
        "'speaker_10': 'Finally, the transportation fund or monies received from the county for transportation purposes. This includes Prop A, Prop C and Measure R. Fiscal Year 16. Major changes continues to the city's focus on the importance of stormwater environment. As you know, the city is mandated to comply with Clean Water Act guidelines through the National Pollutant Discharge Elimination System.'",
        "'speaker_10': 'The fines resulting from noncompliance of NYPD's permit can range from 5000 to 10000 per day. The 600,000 is a non-recurring general fund, and 233,000 is a non-recurring title, and funds will cover the required cost associated with permit compliance.'",
        "'speaker_10': 'The fiscal year 16 proposed budget includes transferring the Asset Management Bureau to the Economic and Property Development Department. There is a net zero citywide impact associated with this item. Lastly, positions were included in that to enhance our extensive parking operation, as well as providing clean up support for homeless belongings.'",
        "'speaker_10': 'In fiscal year 16. The significant issues and opportunities facing public works include implementing the street, sweeping optimization efficiencies to relieve congestion and parking, impacted neighborhood and improve efficiencies of service. We look forward to working on the first street sweeping routing in 30 years.'",
        "'speaker_10': 'We plan to start implementation at the end of the calendar year. Significant strides have been made in the last year to address the city's aging infrastructure with additional nonrecurring funds. However, it is not anticipated that these non-recurring funds will be available at that level in the near future.'",
        "'speaker_10': 'Aging infrastructure is a constant issue facing our city. The mayor requested that we include the topic of our infrastructure assessment and backlog of project as an item to be discussed in the further and further details at the September 12 City Council retreat.'",
        "'speaker_10': 'As one of the highlighted items in mayor's presentation, the department is continuing the effort to improve efficiency and the city's 30,000 streetlights system, including the installation of LCD lighting to achieve an energy and maintenance cost savings starting this year.'",
        "'speaker_10': 'Smart parking meters were installed in Belmont Shore, downtown and the pike. The miners are capable of accepting credit card payments and provide the first 5 minutes of parking free. One of the benefits of having the new sensor technology is the planned future app for drivers to identify open parking spaces.'",
        "'speaker_10': 'A major assessment of city stormwater pump stations, which focuses on the condition and capacity is anticipated to be completed in fiscal year 16. This will result in several budget recommendations for capital improvements in fiscal year 17 for a 23 storm rain pump stations.'",
        "'speaker_10': 'The pump stations are approximately 60 years old and serve as 380 miles of active stormwater infrastructure, including pipes, open channels, ditches, culverts and drains. The Traffic Signal Assessment Audit will be performed to ensure that signals have the requisite timing sheet and implemented process.'",
        "'speaker_10': 'So as new signals are added, that timed in compliance with best management practices as met as mentioned earlier in the presentation. Department will continue to focus on citywide mobility programs. This include initiating construction on 38 miles of bike boulevards and lanes.'",
        "'speaker_10': 'In addition, we're currently working on the full deployment of the city's bike share. That includes 50 stations and 500 bikes. Full launch is anticipated to take place in fiscal year 16. Finally of 16 includes a restructuring of refuse rates based on a study conducted by an outside firm to better reflect the full cost of service.'",
        "'speaker_10': 'These rates will be presented for City Council approval and will be subject to the public noticing and hearing requirements. In closing, public works school is to continue to provide as many of these essential services seamlessly. To put the level of service in perspective.'",
        "'speaker_10': 'The department's inventory includes 130 bike lane miles, 11 different share locations, 850 miles of streets, 250 miles of alleys, 1160 miles of sidewalks, 1500 miles of curb and gutter, over 400 public buildings, 147 bridges, 180 miles of storm drains, 23 pump stations, 3800 catch basin, 100 street, 100,000 street trees.'",
        "'speaker_10': '48,900 street signs, 580 traffic signals over 2500 parking meters and 117,000 refuse and recycling accounts. Thank you for your support in the past and I look forward to working with each one of you going forward. The Parks, Recreation and Marine Department presentation will follow.'",
        "'speaker_6': 'Honorable Mayor and members of the City Council. It is my pleasure to present to you the Department of Parks, Recreation and Maureen's fiscal year 2016 proposed budget. This budget provides the resources that not only help our city to be recognized as a national leader in parks and recreation services.'",
        "'speaker_6': 'But even more importantly, it provides us the opportunity to have a positive daily impact on the Long Beach community. As you know, the department is a large and dynamic organization. The following slide provides a high level overview of our services.'",
        "'speaker_6': 'We provide recreational opportunities to meet the diverse needs of the community. We provide for quality maintenance of parks, facilities, open spaces, beaches and marinas to promote an active, healthy lifestyle. We ensure that our marinas and waterway facilities meet both owner and community needs, and we promote responsible pet ownership and work to reduce animal overpopulation.'",
        "'speaker_6': 'You go too far. One more. Here we go. During the city manager's presentation last week, he discussed the city's public safety continuum operations. And I want to give you a few examples of how the department plays a critical role in Long Beach public safety activities.'",
        "'speaker_6': 'The department activates the city's youth and teens by providing access to healthy recreation opportunities during the hours that they are out of school and creating a safe environment for positive development and enrichment. The following is a sample of the diverse programing we provide.'",
        "'speaker_6': 'So we have afterschool programing that is provided daily during the school year at 26 park sites and Fun Day program is provided during the winter, spring and summer breaks. These programs offer everything from homework help to enrichment activities.'",
        "'speaker_6': 'Each provide each site provides youth the support and mentoring opportunities to increase their academic success. We anticipate over 225,000 visits for youth ages 5 to 12 this year. The Be Safe program provides extended recreation programing at six parks in this city and expands the free programing to include the entire family.'",
        "'speaker_6': 'We expect over 40,000 visits to these sites this summer. The Youth and Sports Program provides four seasons of sports to over 7000 youth, ages 5 to 12 at 26 parks. And this year, we were able to adapt the program and increase its services to include a pilot program for teens ages 15 and 16, which focuses on good'",
        "'speaker_6': 'sportsmanship and leadership development through positive play. The department operates ten summer day camp programs for parents looking for custodial supervision, along with engaging activities for kids. These are very popular programs. We've seen a 21% increase in the registration this year over last in our day camps.'",
        "'speaker_6': 'Teens visit our 14 centers over 15,000 times each year. These sites provide a supervised safe haven for teens afterschool. And during the summer, we have three year round in three summer community pools that provide swim lessons and recreational swim opportunities to over 225,000 participants.'",
        "'speaker_6': 'And our nine week summer food program provides approximately 125,000 free meals each year to youth ages 1 to 18. And just as important, but often overlooked, is that each year we provide hundreds of area teens and young adults their introduction to the workforce through volunteer and employment opportunities in our park programs.'",
        "'speaker_6': 'Moving on. Our beach maintenance operation works tirelessly year round to protect our coastline. During the two recent power outages, the department stepped up as it would during any natural disaster or emergency response situation, and in both events established an emergency shelter and food, water and ice distribution center at Chavez Park.'",
        "'speaker_6': 'And our Animal Care Services promotes public safety and the humane treatment of animals through emergency response to animal related incidents 24 hours a day, seven days a week. Over the last year, we responded to over 28,000 calls for service.'",
        "'speaker_6': 'Very briefly on our accomplishments. The Department continues its best in the nation service models and was once again recognized statewide and nationally for our achievements, including the California Parks and Recreation Society, once again honored us with three awards in 2015.'",
        "'speaker_6': 'We were named a Playful City USA and the Trust for Public Lands Park Score Index rated Long Beach as the highest ranked city in Southern California and 18th overall nationally. We dedicated three new parks, and we were able to move our Alamitos Bay Marina, rebuild efforts forward with the issuance of Marina revenue bonds, which will help us'",
        "'speaker_6': 'complete the remaining basins. We further enhanced existing water conservation efforts by eliminating irrigation of our grass medians with potable water. And all of this as we continued strategic investments of one time resources and all of our parks in our park facilities and amenities across all nine city council districts.'",
        "'speaker_6': 'Another great accomplishment is the demand for our park programing continues to soar. In addition to those programs that I spoke about earlier in the presentation, we also help seniors lead active, socially, enrich lives along with giving them easier access to health and social services.'",
        "'speaker_6': 'Our department makes contact with area seniors almost 500,000 times a year, and we had 32,000 contract class registrations in the last year taking advantage of our diverse class offerings. These classes are provided by private instructors, which serves as an economic driver for the Long Beach small business community.'",
        "'speaker_6': 'For fiscal year 16. Our proposed budget totals over $55 million across all funds, with 31 million in the general fund. As you can see from the pie chart, the department also has substantial Marina and Tidelands operating fund budgets to support our activities in the marinas, beaches and waterways.'",
        "'speaker_6': 'It should be noted that the department does have significant general fund revenue totaling close to $12 million, which helps support our programs. The Fiscal Year 16 budget proposes for just under 450 full time equivalent positions in during our busy summer months.'",
        "'speaker_6': 'Our total staffing complement grows to close to 800 people. And I'd like to point out that the department continues to work hard to identify other outside funding to help sustain our park system. The Department is extremely pleased with the continued investment in our services identified in this proposed budget.'",
        "'speaker_6': 'This will allow us to continue all of the services and programs that the community depends on. This slide highlights some of our budget changes for FY 16. Resources have been increased fully offset by new license revenue for the implementation of the mandatory spay and neuter program.'",
        "'speaker_6': 'This will help us to further our efforts to reduce pounds. We will consolidate staffing at Eldorado, East Regional Park and the Eldorado Nature Center into a one campus model. Not only will this improve the oversight of the operation of this large and unique natural resource, but also will provide a savings to the general fund.'",
        "'speaker_6': 'Various changes will be implemented to gain operational efficiencies and budget savings in the Tidelands Fund, including reorganizing the Marine and maintenance operations bureaus to be more responsive to our customers needs. And we will utilize nonrecurring funds to assist us in the conversion to drought tolerant landscaping in our medians.'",
        "'speaker_6': 'Yeah. The Department's his great opportunity and continuing our efforts to seek partnerships with the community, to improve our service offerings. Our relationship with the Long Beach Unified School District has allowed us for the sharing of resources to provide a broader scope of services to the community.'",
        "'speaker_6': 'For example, new aquatic programing is offered this summer by the department at the new Cabrillo High School Pool, which enhances our programing already offered at Jordan and Millikan High School Pools. The department has once again teamed up with the Long Beach Convention and Visitors Bureau to develop the 100 days of summer to help promote city recreational opportunities'",
        "'speaker_6': 'and the successful placement of thousands of impounded animals. Every year is dependent upon the many wonderful community partnerships that our Animal Care Services Bureau has been able to develop and nurture. We will further strengthen our community engagement and access to information through use of technology, including greater use of social media.'",
        "'speaker_6': 'We are going to be formalizing a turf in urban forest management plan to provide a road map for ongoing maintenance requirements, investments and conservation efforts. We will continue working in collaboration with the Department of Public Works to carry out our strategic investments in our parks and facilities.'",
        "'speaker_6': 'And we will continue our efforts to provide innovative new programs to meet evolving needs in the community. Honorable Mayor and members of the city council. We have a large park system with over 160 parks, 3000 acres, 26 community centers, dozens of athletic fields, 67 tennis courts, five golf courses, 54 playgrounds and three pools and three marinas.'",
        "'speaker_6': 'Our opportunities are many. Through all of these facilities and our programs, we have made millions of positive contacts with the Long Beach community each year. Your continued investment in the Parks, Recreation and Marine Department has been essential to our ability to meet the needs of the Long Beach community.'",
        "'speaker_6': 'We thank you for your continued support and this concludes my presentation.'",
        "'speaker_0': 'Thank you and thank you both for the presentation. Councilwoman Pryce.'",
        "'speaker_2': 'Thank you. I'm going to keep this brief, but you guys have worked so hard, I think it's worthy of a few comments for the investment that you've put into the presentation. So thank you. First of all, thanks to both of you for your reports.'",
        "'speaker_2': 'I think when you do the little the brag sheet at the end of both of your presentation, it really highlights. For those of us who are often very concerned about the projects in our own district, it puts into context what you're working on when you're not meeting with us individually.'",
        "'speaker_2': 'So it's really I appreciate you doing that because as Ara was articulating all the great things that his department does for the city, I was thinking, Huh, maybe that's why our projects aren't always at the top, at the forefront of his mind, even though I know they are.'",
        "'speaker_2': 'You always make it seem like they are. But you guys are really doing a lot, a lot citywide. You really are. So I appreciate that. And and, Mr. Scott, you are doing a phenomenal job in your new position.'",
        "'speaker_2': 'You're just you're doing a great job. And I really appreciate the collaboration, the creativity that bringing everyone to the table. You're just you're doing a wonderful job. So thank you for that. Just a couple of questions that I had or observations that I wanted to make in regards to public works.'",
        "'speaker_2': 'I think one of the things that you mentioned and I would like this to remain a citywide priority is for us to figure out how to keep maintenance of our city facilities and assets on the forefront of our minds at budgeting times.'",
        "'speaker_2': 'Because I think sometimes we, we neglect to adequately fund those reoccurring. Obligations of the city. So I think, you know, moving forward, I'll be looking for opportunities where we can make maintenance a priority for us for future budget years.'",
        "'speaker_2': 'To the extent possible, I think that's very important in regards to Parks Rec and Marine. You know, I think that there's there's one thing you mentioned in your PowerPoint that I think some councilmembers, most councilmembers are probably aware of, but having lived it for the last year, the Cosign Protection program that PRM engages in, it's really unbelievable'",
        "'speaker_2': 'the amount of work and resources that go into that program. And I think most of my colleagues and probably most of the residents of the city don't know or can't appreciate how hard your team works on that and how important that services.'",
        "'speaker_2': 'It takes them two weeks to build up a berm in anticipation of a storm, and they build up that berm in order to protect the homes on the peninsula from flooding. And the reason that they have to do that is because we have such severe erosion problems at that end of the city that those homes are constantly'",
        "'speaker_2': 'at risk and those citizens are constantly at risk. In fact, last year alone, we had several incidents where our team did such an amazing job working around the clock, building up the berms that our our beaches were safe and SEAL Beach got flooded.'",
        "'speaker_2': 'And that, to me, really is an important part of your department that sometimes goes unnoticed because it really only impacts certain parts of the city. I think it's important to point out that they are protecting the health and safety of those residents every single day.'",
        "'speaker_2': 'We did have a presentation earlier today regarding the municipal band, and I know it wasn't covered in your budget, but I'm assuming that you were here when I made some of the comments that I made. And if we were, you know, I realize that they've they've done some fundraising, but if we were to consider a six week'",
        "'speaker_2': ', it's very important to me that the colleagues on council who wish to have some music from the municipal band or some sort of entertainment from the musical municipal band in their district, maybe a modified version of what the municipal band currently does citywide, maybe something that's a little more specific to their constituents that that opportunity might be'",
        "'speaker_2': 'a possibility for the six week if we were to do a six week. Do you think that's even feasible?'",
        "'speaker_6': 'I think certainly, Councilwoman, that it would be feasible. In fact, we had a program probably five or six years ago, which was a summer concert band season, which was above and beyond the municipal band season. And so we had concerts in the council districts that did not have the municipal band events within their district.'",
        "'speaker_6': 'So we've definitely done it before and you know, can certainly look at doing it in the future.'",
        "'speaker_2': 'So if we were to add a six week, that's something that we could consider maybe doing something on the West Side, for example, and tailor made for whatever if if the residents of that district wanted it tailor made for that district to some to some extent, obviously.'",
        "'speaker_2': 'Okay. And then one of the biggest issues we have is enforcement of our ordinances regarding animal control and responsibilities of pet owners. What would it cost if you know and if you don't, we can talk about this offline, but to add an additional enforcement officer for animal care services to help enforce things such as dog waste issues'",
        "'speaker_2': 'that occur throughout the city.'",
        "'speaker_6': 'You know, I don't have the fully loaded costs in front of me, but we can certainly provide that to you.'",
        "'speaker_2': 'Okay, that sounds good. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I, too, want to appreciate our our department heads who worked so diligently on both of these reports. I believe that our streets, our sidewalks, our potholes, these are the things that are most crucial to our quality of life.'",
        "'speaker_4': 'They allow neighbors to get to and from their jobs to and from their children's schools and to and from the places where they spend money right here in the city of Long Beach. So thank you. I really appreciate the extensive amount of work that has been done this year in graffiti removal around the parks.'",
        "'speaker_4': 'I know that in the fifth District we have a lot of parks and graffiti removal is a an indicator when we are able to clean it up quickly, it's it's a sign to those individuals that it will not be tolerated here and that that kind of behavior is not okay.'",
        "'speaker_4': 'And so I really appreciate the work that you've done on that. I know that there's some talk about the Be Safe program separate and apart from the one time funds. What is the Be Safe program? Ongoing budget.'",
        "'speaker_6': 'Well, the Be Safe program has been funded annually through the council office. One time funds for the proposal for FY 16. Through the mayor's recommendations, there's $186,000 identified. We look at about a $21,000 budget per site. And so working that for that could be six, seven or eight different sites.'",
        "'speaker_6': 'But there is no structural funding for the B save program.'",
        "'speaker_4': 'Thank you. And within the. $21,000 per site. That is the primary summer enforcement. Or is it weekends in the fall as well?'",
        "'speaker_5': 'You know.'",
        "'speaker_6': 'The $21,000 is for a ten week program throughout the summer. And this is for extended recreation hours at for this year six park community centers.'",
        "'speaker_4': 'Thank you. And then I also wanted to think. Our Public Works department on the work that they're doing with relation to our our parking meters and our street sweeping. I know that that has been something that residents have really been excited about.'",
        "'speaker_4': 'And we appreciate your innovation.'",
        "'speaker_0': 'Thank you. Councilman Braxton.'",
        "'speaker_10': 'Yes. I'll be very brief. First of all, I want to thank both departments for your presentations. Very well done. A job well done. And 15. I had a specific question for the public works department. Ah, in terms of the, there were two issues regarding the if significant issues or opportunities moving forward, the traffic signal assessment audit, I'm'",
        "'speaker_10': 'sure you explained it, but can you give me a little bit more detail on what that actually means and what that is? Absolutely. Councilmember Austin, the audit that I'm proposing is to look at every single traffic signal timing within the city and make sure that the timing is properly documented.'",
        "'speaker_10': 'And best management practices require that we put those timing sheets one at the center location, one within the cabinet itself, and and one is kept in the files. The reason for that is if there's an outage and somebody has to go out there and if the signal is on a blinking red and they need to readjust or'",
        "'speaker_10': 'reprogram it, they have the proper timing. It's a it's a purely from a liability perspective for the city. I'm trying to protect the city from any liability that could occur. I'm sure the city attorney can attest to that, that any time there's an accident at any intersection, the first thing that happens is they depose the timing sheets'",
        "'speaker_10': '. So I want to make sure that all the timing sheets within the city are absolutely current. They are stamped by a licensed professional engineer and also it's programed into our traffic center. And what would they cost for that?'",
        "'speaker_10': 'This is no cost. Staff is doing it. Okay. And refuse rate restructuring. What is what is that in reference to? Is that for private? No, sir. I believe our rates have not been adjusted within a decade or so.'",
        "'speaker_10': 'A finance department has hired a consultant to look at the rates, and we will have a separate meeting to discuss the adjustment of the rates. It has to comply with proper notification and proper, proper meeting. Okay. Thank you for the clarification.'",
        "'speaker_10': 'And Mr. Scott, I wanted to follow up on Councilmember Mungo's question regarding the BE program. You mentioned that there currently in NY 15 is no structural funding for be safe. Are you saying that there are no there's no structural funding for be safe if why 16 as well?'",
        "'speaker_6': 'There is not structural funding for the BCC program in the FY16 budget.'",
        "'speaker_10': 'Okay. I was I'm a little confused there because in the budget presentation that we received last week, it where I was left under the impression that it would be part of a structural.'",
        "'speaker_0': 'I can clarify that for the budget message and it's written out there. The BC program would move from counselor discretionary accounts to the one time funded amount that's provided in the budget. That's why it's not structured. It's one time with the intention of moving that structurally in the future.'",
        "'speaker_0': 'That's how it's written out in the in the budget message. So it just essentially moves from council discretionary to being a funded one time dispense of the city's.'",
        "'speaker_10': 'So instead of being under.'",
        "'speaker_0': 'The control or.'",
        "'speaker_6': 'Of the council office, it is.'",
        "'speaker_10': 'Now the city.'",
        "'speaker_0': 'Manager. The one time.'",
        "'speaker_10': 'Budget or the department's one time.'",
        "'speaker_0': 'Budget. Right. A one time like any other one time expense.'",
        "'speaker_10': 'But essentially, we're still going to provide the the service. And that's the Internet.'",
        "'speaker_0': 'Is exactly right. All right. The idea is to, you know, prioritize that as something that's important. It's a citywide importance to focus on these parks and so to move them out of council and make it one time.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Any other questions? Councilmember Richardson.'",
        "'speaker_7': 'Thank you. So I want to begin just by thanking both public works and Parks and Recreation, not only on a good presentation, but on really keeping up with the community in terms of our demands. I know that we can be very demanding in terms of making sure that our our facilities are clean and maintained and ultimately being'",
        "'speaker_7': 'improved. I want to just. Just a few comments. I know that Parks and Recreation, we've got a very exciting year coming up in Parks and Recreation in District nine and that we're going to be taking on a master planning effort of sort of all of the parks in District nine, as well as looking at some more strategic'",
        "'speaker_7': 'things with with our only regional park in the area, Highland Park. So I wanted to just, you know, chime in and say, hey, I'm really, really excited. I think your budget is your budget is is everything that I've expected.'",
        "'speaker_7': 'And I look forward to continuing on this pace of improving our open space facilities. I want to I want to just chime in and and ask and ask for an update from Parks and Recreation on whether there's there's a focus on LED light conversion in our parks, similar to the way that we're placing a focus on our'",
        "'speaker_7': 'business corridors. And secondly, I know there was I know there was a discussion about improving our cameras in the parks. And I would like to just have an update on where we are. Does that program still exist and sort of where are we with that program?'",
        "'speaker_6': 'Councilmember Richardson, with respect to the LED lights, we are certainly on board with the conversion of our existing lights to LED lighting, where and when we have the available resources for new park facilities. Those will definitely be built into the plans and specifications.'",
        "'speaker_6': 'And as we're able to convert existing lights and have the funding to do so, we will certainly endeavor to do that.'",
        "'speaker_7': 'So I guess my question there would be is there some opportunity that we haven't evaluated in terms of exploring, maybe using some of the same resources or incentives that might be out there, whatever approach we're using on the business court or sort of seeing if there's some some crossover in our parks that we can explore, or is'",
        "'speaker_7': 'that something we can do?'",
        "'speaker_0': 'Pat, Pat, can you answer that question? Because I don't see why we wouldn't be looking at that. Tom Morello.'",
        "'speaker_13': 'So we are currently engaged in an effort to replace all of our lights with LED lights, and there are some financing mechanisms available to us. One is rebates from Edison and the other is an on bill financing. We are certainly going to be looking at our parks, at our beach areas, as well as all of our residential'",
        "'speaker_13': 'and corridor areas too. So if we are able to use those incentives to fund those, we would very much like to do that.'",
        "'speaker_7': 'So what? So I would my suggestion would be this. If there are and you know, I just stated it, we're going through a very intensive master plan process specifically with Highland Park. And lighting is is an element of that conversation.'",
        "'speaker_7': 'I would love to see that if we figure out a strategy to go. Leiby We sort of look at areas where we have synergy in our parks, where we're placing a focus on certain things so that we can make sure that's integrated into our master development process.'",
        "'speaker_7': 'And that's all I have to say there. Do we have any comments on the camera piece? Cameras in the park.'",
        "'speaker_6': 'Councilmember Richardson, over the last couple of years, we have had a pretty aggressive camera program in our parks. Those have been primarily funded through the council office one time funds. But it's certainly something that we want to continue working with the police department, the council offices and our Department of Technology and Innovation to try to maximize the'",
        "'speaker_6': 'use of the cameras in the parks and see if there aren't any synergies with some of the other efforts in the business districts and what have you.'",
        "'speaker_7': 'Thanks. So the last thing I have for parks is just a follow up. I haven't. I haven't. Forgive me. I don't know very much about the Long Beach Municipal Man. I've actually never seen one of their performances. I I've heard that they have tremendous turnout at their concerts.'",
        "'speaker_7': 'But since we might be talking about that, I'd love to just have more background before we actually vote on the budget in terms of, you know, how much does a municipal band concert cost, where are they held, what is the total budget of our muni band that we invest on an annual basis?'",
        "'speaker_7': 'And how does that compare to our concerts in the park in terms of where those are distributed, the cost per concert versus a muni band concert? What else is out there? Are we? I know that, you know, since we don't have a large concert in the district four years ago we started our Latin Jazz and Blues Festival'",
        "'speaker_7': 'and took a few years to get added to the city's concerts in the Park series. But I'd like to just get a whole picture on how equitable, how equitable we invest in entertainment in the parks, so that if we talk about expanding, we have an honest conversation about what we're doing.'",
        "'speaker_7': 'So that would be my request there on public works. I just want to say that, you know, there's a lot of excitement around, you know, you know, regional attention on Artesia Boulevard and Capital. And we talked about that.'",
        "'speaker_7': 'And I think that we've really I think we've met expectations this year in terms of our maintenance needs. We I think they're timely. I think we have a department is very responsive. But would you say our that we're in a best position in terms of staffing to carry out all of the infrastructure requests and needs that the'",
        "'speaker_7': 'council and the city requires of or requests of your of your office in terms of, you know, actually carrying out projects. How how where would you say you are in terms of staffing for project maintenance management?'",
        "'speaker_10': 'Councilmember Richardson That's a great question. As every department is being challenged by retirement of baby boomers, we have we're facing the same exodus of our our senior management or senior engineers. We're in that phase of recruiting. So I'm confident by the end of this calendar year, we'll be fully staffed.'",
        "'speaker_10': 'We lost a lot of individuals with a lot of institutional knowledge to retirement that that was the time that I guess they reached at that point in their lives that they need to retire. So I have to say, we're in that transition period that we're going from retirements and vacancies to filling them, and we're very aggressively doing'",
        "'speaker_10': 'that and hopefully within the next two or three months will complete that process and will be fully staffed to accept any challenges that the council officers are giving us. In addition to, we could utilize consultants, as we do now, on a project by project basis.'",
        "'speaker_7': 'Great. So I'm very pleased to hear that. And I personally, I've seen that you've got some superstars in your department who already you know, you I don't want to name names, but they're really taking it to these projects.'",
        "'speaker_7': 'I would just like to just say that if for some reason the staffing issue somehow becomes a problem, that we somehow prioritize projects that place a focus on projects where we have like imminent funding mechanisms that that, you know.'",
        "'speaker_7': 'That might be available from external resources. We sort of place a great a tremendous focus on those because I would hate for any opportunities that we have coming up that we miss out on those because we're not necessarily prepared.'",
        "'speaker_7': 'But I have the utmost confidence in your department. And so, once again, thank you to both departments and those are my comments on the budget.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman Gonzales.'",
        "'speaker_2': 'Yes. I just want to thank you both as well. And I won't say I'll be brief, because everyone said that before and they weren't brief, though. I'm just getting I just want to get very much. Thank you both for this.'",
        "'speaker_2': 'These presentations. I have a couple questions. I'll first start with Public Works, so I know that we are converting to LSD, which everyone's talking about. I'm glad that Councilman Richardson brought that point forward about our parks, but I also have a concern with our alleys, our courts in a ways and lighting those.'",
        "'speaker_2': 'And I know, although it might pose kind of an issue because there's private property there. But I know I believe we had a program in place through neighborhood services where property owners can get a rebate of some sort.'",
        "'speaker_2': 'So is that something we can look into? I would love to peruse that again to see if there's an opportunity for that. As we're looking at lighting in general.'",
        "'speaker_10': 'I absolutely will take a look at that. Currently, we do have a program that if there are existing Edison Poles, but there are no streetlights and for 20 $500, we can install one single light if if the Edison has the capacity and and it's willing to do that.'",
        "'speaker_10': 'So we have that cooperation and collaboration with Edison. We can provide that service for areas that are dark. Also, we suggest that if people want to add additional lighting on their backyards to their walls and if they want to use LCD lighting, they can do that at any time without any any additional interaction with the city.'",
        "'speaker_10': 'But if they want something to be installed within the public right away, these are the alleys, then we can look at that. Obviously, we cannot install new polls in the alleys that are already congested. We would recommend maybe adding a single arm street light to to those poles and we can collaborate with any resident that wishes to'",
        "'speaker_10': 'do that.'",
        "'speaker_2': 'Great. But did we? I believe we had a rebate.'",
        "'speaker_5': 'Some sort of rebate program.'",
        "'speaker_2': 'Is that am I getting that correctly?'",
        "'speaker_10': 'I don't recall that being that in public works, that could be in the Development Services Department. It was.'",
        "'speaker_2': 'Through development.'",
        "'speaker_5': 'Services.'",
        "'speaker_10': 'I believe we can check with them and get back to you.'",
        "'speaker_2': 'Okay. That would be great. Absolutely. I'd like to look into that a little bit more. Um, okay. Thank you. And then I know for stormwater or storm drains, uh, I know our West Siders have often complained to me and have been very concerned with the storm drain issue on the on the west side.'",
        "'speaker_2': 'So how do we assess those and determine what is a priority city wide and how we can cast those out and get those fixed?'",
        "'speaker_10': 'Unfortunately, the storm drain fund is doesn't have any major funding resources. It's this is a true phenomenon with every city in the state of California, and it requires a vote of public to assess any kind of taxation in order to generate revenues, in order to fix those those infrastructures.'",
        "'speaker_10': 'As far as priority, basically, we have completed we're at 90% of our storm drain pump stations, which is basically the heart of the system. And then we have the arteries, which are their lines. So we want to start with the the main brain and the heart of the system and then get into the piping system.'",
        "'speaker_10': 'You will see maybe a presentation from me if if you're interested. And in the near future on the pump station conditions, we also have a master plan of our storm drain system which categorizes which pipes are undersized and which pipes need to be completed.'",
        "'speaker_10': 'It's just a matter of funding. And and we go from there. It's the same issue. Like you bring on any unfunded liability that we have or unfunded project that we have.'",
        "'speaker_2': 'Okay. Thank you. And I think you just in general for your work on smart meters and our power outage and and putting priority and emphasis on that. Thank you, Ira. And then Stephen for Parkes. I also want to thank you for your presentation as well.'",
        "'speaker_2': 'I know in the past we've had issues with maintenance of our parks and so are we doing anything different this time? Is there anything we're looking at? In a different light as far as quality and maintenance of our parks.'",
        "'speaker_6': 'Thank you for the question, Councilwoman. Yeah, I think there there has been an instance in the past where we had a contract situation where the contractor was not living up to the expectations of the city and the community.'",
        "'speaker_6': 'We did take steps very quickly in that particular situation to resolve that issue and use that as an opportunity to really improve our contract management capabilities. We have a new management team in our Maintenance Operations Bureau that is experienced and professionals in the industry.'",
        "'speaker_6': 'And so we definitely look forward to continued improvements in our maintenance operations and we're going to continue to look for opportunities to improve our maintenance of all of our parks and facilities.'",
        "'speaker_2': 'Okay. Great. Thank you. And I'll just comment as well that the Be Safe program although not structural, it's I'm I'm glad that the mayor has recommended a citywide approach because it's been so very impactful for the first district and your park staff is tremendous.'",
        "'speaker_2': 'I know we just had an event with the chief this past Saturday. It was so very positive for our community. So I have to thank you all for for doing that and staying committed to that. And then the security cameras I know you'd mentioned this, but just so my colleagues can know, I paid for that out of'",
        "'speaker_2': 'my discretionary funds, about $100,000 for 18 cameras. I'm working with tech services, parks and the police department. So it's proved to be very another very impactful point in our and our district. So thank you all. Appreciate it.'",
        "'speaker_0': 'Councilman Randers is thinking here.'",
        "'speaker_9': 'Now, it's a little after 12. I think we're trying to set another record, and I still want to be a part of that. So if you just bear with me another hour and a half from now, we'll get that done.'",
        "'speaker_9': 'And first of all, I'd just like to thank Bo Parks and. Public works for the fine work, both of the individuals done. Steve, I know you came on at the end, but your staff has been just tremendous, especially work with me in the sixth District.'",
        "'speaker_9': 'You know, I can't really tell them enough how much you guys have put into those parks that we have there. And and it's just one thing I'd really like to ask you. You know, I used the slogan, you know, keeping that little you know, keeping the kids busy is very important to me.'",
        "'speaker_9': 'And and you mentioned about the new team sports program. And I would like for you to tell me a little bit more about, you know, that pilot program that you have.'",
        "'speaker_6': 'Councilmember Andrews This is a program that we're very excited about as we were evaluating our youth sports program. Taking a look at what was working, what was were wasn't working. We noticed that we had essentially a gap in service.'",
        "'speaker_6': 'We weren't addressing the teens. We didn't have a sports program for the 15, 16 year olds. We had the youth sports program, which got us up to 12, but there was nothing beyond that. And, you know, high school sports are very competitive.'",
        "'speaker_6': 'There are limited spots. Organized leagues can also be very expensive. So we wanted to take the opportunity to use some of our existing resources to build a teen sports program that helped address that gap in service. And so we're in our first season right now.'",
        "'speaker_6': 'We have a six team basketball league. It's a six week program, and we really look forward to positive results from that program.'",
        "'speaker_9': 'Thank you. Thank you very much. And good public works or I don't need to say anything, but I just want to thank you and your staff for doing just such a wonderful job. It's just one question I have to ask.'",
        "'speaker_9': 'And and what is the estimate number of, you know, graffiti tags removed each year and.'",
        "'speaker_10': 'Honorable Andrews. Thank you. That's that's a great question. Yesterday, when I did the presentation, I mentioned 950,000 square feet of graffiti was removed. That kind of equates to about 75,000 tags. Each side could have a different square footage that gets cleaned.'",
        "'speaker_9': 'Thank you very much. And I'd like to thank both of you. Parks and I, you know, Public Square, you guys have done a great job. Thank you again. I'm not through because I have another hour to go, but I'll just pass it over to someone else.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Then a few other folks have a couple hours, so it's a long pause.'",
        "'speaker_8': 'Thank you, Mr. Mayor. And I want to thank both of you for the presentation and your patience. For waiting for us the entire night. So thank you. And I only have one question. Not an hour's worth. Just one question with the Park Patrol program, Mr. Scott.'",
        "'speaker_8': 'What? What is what's next for us? We have it. We have the pilot at the Bixby Park as well as in the six districts. Correct. Councilmember Field. So what would be next?'",
        "'speaker_6': 'Vice Mayor Lowenthal. You're correct. We had a pilot program both at Bixby Park and Shattuck Field. It's a park patrol program so different than the traditional park ranger program. These are actually recreation employees that are patrolling the park, making positive interaction and engagement with our park patrons, and then notifying the police department of any serious public safety'",
        "'speaker_6': 'concerns. But as you did mention, this was and is a pilot program. It was not funded in 2001. What we used were essentially salary savings from a vacant position to be able to pay for that. Looking forward in 2016, we do not have structural funding identified for the Park Patrol program at either location.'",
        "'speaker_6': 'And so, you know, that's something that's going to need to be addressed as we look forward. In fact, there is not structural funding to sustain the program.'",
        "'speaker_8': 'So when we had this conversation during the last cycle, one of the aspects of the program was an evaluation. We did commit to an evaluation, I believe. And so I'd like to know how the department will do that.'",
        "'speaker_8': 'Or is it already in your plan to do that? Because it wasn't intended just to have a pilot program and then it goes away. It's to evaluate it so that we can make some reference to what might be required at the parks.'",
        "'speaker_6': 'That's correct. Correct. Vice Mayor. We are actually in the process of completing the evaluation. We're basically about 12 months into the program. It started, I think, last August. So our team and our Community Recreation Services Bureau are completing that evaluation and we'll be providing that in a very shortly.'",
        "'speaker_8': 'And in that evaluation, will you be able to articulate how much it would cost, for instance, per park, to continue a program like that or to continue it at whatever recommended level you might suggest?'",
        "'speaker_6': 'Yes, we could do that.'",
        "'speaker_8': 'Okay. I would appreciate that. Thank you.'",
        "'speaker_0': 'Thank you. And Councilor Rose Hooper not.'",
        "'speaker_11': 'Thank you and good morning, gentlemen. I have just two questions. One for each group. For Parks and Rec on page 17. And it's under the heading of major changes. And that's the only reason I'm asking about it is is consolidated staffing in El Dorado East in the El Dorado Nature Center into one campus.'",
        "'speaker_11': 'At the end of the day, are there more or less budgeted positions at the Nature Center?'",
        "'speaker_6': 'Specifically at the Nature Center. It will be the same. It will be the same. Really what we're doing here is we're essentially just providing a higher level of supervision for the entire Eldorado campus. But we will have the same level of staffing.'",
        "'speaker_11': 'Okay. Thank you. And for on on on page ten, under the significant issues for public works, the storm water pump station assessment. So I'm as I'm hearing it, that we don't have a budget for any work on these, but I just like to document that.'",
        "'speaker_11': 'Station number nine at Atherton and the loss through this channel, it's the terminus of the former Atherton Ditch. The pump station is great, electric is all great, but the four bay loads up with about 18 inches of water continually.'",
        "'speaker_11': 'So I guess there's a sump pump that doesn't work. So I guess we're saying that we probably don't have the funding to repair that at this time.'",
        "'speaker_10': 'That's correct. We have funding in the budget right now to take care of more imminent issues in pump stations that are in a higher need. We usually tackle about one or two pump stations per year. But what I was alluding to is a comprehensive and comprehensive analysis that will give us the priority of every pump station and'",
        "'speaker_10': 'what needs to be done. We did a complete analysis of every pump station and investigated the electrical system, their scatter system, the four bays and all that. We tested pumps and we have a full engineering report that also indicates, you know, can they be an emergency generator or plugged in?'",
        "'speaker_10': 'Some of our pump stations are so old that we cannot just in case of a blackout, we cannot just attach a generator to run it. We have to go physically run, you know, wires. So which I'm trying to make it in a way that it could be easily plugged in or be ready for the generators.'",
        "'speaker_10': 'So it's more of for emergency response for all aspects of service. So that is being done. It's being put in a priority list and the funding that is needed. Okay. So it's a full blown CIP for pump stations.'",
        "'speaker_11': 'Okay, great. And to echo my colleague's comments, you guys are both doing a great job.'",
        "'speaker_10': 'Thank you. Thank you. And good morning to you also.'",
        "'speaker_0': 'Do you think you are facing.'",
        "'speaker_8': 'Just briefly to follow back up with Mr. Scott in the evaluation that you had mentioned that you are working on, it's going to be critical for council to have that so that they can work that into their budget conversations.'",
        "'speaker_8': 'Councilmember Price and I are having our community budget meeting tomorrow at Bixby Park. It will come up and so. I need to know a timeline and I need that timeline to be before council finishes its deliberations so that we can be informed by it.'",
        "'speaker_6': 'They did it for me. We will be able to provide.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Thank you all for the hard work and for enjoying the morning with us. Moving on. Any public comment on the budget? So is a budget hearing. Seen a public comment on the budget. So now moving on to item number 23.'",
        "'speaker_0': 'Thank you, guys. Yes. Item 23 on the regular agenda.'"
    ],
    "Alcoholic Beverage Control License Application for Truilero Mexican Grill.": [
        "'speaker_1': 'Report from please recommendation to receive and file the application of Juan Ramone Patino for an original application of an ABC license. District one.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_2': 'Yes. I just wanted to welcome Commander Lopez down here. And just to go over the hours, I know I initially had some concern, but I believe the hours are pretty narrow. Would you mind going over that information, Commander?'",
        "'speaker_5': 'Councilmember Gonzalez. The business is currently open for business Monday through Friday, 9 a.m. to 5 p.m. and Saturdays 11 a.m. to 5 p.m. and their closed on Sundays.'",
        "'speaker_2': 'Great. And how long have they been in business? Do you have that information?'",
        "'speaker_5': 'Yes, ma'am. This owner has been in business at this location since September of 2014.'",
        "'speaker_2': 'Okay. And from what I understand, they have only had one call for service and in that timeframe. I believe I have here that it was for a burglar alarm and that was that was it.'",
        "'speaker_5': 'There have been seven total burglary alarms, but they were all false. False alarms. Okay. Got it.'",
        "'speaker_2': 'Thank you very much. I appreciate it. And the recommendation, obviously, is to approve the. Recommendation for the ABC.'",
        "'speaker_0': 'There's a motion and a second. Any public comment on the item saying that? Please cast your votes.'"
    ],
    "Residential Repair Coverage Plans Assessment and Recommendations.": [
        "'speaker_1': 'Thank you, Commander. Motion carries eight zero 28. Communication from Vice Mayor Lowenthal. Recommendation to request the city manager to work with the Economic Development and Finance Committee to assess whether the city should allow residential repair coverage plans.'",
        "'speaker_0': 'Vice Mayor Lowenthal.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I wanted to make the motion and also ask council members that they may recall from their briefings or from your own research. There are coverage plans for sewer, plumbing and electricity that are separate from the standard homeowner's insurance policy.'",
        "'speaker_8': 'These cover leaks and other issues from the house to the property edge. These plans have been around in one form or another since the seventies, but the city of Long Beach has not partnered with any companies or supported them over the last year.'",
        "'speaker_8': 'So the city has been approached by a company wishing to offer the plan to residents. So I'd like to ask our E.D., an economic development and finance committee, to work with the city manager to evaluate this concept and determine whether it's appropriate for Long Beach.'",
        "'speaker_8': 'That's it.'",
        "'speaker_0': 'Thank you. Any public comment on the item? See none, please. Councilman Mongo.'",
        "'speaker_4': 'Vice Mayor Lowenthal, thank you for the recommendation. And how does this. How is the city a facilitator of the agreement? Is this company able to work with residents directly now?'",
        "'speaker_8': 'You know, they're not able to work with the residents directly. That's not my understanding. I think Mr. Modica can elaborate on that, what our role would be in facilitating it.'",
        "'speaker_4': 'Mr. MODICA If we could get a two from four before it comes, before it's enough so that we can be prepared on the item that would be. Appreciate it. Churkin two. Thank you. Thank you.'",
        "'speaker_0': 'Okay. Thank you. Members, please cast your votes.'"
    ],
    "Agreement with Code for America for Fellowship Program Participation.": [
        "'speaker_1': 'Motion carries eight zero 29. Report from City Manager and Technology and Innovation Recommendation to execute an agreement with Code for America in the amount not to exceed 220,000.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Any public comment? See. Now, please cast your counsel and roster.'",
        "'speaker_10': 'Yes, I recall the Copa America proposal.'",
        "'speaker_6': 'Coming before us about a year, year and a half ago.'",
        "'speaker_0': 'And I'm not.'",
        "'speaker_6': 'Exactly sure what our action was then. And and how is this different to that?'",
        "'speaker_0': 'Perfect.'",
        "'speaker_13': 'You are correct, Mr. Alston, that we did have code for America here last year that had to do with a discrete issue regarding Canada over utilizers of our fire system and looking at an application to really help with what we call the super utilizers of the of the system.'",
        "'speaker_13': 'This is a different application for code for America. This is actually tying into the innovation team. One of the things the I-Team has found is they went out and did a tremendous amount of outreach is that language really needs a system that helps people guide how to do business with the city?'",
        "'speaker_13': 'What are the different steps? How do you create a system that gets you resources to the Small Business Development Center before you get a business plan before you come to the city? How do you do business licensing? How do you do plan check?'",
        "'speaker_13': 'How do you interact with all of the things that you need to do to start up a business in a very intuitive fashion? So code for America to be working with the I-Team to create that system, to be one of the one of the premier startup Long Beach type systems in the nation.'",
        "'speaker_10': 'Okay. And as I read this and understand it, this won't this is this money has always been already been appropriated for the innovation team, correct?'",
        "'speaker_13': 'That is correct.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Any public comment? See nine members. Please cast your vote. So.'",
        "'speaker_1': 'Motion carries eight zero 30. Report from Financial Management Recommendation to receive and file the second budget performance report for fiscal year 2015 citywide.'"
    ]
}