{
    "Urgency Ordinance and Temporary Prohibition on Substantial Remodel Evictions.": [
        "'speaker_1': 'Councilman Mongo. Ocean carries.'",
        "'speaker_0': 'Thank you. Let's go ahead and read item 16, please.'",
        "'speaker_1': 'Communication from Councilwoman Zendejas, Councilmember Pierce, Councilman Austin. Recommendation to request the city attorney to draft an urgency ordinance for review at the February 18th, 2020 City Council meeting to address the substantial remodel loophole in the Tenant Protection Act.'",
        "'speaker_0': 'There's a motion in a second councilman's in the house.'",
        "'speaker_3': 'Yes. Amna, go ahead. And one of the reasons why I did this motion is because I've been getting a lot of a lot of residents coming to the first District with with eviction notices and fearful that they're being evicted unfairly in the interests of trying to keep things balanced and making sure that everybody is protected under the'",
        "'speaker_3': 'loophole of the 1482. I decided to really bring this item so that, you know, recommending the city staff to draft an ordinance. Okay. So I'm going to go ahead and reiterate right here what I have. The Tenant Protection Act also called the 1482, which passed in California and legislator last year and went into effect on January 1st'",
        "'speaker_3': ', includes a key provision that protects renters from no fault evictions. Essentially, in most cases, a landlord must demonstrate a breach of the terms or lease by the tenant in order to evict them. Just a case in which a no fault evictions are still allowed under the law is in the owners discretion described to significantly remodel the units'",
        "'speaker_3': 'in the case they are evicted the current tenant to it, you know, in order to ask the tenant to leave the tenant protection. AP 1482 states that the remodel must be significant enough to require construction permits, but it doesn't require the permits actually to be pooled or for the landlord to describe the nature of the remodels.'",
        "'speaker_3': 'The exact language should be the replacement of of substantial modifications of any, any structural electronico, electronic plumbing or mechanical system that requires a permit from a government agency or. Abate. Hazardous materials, including lead based paint, mold or asbestos, is in accordance with the applicant applicable federal, state and local laws that cannot be reasonably accomplished in a safe'",
        "'speaker_3': 'manner with the tenant in place. And that requires the tenant to vacate the resident's real property for for at least 30 days. Cosmetic improvements alone, including painting, decorating and minor repairs or other work that can be performed safely without having the tenant leave.'",
        "'speaker_3': 'The proper gym or vacate the property do not qualify for substantial rehabilitation. The item should required landlords obtain the permit. To construction prior to posting the notice to vacate and include those notices in the nature of the remodeling being done and copy of the permit when presented to the tenant.'",
        "'speaker_3': 'This does not change the law or policy and it's the rent control in any way, shape or form. All that it does is that it clarifies the existing law and helping bring landlords into compliance with the with the ordinance or with the law by asking them to demonstrate the legal requirements for significantly remodeling before tenants received notice'",
        "'speaker_3': 'to vacate. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Customer Pierce. Do you want to do public comment or do you want to go ahead and make comments first?'",
        "'speaker_4': 'We can do public comment first.'",
        "'speaker_0': 'And then we'll come back. You can come on our behalf.'",
        "'speaker_4': 'I'll comment. Now, I'm going to be brief. I think that this is a, you know, a great item that doesn't touch with the state laws already put into place. It makes sense that before we uproot families, before children are taken out of their schools and have to move neighborhoods, that we are making sure that the landlords do'",
        "'speaker_4': 'their part first, which is taking out that permit first. I think I want to thank the councilmember for leading on her first housing item, and I look forward to hearing from our community members and I hope everybody will support this.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you very much. I do have a list of speakers. So we have over ten speakers who will be going down in 90 seconds. And we'll start I'm going to call the first. If you can, please come forward and line up as I call your name, please.'",
        "'speaker_0': 'So the first five speakers in this order are Hall Stewart, Gretchen Swanson, Hilda Delgado, Katie Douma and Jordan Winn, Hala Stewart, Gretchen Swanson. Hill of the Gotto Katie DOMA or Kate DOMA. Jordan. Jordan Wynn, please. Alice, please.'",
        "'speaker_2': 'Good Mayor and council. I am speaking in favor of passing this. To close this loophole.'",
        "'speaker_0': 'Because, by the way.'",
        "'speaker_2': 'I'm a homeowner here in Long Beach. I'm not a cat. But I believe that justice has to be for all of us, not for part of us, and not just for landlords or not just for tenants. And this closing this loophole will provide the city with a situation where it can hold its head high and sell.'",
        "'speaker_2': 'So, yes, we are trying to provide justice and equality for tenants in a way that allows them to develop their families, to be part of our community and feel proud of that. So please do pass this and let's close this loophole and make it better for everyone.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you very much. Speaker, please.'",
        "'speaker_5': 'Good evening. I'm Gretchen Swanson in Rose Park, area of District two. First, I want to thank Councilmember Santos for this leadership. Had you not done this, we wouldn't be able to understand the ramifications of a tiny loophole. The loophole has legal implications, loopholes.'",
        "'speaker_5': 'We hear about tax loopholes and people sort of shudder. They don't want to be, you know, caught in a loophole, but it allows for discretion that does not follow the spirit of the legislation or the regulation. So we know in January of this year we got greater, better tenant protections around California.'",
        "'speaker_5': 'Yes, but very quickly, an unforeseen loophole here. So my position is requiring permits that meet the standard of substantial remodeling is needed. I, for one, do not want to see landlords prevented from doing this type of remodeling. We have many properties in the city that need substantial remodeling and have for years.'",
        "'speaker_5': 'This simple and single correction protects both the tenants and the landlords for secure and safe housing. We need to close the loophole and protect our tenant community in Long Beach.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Nick. Speaker, please.'",
        "'speaker_4': 'Good evening. My name is Helder. Then I'm the district director for Senator Lena Gonzalez, and I am reading this letter on her behalf. Dear Mayor Garcia and council members are right in support of Item 16 tenant protection substantial remodel loophole on the Long Beach City Council agenda for today.'",
        "'speaker_4': 'It is critical that the city does everything it can to ensure tenants are not wrongfully displaced. Last year, I was proud to vote in support of the California Tenant Protection Act of 2019 to provide a statewide rent cap and just cause eviction protections.'",
        "'speaker_4': 'Due to the timing of implementation, many cities, including Long Beach, pass emergency ordinances to prevent displacement of current tenants before the law went into effect on January 1st, 2020. Now, many tenants have received notices to vacate properties for what land owners consider substantial remodels without a sincere effort to perform those improvements.'",
        "'speaker_4': 'The original intent of the law was to provide tenant protections and prevent unwarranted evictions, yet it had it. Yet it does not clearly define the conditions under which property owners can require tenants to vacate for a remodel. Council Item 16 will help clarified what counts as a substantial remodel so our constituents are not wrongfully evicted.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_2': 'Next week at this.'",
        "'speaker_5': 'Good evening.'",
        "'speaker_6': 'You have all heard from me in a variety of ways, and I just wanted to reiterate and thank you.'",
        "'speaker_5': 'To.'",
        "'speaker_6': 'Those of you who put this forward. It was great work getting it together and. In counter measure to the discussions that we've heard from property owners, not yet tonight, but in the newspaper, they said they don't know the extent of the work that needs to be done until the tenant moves out.'",
        "'speaker_6': 'Well, according to the law, they have to know what they want to do in order for the eviction to apply. So if they're arguing they don't know what work needs to be done, then they don't have grounds for the eviction according to the state law.'",
        "'speaker_6': 'And that is the most basic concept. So this measure will ensure that they have put that into place, that they have a plan, that they know what they need to do before they can send out a notice to evict.'",
        "'speaker_6': 'Now, you also know that I think this is a great first step. It's a Band-Aid on the bleeding, but that stricter measures would be even better. So I would love to see this pass, and we'd love to discuss what more can be done in the future.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Let's hear from you. And before Jordan speaks, I'm going to call the next five speakers. Sandra Tommasini said I can fee Ankie Zwirner Curtis, Max Norris and Daniel Sherwood. Please come forward. Sandra Tommasini said, I can see an orchestra under Curtis, Max Norris and Daniel Sherwood.'",
        "'speaker_0': 'I apologize if I if I got any of those names wrong, please come forward in that order.'",
        "'speaker_2': 'Sure. Hi there. Jordan Wynn, District two resident. I stand in support of item 16 and I want to thank council members S.A. Pierce and Austin, who is not here for bringing this item forward today. It's very important and quick and easy fix for this ordinance.'",
        "'speaker_2': 'The fix for this ordinance is very modest. It simply clarifies the process. I want to make it clear that it doesn't add any additional burdens or restrictions on landlords, and it should actually help landlords avoid issuing 60 day notices that violate state law and the cost that they would have to incur in doing so, having to defend'",
        "'speaker_2': 'unjust evictions, reissue notices, etc.. I want to thank the Council for protecting tenants in the winter and keeping tenants home for the holidays by passing an eviction moratorium. Unfortunately, those same tenants are facing this loophole. They are facing these unjust evictions, unfortunately, through the guise of substantial rehab that does not have any papers pulled and does not'",
        "'speaker_2': 'have any sort of evidence that it will take place. So we ask for this common sense reform and that this loophole be filled. Thank you so much.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_4': 'Speaker eight Thanks for hearing me. I'm Sandor Tommasini and I am currently being evicted under this substantial renovations clause. I've been gathering evidence to see what can apply in my case, and I realize that the only recourse I have is to, after the fact, gather evidence that substantial renovations may not have taken place and then sue the'",
        "'speaker_4': 'owner or property management in civil court. Well, that seems like a ridiculous way to enforce the law. So going forward, it would be much better if these landlords have to provide evidence by telling city permits, providing architectural plans and so forth before they can evict people, which shows that they are actually following the letter of the law'",
        "'speaker_4': 'and doing the substantial renovations that they say instead of the cosmetic renovations that they, by observation, seem to be doing. So if you can just put that into law, then we are all protected and do not have to depend on suing these people later, which is pointless because at that point I've already lost my apartment and all'",
        "'speaker_4': 'of that. So thank you for having me. Thank you. To those of you who have put this measure forward and look forward to this being put into law. Thank you.'",
        "'speaker_0': 'Thank you so much. Next week, at least.'",
        "'speaker_4': 'And my name is Angus Warner, and I'm a resident at the same houses as the speakers before me. And I completely agree with everybody. Sad. And as you can tell from my accent, I'm not from here. I moved from Germany being married to a history professor at Cal State.'",
        "'speaker_4': 'Long Beach was there for 30 years now. And I love being in Long Beach moving here to Germany. But we got the 60 days notice. We got kicked out of our apartment. We had to find a new place even though we made a home, which was for me, Long Beach, the new.'",
        "'speaker_2': 'Home.'",
        "'speaker_6': 'Away from.'",
        "'speaker_2': 'Home.'",
        "'speaker_4': 'And it was a shock for us. And I said, How can that be as a German? As a German, I would said, there should be some law to protect it. You cannot kick it out within 60 days. I mean, we are two double incomes, no kids.'",
        "'speaker_4': 'So for us it's okay. We are sitting on boxes and are moving. The end of the week. We found a new place, a nice place. But what about all the other people? It's in the house, in the neighborhoods who don't have that, who don't have double incomes, no kids, and $2,000 for a one or two bedroom apartment'",
        "'speaker_4': '. Living in Long Beach is not affordable anymore. Thank you. Maybe I'll move back to Berlin.'",
        "'speaker_0': 'Okay. So thank you very much. Next is Mr. Norris. Before. Before Mr. Norris speaks. If I can have Daniel Sherwood, Dennis Baltimore. Baltimore. He said after Rosa, Joshua Christian and Alec Forrest, please come up. So it'll be Max Norris, Daniel Sherwood, Dennis Baltimore, he says, and also Joshua Christian and Alex for us.'",
        "'speaker_0': 'Please line up.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Thank you, counsel. I was happy to see Ms.. And Diaz championing this. I'm a District one resident, and it's encouraging considering what we've seen so far.'",
        "'speaker_2': 'As an attorney by trade, I know that loopholes are often exploited by the bad people in our society, and I do mean bad people. And in doing this, we need to close this loophole.'",
        "'speaker_7': 'We need a solid definition for what this work is and a burden of proof to be carried by the developer for that. Otherwise, we'll see continued abuse of this. This is a story that happened in San Francisco where I was displaced from years ago.'",
        "'speaker_7': 'The loopholes in what were thought to be strong laws in San Francisco, much stronger than we have here, have been exploited to the nth degree. And now we have a city in San Francisco where you have to make over $120,000 to afford anything.'",
        "'speaker_7': 'And it's untenable and it's coming to Long Beach. And you all have been very complacent about it, and I'm very disappointed. But thank you, Mr. Diaz, and I hope to see more from you like this.'",
        "'speaker_2': 'Thank you next week for please. Good evening. Council members Robert Garcia. I'm Dan Sherwood from the second district and. I've lived in this beautiful city for 36 years, and I've I've been part of the community ministry outreaches and this and that.'",
        "'speaker_2': 'And I've been in my home for 26 years. This one's been in her home for 28, and we have three back here, all who have been threatened to be evicted because of this new ordinance or loophole that is once again rearing its ugly head.'",
        "'speaker_2': 'It's only my opinion, but this is such an amazing city and this whole move is just a black smear mark across Long Beach. You know, we have an amazing city here. We're so diverse in so many different areas.'",
        "'speaker_2': 'And, you know, like the speaker said before me, we don't all make $140,000 a year. And many of us are very happy in our homes. We've we've made our homes where they are. And I look across the pool at the Obispo Building and this new loophole, and I've got six neighbors that I've known for 15 years, and'",
        "'speaker_2': 'they're all empty windows. We share a pool. I've got three from my building in Coronado who have already been evicted and moved out. This is unjust eviction, you know, we're good citizens. We're community. We hold each other up and we care about each other.'",
        "'speaker_2': 'And we want to continue to live in this beautiful city. Thank you. Thank you so much. Thank you.'",
        "'speaker_0': 'So much. Next speaker.'",
        "'speaker_2': 'Good evening, Mr. Mayor. Members of the council. My name is Joshua Christian. I am the Legal Aid Eviction defense attorney for the city of Long Beach. A notice stating scope, timeline and proof of permits will provide clarity and prevent unnecessary eviction lawsuits.'",
        "'speaker_2': 'The purpose of these notices is not just to tell tenants to move. It's to assure them that their landlord has respected their rights. The two words substantial remodel. Don't give them confidence that that is the case and they can't verify that it's the case.'",
        "'speaker_2': 'So they can only stand their ground by going to court. For a landlord acting legally, more information encourages tenants to move by showing them the law has been followed. More information helps tenants evaluate the situation and keeps everyone from playing a game of legal chicken.'",
        "'speaker_2': 'No one wants to go to court. For most landlords who are acting in good faith, all they'll need to do under this ordinance is give an explanation to their tenants of why those tenants need to go. For the few bad actors, this will stop fraudulent notices at their source.'",
        "'speaker_2': 'Ultimately, for those few tenants who do have to go to court, it will make sure that they have clear legal rights that need protecting. Thank you very much for me and for my clients for hearing this item tonight.'",
        "'speaker_0': 'Thank you very much. Next week, a piece.'",
        "'speaker_2': 'Clearly, too. My name is Dennis Baltimore, and I live in Long Beach, California. Over the past couple of years, I've been a victim of displacement rate increases. I'll just I'll just evictions and landlord intimidation has often left me out on the streets.'",
        "'speaker_2': 'I'm sick and tired of excuses. Being a formerly incarcerated black man is, for me, culturally a black man. I often find it hard for me to get a job. Many others have experienced similar situations as myself, and I ask you to please fix this loophole.'",
        "'speaker_2': 'This loophole is making us go in circles. We aren't making any progress with this loop loophole in place. Again, I ask you to fix this loophole so we can have a better system to where the we, the tenants are accounted for.'",
        "'speaker_2': 'Please. But I beg you. We are leaders. Thank you.'",
        "'speaker_0': 'Thank you, sir. Thanks for Chris's.'",
        "'speaker_2': 'Hello. Good afternoon. My name is says I am a resident of the First District and a member of Best Art Center of Long Beach. I came here back in December letting you know that my family was facing displacement due to rehab.'",
        "'speaker_2': 'However, through the help of housing language, we found out that the property owner never got the permit to make repairs. Please support us and. Passing this loophole faces strong. Help us in the strongest form possible. Thank you. Thank you.'",
        "'speaker_0': 'And before our next speaker, I'm going to call the next five people up forward and that'll be Alex Flores, Malcolm Bennett, Chris Keebler, Cynthia macias and Jonathan Gibson. So if I can have Alex Flores, Malcolm Bennett, Chris Keebler, Cynthia macias and Jonathan Gibson, please line up.'",
        "'speaker_0': 'That'd be great. Thank you.'",
        "'speaker_2': 'Yes. Good evening, Mayor and City Council. My name is Alex Flores. I'm a housing attorney with the Legal Aid Foundation here in Long Beach.'",
        "'speaker_0': 'I'm sorry, Alex, before you, this is Dennis Baltimore. Go speak. That was Dennis. Okay, then. Great. Mr. Barr. Sorry. Start over. Can we start? We start his time, please. Thank you.'",
        "'speaker_2': 'Thank you. What I wanted to point out tonight was that what's being presented today is a compromise and a modest ask, considering what different cities around the county are doing. What we are asking for is a fix that is locally appropriate for Long Beach and it's cheap for the city and the landlords.'",
        "'speaker_2': 'We're not asking to create a new department or a new process. We're not asking to create new fines for landlords or new punishments. This would be merely clarify what is a valid notice and what is not. Right now the problem that we are seeing is entire buildings being handed notices which say only two words, substantial remodel.'",
        "'speaker_2': 'At the same time, we're seeing that landlords, certain landlords are not planning a single permit, are showing no indication of actually doing any remodeling. The problem is that the longer we wait, the more people are going to be evicted.'",
        "'speaker_2': 'Attaching the permit will be the way to protect tenants and to make sure that both landlords and tenants understand that this is a valid notice. Anything short of that? Asking the landlords to start the process or asking them to file something beforehand is not enough.'",
        "'speaker_2': 'What tenants need to know the minute they get that notice is Is there a defense? What should I do? And anything short of explaining to them what the plan is and that the permits has already been pulled, that the work is going to be done, will not do.'",
        "'speaker_0': 'It. Thank you very much, sir. Let's take a piece. Actually Malcolm Bennet is next after Malcolm Bennet is Chris Keebler and Cynthia macias.'",
        "'speaker_2': 'Guardian American Council. Malcolm Managed Property Owner and property manager and licensed contractor. I'm asking for no vote on this at this time. I believe 1482 just came in. It's only been 40 days. I think we need to allow it to work.'",
        "'speaker_2': 'A lot of people understand the process in pulling a major rehab permit. It's not something you just just do. And I believe we need to see how this work. And I strongly believe that if a landlord does abuse this and does not permit, I think it would send a strong message out to prosecute a couple of landlords'",
        "'speaker_2': 'to do that and not put the burden on the amount of money to pay for a permit for a major renovation on property is quite substantial and quite a bit of money. And then you have to wait 60 days to the tenant, move out and then start work.'",
        "'speaker_2': 'That's causing a delay. And I personally believe it will dissuade a lot of developers from coming in and rehabbing some of these older houses. So I would ask for a no vote and let's look at 1480 to give it time to work and then come back in if there is abuse.'",
        "'speaker_2': 'There are certainly facilities and I think to prosecute, which we would strongly support as the housing market, those people that try to take advantage of a loophole and do this. So thank you very much for your time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hello. My name is Chris Keebler. I've lived in the city for 20 years. I've worked for Long Beach Unified School District for almost 20 years. I live in the second District. I'm currently in escrow in the ninth District, and I work at Cabrillo High School in the seventh District.'",
        "'speaker_2': 'I think this is a very important loophole to close. I don't think any developers are shy to come into Long Beach. I think it's also important if we do close this loophole, that it's retroactive to all of those who have received these eviction notices since January.'",
        "'speaker_2': 'You know, I'm fortunate enough to be able to go into escrow. You know, I have a good job with the Long Beach Unified School District, but I know that it's very hard, even in my circumstance, to own a home in this city.'",
        "'speaker_2': 'And I think it's even becoming harder for many people to rent in this city. And so I think it's important that we we close this loophole just so that this someone else said it earlier, that we have a city that's tenable for people to to have a take that aren't just, you know, the rich.'",
        "'speaker_2': 'That's all I have to say. Thank you.'",
        "'speaker_0': 'Thank you so much. Next week, this.'",
        "'speaker_4': 'Hello. My name is Cynthia macias. I want to thank you all for bringing this up and most importantly, for actually seeing the loophole that we all have seen. With that being said, I know like.'",
        "'speaker_6': 'Previously was that it just started it came.'",
        "'speaker_4': 'In 40 days ago. Unfortunately, I have more than 25 tenants that are getting evicted.'",
        "'speaker_6': 'So within those 40 days, more than half of those people will be gone. Right, without this. So with that being said.'",
        "'speaker_2': 'Close the loop. But we.'",
        "'speaker_6': 'Also want to make.'",
        "'speaker_4': 'Sure that.'",
        "'speaker_2': 'Just like this loophole.'",
        "'speaker_4': 'Was there, another loophole is not found. What do I mean by that? Well, landlords will not be able to put in for a permit and then kick the tenants out. And then once the tenants are out, pull that permit back out.'",
        "'speaker_6': 'So just want to make sure.'",
        "'speaker_4': 'That permits are in hand before they kick these tenants out. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please. This is Mr. Gibson. Yes. So before Mr. Gibson speaks, I'm going to call the next group of speakers and please line up in this order. Mike Murchison, Domingo Santiago. I can't re the last names is Fred.'",
        "'speaker_0': 'Oh. Oh, it's Fred. Big Fred. Big Annie. Kimberly Navas. Eduardo Lara. And Karen Harper. So after Jonathan Gibson, we're going to get Mike Murchison to meet us in Chicago for a beginning. Kimberly Navas. Eduardo Lara and Kieran Harper.'",
        "'speaker_2': 'Good evening. My name is Jonathan Gibson. I'm a District seven resident and an attorney at Legal Aid. We just heard someone say, give this law time, but we already know that the loophole exists and the law isn't working.'",
        "'speaker_2': 'This is the right time to close that loophole. Legal aid has been flooded with tenants receiving substantial remodel notices when they receive these notices and ask management for more information. They get stonewalled. This puts them in an impossible situation, and many have already discussed do I stay and fight the eviction filed against me and hope that the'",
        "'speaker_2': 'landlord doesn't pull the permit before trial? Or do I just leave possibly knowing that the landlord never had any intention of remodeling the place? This ordinance simply asks landlords to be upfront and put their cards on the table regarding the remodeling plans so tenants can make an informed decision.'",
        "'speaker_2': 'I also want to dispel a myth that there is. We need to know that there's no need to evict tenants before remodeling a unit or pulling permits. That a landlord can already go into a unit, inspect it and see if it needs remodeling.'",
        "'speaker_2': 'This ordinance would simply give tenants a peace of mind while imposing no additional burdens on landlords. Thank you. Thank you. Next speaker, please. Good evening, Mayor and council members. My name is Mike Murchison. I'm here on behalf of the California Apartment Association, the Small Property Owners Alliance and the Apartment Association.'",
        "'speaker_2': 'So all three of the major groups. Number one, I want to point out to you that unlike the tenant groups that knew about this item, none of these groups I just referenced knew about this. I have until Friday at 11:00.'",
        "'speaker_2': 'As we all know, supplemental goes in to noon. So I guess from a future action standpoint, it would be very helpful for the other side, the rental property owners, to know about these items in advance so that they have time to try to compromise and come up with a negotiation versus 72 hours, which makes it extremely difficult'",
        "'speaker_2': 'to communicate to the thousands of rental property owners that are out there. That said, here's a brief solution. Pull the permit, make it a generic permit, have the state, add the city, standardize it to say that it's substantial in nature.'",
        "'speaker_2': 'Have the landlord then have to post that at the tenant's unit, allowing the landlord to come back in and issue the city day notice after that, but not having to pay the permit fees which are substantial for some of these major renovations.'",
        "'speaker_2': 'So you're asking Mom and Pop to come in there and pay these guys.'",
        "'speaker_0': 'Everyone gets a chance to speak, please. So now my.'",
        "'speaker_2': 'Clock is running. One that's.'",
        "'speaker_0': 'Ahead.'",
        "'speaker_2': 'So it gives the landlords an opportunity to go in there without the tenant in there to judge what needs to be done, go back, submit it, and then pay for the substantial permit fees. We're not trying to hide anything.'",
        "'speaker_2': 'We're just trying to say, give us a moment to digest this and go forward.'",
        "'speaker_0': 'Hey, guys, guys, I seriously I manage the time he lost few a few seconds because of the interruption. So is letting him finish. Everyone gets a chance to speak. Finish up, Mr. Richardson.'",
        "'speaker_2': 'Thank you, Mayor. All I'm saying is, is that I'm trying to give you an option to have the rental property owner come in and pull a permit without the fees attached. Thank you. Thank you.'",
        "'speaker_0': 'Next speaker, please. Which will be Dominga. Santiago.'",
        "'speaker_4': 'On a memo La Mingus and even Apartamento Cuatro Cuando, though they say have a new apartment there. And then in all honesty, I know there is a review, so call me Familia Esperanza. Marisa is going to use your name, especially not as if you must know that because you know they are local.'",
        "'speaker_4': 'But the liberals in this society has seen information that they endorse while the trabajo is in the new Burmese source. Los Angeles. Not the official they see, but Robert. And it shouldn't so nice familiar case that someone. Salvador and this is that the system was closed by measles is then completamente forgotten.'",
        "'speaker_4': 'No sympathy sympathies, sympathy mender and besotted. But I sorry that nozzle notification the SA logo is. Hi. My name is Porfirio Dela Rosa. I live in for four days apartment E and I lived there for 11 years with my family and I hope to continue to live there so my children can continue to be raised there.'",
        "'speaker_4': 'Myself and my neighbors have received eviction notices because of substantial repairs without any previous information detailing the type of work that needs to be done or permits. All the renters at the Daisy Building are asking that you pass this.'",
        "'speaker_4': 'This article. So that the families and continued to live there. Thank you.'",
        "'speaker_0': 'Thank you very much. Right beginning is the next speaker.'",
        "'speaker_4': 'Good afternoon. My name is Kim. Really nervous. I am.'",
        "'speaker_0': 'Really. I'm sorry. It's for the beginning here. Yeah. Yeah, for president.'",
        "'speaker_2': 'Sorry. Right after him. No problem. Yes. Hi. Good evening. I'm a senior tenant in the first district. And thank you, Mary, for taking the lead on this. And I just want to say, we as advocates have worked really hard to pass the relocation or the relocation ordinance, the moratorium and the TPA.'",
        "'speaker_2': 'And it just doesn't make sense for it to be undermined by landlords who don't want to pay permit fees. So I urge you to go ahead and close this loophole. Thank you.'",
        "'speaker_0': 'Thank you very much. And now kindergarten.'",
        "'speaker_4': 'So I am from District eight. This is my second time speaking, the first being almost two years ago when my family and I were being evicted from our apartment we rented over 20 years ago, I mean, over 20 years for remodeling purposes, before the landlord even knew what was wrong with the units I am now.'",
        "'speaker_4': 'That was at the time asked Lina Gonzalez for help. But to see that my new councilman Austin is supporting this item really makes me proud to see it. So really proud to now be a resident of District eight.'",
        "'speaker_4': 'This item won't solve the problem in Long Beach, but it is a step in the right direction and I really hope it's passed to close that loophole. Thank you.'",
        "'speaker_0': 'Thank you very much, Mr. Latta.'",
        "'speaker_2': 'Good evening, Mayor. City Council. I want to thank Councilwoman Mary San that has Councilwoman Pierson, Councilman Austin for item 16. I'm here to lend my support. About a month ago, I met with residents from two properties on fourth and Coronado, Fourth and Obispo, and I can share with you the pain that they're going through in terms of'",
        "'speaker_2': ', you know, being evicted without necessarily the proper procedures being taking place. This is a step in the right direction. I think the city of Long Beach needs to lead forward to ensure that the Spirit of Tenant Protection Act must be maintained.'",
        "'speaker_2': 'At the end of the day, the spirit behind this initiative and others like this is affordable housing. We really need to ask ourselves, what city do we want to continue to be? A city that economically is for everyone, or a city in which only those that can afford can continue to live here?'",
        "'speaker_2': 'So I ask us to wrestle with these questions as we move forward, not only in item 16, but in future agenda items that can preserve the city that we all love, which is a diverse economically, racially and ethnically LGBTQ wise and people from all walks of life.'",
        "'speaker_2': 'And that's at the heart of this matter. So I thank you for moving this initiative forward.'",
        "'speaker_0': 'Thank you. Thank you to the widow. Karen, please. So last speaker.'",
        "'speaker_4': 'Yes, good evening. Good evening. My name is Karen Harper. I'm from the third district and I just wanted to stand up in support of agenda item 16 and to congratulate you all for moving quickly, because when people are losing their homes, it's an emergency and we need action right away.'",
        "'speaker_4': 'And I think this is.'",
        "'speaker_6': 'A good.'",
        "'speaker_4': 'Step in in this loophole. And I also have a poem for.'",
        "'speaker_6': 'Black History Month to give to each of you. So thank you.'",
        "'speaker_0': 'Thank you very much. We'll just give it to the clerk and roll with us. Thanks, Ms.. Harper. That concludes public comment. Let me just close public comment. We'll go back. Councilmember Pearson. No, you were the last one. Did you have any other additional comments on your second or.'",
        "'speaker_0': 'I know you turn it over to public comment or no, you're good. Okay. Next step is Councilwoman Price.'",
        "'speaker_5': 'Thank you, Mr. Mayor. So thank you, everyone, for coming out and for your comments tonight. And thank you to Councilmembers and de Haas, Councilwoman Pierce and Councilman Austin for bringing this item forward. I don't think there's anyone up here who wants to see increased evictions or people being displaced.'",
        "'speaker_5': 'I do think, though, that there may be an opportunity for a compromise here, having listened to everyone. So I'm going to propose that in just a moment as a friendly amendment with the hope that Councilman Councilwoman Zendejas, would be willing to consider it.'",
        "'speaker_5': 'I myself talked with Linda Tatum just to understand the process better for when a landlord might need to make or want to make changes, significant changes to their properties. And my understanding is that the first step is that a copy of the plans need to be submitted.'",
        "'speaker_5': 'The second step is that the person who is intending to make the renovations would then go through the plan check process, and with that would come the requirement that fees be paid for the plan check. Process. Once that process is complete, then it would take 4 to 8 weeks for permits to be issued.'",
        "'speaker_5': 'And then, of course, there would be fees associated with the building permits. My recommendation or my friendly as a compromise to try to meet the needs of everyone here and meet the spirit of what this legislation intends to effectuate, is that at step two, which is where the planned check and the fees associated with planned checks occurs'",
        "'speaker_5': ', that that would be required before an eviction notice would need to be given. So it wouldn't be for the full issuance of the building permits before a notification would have to be made, but rather at the planned check stage when planned check fees have been paid by the property owner.'",
        "'speaker_5': 'So that's my friendly I don't know, Councilwoman Zendejas, if you want to think about it or if you want to accept it or reject it. But that would be a recommendation that I would have. As a friendly.'",
        "'speaker_3': 'Thank you, Councilmember Price. I'd really like to hear from everyone first. Thank you.'",
        "'speaker_0': 'Thank you. Account summary income.'",
        "'speaker_2': 'Thank you. Actually, we would be here discussing this item about a loophole had there been proper notice, proper communication with tenants. Eviction without a reason really brought brought us to this point and brought us to the understanding that there is something wrong with 1482.'",
        "'speaker_2': 'In regards to evictions. So, I mean, I'm totally supportive. When I heard this the last week or whatever was brought forward to us before that, there were eviction notices being given based on 1482, 1482. What you need to do is Columbus sorry added ten years.'",
        "'speaker_2': 'The it immediately came to my mind that we needed to we need to fix this. And I want to thank council members in the House for bringing this forward, because it is a way of addressing this. And and it is a way of being able to help tenants and landlords talk to each other, speak to each other'",
        "'speaker_2': 'to find out what's going on in each of those apartment buildings so that the renovations can be done in a timely manner, so that tenants can find other housing in a timely manner or temporary order or whatever needs to be done.'",
        "'speaker_2': 'But one of the biggest things for me is that when we have. Make evictions just like that. It puts the burden more on us, on the city to address housing, affordable housing and yes locations. And it increases our how our are homeless count and it just creates a bigger problem.'",
        "'speaker_2': 'So I mean let's let's be real. We want we want to address our homeless issues. We want to address affordable housing, affordable accommodations. And the only way we could get there is by working together, knowing that if we want to improve our buildings, we want to improve the experiences of our tenants, to keep them there, keep them'",
        "'speaker_2': 'housed. Let's talk to each other. And I think that this motion here on the floor does exactly that. Thank you.'",
        "'speaker_0': 'Thank you. Next up is Councilman Mongo.'",
        "'speaker_8': 'Yes, I think I have an additional question for development services. I appreciate the the work from council and they have evictions are and bad actors are never anywhere we want to protect. I do think we want to make sure though that we know and understand the full scope so we don't get ourselves into another position.'",
        "'speaker_8': 'Ms.. Tatum Are there any other substantial remodels that could be performed that would not require a permit? I don't know what you could limit. Like what if you're scraping asbestos ceilings? Does that require a permit?'",
        "'speaker_5': 'No, pretty much. Any time you touch the building or any other systems in the building, it will always require a building permit. And that's for compliance with the uniform bill, the California Building Code.'",
        "'speaker_8': 'So. If you're not touching the system, but like scraping ceiling. Asbestos like popcorn ceilings that even requires a permit. Or are you saying there's not.'",
        "'speaker_5': 'Substantial there is nuance to this because, for example, if the ceilings are old, it depends upon when the ceilings were installed. And if it's pre, say, 1960, there is a very good likelihood that there is a substance. And that would require not only building permit but other safety precautions to test it and make sure that the the'",
        "'speaker_5': 'scraping the ceilings is done properly.'",
        "'speaker_8': 'And what if you weren't doing a roof replacement, but perhaps a roof repair? Would that also require a permit?'",
        "'speaker_5': 'Yes. There's very, very little that can be done without issuance of a building permit.'",
        "'speaker_8': 'Okay. That provides the clarity that I needed. Thank you very much. Luckily, I haven't had to do a lot of those things, so I'm not really aware of that component. Thank you, Councilman Price, for that line of questioning as well.'",
        "'speaker_8': 'That helps us understand the nuance between the first deposit that a landlord makes and the secondary process. I think that it's also important to recognize that with the exception of bad actors, of course, good landlords don't want to get rid of tenants for longer than is necessary because that's income they're losing as well.'",
        "'speaker_8': 'And so with the exception of the bad actors, minimizing and limiting that liability is always something that we as a council also want to do to make sure that that future cost is not then burdened on the next tenant.'",
        "'speaker_8': 'So thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Andres.'",
        "'speaker_9': 'Yes, thank you, Mayor. First of all, I'd like to thank our council people who brought this item forward. And I see this is a very complex issue. And I can see from both lenses that it is very frustrating.'",
        "'speaker_9': 'And we must do our part to address this housing shortage and constant displacement of tenants. We need to find a middle ground that keeps people in their homes and allow landlords to remodel if they need to. And I do think that the city and we can do better in expediting permits and processes.'",
        "'speaker_9': 'I don't think I need to talk any longer. As long as we talk to more people being displaced. If this item doesn't go through. So I truly definitely would support the idea.'",
        "'speaker_0': 'Thank you. Next up is Councilman Supernanny.'",
        "'speaker_9': 'Thank you. And a question for staff. And we've heard some testimony here that there have been evictions. Do we have any hard data on that that anyone knows of? Are there numbers we can put on this? Since January one.'",
        "'speaker_5': 'Councilman. So we're not we do not have data since January one. We had data from before. If you recall, one of the provisions in the tenant assistance ordinance that the city initially passed last year, it required landlords that needed to evict tenants for purposes of a substantial rehabilitation that that be reported to the city based upon that'",
        "'speaker_5': 'data. Last year we had approximately and this is very approximately 40 evictions that occurred. However, once that ordinance was rescinded, there was no longer a requirement that evictions for purposes of substantial rehab be reported to the city. So the responses we've heard that anecdotally, but none of those have been reported to the city.'",
        "'speaker_9': 'Okay. So any evictions directly attributable to the loophole, you don't have data on that at this point?'",
        "'speaker_5': 'That is correct.'",
        "'speaker_9': 'Okay. You know, first of all, I'd like to thank the makers of the motion for bringing this forward. But we do have a challenge up here, and that is timing. If you can imagine how long it took to put this together at the assembly level, probably thousands of hours to craft this measure, 1482.'",
        "'speaker_9': 'And at the end of all that time, they ended up with a loophole. What we're being asked to do tonight is to fast track an ordinance with minimal time and make sure we've done all our due diligence. And there are no unintended consequences of what we do here tonight.'",
        "'speaker_9': 'That's a major, major challenge. And we would like to have. I personally would like to have more data on exactly what is going on here. So I would like to you.'",
        "'speaker_0': 'Know, everyone, guys, just please, you know.'",
        "'speaker_9': 'Mystified me why the audience would want to interrupt someone whose vote you want, but I don't want to, you know, challenge your constitutional right, I guess I guess you have that to shout out during a meeting. But for right now, I'm going to support the friendly amendment.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you. Next up is Councilmember Pearce.'",
        "'speaker_4': 'Thank you. So I'm going to ask staff a couple of clarifying questions. Councilmember Price mentioned to step two staff, can you walk through what the process is and how long that whole process is for everybody in the audience?'",
        "'speaker_5': 'Sure happy to do that. And this is I would just note that this is pretty broad brushed because every project is different. The extent of the work that's being proposed, it varies in terms of how long it takes to get through the planned check.'",
        "'speaker_5': 'So what I would the steps of the process are essentially for a landlord or a property owner to come in with plans that outline the nature of the work that they want to do. Staff would review those plans and accept them into plan check.'",
        "'speaker_5': 'There is an administrative fee for a few. It could vary any way from anywhere from a few hundred dollars to $1,000 for the planned check process to be completed in that process. And I'm going to say roughly because again, it varies depending upon that the extent of the work being done, it could be anywhere from four, six'",
        "'speaker_5': 'or even eight weeks. However, the city does offer what we call expedited plan check. And if a property owner wants to pay a a small surcharge, they can expedite the turnaround time of the planned check, and that would reduce it by about 20 to 30% of the time frame.'",
        "'speaker_5': 'So once you're in plan check and that's completed, you receive a notice from the the city staff that the plan check is complete and you're then able to come in and pay the building permit fees and be completed with that process.'",
        "'speaker_5': 'Once the the building plan, the permit has been issued, a property owner has up to two years to actually complete the process to final that process. And that approval comes in, I'm going to say nine month increments because once the permit is issued, you have nine months to initiate the work for good, cause that nine months can'",
        "'speaker_5': 'be extended an additional nine months up to a two year period.'",
        "'speaker_4': 'And the comment that was made about allowing landlords in the building, right now landlords are allowed to go into buildings. And I mean, my landlord visits my apartment like every three months. He's like my friend. They're allowed to go in right now and take a look and make sure that nothing needs to have maintenance done correct.'",
        "'speaker_5': 'That is not necessarily a provision of the building code, but generally a provision under the lease and terms and.'",
        "'speaker_4': 'With notification three days. And then let me ask. So in that two year period, if they get into the building and they then decide that they need to change their plan, check, they can go back to the city and do that.'",
        "'speaker_5': 'Yes, as a matter of fact, when it comes in, when we assess the plan, check fees as well as the building permit fees, it's based upon the contractors or the plan designers, their estimation of what the valuation is.'",
        "'speaker_5': 'So we base those fees on the contractors or the plan preparers estimate of the valuation. But during the plan, review the construction and the inspection process. If those numbers need to be adjusted for additional work that is taken into account and the fees are adjusted accordingly.'",
        "'speaker_4': 'Okay. Thank you for that. And. I guess I would just also say in the in the conversation, colleagues, that we've had about negotiation and finding a middle. The city decided to try to find some funds and have staff really work to identify funds for people that have been relocated because of substantial rehab.'",
        "'speaker_4': 'Instead of having that be on the landlords and instead of having a conversation around the city going above and beyond what the state did. So in my mind and the grand conversation, it seems like we've we've had a lot of that negotiation and asking for a permit that might, you know, take six weeks, six weeks to a'",
        "'speaker_4': 'family can be a you know, a godsend. How often do we not looking for a place? How often do we see people start a planned check process and then not go through with it?'",
        "'speaker_5': 'I don't have percentages, but I'd say that it's not uncommon to start a plan check and never completed or we complete the work and they never get. They never respond to the staff comments and it's never finalized. So it's not uncommon, but it's hard to put a number on that.'",
        "'speaker_4': 'And I think that that's one of the questions that just listening to Councilmember Rice, when I heard her motion, I thought, that's not too terrible. But knowing that people can pull good, can start at the plan check process, but then not complete it, that still leaves a gap.'",
        "'speaker_4': 'So I thoughtfully want you to just think about the fact that if staff is saying that some people start that process, but don't finish it, we don't want to have people be put out of their homes if in fact that substantial rehab does not happen and then have tenants outside of that building trying to prove what's happened'",
        "'speaker_4': 'inside a building now they no longer have access to feels like putting tenants and landlords in a very awkward situation. So those are my comments right now. I see. I'm out of time.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_7': 'Thank you. Just a few questions. And I see the you know, there's one motion on the floor. I just have some questions on that motion. So it.'",
        "'speaker_2': 'So this is a.'",
        "'speaker_7': 'Question for the city attorney. The recommendation actually doesn't say very much. So what do you understand the recommendation to mean and how would you approach this item?'",
        "'speaker_2': 'Thank you for that question. You're stealing my thunder a little bit because I was going to ask for this clarification before you all took a vote. So it's clear everyone knows what you're voting on. I was going to approach it such that, well, first and foremost, what everyone should understand is that in order to make any changes'",
        "'speaker_2': 'to 1482, local municipalities need to adopt the entirety of section, not the entirety of 1482. But you do need to adopt in the entirety of the just cause provisions and the relocation provisions. So if this passes, the ordinance that is going to come back is going to be a long one because I'm going to cut and paste'",
        "'speaker_2': 'the exact provisions of 1482 and then I'm going to add what NB 16 here has asked me to add in. I won't just use the recommendation, but I'll take from the entirety of the narrative. And I think it's pretty clear with two exceptions, which I think I need to put Councilwoman Zendejas and Councilman Pearce on the spot'",
        "'speaker_2': 'a bit for some clarification. Namely, that motion that was originally read was some time ago now. And I want to make clear that in addition to what NBI 16 is requesting, that the motion also would like the ordinance to require that building permits not only be issued in advance of the termination notice, but that they be attached'",
        "'speaker_2': 'or otherwise referenced to the termination notice. Is that right? Correct. Okay. And I thought that that's what I heard, what I haven't heard from anybody and which is important is that you're asking me and I and I can do this to temporarily prohibit all no fault notices for substantial remodel until February 18th, which of course assumes that'",
        "'speaker_2': 'an ordinance comes back on that date, which I think I can do and that it passes and that makes sense. But prohibit from when I don't think unless I missed it. We don't say when the prohibition starts. And I think it could be February 7th, which is the date on which this notice went public.'",
        "'speaker_2': 'That's normally the way things work in the rent control arena, or I suppose it could be earlier than that. I don't know what you all were thinking, and I want to make sure that everyone behind the dais knows what they're voting on.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'I would prefer from February.'",
        "'speaker_2': 'From February. Yeah. So we'll do it any, any notice after February 6th issued on February 7th until the effective date of the new ordinance would be null and void. Landlords would have to re comply with the termination notice.'",
        "'speaker_2': 'That would only be a 11 day period. I think 11 or 12 days. Okay. Thank you. Thank you. I don't know if that answered your question entirely.'",
        "'speaker_7': 'So. So you would approach this. You would grab that section of the state law, make that the local ordinance, and you would grab these two provisions that are in the discussion and include it.'",
        "'speaker_2': 'That's right. And my intention would be to bring back a red line, to make it simple for the public and the council members to see exactly what changes were made to the first half of 1482, which is Civil Code 1940 6.2.'",
        "'speaker_7': 'So those those two areas are one. Obtain all necessary permits from all applicable government agencies before serving a notice, and then to include information in the notice to vacate about the type and scope of the work. Okay. I understand that.'",
        "'speaker_7': 'So next question. So is there a definition either in state law or within this law on what substantial rehabilitation means?'",
        "'speaker_2': 'There is it's already in 1482, and we're not going to change that definition. At least this is not requesting us to do that. And that is there's a couple of different requirements. Any work so substantial remodeling has to be work that requires a local public agency to issue a permit.'",
        "'speaker_2': 'Or it can be work where no permit is required but has to do with hazardous materials abatement. Like the asbestos example. In. I don't I don't have that much experience, but I think that would be rare where there would be abatement work that wouldn't require a permit, but the law allows for that.'",
        "'speaker_2': 'So it has to be one of those two things. Any work that requires a permit or hazardous materials abatement work, and if it's one of those two things, it also has to reasonably require the tenant to vacate and it's going to take 30 or more days.'",
        "'speaker_7': 'So it has to be something on the inside of the unit. So if you have to pull a permit I mean, do you need a permit for your irrigation?'",
        "'speaker_2': 'Well, you might, but presumably that would not require a tenant to vacate.'",
        "'speaker_7': 'Okay. Installing carpet.'",
        "'speaker_2': 'I don't think you need a permit for curfew.'",
        "'speaker_7': 'So where's the threshold? Just curious. What's the threshold?'",
        "'speaker_2': 'I'm not entirely certain. I think that's best for.'",
        "'speaker_5': 'The threshold as it's defined in the ordinances that work that requires a permit. And so that typically is work on the interior of the unit. And typically it's major work such as repairing the air, the effects systems or any of the other structure of the plumbing systems.'",
        "'speaker_5': 'So those all require permits.'",
        "'speaker_7': 'So replacing the age back would be a justified reason to issue a six day notice.'",
        "'speaker_5': 'Per the way it's defined in the in the code. And but again, I think some reasonableness is required on the on the part of the the property owner.'",
        "'speaker_7': 'Okay. So I guess the reasonableness that gets spelled out or litigated in court, whether it was reasonable for did you really need this person to vacate to fix the AC or not?'",
        "'speaker_2': 'That's exactly right. So so substantial remodeling, even if it requires a permit, it's not going to qualify as a reason to evict someone unless that permitted work cannot reasonably be accomplished in a safe manner with the tenant living there.'",
        "'speaker_2': 'I mean, that's up to some interpretation, but that's the way the law. Okay.'",
        "'speaker_7': 'So next question. So the conversation on site plan review, is that required on every substantial remodel project?'",
        "'speaker_5': 'Again when the project plans are brought in to the counter, staff would look at the plans and make a determination as to whether or not they needed to go through that. What I described as the planned check process, because if it's a fairly simple and straightforward improvement, it may not need a planned check.'",
        "'speaker_5': 'It could potentially be issued over the counter. It really depends upon the extent of the work, the scope of the work being done.'",
        "'speaker_7': 'Okay. So if it's a substantial remodel and it doesn't require much site planning, much planned check, you come in, it's a pretty straightforward process. Then they would just move straight to a permit.'",
        "'speaker_5': 'That's correct. There are cases, limited cases, where a permit could be issued over-the-counter if it's not a major rehab, just they change out of the HVAC system, for example.'",
        "'speaker_7': 'So if it's not immediately issued, how long does it typically take? Once you pay for a permit to receive a permit.'",
        "'speaker_5': 'Again, what you're paying for initially is the planned check process, and that's the administrative fee for staff to review the plans to determine code compliance. And then after that process complete, that's when you pay for the actual building permit.'",
        "'speaker_5': 'And the building permit is what authorizes you to essentially begin the work.'",
        "'speaker_7': 'So that's that second step of paying for the permits and receiving your permits on a four plex counts.'",
        "'speaker_0': 'And we have to move on to the time and time's up. So. Okay, great. I know we're going back around to a few other folks, so I'm going to just have a couple just really briefly, just this is the staff because this is the way I've understood it.'",
        "'speaker_0': 'And if I'm incorrect, please correct me. I mean, state law currently says new state law that's in place currently says that before you can do a substantial renovation, you have to pull a building permit. Correct?'",
        "'speaker_5': 'I don't know that that's necessarily in the state law because that's currently a building code requirement. That's kind of a standard.'",
        "'speaker_0': 'I believe that.'",
        "'speaker_5': 'You mean in 1482 or just in general? I wasn't clear on your question, but in general, yes, you do. You are required to pull a building permit prior to doing substantial work motivation.'",
        "'speaker_0': 'That that is correct. Right. Mr. Austin, I just spoke about this as well.'",
        "'speaker_5': 'And again, I'm just going to say generally, because there are always nuances and circumstances where it.'",
        "'speaker_0': 'Wasn't that also remind me correctly and I'm not an expert in the law, but I thought that was also referenced in the new bill that also just passed was 92.'",
        "'speaker_2': '1482. Yeah. No, 1482 actually says substantial remodel is any work that requires a permit or hazardous abatement work that doesn't require a permit. So it would suggest as though there is something it's possible that there is something that qualifies as substantial rehabilitation under 1482 that doesn't require a permit.'",
        "'speaker_2': 'I don't know that that's true, but the law reads as such that if someone thought about it, there may be such a thing as substantial rehab that does not require a permit.'",
        "'speaker_0': 'Okay. I mean, that's not the way that I have heard it interpreted in other discussions. But I think that's what's I think the question. Right. And I think that's what I think is this agenda item is trying to lead to.'",
        "'speaker_0': 'And so the way I'm understanding what council in discussions is proposing is that before this type of work would happen and there would and there would be eviction notices that the the contractor or the property owner doing the work would pull.'",
        "'speaker_0': 'The permit, is that correct?'",
        "'speaker_5': 'That's that's correct.'",
        "'speaker_0': 'It was to me that what what is being proposed aligns and essentially codifies what is already. The law.'",
        "'speaker_5': 'Well, it codifies the law in the sense that it's defining what requires the building permit issuance. But the difference is that right now, the the law doesn't require the noticing of the tenant and it doesn't very specifically define the nature of the work.'",
        "'speaker_5': 'That is a basis for the tenant to be evicted. And that's what this clarifying language proposes to do.'",
        "'speaker_0': 'Mr.. Mr.. ANTHONY, do you do you feel like I am also getting a sense that you're trying to ensure that what's in front of us, in what's adopted, you're able to to turn into an ordinance. Do you feel that you have enough information about what that about what you need from a definition perspective?'",
        "'speaker_0': 'I do. Okay. You do. Okay, great. The only other thing I'll add is I support customers and the House's proposal. I will also just add that I think the part that I think is difficult, that I've heard from a lot of folks is it becomes very hard for for folks that are low income, maybe undocumented, may not'",
        "'speaker_0': 'have a lot of resources to, after the fact, get civil, go through a civil process where they may not be able to have the resources to go through an additional process. And so I think if if if we're able to assist those.'",
        "'speaker_2': 'Folks.'",
        "'speaker_0': 'At the start and to ensure that that property owners are pulling the proper permits to do the work, I don't think I don't find this to be a very an overly burdensome proposal. I think to me it's very common sense that to me it aligns with with the spirit of what the state was trying to do and'",
        "'speaker_0': 'whether, you know, folks agreed or not. Agreed. I don't think I think that's the law that's in front of us in the spirit of that law, I believe, aligns with what this proposal is. And so I just want to thank Councilmember and House for bringing this forward.'",
        "'speaker_0': 'And I think it's a commonsense proposal. I'll turn this over to Councilman Sunday House.'",
        "'speaker_3': 'Thank you, Mayor, and thank you for your support. Question for the staff. Just for clarification, a unit does not have to be vacant before issuing the permit to the owners. Is that correct?'",
        "'speaker_5': 'There is no provision in the building code or any local code that requires that a unit be vacant before a permit is issued that is completely at the discretion of the property owner.'",
        "'speaker_3': 'Okay. Thank you very much for clarifying that just for me. Another thing, I'm going back to Councilmember Supervisor's question about data. I don't have specific data, but I have a long list of people who have already been evicted from their homes right now.'",
        "'speaker_3': 'And I I'd be more than happy to share with you. But in in the interests of time, just know that yes, we have one, two, three, four, five, six, seven, eight, nine. Just in in my district, district one, we have one, two, three, four, five, six in district two.'",
        "'speaker_3': 'We also have one in District four and three in District six. So and that's only in the short 30 days that we have. I think that, you know, this what we're asking for right now is really a big compromise.'",
        "'speaker_3': 'What really breaks my heart is to see how many children are among these numbers then. And again, I'm not looking for an applause. Thank you, but no thank you at this moment. I just want to say that, you know, that's why I'm really concerned about uprooting the children from their homes and also to go back to seeing'",
        "'speaker_3': 'that sometimes I'm a renter myself and I don't have the first or second month's rent and a net positive to be able to move in 60 days from where I am. So I'm I if I'm not able to do that, I can understand how it would be a burden for these folks as well.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you, counselor. Entrepreneur.'",
        "'speaker_9': 'Thank you. You know, all in all our thank you's, I don't think we mention city staff. Thank you for all your work from development services on this, and especially Rich Anthony. That must have been a very fun weekend for you.'",
        "'speaker_9': 'So it was an incredible amount of work. And what we're learning here tonight is that and I didn't realize, not just a few minutes ago, is that we'll have a whole new audience here in line. We said we currently do not have.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_9': 'And that will basically basically replicate 1482, which we had at one time or a version of that, and then we reject it. So that's back on.'",
        "'speaker_2': 'And we're doing that specifically because that is a that is a specific requirement of 1482.'",
        "'speaker_9': 'Understood. Okay. Well, thank you for all your work.'",
        "'speaker_2': 'You're welcome. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember consumer appears.'",
        "'speaker_4': 'I hope that my colleagues don't kill me. But I want to clarify. You had asked the question and Councilmember Zendejas had answered on the day that it's effective and she had clarified February 7th. Is there something preventing us from making it January one?'",
        "'speaker_2': 'No, but I would I would then limit the language to say it can go back to January one to prohibit all pending pending notices of termination. If any notices of termination have actually been acted upon, a tenant has accepted reload and left.'",
        "'speaker_2': 'We don't want to undo those.'",
        "'speaker_4': 'Well, remember, tenants don't get reload for substantial rehab.'",
        "'speaker_2': 'Under 1482. They do.'",
        "'speaker_4': 'Okay. Thank you. I didn't want to get confused again, so I. You would just have to change the language.'",
        "'speaker_2': 'That's right. Is that. But I think I need to hear from them.'",
        "'speaker_4': 'I understand the move. I would like to make a substitute motion for January one just because for all those that have not been acted upon.'",
        "'speaker_0': 'We can make a friendly.'",
        "'speaker_4': 'Also friendly. I'm sorry. A friendly motion.'",
        "'speaker_2': 'Me? Okay. Got it.'",
        "'speaker_0': 'A friendly amendment. Councilwoman Zendejas, would you accept that? Yes. Okay. So now we have Councilman Mango.'",
        "'speaker_8': 'I just want to thank Councilman Zendejas. I know that these items can be contentious. And also a thank you to Councilman Pearce, because I think that one of the things that we as a diocese are trying to do is be collegial and demonstrate the respect for different people's opinions and that.'",
        "'speaker_8': 'Both praise and scowls towards any council member would not be appreciated. And I really appreciate the class that you brought tonight in bringing forward such an important item. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_7': 'Thanks. You know, last thing, you know, I was getting some clarity. It was just really unclear in the motion. But I think where it's going, I think this makes sense. If I think it's if if the attempt is to close a loophole, I think you want to be as simple as possible in closing a loophole so it'",
        "'speaker_7': 'doesn't create a loophole. So Councilwoman Sandy has know all the signers. Good work. Councilwoman, your first item and I'm happy to support it.'",
        "'speaker_0': 'Thank you. Thank you. And that I was I was actually going to close with the just congratulations on your first piece of legislation, councilwoman and Mayor.'",
        "'speaker_2': 'Just just to clarify.'",
        "'speaker_0': 'Because I just I got it. Got it. And so, Councilman, today has I know that there was earlier there was a a friendly that was offered up. And I know you have accepted Councilman Pearce's friendly. I'm not sure where the rest of your motion is.'",
        "'speaker_0': 'Councilman.'",
        "'speaker_3': 'I think I would like to move forward, as is with the Pierce's family. Thank you.'",
        "'speaker_0': 'Okay. So the motion is the original motion with the addition of Councilmember Pierce's date change members. Please go ahead and Caspir votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Ordinance to Ban Single-Use Food and Beverage Containers and Straws Made of Non-Recyclable or Non-Compostable Material.": [
        "'speaker_0': 'Thank you. Okay. Thank you. I know we have a we have a full agenda. So if folks are exiting, please, now would be a good time so we can continue on the agenda. So we're going to go to one more item, then we're going to go to public comment, if I can get item 15 really, really quickly'",
        "'speaker_1': '. Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code relating to prohibiting the use of and sale of single use food and beverage containers, packaging and food service where made of expanded polystyrene foam. Read the first time and lead over the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'If I can have folks exit and speak, not talk to exit, please, that would be appreciated. There is a motion and a second. I don't have any public comment in front of me. Is there ever. Is Craig Cadwallader.'",
        "'speaker_0': 'Walter here? Oh, please, Craig, come forward. Right. Craig, what's your last time? How are you?'",
        "'speaker_2': 'Craig had Craig Cadwallader. I'm speaking on behalf of the Surfrider Foundation South Bay chapter. And thank you, Mayor Garcia and Garcia and Councilmembers. I just wanted to say I'm very happy for the improvements made to this ordinance.'",
        "'speaker_0': 'Hold on a second, sir. Everyone in the. Everyone that's here, please. We have someone speaking. If I could ask all of you, please, to exit the chambers and stop speaking out of respect to the person at the podium.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you. These improvements are very important. It's items that we had hoped to get in the original ordinance, and I'm glad they finally have bubbled up. This is something we're working on not only locally, but for the unincorporated areas of L.A. County.'",
        "'speaker_2': 'And just today, the on the federal level, the Break Free from Plastic Pollution Act of 2020 was announced by Senator Tom Udall and Congress member Alan Lowenthal, who is one of my heroes locally here. And it is in the same spirit as SB 54, AB 1080 that we're doing it for the state of California.'",
        "'speaker_2': 'So this is very important that the City of Long Beach set this example to help us move forward, to clean the environment and to make a better standard of living and to protect our wildlife. The ADA addition was very important.'",
        "'speaker_2': 'We're glad that was included. And I did want to point out two items. They made a comment earlier on this, but there are two issues I'd like to address in the definition for directors that refers to two chapters, chapter 1.25 and 1.26 to the Long Beach Municipal Code.'",
        "'speaker_2': 'That, from my reading, 1.25 is on nominating petitions and 1.26 addresses mass mailings. I believe the correct reference should be to Chapter 9.65, which is administrative citations and penalties. So I think that ought to be fixed. It's been dragging for some time.'",
        "'speaker_2': 'Then my only other comment would be the definition in paragraph Q, which refers to recycled code. The proper definition of that is a resident code. So it's a little thing, but it's important. There's no such thing as a recycled code, but it is resident code to identify the type of plastic resin for recycling purposes.'",
        "'speaker_2': 'So I think this is really important and I really applaud the Council for moving forward on improving this ordinance. We have 136 in the state now and this is extremely important. It is not harmful for businesses and it's good all the way across the board.'",
        "'speaker_2': 'So thank you and I hope you'll go forward with this in Adopted at the next reading.'",
        "'speaker_0': 'Thank you very much. Councilman Mango. I'm sorry. Actually, I'm sorry. Councilman Price of everything addition? Nope. Our councilmember hearing anything in addition of Councilman Mongo.'",
        "'speaker_8': 'I just wanted to know if those changes were insignificant in nature or significant.'",
        "'speaker_2': 'We can make those and continue with the first reading and bring back for a second reading next week.'",
        "'speaker_8': 'Is that okay, Councilman Price? Thank you.'",
        "'speaker_0': 'Excellent. There'll be adopted members. Please go and cast your votes. I just want to also add on this topic. I think it's the way that public opinion is turned on this topic I think is so great to see.'",
        "'speaker_0': 'I sent out a message a few weeks ago, a week ago on this on this. And I was I always used to brace myself for the responses. And we probably got 100 responses of mostly just glowing reviews about this.'",
        "'speaker_0': 'So very, very good work. I think the motion carries some excellent motion carries. And with that, we move on to the of the speaker's list for the evening and I have Mr. Boland, Robin King, Marcell Alonzo Snake, Ken Fay and Darlene Broom, if you can, please.'"
    ],
    "Elevate LB Business Academy Pilot Program and Funding Transfer.": [
        "'speaker_1': 'Motion carries. Item nine Communication from Councilmember Pearce Recommendation to request the Economic Development Department and Long Beach Small Business Development Center to implement Elevate LBE Business Academy and increase appropriations in the General Fund Group and the Economic Development Department by $10,000 for the Elevate LBE Business Academy.'",
        "'speaker_0': 'Give us a motion the second there's there's one member of the public wants to speak also Councilmember Pierce.'",
        "'speaker_4': 'Okay. Yeah. I'd like to talk a little bit about this. I know John is cued up. We're really excited. It's $10,000, so I do. That's a lot of money coming from my divide by nine. So I do want to take a moment because I think that all of the council members will probably want to do this in'",
        "'speaker_4': 'their district. So Elevate LBE Business Academy is a pilot program in the second District that will give retail establishments the opportunity to stay competitive and profitable. While understanding different challenge of the media distribution. It also allows for some insight for brick and mortar as long as as well as online sales, along with funding expansion among many other'",
        "'speaker_4': 'areas. So really, we know that in the second district we have Fourth Street and we have Broadway. And often we talk about supporting our small businesses. We've had a number of unfortunately, of small businesses leave for Street in the last several years, mainly because of issues like their rent increases or access to capital.'",
        "'speaker_4': 'And so our staff is working on access to capital issues. We're working on some other issues around speculation. But one of the biggest things is making sure that our small businesses that really are people that really work seven days a week in their shops have all the tools and resources that they need to be able to succeed'",
        "'speaker_4': 'and expand their business. So I'd like to turn it over to staff to talk a little bit about it, and then I'd love to hear from the public. Thank you.'",
        "'speaker_10': 'Honorable mayor and members of the city council. Thank you so much. A few months back, you recall that we received a report from Cal State Long Beach about some of the perceptions and confidence from their Small Business Monitor survey.'",
        "'speaker_10': 'And one of the challenges that the small businesses said that they faced in the coming year was challenges related to finding customers and retaining customers, particularly in this new environment with online, retail and other competing factors. And so in conversations with Cal State, Long Beach, as well as our Small Business Development Center at Long Beach City College'",
        "'speaker_10': ', we were able to find some really good resources and package them as part of this Elevate Long Beach Business Academy. So this will be a pilot, of course. All of the funds associated with the city council district whose contribution here will actually go into the businesses.'",
        "'speaker_10': 'They will receive many grants to help them with business licenses if they graduate. They will also have the option of making a video that will be used for marketing and promotion promotion for their business if they graduate and there will be a for a class to about 2 hours each class a four class series taught by a'",
        "'speaker_10': 'consultant who has experience working with businesses throughout L.A. and Orange County. And so we want to thank you. This is a good example of, again, the council hearing about some of the survey data that small businesses report and then finding a way to pilot some solutions.'",
        "'speaker_10': 'And so we'll hopefully be able to come back to you in just a matter of about 60 days with our goal of 20 graduates, get some feedback from their their results and then hopefully see their taxable sales increase in the coming year.'",
        "'speaker_9': 'You said it, Mrs. Councilwoman Price, you want to speak on this item? Thank you, Councilwoman Mongo.'",
        "'speaker_8': 'Thank you. The Small Business Development Center is an amazing resource if you don't know about it. They're headquartered in the fifth District and these classes are typically much longer. And so I think that this is a good transformation, not just for.'",
        "'speaker_8': 'The business community, but also for the sbdc to hear the feedback from the community that six weeks, 12 weeks, it's just too long. And the amount of time they want to kind of accelerate through the program. I think it's also really important to note that we have a lot of advisors at the SPDC.'",
        "'speaker_8': 'The advisor who's going to be teaching this class is like a nationally acclaimed. Renowned retail expert. So if you are in anything that sells to a customer base, this is an amazing opportunity to have this up close. And expertize, expertize like this can cost upwards of 250 to $400 an hour of advice and guidance.'",
        "'speaker_8': 'And it's being provided for a very, very nominal fee, if not completely free. And then once you're plugged into this network, there's also several other additional complementary services that come to you via the advisors. So just a great program that's been alive and well in the fifth District for.'",
        "'speaker_8': 'A couple of decades. And really through this feedback has taken on a transformation. So I look forward to the feedback from this new group of individuals to see how much better a four week program is than the traditional system that the entire country really operates under so long, which is again on the cutting edge on the front'",
        "'speaker_8': 'of changing the way we think about training our businesses.'",
        "'speaker_0': 'Councilman's in the house.'",
        "'speaker_3': 'I just want to say congratulations on this item. Council Member Pearce This is something really that excites me having a lot of small businesses in the First District along Pine and Long Beach Boulevard, Fourth Street, all the small businesses, the town that we have.'",
        "'speaker_3': 'This really excites me. So I'm rooting for this program. Thank you.'",
        "'speaker_0': 'So I can't find any comments.'",
        "'speaker_7': 'It's good to know what I need. Some ammo. Unfortunately, I have a business. Unfortunate bonito, so this obviously appeals to me. I would just like to know from the city as there is already a small business center in the fifth district.'",
        "'speaker_7': 'Has the council images acknowledged if we can add another incent incentives? I'm speaking as a business owner on one of these corridors specifically. I mean, it would be great if the city would work with us, you know, in terms of the tourism board and administer the directory without, you know, you know, these are things that, you know'",
        "'speaker_7': ', not to differentiate, but like, you know, as a quote unquote millennial owning a business. You know, I have different priorities than the generation older than me that maybe we might be a little bit more east of Fourth Street than me because they're more strictly retail.'",
        "'speaker_7': 'They're more brick and mortar, the brick and mortar business model. Whereas most of my business exist on online. I think that issues more of like communicating to, you know, in widening the niche of people who know about my business, which is why, you know, be great, maybe, you know, I don't know what that building is on on'",
        "'speaker_7': 'Long Beach Boulevard. And first, a nice orange building. Whoever is up there, you know, whenever they come to the performing arts center and the Terrace Theater, like these kinds of people and the convention center, you know, for a specifically is related conversations there are these conventions there.'",
        "'speaker_7': 'It would be great to have some kind of a report just to add it to the program. You know, obviously when this passes, I'm going to apply for the program just thinking of ways that assist us, because I don't particularly need help with the Internet.'",
        "'speaker_7': 'I know that there are businesses that exist that do, but, you know, just adding, you know, make it a more wide range. But I support this.'",
        "'speaker_0': 'Thank you, Councilmember.'",
        "'speaker_7': 'Pearce, also, since I have one minute left, you know, being a business on fourth in Bonito in the second district, you know, you check us out 1029 East Fourth Street play nice. It's a community space. Thank you.'",
        "'speaker_4': 'Thanks. And I I did want to say that you did mention and I just wanted to be real clear for anybody listening is if you do graduate you get your your business license fees waived.'",
        "'speaker_10': 'To clarify, we don't waive business license fees, but the grant funding, the grant being provided will pay for one year of business license fees for the graduate. So that's the mini grant that's associated with successful completion of the program.'",
        "'speaker_4': 'Thank you. And then tonight, also, in case you don't know yet, my staff can help coordinate any conversations. John is also an excellent resource to connect you to other people in the city. And then my team, along with John's team, has been going down Fourth Street in between Alamitos and Cherry.'",
        "'speaker_4': 'And before my term is up, my hope is that we have our own business improvement district right there. And so hopefully you can help our team really do that and make sure that it's the right fit for that part of Fourth Street.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you. We are have a motion. And second, please cast your votes. And Susie's a yes. Oh, she's back.'"
    ],
    "Resolution to Hire Arthur Cox for Public Works Department.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Item 11.'",
        "'speaker_1': 'Report from Human Resources recommendation to adopt a resolution approving an exception to the waiting period for public agencies to hire Arthur Cox for a limited duration citywide.'",
        "'speaker_0': 'There's a motion and a second saying no public comment, please cast your vote.'",
        "'speaker_5': 'I'd like to make it clear that we would like him to work on our magnolia tree issues. Please. That needs to be in this contract. Is he limited on what he can work on?'",
        "'speaker_0': 'Mr. Modica.'",
        "'speaker_2': 'No. So he would be available to the director of public works to head for whatever it is within the hours that he's available.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_9': 'I'll start to work on my tweets to the 63.'",
        "'speaker_0': 'Please, please cast your votes. Let's vote quickly before this.'",
        "'speaker_2': 'List gets longer.'",
        "'speaker_0': 'The other one's really quick. No, I want to show you this. This is important.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. I'm going to do we're going to do. Adam item 12 is our last item. Can we do item 13 really quick and 14.'"
    ],
    "Amendments to Contract with Swinerton Builders for Phase II Terminal Area Improvements at the Long Beach Airport and Intent to Issue Airport Revenue Bonds.": [
        "'speaker_0': 'I also I'm going to go back to the airport at a moment. I don't see any public comment parade for the second round. Correct. So we're going to call that. There's none for that. It will conclude that now we're gonna go to our last item of the evening and what I like to say the most exciting.'",
        "'speaker_0': 'So please, if we can have item number 12, which I think is a huge and important moment for our airport that we're moving forward on. So this is very exciting stuff, and I'm going to turn this over to Mr. Modica.'",
        "'speaker_0': 'That's a good presentation for us.'",
        "'speaker_2': 'Thank you, Mr. Mayor. We couldn't agree more. This is an incredibly exciting item that we really want to delve into a little bit on some detail. If if you remember, we did a very significant improvement to our airport a couple of years ago back in, I believe, 2012, which is really about the terminal and about the the'",
        "'speaker_2': 'flights and everything else. And it was controversial at the time. This really is the next phase of that, which is all about the customer experience. This has nothing to do with increasing flights but really making Long Beach Airport even better.'",
        "'speaker_2': 'We hear constantly how amazing our airport is, but there are definitely some things that we could improve. This is one of our eight by 28 Olympic projects to get ready for the Olympics. And we would like to walk you through the project as you understand what's being recommended and what phases and see all the really exciting progress'",
        "'speaker_2': 'that's going to happen at our airport very soon. So with that, I will turn it over to Cynthia Guidry and her team to walk us through the presentation.'",
        "'speaker_6': 'Oh, good evening, honorable mayor and members of the Council. As Tom Marica mentioned, this item is for a contract amendment to 2010 Builders for the Phase two improvements at Long Beach Airport. We have a very brief presentation to talk about the background current status as well as the next steps for the airports modernization program.'",
        "'speaker_6': 'Next. Next to me is Mr. Stefan LAMB, who is our senior civil engineer on the job. He is our program manager at the airport. So just as a quick recap for phase one as part of the airport model.'",
        "'speaker_0': '1/2, I've lost quorum, I think, as councilman here. Okay, good. And I'm not sure there's other customers in the back, but you guys can come back out. That would be great. Okay, let's continue.'",
        "'speaker_6': 'Just as a recap for for phase one of our airport modernization program that began several years back and was completed in 2012 and which was a $100 million program really designed to to address the customer experience and the improvements at the airport post security.'",
        "'speaker_6': 'It was a construction of a new concourse, a new parking structure, and several other improvements that have really led to the airport receiving numerous awards in the industry. And so we're all we're all proud of that moving forward.'",
        "'speaker_6': 'Phase two really focuses on pre security improvements. So this is everything before passengers arrived to the security screening checkpoint. It is a nine projects that are part of an incredible program. But this original concept, which you'll see on the screen, was really defined and placed in a way to improve functional flow for our passengers, as well as'",
        "'speaker_6': 'renovate aging facilities and install and construct new modern facilities for for the airport. One key thing that I would like to add is that it has no effect on airport capacity or that the phase two program improvements really, again, focus on the customer enhancement.'",
        "'speaker_6': 'How can we improve the customer experience and make Long Beach Airport an even better airport? So this was the original concept and and phase two background, just to give you a little bit more information, back in 2018, Council did approve the contract as one of ten builders.'",
        "'speaker_6': 'It was a $65 million design build construction job. And at that time, really the procurement of doing the design build allows the owner to have more control over the design, and that has allowed for several different improvements to materialize over the last year and a half.'",
        "'speaker_6': 'This is a project that is a play job which will sustain over 440 jobs in the industry. And the other item that I would like to add is that the federal environmental approval process, which did take a little bit longer than anticipated, just was completed in December of 2019.'",
        "'speaker_6': 'So moving forward and since that that design award a year and a half ago, staff has worked really intimately with many stakeholders at the Long Beach Airport to refine those improvements, figure out what is best needed pre security, and determine a great plan for the passenger experience.'",
        "'speaker_6': 'However, those improvements came at the cost, and we'll go over some of those changes in a second. And we also saw a difference in the market conditions in the construction industry. So what does that design? This is a rendering of the new refined design for Long Beach Airport.'",
        "'speaker_6': 'It has a bold, new modern architecture. We have several different buildings that that we're constructing that will be brand new. We have a new ticketing lobby, a new checked baggage, TSA screening facility, a new backplane building, as well as a new concession space.'",
        "'speaker_6': 'All of these improvements really have led to to a design that really reflects Long Beach. Long Beach as a whole in the sense that it's a very open and accessible layout. We have a new meter and greeter plaza that will allow passengers and their loved ones to welcome each other as they enter into the city.'",
        "'speaker_6': 'We also have a design that truly showcases our historic terminal and lends itself to opportunities for our historic terminal in the future to be used for our new rental car counters. The historic terminal will also, as part of this program, involve a seismic retrofit, retrofit and many other improvements to the historic terminal.'",
        "'speaker_6': 'So we're all excited about that. This is also a rendering of our new ticketing building, which includes various upgrades and finishes. We have common use counters. We have an improved baggage efficiency system in the back of the building.'",
        "'speaker_6': 'We also have self-service kiosks and additional other sustainable amenities that we've included into the program. This will be a new LEED Silver Certified Certified Building, and we're all definitely excited to see it move forward. So those market conditions nationwide, we've we've seen an increase in construction costs across the country.'",
        "'speaker_6': 'And it's it's on average about 12%. But here, more locally, we're seeing an increase of about 30 to 35%. And part of that is all the major construction that we have right here in the L.A. County area. And this is multibillion dollar programs with Metro eight by 28, 28 by 28 program.'",
        "'speaker_6': 'We have the L.A.X. $14 billion program, the NFL Stadium. All of these different programs have really just shown and reflected to us that the agencies are really competing for the same limited pool of construction resources. And for us, what our original estimates really, really were we're targeting was that we would have 6 to 7 bids portrayed.'",
        "'speaker_6': 'But in reality, we on average received two bids portray. And so we've experienced a high increased in cost over the program. And those are things that we have to take into consideration as we move forward. So based on those costs, based on the affordability, based on where we are in the program, those nine projects that I spoke'",
        "'speaker_6': 'of earlier, we're recommending that we move forward with six of those projects listed here, the remaining three, which really focuses on the area in front of the historic terminal. So this is the rental car ready return in the ground transportation improvements that we would do some additional planning on those areas and rebid those projects within the next'",
        "'speaker_6': 'two years. So the fiscal impact, one of the things that we're you know, as an airport and as a enterprise department, we're also responsible in ensuring that as we move forward with any of our program improvements, that we're doing it responsibly.'",
        "'speaker_6': 'And we've worked with our financial management department and their city Treasury bureau to develop a plan that allows for us to move forward with the improvements and the additional cost while maintaining conservative financial metrics for the airport. We do have exit ramps designed in the contract that allow us to, if there's any efforts and conditions to allow'",
        "'speaker_6': 'us to to stop work and pay a small penalty. Well, it's a 1.5% penalty on on the future work. And we also have identified other remediation efforts if the airport has difficulty in paying in some of the financing plans that we have moving forward.'",
        "'speaker_6': 'One of the great things is that we do have grant funds from TSA that that will help offset the cost. This this as as an enterprise fund. We don't have any funds that will impact the general fund. However, we do need to issue airport revenue bonds to help offset the cost for for the program.'",
        "'speaker_6': 'And so you'll see an item in in a month or so asking your approval for the airport to issue those airport revenue bonds. So what are the next step if if City Council approves, we would move forward really quickly on our check baggage inspection system as well as our ticketing building and back claim area.'",
        "'speaker_6': 'We will have those six projects that I mentioned earlier complete by May 2020 to late 2022. And we would rebid those projects that I mentioned earlier that were the ground transportation improvements within the next two years. So with that, I might say that the airport staff, we are extremely, extremely excited.'",
        "'speaker_6': 'Committed and ready to move forward on the Phase two program. Happy to answer any questions you might have.'",
        "'speaker_0': 'Thank you very much. May I make some comments? I have a couple of questions on the transport of Councilwoman Mongo. I think the two of us have been pretty involved in this project up to this point and have been strong supporters.'",
        "'speaker_0': 'And so I just want to begin by saying what a kind of home run vision I think this next phase is for the airport. The airport is absolutely one of the best things about our city. It is constantly winning awards.'",
        "'speaker_0': 'It is constantly being uplifted by so much of the country. And it's just a great it's a great airport. I think that we want to maintain its charm and its historic nature as well. I want to emphasize that I think the the design and the look that you're all going forward in this next phase, I think really'",
        "'speaker_0': 'fits with the historic nature of the actual site and the facility. So I really love that. I have a couple questions. The first is I want to just understand a little bit more the rental car piece that is going to be delayed or that's going to be pushed back.'",
        "'speaker_0': 'So I know that part of the I'm if you can explain to me from a visual perspective, I know that the long term plan was to have some of the rent a car kind of service. The counter service moved into the historic terminal.'",
        "'speaker_0': 'That is still part of phase of this first phase, correct?'",
        "'speaker_6': 'That is still part of the first phase. On this rendering, if you can see the there are curb improvements in front of the historic terminal where you see the red shuttle busses as well as taxis. That's the the area that we're referring to that we would rebid within the next two years.'",
        "'speaker_0': 'Okay. And so what so the the moving of the kind of purchasing of picking up a car will still be moved into that historic part of the terminal, as we saw that will, you'll be able to walk right through our punching out the the back wall and creating those doors.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_6': 'That's correct, Mayor. So so part of the improvements do include the rental car counters moving into the first floor as part of the entire program. We will restore that back entrance, if you will, to the back of the historic terminal.'",
        "'speaker_6': 'So passengers are able to flow right through to me to greet.'",
        "'speaker_0': 'And so will we be removing the current rental rent a car, kind of, you know, hodgepodge structures that we have out in the parking lot as part of the first phase?'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'So the modular that's the answer I wanted to hear. Yes, we are. So so even though we are delaying the kind of a rent a car area that's being created separately, the actual old kind of trailers will be removed as part of this first phase.'",
        "'speaker_6': 'That is correct.'",
        "'speaker_0': 'Okay, that's great. The second question I had was, as it relates to some of the other projects that are that are that are tied into this, I know that the full baggage component is part and will be completed in the first week.'",
        "'speaker_0': 'That's what I hear mostly from travelers, is that they want that the baggage area is complete. That will all be done, correct? That is.'",
        "'speaker_6': 'Correct.'",
        "'speaker_0': 'Okay. And I just want to also say that some of the exciting projects that are currently happening right now that I'm excited about, I love obviously the new airport wing sign at the front that a lot of folks put in a lot of work on that.'",
        "'speaker_0': 'We love that the LED lights that we put up at the terminal, which can Mason is here and he's sick of me complaining about when they were going to get put in. But they're finally and so things can and when are we getting the big Long Beach sign that matches the 710 sign.'",
        "'speaker_2': 'On like a ballpark?'",
        "'speaker_0': 'Off the 710 and the one that we're going to put in over by the 22 and four or five in that whole thing.'",
        "'speaker_6': 'That is a project being managed by public works.'",
        "'speaker_0': 'Okay. So. Mr. MODICA.'",
        "'speaker_2': 'Yes. So we are actively working on that. We have seen some cost increase in that project and so we're looking at a couple of ways to get the costs back in line with the budget. But we do want to move forward with that this year.'",
        "'speaker_2': 'And so we're doing a quick value engineering effort to just see can we find a a spot to make it a little bit and a little bit less expensive, and then we'll move forward.'",
        "'speaker_0': 'Q So what does that what does that about from a timing perspective?'",
        "'speaker_2': 'I'm guessing probably two months, something like that, to have that analysis back about what we can do to keep those costs a little bit further down and then start.'",
        "'speaker_0': 'Councilman Mongo really wants us sign, and so do I. And then. And then the last. The last piece of my questions on those is the. I also I'm not a fan. I think is is, as Mr. Mason knows, of the some of the not historic signage at the terminal.'",
        "'speaker_0': 'That needs to be replaced. When is that going to happen? I'm talking about the signage says Long Beach Airport with the little.'",
        "'speaker_6': 'You know on the I'm actually on the story terminal.'",
        "'speaker_2': 'That sign will also be replaced as part of the Terminal Restoration Project.'",
        "'speaker_0': 'Oh, so that'll be all replaced as part of this, right.'",
        "'speaker_2': 'And it'll be restored back to its former look and esthetic of that. Back on the eyebrow.'",
        "'speaker_0': 'Okay, great. Listen, I just want to I want to thank you guys. I think that the airport campus is looking really spectacular. I love the lighting. I love the large new letters at the parking structures. I love the landscaping.'",
        "'speaker_0': 'It's looking really great. So thank you guys for all your hard work. Councilman Mongo.'",
        "'speaker_8': 'Finally, I don't have any questions. This is my third viewing of this excellent presentation. I want to thank you and your leadership, but. But mainly your team. Your team has always been so welcoming. There's not a day that I can't just pop by the airport and ask a myriad of questions that you're all ready and willing to'",
        "'speaker_8': 'look up and find out and answer and support. And I just appreciate you very much. I think that this is a light, bright and open plan that really is the real feel of what Long Beach is. And it will again keep us in the top five airports in America that I know we will move at the top'",
        "'speaker_8': '. I would also say that it's smart, convenient and efficient. I know that there's not enough time in the short presentation to go into the details of how much this new TSA screening area will help reduce potential worker injuries because they won't have to pick up bags in the way that they do now will be more like the'",
        "'speaker_8': 'airports that have come a long way in allowing in line movement of baggage behind the scenes once you do your checked baggage. And I think that that that's really important because we want Long Beach Airport to also be the best place to work.'",
        "'speaker_8': 'And so I know she didn't go into it. And it's going to get me a dirty look from the city attorney because it's a scope adjacent comment. But people love to work at the Long Beach Airport. They love to work on projects like this.'",
        "'speaker_8': 'And our director is really pushing into workforce development and letting people know about what a great opportunity it is to work at this amazing place. So great work. Thank you for everything you do. And while this presentation was great, we could learn a thing or two from the airport staff because they really know how to use technology'",
        "'speaker_8': 'in their presentations in the director's office.'",
        "'speaker_0': 'Thank you. Q Councilman Price.'",
        "'speaker_5': 'Thank you. By the way, it's not a dirty look from the city attorney. They teach us that in law school, it's like to deter you from being creative and thinking outside the box. Thank you. Thank you to the city staff for putting this together and the entire airport team.'",
        "'speaker_5': 'I'm really, really proud to support this project. And I love our airport. I love flying in and out of the airport. It's just a fantastic testament to what an amazing city we are. So thank you very much. I'm looking forward to these improvements.'",
        "'speaker_0': 'Thank you, Councilwoman.'",
        "'speaker_3': 'Councilman Zendaya's echoing what my colleagues have already said. I'm just super excited to see this. I wish I could see it now, but I know it takes patience. But thank you very much for all your work that you've put in it.'",
        "'speaker_3': 'Staff Airport Thank you, Cynthia, for being so flexible and available and accessible to us when we've had questions about this. And I'm just really excited. The airport continues to be something I'm very, very proud of to have in our city.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you. Councilman Richardson.'",
        "'speaker_7': 'Thank you. Just wanted to chime in and say, you know, I'm a big fan of the Long Beach Airport. I love flying out of Long Beach Airport. I'll be flying out tomorrow morning from Long Beach Airport. You know, a lot of great stuff happened in there.'",
        "'speaker_7': 'You know, just a question. I love that you can valet. Your car and get your car wash for about 20 bucks. He's going to keep that program.'",
        "'speaker_6': 'We're looking at that, right?'",
        "'speaker_2': 'Okay.'",
        "'speaker_7': 'Just keep looking at it. Thanks a lot. Fantastic work. You know, you've you've hit the ground running. This is a great project. And I'm going to go brag to other cities about our Long Beach Airport. Thanks a lot.'",
        "'speaker_0': 'Thank you, Katherine Supernova.'",
        "'speaker_9': 'A thank you. And warning to the city attorney. I'm about to push the borders of the Brown Act here also. I just wanted to publicly thank Director Guidry for speaking at our last community meeting. We really appreciate that.'",
        "'speaker_9': 'And Staff Ron Reeves and Ken Mason, thank you also. Great project. Look forward to seeing it come to fruition.'",
        "'speaker_0': 'Thank you, Councilmember Vice Mayor Andrews.'",
        "'speaker_9': 'Thank you, Mayor. I really thought, you know, this is the first time well, maybe a third or fourth time we've gone out this early, and I couldn't understand why all these individuals are sitting over here. But now I understand this is probably one our better presentation we've had all year.'",
        "'speaker_9': 'So I just want to thank you for coming forth and giving us that enlightening, you know, night, because we can go home tonight and think about, boy, one day I'll be able to go to Long Beach Airport and fly out of there.'",
        "'speaker_9': 'I'd like to fly today out to L.A. just to show them how good we are.'",
        "'speaker_0': 'Thank you. Next up is Councilman Mongo.'",
        "'speaker_8': 'Only to add on to Vice Mayor Andrew's comment about how great the presentation was. I commented to the director at our meeting on Monday that her presentation could really be side by side with a presentation we saw in closed session about a year ago that we determined was the best presentation the council had ever seen, but I'",
        "'speaker_8': 'just couldn't remember who gave it. So if Mr. Modica or Mr. Parking could remind me or her. It was a great presentation and you are in the big leagues and we really appreciate you doing such a thorough and excellent presentation.'",
        "'speaker_8': 'I hope my colleagues will support it with my vote.'",
        "'speaker_0': 'I see no public comment which for an airport item is really strange. So members, please go ahead and cast your vote.'",
        "'speaker_8': 'I think that says what a great director she is. She took all the comments in advance.'"
    ]
}