{
    "Ordinance on Unattended Storage Boxes. (WITHDRAWN)": [
        "'speaker_0': 'Thanks again to the Assistance League for recognizing Children's Mental Health Month. So we're move along with the agenda. Let's go ahead and here have our have our hearing. I don't want to, number one.'",
        "'speaker_1': 'Report from Development Services. Recommendation to receive supporting documentation under the record. Conclude the public hearing. Declare ordinance amending various sections of Title 21 of the Long Beach Municipal Code relating to unattended donation boxes read for the first time and lead over to the next regular meeting of the City Council for Final Reading and adopt a resolution to'",
        "'speaker_1': 'submit a request to the California Coastal Commission to certify an amendment to the certified a local coastal program citywide.'",
        "'speaker_0': 'Thank you. And no oath is required, so I'll hand it over to two staff. Thank you, Vice Mayor. We have Linda Tatum, planning manager, planning bureau manager, and Carrie Tai, current planning officer. We're going to be conducting the presentation tonight for us.'",
        "'speaker_4': 'And we also have the project planner, Anita Gold's Garcia as a part of the presentation team. Kerri to I will start off the presentation.'",
        "'speaker_3': 'Good evening, Vice Mayor Richardson and members of the city council. Before you tonight is a zoning code amendment for unattended donation boxes. Thank you for the clicker. Sorry about that. So I'm going to start out by explaining what is an unattended donation box.'",
        "'speaker_3': 'And so you may have seen these around town. There's a picture of one up on the on the screen there, but it's basically a nonpermanent container that typically accepts donations. Most often they're textiles, you know, used clothing, shoes and books and the like to be used for resale, recycling or distribution for a variety of purposes because they'",
        "'speaker_3': 'can be run by different kinds of organizations. So the background is why do why why all of a sudden is this being presented as a new ordinance? And over the past couple of years, our code enforcement department has reported public nuisance related to issues like trash, graffiti, loitering and general blight.'",
        "'speaker_3': 'As a result of these boxes, basically the unpermitted and unregulated placement of these boxes results in something to attract a destination to drop things off. And as a result, the there's been occasions around town where this has become a code enforcement issue.'",
        "'speaker_3': 'So in April of 2017, the City Council established a one year moratorium for the use of unattended donation boxes for the purpose of creating regulations and amending the municipal code in order to responsibly permit this. So the proposed zoning code amendments are necessary because these boxes are not specifically addressed in the Long Beach zoning code, and therefore'",
        "'speaker_3': 'right now there are not a permitted use. As a result, we have no way to permit them and so we're on the way to fixing that. One of the elements that's part of the discussion is that these unattended donation boxes are actually entitled to First Amendment protection, and that's because they represent a way for the public to'",
        "'speaker_3': 'express in part through donations what their beliefs are, what their belief system is. And so therefore, they they are a little bit different from just a your everyday land use. They do have some First Amendment component. The purpose of the zoning code amendment is to recognize unattended donation boxes as a permitted accessory use.'",
        "'speaker_3': 'And I'll talk about that in a bit with specific development standards and criteria to minimize any potential impacts because of their First Amendment protection and the need to somehow permit them responsibly. Or what staff is proposing is what's called ministerial review.'",
        "'speaker_3': 'Ministerial review is contrasted with the discretionary review in that there is the level of certainty that something can be permitted once it is consistent with established criteria. So the first component of the proposed zoning code amendment is the actual definition that staff is proposing.'",
        "'speaker_3': 'The introduction of a definition that describes generally what these boxes are, and it's meant to be general. So that encompasses a variety of, you know, configurations that they could have, but they would be they're unstaffed and there are drop off boxes, containers, receptacles or a similar device that's used for soliciting or collecting donations of clothing or other'",
        "'speaker_3': 'salvageable personal property. And we also included in the definition a language that differentiates these from the beverage container recycling operations, because those are separately regulated by the state. And we wanted to minimize any confusion between the two. These would be permitted as accessory uses in commercial zones as well as institutional zones.'",
        "'speaker_3': 'They would not be permitted in any residential areas or industrial areas, for example. And the proposed development standards include having to obtain a land use permit for the box, and that will allow the city to verify the proposed development standards that are in the in the draft ordinance.'",
        "'speaker_3': 'One is that the there can only be one unattended donation box every 1000 feet, and that is to prevent the proliferation of these boxes. They also cannot be placed on any vacant lots. And that's why they have to be an accessory use.'",
        "'speaker_3': 'They have to be in addition to something that is already on that property. They also cannot be placed in areas required for parking spaces and landscape areas, dry bills, loading zones, etc., or walkways. And lastly, they do have they will have minimum set back in visibility.'",
        "'speaker_3': 'So they can't block corners, cannot. Create blind areas and also must have a light source nearby so that they are not placed in dark areas. The the development standards also cover.'",
        "'speaker_2': 'That.'",
        "'speaker_3': 'The container themselves. In other words, they must be constructed of durable, waterproof materials. There are size limits, so the maximum height would be six feet with a maximum size of 25 square feet, and that's generally five by five.'",
        "'speaker_3': 'Also, there has to be a locking mechanism and there are maintenance requirements to ensure that the area around the box isn't is maintained. Signage is also required to be posted on the box in case the a member of the public or any any kind of enforcement official needs to contact the operator or agent or a property owner'",
        "'speaker_3': 'or agent of that box. So just to go through the background, the planning commission at their January 4th meeting forwarded a recommendation that the City Council adopt this ordinance along with a negative declaration. Both the negative declaration and the public hearing for the Planning Commission were circulated for separate public review periods, and staff did not receive any'",
        "'speaker_3': 'comments with regard to the negative declaration or the Planning Commission hearing. The City Council hearing subsequently, subsequently was also separately public notice. We did receive one comment from a person who commented that the property owner information should not be required to be posted on the box, and with that the Planning Commission should go back to the Planning'",
        "'speaker_3': 'Commission did forward a recommendation to the Council and so tonight the recommendation is to enact the Planning Commission's recommendation to adopt the negative declaration and approve the zoning ordinance amendment for regulations for unattended donation boxes. This is also accompanied by a local coastal program amendment for these regulations to be implemented in the city's coastal zone as well'",
        "'speaker_3': '. That concludes staff present presentation and I can address any questions you have. Thank you.'",
        "'speaker_2': 'Mr. Vice Mayor. Just for clarification, this item would require two votes one to adopt the negative declaration and approve the ordinance, and the second one to adopt a resolution forwarding it to the Coastal Commission for its consideration.'",
        "'speaker_0': 'Thank you. Thank you. So that concludes your presentation. We'll go to the public before council deliberation. Is there any public comment on this item on this hearing? Seeing none. We will take it back behind the rail. So we'll start with Council Hooper now.'",
        "'speaker_0': 'Thank you and thank you for that staff report. Great job. Just as a point of clarification, I think the public perception is that these boxes are for donations to the needy. And the problem here is that a for profit organization can set up one of these boxes.'",
        "'speaker_0': 'So it's a double whammy. Not only do do the folks donating here, it's not going to the source they think it is. You're actually taking items from goodwill and others who would collect them otherwise. So I'd like to ask our assistant city attorney, Mike Mayes.'",
        "'speaker_0': 'This is the best we can do in terms of regulating this, in your opinion?'",
        "'speaker_2': 'Casselman Supervisor Yes. And what we did is, as Steph alluded to, as Kerry alluded to, there was a case in 2015 from the state of Michigan where they struck down an ordinance that basically banned these types of boxes because they discriminated as but the ordinance discriminated on its face as between charitable and nontraditional solicitations.'",
        "'speaker_2': 'Then subsequent to that, in 2017, the Ninth Circuit Court of Appeal, which governs California, upheld an ordinance that was adopted by the city of Oakland to regulate these boxes. So to the best of our ability, we use the Oakland ordinance as a model, but drafted it in a way that it was a little bit more protective.'",
        "'speaker_2': 'I thought of Long Beach interests, so I think from a nuisance standpoint. So I think we've done the best we can.'",
        "'speaker_0': 'Okay. Thank you for that. That's all I am. Thank you. Councilman Price.'",
        "'speaker_4': 'Thank you for the staff report. I think these changes are very welcome. My question is, in regards to enforcement, what are we doing about the blighted containers that are there? Who who is going around and identifying how we can get rid of those?'",
        "'speaker_4': 'Councilwoman, there is not a proactive effort to go after those that are in the right of way. However, as with any code enforcement action, whenever there is a report of a project or a a particular box location that has blight graffiti overflowing, that is an appropriate activity for our code enforcement staff to pursue.'",
        "'speaker_4': 'And we will pursue them as we have in the past with any that have come to our attention. We have proceeded pursue those aggressively and do is it possible to add this is one of the features on the Go Along Beach app?'",
        "'speaker_4': 'I we can certainly pursue that because I know we have graffiti and I know we have dumped items. So there are categories that are, you know, collaterally related to this. I wonder if we could just have this and then those, those notices would go to code enforcement as opposed to public works.'",
        "'speaker_4': 'We will actively pursue that option. Great. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_3': 'I had a lot of the same comments as my colleagues. I was going to ask, do we have a logo or I mean a sticker where we could advertise our Go Beach app on trash cans or on these stand alone so that somebody, if they were overflowing or had graffiti, you could say report to go beach.'",
        "'speaker_4': 'Staff is not aware that there is a decal or sticker that you can slap on, but we can certainly investigate that as well.'",
        "'speaker_3': 'I've been in conversation with Public Works about a couple of our locked Ben ideas that we're rolling around with some of our areas and that is one of the things that we'd like to ask for. So and moving forward, if there's any way where we can publicize our Go Beach app on these items would be fantastic and'",
        "'speaker_3': 'perhaps I missed it. Are there fines associated with them not picking them up and and emptying them?'",
        "'speaker_4': 'They they would be the standard fines that are identified on the code for any land use or code enforcement violation. So there wouldn't be fines that are specific to this particular type of activity.'",
        "'speaker_3': 'Okay. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_3': 'So at the thousand feet, I think people often forget how close 1000 feet is. And so I have a question related to how many could be within one shopping center, because that is a big concern to us.'",
        "'speaker_4': 'The regulation is based strictly on the distance requirement. It's not based upon a shopping center property because as you know, a shopping center can be any any size. There's no limit on the size of a shopping center. The strict criteria is 1000 feet a distance from an another bin.'",
        "'speaker_3': 'But if this council chose, we could state that if a shopping center is less than this size, they can only have one. Certainly because I have concerns, the Long Beach Town Center was specifically designed to make it difficult for traffic to leave quickly as a safety measure so that it would be less of a target for criminals'",
        "'speaker_3': 'to break into cars and a very difficult escape route and so on and so forth. And it's worked very effectively. However, if the town center were to say put in for or the shopping center off of Spring Street and put in two or three their large shopping centers.'",
        "'speaker_3': 'And so my concern is that the aggregating of them and the traffic flow in and out of these centers, are there any regulations related to their distance from a driveway?'",
        "'speaker_4': 'Right now there is no distance regulation. However, there are some very specific standards that discuss where they can't be in relation to other required components of a project such as they can't be in a required parking space, they can't be in a required setback area.'",
        "'speaker_4': 'So again, the location is determined through the permit process. Staff examines the location and determines that there are no safety or visibility issues before issuing a permit for a specific location. That would certainly be taken into consideration.'",
        "'speaker_3': 'Well, I would feel more comfortable if we were able to take another week and bring this back again, where we would put in some kind of regulations that would limit the number per shopping center and or the distance required between a driveway or an inlet or an outlet.'",
        "'speaker_3': 'And so those would be my recommendations. But I'm open to hearing from my colleagues.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_5': 'Thank you. My question was regarding the 1000 feet and permit limit within for the unmanned donation boxes. Quick. I just just was curious to know how the 1000 feet would be enforced and and if if and how would would unpermitted YouTubes be be dealt with 1000 feet?'",
        "'speaker_3': 'Sure. Councilmember Austin. So in terms of the enforcement, if I understand the question properly, it's that if a member of the public or somebody were to report a box that did not was not he either was either permitted by this ordinance and not complying with the terms.'",
        "'speaker_3': 'In other words, they move it or they're not collecting the donations in a regular enough manner that is resulting in in a mess. Basically, they would contact planning and code enforcement. They would contact development services, and then we would send out the traditional without the notice of of violation.'",
        "'speaker_3': 'It's like a warning for us. We don't cite them because we give people the ability to rectify the situation first, and then it would go down the regular channel whereby if it wasn't cleaned up within a certain time and then citations would begin and then the citations increase and eventually it ends up at the city prosecutor's office'",
        "'speaker_3': '. And that's the standard enforcement tool. But it is it is by complaint. And then if it were a box that is out there that was not permitted and then somebody called in, they could possibly come in and permitted under the new ordinance if they met the location and setback criteria.'",
        "'speaker_3': 'But if not, they would certainly have to remove it. And again, it would go back into the same corrective action pathway that the city has.'",
        "'speaker_2': 'And Councilwoman Mungo, just to clarify there, we already currently have a provision in the draft ordinance that I think would address your concern in regard to driveways. There's a specific section that says that you DBS shall have a minimum setback of 20 feet from the public right of way and five feet from any property line or meet'",
        "'speaker_2': 'the setback requirements of the underlying zone which ever is greater. And in addition, it requires that no UDP be within any landscape, parking space, driveway or walkway, handicapped accessibility, route building and grocery, egress, easements, trash enclosure or waste disposal areas or the public right of way.'",
        "'speaker_2': 'So they clearly would have to be set back at a minimum of 20 feet from a driveway area which typically traverses the public right of way. So we do have that in there. And if the will of the council was to bring this back with additional changes, we probably wouldn't be able to bring it back next week'",
        "'speaker_2': ', but perhaps the week following that, to give us a little bit more time to to clarify it. And as Carrie pointed out, the moratorium would remain in effect till April 11th. So we do have time.'",
        "'speaker_3': 'Well, I really appreciate you making the mention. I guess I only think and this is my quick hand drawing on the back of our mayor speaker's list. But while the entrance to any area might be maybe only the 20 feet area, there's really a circulation of traffic that goes in and out of this area.'",
        "'speaker_3': 'Same with the facility that has Grounds Bakery. Same with the facility. There's so many parking I'm sorry, there's so many shopping centers that have a natural flow of traffic. And if they were even to put somewhere way back here off the main street, but in this like circle flow and people are getting in and out of their'",
        "'speaker_3': 'cars to put things in, I just worry there's already cases of. Issues related to traffic flow. And while we would hope that each different shopping center would want to not put it there, I think that sometimes there's only certain areas that would even be available.'",
        "'speaker_3': 'So I'll leave the friendly to Councilmember Superman. I see that he's queued up to speak as well.'",
        "'speaker_0': 'Thank you, Councilmember Sabrina. Okay, Councilman Ralston.'",
        "'speaker_5': 'So, yes, I defer to a little bit of my time to Councilmember Mongo. Thank you very much. I did have a question regarding the permit fees. I'm not sure that was addressed here. And what would those be for these of these receptacles?'",
        "'speaker_4': 'I'm sorry. Permit has the permit fees of that permit fee. We are still in the process of determining that, but it will be a fairly meaningful I'm sorry, minimal, probably within a couple of hundred dollars. We're still looking at the actual approval fee for this effort.'",
        "'speaker_5': 'And so is it our discretion to set such fees or is there very legal kind of guideline for that?'",
        "'speaker_4': 'Well, there is essentially any fees that we establish in the department. They're generally cost recovery. And after having looked at the process for review of the applications, we think that it's going to be equivalent to the review of the same permit or some other equivalent ministerial review, which would be a an hour or so of a staff'",
        "'speaker_4': 'time. So we're looking at something around a couple of hundred dollars for this this fee.'",
        "'speaker_5': 'So don't we want to factor in graffiti removal and code enforcement and all of those other services that may be impacted by proliferation of under the man?'",
        "'speaker_4': 'I think that in considering the fee that we're considering, it's actually the fee for the review and the approval. All of the code enforcement activities would be covered by a citation that would actually cover the costs of cleanup or other fees.'",
        "'speaker_4': 'So we truly are only looking at the fee for us to process the applications that staff reviews.'",
        "'speaker_5': 'All right. Thank you so.'",
        "'speaker_4': 'Much. All right. And if I may, Vice Chair and the concern regarding Councilwoman Mango's request for this to come back in a couple of weeks, she had recommended next week and we would need additional time to prepare a staff report and get it through the process.'",
        "'speaker_4': 'And I just wanted to point out that we don't have a meeting on that February 28th, and we have a firm agenda on March six for the land use element. So the soonest that we could come back with this item would be March 13th.'",
        "'speaker_0': 'So just a question. Is there a mechanism? I mean, can we insert this language? I mean, how many times is this ordinance need to come back to the city council anyway? First reading and second reading. So after this hearing, we would already have those.'",
        "'speaker_0': 'Does this count as the first reading or we still have two additional reading?'",
        "'speaker_2': 'Mr.. RICE Mario, this would not count as first.'",
        "'speaker_0': 'Reading, so it already needs to we make a change here and then just make sure is reflected in the first reading.'",
        "'speaker_2': 'No, because this type of a change is not an easy kind of change to make. We need the very precise language to insert and think it over and see how it would actually work and bring back a recommendation.'",
        "'speaker_2': 'But so even if we brought it back in March, we would still bring it back well in advance of the expiration.'",
        "'speaker_0': 'So the next question is, was there no evaluation of like traffic or some approve some sort of a provisional or conditional approval that that we have as a city council to approve, say, multiple in one site? Do we not have that mechanism already built in to the ordinance?'",
        "'speaker_4': 'He was the proposed ordinance does build in the ability for an applicant to request a second burn at a site. Okay. So that's already in there. I understood the request from Councilman Mango would be to consider. I'm not clear.'",
        "'speaker_4': 'She can probably articulate.'",
        "'speaker_0': 'The goal was to get less correct. Right. Less than more so which.'",
        "'speaker_3': 'Would be a greater.'",
        "'speaker_4': 'Distance separation that she's ask us to consider. And I think we're still waiting for a specific direction in that regard.'",
        "'speaker_0': 'Can we give it some more specific direction now?'",
        "'speaker_3': 'Yes. So from from my point of view, I'm not trying to have less of them per se. But what I don't want to have is multiple locations on a single site site. So if, for instance, the shopping center wants to have two different competing bins, I actually don't even mind if they're next to each other instead of'",
        "'speaker_3': 'having them at two different locations, blocking traffic in two different places on the same site. My bigger concern is not a thousand feet apart. My bigger concern is having four locations or two locations on a single property that both have potential for blight, potential for trash.'",
        "'speaker_3': 'Fake issues. I would rather have them all consolidated. And so I think what Vice Mayor Richardson was asking is, as they come up one at a time, will there be an opportunity for the expertize of the district to have a little say in that, whether it's the expertize from the traffic engineer or the expertize from whomever knows'",
        "'speaker_3': 'that area similar to a copy.'",
        "'speaker_4': 'And I let me just explain kind of the thought process for our staff in recommending or at least considering the additional or the second been at one site. The idea there is if the volume of activity at any one bean is overwhelming just based upon its convenience and people just like it, we wanted to make sure that'",
        "'speaker_4': 'there was less of a potential for blight by having two bins. Right. And if if you're comfortable with the recommendation, I think what staff could do is to limit it to no more than two bins per site at a maximum, regardless of a combination of no more than two bins per site or the 1000 square feet, whichever'",
        "'speaker_4': 'is less. So that we kind of cover the bases, if what I'm hearing you express is that you don't want more than two bins per site. And I think your concern regarding, I guess, traffic concerns or the like, we think that the current regulations that are specified in the ordinance that the city attorney read out will address'",
        "'speaker_4': 'any concerns about traffic. We don't think that this has the potential to affect traffic because again, the staff review will take care of that. And looking at this very detailed list, and I think we would also just as a matter of course, make sure that it doesn't have any visibility issues or traffic traffic conflict issues.'",
        "'speaker_3': 'So I do like your recommendation. I'm very comfortable with that. I also like the staff process and I hope that in the first few that are approved or reviewed in our area, that we have the ability to at least learn what types of locations and accesses and positioning they're looking for.'",
        "'speaker_3': 'Because in my experience with these, I have seen some terrible things and once they receive a permit, going backwards is is very difficult in some cities. And I know that we're.'",
        "'speaker_2': 'A very.'",
        "'speaker_3': 'Large city and I don't want our communities to have to be facing these issues for an ongoing basis. So thank you for the recommendation. I appreciate it. If Councilmember Soup and other make of the motion is open to it, then I think that that would be a great step.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Mr. Boehner. Okay. I just want to make sure where we are on the friendly, are we coming back some time with this or.'",
        "'speaker_4': 'My understanding is that with the the revised motion or the language to limit it to no more than two bins on any site, that there's not a need to come back, that this could proceed to a second reading at whatever the next council meeting is.'",
        "'speaker_0': 'Yeah, I'm just not comfortable with that motion. And to your point, Ms.. Tatum, if one is very popular, we'd locate a second. I would argue if one's very popular, then that's not the right vehicle for that spot. It shouldn't be an unattended bean if it's if it's going to have to be emptied every hour or something like'",
        "'speaker_0': 'that. So I think the spirit of the ordinance was we were trying to prevent over proliferation. And if we put in the ordinance, we allow to per location, guess what? They're going to max. That out is my fear at every single location.'",
        "'speaker_0': 'So I'm perfectly open to bringing this back sometime in March if we want to get this out a little more. We have time. Mr. Mays, I think you said we don't have to actually have the final reading until April, so I'm good with that.'",
        "'speaker_2': 'And Councilman Super on the ordinance as it's currently drafted would clearly allow an applicant to apply for more than one per site. So if that is something that the council wants to remove, we certainly can remove that. We could also impose a restriction for a large mall, for instance, that let's say the expanse of the mall exceeded'",
        "'speaker_2': 'a thousand feet. We could say that. And assuming it only has one property address or one opinion, we could limit it to one per apprehend so that for the large malls you'd still only end up with one rather than two.'",
        "'speaker_0': 'Okay, that sounds perfect. So if council by mango is fine with that, then good. We can do this tonight. Okay. Thank you. So, just to be clear. Are we going to come back with another hearing?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Linda saying no city attorney's and.'",
        "'speaker_4': 'Deferring to the city.'",
        "'speaker_2': 'Attorney. We'd have to bring it back because that's not the kind of language we can insert or nothing.'",
        "'speaker_0': 'We can tweak tonight. It's we have to do an actual.'",
        "'speaker_2': 'Yep, we'd have to bring it back. Trust me, I'd rather do it.'",
        "'speaker_0': 'Council members. And you accept. That motion. Just want to be crystal clear. Yes. Okay. So so there's no further comment here. Members, please cast your vote.'",
        "'speaker_4': 'So one.'"
    ],
    "Easement Deed to Southern California Edison at 4951 Oregon Avenue.": [
        "'speaker_0': 'Okay. So we're going to do the consent calendar minus item number 13. Is any public comment on the motion saying no members, please cast your vote. Motion carries. Thank you. Item 13, please. Craig back.'",
        "'speaker_2': 'Good evening, Vice Mayor, Member City Council. Thank you for the opportunity to address this item. There is a a incorrect date listed on the council letter and just wanted to read that into the record so we make sure we have the correct date.'",
        "'speaker_2': 'The council letter is for an easement right of way connected to 4951 Oregon Avenue. In the staff report, we talk about when the secret document came forward and what's listed as May 9th, 2017. That was a mistake by staff.'",
        "'speaker_2': 'That was actually the date that we brought forward the track map for the development project. The actual secret document came forward in November on the 10th in 2015. So we wanted to read that in the record to make sure it accurately reflects when the secret document was approved so we can move this item forward.'",
        "'speaker_2': 'That concludes that report. Thank you.'",
        "'speaker_0': 'Fantastic. Thank you. Any public comment on this item saying no members, please cast your vote.'",
        "'speaker_1': 'Councilman Urunga. Motion carries.'"
    ],
    "Ordinance to Ban Bicycle Activities on Public Property or Rights-of-Way.": [
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_0': 'Motion carries. Thank you. Number 17, please.'",
        "'speaker_1': 'Communication from Councilwoman Price Councilmember Super nor Councilman Andrews Councilman Austin recommendation to request the city manager and city attorney to draft a bicycle chop shop ordinance.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_4': 'Thank you very much. I want to urge my colleagues to support this item tonight. Bike thefts are a major problem throughout the city. And in looking at the bike theft data from all of the four divisions of our police department, it's clear to me that bike thefts are definitely underreported citywide.'",
        "'speaker_4': 'That's especially true in my district. One of the things that we have found and let me go through some of those numbers. So in East Division in 2017, we had an average well, we had about six between 6 to 22 bike thefts a month during the calendar year and west, there was about 1 to 3 in north'",
        "'speaker_4': ', 1 to 9, but usually it hovered around 1 to 3 and in south between 1 to 10. If you talk to the residents at community meetings, it's clear that bike thefts are much more prevalent, especially along the ocean and our business corridor as well.'",
        "'speaker_4': 'We encourage bike and pedestrian activity. It's it's really important. I think if we're going to be a city that's promoting bike infrastructure, that we do everything that we can to deter bike thefts, but also to penalize those who might be using stolen bikes as a method of currency by creating bike chop shops.'",
        "'speaker_4': 'So that's what this item is about. We have found that there's a clear problem throughout our parks, our beaches, our sidewalks and our parking lots with multiple bikes and bike parts strewn about. It wouldn't stop. This particular ordinance would not stop anyone from working on their bikes individually or take doing emergency maintenance in public.'",
        "'speaker_4': 'But for those who are dismantling and selling multiple bikes in public spaces, this ordinance would make such activity illegal. Applied with similar this. This particular ordinance should be applied with similar logic to the ordinances that we have that don't allow the dismantling of cars in city streets.'",
        "'speaker_4': 'You can't remove, for example, the transmission of a car that's parked on a street the same. The same should apply with multiple bikes. It's important to note that this particular ordinance would not affect any illegal business operations who conduct programs in public or permit bicycle related events, including swap meets and any established bike repair stands, of which'",
        "'speaker_4': 'we have several along the coast in the second and third districts. I ask for the support of my colleagues on this item. This is a problem that I think our police department is seeing more and more of when they are out in the community, especially when they are in places where there appear to be abandoned items in'",
        "'speaker_4': 'the form of encampments there. You always know when you're going to be coming up upon abandoned items because you'll see bike pedals, bike frames, wheels, things of that nature as you walk up to an area that seems to have a lot of abandoned property.'",
        "'speaker_4': 'So I ask for my colleagues support. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sabrina, thank you. And thank Councilwoman Price for bringing this item forward. I'm happy to sign on to it and support it. And for all those who email us and call us and tell us, you know, we used to have a bicycle licensing program locally.'",
        "'speaker_0': 'Yeah, we will definitely do that. We will have community events, probably. Councilmember Price and I will do one together. We share a two and a half mile border and that will be the spirit of this is let's get these registration numbers on these bikes logged in and give the police a hand in solving these issues.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_3': 'Thank you. And I want to thank my colleagues for bringing this forward. We've actually been working on a similar item with staff as well. This item. To be clear, does not address increasing the number of registrations, does it, Councilmember?'",
        "'speaker_4': 'No, not particularly. But I did bring an item about three or four months ago asking for a bike registration program to be reestablished in the city.'",
        "'speaker_3': 'Great. I have a lot of questions and ideas around the bike registration program, so I think we can work with public works as we have been and PD on ensuring that we we have legal operations, that we are trying to certify them and encourage them to do an increased bike registry.'",
        "'speaker_3': 'I also wanted to ask let's see 1/2. This item came up fast, which I like. Can somebody from staff describe to us what happens whenever a bike is picked up, whether it's in pieces or it's a stolen bike that we retrieve?'",
        "'speaker_3': 'I'm not sure if that's PD or Commander Griffin. Thank you.'",
        "'speaker_0': 'I used to live there and Craig bang on. Okay. I.'",
        "'speaker_3': 'Signed up. That's what it means. Good evening. Sorry about that. We're trying to clear it up here with Mr. Beck and myself.'",
        "'speaker_2': 'When we, the police department.'",
        "'speaker_4': 'Take bikes, we take it into storage, and it's held for 30 days until somebody can.'",
        "'speaker_3': 'Claim it is basically what what we do for.'",
        "'speaker_4': 'Storage and.'",
        "'speaker_2': 'Bike parts would be the same. It'd be.'",
        "'speaker_4': 'As abandoned.'",
        "'speaker_2': 'Property.'",
        "'speaker_4': 'We would take it.'",
        "'speaker_3': 'For that reason. And so what happens after 30 days?'",
        "'speaker_2': 'It usually goes out to auction.'",
        "'speaker_3': 'To auction, yes. It's I guess one of the ideas that came up in my office was, is there a program where we can have these bikes go back into a youth program like L.B. Capp or something like that, were able to get these bikes into youths hands that might be disadvantaged and not have access to a bike'",
        "'speaker_2': '. So there is the bikes 90800 program that has had an opportunity to utilize some of the unclaimed bicycles.'",
        "'speaker_0': 'The program has been gone for at least five years.'",
        "'speaker_2': 'Yes. So that was a program that was done in the past. Right now, we do work with some of our partners to deliver more newer bicycles. There's a great partnership with local bicycle shops where they deliver bikes to some of our elementary school kids and our middle school kids.'",
        "'speaker_2': 'It's a fantastic program, but right now we don't have the connection for the collected bikes going through a specific program where you're actually teaching youth how to build bicycles and bicycle safety programs. And then at the end of that, they actually have a bike that they've worked on.'",
        "'speaker_3': 'Seems like a great program we should try to put together. I know that's a bigger item than this, but I'd like us to just explore what we could possibly do to reconnect that, and we can do that in some staff meetings over the next couple of months.'",
        "'speaker_3': 'Yeah, I think that that's that's it for now. I think whenever we come back with the bike registry item that we can work together to make that productive. So thank you.'",
        "'speaker_0': 'Thank you. Councilman Austin. Yes, I.'",
        "'speaker_5': 'Am firmly in support of this item. I want to thank the councilmember price for for bringing it forward and happy to sign on and support. We witness this type of activity happening all the time. I live next to a park and I see these these actions happening.'",
        "'speaker_5': 'I can only wonder where these these bicycles are coming from. And I think, you know, by putting some sort of conditions in place, I like the fact that, you know, disassembling and multiple bikes in public is, you know, I think I think that's an obvious, obvious sign that there's something something awry there.'",
        "'speaker_5': 'And this gives our officers a little bit more to to work with in terms of tools. I am concerned with with obviously, the the Prop 47, because I don't know that that, you know, the bicycle therefore reaches that threshold for for a real crime.'",
        "'speaker_5': 'And so maybe you want to speak to that as well.'",
        "'speaker_4': 'Sure. So the individuals who are disassembling the bikes wouldn't actually be charged with bicycle theft if, in fact, it was proven that they stole the bike and the bike's value was $950 or more. It would be a felony.'",
        "'speaker_4': 'It would fall out of Prop 47. But if the value of the bike is $950 or less and the individual is charged with bike theft, so they're caught in the act of stealing the bike or they've admitted to stealing the bike.'",
        "'speaker_4': 'Or there is a witness who comes forward and says they stole the bike. So the police have some indicia of criminal activity that it and it's the bike is under 950, then it would be a misdemeanor. This particular ordinance as as it's requested at this time and again, this is going to go to the city attorney's office'",
        "'speaker_4': '. They're going to do some research, hopefully on best practices and other cities that have bike chop shops, what which ones would pass constitutional muster, etc., and it will come back to us. The actual request right now is that it be penalized as a wobbled let, which means it could either be an infraction or a misdemeanor.'",
        "'speaker_4': 'And the whole point of that is not really to punish people per se, because as you've said, we're not looking at a crime that reaches the threshold where this person is going to get any sort of custody time.'",
        "'speaker_4': 'I mean, even for a misdemeanor, 180 days or less, the L.A. County jail is releasing people on the same day, whether they received one day or 180 days. So we understand that this isn't something that's really looking to penalize.'",
        "'speaker_4': 'However, if an individual is charged with assembling or disassembling bikes, running a bike shop, chop shop, then the individual will have the opportunity to hopefully go through the process where now we're going to have clinicians in the jail as part of our new efforts with the city, and that person could be linked to services.'",
        "'speaker_4': 'What I have found with bike. Chop shops, and certainly not everybody who operates a bike chop shop is addicted to drugs. I'm definitely not saying that. But what I have found is in talking to individuals, reading multiple police reports, is that bike parts are stolen or sold as currency for drugs.'",
        "'speaker_4': 'That's the common most frequent currency for drugs. And so if an individual has a substance abuse problem, then hopefully we're able to get them in the system and root them to services as a term of their probation. So as a term of probation, they would have to do some sort of diversion program or have a stay away'",
        "'speaker_4': 'order from the place where they were storing the bikes, or see the clinician go to L.A. County Health Services, whatever the case may be, to get the services that they might need.'",
        "'speaker_5': 'Thank you. And so my my hope and the reason I'm supporting this is I hopefully deter that activity in and to deter thefts in the future. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. And yes.'",
        "'speaker_2': 'I want to thank Councilwoman Susan Price, because the fact that I really realized the enforcement of this ordinance could aid and possibly reduction and recover stolen property. And thank you again for this item.'",
        "'speaker_0': 'But thank you, Councilman Durango.'",
        "'speaker_2': 'Yeah. I also want to express my support for the sale of my I've been seen as I drive around Long Beach that there's always this assembly of individuals around some bicycle. And I was wondering what was going on.'",
        "'speaker_2': 'And, you know, every time I pass by there, I see an exchange of bicycles taking place and tubes and wheels and all that kind of stuff, you know. So I was I was somewhat amazed that they were doing that.'",
        "'speaker_2': 'They were so brazen, actually doing it in parking lots of liquor stores and markets. And so I'm glad to see that this ordinance coming up. I want to commend the councilmembers for putting this forward and I totally support it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_3': 'Yeah, I just had a question for PD. Do we have the numbers or stats on how many of these bike thefts are actually associated with with drug situation ers?'",
        "'speaker_4': 'Yes, ma'am. We do not have those numbers. The majority.'",
        "'speaker_2': 'Of the time that we're.'",
        "'speaker_4': 'Responding to these bikes, they're not reported stolen. So our hands are tied in what we can and cannot do and some of the questions we can or cannot ask.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Any public comment on this item? Larry Goodin.'",
        "'speaker_2': 'I bring the hammer down this way. First of all, I get Sacramento involved and to anybody guilty of it. We'd have to spend 10000 hours of community service. But the key is getting Sacramento involved. Let them start earning their payroll, their money.'",
        "'speaker_2': 'And again, I'm very serious. 10000 hours of community service. Thank you.'",
        "'speaker_0': 'Thank you. Next week, a police. Rather repeat the name of Jesus.'",
        "'speaker_5': 'Tell my.'",
        "'speaker_0': 'Thing around.'",
        "'speaker_5': 'So see me. Yeah. This is a good thing because I got three of them taken in the last year and a half.'",
        "'speaker_0': 'But I thank you. But I propose you do a set up like those fake cars and everything. They got.'",
        "'speaker_5': 'Me over on Carson and cherry hours.'",
        "'speaker_2': 'And I wasn't in it 15 minutes.'",
        "'speaker_5': 'There's somebody over the L.A. Fitness watching, and they've taken bikes.'",
        "'speaker_2': 'Left and right.'",
        "'speaker_5': 'To the point where.'",
        "'speaker_0': 'People parking their bikes on the inside. So do set ups, put.'",
        "'speaker_2': 'Them on them, wire things, then.'",
        "'speaker_5': 'They're going to come for that. But they've even getting lax. It's like they got a minor sore. So you're gonna have to.'",
        "'speaker_0': 'Do set ups and a lot of them cats.'",
        "'speaker_5': 'Are doing drugs is apathy was going down.'",
        "'speaker_2': 'Check the canals it go straight.'",
        "'speaker_0': 'Downtown that's the whole thing I'm sick of my bikes get mad I got taken.'",
        "'speaker_5': 'By the motel six by. What's that. A cafe next to it. Yeah.'",
        "'speaker_2': 'The load of cafe. Was that. Yes. I'm glad.'",
        "'speaker_5': 'Get out there. Do. This is a good thing.'",
        "'speaker_2': 'Don't take it waste 954 Grand theft now is not 409. It's not.'",
        "'speaker_0': 'Fun anymore. Why not?'",
        "'speaker_5': 'Okay, so anyway.'",
        "'speaker_0': 'Yeah, this is a good thing, so.'",
        "'speaker_5': 'I'm not going to drag this out. Why is she still here? Janine Pierce.'",
        "'speaker_0': 'All right. I got off topic. Okay, well, just keep it on top. Okay, good.'",
        "'speaker_2': 'Keep me on topic. I like the bike thing, but I like an.'",
        "'speaker_5': 'American bike system, not a communist bike system. Okay, no communist bike system. This is real good. And Jeanine still got to go.'",
        "'speaker_0': 'Thank you. Thank you. Make speaker, please. Hi. Curtis Kaiser. I'm a resident in support of Councilwoman Price's proposal. I've gotten a bunch of bikes stolen. I think the city has done a.'",
        "'speaker_2': 'Great job of starting to build out an infrastructure so that bicyclists feel comfortable, excited to go around the city.'",
        "'speaker_0': 'But it's disheartening when you see all the chop shops going around. So I think this is a real step in the right direction.'",
        "'speaker_2': 'I appreciate it. I would recommend or request that we have a lower number than five. We I sometimes see five or more, but I more frequently see two or three. And so if there's any way for us to have an ordinance that penalizes.'",
        "'speaker_0': 'People who are doing two or three instead.'",
        "'speaker_2': 'Of five, I would appreciate that if.'",
        "'speaker_0': 'You're a broken down and your friend's broken down and you're legitimately fixing your bike or one or two, you should do the trick. And I thank you very much for doing this. Thank you. Next speaker, please. Seven words, and so did Democratic Socialists of America, Long Beach.'",
        "'speaker_0': 'As a criminal defense attorney, it goes against everything that I believe in, to support the addition of a criminal an additional criminal offense into our municipal code. However, after reviewing the proposal from Councilman Price, it is obvious that this misdemeanor offense or wobbler, it strikes the right balance between the rights of the homeless of homeless residents within'",
        "'speaker_0': 'Long Beach and the interest of other residents. I urge everyone to take notice of the care and concern the Councilwoman Price has taken into crafting this ordinance, ensuring that there is no way to make sure that this new law could be challenged on the basis of having an illegal, discriminatory effect or impact.'",
        "'speaker_0': 'However, the precision of this ordinance only highlights the existing sections of our municipal code that would not stand up to judicial scrutiny if they were to be challenged in the courtroom, in the courts. As I first told then Vice Mayor Garcia in 2014, Long Beach was for code sections.'",
        "'speaker_0': 'Chapter 10.18, Subsection 040 Living in prohibited women in vehicles prohibited Section 9.4 to subsection 110 capping and in certain prohibited areas. And Chapter ten, subsection 30.090. Special Regulations Against Camping Overnight. All these laws were designed and enforced in a manner that leaves our city vulnerable to a potentially crippling civil suit by homeless advocates.'",
        "'speaker_0': 'Our police department and city prosecutor's offices are also ill equipped to handle these sorts of cases on their own. By their own admission, their sole tools for assisting homeless people that they come into contact with, involving administering citations for infractions or misdemeanors.'",
        "'speaker_0': 'To actually solve the problems of chronic systemic poverty, we need to radically restructure the entire society by written by rebuilding a shredded social safety net and obliterated workers rights movement. But for the purposes of triaging the problems of the homeless homeless people here in this particular city, we need to provide direct financial assistance to these individuals in'",
        "'speaker_0': 'the form of increased general relief from the county and indirect aid from the Health Department and county social services. Social and social worker agencies. Prop 87, for example, was a wonderful law that removed the social stigma of felonies from thousands of people enabling, enabling them to reenter society and contribute positively to their communities.'",
        "'speaker_0': 'It is time of the Council continue this trend away from criminalizing people at the bottom of society by directing the city attorney to remove the aforementioned sections of the medical code and to direct the city manager to provide an assessment of all available funds to see what money can be redirected to the Health Department so they can'",
        "'speaker_0': 'take the appropriate role at the head of a comprehensive anti-poverty program here in the city of Long Beach. Thank you for your time. Thank you. Next speaker, please. Hi. My name is Nick Russo. I'm here representing my employer pedal movement, which is local bike services facility.'",
        "'speaker_0': 'We operate the bike station downtown Long Beach, as well as the interim operations of the bike share system. And we just wanted to voice our support as pedal movement in support of this measure. I think like other speakers before me have noted, it's obviously a huge problem and we see that every day as clients come in, you'",
        "'speaker_0': 'know, remarking on their stolen bikes, which, you know, as much as we appreciate the business, it's a really unfortunate situation to encounter. We share many of the concerns that homeless advocates or other advocates of low income communities may have with ordinances like this.'",
        "'speaker_0': 'But I believe the care that's been put into crafting the proposal does mitigate that issue. We would also just like to recommend a certain language in the proposal that states something more specific other than just bike repair stands.'",
        "'speaker_0': 'We are in the process of rolling out a program for basically mobile bike facilities throughout the city. And while we are a valid business licensed in the city of Long Beach, we just feel that because these facilities will be taking place often in parks and other public spaces, that it may potentially negatively affect our business.'",
        "'speaker_0': 'That being said, because of the considerations built into it already, we're not concerned about that. And I personally would just like to voice my support of this because before I was a resident of Long Beach, I was here visiting and bought a bike and had it stolen during my trip.'",
        "'speaker_0': 'So luckily it was at the end of my trip and I was able to use bike share along the beach. Thank you. Next week, please be here.'",
        "'speaker_3': 'Good evening. My name's Maureen Bailey, and I'm representing the Belmont Heights Community Association, and we just like to share our support of this proposed ordinance. In our view, it takes a reasonable method, another tool in the toolbox to allow our public safety folks to kind of make it uncomfortable for this type of commerce to take place.'",
        "'speaker_3': 'And the fewer places that the commerce can take place, hopefully the fewer times that bicycles will be stolen and chopped up and then resold. So we've got to chip away at the problem if we do want to be a bike capital.'",
        "'speaker_3': 'And I think we're well on our way. Our district has two bike boulevards. They're well-used and we'd like to see more people on their bikes, of course. And we really appreciate our councilwoman taking the lead on this. She listened and we appreciate that the the the ordinance.'",
        "'speaker_3': 'So thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_5': 'Thank you and I appreciate the public comment. I guess my question is to the author or Councilmember Price when one of the speakers mentioned how we got to five or more. Can you can you explain that? And and would you be amendable to this?'",
        "'speaker_4': 'Absolutely. And I appreciated that comment as well. And I have a note here. The reason we chose five, really, it's an arbitrary number. We researched other similar statutes. And I know that our city attorney is always very prudent in his administration of the laws.'",
        "'speaker_4': 'And I wanted to make sure that we put us in a position where we weren't exposing ourselves to potential liability. So one of the things I was going to ask as part of this motion is if we can look at reducing that number to two or three, because that's an excellent point.'",
        "'speaker_4': 'You know, if you're helping your friend with their bike, you've got to. Anything beyond two. We've got an issue here, at least enough PC for the police officers to ask why these people have more than 2 to 3 bikes.'",
        "'speaker_4': 'So I think that's great. Yeah. Thank you.'",
        "'speaker_5': 'I think that's great as well. Thank you.'",
        "'speaker_4': 'Councilman Price. Thank you. And the final thing I was going to add, I was going to make the comment about the number of bikes and also for the city attorney, if it's possible for us to think about wording, that's a little bit broader in terms of the type of apparatus that would be available for individuals to work'",
        "'speaker_4': 'on their bikes to include the types of stations that we talked about. So if we could have something that was more broadly classified as bike repair, facility, stand or station as opposed to just a bike repair stand or station, and that would encompass a more structured bike infrastructure that's designed to allow people to to pull up and'",
        "'speaker_4': 'have their bikes worked on. So obviously, we want to make sure that we're not going after pedal movement for infraction violation or any other facility or organization that's similar to them. But I want to thank the residents of the city, especially the third district, who came out tonight.'",
        "'speaker_4': 'I do hear a lot from you about this issue. This is something we've been working on for a long time. And I want to thank our public works department and our police department because they helped shape the language of this particular proposal.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you, members. Please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. We're going to go ahead and take public comment right now. So we have five speakers so can reside. Larry GOODHEW, Lee, Richmond, Charlie, Jim Oberst and Somer Hanson. So can you up in Larry and Lee, if you could, you know, be prepared to come next.'"
    ],
    "Renaming of Multi-Use Sport Court in Marina Vista Park.": [
        "'speaker_0': 'Everybody else. Summer. Fantastic. So next, we're going to go ahead and take number 16.'",
        "'speaker_1': 'Communication from Councilwoman Price recommendation to refer to the Parks Recreation Commission to consider naming the sports. The Sport Court at Marina Vista Park. The Luke to Sue Johnson Court.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_4': 'Thank you. Vice Mayor, I, I want to I know this is an item that my colleagues will support, but I can't resist talking a little bit about why this item came to be, because this was a very special person in my life and in the life of my community.'",
        "'speaker_4': 'In 2005, a group of third district students, middle school and high schoolers were involved in a youth participatory budgeting program. One important member of the student committee was 15 year old Luke Johnson. Luke was a resident of Alamitos Heights and lived close to the park with his mother, Rena, father Todd and brother Spencer.'",
        "'speaker_4': 'Luke was diagnosed with leukemia at the age of 14 on the very day he started his freshman year at Wilson High School. In 2006, Luke lost his two year battle with leukemia. This journey took him out of school throughout his early high school career.'",
        "'speaker_4': 'The committee became one of the ways that he was able to stay in contact with his peers during his illness and was a responsibility he took seriously. Luke was well-loved in the community and he was a friend to everyone.'",
        "'speaker_4': 'His deeply missed by the community, his peers and his family. In honor of his community involvement and the role that he had and the Marina Vista Sport Court being built, the community has expressed its support for naming the new sport court in Luke Johnson's memory.'",
        "'speaker_4': 'I ask my colleagues to support this item. I have I did ask Luke's parents not to come tonight because I know this is going to go through a process and I don't want them to keep having to come to council meetings.'",
        "'speaker_4': 'Once the process goes through the motions, we will do an official naming at the park and have a lovely celebration with his family and the members of our community.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Austin, very public comment on the same.'",
        "'speaker_4': 'Hello. My name is Alex Phillips and Luke Johnson is a child that lives in my neighborhood. I know his parents, I know his brothers. And I know this would mean a lot to the entire community. And I think it's wonderful that we can do something like this because it was a huge tragedy.'",
        "'speaker_4': 'And thank you, Susie, for bringing it to.'",
        "'speaker_3': 'Something.'",
        "'speaker_4': 'That we could do for Luke and his family. Thank you.'",
        "'speaker_0': 'Thank you. And no further public comment. And I just want to say, Councilmember, I think this is a great idea. I'm happy to vote and support this tonight. And members, please cast your vote. Motion carries. Thank you. Number 15, please.'"
    ],
    "State Legislative Position on SB 827 (Wiener) on Housing Density and Transit.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item number 20.'",
        "'speaker_1': 'Communication from Councilwoman Mango Council Member Super Now Councilman Austin. Recommendation to require City Manager to formally communicate the city's opposition for Senate Bill 827.'",
        "'speaker_0': 'Thank you to her mother.'",
        "'speaker_3': 'Thank you. I think that our message has been heard as we received a call from Senator Reno earlier today and he has agreed to make changes. I do not know what those changes will be yet. He has not opened the door on that yet.'",
        "'speaker_3': 'But I at least appreciate that the work has been communicated, and I think that that is a step in the right direction. I'd love to hear from my colleagues before deciding what we should do related to waiting to hear the amendments and or making a firm disapproval today with the option to.'",
        "'speaker_4': 'Reconsider at a future date should the amendments be appropriate.'",
        "'speaker_0': 'Thank you. Come to Austin. Thank you.'",
        "'speaker_5': 'And I we have a letter before us also before from Senator Wiener requesting that we hold off our decision until he can make appropriate amendments. He is anticipating, making and introducing significant amendments to his bill in late February.'",
        "'speaker_5': 'And so I would think we should, in good faith, allow him that opportunity to make those amendments and then bring this this item back before or refer this issue to the state large committee as well. We could also refer it to state alleged for further deliberations, since the author is asking for more time.'",
        "'speaker_5': 'I just think it is it's a good faith effort. I appreciate the fact that he did reach out. I spoke to him personally just before the meeting and he was pretty emphatic that, you know, he's heard from not only the city of Long Beach and understanding that we're postured to oppose his bill, but other many other cities'",
        "'speaker_5': 'throughout the state as well. And so I think he's heard some of the outcry from from local government. And he understands, hopefully, that that local control is something that we are extremely interested in. And so I would just like to recommend.'",
        "'speaker_5': 'Madam Chair, I mean, not Madam Chair, but the maker of the motion hold over this item until a later time.'",
        "'speaker_0': 'Thank you. Customer reviews.'",
        "'speaker_3': 'Yes. I also really appreciate that he's reached out. I think sending it to committee is a great idea. On my first glance at this, after a couple of conversations outside of just local control, which is what you guys have listed as one of the reasons for not supporting it, I think the impact on affordable housing and the'",
        "'speaker_3': 'lack of community benefits in this bill are really lacking. And so I would hope that we would, as a city, take some more time to put forward some recommendations. So thank you.'",
        "'speaker_0': 'Thank you. Councilmember Sabina, I think it is clear that this doesn't minimize our opposition to the bill as it was written. And here's an actual copy of the letter from Senator Scott Wiener. And so if I guess we'll remain to see if the maker of the motion which direction she wants to take it.'",
        "'speaker_0': 'But I just want to make it very clear that this does not affect our opposition to the original bill. Thank you, Councilman Austin.'",
        "'speaker_5': 'And I was with Mr.. I want to just thank Councilmember Mongo for actually bringing this item forward. This is obviously something that I've heard from constituents about. I think many of us also have as well. This is a hot topic in the city of Long Beach and by bye bye showing our our, I think, interest in opposing'",
        "'speaker_5': 'this bill by bringing this forward, it is certainly going to help the dialog and put us in a better place when talking about this legislation in Sacramento. So thanks again Councilmember Mongo and we will we will operate at your pleasure on on moving forward.'",
        "'speaker_0': 'Thank you as any public comment on this item. Simon Councilmember Mongo.'",
        "'speaker_3': 'I think that I think that this shows that Long Beach is a player in the state and that the things that we do at council matter. This has only been agenda raised for the minimum amount, which is the 72 hours because we had some back and forth on the language of the motion.'",
        "'speaker_3': 'And I think that this has served us well. I think that this letter I will send it out to the community in my newsletter when it comes out next so that the community can see that we're being heard.'",
        "'speaker_3': 'And I would like to bring this back once the amendments have been submitted for our consideration and if at that time Chair of the State Committee would like to have a meeting that same evening, I'm open to that as well.'",
        "'speaker_3': 'And of course we can agenda is that without a recommendation of the council.'",
        "'speaker_5': 'So we want to just send it to the committee.'",
        "'speaker_3': 'I'm open to sending it to committee if you're able to agenda as the meeting before or after it. But before, we would have to stand up and really.'",
        "'speaker_5': 'Work to do that.'",
        "'speaker_3': 'We'll do that with anything.'",
        "'speaker_0': 'Mr. PARKIN.'",
        "'speaker_2': 'If I understand then, is the motion amended then to refer.'",
        "'speaker_0': 'It to committee, or is it received and file and take it up by the committee? What's your refer to?'",
        "'speaker_3': 'Committee referred to committee.'",
        "'speaker_0': 'Committee.'",
        "'speaker_3': 'With a requirement that it must be back before this committee if the committee is unable to meet by March, let's say mid-March.'",
        "'speaker_0': 'Your committee before it comes to committee.'",
        "'speaker_3': 'Great.'",
        "'speaker_0': 'All right, members, please cast your vote.'"
    ]
}