{
    "Report on 2015 Long Beach State Legislative Trip.": [
        "'speaker_5': 'Item one is a communication from Councilman Alston. Recommendation to receive and file report on travel to Sacramento for the 2015 Long Beach State legislative trip.'",
        "'speaker_0': 'Councilmember Andrews. I'm sorry, Austin.'",
        "'speaker_9': 'Thank you for the motion in the second on the item.'",
        "'speaker_0': 'That's what I.'",
        "'speaker_1': 'Thought of.'",
        "'speaker_9': 'Councilmember Andrew. Councilmember Price. I do want to just I wanted to pull this item because I thought it was important enough to just to update the council as well as the public over the fact that the Mayor and I attended our annual trip to Sacramento advocating on behalf of the Long are our Long Beach State legislative agenda'",
        "'speaker_9': '. We met with our Senate pro tem, Kevin de Leon. We met with Senator Laura. We met with Senators Hall and Janet Nguyen, all three senators who represent the city of Long Beach. We also represented met with our state assembly representatives, Patrick O'Donnell, Mike Gibson, and a representative from Assembly Member Renton's office.'",
        "'speaker_9': 'In addition to connecting with our members in Sacramento. We also sat down with the governor's office and the State Department of Finance to go over serious Long Beach issues. We highlighted two bills that were extremely important to the city that we are actually sponsoring this year.'",
        "'speaker_9': 'We have AB 204 authored by Assembly member O'Donnell, which would extend the authority of existing oversight boards in L.A. County and hopefully help continue to expand it to experience dissolution of former redevelopment agencies. We got some very positive news from the Department of Finance as well.'",
        "'speaker_9': 'We also have SB 562, yes, 562, like Long Beach, authored by Senator Lora. And this would specifically support our Civic Center project. I want to just say it was a very productive day. Our mayor exerted great leadership. We made a great statement, I think in the halls of the state legislature.'",
        "'speaker_9': 'Our friends and our representatives are working hard on our behalf there. We also have Mike Arnold and associates who are with us throughout the day and are working there on our behalf every day. And I would be very remiss if I did not recognize Diana Tang for her great efforts in putting this effort together.'",
        "'speaker_9': 'She is our staff who staffs the State Legislation Committee. And so we think I'm just going to ask everybody to give her a round of applause, which he did a great job.'",
        "'speaker_4': 'Thank you, Councilmember. That was very kind.'",
        "'speaker_9': 'With that, I've moved the item or it's been moved. I would ask for your support.'",
        "'speaker_0': 'Thank you. Councilmember Austin, is there any member of the public that wish to address this council on item one? See nonmembers. Cast your vote. I'm sorry.'",
        "'speaker_5': 'Councilman Alston. Motion carries six.'",
        "'speaker_4': 'Zero.'",
        "'speaker_0': 'And before we move on, Madam Clerk, is there an ETA on them, on the mic, or would we like our council members to move? Because I.'",
        "'speaker_5': 'Yeah. If you could move, that would be great.'",
        "'speaker_0': 'Councilmember Orson, are you sitting in the second district or. Oh. That's where we store our handbags.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'Yeah. Thank you. Thank you. I apologize for the delay. It's very I. I could not hear Councilmember Austin, so I thought it'd be best that we get. Proper mix. Okay. Before we take up the regular agenda, as we had announced previously, we're going to hear Ordinance 17.'",
        "'speaker_0': 'Madam Clerk.'",
        "'speaker_7': 'No. We do need items. The rest of the concert.'",
        "'speaker_4': 'Oh, I'm.'",
        "'speaker_0': 'Sorry we didn't do that. Yes, thank you. Consent calendar two through six. Is there emotion?'",
        "'speaker_1': 'So.'",
        "'speaker_0': 'And we need a seconder. Great. There's been a motion by Councilman Andrews and a second by Councilwoman Mongo. So any member of the public that wish to address council on any of the items two through six on consent.'",
        "'speaker_0': 'Seeing none. Members. Cast your vote. You can.'",
        "'speaker_4': 'Okay. Motion carries six zero.'",
        "'speaker_1': 'Oh. Okay.'",
        "'speaker_0': 'Thank you. Now we will go to ordinance 17. And actually, let's just take 2 minutes so we can power up at each of these stations.'"
    ],
    "Ordinance on Animal Regulation Amendments.": [
        "'speaker_5': 'Item 17 is a report from Parks, Recreation, Marine and City Attorney. Recommendation to declare ordinance amending Title six of the Long Beach Municipal Code to make it mandatory for dog owners to spay neuter their pets unless they possess a medical exclusion or exemption.'",
        "'speaker_5': 'And to prohibit the sale of dogs. Cat. Or rabbits in any pet shop retail business or other commercial establishments unless they were obtained from an animal shelter. Humane Society. Rescue organizations operate on the premises, possessing a valid breeding permit rate the first time and later.'",
        "'speaker_5': 'Witness Regular meeting of the City Council for final reading.'",
        "'speaker_0': 'Mr. Chaplin. Or is it? Mr. Stevens.'",
        "'speaker_7': 'Thank you, Madam Vice President, Vice Mayor and member of City Council. I'm going to turn this over to Ted Stevens, who is our Animal Care Services Bureau manager.'",
        "'speaker_11': 'Good evening and thank you, vice mayor and council members. So I'm just going to give you a brief presentation on the ordnance that you have before you. Back in November of 2014, the city council asked the city manager and city attorney to come back with the ordinance for mandatory spay neuter of dogs and to restrict the sale'",
        "'speaker_11': 'of dogs, cats and rabbits in pet shops. And so I'll be speaking on that tonight. So what we're proposing is for a mandatory spay neuter ordinance to become effective on October 1st, 2015. This would allow residents to have an opportunity to come into compliance, give them a little grace, period.'",
        "'speaker_11': 'We're proposing that all dogs must be spayed or neutered by six months of age unless exempted. And it's important to note that we already have a mandatory spay neuter for cats. And cats are at four months of age.'",
        "'speaker_11': 'And we've had this since 2010. So some of the benefits of this is we believe that this will help with pet overpopulation. It's not a panacea, a cure all, but it is another tool in our tool belt to help with the fighting, the pet overpopulation problem.'",
        "'speaker_11': 'We believe that there is a benefit to public safety. Some studies have shown, and according to the ASPCA, that spay and neuter dogs may be less likely to bite and less likely to roam freely. We believe that there is a benefit to the health of dogs.'",
        "'speaker_11': 'Obviously with any surgery, there's always some some minor risk. But I think the consensus is that it's generally an easy, safe procedure and the health benefits greatly outweigh the risks. One retro retrospective study of over 40,000 dogs showed that sterilization increased the life expectancy by 13.8% in male dogs and over 26% in female dogs.'",
        "'speaker_11': 'And there is still a medical exemption available and that I'll be discussing in a later time. So just one more thing on the benefits of spay and neuter. This is from the American Veterinary Medical Association website, and this is quoted from them.'",
        "'speaker_11': 'It says Altered pets make better companion animals by reducing the incidence of many undesirable behaviors, such as heat cycles, roaming, marking aggression. Many of these behaviors lead to people surrendering their pets to animal shelters. The procedure has no effect on a pet's intelligence or ability to learn, play, work or hunt.'",
        "'speaker_11': 'Most pets tend to be better behaved following surgical removal of their ovaries or testes, making them more desirable companions. So I mentioned the exemptions earlier. One of the biggest exemptions is the medical exemption, and this can be permanent or temporary.'",
        "'speaker_11': 'Basically, the medical exemptions are an animal that is incapable of breeding for whatever reason. The other would be that the animal was not suited for surgery and that the surgery would be likely to cause death or aggravate any conditions.'",
        "'speaker_11': 'And so these are exemptions that are made for medical. They be certified by a veterinarian. We also have exemptions for law enforcement, search and rescue or service animals or animals that are bred for these purposes. And we also have an exemption for certified show dogs and competition or herding dogs or breeding stock for these purposes.'",
        "'speaker_11': 'And it's important to note that we do not have an exemption, does not require that the show dogs are actively participating in shows, which is a restriction that's found in a lot of other cities that for various reasons we felt that was maybe a little too strict.'",
        "'speaker_11': 'And we tried to make it as open as we could for the for the certified show dogs. And all of these require documented proof. So as far as the implication of this goes, we're proposing some additional moneys, $5,000 to help with our education, public education outreach.'",
        "'speaker_11': 'We're looking to increase our spay neuter voucher program by $30,000. You know, we have a lot of great partners and some of them are here tonight. Services such as Fix, Long Beach, Friends of Long Beach Animals and just some of our other partners that we deal with on a daily basis that help reach out to the people'",
        "'speaker_11': 'that need financial assistance with getting surgeries done. There are low cost clinics available. Golden State, snip, L.A. and some others that are out there. We've already started researching and looking for grant opportunities and other partnerships where we can bring in more funds from the outside to help with our providing that financial assistance.'",
        "'speaker_11': 'And as far as the enforcement piece goes. We're looking to add one part time license inspector to help just dealing with the with especially the initial part of it getting the the current unaltered animals, getting them in compliance.'",
        "'speaker_11': 'And it's important, though, that our enforcement is really geared towards education and warnings and providing vouchers and and low cost opportunities rather than citations. Citations are there if we need them. But it's really not our focus. Our focus is more about getting compliance and helping the individual pet owners and not coming down on them with the hammer'",
        "'speaker_11': '. Some fiscal and fiscal impact things to be. We have a potential or we have we have a lost revenue as a result of the differential between the unaltered license fee of $95 and the alter license fee of $20.'",
        "'speaker_11': 'And that's estimated to be around 187,000. We have our implement and implementation costs that were in the previous slide that came out to about $56,000. And these costs could be or will be recovered through possibly through an increase in licensing fees, an $8 increase to the altar license fee from 20 to $28, which would increase the senior'",
        "'speaker_11': 'discounted altar license fee from 10 to $14 as they get a 50% discount. And there'll be a $10 increase to the unaltered license fee from 95 to $105 for the people that have the exemptions. And then we're anticipating the additional license canvasser to help bring in additional revenue as well.'",
        "'speaker_11': 'And so moving on to the next aspect, the restrict the sale of dogs, cats and rabbits at pet shops. We're basically proposing that no person or animal shop shall engage in the sale, barter, giving away or transferring of dogs, cats or rabbits unless the person or animal shop sells barters, gives away, or transfers dogs that are bred'",
        "'speaker_11': 'and reared within the city in compliance with Section 616 1900. And that is our breeding ordinance. Dogs, cats are rabbits that are obtained from a publicly operated animal shelter and or dogs, cats or rabbits obtained from a private, humane society or duly incorporated organization devoted to the rescue care and adoption of stray, managed or surrendered animals.'",
        "'speaker_11': 'And we will require a certificate of source for each animal that is displayed or sold at a pet shop. And this would also be effective. October 1st, 2015. And so that's it for my presentation. I'm available for questions.'",
        "'speaker_7': 'And if I may add, we want to thank Vice Mayor Sergio Lowenthal, who actually proposed this and took the lead on this. This is just one more tool for us. It's one more tool for us to reduce the euthanasia rates reduced to the pounds and it's much appreciated.'",
        "'speaker_7': 'Hopefully this will pass and we can, you know, continue our efforts to decrease the euthanasia rates and in mortgage.'",
        "'speaker_0': 'Thank you, George. And thank you, Ted. I wanted to. We have a motion and a second. I know many of you would like to speak. I just wanted to start off the conversation, if I may. We've started we started working together on this issue probably as early as 2007.'",
        "'speaker_0': 'While we're only addressing one aspect of this larger package of animal care reforms that many of you in the audience worked with us in the city and on the council to bring forward. I don't want us to lose sight of the fact that while this is incremental, it comes from a larger narrative and the larger narrative.'",
        "'speaker_0': 'You've already seen many installments come true. We were able to get a city veterinarian. We were able to get licensing. We were able to get lots of things that bring us to this point today. And to not finish this narrative, I think would be really a travesty.'",
        "'speaker_0': 'We've taken animal care in our city not as an issue by issue one particular item by one particular item, but really as that entire narrative. And it started with this city taking a really good look at what its role is when it comes to animal care.'",
        "'speaker_0': 'If you recall, not too long ago, we were our department was called Animal Control. And through an unfortunate situation, which we looked at as an opportunity to reinvent and rebrand ourselves as a compassionate city in this in this arena, we decided that the best name for our department was animal care.'",
        "'speaker_0': 'And I think you were in large part a very, very big part of us being able to do that. But that shifted our entire approach. This is one more way that we are fulfilling our aspiration of being the animal care city and councilmembers.'",
        "'speaker_0': 'I had stated earlier in our meeting in November, Long Beach has done a great deal to increase pet adoptions and decrease the number of dogs and cats euthanized over the last seven years. Mr. Stevens, do you recall the number of animals that we had euthanized in the last recorded year?'",
        "'speaker_11': 'Yes. I actually have that right here. The number of animals.'",
        "'speaker_0': 'Yes, total. Total.'",
        "'speaker_11': 'Was 4054.'",
        "'speaker_0': 'And that was in year 2013.'",
        "'speaker_11': '2014.'",
        "'speaker_0': 'Okay. Thank you. And for a city our size, that's a significant number. But we are able to say that we have, through increased pet adoptions, decrease the number of dogs and cats euthanized over the last seven years. However, we still have a real problem.'",
        "'speaker_0': 'That number is quite a bit less than what it used to be. I think I had read that it was about 21% less than a couple of years previous. Is that correct?'",
        "'speaker_11': 'It is over 1100 less than the previous year. And it's if you were to go back, if you were to go back seven years, it's about half, almost half, almost half.'",
        "'speaker_0': 'That's incredible. So we have done a great job in with you to educate as much as we can. And and while I believe that we must continue to educate, I also think there's a time when we have to stand up and do what is remaining.'",
        "'speaker_0': 'And this is what is remaining in order to capture the balance, the balance that we cannot capture with education alone. So we do still have a real problem with over with pet overpopulation. Knowingly or unknowingly, pet owners are contributing to our own overpopulation and it's become clear that we're not going to adopt our way out of this'",
        "'speaker_0': 'problem. We know that the vast majority of dogs selected or picked up by animal care services are unaltered, and that by reducing the number of animals being impounded, we can focus more resources and volunteer hours on adoptions, public outreach and mobile clinics, which we know all work.'",
        "'speaker_0': 'That said, I'd like to thank our staff for their commitment to initial warnings and education. Rather than heavy fines. And as you heard from Mr. Stevens today, our focus is still on education and not on fines. And I'm pleased to see a recommendation for more funding for the vouchers in support of our community partners.'",
        "'speaker_0': 'And I know many community partners are eager to see that as well, because the services are available and we must help people afford them. I also understand that our own spay and neuter clinic at Animal Care Services is close to up and running, being up and running, is that right?'",
        "'speaker_0': 'And that's very exciting. Finally, we've had a lot of support from various individuals, a couple of retired veterinarians, certainly, who've guided us through this entire process. I'd like to personally thank Dr. Larry Cosman, who is probably surprised that I'm calling him out, but he has been with me and my office since day one on this issue.'",
        "'speaker_0': 'That's probably the first few months after his retirement. So there's no rest for the weary. But I want to thank you for your commitment to this issue and really educating all of us on what the right direction is.'",
        "'speaker_0': 'There is no panacea, but there is a right direction and we have been moving in that direction for quite some time. Sometimes we don't get it 100% right, but we are always moving in the right direction. I think staff has done a great job of hearing the concerns from both sides of this issue and presenting us with'",
        "'speaker_0': 'exemptions for various types of dogs, whether they're part of a national or international organization. Service herding. We heard from a hurting last time supporting or even have a medical concern. Ultimately, my co-sponsors and I believe this ordinance is another measured step in our attempts to go from a reactive to a proactive system.'",
        "'speaker_0': 'And so before I turn this over, we have several speakers. I do have a few more questions. I'd like to know if by warnings if our warnings include some timetable for the resident to get their animal fixed before the fine is assigned.'",
        "'speaker_0': 'I know you would extended you mentioned a grace period.'",
        "'speaker_11': 'Yeah. I think our initial policy that we're looking at is probably 60 to 90 days and then we could provide extensions if they have, you know, circumstances beyond their control. We want to work with them and ultimately help them any way we can.'",
        "'speaker_0': 'We appreciate that. And are animal license inspectors able to provide vouchers out in the field while they're as part of their canvasing since they're already out there?'",
        "'speaker_1': 'Yes. Okay.'",
        "'speaker_0': 'And I also understand there are a few studies recommending that owners of large breed dogs wait until they're about 12 months of age to be spayed or neutered. Would this require a simple communication, a written notice from the veterinarian for an exemption?'",
        "'speaker_11': 'Yeah, we could. That would be something we definitely considered when we were trying to figure out the age. Six months was definitely the cut off we wanted to use. But we are aware that there are certain issues, like you said, with larger breed dogs and waiting until they're one years old, especially the males more than the females'",
        "'speaker_11': '. And so we definitely had that medical exemption where the veterinarian could certainly give them a temporary exemption and allowed to wait until they're one year old. And that would not be a problem.'",
        "'speaker_0': 'When pet owners are licensing their pets, they identify the breed, correct. Would it be easier on the the pet owner if there were certain breeds that were identified as large breeds? Rather than asking for a medical exemption that we identify with in conjunction with vets, what those breeds might be?'",
        "'speaker_0': 'Is that a case that.'",
        "'speaker_1': 'We can do that?'",
        "'speaker_0': 'I think that would make it easier for the pet owner otherwise and easier for staff. You would not get the multitude of exemption requests. I think we like our big dogs in Long Beach. And finally, how do we handle unaltered dogs that are picked up by animal care but their owners come to reclaim them, which happens a'",
        "'speaker_0': 'lot. And I think it's important for us to know.'",
        "'speaker_11': 'I'm sure it's going to work.'",
        "'speaker_0': 'But how do we rate? How do we handle when we pick up dogs that are unaltered and then when their parents come to pick them up.'",
        "'speaker_11': 'Currently or after this ordinance or.'",
        "'speaker_1': 'Both?'",
        "'speaker_11': 'Well, currently they would come to redeem them. There is actually a penalty, a state penalty for an altered animals found at large. And in the future it would be if this were to pass, it would be simply the same way we would have come across.'",
        "'speaker_11': 'And this is probably how most of the enforcement would come about. Is the animal being impounded as we would? We would give them all the resources to get the get it done at a low cost or free somewhere.'",
        "'speaker_11': 'And then we would give them the same timeline, the warning, and work with them on the timeline to get that done.'",
        "'speaker_0': 'So we're still working through the education. Yes. Thank you, Councilmember Mongo.'",
        "'speaker_4': 'Thank you, Vice Mayor. Many of you know, the animal community is one that I am particularly attached to, having served as the budget manager for L.A. County Animal Control for several years. That agency in pounds 100,000 live animals a year and is one of the largest animal agencies in the world.'",
        "'speaker_4': 'And so the changes that we're able to make here that make a difference in the lives of the animals in Long Beach are really, really important to me. With that, I will pass it along to some of my colleagues because I've queued up later in the queue.'",
        "'speaker_0': 'Okay. Councilmember Andrews?'",
        "'speaker_3': 'Yes. Thank you, vice mayor. You know, I think the individuals who are in the audience, you know, for the shortness, I think you can see our vice mayor has compassion when she speaks about this, because the fact that I just heard her say.'",
        "'speaker_3': 'The dogs that are lost and when their parents come pick them up. So if you choose care, that is going to show you that this is your kid. So. And one of my main concerns, of course, is the cost and spreading of nutrition.'",
        "'speaker_3': 'And, you know, the pet owner, you know, because we have a number of senior citizens and low income individuals in our city that have pets in their compassion. So I am pleased to see that the $30,000 voucher plan has been implemented and to help these individuals and truly, you know, will vote in favor of this item.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Just briefly, Councilmember Mungo.'",
        "'speaker_4': 'Councilmember Andrew, since you brought it up, I'm in some in-depth meetings with Director Stevens. We talked through that the cost of an unaltered animal license with a voucher is actually more expensive. So spay or neutering their pet would actually be less expensive in the long run.'",
        "'speaker_4': 'And as we get through the dialog, you'll see that I had some concerns about the cost of this program as well. And we have some ideas on how we can make sure that that's going to be good for the community and good for the Department of Animal Control, good for the city and good for the residents.'",
        "'speaker_0': 'Council member, Austin.'",
        "'speaker_9': 'Well, I'm encouraged. And when we when this issue first came before the council, I raised a number of concerns regarding the effectiveness of the messaging program. And I know there are many supporters out here. I thank you for coming down here.'",
        "'speaker_9': 'It does make a difference. I see your signs and I feel your your compassion and heart that you have for for for the animals that you you work with. Many of you work in our animal control. Center and you are part of rescue efforts and you adopt and you promote that.'",
        "'speaker_9': 'And so thank you, because you guys are making an impact on our city, our city in a big way, in an important way. But I do still do have some concerns mandatory. Anytime we say mandatory, it becomes very, very intrusive, in my opinion.'",
        "'speaker_9': 'I think this policy, as it's laid out, actually increases the burden on low income and communities that are not so advantaged. Communities of color. Where are the enforcement efforts going to be taking place? More and more, we're going to be talking about an agenda item later, talking about bending the box.'",
        "'speaker_9': 'And and we passed recently legislation to start decriminalizing a lot of things in society. And I think this actually goes in the other direction. I do have a couple of questions, and I raised these questions the last time, but I think it's important that we get these on the record from Animal Care Services.'",
        "'speaker_9': 'Mr. Stevens How many dogs are estimated currently in the city of Long Beach Total? Are there. And I'm speaking of dogs only. I know we're talking about dogs. Cats and. Rabbits tonight.'",
        "'speaker_11': 'Rabbit's estimation based on from the AVMA, they have kind of a formula that they use and total dogs in our community based on the population of the estimated 102,000.'",
        "'speaker_9': 'Okay. 102,000. And how many dogs currently are registered in the city of Long Beach?'",
        "'speaker_11': 'A little over 35,000.'",
        "'speaker_9': '35,000. So that's one third of the total dogs in the city of Long Beach. The register. And of that of the registered dogs. How many dogs are currently intact?'",
        "'speaker_11': 'Little over 3000.'",
        "'speaker_9': '3000. So that tells me that 90% of registered dogs in the city of Long Beach are spayed or neutered. We should be given ourselves a hand as a city because of that. I think that that's a plausible to our Animal Care Services Department, and I think I would applaud this.'",
        "'speaker_9': 'The city council councils before us who made these tough decisions to reduce the registration rates for for dogs that are spay neuter to to to offer such incentives for people to do that. I don't know that if we if we if we show a 90% registration rate, of course, being neutered, that a mandatory policy is actually even'",
        "'speaker_9': 'necessary. This is this is going to be a little costly. We had a budget exercise closed session, I mean, a study session last week that paints a very dim picture for for the future, the next couple of years of our budget.'",
        "'speaker_9': 'The the part the Parks, Recreation and Marine Department has experienced cuts in cuts and cuts there. Their budget hasn't grown over the last several years in any way. But yet we are going to with this action tonight decrease.'",
        "'speaker_9': 'Decrease funding in their budget. And ask for increased cost. That's going to be a budget exercise and it's going to be a values exercise for for this council moving forward. It's and these are not one time funds. This is a structural issue.'",
        "'speaker_9': 'This is this is this is these are structural dollars that are going to be committed here. I do. I do. Favor the restricting the sale of dogs and cats. I think that is absolutely fine. And you know if we want to truly reduce the the.'",
        "'speaker_9': 'The overpopulation of animals in our city. I think that is a noble effort. But to to say mandatory spending, neutering. I think the the the the the data shows in other cities where this has been done. That the the euthanasia rate has not necessarily been decreased.'",
        "'speaker_9': 'It's actually increased. It's created situations where people are no longer taking their dogs, dogs and cats to the veterinarian. Which which impacts the health of the animal. And and it creates a situation where people are more more or less open with with the city of Long Beach.'",
        "'speaker_9': 'I'm not sure that this is going to get us to the desired result that we're expecting. But, you know, I'm open to hearing from my my council colleagues and the rest of the public to see this.'",
        "'speaker_0': 'Councilmember Mongo.'",
        "'speaker_4': 'So. First, I want to agree with the things that Councilmember Austin said. I've had extended discussions and many of you have been to the parks meetings and the soccer field meetings where we've talked about that the Parks Department is significantly underfunded and thus, as a division of the Parks Department, animal care and Control.'",
        "'speaker_4': 'Animal Care and control subvention rate. I don't want to use dork terms of the budget, but they don't cover their own costs with the revenues that are coming in. And we are not in a position where we can increase the redemption fees because then people give up their animals and that's even worse for the system.'",
        "'speaker_4': 'And so taking this hit of $187,500 annually, if not more, would be a significant hit to the city. And so in talking a little bit with. The City Attorney's office and a colleague. I can't talk with too many colleagues that would violate Brown Act, but a colleague I've come up with some language that really mitigates the concerns'",
        "'speaker_4': 'of anyone who wrote an email. It still gets us into compliance. It rewards those who have been in compliance. And it. Enforces bad, enforces spay and neuter as a mandatory on people who have been non-compliant and or anyone who moves to the city or adopts or buys an animal.'",
        "'speaker_4': 'From this day forward. So what I propose is to add language, which I have been told is not significantly different, so it doesn't have to come back again that an unaltered dog or cat that has a valid I'm sorry, not cat or an unaltered dog that has valid license from Animal Care Services Bureau shall not be subject'",
        "'speaker_4': 'to this section under the license lapse unless the license lapses or expires and or October 1st, 2015, whichever occurs first. So let me tell you what that means, because that's a lot of legal mumbo jumbo. So I wrote it out in in normal terms.'",
        "'speaker_4': 'What that means is that 2500 responsible pet owners who have an unaltered pet who has never gotten out and never been caught by animal control services, can maintain their status with their unaltered license when that animal passes away and or any additional animals are brought into the home and or any animal that gets licensed after the October'",
        "'speaker_4': 'one date, which is when the ordinance becomes effective, it has to be spayed or neutered. There would be no unaltered option. And so what that does is it gradually brings in the policy. It makes it so we don't lose $187,000 in one year putting that burden on the city.'",
        "'speaker_4': 'It still gets us into 100% compliance within one life cycle, and I think that it's a reasonable way to go. How do we feel about that, Vice Mayor Lowenthal?'",
        "'speaker_0': 'I need to ask. I think I saw the city attorney motioning to speak.'",
        "'speaker_7': 'Thank you, Vice Mayor. Remember the council? Councilmember Mongo, if I understand your language, you're talking about an amendment to the draft ordinance, section d d sub paragraph two, and you would be changing the word expires to lapses, is that correct?'",
        "'speaker_4': 'So that. Yes, sir. So it would not be too significant. So it would be able to pass this evening?'",
        "'speaker_7': 'That's correct. But the effect of that change of that one word would allow a pet owner who keeps their license current to maintain their pet in its current condition indefinitely as well.'",
        "'speaker_4': 'If you miss a license renewal, you would lapse and then you would be forced to become spayed or neutered. So as long as you maintained your license in good standing, you would become okay. However, if your animal got out and got to the shelter, that would put you into that other category and therefore it would not.'",
        "'speaker_7': 'I'm sorry. That's correct. But the difference between as written and as your proposed changes, there is now an indefinite period of time in which the owner could, if they follow all the rules, could do that as it's currently written.'",
        "'speaker_7': 'The later of the two dates would be the expiration date of the current license or October of 2015. So I just want to make sure we're clear on what your proposed changes.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'I'm sorry, Mr. City Attorney. And she said whichever comes first.'",
        "'speaker_4': 'So sorry.'",
        "'speaker_0': 'Last. Okay.'",
        "'speaker_7': 'It would be later. Yes.'",
        "'speaker_0': 'So under that, there is a way, as the city attorney said, that families could avoid spay or neutering their animal as long as they kept their licenses current, which is not in the spirit of this item. Is that correct?'",
        "'speaker_0': 'Mr. City Attorney, that was your interpretation.'",
        "'speaker_7': 'The impact of that change? Yes, we did allow the current owner, as long as they follow the rules and pay their license, they would be able to maintain their animal in the current condition.'",
        "'speaker_4': 'So so that's a good point. It only applies to currently registered dogs, so it only applies to the responsible pet owners. None of us here today are after responsible pet owners. We're after the irresponsible pet owner. So that is what I was hoping was still within the spirit.'",
        "'speaker_0': 'I will hear from other council members, but I'm not in support of that at this time.'",
        "'speaker_4': 'She would figure from us of how we feel.'",
        "'speaker_0': 'Mr.. If I could ask Mr. Chapman or Mr. Stephens if you'd like to weigh in on the impact of that. So what we've been doing is not to create necessarily tears of responsibility or tears of, you know, the ethics toward this issue.'",
        "'speaker_0': 'But when it's sort of a granted that we do have these exemptions when when we have a standard, I do think we should apply the standard across the board. Mr. Stevens. Mr. SHARP. Jim.'",
        "'speaker_7': 'Vice Mayor and Member of the City Council, it really is a policy question for a policy issue for the city council. I think at this point there would be kind of a revenue offset if if if you kind of grandfather the those folks in.'",
        "'speaker_7': 'But it really is a policy issue will will adopt whatever the city council wants to you know, will implement whatever the city council must adopt.'",
        "'speaker_0': 'Okay. So that would be according to Councilmember Austin's calculation, about 3000 or so, no. How many licensed in good standing that we have?'",
        "'speaker_11': 'There's license in good standing. I think it is a little over 3000.'",
        "'speaker_0': 'Unaltered is.'",
        "'speaker_4': 'Little.'",
        "'speaker_1': 'Unaltered.'",
        "'speaker_0': 'So those are the only ones that would be in the spirit of assuring that this measure passes. Those would be the only ones impacted by this. Is that correct, Mr. City Attorney?'",
        "'speaker_7': 'That is correct. Ones who are currently licensed animals.'",
        "'speaker_0': 'Okay. Now I understand Councilmember Price.'",
        "'speaker_6': 'Thank you. I want to congratulate Vice Mayor Lowenthal and Councilwoman Mungo, because I know that they were both very involved in this and worked very hard to bring this discussion forward. And I'm opening, too. I'm open to hearing from my colleagues tonight on.'",
        "'speaker_6': 'Councilwoman Mungo's. I guess it's a friendly that she's proposed. I'm not sure. But I think anything we can do to offset the costs, given our financial predicament at the city right now, is something that we should consider. And so in regards to that, I would be supportive of anything we can do to offset the costs.'",
        "'speaker_6': 'And again, I want to congratulate both of you for working so hard on this issue. I know it's something that that you're both very passionate about.'",
        "'speaker_0': 'Mr. City Attorney, did you queue up again? Yes.'",
        "'speaker_7': 'Thank you, Vice Mayor. Just a point of clarification from the council member from the fifth District heads, I believe offered a friendly amendment. I don't know if the maker of the motion has accepted that, but I want to be clear.'",
        "'speaker_7': 'When we're having a council discussion where that sits on the floor, think.'",
        "'speaker_0': 'I'm still listening.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'So it has not been accepted at this time?'",
        "'speaker_0': 'No. We still have council member Austin to speak. Councilmember Alston.'",
        "'speaker_9': 'Thank you. And I'm actually friendly to the friendly amendment, should it be accepted. And if not, I'm prepared to offer a substitute motion to incorporate the Flint friendly amendment. I think it's very important that we not we we recognize the fact that people have been following the law, the law and the policies laid down by this council'",
        "'speaker_9': 'in good faith for for many years. And it's it's somewhat unfair to those responsible pet owners today to change the rules on them mid-stream. Right. For those there's there are two thirds of the dogs in this city. And pet owners in this city are unfortunately, particularly those who own dogs or are not acting responsibly.'",
        "'speaker_9': 'And I think this policy is really meant for those people. But if. In good faith if you've been registering your dog every year. And let's just make it clear. Not everybody who who keeps their dog intact is a breeder.'",
        "'speaker_9': 'Right. Not every intact animal is going to to create a litter. And I'll just be personally. Right. I've owned dogs my entire life, and I've never had a litter. Um, I've never. I haven't always been neutered. My, my, my animals either.'",
        "'speaker_9': 'I have two animals today. I have a girl dog. I have a boy, Don. The girl dog was was a fixed three years ago. I think I'm responsible as a pet owner because I'm not having litters in my in my household.'",
        "'speaker_9': 'And so I think you need to look at the the how this this policy is going to impact our residents, and particularly those who are acting in good faith and who are doing what they're supposed to be doing.'",
        "'speaker_9': 'They are following the law. They are they're feeding their dogs good food every day. They're giving their dogs water. They're taking the dogs for a walk. They're cleaning up after their dogs. And they're not having litters. They're registering their dogs.'",
        "'speaker_9': 'Those people should earn our consideration tonight as well.'",
        "'speaker_0': 'So if I might ask a question and hopefully you'll understand the spirit of this question. What I heard from Councilmember Mongo in the presentation of the friendly amendment was more cost oriented. The concern of the loss of revenue of $187,500 and staff had presented a full cost recovery plan.'",
        "'speaker_0': 'Was that correct?'",
        "'speaker_7': 'Yes, it was.'",
        "'speaker_0': 'Okay. And Councilmember Mongo.'",
        "'speaker_4': 'So I met with Ted and I met with George. And while the prediction is that you would increase license rates for altered and unaltered and senior dogs and that potentially that that could bring in additional revenue, you also have the fear that the people who have their intact animals, again, go underground and then don't renew their licenses'",
        "'speaker_4': 'as a spayed or neutered animal. One of the challenges that we have in the city and in quite frankly, that I significantly helped with when I was with Animal Control, L.A. County is enforcement. Lomis did not even have an enforcement division.'",
        "'speaker_4': 'And so Long Beach contracted with L.A. County for us to come out and do the canvasing in compliance. And so I really feel strongly that we need to do two things. We need to maintain that revenue in the department and use it for additional compliance and additional when animal owners go underground and they don't buy their licenses'",
        "'speaker_4': '. There's also fear that they don't get their animals vaccinated and other things that are even worse for the community. I see your heads nodding. You're in the community that I've spoken to before then. I haven't spoken to any of you specifically, but I appreciate that you're knowledgeable on this issue.'",
        "'speaker_4': 'And so I have any fear. I have fear of reducing any revenue to the department. Any revenue that does come in on top of that would be considered one time revenue, and I hope it would be used for enforcement.'",
        "'speaker_4': 'As I kind of mentioned to Ted in ensuring that this would bring up the status of animal services and the resources we have to ensure compliance. I talked about compliance on the last issue and I'll talk about it again.'",
        "'speaker_4': 'The good animal owners aren't the ones I'm worried about. It's all the others out there that we need to enforce.'",
        "'speaker_0': 'Okay. And I appreciate that. And I and I do think that the concern over the loss in revenue, especially if we're making up for it by increasing fees to folks that are abiding by the rules is a concern as well as just when I heard Councilmember Austin address that, it didn't sound like it was the financial concern'",
        "'speaker_0': ', your primary concern as well, because I heard you relate to your animals.'",
        "'speaker_9': 'I think I raised the financial concern originally. If this is going to cost us about $200,000 a year in implementing this program, and if if the will of this council is to move forward to do that, we need to be looking at everything we possibly can to mitigate those type of losses, because obviously, based on our budget'",
        "'speaker_9': 'outlook in our in our study session last week, we don't really have a lot of room to move.'",
        "'speaker_0': 'Right. And and staff did present a cost recovery plan. But as Councilmember Mongo had expressed, even under that plan, there's still a strain to pet owners. And so I just I want to be sure that we acknowledge staff for not coming here with something that just costs money.'",
        "'speaker_0': 'They actually came here with a full cost recovery proposal as well. We can still direct it however we'd like, but I do think I don't want it to be unsaid that they just dropped a $200,000 loss on our labs.'",
        "'speaker_4': 'But that's definitely not what I intended. All the best cost recovery options are well appreciated and I appreciate the small increase in animal licensing that actually puts us closer to the regional average as we discussed at our meeting.'",
        "'speaker_4': 'And it also trickles away the revenue of the unaltered dogs over time. And so I would hope that our city manager's office, because they are stewards of the public funds and good budget managers, they would never consider the unaltered dog licenses, the variance between the unaltered and the spayed or neutered amount as ongoing revenue.'",
        "'speaker_4': 'Because we would know that not to be the case anymore, because those animals will either pass away or decide to get spayed or neutered. And so I hope that we can maintain that one time funding for them.'",
        "'speaker_0': 'Okay. Thank you. And I am open. Mr. City Attorney. I know you keep looking at me bated breath. I am open to that friendly amendment and would like to hear from. And would like to hear from members of the public on this issue if you'd like to address council on this item.'",
        "'speaker_0': 'We the motion as it stands is to adopt the item with the friendly amendment.'",
        "'speaker_7': 'Vice Mayor Members I can, if I may. After hearing the Council member Austin speak, is it the desire of the Council that this amendment will basically grandfather in the existing owners so that this is effective as of a date certain and that no other new dog owner would be allowed into the have this exemption?'",
        "'speaker_7': 'Is that correct?'",
        "'speaker_0': 'It is. October one is the date. So anyone who is registering their animal.'",
        "'speaker_7': 'Rights prior to October 1st of 2015 and then maintains their license current would be able to maintain that animal. So after October 1st of 2015.'",
        "'speaker_0': 'The deadline, that's the deadline. And so that still leaves us in the 3000 or so unaltered registered animal. So, Judy. I. Yes.'",
        "'speaker_4': 'Good evening, everyone. I'm Judy Crumpton. My address is on file and I reside in Long Beach. And once again, I would like to thank vice mayor and council members, Mongo and Price for bringing this forward. I do want to address a few issues and I want to say that Ted Stevens and vice mayor covered things beautifully.'",
        "'speaker_4': 'So I don't want to, you know, just repeat what you're doing. But real quickly, everyone who is in support, please hold up your posters to show and these are your humane advocates who work every day tirelessly for this community and to save animals lives.'",
        "'speaker_4': 'Also, just real quick, this is kind of a fun thing, but it kind of gives you an idea and this is what I use in humane education and 15 dogs, 45 cats. And you for every person that is born.'",
        "'speaker_4': '15 dogs and 45 cats are also born. So think about that. All the members of your house, how many are there? And we need to do something about this because a lot of this comes from irresponsible pet owners and backyard breeders.'",
        "'speaker_4': 'And tonight we have the opportunity to cut these numbers down. Also, I gave our packets and Mr. Austin, I was rather hoping you in particular would have read the one packet and thank you for bringing up the Santa Cruz situation.'",
        "'speaker_4': 'I do want to say that the American Kennel Club has been telling folks that the that the mandatory spay neuter ordinance in Santa Cruz is not working well in your packets. From Melanie Sobel, the general manager of the Santa Cruz County Animal Shelter, says quite otherwise.'",
        "'speaker_4': 'It's an excellent letter. It addresses all of your concerns, the licensing, the cost, all of it. It's an outstanding letter. It was emailed to you guys a few days ago and it addresses. The AKC has made numerous misrepresentations about the Santa Cruz County animal shelter.'",
        "'speaker_4': 'In its argument against the proposed spay neuter ordinance, the AKC states that the the shelter as euthanasia rates have been essentially flat since 95. As the attached statistics demonstrates, this is incorrect. Both our animal intake and animal euthanasia rates have steadily decreased since 94, the year our county spay neuter ordinance was enacted.'",
        "'speaker_4': 'And it goes on and on. And another real important part Santa Cruz County's animal intake and euthanasia rates have decreased since our mandatory spay neuter ordinance took effect in 94, even with other variables such as adding an underserved area and an oh for the economic recession starting in oh eight and general population growth, mandatory spay neuter is'",
        "'speaker_4': 'an invaluable tool when animals end up at the shelter and when animals are causing problems in the field, it's totally successful. So please do read this before you vote tonight. Mr. Austin Also, I've talked to other general managers of other cities that have mandatory spay neuter.'",
        "'speaker_4': 'They say the same thing. We have lots of organizations that are here tonight. They're going to speak for themselves. Another outstanding letter from an incredible organization, actors and others for animals in complete support of mandatory spay neuter. The support just continues and goes on and on.'",
        "'speaker_4': 'The only way that we are going to put a dent in pet overpopulation is through prevention. Prevention. Don't let the word mandatory shake you up so much. It's really not such a bad, tough word. It has a meaning, that's all.'",
        "'speaker_4': 'For heaven's sakes, get over it. We absolutely need to do this. Can we please give it a try? If it doesn't work, you won't do it. But trust me, it's going to work. Thank you so much.'",
        "'speaker_0': 'Thank you, Judy. Next speaker, please.'",
        "'speaker_6': 'Thank you, vice mayor and council members. My name is Elizabeth Orrick. I'm the national manager of Puppy Mill.'",
        "'speaker_4': 'Initiatives for Best Friends Animal Society. And we are in full support of a retail sales.'",
        "'speaker_6': 'Ordinance for Long.'",
        "'speaker_4': 'Beach. The fact is pet mills, particularly puppy mills, otherwise known as USDA licensed breeders, are in business to supply pet stores because responsible breeders don't sell to pet stores.'",
        "'speaker_6': 'And that's because they don't sell to third parties and because it's not financially viable.'",
        "'speaker_4': 'And this.'",
        "'speaker_6': 'Tenant never sell.'",
        "'speaker_4': 'A puppy to a pet store can be found in every reputable Breeders Code of ethics, including all of the parent breed clubs on the American Kennel Club's own website. And yet there is a humane alternative, which is for those stores to stop supporting the puppy and kitten mill industries by transitioning.'",
        "'speaker_6': 'To an adoption model, as thousands of pet.'",
        "'speaker_4': 'Stores across the country are already doing very successfully. So this ordinance would.'",
        "'speaker_6': 'Not.'",
        "'speaker_4': 'Preclude.'",
        "'speaker_6': 'Pet stores from staying in business. It would not impact.'",
        "'speaker_4': 'Responsible hobbie breeders who could continue to sell directly to the public.'",
        "'speaker_6': 'And of course it would not prevent anyone from adopting an animal.'",
        "'speaker_4': 'Shelters and rescue groups are full of purebred dogs, cats.'",
        "'speaker_6': 'Puppies, kittens and.'",
        "'speaker_4': 'Rabbits looking for homes just like that little guy we saw at the beginning of the meeting.'",
        "'speaker_6': 'And those are the animals that are dying in the highest numbers in our shelters simply because there aren't enough people adopting them and there isn't enough.'",
        "'speaker_4': 'Space to house them all. So does it really.'",
        "'speaker_6': 'Make sense to.'",
        "'speaker_4': 'Keep producing more of a product for which there's already such a surplus that we're killing thousands every.'",
        "'speaker_6': 'Day, 9000 a day in this country? From an economic.'",
        "'speaker_4': 'Standpoint, no. From a humane standpoint, absolutely not. A pet sales ordinance is a fair, effective and reasonable way to prevent an endless supply of poorly bred pets from being imported into this city so that consumers are protected and fewer animals will have to.'",
        "'speaker_6': 'Suffer in order to supply the retail pet trade.'",
        "'speaker_4': 'And to relieve.'",
        "'speaker_6': 'The burden on.'",
        "'speaker_4': 'Shelters and therefore the.'",
        "'speaker_6': 'Taxpayers. By getting companion animals out of those facilities and into retail settings where they have.'",
        "'speaker_4': 'A greater chance of being adopted by the public. That's why 75 other communities across North America have already enacted this, 16 of which are cities and counties right.'",
        "'speaker_6': 'Here in Southern California. So we commend the city of Long Beach for taking this important step to join them. We support you and we thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Hi. My name is me up on Adana. I live and work in District two, so I'm downtown all the time. I'm here today to ask for your protection. And the way you can protect me your constituents is by passing an ordinance that mandates the span neuter of our nonexempt Long Beach Dogs.'",
        "'speaker_4': 'I'm not affiliated with any organizations. I just live and work here. I'm here all the time. I regularly find non speed, non neutered haggard because they've been bred too often, recently pregnant, still nursing dogs on the street. I find them so often, in fact, that I have to carry a leash and treats with me so I can'",
        "'speaker_4': 'help pull them out of traffic or being hit by a car or causing an accident. When I catch these dogs and reach out to no kill rescues, they are so full with other dogs that they can't help me.'",
        "'speaker_4': 'So at that point I have no choice but to call animal care. And when I do that, I know that it may definitely be a death sentence for that dog, especially if it's a little Chihuahua. So I'm put in the awful, painful, heartbreaking situation all the time to either take this dog in knowing that it may not'",
        "'speaker_4': 'come out. Or spends lots of my own money that I don't have because I make 1150 an hour trying to save that dog. So. No matter what, despite the fact that I am a law abiding citizen, that votes, that pays my taxes, that takes care of my own dog, really?'",
        "'speaker_4': 'Well, I lose no matter what. And I lose because uncontrolled, cruel backyard breeders in my neighborhood are hurting me. They do this all the time. When they're done with the dogs, they dump them. It's not fair. I'm sick of it.'",
        "'speaker_4': 'I'm exhausted by it. I'm broke because of it. I'm tired. I'm asking you, please, to do anything in your power to prevent this from happening to me. And I know I'm not the only one. I'm pretty sure every single person in this row and that row goes through the same thing all the time.'",
        "'speaker_4': 'So thank you so much for listening to me.'",
        "'speaker_0': 'Thank you, Mayor. Thank you.'",
        "'speaker_8': 'Hello. My name is Vince Pudsey and I have made on Beach my home for almost 40 years. I am a homeowner, graduate, an alumni member of Long Beach State, and I am also a district leader for the Humane Society of the United States.'",
        "'speaker_8': 'I represent our Congressional Congressional District, District 47. Since I chose Long Beach to be my home, I have witnessed a number of positive changes as it is a very progressive city that I am proud of. I'm here tonight with my wife and other supporters to urge the City Council to enact the retail pet sales ordinance.'",
        "'speaker_8': 'I'm originally from Saint Louis, Missouri, which sadly has become known as the puppy mill state among animal welfare groups. This is an embarrassing stigma to have the puppy mill industry profits on the misery and suffering of companion animals, primarily man's best friend dogs.'",
        "'speaker_8': 'Some of these animals spend their entire lives in the same cage, enduring horrid conditions. I read somewhere in a survey that Long Beach was the 30th most dog friendly city in the country. And I thought to myself, Which communities are ahead of us?'",
        "'speaker_8': 'We have Dog Beach, Blessing of the Animals, Bulldog Beauty contests, Halloween parades, etc. as established tonight, or mayor or vice mayor and many members of the council or animal lovers. Then there is Dog's best friend, Justin Rudd. We all know and our great great bit too.'",
        "'speaker_8': 'We enjoy Stroll and Savers concerts in the Park, Second Street and the many events that make our city a special place to live. Dogs and the people who love them or a constant at all of these. They are a fabric of our lifestyle.'",
        "'speaker_8': 'Ted Stevens, our animal care director, and his staff are continuously breaking new ground, trying to improve the adoption rate and save lives while lowering the costs at our shelters. Pet stores that obtain animals from unscrupulous breeders are a detriment to our city.'",
        "'speaker_8': 'Besides their support of a cruel compassion as industry, they restrict the number of adoptions of healthy animals from our shelter and other local rescue organizations. Many pet stores have successfully switched from the sale of puppy mill dogs to the sale of rescue shelter animals.'",
        "'speaker_8': 'This process saves the city money from unwanted euthanasia and other burdens and costs to the operation of our city shelter. Virtually all breeds of animals are available from humane and legitimate rescue organizations. Many pet stores across the country have adopt this business model.'",
        "'speaker_8': 'People saw the actual conditions at which these breeding factories operate. This would not even be a discussion. No animal lover would condone these conditions. So I am here tonight to to ask that the ordinance be passed and that we as a city continue to not just do the right thing, but to set an example for others.'",
        "'speaker_8': 'And I applaud the work that's being done by Animal Care, Animal Care Services and the council.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_4': 'Hi, I'm Deborah Turner with Friends of Long Beach Animals. Here to say that, well, if there is no law, of course I'm in support of the ordinance. If there is no change, no law, then there is nothing to enforce.'",
        "'speaker_4': 'And hey, there's no progress in that. Right. So let's let's go ahead and give this a shot. Let's go all the way with it. Let's progress to a kinder, more civilized way of treating our pet overpopulation problem instead of eliminating our wretched refuse of all of the animals that are that are extra and that are at this'",
        "'speaker_4': 'point, throwaway items. Certainly we can find a more civilized way than what we're doing now. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'Good evening, Vice Mayor and Honorable City Council members. My name is Bruce Wieland and I'm here on behalf of Peter's. More than 3 million members and supporters, over 30,000 of whom live in the Long Beach area. Thank you for considering vital amendments to Title six of the Long Beach Municipal Code.'",
        "'speaker_7': 'For the sake of all the homeless animals in Long Beach, I urge you to vote in favor of these proposals. Every day is a matter of life and death for homeless animals. Each and every dog and cat bred and born, whether it's on purpose or by accident.'",
        "'speaker_7': 'And every animal bought from a pet store or breeder often means that an animal who's already waiting for a home in an animal shelter will lose their opportunity at finding one. At PETA, we hear from people in communities all across the country where similar requirements have been passed.'",
        "'speaker_7': 'And we are repeatedly being told that these ordinances are providing the essential tools that allow animal control and shelter workers to better address animal abandonment, abuse and neglect in their communities. The only way to end animal overpopulation is to bring the birthrate down, and mandatory spay neuter ordinances, coupled with the availability of low cost sterilization, does exactly'",
        "'speaker_7': 'that. And fortunately, here in Long Beach, you already have in place these resources for lower and fixed income residents. The euthanasia of thousands of animals at the city's shelters each year, and the suffering of countless other animals who never even make it to a shelter but instead die badly on the streets are all 100% preventable.'",
        "'speaker_7': 'Please vote in favor of these lifesaving measures. Thank you so much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening, council members. My name is Wendy Aragon, and I'm president of Pet Assistance Foundation. We've been active in this community for since 1955, helping people spay and neuter their pets through education. Low cost referral to veterinary clinics.'",
        "'speaker_4': 'And subsidy for those who could not afford to alter their pets. We feel sometimes like we're just we've thrown money at the problem, but we don't get anywhere. We're bailing the ocean out with a thimble. I have turned in a statement from our organization to each of the council members, and we applaud you for bringing this critical'",
        "'speaker_4': 'issue up for public discussion and hope that you vote. And a unanimous yes on this or on these two ordinances. I don't want to be preaching to the choir tonight, but anyone involved in animal welfare knows the suffering that pet overpopulation causes.'",
        "'speaker_4': 'It's already been talked about here tonight. I do want to bring up the point, however, that we feel based on the experience on our hotline and volunteers in the field, that abandonment is on the rise for two reasons.'",
        "'speaker_4': 'Owner turn in fees that animal control requires people dump them rather than pay the 60, 70, $80, whatever it is. And who do they come to? The rescue people. And the rescue people most often are full. Secondly, the public doesn't want to deal with euthanasia.'",
        "'speaker_4': 'Unfortunately. The No kill movement, though it's a wonderful concept. Utopia in many respects has to some extent miseducated the public. The point is, there are not enough quality homes for all these animals. We truly believe the number of discarded animals is much higher than has reported because who's out there in the streets, in the barrios, God knows'",
        "'speaker_4': ', wherever. This morning at 630, I was out near the riverbed on the border of Long Beach and Paramount, picking up a dog that someone had dumped that was dying of distemper. In the words of Dan Knapp, the late former director of Los Angeles Department of Animal Services, breeding animals is a privilege, not a right, because it creates'",
        "'speaker_4': 'dependent creatures for whom someone must ultimately be responsible. With an ordinance as carefully written as yours. There should be no room for a responsible breeder to object. Or a responsible dog club for that matter, or cat fancy or whomever.'",
        "'speaker_4': 'Pet overpopulation is a social problem that requires three different approaches. Education. Legislation with enforcement. And. What's the third thing, dimwit? And low cost sterilization. Oh, my God. I ought to know that since I've been in this since 1969.'",
        "'speaker_4': 'We must not forget that laws in themselves have tremendous educational value in a democracy. They let the community know that the body politic has acted with public input to address a community problem. We are totally in agreement with the pet store ordinance and that's already been addressed here tonight very eloquently.'",
        "'speaker_4': 'We urge you to vote to pass these two ordinances and put Long Beach intact and forgive the pun there and put Long Beach on the map as a beacon of light in a sensible and humane approach to solving a tragic and longstanding social problem in our community.'",
        "'speaker_4': 'Thank you. Good evening, Madam Vice Mayor. Members of the Council. My name is Connie Koehler. I am a member of a team of local dog owners who are very experienced, long time owners and exhibitors who have addressed some of you directly and certainly have met with all of your staffs for all district offices since the beginning of'",
        "'speaker_4': 'January. I am here to oppose the amendment on the basis of being bad public policy for the community and based on the extensive research that our team has done. We will get into the devilish details that Councilman Austin referred to earlier.'",
        "'speaker_4': 'And let me start with refuting Judy Crompton statement that the AKC stated that the Santa Cruz County statistics on euthanasia were essentially flat. Those statistics did not come from Santa Cruz County. They came from the California State Department of Public Health, the Veterinary Public Health Section, the California Local Rabies Control Activities Annual Report dated 2013.'",
        "'speaker_4': 'I euthanized animals in Santa Cruz County in 2006 were 626. In 2013, when this report came out, they were 629. I am a trained economist. That is flat curve. MSN as far as as posing unacceptable cost to municipalities as far as licensing revenue from loss compliance, the average license compliance rates in California jurisdictions without mandatory spay neuter'",
        "'speaker_4': 'are average about 33%. But the average license compliance rates in California jurisdictions with mandatory spay neuter average around 14%. In in L.A. City. In L.A. County. In Sacramento County. Those are all roughly the case. Increased intake and euthanasia rates have led to increased shelter and implementation costs as a result.'",
        "'speaker_4': 'In Lee County, Florida, which is around the city of Fort Myers, Amazon was adopted in February of 2014. The shelter costs rose almost $750,000 in six months. As a result, the ordinance was repealed in November of 2014. In Dallas, Amazon was implemented in 2008.'",
        "'speaker_4': 'Animal control cost increased 22% from that time to 2010, and there was an overall decrease in licensing that reduced revenue by $400,000. In L.A. City, euthanasia rate rates rose from 7000 in 2008 to 9000 in 2011, or 29%.'",
        "'speaker_4': 'So these are not acceptable costs for the city. They are certainly not acceptable costs for citizens. And we urge you to vote now.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_12': 'Good evening. My name is Scott Peterson. I'm a resident of Huntington Beach, but I come to Long Beach almost every week, either on business or for pleasure. I've been reading over this ordinance, and it scares the hell out of me.'",
        "'speaker_12': 'Oh, very first line unaltered. Dogs and cats prohibited, period. No exception for visitors. No exception. If I drive my car through Long Beach, I'm subject that ordinance. Maybe now you'll give me a warning. In two years, when you do something, don't laugh.'",
        "'speaker_12': 'That's it. Read the darn thing. There's no exemption for events. If you want to hold a dog show or a cat show or some type of trial here. You're putting your animal in danger by bringing it here because you would make it subject to mandatory spay neuter law in the city.'",
        "'speaker_12': 'In several places. It refers to a recognized agency without ever defining what the recognized agency is or stating how you become part of it or where it is even found. I looked at the service animal section of this and it's absolute rubbish.'",
        "'speaker_12': 'It violates both California's Civil Code 54, 55 and the ADA type two and three. You can't make your own definitions for these. What you can do is extend it with. Many people have to include service dogs and training psychiatric support dogs, emotional support dogs and other dogs that assist people.'",
        "'speaker_12': 'There is no provision in here for that. Yeah. Those are the main things that I have on on that particular thing. As a previous lady said, speed. Mandatory spay neuter does not really have a good track record when you start looking at the real numbers.'",
        "'speaker_12': 'There's a lot of numbers floating around. But if you talk to people like the AKC or if you talk to some of the other groups, it can actually tell you where the numbers came from. You might be quite shocked at the lack of success.'",
        "'speaker_12': 'Almost entirely. The result is that the costs of enforcement go up and compliance goes down. It's just sad. And I and I want to say in finishing that, I'm in favor of spay neuter. I'm not in favor of mandatory spay neuter.'",
        "'speaker_12': 'I own a large breed. Even going up to a year would be detrimental to me because I own bull mastiffs and they generally mature between two and three years. So what do I do then? Go back and go back and go back and say, oh, yeah, well, it doesn't work.'",
        "'speaker_12': 'It doesn't happen. Anyway, thank you very much for your time.'",
        "'speaker_0': 'Thank you. And before I take the next speaker, I was going to ask Mr. Stevens to. Highlight the part about the exemption for the show dogs and the fact that we have shows in town as well as the exemption for service animals and.'",
        "'speaker_0': 'The others in that category.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_11': 'So I guess I can take these service animals. I mean, our bureau currently already processes licenses and permits for service animals. And so any of those animals that would come to us for that could get that exemption. Just this past weekend, I learned that actually most service animals are spayed or neutered anyway, but that exemption would still'",
        "'speaker_11': 'be there for the service animals. And and so we would follow the federal guidelines for ADA when we issue those permits anyway. So that would just tie in with that. I don't see an issue there. As far as the show dogs, again, we offer that exemption for show dogs and ours is actually more lenient than most of'",
        "'speaker_11': 'the other cities.'",
        "'speaker_0': 'Thank you for that clarification. Next speaker, please.'",
        "'speaker_4': 'Hello. My name is Kimberly Buchanan, and I urge you to vote no on this ordinance. I've lived in Long Beach since 1988, first in District three and now in District five. I'm a small business owner, homeowner. I've spent many hours volunteering at Animal Control when it was over on Spring Street.'",
        "'speaker_4': 'I teach now at the SPCA, at the Pitchford facility, and I've worked in assisted with multiple regional and national rescue organizations. I'm also a part of the group of concerned dog owners who visited with each of your district office staff, either yourself or your staff.'",
        "'speaker_4': 'We presented this document. Hopefully you all have read this document and we outlined very clear revisions or very clear reasons why mandating spay and neuter is not good public policy. We also provided several alternatives that would bring the community, city and animal control together rather than creating a divisive and adversarial relationship.'",
        "'speaker_4': 'The purpose of an animal control facility is to protect its citizens, return lost pets to their homes, shelter those who have no homes, and to prevent animal cruelty. Even with the transfer, as we know of most adoptable animals to the SPCA, L.A. side, according to Director Ted Stevens, in 2013, the city experienced the lowest impound and euthanasia'",
        "'speaker_4': 'rates, as well as the highest adoption rates in 25 years. According to the city's statistics that we were received, 2014 proved to be even better. So good job. My concern, though, other than the issues that we bring up in this document, is the health and safety portion of the animal control purpose.'",
        "'speaker_4': 'We've seen rabies in skunks, distemper in many raccoons. And now typhus is showing up in Southern California. Possum. I've experienced the raccoon issue personally. Shortly after arriving home one evening from being away for the weekend, a sick raccoon showed up at my doorstep.'",
        "'speaker_4': 'I didn't know if it had rabies or distemper. I called for emergency services. The fire department answered, not animal control. There were no animal control officers to come and remove the animal. So I had this animal outside of my door and it wasn't until the next morning and many of my neighbors called Animal Control that they removed'",
        "'speaker_4': 'it. So that is a personal health hazard and a danger to me and my dogs. With only a 30% license compliance of dogs in the city of Long Beach and difficulty enforcing the existing laws, please don't pile more onto the role of our animal control department.'",
        "'speaker_4': 'Instead, focus on incentives for licensing, pets, support and enforce and reinforce the community volunteer spay neuter programs that are working. Good job. And whether it's lack of housing, health, behavior or other costs, find out why people are actually relinquishing their dogs or not reclaiming them.'",
        "'speaker_4': 'There's reasons there addressed those problems. So in closing, by keeping those dogs out of the shelter would open space and save precious resources and save more animals. So in closing, I would ask you, please vote no.'",
        "'speaker_0': 'Thank you. Thank you. Okay. Next speaker, please.'",
        "'speaker_12': 'My name is Judith McMann. I am a lifelong resident of Long Beach, having gone to school here and college here. I own a business in Long Beach and live in the fifth District on my home there for the last 40 plus years.'",
        "'speaker_12': 'And I do have one of the 3000 intact licensed dogs in the city of Long Beach. I also have two spayed dogs, both of whom are licensed. I'm part of the group that present to your staff and or you the packet that you have in front of your head, in front of you.'",
        "'speaker_12': 'We are very concerned about this issue. We all believe in voluntary spay and neuter, and we think that that's something you all should work to support and improve, and we're willing to help you do that. Mandatory spay and neuter does not work.'",
        "'speaker_12': 'As you heard, I agree with my colleagues. We presented it in our packet a number of ways to assist and improve your voluntary spay neuter program, which is working. And I will tell you that the dog community stands behind you and will help increase that.'",
        "'speaker_12': 'We're already looking into grants to assist in raising money to improve that program. So let us work with you. One of the gentlemen earlier said something about a seat at the table. Give us a seat at the table.'",
        "'speaker_12': 'I strongly urge you to vote down this this proposal. However, if you're reluctant to do that. I suggest that you create a group to study this issue in full, considering all the ramifications and and let the stakeholders be involved, including the the people who work to rehome animals, including the people who show dogs, including veterinarians.'",
        "'speaker_12': 'The people who know animals. Let. Let us come to the table. We deserve a seat at the table, too. Thank you.'",
        "'speaker_4': 'Hi. Good evening. My name is Kari, two young, and I'm the director of agility for the American Kennel Club. Our government relations department has sent each of you an official letter. But I wanted to come personally and further explain the opposition of the dog enthusiasts.'",
        "'speaker_4': 'Before I start that, though, I want to note that a second letter was sent to everyone today, March 10th. It was after we received a copy of the letter that Ms.. Melanie Sobel, the director of Santa Cruz County Animal Shelter, sent to each of you.'",
        "'speaker_4': 'We found that it contained a number of false, misleading statements regarding the EC's mission position and statements on canine policy. Ms.. Robles letter claims that the AKC has erroneously reported Santa Cruz shelter statistics in reference to Long Beach.'",
        "'speaker_4': 'In fact, the EC's only communication with the Long Beach City Council were the original letters which we sent, neither of which referenced Santa Cruz. We've not made any statements concerning Santa Cruz, animal shelter, their use, euthanasia or their licensing rates.'",
        "'speaker_4': 'But let me tell you a little bit about myself, which will give you an idea of a lot of people in our dog community. They've been a major part of my life, our dogs, since I started with mixed breed poodle.'",
        "'speaker_4': 'At 12 years old, I've owned and shown also many purebred dogs. Currently at home, we have two rescue dogs, both of whom are spayed. One is a poodle mix, who is an owner turn in due to aggression. The other one is a dachshund mix who was found running on the streets.'",
        "'speaker_4': 'I personally spayed her and then placed her in a home. Unfortunately, that home didn't work out for her. So like a responsible breeder, I said I will take her back, as anyone should do at this point. I am also considered a breeder because in my 40 years of owning purebred dogs, I have bred six puppies.'",
        "'speaker_4': 'Those of us who devote our time, energy and support to the sport of dogs do it for one reason. We love our dogs. If we believe that mandatory spay neuter policies would improve the lives of dogs and their owners, we would not be here objecting today.'",
        "'speaker_4': 'However, the fact is that these laws decrease the opportunity for pet owners to find a healthy, well, well bred pet in their community. And they hurt responsible breeders who are doing things the right way in the agility world.'",
        "'speaker_4': 'Many people choose to not spay and neuter their dogs until they're between 18 months, two years, maybe even older, because we want to make sure the growth plates have closed. It's not just the large dogs, and believe me, it is longer than one year.'",
        "'speaker_4': 'The only way you know is to do an x ray to make sure the growth plates have closed. And it is certainly later. As you know, the AKC held our EUKANUBA championship here for quite a few years. We brought in about $21 million to the city of Long Beach.'",
        "'speaker_4': 'We'd like to consider coming back to Long Beach, but we can't do that with this type of restriction. The AKC and our member clubs in Long Beach area can help improve animal control by providing education and guidance to pet owners.'",
        "'speaker_4': 'Engagement, inclusion and a sense of ownership always gets better results than punitive measures. And I believe that the Department of Animal Care has done a very good job moving in that direction, and so does the AKC, and we'd like to commend them.'",
        "'speaker_4': 'So again, let us be a partner, not an adversary. But we do recommend that you vote no on this. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, Vice Mayor and city council members. My name is Susan Murphy and I am also a member of the Concerned Dog Owners who have visited each of your offices. I'm president of the Orange Coast Bull Terrier Club Secretary and chairman and Health Committee Chair of the Bull Terrier Club of America.'",
        "'speaker_4': 'I'm the liaison to the AKC Canine Health Foundation, as well as trustee, secretary and trustee of the Bull Terrier, Rescue and Welfare Trust. And I'm proud to say that we started that. I was possibly starting I started this group over 15 years ago, and we rescue dogs nationally.'",
        "'speaker_4': 'We are huge group. I've spent 40 years involved in rescue, animal health and welfare, public education, and just enjoying my dogs. When we visited your office speaking to you or your chiefs of staff in order to address.'",
        "'speaker_0': 'The city's voluntary.'",
        "'speaker_4': 'Spay neuter program, which is one of the most successful voluntary programs in California, versus the proposed ordinance, which advocates a mandatory program. When we met, we reiterated the the reported statistics of Long Beach already successful program, as well as documented evidence of many cities that have put a mandatory law into place with terrible results, all of whom'",
        "'speaker_4': 'showed an increase in pounds, an increase in euthanasia, a decrease in adoptions, and finally, a substantial decrease in overall compliance. This decrease in licensing becomes a problem when animal owners to choose to avoid seeing their veterinarians for rabies vaccines in order to remain invisible to animal control for licensing as well as spaying and neutering of their dogs'",
        "'speaker_4': 'and cats. This, on its own could prove to be a huge public health issue for Long Beach and surrounding areas, since there have been a rise in the reported report of rabid raccoons as well as distemper with skunks in the area.'",
        "'speaker_4': 'During our meetings, we also presented several solutions and suggestions for alternatives to enhance the city's already.'",
        "'speaker_0': 'Successful voluntary.'",
        "'speaker_4': 'Programs, such as increasing the voucher program, opening up the shelter hours to include some evening hours, and exploring possible grants that would be available to aid the city in making their program much more available to all in the low income and senior residents who may have difficulties due to financial and transportation issues.'",
        "'speaker_4': 'We noted in a memorandum from the Director of Parks and Recreation, Recreation and Marine dated February 5th, 2014, to the City Manager, Mr. West, where Mr. Champion congratulates the city on their animal care service accomplishment, stating that the city reported the lowest number of animals impounded in 20 or 25 years.'",
        "'speaker_4': 'The lowest number of animals euthanized in 25 years with euthanasia is 11% lower than 2012. Over 1900 pets were spayed or neutered.'",
        "'speaker_0': 'Dog and cat adoptions.'",
        "'speaker_4': 'Had increased over 33%, and dog and cat transfers and rescues increased by 27%. In this glowing report of long beaches achievements concerning our animals. Never was there any recommendation for an ordinance that even suggested the need for a mandatory program.'",
        "'speaker_4': 'We congratulate Long Beach on its obviously successful voluntary program that is already in place. Therefore, we asked the city council members to vote no on their proposed ordinance and thereby become a leader in California with a documented, voluntary program that has shown continued progress and one that could be a model for all cities in California.'",
        "'speaker_4': 'Excuse me, California.'",
        "'speaker_0': 'And if I could ask everyone who intends to speak to show their hands or queue up, I know it's difficult to stand. Okay. Thank you. Just so we have an idea. Yes, of course. Come on, forward. Okay. So we have about two or three more speakers.'",
        "'speaker_4': 'Okay. Good evening, everyone. I'm. My name is Luis de Waal, and I've been an animal control professional since 1980. I began my career in the city of Long Beach, and I'm proud to still be here. I would like to address the audience tonight that I the last time I spoke when we were discussing this prior, I explained'",
        "'speaker_4': 'what a valuable tool it is for our department to have this law on the books. I want to talk about our shelter and how proud we are, as Ted Stevens said about our youth and euthanasia rate decreasing our in pounds going down.'",
        "'speaker_4': 'But it is still a tool our officers need and they need it badly. Take a walk through our kennels.'",
        "'speaker_12': 'And see the Chihuahuas and see the pit.'",
        "'speaker_4': 'Bulls. The majority of them come in intact and not altered. And if.'",
        "'speaker_1': 'We if you say.'",
        "'speaker_4': 'The citizens want to be invisible to animal control because they fear mandatory spay and neuter or mandatory vaccinations, we don't want to be invisible. We want to be in the community helping them with low cost options for Spain and neutering free Spain.'",
        "'speaker_4': 'Neutering, which friends have Long Beach animals, has been offering, letting our officers offer to citizens through coupons to their organization. It's imperative that we get this ordinance out there. Of course, there's people that want to comply with getting their animals spayed or neutered, but they can't afford it.'",
        "'speaker_4': 'We can address that. But there are the people that do not want to spay and neuter their pets because they feel it is their right to have an unaltered animal.'",
        "'speaker_1': 'But just as.'",
        "'speaker_4': 'An example, I was out on a call where a man was so proud because his female pit bull had just had 15 puppies. She had he had intentionally bred her with a neighbor's dog.'",
        "'speaker_12': 'And he had T-shirts.'",
        "'speaker_1': 'Made of the stud dogs.'",
        "'speaker_4': 'Picture on it for all his children to wear. Education, definitely. I tried to help him with education with what what he had done, but unfortunately, he needed enforcement. And the enforcement tool we need is mandatory spay neuter in our city.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_12': 'Vice Mayor Lowenthal, members of the City Council. My name is John Zapp, and I'm a 30 year resident of Long Beach and a homeowner in the fifth District and Councilwoman Mango's neighbor. I'm here today to voice my opposition to the mandatory spay neuter ordinance.'",
        "'speaker_12': 'I urge you to vote it down. Vice Mayor, you began the meeting by thanking the groups here for participating with you in coming up with this ordinance. But I was not included. I am a stakeholder in this ordinance, a very critical stakeholder in this ordinance.'",
        "'speaker_12': 'None of the intact dog owners in this city that are members of any club I'm a member of the AKC of any other organization were extended the courtesy to participate in providing you input into this ordinance. The meetings that many of you attended back in October were a complete mystery to us.'",
        "'speaker_12': 'It's entirely possible that had we been there, we would have been able to discuss with you the fact that we believe in spay and neutering our animals. We believe in that. But we also know that it is unhealthy for some animals.'",
        "'speaker_12': 'Contrary to the common belief that there are no consequences. There are consequences. There are long term health consequences to that. We believe also that the spay and neuter mandatory ordinance falls more severely on those individuals who can least afford to to comply.'",
        "'speaker_12': 'We believe that it imposes the city's judgment on what should be a decision between a dog owner and their veterinarian. The the individuals who right now have intact and unlicensed dogs, you call them irresponsible people and some of them undoubtedly are, but not all of them.'",
        "'speaker_12': 'Many of them are culturally or language, have language barriers, have economic barriers, and are unable to to to spay and neuter their dogs for any number of additional reasons. The data that we presented to you and your staff over the last few months shows that mandatory spay neuter ordinances have not been effective, that the primary reason people'",
        "'speaker_12': 'do not spay and neuter their dogs is their inability to afford it, as well as their inability to know about the requirements for that. That comes not from the American Kennel Club or Breeders that comes from the downtown Dog Rescue Group in Los Angeles, which conducted a pilot program on intake assessments at one of the major shelters'",
        "'speaker_12': 'in the city. That's what they found. We also know that although the American Veterinary Medical Association may believe that spay and neuter ring is beneficial to the animal, their official policy is to oppose mandatory spay neuter ordinance. The Humane Society of the United States came here and spoke on behalf of the the ordinance barring pet sales in'",
        "'speaker_12': 'stores. The U.S. has a policy opposing mandatory spay neuter. Best friends was here. They have expressed opposition to mandatory spay neuter. PETA is the only organization that came here and said we're in favor of it. PETA, in case you wonder, has been classified by the FBI as a terrorist organization.'",
        "'speaker_12': 'And in addition, the state of Virginia.'",
        "'speaker_0': 'Let's respect our speakers time, please.'",
        "'speaker_1': 'I will.'",
        "'speaker_0': 'You are out of time, sir. You're out of time. Thank you. On that note. Thank you. Next speaker, please.'",
        "'speaker_4': 'Hello. My name's Robin Hicks and I'm in the fourth district. I'm a schoolteacher. I'm a lifetime Long Beach resident. I'm wondering if Mr. Stevens could repeat the number of animals that were killed in 2014.'",
        "'speaker_11': '4000 4054 total.'",
        "'speaker_4': '4054 dead animals 4054 dead animals. If we like dogs, if you care about dogs, you care about all dogs. And these dogs that are running loose on the street that are mixed breed dogs. If you care about dogs, no dogs should be having babies.'",
        "'speaker_4': 'I'm driving to work. There's dogs on the left. There's dogs on the right, just like this young woman had mentioned. It's exhausting. It's exhausting because when you drive by and you see these innocent little animals that need your help, you take a detour.'",
        "'speaker_4': 'No matter what you're doing, you're chasing them. They're about to cause accidents. You don't know what to do with them. You have to sometimes take them to the shelter, which puts such an emotional burden on you. I've rescued about 100 animals in the last four years myself.'",
        "'speaker_4': 'If you love dogs, you love all dogs. I keep hearing people talk about the health of dogs. What about the health of the dogs on the street? They seem to be talking about the health of dogs that people want.'",
        "'speaker_4': 'We're talking about the unwanted dogs, those 4000 animals that are getting killed at the pound. If you love them, we need if you love all dogs, we need mandatory spay neuter. The voluntary spay neuter is working to a point, but it's not going to get us all the way there.'",
        "'speaker_4': 'We need mandatory spay neuter. I'm a schoolteacher. I'm all about education. But there's a certain point at which you have to say, this is the way it has to be. We have to try this. We have to have spay neuter.'",
        "'speaker_4': 'It's important. We owe it to those 4000 animals that every single year are being killed. Even if the number is decreasing slightly, the mandatory spay neuter will get us there quicker. It's wrong that these people are standing up for spay neuter.'",
        "'speaker_4': 'Voluntary spay neuter. When the voluntary spay neuter is still resulting in 4000 dead animals, 4000 animals that are getting illegally injected, put in a trash can or whatever's done with them and cremated. It's not right. Long Beach needs to be a compassionate city.'",
        "'speaker_4': 'I'm tired like this woman is tired of rescuing animals and taking care of other people's lack of responsibility, which is everywhere. Thank you. Please vote yes. Thank you.'",
        "'speaker_7': 'Hello. My name is Kelly King. Thank you for your time. I won't take very much of it. I think the thing that hits me here tonight is that everyone, no matter what side, really loves dogs. And I commend everyone for that.'",
        "'speaker_7': 'It's nice to hear the polite arguments because it makes me think differently. The word that made me think the most tonight is when I heard someone refer to dogs as sport. And my wife and I have two dogs that we've rescued and we think of them as the vice mayor said, as children.'",
        "'speaker_7': 'So I think how you vote tonight will decide how people think that Long Beach views their dogs as sport or as children.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_4': 'Hi. My name is Jennifer Johnson, and I come to you tonight as one of your low income constituents, those that you're worried about that can't find or afford the services. They're out there. There's free services, there's low cost services.'",
        "'speaker_4': 'And I live every day around people who refuse to spay and neuter because they can make a quick buck on a litter of puppies. Okay. Now, first of all, let me preface this by saying I used to be against this.'",
        "'speaker_4': 'I used to agree with those who said it's my dog, it's my choice whether I breed this dog or not. But the honor system is not working when I live every single day. I run across 1 to 3 animals, just dogs and many more cats that just have no home because there are not enough.'",
        "'speaker_4': 'The myth that there is a home for every animal is a myth. First of all, it's a myth to begin with. And then when you factor in a good home into that equation, that cuts it down even lower.'",
        "'speaker_4': 'There are too many there are too many backyard breeders that are ruining our breeds, the beloved breeds that we love. There's people out there every day breeding these animals, knowing nothing about what they're doing genetically. Oh, I bought this puppy for $800.'",
        "'speaker_4': 'Let me go back and get a brother or a sister so I can make my money back. Yes, I hear that almost daily. They don't know what they're doing. They're ruining the breeds. They're creating monsters that people want to abolish.'",
        "'speaker_4': 'I'm not for real. For getting rid of all dogs. No. Responsible breeding. Yes. That's great. Love your breed and breed responsibly. And rescue those that need to be rescued. But those of us that are boots on the ground every single day out there in my neighborhood, our low income neighborhoods in Long Beach, we are out there educating'",
        "'speaker_4': 'folks almost on a daily basis how to take what's proper pet care. Some of these people have no clue. And the ones that do, we applaud them and we celebrate them. But we are out there every day seeing the results of ridiculous, careless, money grubbing individuals who have no business owning a pet, let alone procreating something for'",
        "'speaker_4': 'you like its color. It's ridiculous. And we're tired of it. We're tired of cleaning up other people's messes on a daily basis. The founder of my group that I volunteer with, Fix Long Beach, has spent thousands and thousands of dollars on her of her own money on a daily basis, rescuing and cleaning up other people.'",
        "'speaker_0': 'Thank you. Thank you. Thank you so much. Next speaker, please.'",
        "'speaker_8': 'Good evening, counsel. My name is John Gonzalez. I retired from the city of Mission Viejo after working here in the city of Long Beach for 22 years. I started my animal control career back in 1974. I'm kind of here tonight as a very concerned person and an animal lover.'",
        "'speaker_8': 'I'm very frustrated that this has been going on and on and on over every single year. Some of the people here tonight are saying that spay neuter doesn't work. I've listened to every other option over my career, 32 years in animal services, ten years I've been serving as the president of the Los Angeles County Animal Care Foundation'",
        "'speaker_8': '. I also work at the Aquarium of the Pacific. I have a passion for animals. The thing that really frustrates us in this field is that every year we hear the same thing. We've got to do something. We've got to do something.'",
        "'speaker_8': 'For a while there, they they when I first got into the industry or in the business, they came up with reduced fees for their licenses, thinking that that was going to make a difference. It didn't really make much of a difference.'",
        "'speaker_8': 'If an animal was impounded, if it wasn't altered, it would have to be altered before it could be adopted again to someone else. Those things started making a difference. The only thing that's really going to make a difference, the only way you can bring down the unnecessary euthanasia of so many animals throughout these shelters is to have'",
        "'speaker_8': 'mandatory spay neuter. Please, I plead you. I beg you to please pass this ordinance for our future animals, for our children, so that they don't have to go through a world where we're euthanizing animals because they're unwanted.'",
        "'speaker_0': 'They. You.'",
        "'speaker_4': 'Good evening, Counsel and Vice Mayor Lowenthal. My name is Kate Karp, and my address is on record. I definitely support this ordinance. I wasn't when I was a kid. Our family cat was had been spayed and I always wanted kittens.'",
        "'speaker_4': 'So about 45 years ago when I was out on my own, I adopted. I got a cat. Cat had kittens with my intact tom fine, giving them away the first time. The second time a light went on. And I'm so glad it did.'",
        "'speaker_4': 'I had her fixed the next day and I haven't stopped since. When I moved to Long Beach about 25 years ago, I got involved with friends of Long Beach Animals. I learned about the shelter. I learned about the shelter animals and how necessary spaying and neutering is.'",
        "'speaker_4': 'But until I got out on the streets with fixed Long Beach, I got the same idea that this young lady got that Louise to wash said about the, you know, dogs getting hit by cars, cats running around in the streets, people, puppies running into traffic from the riverbed and people just refusing to fix their pets because they'",
        "'speaker_4': 'wanted to sell the litters, as my colleague said. There was one guy we went to. We went to do a house to house a house. We went to deliver information, house to house. And there was one guy that had two dogs.'",
        "'speaker_4': 'Once he told me that he was going to have puppies and he was going to take the mother dog to the shelter because he wanted a puppy. Yes, he did. This is what and this is tenfold. This is what we're faced with.'",
        "'speaker_4': 'Most of the people that come to fix Long Beach and yes, there is affordable spay neuter here. There is no cost spay neuter for the people that you say, we can't get it. We will give it to them.'",
        "'speaker_4': 'They're wonderfully appreciative. They they donate things. They won made us cookies once. But the number that won't let me tell you these are the people that, you know, as Judy said, the puppies and kittens, her puppies and kittens.'",
        "'speaker_4': 'And they're puppies. And kittens are puppies and kittens and. Council member Austen. Yes. That's the 3000 that we worry about, the 3000 intact dogs. And those are the only the ones that we know about. There are so many more that we don't.'",
        "'speaker_4': 'I can't say that this ordinance is going to be a magic pill or that we're going to get 100% compliance. But I'd really like to find out, especially since one of the statements is that it discriminates against people who can't afford the procedures.'",
        "'speaker_4': 'We've got fix Long Beach. There's going to be a spay neuter clinic on the shelter grounds. It's going to be low cost. No argument on the pet check on the pet store section. I'm just I'm really sorry. I wanted to stick to this, but so many things have come out, have come up.'",
        "'speaker_4': 'What I do really want to say is that I think it's absolutely unconscionable that the AKC would practically blackmail us and say, they're not coming.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Sorry. Thank you. Vice Mayor Lowenthal. Thank you, members. My name is Sally Frankel. I have been a member I have been a citizen of Long Beach for 67 years. I have raised my children here. My children actually have stayed with the Lowenthal.'",
        "'speaker_4': 'They have gone to school with the lawn dolls, with John. I'm here to ask you to please do not vote for this. Please reconsider it and rewrite it. Think it out a little bit longer. I am a responsible pet owner.'",
        "'speaker_4': 'I play sports with my pets. My pets are my children. Just ask my daughter, she says. I love the dogs more than I do her. I have also licensed my animals my entire life. That my adult life. One of them was intact and one of them is intact and one of them was not the sport that we'",
        "'speaker_4': 'play. My female is the highest tidal dog in the world. The male who is intact is number 17. I do like the idea that you come up with some kind of alternative to help the responsible owners maintain the health of their dogs.'",
        "'speaker_4': 'Early spay and neuter is not healthy for a dog. I spend a lot of time researching breeds. I have rare breed dogs. Sometimes it takes two years to be able to get a rare breed dog. The reason I seek out the rare breed is because of health issues.'",
        "'speaker_4': 'I lost my one dog this summer and I have been trying to replace her with another family member. I have been interviewed and had to provide references. The scrutiny that I'm going through to get a well bred rare breed dog is almost superior to what it is to adopt a child.'",
        "'speaker_4': 'Because of this ordinance, I was told that I would not be able to get the dog that I have been waiting for because of the mandatory spayed neutering of an early age. Scott Peterson mentioned that the 12 year extension or 12 months extension is not long enough for large read dogs.'",
        "'speaker_4': 'It isn't for lunch for small bridge dogs as well. Growth plates do not come in, do not fully grow. And if you are playing a sport with your dog or running your dog, even if you go to a dog park with your dog, the growth plates are very important.'",
        "'speaker_4': 'And if you spayed or neutered your dog too early, you have lifelong health problems. Why should I spend the time and the money to get a rare breed dog so I will have a healthy dog? If I am forced to expand noon, neuter them earlier than they should be, which gives me lifelong problems.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'Vice Mayor and City Council. Roberto in Washington. Lena maternity leave. I'm sure you're going to get this information. I do have a question to Mr. Stevens. You seem to have some pretty good facts. And out of the 4054.'",
        "'speaker_9': 'Dogs that were euthanized.'",
        "'speaker_12': 'How many were due to bites by history? Temperament. Old age.'",
        "'speaker_3': 'Critical illness or severe injury.'",
        "'speaker_0': 'If staff's not prepared to answer them today are you.'",
        "'speaker_7': 'Need to address the chair.'",
        "'speaker_0': 'Yeah. And so we're we don't take questions from the podium to staff, if you like.'",
        "'speaker_3': 'He pointed out some numbers.'",
        "'speaker_4': 'Sure.'",
        "'speaker_3': 'And I was hoping that he would have that record with him.'",
        "'speaker_0': 'Mr. Stevens. Is that something you have with you? We didn't ask for it.'",
        "'speaker_11': 'So I do have my kennel statistics report from last year. So.'",
        "'speaker_0': 'Okay. Would you like to go ahead and finish your remark? We're not doing question and answer. I'm not.'",
        "'speaker_8': 'I'm not in support of this mandatory ordinance.'",
        "'speaker_3': 'I've been in Long Beach, as you know, a good number of years. I know your family. I know a lot of the council members here.'",
        "'speaker_8': 'So you know my history and you know.'",
        "'speaker_3': 'That I look at facts and I respect facts, not emotions. And I just ask you to.'",
        "'speaker_8': 'Look at the facts and make your decision according.'",
        "'speaker_0': 'Thank you. Thank you. I will go ahead and close the public comment section and call on Councilmember Mongo.'",
        "'speaker_4': 'I hope that we can call for the question after this. I just want to say that I appreciate the dialog between everyone here today. I hope that those who came here in support of spay and neuter recognize that mandatory spay and neuter will be phased in with what sits on the floor today.'",
        "'speaker_4': 'And for those of you who brought up points such as Connie and John in the such that the friendly amendment meets the needs of those requests and questions. Additionally, while we appreciate everyone coming here tonight and spending their time, we we most of I most appreciate those of you who contacted my office in advance so we can'",
        "'speaker_4': 'have a dialog. Because one of the challenges you have with coming to the podium and speaking for 3 minutes is we don't have the opportunity to go get the research and return. I do want to point out a couple of things.'",
        "'speaker_4': 'Those who addressed our office in advance about the concerns related to not having the AKC show in Long Beach. We've alleviated that concern. We've talked with National. All of that is fine. And the Convention and Visitors Bureau has made sure that we are not going to be excluded from that.'",
        "'speaker_4': 'With this ordinance. Additionally information related to. Just appreciating that you're an engaged and responsible community. And we hope that you can understand that this is a process. And we appreciate each and every one of you for coming here, and especially to those of you who listened to the questions and comments made by council members and then worked'",
        "'speaker_4': 'into what you're saying to us about those kinds of items. Because while coming here and speaking on a script is important and valuable, answering our questions and commenting on the things that we're discussing and understanding and through this discovery process is is really poignant.'",
        "'speaker_4': 'And it shows what an educated constituency group you are. So thank you. With that, I hope my colleagues will vote yes.'",
        "'speaker_0': 'Councilmember Austin.'",
        "'speaker_9': 'Thank you and thank you for everybody for coming out and sharing your point of view on this very difficult issue. I wanted to address to one of the speakers earlier who mentioned that the term mandatory shouldn't be considered a scary word.'",
        "'speaker_9': 'And it's not. When the word is actually neutered or the term is neutered. And the policy is not enforceable. And that is where my major heartburn has been with this this policy, not the aim, not the the intent, not the the long term vision to reduce overpopulation of animals, to spay and neuter.'",
        "'speaker_9': 'I support that. I don't support. Policies that are unenforceable. And I have some real concerns with the enforcement here. Somebody mentioned this is a step forward progress and it can be viewed that way. But I think what we're trying to do here tonight and I do applaud my colleagues for for their work on this this issue.'",
        "'speaker_9': 'They're trying to we're trying to do something that's that's that's responsible. And that word has been used over and over this evening. Responsibility in a responsible policy, a responsible animal care services. What would make such services more accessible to the rest of the city as it stands right now?'",
        "'speaker_9': 'The majority of our city don't really have great access to where our our animal care care services is located. I think that impacts our ability to register and have higher registration rates. I think that that that impacts our ability to as a city to to really curb some of the problems that we have with the the euthanasia'",
        "'speaker_9': 'rate, as well as registration rate. And. And such a I don't think the current location is conducive to two working families participating and being responsible like we want them to be. I take, for example, the councilmember addresses residents council member Gonzalez's residence council.'",
        "'speaker_9': 'Were you wrong as residents? My residents, council member Richardson's residents. They all have to drive a considerable amount of way. This this place is located actually on the border of Orange County. Right. And so there's a considerable there's a lot to consider here in moving forward.'",
        "'speaker_9': 'And when I when I when I raised the fact that it would cause an undue burden on on working families, low income families, disadvantaged families. It does. And I think we need to be realistic about that. Somebody mentioned that an honor system is not working.'",
        "'speaker_9': 'You're right. It's not working. It's not working to where it should be working. But there's nothing to, because currently two thirds of the dogs in our city are not registered. The honor system is not working. So why do we think that a mandatory spay neuter policy will work any differently?'",
        "'speaker_9': 'And I haven't heard anything to make me believe that people are going to be more compliant with that than they are with our existing policies in Los. So with that, I'm going to I'm going to vote and I'm going to hold my my nose in doing so, because it's not going to be an easy vote one way'",
        "'speaker_9': 'or another. I do appreciate the friendly amendment that was brought forward because I think it's fair. But I think this this policy is is flawed. I think it's a fallacy to believe that mandatory spay neutering is going to all of a sudden change the way people in Long Beach deal with their pets.'",
        "'speaker_9': 'We have we have an issue with about 60,000 pet owners or 60,000 pets out there that aren't registered today. To me, we should be robust and working very hard to deal with that number as opposed to mandating a spay neuter and neutering policy.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Austin. And I'd like to thank everyone that came to speak on this item, as well as staff and their diligence over the last several years to work on this. There are no further requests to speak, and I want to thank you.'",
        "'speaker_0': 'Are you excited? Mr. Richardson? We are. Thank you. Members, cast your vote.'",
        "'speaker_5': 'Okay. Councilman Alston. She carries it in.'",
        "'speaker_0': 'So since that was the first item, we took off the regular agenda, we have the entire agenda to go through. So if you are interested in staying for the rest of the council agenda, I welcome you to do so.'",
        "'speaker_0': 'If not, we will conduct the rest of our business. Thank you. Thanks for coming here. Thank you. Thank you. Thank you for coming down. All right, Madam Clerk, where are we on the agenda?'",
        "'speaker_5': 'Regular agenda item number seven.'",
        "'speaker_0': 'Is.'"
    ],
    "Update on Assembly Bill 218 Implementation and Impact.": [
        "'speaker_0': 'And if we can just keep our voices as low as possible. Item seven.'",
        "'speaker_3': 'I'm ready.'",
        "'speaker_1': 'Madam Clerk.'",
        "'speaker_5': 'Item seven is a communication from Councilman Andrews and Council Member Richardson. Recommendation two requires City Manager to update City Council on how Long Beach is actively implementing the requirements of Assembly Bill 218. How it is impacting the city, including the date of implementation, particularly as it relates to contractors and report back to the City Council in 30'",
        "'speaker_5': 'days.'",
        "'speaker_0': 'Councilmember Andrews.'",
        "'speaker_3': 'Yes. Thank you. Vice Mayor. In October 2013, Governor Jerry Brown signed Assembly Bill 218, which advocated a discriminate, discriminatory practice in housing and employment opportunities for formerly incarcerated persons in California. AB 218, known as Band The Box Law, warned that the removal of the question regarding conviction from state and county and city, and especially decent jobs for'",
        "'speaker_3': 'convicts and former incarcerated persons. Under AB 218, every county was mandated by the State of California to implement Band the Box by July 1st, 2014. What I am requesting today is an update from the city manager on how the bill is being implemented in our city and how the impact of Long Beach and in particular, how is'",
        "'speaker_3': 'it related to the contractors that the city does business with? I originally asked for 30 days on this item, but I was told that the staff may need more time. So I would like to make a motion to report back in 45 days.'",
        "'speaker_3': 'But.'",
        "'speaker_4': 'What you have.'",
        "'speaker_0': 'There is a second Councilmember Richardson.'",
        "'speaker_10': 'Thank you, Vice Mayor. So I want to thank Councilmember Andrews for bringing this council item forward. I know that I remember when the City of Long Beach looked into discussing this in the past, and we were unsuccessful in bringing this forward.'",
        "'speaker_10': 'But but I'm proud to see that the state assembly, the state legislature went ahead and made this the law of the land ban. Banning the box is the law of the land. And we need to ensure that our city is appropriate, is appropriately interim in implementing this policy.'",
        "'speaker_10': 'Reintegration is a major issue in our community, and reintegration means that we have to provide job opportunities because you can't reintegrate into a community without the opportunity or the means to support or sustain yourself and your families. As a note, just today, there were a number of ministers that talked about project labor agreements.'",
        "'speaker_10': 'Well, that's an example of an opportunity to provide a job to folks who are reintegrating into our community. So that's it. Thank you so much, Councilmember Andrews, for taking the lead on this. And I look forward to hearing back from city staff on their efforts to enforce this and implement this law.'",
        "'speaker_0': 'Thank you. There's been a motion by Councilmember Andrews. Councilman Andrews and Councilmember Richardson. So any member of the public that was to address this body center. Right.'",
        "'speaker_8': 'Good evening, Vice Mayor Lowenthal. Members of the council. I'm with a group called All of US or None. I was here a few years ago in a different capacity. But today I come to address you about this rule.'",
        "'speaker_8': 'And I think, you know, certainly, Councilman Richardson, you raised a point that is true. What is unknown about California is that we have the highest recidivism rate, one of the highest in the United States in terms of people who are incarcerated and who are returned to incarceration.'",
        "'speaker_8': 'Much of that occurs because. The box requirement essentially bans people from being able to get a job. So if you can't get a job, you can't get a student loan, you can't effectively exercise the rights of citizenship. We pretty much steer them right back into incarceration.'",
        "'speaker_8': 'The challenge with that is that you end up spending, in the case of California, $9 billion a year that could go toward college or something else. The bill that was passed in Sacramento, AB 218, did not mandate that the contractors be part of what you do.'",
        "'speaker_8': 'What we would like to see in the 45 days, if it would be at all possible honorable vice mayor and members, is that we create an ordinance because ordinances tend to have some level of permanency. If there's a new council next week, while a B to 18 won't change, the issue relative to contractors would certainly be at'",
        "'speaker_8': 'the option of a succeeding council. And if it's only done as a policy from the city manager, that doesn't make it something that's mandatory, which was not a part of 18. There are a couple of cities in northern California.'",
        "'speaker_8': 'San Francisco, most notably, has a much stronger policy. I don't think we need to go necessarily where San Francisco went, but we can certainly include the contractors. You mentioned earlier about your project labor agreement. All of this, I guess, is it's kind of symbolic that tonight we're talking about banning the box and project labor agreements because I'",
        "'speaker_8': 'think they fit pretty much into the same mode. So with that, if we were able to in the next 45 days, I'm prepared to work with the city manager who I've known for a number of years to make it an ordinance so that it wouldn't be something that could simply be changed if the whim of the council'",
        "'speaker_8': 'change would require a full vote. I appreciate the effort by Councilmember Andrews, who I've known from track and field for a number of years, and I hope that we can make it something that's more permanent so that people could count on that.'",
        "'speaker_8': 'And I thank you for the opportunity to address you this afternoon.'",
        "'speaker_0': 'Thank you. Councilmember Richardson, did you cue up again?'",
        "'speaker_10': 'Yes, I did. I just wanted to acknowledge our former state senator, Rod Wright, who's here with us this evening, who represented portions of Long Beach, including the ninth District in North Long Beach, I believe. I don't remember what the boundaries are, but I believe there were three, which changed a few times.'",
        "'speaker_10': 'But thank you so much for coming out and we appreciate your service.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Councilmember Austin.'",
        "'speaker_9': 'Thank you. And Senator Wright, thank you very much for coming before us today. Yes. I've watched you legislate over the many years that I've been involved in politics. And, you know, I remember working in Los Angeles when you were an assembly member in the 48 Assembly District.'",
        "'speaker_9': 'You you've always been been a stand up legislator, one of the smartest in Sacramento. And it's an honor to have you before us today. I just wanted to speak briefly on this particular issue and say that, you know, I support this coming back in 30 days.'",
        "'speaker_9': 'You know, it merits a very, very careful look. And and as it relates to where we are going with major projects before the city, we should be giving consideration to to everyone and including reducing the recidivism rate. I mean, because at the end of the day, that's, I believe, what this this aims to do more than anything'",
        "'speaker_9': ', reduce risk, to reduce recidivism. I currently say that four times. Yeah, yeah, yeah. My, my, my, my day job. I work with individuals who work in our correctional facilities. And this is always seen as as the the panacea for recidivism, for times getting getting people employed and making them have dignity and value in what they do and'",
        "'speaker_9': 'contributing to society. And so I look forward to a report back in 30 days. I'll be supporting this motion. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'And with that, members cast your vote.'",
        "'speaker_5': 'Motion carries six.'",
        "'speaker_4': 'Zero.'",
        "'speaker_0': 'Thank you. Item eight.'"
    ],
    "Report on Healthy Food and Vending Policies.": [
        "'speaker_5': 'Item H Communication from Council Member Richardson and Councilmen Andrew's recommendation to request a report within 30 days on the city's healthy food and vending policies.'",
        "'speaker_0': 'So Councilmember Richardson.'",
        "'speaker_8': 'Sure.'",
        "'speaker_10': 'Thank you so much.'",
        "'speaker_0': 'So we need a second. I'm sorry. May I have a second? Okay. Thank you.'",
        "'speaker_10': 'Thank you. So in April 2011, the City Council passed a motion sponsored by then council member Steve Neil, and it was sponsored also by Councilmember Andrews Councilmember Lowenthal and Councilmember Garcia to create a healthy food policy based on food served at citywide meetings and food and beverage items in city vending machines.'",
        "'speaker_10': 'It's been almost four years since that that's taken place, and we're at a pivotal moment here in our city where we've achieved great things in terms of our public health policy, in terms of our mobility and an active, healthy eating and active lifestyle.'",
        "'speaker_10': 'So I thought it was appropriate and fitting that these these policies that were developed utilizing best practices in chronic disease prevention efforts that focus on creating healthy food environments in order to impact our population are highlighted. So tonight we're asking for staff report to be to to review these policies, assess their implementation to date to date and'",
        "'speaker_10': 'evaluate their success. So it's important to me considering our our Uptown Beach Streets event that's coming in June, I'd like to I'd like to sort of use that to highlight the fact that Long Beach has been a leader on a number of public health issues and see how we can begin to take another look at these policies'",
        "'speaker_10': 'as we as as the focus in Southern California will be on Long Beach in June. So that's my motion. And I would I would ask for our support. And I want to note that the report should come back to the city council, not not just the two from four.'",
        "'speaker_10': 'We're asking for a city council report.'",
        "'speaker_0': 'Thank you, Councilmember. Councilman Andrews.'",
        "'speaker_3': 'Yes, thank you, Vice Mayor. You know, I definitely want to thank Councilman Richardson for asking me to sign on to this item. You know, being a schoolteacher, I know that the importance of having healthy snacks available for students.'",
        "'speaker_3': 'You know, I you know, I was one of the cosigners on this original item within 2 to 11. So I'm very interested in seeing the results of this request. So I hope things work well.'",
        "'speaker_0': 'Thank you. Mr. City Manager.'",
        "'speaker_7': 'Yes. Vice Mayor. Council members. Councilor. We would like to request perhaps 45 to 60 days to come back if you want a thorough analysis. 30 days is pretty quick with our eight day agenda.'",
        "'speaker_10': 'Sure, I don't have a challenge with that. I would just give you a heads up. There's going to be other ones coming leading up the beach street. So we're going to be highlighting a number of our healthy policies.'",
        "'speaker_10': 'So so I'd love to maybe talk offline about how we can prepare for that ongoing.'",
        "'speaker_0': 'Thank you. Sir, any member of the public that wished to address the Council on item eight, please come forward. State your name.'",
        "'speaker_4': 'Good evening, counsel. My name is Violet Ruiz. I'm the government relations director for the American Heart Association. And we look forward to working with the city of Long Beach to improving healthy vending and snack options. And we commend the council and look forward to the report.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. All right, members, cast your vote.'",
        "'speaker_5': 'Motion carries six zero.'",
        "'speaker_0': 'Thank you. Item nine.'"
    ],
    "Moratorium and Study on Conditional Use Permit Exemptions for Alcohol Related Uses.": [
        "'speaker_5': 'Item nine is a communication from Councilmember Richardson, Councilwoman Gonzalez and council member Urunga recommendation to adopt minute order declaring a moratorium against the issuance of any new exemptions from the see up requirement from those alcohol related uses and directing.'",
        "'speaker_5': 'Department of Development Services and Planning Commission to undertake a study. Pursuant to Long Beach Municipal Code, Chapter 12 21.50 to determine whether or not the city's current zoning regulations related to Kewpie exemptions are appropriate or need further review or modification.'",
        "'speaker_0': 'Councilmember Richardson Sure.'",
        "'speaker_10': 'I'd like to. I'd like to. My motion would be to continue this until date. Certain until date, certain, March 17th.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'And Councilwoman Pryce seconded that. So there's been a motion in a second to continue this to March 17th. And is there anyone that would like to address the continuance? Seeing nonmembers cast your vote.'",
        "'speaker_5': 'Motion carries six zero.'",
        "'speaker_0': 'Item ten.'"
    ],
    "First Substantial Amendment to the FY 2015 Annual Action Plan for HOME Program Income.": [
        "'speaker_5': 'Item ten is a report from Development Services recommendation to prove the first substantial amendment to the fiscal year 2015 Annual Action Plan to allocate new program income in the Home Investment Partnership Program for activities that create affordable housing for low income households.'",
        "'speaker_5': 'Authorize City Manager to execute all necessary documents with the U.S. Department of Housing and Urban Development related to the first substantial amendment and increase appropriation in the Community Development Grants Fund in the Development Services Department by 4 million.'",
        "'speaker_5': 'City Y.'",
        "'speaker_0': 'Councilmember Andrews?'",
        "'speaker_3': 'No, I'm just moving on.'",
        "'speaker_0': 'There's been a motion and a second. So any member of the public that wishes to address Council on item ten. Seeing none. Oh, Councilmember Austin. Sorry. Sorry about that.'",
        "'speaker_9': 'I'd like to get a staff report on this. Sure. $4 million seed funds.'",
        "'speaker_7': 'Amy, Barack.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Vice Mayor, members of the city council. We received an unexpected largesse this fiscal year through the repayment of a loan when the Northpoint apartment project was sold as a condition of the original loan upon refinancing or sale of the project.'",
        "'speaker_4': 'The city's home loan was to be repaid so that we were repaid $4 million in December. That was a significant amount of money that we had not accounted for. And so we needed to amend our action plan with HUD.'",
        "'speaker_4': 'What we have done since then is also take that $4 million and we will be dedicating that money to the anchor project at Villages at Cabrillo, which is a veteran's shelter project that has been entitled by the city and is moving forward and is under construction.'",
        "'speaker_4': 'However, we still have to amend our documents to show that we received the money and that we also are disbursing the money as well.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_9': 'So the North Point Apartments, I do have some some some familiarity with where there were that is I mean, obviously that's in the eighth District. And we are we looking to transfer all $4 million to the the Veterans Home at Cabrillo?'",
        "'speaker_4': 'Yes.'",
        "'speaker_9': 'And and are there any I mean, how do how do we reach that conclusion and why?'",
        "'speaker_4': 'So the responsibility for funding affordable housing projects has been delegated to the Long Beach community, an investment company by the city council. And so they manage the the city's affordable housing program, including the home loan program, which is a federal program.'",
        "'speaker_4': 'Under the HUD Action Plan, we are required to account for significant deviations in our revenue or expenditures. Since the Northpoint was sold, we received those revenues. We were also at the same time, the Long Beach Community Investment Company was considering a request by the villages of Cabrillo for a significant investment in their project as well.'",
        "'speaker_4': 'So that's how that that came about.'",
        "'speaker_9': 'And were there any other housing projects considered?'",
        "'speaker_4': 'We consider new housing projects monthly. The home program is very, very specific on what they can and cannot fund. There's a lot of restrictions related to it. And because we had the ability to fund this project with restricted monies, we took advantage of that opportunity.'",
        "'speaker_9': 'Right. Thank you for the report.'",
        "'speaker_0': 'Thank you. Members, cast your vote.'",
        "'speaker_5': 'Motion carries six zero.'"
    ],
    "Second Amendment to Natural Gas Services Agreement with Shell Energy North America.": [
        "'speaker_0': 'Item 11.'",
        "'speaker_5': 'Item 11 is a report from Long Beach Gas and oil. Recommendation to authorize City Manager to execute a Second Amendment to the Natural Gas Services Agreement with Shell Energy. North America. City.'",
        "'speaker_0': 'Mr. City Manager, do you have.'",
        "'speaker_7': 'You can have Mr. Gardner give a brief report.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'A brief report. As you may know, we import quite a bit of our natural gas supply from out of state. And so we get it from Texas, New Mexico, from Colorado, and also from Canada, Wyoming. And so we have to coordinate those supplies coming into California on the interstate pipelines.'",
        "'speaker_8': 'And then from there, from the California border, it's put on to the Southern California gas company interstate pipeline. And then those volumes have to be transported to the city of Long Beach. So we have to match up our incoming supplies with our outgoing supplies.'",
        "'speaker_8': 'And so we hire Shell to manage that, those volume flows for us.'",
        "'speaker_0': 'Council member, Austin. Now. Okay. So we have a motion by Councilman Andrews, a second by Councilwoman Mongeau. Is there any member of the public that wishes to address the Council on item 11 saying none? Members cast your vote.'",
        "'speaker_5': 'Motion carries six zero.'",
        "'speaker_0': 'Item 12.'"
    ],
    "Alcoholic Beverage License Application for Thai District.": [
        "'speaker_5': 'Item 12 is a report from Please recommendation to receive and for the application of tie districts for an original application of ABC license at 149 Linden Avenue, Suite e District two.'",
        "'speaker_0': 'Thank you. I would like to make a motion to receive and file the application of Thai district for an original ABC license with the following conditions being shared. I think it's already been shared. By the city clerk? Yes.'",
        "'speaker_0': 'And there's been a second to that motion, is there? Any any staff report or just questions.'",
        "'speaker_7': 'Commander for our friends here, if we have any questions.'",
        "'speaker_0': 'I don't have any questions. I'm in support of this item. So any member of the public that wish to address the council on this item seeing none. Members, cast your vote.'",
        "'speaker_5': 'Vice Mayor.'",
        "'speaker_0': 'Lowenthal. I'm sorry.'",
        "'speaker_5': 'Motion carries six zero.'",
        "'speaker_0': 'Thank you. Item 13.'",
        "'speaker_5': 'Item 13 is a report from Please recommendation to receive and file the application of the Breast Lamp Bar Corporation for an original application of the ABC license at 245 the prominent North Suite 100 District two.'"
    ],
    "Resolution to Close West La Reina Way to Vehicular Traffic and Accept Categorical Exemption.": [
        "'speaker_0': 'Item 15.'",
        "'speaker_5': 'Item 15 is a report from Public Works. Recommendation to adopt resolution closing to vehicular traffic. A portion of the public right away, known as West La Reina way between Del Court and Chestnut Avenue, and adopt and accept categorical exceptions.'",
        "'speaker_5': 'Numbers C 42 Dash 12 District one.'",
        "'speaker_0': 'Who's been in motion and a second. Unless there are any questions any member of the public that wishes to address counsel, please come forward. Thank you.'",
        "'speaker_4': 'Good evening, Vice Mayor and City Council. I'll be very fast. I just want to thank everybody for this coming up. We've been waiting a long time for it. We're very grateful to Larry Rich for written in writing the grant.'",
        "'speaker_1': 'That will allow this to happen and we really support it. So thank you very much.'",
        "'speaker_0': 'Thank you. And. Members cast your vote.'",
        "'speaker_5': 'Motion carries six new items.'",
        "'speaker_0': '16.'"
    ],
    "Ordinance for Small Business Pilot Program.": [
        "'speaker_5': 'Item 16 is a report from City Attorney. Recommendation to declare ordinance establishing a Small Business Recruitment, Retention and Growth Pilot Program. Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_6': 'I want to make a correction in the ordinance on page two. Line ten of the ordinance. We want to add the words quote and is a small business, end of.'",
        "'speaker_4': 'Quote, after the word beach.'",
        "'speaker_6': 'Other than that, I'd like to move this item. It looks like it's been seconded. I do want to take a moment to acknowledge and I neglected to do this the last time this issue was before us. But I wanted to acknowledge.'",
        "'speaker_4': 'The work.'",
        "'speaker_6': 'Of Councilmember Urunga for helping us, helping Councilwoman Mongo and I in moving this agenda forward. He sits on the Economic Development Committee with us, and I believe that he is also supporting us in every effort that we can to find incentives and opportunities for small businesses.'",
        "'speaker_6': 'So I want to take a moment to acknowledge him, because I neglected to do that last time. Thank you.'",
        "'speaker_0': 'Thank you. So any member of the public that wishes to address council on this item. CNN members cast your vote.'",
        "'speaker_5': 'Motion carries six zero.'",
        "'speaker_0': 'Item 16.'",
        "'speaker_5': 'We did item 16.'",
        "'speaker_0': 'And we've done item 17.'",
        "'speaker_4': 'That's it.'",
        "'speaker_1': 'Oh. We're going to Cuba. No, I have no announcements. Me neither. Oh.'",
        "'speaker_0': 'I'm in shock. Councilmember Andrews does not have anything.'",
        "'speaker_5': 'We have public.'",
        "'speaker_0': 'Yes, we do have public comment. So we're going to take that first.'",
        "'speaker_4': 'That was the.'",
        "'speaker_0': 'On which one? I apologize. Would you like to come forward? Thank you.'",
        "'speaker_8': 'Yes. Thank you for giving you that. My name is Reggie Carter and I am a homeless vet and I was at the village of Cabrillo as an employee. Also, I was in the program that was funding my college education, which was AmeriCorps while I was there.'",
        "'speaker_8': 'Our funding for AmeriCorps project was was take money was taken out of it by a person that worked at the location to handle the real estate property. And she resigned. And you're sending more money back over to a program that steals from people that are trying to help themselves?'",
        "'speaker_8': 'You know, and I'm just a part of that because right now I'm living with someone and I'm homeless, you know, and I brought this up several times to this board meeting. You know, I sat there for a whole almost hour and something.'",
        "'speaker_8': 'And you speaking about dogs, what about the people laying on the street? You know, I'm really tired of seeing it everyday. I ride the subway train and it's always African-Americans. It's always African-Americans with all this stuff in the seats.'",
        "'speaker_8': 'And then, you know, you tickle them, you know, and then that's revenue. And the same thing. I just saw a Ferguson, you know, and when is this going to stop? You know, if you really care about people. Well, while some of you are adopting these terms to adopt some people, and that's just my opinion.'",
        "'speaker_8': 'I'm sorry. Thank you for allowing me to speak.'",
        "'speaker_0': 'Thank you, Mr. Carter. So under new business. Councilmember Richardson.'"
    ]
}