{
    "Support for CARE Court Framework and Feasibility Study for LBDHHS.": [
        "'speaker_5': 'Fantastic. Thank you. And I was cut off a bit earlier. But but we are going to close in in memory. We do have a closing council district extension facility. We're going to move on to item number 13 and let's do a voice motion.'",
        "'speaker_5': 'I'm pretty sure the council councilmember supervisor was read. It was read the item on 13.'",
        "'speaker_1': 'Communication from councilman super not Councilwoman Allen Councilman Price recommendation to request.'",
        "'speaker_0': 'City Council support.'",
        "'speaker_1': 'For the CARE Court Framework and request City Manager to examine a local program administered by the Long Beach Department of Health and Human Services.'",
        "'speaker_5': 'All right. Council members who bring our motion there. A second here.'",
        "'speaker_7': 'I'll second its price in a pricing.'",
        "'speaker_5': 'Okay. Price. Okay. Let's go ahead, Councilman Supriya.'",
        "'speaker_7': 'Okay. Thank you. I will just read one sentence from the agenda using memo that's also included in the press release from Governor Newsom. The care court framework was created using the evidence that many people can stabilize, beginning healing and exit homelessness in less restrictive community based care settings.'",
        "'speaker_7': 'The plan focuses on people with schizophrenia, spectrum and other psychotic disorders who may also have substance use challenges and who lack the medical decision making capacity and advances and upstream diversion from more restrictive conservatorships or incarceration. And my comments will be brief tonight before I handed over to the second of the motion.'",
        "'speaker_7': 'But that's not because I'm not enthusiastic about this. I can tell you that the governor made his press release on March 3rd, and this item was agenda for this meeting tonight, four days later on March 7th. I firmly believe in this because it represents a paradigm shift in the way we're dealing with this crisis.'",
        "'speaker_7': 'And that's exactly what our constituents have been asking for. I noted in a press Telegram editorial that it was reference that, yeah, this this problem started when our governor, Ronald Reagan, closed all the mental institutions. I'm sure we've all heard that line before, but that if you want to say that he signed a bill rather than veto'",
        "'speaker_7': 'it, the linchpin bill, that was in 1967. So 55 years ago, what has always struck me about that analysis is that we've had seven governors since Ronald Reagan was governor of California and both ends of the spectrum, very conservative to very progressive.'",
        "'speaker_7': 'And I don't think Ronald Reagan was that powerful a judge and we just lacked the will to address this. And finally, Governor Newsom has to tackle this issue head on. And I'd like our counsel to stand in support of that tonight.'",
        "'speaker_7': 'I also want to say that I'm fully aware that this has to be passed by the legislature and all bills are tweaked along the way. But in principle, I'd like us to support it tonight. Also, I added to this that I would like to see local control here.'",
        "'speaker_7': 'The item as presented is not set up that way. It's for counties. But we do have our own health department and I've already talked to the director of Health and Human Services who mentioned to me, well, this is kind of this is a civil court based system, and we don't have that ability.'",
        "'speaker_7': 'But you know what? It's very early on in the process. So all I'm asking is for city staff to work on a system that we might be able to have local control over. So with that, I'd like to hand it off to the Secretary of the Motion.'",
        "'speaker_1': 'Thank you. Thank you. Thank you, Councilman Supernova. And thank you for inviting me to sign on to this item. This is an item that's obviously a very important item in terms of a lot of the things that are happening in the area of criminal justice reform and early interception and connecting people with services rather than causing unforeseen'",
        "'speaker_1': 'or unanticipated negative interactions with law enforcement and the justice system. In recent years, we've definitely seen the landscape change and although many of our state laws have been that have been implemented were done with good intentions, there have been negative consequences of some of those.'",
        "'speaker_1': 'So I'm thankful that the Governor is proposing this new initiative that will help better address the needs of those most urgently in need, those with addiction related issues, those with mental health issues and concerns. Those individuals that struggle to adequately care for themselves and would truly benefit from a focused effort to get them back on the right'",
        "'speaker_1': 'track, will benefit from the judicial intervention that will allow first responders to be able to refer people to the CARES Court program. The CARE Court program will allow for those for whom it may be difficult or even impossible to take the first step towards making major changes to their lives be connected with services in up to 24'",
        "'speaker_1': 'months of care and treatment that will help them lead to a path of stabilization and help fully independent living. The one thing that I think is is really important to note is we have so many different collaborative court processes that are available in the state of California, whether it's homeless court, white court, which is whatever it takes'",
        "'speaker_1': 'court, drug court and now care court are systems that are designed to help support people as they go through a process to connect with services, to get the support they need to be able to transition from one place in their lives to another in a position of strength and support.'",
        "'speaker_1': 'And this seems to do that. Although Councilman supervised, correct? It's so early in the process, I don't know exactly how it's going to work out, but local control would be great. But if CARE Court is similar to any other collaborative court or any other judicial intervention model, it's going to be a collaborative effort that is going to'",
        "'speaker_1': 'have to come through the county in many ways, because the county is going to be the county that places the order upon the individual and orders a specific treatment plan. I know that this process is expected now to start with the legislature, and I know that there's a timeline that's anticipated to go with that.'",
        "'speaker_1': 'My biggest concerns are the costs associated with this. And so I'm hoping that city staff can continue to track this legislation, if we will, if we write this off or if this letter of support so that we're mindful of what those costs will be.'",
        "'speaker_1': 'And we can advocate for L.A. County, which will be the justice system that this CARE court will be administered out of, is sufficiently funded to be able to accommodate all those who might be able to need and benefit from this treatment.'",
        "'speaker_1': 'So I want to thank Councilman Super now for bringing this item forth and really huge applause for the governor for being innovative in terms of connecting people with services that they need. Becoming stabilized, whether it's from substance abuse or mental health, is something that often does require judicial intervention to get people to that place.'",
        "'speaker_1': 'And I'm grateful for this path. Thank you.'",
        "'speaker_5': 'All right. I saw Councilwoman Cindy Allen raise her hand. Councilwoman?'",
        "'speaker_0': 'Yes. I just want to also say thank you to Councilmember Supernormal for including me on this item. We know that a significant number of homeless individuals in our street are in desperate need of additional mental health services and care.'",
        "'speaker_0': 'And this item explores how we can better care for people in need within our community. And the L.A. County Board of Supervisors voted today unanimously to support the CARE Court program. So just thank you again, Councilman Supernormal, for bringing us for this great item.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Thank you. Before we I. I see you councilman's and any other comments inside the chambers?'",
        "'speaker_4': 'I have comments.'",
        "'speaker_1': 'How do we signal to you here?'",
        "'speaker_5': 'I was going to go to the people in the dais first, then we'll come here. So, Councilwoman Durham before.'",
        "'speaker_0': 'Her.'",
        "'speaker_1': 'It's a matter of trust. Okay. So thank you. This hybrid is a learning process. So first one of the thing, councilmember student Sabrina for bringing the item forward with the COA coauthors of the bill. I mean this item, you know, I do appreciate bringing this forward so that we can have conversation about what we're doing in this'",
        "'speaker_1': 'crisis that we have around our homelessness challenge that we face. And I think that while this is early on, I think, you know, we kind of started that conversation with I think the vice mayor had brought kind of a mental health item and how do we localize it from county to mental?'",
        "'speaker_1': 'So I hope that our staff would look into that as well. In addition to how are we going to partner with the state better as part of the housing plan? Because as much as we're able to provide a variety of mental health services that we can look into, ultimately all of them will need homes, stable homes in'",
        "'speaker_1': 'order to be able to recover and I think get back on a healthy path. So I think that to me needs to, in addition, be looked at. And I just want to mention, you know, there is there is a fine line that I'm processing between why I do understand the need to do some level of, you know'",
        "'speaker_1': ', insisting people get services and treatment to whether where it's voluntary. I think it's really important then that we look into it and consider what that means and what that looks like in a way where I think it's respectful for everybody and that's a healthy process.'",
        "'speaker_1': 'Right. So so those are my comment and I look forward and how we can learn more and our local city can can see how we can take steps forward in some of these consideration that we're sharing on at the dias at the moment.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Certainly. Thank you. Councilman Austin.'",
        "'speaker_6': 'Thank you. And also I want to thank Councilmember Supernova in the COSIGNERS for bringing this forward. Obviously, this was I see this as a welcome approach to a very serious mental health and behavioral health crisis facing our streets today and exacerbating our homelessness crisis.'",
        "'speaker_6': 'Make no mistake about it. I want to thank you, Councilman Suber, not for for bringing it up and reminding us that we've been moving forward in a state would have failed realignment strategy for over 50 years now. And I think this really must.'",
        "'speaker_6': 'We need to stop it and stop it now. I will say that I think we need to be fully engaged here at the city council to ensure that whatever is decided in Sacramento, it comes with the necessary local funding support that we need, whether it's going to the county or directly to the city or pass through.'",
        "'speaker_6': 'We have a health department which uniquely positions this city to do a lot more than others. I think we need to look at building capacity for community, community care support, and I know we are doing that simultaneously. And I think this is going to be will require a major reprioritization of our state resources today to provide the'",
        "'speaker_6': 'necessary care to literally thousands of people that are that needed on the streets today. So this item has my support, my full support. And I know that there's going to be a robust conversation in Sacramento in terms of how this looks.'",
        "'speaker_6': 'And I think we as a city council, our city needs to be a major stakeholder at that table. Thanks.'",
        "'speaker_5': 'Thank you, Councilwoman Sylvia.'",
        "'speaker_0': 'Thank you, Vice Mayor, for the opportunity. I just want to give a huge thank you to Councilmember Supernova and Councilwoman Allen and Councilmember Price for bringing this item forward. I think it's very important, especially right now in the times that we are living in right now.'",
        "'speaker_0': 'This is a continuous, continuous problem in the downtown area and in the first district as a whole. One of the things that I feel is that we have individuals experiencing homelessness who are suffering from mental illness and may not have the capacity to accept services.'",
        "'speaker_0': 'But it is our responsibility as leaders to try to help them get off the street and get into on a pathway to secure housing. So I just want to thank you for bringing this up. And Gavin Newsom has in multiple occasions expressed one of his top priorities in the in our state is addressing the growing homelessness concern'",
        "'speaker_0': 'that is impacting nearly every one of our communities throughout the state. And we are and we all know this very well, the pandemic only exacerbated the already existing issue around the need for secure housing, the need to be able to feel safe and decent and living decent standards, and also to please individuals.'",
        "'speaker_0': 'And, you know, with mental health needs in even more vulnerable circumstances, to be able to place them in programs that will uplift them and help them get out of the path that they may be in right now. So with that said, I'm very, very hopeful for this program.'",
        "'speaker_0': 'This is something that we need to focus on. I hope that we continue keeping a close eye on it. But I do have some questions that that maybe you, the staff, might be able to answer some of these questions.'",
        "'speaker_0': 'It may be too early to even have an answer for. But also, these are some of the questions that some of my residents have been asking in regards to peer courts, first of all, and maybe I'll ask in like three questions and then if I have to queue up again, I will.'",
        "'speaker_0': 'But some of my residents would like to know, first off, when with the care for Fremont go into effect, if it comes to the legislature, that may be too early of a question. And also, what does outpatient model look like or can this.'",
        "'speaker_0': 'And if we don't have those answers right now, right now, maybe we can keep an eye out for those answers.'",
        "'speaker_4': 'Our director of Health and Human Services, Kelly Collopy, will do her best.'",
        "'speaker_1': 'Good evening, council members. So the the primary the. So it still needs to go to a vote. And at that point, there will have to be a lot of design and work. So it's not really clear yet as to when it will be implemented.'",
        "'speaker_1': 'We would be working very closely with the county in this process and the ability to look at referral systems and service systems and others as part of that process. And in terms of of outpatients, so it really provides different opportunities for people to engage based on the level of service need.'",
        "'speaker_1': 'So an outpatient opportunity could be, you know, weekly meetings with a counselor. It could be everyday meetings, it could be, you know, multiple days. So it really it can be a lot of different opportunities. But generally, outpatient is not a place that you stay overnight.'",
        "'speaker_1': 'And so it can be you know, there's a lot of other opportunities from there. Um, I don't know. Do you have anything you want to add to that? Okay. Thank you.'",
        "'speaker_5': 'Right. Thank you, Councilmember. Any other comments?'",
        "'speaker_0': 'I was the. Okay. What exactly is the expectations that is being set for the city? How will this seat measure what? Whether or not a local jurisdiction has met their specified duties? And what exactly are those duties?'",
        "'speaker_1': 'And remember, I don't think those are identified yet. So the local jurisdictions for this purpose right now as they're being mined, says County. And so I don't know what at a at a sub a sub local jurisdiction that looks like as a city.'",
        "'speaker_1': 'But we don't have any of those in place at this time.'",
        "'speaker_0': 'Thank you very much. And I knew some of this was premature, that I wanted to get them out there just in case. But thank you very much for your help. And thank you. Thank you. And again, thank you to the maker of the motion.'",
        "'speaker_5': 'All right. Thank you. But in at bat, my support here, I certainly can't support this sort of you know, I'm a family member and, you know, it's hard to the sort of judicial process is very hard to navigate, even for family members who have someone who's sort of caught up in the mental health, drug addiction space.'",
        "'speaker_5': 'It's very difficult to navigate. So having a court that's designed to specialize in this and tap into diversion, I think it makes sense. The governor's bottom line. I thanks counsel Mr. Bernoff for agreeing. Of course, we can endorse the state program.'",
        "'speaker_5': 'In November we took a step. I think this dovetails very well with some of the work that we're doing here in Long Beach in November. We took a step and we asked staff to begin looking at a whole menu of items that we could localize away from the County Department of Mental Health locally.'",
        "'speaker_5': 'And those discussions are going well. And we just did a study. And so my question for staff is how can this dovetail into this broader discussion about localizing mental health and where are we with that, if you could provide an update.'",
        "'speaker_4': 'So this is Tom. I'll start. Yes, we do see that there is synergy here. The council did ask us to look at how we can work on mental health, and this definitely fits into that. And we think this is a very good proposal.'",
        "'speaker_4': 'We do have resources. The council just allocated $100,000 last month to be able to start on that study. And we see moving this kind of components about how we can be involved into that study. So I will turn it over to Kelly to answer more on progress.'",
        "'speaker_1': 'Good evening. So in terms of the parties, we have been hosting meetings both with the Department of Mental Health and we're in sort of spite with the we are meeting with our local mental health representatives as well as those in the Executive Office at the Department of Mental Health, as well as with the Division of Substance Abuse'",
        "'speaker_1': 'or otherwise known as steps within the L.A. County Department of Public Health. So we've been meeting with both of those different teams to look at the ability to streamline resources, understand where the gaps are. We're also moving forward with identifying the advisory committee to this effort, and we anticipate that that meeting will be hopefully in the end'",
        "'speaker_1': 'of April, early May, as we start to move forward. And then we'll also be bringing on a consultant to support those efforts.'",
        "'speaker_5': 'Certainly. And that's all incredible progress. And I think thinking about the way the courts connect to this is incredibly important. So, so good work, everyone. Please remain focused on this mental health localizing the discussion. Was there any public comment on this item?'",
        "'speaker_2': 'If there are any members of the public that would like to speak, please line up at the podium. Or if you're attending, virtually, please use the raise hand feature or dial star nine. CNN. Oh, sorry. We have members in person.'",
        "'speaker_2': 'You have 3 minutes.'",
        "'speaker_0': 'Thank you. My name is Sherry Ingram. I am a resident.'",
        "'speaker_3': 'At Plum with.'",
        "'speaker_0': 'Apartments here on Chestnut. We as neighbors in the area, in the building, we are here as well as the immediate area is concern and question what's become of the vacant store which was once cow.'",
        "'speaker_3': 'Cop. Very nice call. Something else in Spanish I don't know how to pronounce without being embarrassed. It seems like we've getting a lot of runaround. Nobody knows who this person is. The property is a private, private ownership. Well, why can't the private ownership let you all know.'",
        "'speaker_0': 'What's going to be happening with that.'",
        "'speaker_3': 'Particular building? We need a grocery store. We need we need it badly. We got lots of people don't get around, as you see. I am. And a lot of other people. What's going to happen to that particular building that sits on?'",
        "'speaker_3': 'What the old building was. All the building still there? Someone please answer. We need a grocery store. Vons is too far and expensive. And the rest of them all. A little outreach. But for our local, all elderly disability.'",
        "'speaker_0': 'Persons without a car.'",
        "'speaker_3': 'I don't have a lot of money to pay a cab to take him there and then wait around for a cab to bring back home. Les, please find out.'",
        "'speaker_0': 'What's going to happen to this building.'",
        "'speaker_3': 'Someone, please.'",
        "'speaker_5': 'Well, thank you. Where?'",
        "'speaker_0': 'Where we are.'",
        "'speaker_5': 'Well, who I'm thinking of. This public comment is limited to this discussion. Promoted. If you could have a word.'",
        "'speaker_1': 'Miss Tatum is walking over there. Vice Mayor. Miss Tatum.'",
        "'speaker_5': 'Okay, great. Thank you. Is there any other public comment on this item?'",
        "'speaker_1': 'There is no other public comment on this item.'",
        "'speaker_5': 'Okay. Let's go ahead of our roll call vote.'",
        "'speaker_0': 'District one, district two.'",
        "'speaker_1': 'I District three.'",
        "'speaker_0': 'I. District for.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District five. All right.'",
        "'speaker_1': 'District six by district seven. District eight.'",
        "'speaker_0': 'District nine.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Feasibility of Repealing Cannabis Cultivation Tax in Long Beach.": [
        "'speaker_5': 'All right. Item 14.'",
        "'speaker_0': 'Communication from Councilman Austin, Councilwoman Allen, Councilwoman.'",
        "'speaker_1': 'Price Recommendation to request City Manager to investigate.'",
        "'speaker_2': 'The feasibility of.'",
        "'speaker_1': 'Repealing the tax for cannabis cultivation in Long Beach.'",
        "'speaker_5': 'All right, I'll recognize the motion. So moving in motion often. John Allen went off the air before.'",
        "'speaker_6': 'Thank you so much. And so I just wanted to bring this motion forward. This item aims to understand the impact of eliminating the cannabis cultivation tax in Long Beach. Well, actually, since voters passed the measure in May in 2016, our city's cannabis cultivation businesses have been charged $12 for every square foot of product under cultivation.'",
        "'speaker_6': 'They also pay $161 per pound of dried cannabis flower to the state over the tax overtaxation. Obviously can be a barrier for potential cultivators and is a burden to current operators in our city's cannabis industry. So I'm told fees associated with cannabis cultivation also affect profits for businesses.'",
        "'speaker_6': 'I'm sorry. They they affect profits for businesses. Wages for a local workforce. And prices for consumers. Further, there's no precedent for this tax. No other industry in Long Beach is taxed based on the cultivation of its products. Imagine taxing local farmers for every fruit or vegetable harvested.'",
        "'speaker_6': 'Not only would private the profits of prices at your local farmers markets increase, but the grower is essentially being fined for successfully growing food. The only groups subjected to this tax are local cannabis cultivators who should not face additional obstacles because of what they decide to grow and the crop that they grow.'",
        "'speaker_6': 'Previous the reduction of cannabis business license taxes approved by this Council in 2019 led to an uptick in active non-retail licenses and likely contributed to a match to massive financial gains the city has seen since 2020. The same thing.'",
        "'speaker_6': 'Elimination of cultivation tax could spur unprecedented growth in this sector and provide a net benefit for all involved. These potential impacts merit an investigation and ask to look at. This is why I brought this item before us today.'",
        "'speaker_6': 'We need to do our due diligence on this topic for the consumers and business community. I also like to just point out that since we began collecting revenue in 2019, our city has brought in over $50 million over the past five years through cannabis, retail and revenues.'",
        "'speaker_6': 'We've also brought in an additional $8 million. I know we have a pending social equity program, which I want to reemphasize is a priority for me. And so I'm asking for, obviously, the Council to support this item this evening.'",
        "'speaker_6': 'I want to thank council members Pryce and Allen for their support on this item. But again, I want to reemphasize, we have been working on this process with this industry for some time, several years now. It's a very fluid, intense industry.'",
        "'speaker_6': 'We know today things that we didn't know two years ago or even five years ago. And so I want to acknowledge that. And I do think that we have to get it right. This is an emerging industry. This is an emerging job creator in our city.'",
        "'speaker_6': 'And we need to do all we can to ensure that that we have a success in this industry here in the city of Long Beach. So, again, I want to thank you for allowing me to present this item, encourage my colleagues support on it.'",
        "'speaker_6': 'Thanks.'",
        "'speaker_5': 'Thank you. I have a secret list of Alan Longo. Is there anyone else would like to speak on it and is going to keep a list?'",
        "'speaker_4': 'It's.'",
        "'speaker_5': 'Okay. Season three has anyone else? Okay. Councilwoman Allen.'",
        "'speaker_0': 'Yes. I just want to say thank you to Councilmember Austin for introducing this item, and I was so happy to sign on to it. I've heard from so many folks in the cannabis industry that operators are overtaxed and burdened by various regulations, and cannabis businesses are taxed sometimes 40% more than other businesses, and we need to have'",
        "'speaker_0': 'equal treatment under the law. I think looking into whether we can repeal the cultivation tax is just a way that we can help businesses succeed and keep jobs in the cannabis industry. So I will be supporting this item.'",
        "'speaker_0': 'I wanted to ask Councilmember Austin if he would also consider standing when the presentation comes back, if it can also be presented to the committee as well. I know that there's been a lot of work done in that committee, if that's possible.'",
        "'speaker_0': 'Thank you very much. And I just a great item and it's commend Councilmember Alston and price for signing on to this. Thank you.'",
        "'speaker_5': 'Thank you. Woman.'",
        "'speaker_0': 'Thank you. I want to start by saying that I will be supporting the item tonight, but I would like to bring some information to the forefront of the discussion. I've reached out to landlords and to cannabis business owners, both in the city of Long Beach and outside the city of Long Beach.'",
        "'speaker_0': 'And it's important to note that the market in Long Beach has been flooded, and that is one of the reasons why the cost per square foot for some of these facilities on the rental side has declined. If we decreased the tax, it would probably help the landlords more than it helps the growers because then they would be'",
        "'speaker_0': 'able to sustain a higher price per square foot of the places that they're leasing. So one of the things that I will say, though, that both the landlords and the business grow, the grower business owners have acknowledged that they are losing money because the initial projections were much higher or demand locally than they ended up being.'",
        "'speaker_0': 'And I think that that has a lot to do with our inability to stop the large volumes of marijuana coming into Southern California from non. Registered grows those. I know all growers are illegal because the Federal Government hasn't yet authorized marijuana yet.'",
        "'speaker_5': 'But I'm just.'",
        "'speaker_0': 'Saying that illegal in the sense of the term of non certified by a city or authorized by the state of California. So I think that we're really talking about a two part piece. So what I would also propose is a friendly amendment to include an initialization reduction.'",
        "'speaker_0': 'So a tiered taxation. So may be if you're willing to start a cannabis, grow in Long Beach and employ a certain number of people, perhaps your taxes are a third of the price for the first three years. Then it could be a serious escalation.'",
        "'speaker_0': 'Therefore, the landlords would not take advantage of that and then build in a higher price on the cost per square foot than recouping the money that the taxpayers are giving up. So just something to think about because it is a supply and demand curve and once the tax isn't there, the landlords will pick it up on the'",
        "'speaker_0': 'other side to be comparable with other cities. Thank you very much.'",
        "'speaker_5': 'Thank you. Companies that they are.'",
        "'speaker_0': 'Thank you, Mayor. Vice Mayor. I want to say thank you to Councilmember Austin for bringing this very important item forward. I'm really, really happy to see our city council receiving two cannabis related items in a row. Last week we voted on the city more funds for our city's cannabis equity program.'",
        "'speaker_0': 'And today we have the opportunity to receive the feasibility or request the feasibility report for the changing of our cultivation tax in Long Beach. I think that this is very important, and I think that if we're moving towards equity, which within the industry we really need to pay attention.'",
        "'speaker_0': 'So I am very, very supportive of this item and look forward to the report when it comes from.'",
        "'speaker_5': 'Thank you. I'll just add my my support for the item here. I think the councilman will. I think your comments about cultivation and how it's unique to this and how be treated if it were. Give me a mute how it would be treated if it were a farm.'",
        "'speaker_5': 'I think that truly resonates, so I'm happy to support this. I would also say that we have some history with this. We know it was a very different environment when we had the first discussion about reducing cannabis taxes and originally there was some apprehension because we thought it would reduce our revenues.'",
        "'speaker_5': 'What we actually saw happen was we reduced the taxes, we extended operating hours. You know, we sort of relaxed the rules a bit. That didn't work when we originally set up the program. And what we what we saw happen was the opposite.'",
        "'speaker_5': 'We brought in more revenue by taking those steps. And so we certainly learned and so did the city manager, as we do this study, I would say was a factor in what we learned. But also, I would say, you know, the first time we reduced the taxes, you know, the idea was it was a pilot, right.'",
        "'speaker_5': 'To see how it worked. I think we at some point need to get to a restructuring of the way that our retail tax taxes should as well. I don't know if that's something tackled here, but that's certainly something I'm open to and those are my comments.'",
        "'speaker_5': 'So before you go to public comment, I heard I heard two friendlies. Councilman Mongo, what was your. Do you want to restate that just so we're clear?'",
        "'speaker_0': 'That's just to include some analysis on what market pressures are at bay so that even if it's just a few phone calls to some of the landlords on what their price per square foot is and then comparable, a lot of these landlords own warehouses in multiple jurisdictions, and you'll see that they have various prices based on the'",
        "'speaker_0': 'city, based on the city's taxation rate. And so if we're going to reduce the tax rate and then the landlords are just going to swoop up that variance. I don't think any of us want that to be what's happening.'",
        "'speaker_0': 'I would rather collect the tax and reinvest it back into the businesses for them. Just something to think about.'",
        "'speaker_5': 'Great. So include some analysis on sort of the impact of the market demand on on the real estate.'",
        "'speaker_0': 'Yeah. And consider a step by step step process where the first three years, maybe you have like a fraction of the tax so that those first three years when you're doing your startup costs and you're getting your customers and all those things, you're relieved of that additional cost burden.'",
        "'speaker_0': 'And then as you get your feet underneath you and you're becoming more successful, and that's often when these different businesses have like a structure themselves and the grows, they're more successful then they can afford that tax and the landlords can't build in that high price because then they wouldn't sign the lease in the first place because they'",
        "'speaker_0': 'know that tax increase is coming.'",
        "'speaker_5': 'Okay. And? And Councilman Allen was there friendly.'",
        "'speaker_0': 'If my friendly was to ask to make a motion, if the report would also or could also be presented to the the enact committee in addition to the Budget Oversight Committee.'",
        "'speaker_5': 'Got it. Councilman, often reactions to too friendly.'",
        "'speaker_6': 'I definitely want to accept the friendly for the Indian F committee. And I think during that process, Councilmember Mongeau, who I believe chairs that committee, can can further examine her ideas about the the compensation tax so and impacts on the the property owners or landlords for commercial property owners.'",
        "'speaker_6': 'And so I'd like to accept. Councilmember. Allen's friendly and ask that councilmember Mongo I think you know that's a very detailed I'm trying not to conflate this issue. I want to bring it back kind of clean on its own.'",
        "'speaker_6': 'And if this is another issue that we can agenda at a later time or study more through the committee process, I'm happy to to work with you on that.'",
        "'speaker_0': 'Thank you. Council member. We meet regularly, so it shouldn't be a problem.'",
        "'speaker_5': 'Great. All right, that sounds perfect, but we'll get some input from the idea and maybe even factor some of that in. Let's go ahead and go to Bob.'",
        "'speaker_1': 'Mr. Vice Mayor, I wanted to comment as well after.'",
        "'speaker_5': 'I'm sorry.'",
        "'speaker_1': 'That's okay. I apologize. I didn't tell you ahead of time, so no need to apologize. I just. I wanted to I wanted to take a moment to acknowledge Councilman Allen's friendly because I know there's been a lot of committee work that's done.'",
        "'speaker_1': 'And I really appreciate the fact that a lot of the details get studied at the committee level and hopefully get incorporated into what comes back to council. And I think that's really important. I do want to say for me, ultimately, I hope the report very clearly identifies what the bottom line impact to the budget would be because'",
        "'speaker_1': 'I'm supportive of this item, I'm happy to support it tonight, looking forward to having the report. But ultimately, the reasons why we discussed attacks tax to begin with were all related to city revenue and what's generated. So that's ultimately what we need to know that information as we move forward so that we know what what shifts need'",
        "'speaker_1': 'to be made if in fact we do make a change here, which it might make total sense to do. But I just want to know what that specific hit is going to be, not just for the next year, but, you know, preferably based on trends in the next five years.'",
        "'speaker_1': 'So I want to thank staff in advance for clearly identifying that in the report. Thanks.'",
        "'speaker_5': 'All right. Thank you. Any further council deliberation before we go to the comment? All right, let's have Google come in.'",
        "'speaker_2': 'If there are any members of the public that would like to speak on item 14, please line up at the podium. Or if you're attending virtually please use the raise hand feature or dial star nine. Seem more than ten speakers.'",
        "'speaker_2': 'We have 90 seconds. Thank you.'",
        "'speaker_4': 'Good evening. My name is Steven Cortez. I'm employed in the city of Long Beach. I'm here today in support of lowering cannabis taxes through the Elimination of Cultivation Tax. Last year, I began my first job working in the cannabis industry as a bartender for Cutler's Cannabis Co.'",
        "'speaker_4': 'Prior to working for cannabis, I was working as a mental health worker. I recently had the experience of reuniting with a former patient I had cared for. He reminded me that two years ago he had he had crippling pain and was taking four OxyContin and six Percocet pills every day.'",
        "'speaker_4': 'This type of regimen landed him in the local community hospital, now allowing him to play with his grandchildren or do anything really besides sit in a fog. He stated he had given all that stuff up and doesn't take it anymore and now has a life worth living again through the incorporation of a THC CBD sublingual tincture regimen'",
        "'speaker_4': '. I share this story to say that by lowering cannabis taxes down the entire California supply chain, we can begin to address the massive need for safe, affordable retail access and to better focus on truly serving the will of the people and our well-intentioned local farmers through systemic relief.'",
        "'speaker_4': 'I want to remind everyone that most California cannabis consumers do not buy cannabis from state licensed shops, according to market observers such as Global Growth Analytics, which estimate that illegal cannabis sales in California total 8 billion a year, double the amount of legal sales.'",
        "'speaker_4': 'And one reason for black market staying power is that many Californians do not have easy access to legal retailers. For example, according to Scott Hacker, the reason California has only two licensed dispensaries for every 100,000 residents, compared to about 18 in Oregon and 14 in Colorado.'",
        "'speaker_4': 'And thanks to rising inflation in 2021 and cultivation taxes jumped at the beginning of 2022, even though the market value of cannabis had declined. All told, taxes increases.'",
        "'speaker_1': 'The 90 seconds has expired.'",
        "'speaker_4': 'Oh, I'm sorry.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'I just want to quickly say that I urge my city council to investigate the feasibility of appealing the cultivation.'",
        "'speaker_1': 'Your time has expired, sir. Thank you.'",
        "'speaker_0': 'All right. Hello, counsel. My name is Samantha Koehler. I'm a resident of Long Beach and a worker and advocate for the cannabis industry. The industry was here to save me in the middle of the pandemic when I was displaced from my previous career in restaurant marketing, the cannabis industry offered me a chance to survive all during those'",
        "'speaker_0': 'very uncertain times with the addition of union representation and employee benefits. I'm here today in support of a giant agenda item 14. Unfair taxes are driving the cannabis industry to the point of near collapse, especially our farmers. No other industry in Long Beach is taxed based upon the cultivation of its products because of high taxes.'",
        "'speaker_0': 'Millions of pounds of products are being wasted every year due to the inability to compete with the low prices of the black market and overbearing taxes. This means millions of dollars of tax revenue lost that could improve public safety, fix roads and fund youth community programs.'",
        "'speaker_0': 'I want to urge my City Council to investigate the feasibility of repealing the tax for cannabis cultivation and help save the cannabis industry from the brink of collapse due to these crushing taxes. Thank you, council members Austin, Cyndi Allen and Susie Price for supporting this initiative.'",
        "'speaker_0': 'Thank you for your time.'",
        "'speaker_4': 'Good evening. Councilmembers My name is Jose Hernandez and I work here in the city of Long Beach. So I just want to, first of all say that I'm in solidarity and support for the cult with the cultivators and the growers that are the backbone of the cannabis industry.'",
        "'speaker_4': 'You know, for a long time there was reefer madness. There was a racially oriented attack against people that would smoke cannabis or, you know, be around cannabis, brown people in particular. That's why they call it marijuana. And now cannabis people are still in jail, literally locked up while folks are making millions of dollars off of that.'",
        "'speaker_4': 'You know, it's it's important to know who was with us and make sure that those folks that when it was not as politically convenient that were with us. And so we want to definitely highlight and think our Austin Susie Price and Cindy Allen for being their champions and supporters of this issue.'",
        "'speaker_4': 'You know, and a lot of the issue comes to taxation right now. It's a new industry and like the oil industry doesn't get this kind of treatment. Other industries, liquor, tobacco. Why cannabis? Like, why are we the scapegoats to try to solve all the problems in the state, in the city.'",
        "'speaker_4': 'So I would definitely want to last thing to say is that that woman that spoke earlier about social equity was absolutely right. It's time that we highlight and we streamline the process so that we can have black and Brown owned businesses be have a, you know, a seat at the table so that we can make right all'",
        "'speaker_4': 'the wrongs that happened for years. And. Good evening, City Council. My name is James and I want to add that the exorbitant taxes are a challenge and seen as another hindrance, which makes it counterproductive to the impact that it has on the community and city overall comprehensively.'",
        "'speaker_4': 'From the museum's millions, it has added as not only a financial stimulus to the city's budget, but also the employment that it provides the mental and medical health benefits of those citizens residing within the city of Long Beach.'",
        "'speaker_4': 'At this moment, I would like to issue a call to action to the whole city council at this moment to delve deeper into the barriers and challenges that hinder its citizens and remove those barriers for all in order to allow its citizens and voters to truly prosper for support of Agenda Item 14.'",
        "'speaker_4': 'Furthermore, it impedes those social equity recipients, like the lady who spoke earlier of the opportunity to engage and run a flourishing business, which is her American. Right. Thank you. Good evening, Mayor and City Council first. So I'm happy to hear that you're considering getting rid of the cultivation tax.'",
        "'speaker_4': 'Second, we need to lower the tax on kind of a sales period by enforcing these oppressive taxes. Not only are you doing a disservice to the social equity program, but you're also doing a disservice to your constituents. The more legal sales, the more tax revenue will be collected.'",
        "'speaker_4': '15% of 14 billion is more than is more than 30% of 7 billion. Simple math. You guys think you. Good evening, city Council. Thanks, Councilman Austin, for bringing this forward. Councilwoman Price. Councilwoman Allen. I'll do my best in a minute.'",
        "'speaker_4': 'Through anybody who knows me, I could go on this topic for an hour, but was created with this high tax policy is an 80% black market. This is 300,000 jobs that are in the black market that should be in the legal market.'",
        "'speaker_4': 'All we would have to do is drastically reduce taxes and these jobs will be legal. This is worker rights issues. Most of these workers in the retail especially are unionized. It's a women's rights issue. Someone came up here and spoke about women's rights.'",
        "'speaker_4': 'This is a women's rights issue. You know, I interview everybody we hire. And in the trap market, there's a lot of good people on the black market, but it's very common the women get creeped on. These are protections that we need in the legal market under OSHA.'",
        "'speaker_4': 'Also, I'd say this, these local cannabis businesses, I've been to a mall. These are not big businesses. There's one that's owned by a guy and his wife and the niece. There's a couple of young kids that are only half built out because of the oppressive tax system.'",
        "'speaker_4': 'There's another family business, its own. Another couple of gentlemen that have both been incarcerated. And the other thing that everybody forgets and this is the patient. They use this as a medication. This is for veterans. This is for patients.'",
        "'speaker_4': 'This is for customers. And it's for weed for the people. Let's get the price down.'",
        "'speaker_2': 'Hello, Mayor and city council members. My name is.'",
        "'speaker_0': 'Natasha Brown, but I am a licensed.'",
        "'speaker_2': 'Cannabis cultivation operator.'",
        "'speaker_0': 'In the city of Long Beach called Bud. I am one of the first adult.'",
        "'speaker_2': 'Use cultivation licenses to get up and running.'",
        "'speaker_0': 'Three years.'",
        "'speaker_2': 'Ago and I'm an active member of the.'",
        "'speaker_0': 'CAA. As an organization, we pushed for tax modernization to broaden the tax base on the supply chain in.'",
        "'speaker_2': '2019 and advocated for extended retail business hours in lieu.'",
        "'speaker_1': 'Of a of a retail.'",
        "'speaker_0': 'Increase, both with successful outcomes.'",
        "'speaker_2': 'Of more tax revenue for the.'",
        "'speaker_0': 'City, increased jobs and.'",
        "'speaker_2': 'More cannabis business.'",
        "'speaker_0': 'In actual operations.'",
        "'speaker_2': 'They'll support the tax modernization for cannabis cultivation. However, the BCA asked us to include retail tax monitor and ization at both medical and adult use points of sale.'",
        "'speaker_0': 'We are asking for a feasibility study to.'",
        "'speaker_2': 'Return in 60 days with a presentation to the Economic Development Committee following the same process as the path to successful cannabis talk.'",
        "'speaker_0': 'Tax modernization information. Thank you.'",
        "'speaker_4': 'Good evening, City Council. I am an operator in the District six of a cannabis business or manufacturing group here today just in support of the tax modernization and lowering the cultivation tax. Thank you, Councilmember Austin, for championing this effort.'",
        "'speaker_4': 'I just I just wanted to quickly end and side with some comments that Vice Mayor Richardson made about also including retail tax modernization study, along with this study and also to champion working in passage of said, I think is a good time to include all modernization, not only on cultivation but on the retail level.'",
        "'speaker_4': 'If we want everyone to succeed, I think is the faster we do tax modernization, the more we improve sales. And all the changes we've been making together will continue to benefit higher tax income. Thank you. Hello again. So, yes, you know, these taxes that you levied on working class people and small businesses, they're not good.'",
        "'speaker_4': 'You know, why is it that you're not pushing to tax the multi-billion dollar multinational corporations and lump it? You know, you should be taxing them. It shouldn't be taxing the people. And it goes beyond this. But I'd also like to mention, I'm picking up on what the council members and some members of the public said.'",
        "'speaker_4': 'You know, they is this is a women's rights issue. It's a it's a health issue. So that's like an interesting angle on it, right? It's a health issue. So what is it that you know where the people want in terms of health care?'",
        "'speaker_4': 'Right. We want something like a single payer system here. So guess what? You are, you know, here in Long Beach, we should pioneer something like that. We should pioneer essentially like a public option for this because to make sure it's truly available and equitable, because as you know, as has been said multiple times, it's about health care'",
        "'speaker_4': '. So, I mean, of course, you know, each individual has their own course and their treatments and, you know, what they want to be doing in there with their health care treatment. So it's time to, of course, repeal all of this, all these taxes that, you know, you're just profiting from working class people.'",
        "'speaker_4': 'You're making them more poor by putting this stuff out there. So you got to just, of course, banish it and.'",
        "'speaker_2': 'We have seen they can pay. Your 90 seconds began now?'",
        "'speaker_5': 'Yes. And I think just just to be clear, city clerk, everyone that has to raise their hand and Zoom has to acknowledge their name.'",
        "'speaker_4': 'So just for decorum sake, if there is the public speakers in the chambers, I think that it's appropriate. That same thing is done. Just for the sake of the recording and down act. That said, I'm calling in support of the modernization of the tax.'",
        "'speaker_4': 'I think that is a welcomed opportunity to facilitate, you know, the growth of a.'",
        "'speaker_5': 'Burgeoning.'",
        "'speaker_4': 'Industry here in the city. And I'm in complete support of it.'",
        "'speaker_5': 'That said, and thank you to the sponsors.'",
        "'speaker_4': 'If not in the offices of I afternoon Cindy Allen and Susie Price for bringing that up. To be clear.'",
        "'speaker_5': 'I would also like.'",
        "'speaker_4': 'With a junction to this in conjunction of this coming into effect.'",
        "'speaker_5': 'You know, if we could somehow.'",
        "'speaker_4': 'Use it as an opportunity to facilitate more African American equity partners within this space, because we're solely.'",
        "'speaker_5': 'Underrepresented within this industry and being one of the most impacted by the war on drugs.'",
        "'speaker_4': 'It still bothers me that.'",
        "'speaker_5': 'There is not a single one. Actually, there was recently one.'",
        "'speaker_4': 'Thanks to Mr. Trey Sessions and others coming together there. But.'",
        "'speaker_2': 'Our next speaker is David Jude Aiken. Your 90 seconds begin now. David.'",
        "'speaker_5': 'Hi.'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'Hello. Hi. My name is David. You take care of Walmart LLC. We're one of the largest cultivators in Long Beach and they supported the joint recommendations. Help the members of similar smelling cannabis cultivation is in dire straits. Wholesale prices have dropped by 50 to 70% in the last year.'",
        "'speaker_5': 'And of course, course of to rise. I want to just give you a couple of statistics. We employ about 161 full time employees and 104 men and 67 women. 77 of our people live in Long Beach and 106 in the Gateway Cities hire local.'",
        "'speaker_5': 'We have a young workforce with an average age of 34, almost make well of a minimum wage. Our employees live in 12 of the city of London. Wal mart facilities are less than one acre. I comparison Toyota Auto Body Company, which has 3038, has just under twice as many employees as I would just say where one acre'",
        "'speaker_5': 'cultivation is the first step in the cultivation industry. By eliminating unfair tax on cultivation, you'll help the legal cannabis industry by lowering the cost of reducing illegal operations and ultimately increase revenues in the city. That increased legal retail sales last year.'",
        "'speaker_5': 'Walnut.'",
        "'speaker_2': 'Edward Wilson. Your time begins now.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Please begin.'",
        "'speaker_5': 'Did you see my name?'",
        "'speaker_3': 'Yes.'",
        "'speaker_5': 'Hello. Hi, this is Ed Wilson again. I'm going to finish up with my boss. I'm also the controller for Wal-Mart LLC. And so I'll finish what he was going to say. Last year, Walmart paid $3 $13.02 per square foot, which amounted to $290,000 400.'",
        "'speaker_5': 'With this money, we can employ an additional eight full time employees. Honorable Counsel. Time is of the essence. This is a cost to every. There is a cost to everything, even inaction and delay. We would like the Council to consider the two changes in the recommendations that we feel will make it even better.'",
        "'speaker_5': 'One. Have the analysis come back in 30 to 60 days. We all know that great people meet. Whatever deadline or timeline is assigned. And Long Beach has awesome staff. Second place an immediate suspension on all corporation tax collection until after the council makes the final decision.'",
        "'speaker_5': 'If the council wishes to vote to maintain the current level of taxes, the city will have ample opportunity to collect the amount in arrears. However, right now, the the cultivation industry is in dire straits. And so we need and would really like.'",
        "'speaker_5': 'It means some type of immediate action and help. 90 days, six months may be too late. I want to thank you for this opportunity to speak, and I'm available to answer any question.'",
        "'speaker_2': 'Our next speaker is Jake. No, Till King's. Your time begins now.'",
        "'speaker_4': 'Hi.'",
        "'speaker_5': 'My name is Jake. I'm a licensed cultivator here in the city of Long Beach, and we're a small craft operation. And Long Beach has a lot of small operators. If we are able to repeal the cultivation tax, this will have a huge impact on a lot of small operators that run as.'",
        "'speaker_5': 'Like owner operated businesses. That's what we are. And. I'm just in full support of it. I appreciate the Council for bringing it forward and it would really do a lot, especially for the small operators like us. And Long Beach has a lot of them.'",
        "'speaker_5': 'And so I try to speak for all of us and say that we do we do support this. And thank you very much for all your time.'",
        "'speaker_2': 'Our last speaker is Olivia Sweeney. Your time begins now.'",
        "'speaker_0': 'Hi. My name is Olivia Sweeney. I am a resident of downtown Long Beach and I work in the industry as a receptionist. I'm here tonight in support of Agenda Item 14 because thousands of jobs would be lost if the cannabis stores, growers and distributors go out of business.'",
        "'speaker_0': 'As my colleagues here have mentioned, many of these jobs are union jobs with health benefits, including mine here at Catalyst Cannabis, which has provided me the support I needed post-COVID. I urge my city council to investigate the feasibility of repealing the tax for cannabis cultivation.'",
        "'speaker_0': 'Thank you, council members. I'll Austin, Susie Price and Cindy Allen for leading this initiative. Thank you.'",
        "'speaker_2': 'That concludes public comment.'",
        "'speaker_5': 'All right. Let's go ahead and have our roll call vote and vote on this one.'",
        "'speaker_1': 'Actually, Mr. Vice Mayor, can I have a couple comments?'",
        "'speaker_5': 'Go for it.'",
        "'speaker_1': 'Thank you. So I want to thank all the speakers for coming out. There was just there was a few comments that were mentioned that I think it's really important for us to acknowledge where we are at this point.'",
        "'speaker_1': 'You know, we talked about the historical context of this topic, and I think it's important to know that we're in a much different place today when we're talking about cannabis than we were four or five or six years ago.'",
        "'speaker_1': 'And a lot of that has to do with the legal operators who were provided the opportunity to operate in the city. And what they have done to educate everybody about the legitimate parts of the industry. I think that's been critical, the credibility that's been established there, the understanding that we wouldn't be getting a proposal in front of'",
        "'speaker_1': 'us that wasn't well thought out, that wasn't prudent. I'm really proud of the prudence that the city has taken on this issue. I know it's been probably slow for some people, but it has allowed us to be able to be very deliberate at every stage with every decision that we've made based on actual data and practical application'",
        "'speaker_1': '. I think that's really important. So I want to acknowledge that it's we're in a much different place today than we were years ago. And where we are today and the discussions that we're having, the foundation of all of that was built by the, you know, business leaders in the city who have established cannabis operations and demonstrated the'",
        "'speaker_1': 'industry and what the impacts of the industry can be and really done their part to mitigate any concerns. And I just want to take a moment to appreciate all of those people, because I know for me, you're never fixed in time with an opinion.'",
        "'speaker_1': 'You develop and you grow and you learn and you allow yourself the education. And I'm grateful for the people who have, you know, called us in to that conversation and demonstrated credibility. There's no way, I think we would be looking at an item like this today without the history of work with these partners that we've industry leaders'",
        "'speaker_1': 'and partners that we've had. So I want to thank you guys for that.'",
        "'speaker_5': 'All right. Any additional comment?'",
        "'speaker_6': 'I'll just close and say thank you to my colleagues. I want to thank the many public commenters who came out. It sounds like it's unanimous in support of moving forward, at least from the public comment standpoint. And I do think that there are opportunities and this is not the first that we are going to hear about taking'",
        "'speaker_6': 'another look at our tax structure for cannabis, as should happen here on the local level. But it should also happen in Sacramento, which I expect to be happening as well. And these these conversations happening simultaneously, I think will make for a better industry, a more robust legal industry here in the state of California and in Long Beach'",
        "'speaker_6': '. Thanks.'",
        "'speaker_5': 'All right. Let's go to a roll call vote with District one.'",
        "'speaker_1': 'My district to. I.'",
        "'speaker_0': 'District three i. District four.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District five. I. District six.'",
        "'speaker_1': 'I. District eight.'",
        "'speaker_0': 'High District nine.'"
    ],
    "City Manager Authorization to Sign Petition and Ballot for Downtown Long Beach Property and Business Improvement District.": [
        "'speaker_1': 'I emotion is carried eight zero.'",
        "'speaker_5': 'But thank you. 15, please.'",
        "'speaker_1': 'Report from Economic Development Recommendation to authorize city manager to sign, petition.'",
        "'speaker_0': 'And subsequent ballot relating to city owned properties located.'",
        "'speaker_1': 'Within the boundaries of the downtown Long Beach property and Business Improvement District Districts one and two.'",
        "'speaker_5': 'Okay, I recognize Californians and they ask for their hand up for emotion and confidence and back Allen for a second chance on whether they are actually mayor.'",
        "'speaker_0': 'Vice Mayor. I'm actually just I have to recuse myself because I have two properties in the people I'll be fighting off.'",
        "'speaker_5': 'Okay. Thank you. So we need a second on it. I'll seconded. Councilwoman Zero.'",
        "'speaker_0': 'Do we have a president?'",
        "'speaker_5': 'That's right. Staff report. Excuse me. Yes, there are staff. Is there a brief staff report?'",
        "'speaker_4': 'Yes. Eric Romero from Economic Development can give a brief staff report in. All right.'",
        "'speaker_8': 'Good evening, Mayor. Members of the city council. My name is Eric Romero, and I'm the business development officer in the Economic Development Department. I would like to start by providing you some brief background on the downtown bid renewal history.'",
        "'speaker_8': 'The downtown pivot was established by the City Council in 1998 for a five year term. It was renewed for the first time in 2003 for a ten year term. It was renewed for a second time in 2012 for an additional ten year term.'",
        "'speaker_8': 'And the downtown pivot is now up for its third ten year renewal per state law. Ten years is the maximum term for a period that already surpassed its initial five year term. The permit renewal process, which has been led by the downtown Long Beach Alliance, was informed by a strategic planning process that included interviews, roundtables and an'",
        "'speaker_8': 'online survey completed by more than 500 downtown stakeholders in the next ten year term. The downtown pivot revenue will support a more robust, clean and safe program programs that address and assist downtown's unhoused population. Economic development programs that support small businesses and focus on business attraction marketing at special events and beautification and place enhancement activities.'",
        "'speaker_8': 'If the downtown permit is renewed. The estimated total annual cost of the city for the fiscal year 2023 assessment is 787 $785,156. Of that total amount, $220,000, more or less will be paid by a private property owner that manages city property in downtown.'",
        "'speaker_8': 'The remaining city assessment is $564,672. The recommendation before Council today is to authorize the city manager to sign the petition and subsequent ballot for city owned properties in support of renewing the downtown pavement. That concludes my staff report.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'All right. Thank you for that report, Councilwoman Dana.'",
        "'speaker_0': 'Thank you so much, Vice Mayor. And thank you, Eric Romero, for that very good presentation and also for all the work that you've been doing on this. I think that that. Our downtown area is a very lively and fun area for everyone in the city, but in particularly for youth.'",
        "'speaker_0': 'I think that for many. Many years, we've learned that he cut our key criteria to ensuring our city continues to prosper, rest in the ability to keep our young adults living and working in Long Beach, way beyond high school and college graduates, especially in the downtown area.'",
        "'speaker_0': 'We need them to stay more. More importantly, we'd love for them to want to stay in our downtown area. In that same sense and for many other reasons as well, is very important that we care for our downtown area, establishing this area as a property and business improvement district.'",
        "'speaker_0': 'Back in 1994. First helped us get to a point where we can count on having additional services in maintenance, public safety and marketing in this area. These are services that are very much needed and that help us keep a clean and attractive area for our residents, for our youth, our young adults, and even for tourists and visitors'",
        "'speaker_0': 'as well. However, I do have I do have a couple questions that I that I would like to answer, if possible. I know that one of the main concerns with this debate in need for residents and business owners has been the 30% plus increase.'",
        "'speaker_0': 'If staff can answer this, how will this increase in assessment impact on local businesses during this recovery phase? We are in.'",
        "'speaker_8': 'Thank you. Councilwoman, I'm happy to answer that question. I do want to acknowledge, as you mentioned, that the property assessment rates for the downtown Peabody, if renewed, are projected to increase by an average of 34.5%. And the increase is really driven by a few different factors.'",
        "'speaker_8': 'So through again, the outreach that was completed through the strategic planning process and the Peabody renewal process. There is there was a request for additional services which include expanded sidewalk pressure washing services, increased tree trimming and plant maintenance, the hiring of a homeless outreach manager to collaborate with social service organizations to support people experiencing homelessness.'",
        "'speaker_8': 'The hiring of a downtown business navigator to provide better wraparound support services for both new and existing small businesses. And also an acknowledgment that there's a need to increase pay for clean and safe team to assist with both retaining and attracting talent in a competitive labor market.'",
        "'speaker_8': 'So for those reasons, the property assessment rate is recommended to increase. As certainly, you know, there will be additional costs that are taken on by both property owners and business owners. But I think really here that the case in terms of the downtown pivot is to leverage collectively a lot of different resources to further invest and support'",
        "'speaker_8': 'the downtown, to both improve beautification and the quality of life, and have an urban and a vibrant urban downtown center, which really is the benefits of downtown pyramids and pyramids. And Peabody is generally.'",
        "'speaker_0': 'Great if you feel like work. Also, could you share with us so the community can know some of the outreach that has been done on this people?'",
        "'speaker_8': 'Absolutely. So while the strategic planning process isn't required in advance to leading up to a downtown permit renewal or a permit renewal in general, the downtown Long Beach Alliance did decide to lead a comprehensive strategic planning process that again included a variety of one on one interviews, focus groups, roundtables and an online survey to gauge input directly'",
        "'speaker_8': 'from property owners, from business owners and residents that are ultimately impacted and supported by the services that are funded by the downtown period. Revenue for the online survey alone that included over 500 responses from downtown stakeholders. Additionally, the strategic planning process was also implemented under the guidance of a 35 member committee that included property owners, business owners'",
        "'speaker_8': 'and residents, and of course also included the downtown Long Beach Alliance board of directors, which again includes property owners, business owners and members of the community.'",
        "'speaker_0': 'Thank you, Eric, again. I think that's very important for the community to know about that. And, you know, the outreach that has been happening, I want to say that I know that in this particular item that we have in front of us today is so that we can prove to be for the as a member of this'",
        "'speaker_0': 'people that we can approve to sign the petition going forward to be part of this bill. I think that's also very important, and maybe you might be able to elaborate a little bit more on that.'",
        "'speaker_8': 'Yes, I'd be happy to. So through the Peabody, both formation and renewal process. Property owners that are ratepayers into the Peabody are responsible for ultimately vocalizing their support or their their being against the Peabody renewal or formation. So all property owners in the petition phase, which is a phase that we're currently in for the downtown renewal all'",
        "'speaker_8': 'property owners of record that own property in the downtown Peabody that would be subject to a private property assessment receive a petition of those petitions. Over 50% of all the property owners responsible for assessments in the Peabody have to return that petition in support of renewing the permit in order to enter the next phase of the Peabody'",
        "'speaker_8': 'renewal process. The city of Long Beach is a large stakeholder and property owner in the downtown Peabody. So the recommendation today and the decision in front of you today is to really authorize the city manager to sign the petition for city owned properties in favor of renewing the downtown Peabody.'",
        "'speaker_8': 'Assuming that over 50% of property owners, based on the weight of the assessment, return their petitions in favor of the Peabody renewal, then that would trigger the next phase of the renewal process.'",
        "'speaker_0': 'Thank you. Could you also explain how what it would be like if or what would happen if it didn't meet that threshold?'",
        "'speaker_8': 'Yeah.'",
        "'speaker_4': 'That's a that's a really good.'",
        "'speaker_0': 'Sure. Okay.'",
        "'speaker_8': 'Okay. Yeah. So if if the there is a timeline to renew the P bid, currently the timeline that we're working toward is really by summer 2022, by August 2022. And so it's important right now to secure, you know, all of all enough support in the petition process to renew the bid.'",
        "'speaker_8': 'If that support is not secured, the bid renewal process would not continue. So again, the recommendation for you today is really to authorize the city manager to support the permit renewal through ultimately filling out the petition in support of urban renewal for city owned properties.'",
        "'speaker_0': 'Thank you. And lastly, I was wondering if you if you could express to to the community how much of the first District is now in this piece that the downtown Long Beach Association Alliance.'",
        "'speaker_8': 'Yeah, that's a good question. I don't have all of the details on all of the parcels in front of me right now. But I can say the bulk of the downtown period is in the first council district now.'",
        "'speaker_8': 'Yeah.'",
        "'speaker_0': 'Thank you. I also like to take this moment to give a shout out to the Red Shirts from the Army. There are safety ambassadors who are amazing and do a great job out in our downtown area as well as the cleaning team.'",
        "'speaker_0': 'I know I personally use the safety ambassadors a lot to go from point A to point B, especially at night when I'm exploring the district. So I just wanted to say thank you to all of the safety ambassadors for all the wonderful work that you do and for always helping us out as well with our people experiencing'",
        "'speaker_0': 'homelessness and for always being so compassionate to them as well and trying to provide and help them find services. I know that your job is huge and I just wanted to take a moment and acknowledge. Thank you very much.'",
        "'speaker_5': 'Right. Thank you. I'll offer my comments in my second here. So we should absolutely as a city, both support the renewal of the event. In terms of the additional cost, I think it's important and thank you, Eric, for underscoring that the goal for this enhancement is to have a sort of more capacity to deal with nuisances in'",
        "'speaker_5': 'the area, to help keep the area safe, help make sure that we can navigate people around that are experiencing homelessness to the right services. And I think that's incredibly important. And in our downtown that we have that local touch from our downtown Long Beach Associates.'",
        "'speaker_5': 'And I think it plays really well with some of our strategies. Our local sort of non non-police led crisis response is around homeless homelessness. I think in order to really make an impact, we're going to have to see the P bid step up and the city staff to see see a real difference.'",
        "'speaker_5': 'And so I know that that's not cheap. I know that's also what the downtown businesses are asking for, what the downtown residents are asking for. So the city needs to be publicly supportive of this, not only just in our budget, but we should you know, we should probably talk about our partnership and the things that we're going'",
        "'speaker_5': 'to do with this enhancement to help make sure that our our downtown is clean and safe. And so I'm happy to answer a second here. I'm going to ask if there are any other council comments so I can take a list.'",
        "'speaker_5': 'Okay. Hearing none was here. Public comment.'",
        "'speaker_2': 'Are there any members of the public that would like to speak? Please line up at the podium. Or if you're attending, virtually, please use the raise hand feature or dial star nine. This is per item 15. Your time begins now.'",
        "'speaker_4': 'Thank you. Good evening, Honorable Vice Mayor and members of the City Council. My name is Austin Mature and the Economic Development and policy manager for the de lba and the Delta Project plead for the renewal of the downtown property based Improvement District.'",
        "'speaker_4': 'First, I'd like to thank city staff and Councilwoman Mary's and de Haas and Councilwoman Cindy Allen and your assistance in helping to engage the downtown community. And I would like to also reflect, as stated by staff, that our process for renewing the property based improvement district really began back in January of 2021 with the convening of the'",
        "'speaker_4': 'strategic planning process with residents, property owners and small business owners. And during that process, we came out with five key themes to address within the new property based improvement district safety and security within the downtown, cleanliness within the downtown, connecting our unhoused population with available resources, addressing the storefront economy and vacancies, and assisting our small businesses and'",
        "'speaker_4': 'addressing connectivity issues between various neighborhoods. Since the start of the petition process, we've met with over 50, with nearly 50 property owners and one on one meetings ranging from nonprofits, large commercial property owners, small commercial property owners and residential property owners.'",
        "'speaker_4': 'We've engaged residents through virtual and in-person forums and will continue to engage the community through both virtual and in-person events, partnering with neighborhood associations and in ways to connect to downtown residents. Finally, I'd like to just briefly discuss, since the permit renewal only happens every ten years, I think it's important to provide historical context of where we'",
        "'speaker_4': 'are in the renewal process today and where we were at in 2012. Today, March 15th, we come before City Council Collection with a collection of petitions that represent 21% of assessments in 2012. The request for authorization did not occur until May 1st, and petitions represented 19% of assessments.'",
        "'speaker_4': 'Furthermore, we have nearly doubled our collection from residents in favor of renewal with 2 to 1 and comparison to the 2012. Renewing the debate is tough work, but we have been diligent in our process, method and outreach and I believe we are on the right track.'",
        "'speaker_4': 'Thank you for the opportunity to speak on this item.'",
        "'speaker_0': 'Good evening, mayor, vice mayor and council members. My name is Rhonda Love, and I'm a business owner operating in downtown Long Beach. First, thank you, city council for the opportunity to speak tonight on this agenda item regarding the downtown property based Improvement District.'",
        "'speaker_0': 'As a downtown business owner, I'd like to express my support for the renewal of the bid and the continuation of the clean and safe services that the District has provided for over the last 25 years. In addition, the Dobie's economic development programs and special events have helped tremendously and creating an active, vibrant downtown for our small business'",
        "'speaker_0': 'community. The special events supported by the P bid and produced by the Dolby and the community generate visitors to the downtown businesses and help us to activate our neighborhoods. Events like Shop Small Saturday, Taste of Downtown, the New Year's Eve and At the Waterfront have all helped to showcase our unique neighborhoods to residents and visitors, tourists alike'",
        "'speaker_0': '. I also appreciate the P bid for its broad economic development initiatives that assist businesses in underrepresented communities. The Downtown Peace Program, the Entrepreneur Education Services and the Google Workshops in the collaboration with the community partners have had a direct and lasting impact on the small businesses in downtown.'",
        "'speaker_0': 'Most recently, the SBA storefront recovery grants help small businesses that were victims of recent break ins to offset their property damage cost. Since the formation of the pea bed back in 1998, the downtown has grown into a healthier, cleaner and safer community for all to live, work, thrive and visit in the area.'",
        "'speaker_0': 'I'd like to see those services continue with the bid and the deal. Bay. Thank you again for your time and for allow me to express my support of the bid. And I hope the City Council will help to ensure the continuation of the bid by showing your support.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Greetings. My name is and I can say sixth district resident. I actually wrote down here from my business, which is in the downtown area, just because I think it's vital to hear a, you know, perspective outside of what is the norm in the 150 block radius of the Dolby.'",
        "'speaker_4': 'There are only nine black businesses within them. I'm one of them. I think this is around is another one. I could list them because there's that few of them there. Actually, since the last renewal ten years ago of 2012, there's been a net decline.'",
        "'speaker_4': 'I think as a private entity, I can't you know, I can't tell people what to do, who to advocate for. But with respect to something like the Dolby, which is earmarked, a percentage of property taxes and stewardship of a lot of the fees that come out of the of the city, I think as a both as a'",
        "'speaker_4': 'taxpayer and as a business within the space, I think it's fair to express this the disappointment with respect to how I personally think things are run. I think with regards to the VA, I would not have problem necessarily with the renewal of it if I felt that African-Americans were viewed as equitable stakeholders with respect to what the'",
        "'speaker_4': 'future of the downtown looks like. I know on the housing and a lot of you know, our businesses sorry, on the on the housing end, we're seeing less of a focus on younger families coming in just post downtown plan.'",
        "'speaker_4': 'And I think with respect to the strategic plan, which I've read and I have attended a couple of the Economic Development Commission meetings, and I just keep abreast with these things. I don't necessarily know if this is an ample partner to steward some of this and this these fees.'",
        "'speaker_4': 'But with respect to this this moment of being able to speak, I hope that it can be used as an opportunity to kind of, you know, engage with the public and how can we bring more diverse businesses within the area?'",
        "'speaker_4': 'Because as it stands, the debate is not doing a great job with that, but hopefully within the future, that's something that we could see some more energy moving towards. Thank you. And just to be clear, when I say businesses, I mean storefronts, not holidays or cultural events.'",
        "'speaker_4': 'Those aren't businesses. Those are just moments in time, ephemeral moments sometimes. Thank you. Mayor, council members and staff. I'm Brock Howard, CEO for the downtown Long Beach Alliance. It's a pleasure to be with you in person this evening and being able to share some of our efforts thus far to renew the property based improvement district.'",
        "'speaker_4': 'The downtown has been described as the city's heart and economic engine, driving 1 billion in sales, in tourism, hospitality, retail and personal services, delivered in many cases by local businesses throughout the city, and resident workers as well. From most visitors, tourists, conventioneers, shoppers.'",
        "'speaker_4': 'The downtown will be their first impression of the city and its offerings. We have to deal. We often think of the downtown as the city's front porch. It's welcome mat to any visitor coming to our city. And over the last 25 years, the LBA has had the honor of maintaining this community in partnership with city departments and'",
        "'speaker_4': 'property owners, community organizations as well, while serving as a steward of the funding. The statistics are incredible. Over those ten years. In this current pivot term deal buddies clean and safe teams have annually averaged more than 75,000 of litter and green waste removal from gutters and sidewalks, 4000 instances of graffiti and stickers removed from poles and benches'",
        "'speaker_4': 'and electrical boxes. 8000 directions given to visitors, tourists and residents. 5000 instances of information being shared about parking, transit, hotels, events and businesses as well. That's every year on average. We've also had several partnerships with city departments that have resulted in job training programs and diversion programs for the unhoused.'",
        "'speaker_4': 'These are the services being delivered daily, weekly and annually to residents and commercial property owners that benefit every downtown stakeholder and in turn, give us pride in maintaining the city's front porch. We appreciate the opportunity to be with you tonight, and we look forward to hearing your support for this item.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_2': 'Deborah, fixing your time begins now.'",
        "'speaker_1': 'Good evening. My name is Debra.'",
        "'speaker_0': 'Fix, and I am the chair elect of the downtown Long Beach Alliance Board of Directors. And I manage the property at Shoreline Village. And I want to thank the City Council for the opportunity to speak on this agenda item regarding the downtown property based Improvement District.'",
        "'speaker_0': 'As a representative for the property owner. I cannot stress enough the importance of the bid and the services provided by the GBA, especially over the last two years. The deal provides programs that have proven to be vital for our downtown through the pandemic.'",
        "'speaker_0': 'The proposed renewal plan includes an expansion of the Peabody boundary along the promenade in front of the convention center and the waterfront, enabling the safety ambassadors to engage conventioneers and visitors in the hospitality services while addressing the secure quality of life issues as they arrive at a rest downtown for the essential to its recovery and to play'",
        "'speaker_0': 'a central role in supporting this fall function and a growing and healthier city for all that live, work and sit. The next chapter, Gilda is being written through the hard work of its volunteer board, committee members and staff.'",
        "'speaker_0': 'I'd like to see those services continue with the bid and the difficulty. Thank you again for allowing me to express my support of the bid, and I hope the City Council will help ensure the continuation of the debate by showing your support tonight.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Deborah Coakley. Your time begins.'",
        "'speaker_0': 'Now. Good evening. My name is Deborah. I go by Deb Kelly, and I am a resident in downtown Long Beach for probably the past 11 years. I want to thank the City Council for the opportunity to speak tonight on the agenda of regarding the Peabody, which is the downtown property basically for the district.'",
        "'speaker_0': 'As residents, I would like to express my support for the renewal, the bid and the continuation of the clean and safe services that the district has provided for the past 25 years. The safety ambassadors, they are very helpful there and providing direction and everything for the visitors and the residences here.'",
        "'speaker_0': 'They're also they also offer friendly words anywhere within the district. I'm also a realtor and local realtor here. And I want to testify that every single person that I sell a home to in this area, I do convey to them about this, and they are not turned off by it.'",
        "'speaker_0': 'They're actually impressed by it. So this bid, from a realtor standpoint, it does add value to property here. The the value that residents have for if this goes away, it would be it would not be good. But since the formation of the people and since 98, the downtown, I've seen it grow in a healthier, cleaner and safer'",
        "'speaker_0': 'community for all that live here, work here, and especially visit here. I'd like to see those services to to continue on with the bid and the debate. Thank you for all of you and for letting me express my support for the bid.'",
        "'speaker_0': 'And I hope the City Council will help ensure the continuation of this by showing your support. Thank you.'",
        "'speaker_2': 'Well, the color with the last four digits, six, nine, seven three. Please unmute. Your time begins now. Yes.'",
        "'speaker_0': 'Right. Honorable Vice Mayor Richardson, Council members, thank you for giving me and others the opportunity to address this important item that will really shape the downtown for years to come. I'm Laura Kanab, owner. I'm the volunteer board chair of the downtown Long Beach Alliance.'",
        "'speaker_0': 'The debate. I'm here to speak in support of the property based improvement district bid renewal, as well as really just to show my support for staff who have been working tirelessly to deliver the great services and programs of the LBA to the community while managing the urban renewal.'",
        "'speaker_0': 'It's a lot of work in addition to being a volunteer. I'm also a 15 year resident. I love the downtown I'm in. The types of investments they make in the downtown are very different than other investments. We're buying homes for the first time.'",
        "'speaker_0': 'We're raising families. We're retiring here. We're building our lives here in the downtown and making great friends with our neighbors and business owners. I really can't imagine my neighborhood. Our neighborhood over the next ten years continue to revitalize and grow without the DDA as staff and my fellow board member detailed.'",
        "'speaker_0': 'Many of us are familiar with the organization through the grants and workshops provided to small businesses. The marketing support provided the special event support provided to the community, the projects to enhance and to connect our neighborhood. But as Councilman one has mentioned, most visible, you know, our clean and safe team, our red shirts, our red team, we'",
        "'speaker_0': 'see them around on foot, on bike, on sit on Segways. And I just really can't imagine our neighborhood without them. And let's be honest, the last two years have been very difficult. At the start of the pandemic, when the state was locked down.'",
        "'speaker_0': 'Who were the first people I saw on the street every day still working? They were the red team, picking up trash, fresh, washing the sidewalks, helping those experiencing homelessness to direct them to services. And honestly, just checking on our neighborhood.'",
        "'speaker_0': 'The new management plan provides expanded, clean and safe services and have since then include a homeless outreach wall which is very needed to be that bridge between our stakeholders and the city and our social services. The clean and safe team.'",
        "'speaker_0': 'They really feel a need that wouldn't otherwise be met. And the organizations at an exciting point with the search for a new leader of the organization and when selected, I'm very excited to see this new leader in partnership with others implement the new ten year plan built on the strategic planning the board and the community developed this'",
        "'speaker_0': 'past year. So thank you to the city for your support over the last several months. And I.'",
        "'speaker_2': 'That concludes public comment.'",
        "'speaker_5': 'All right. Let's go ahead to a roll call vote with.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'My District three.'",
        "'speaker_0': 'I. District four. District five. I.'",
        "'speaker_1': 'District six. I. District eight.'",
        "'speaker_0': 'District nine.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'Motion is carried six zero.'"
    ],
    "Amend Contracts for Job Order Contracting Services with Various Construction Companies. ": [
        "'speaker_0': 'Item 17 Report from Public Works Recommendation to authorize City Manager.'",
        "'speaker_1': 'To execute all documents necessary.'",
        "'speaker_0': 'To amend.'",
        "'speaker_1': 'Six contracts to update the Construction Task Catalog.'",
        "'speaker_0': 'Citywide.'",
        "'speaker_5': 'So is there motion and the second move often? I'll go ahead and second it. Um, I'm gonna start after we have a brief report on this. Yes, but.'",
        "'speaker_4': 'We can give one if you'd like one. This is pretty. This is just an extension.'",
        "'speaker_5': 'Right? It's pretty straightforward. Any public comment on this item?'",
        "'speaker_2': 'If there are any members of the public that would like to speak, please line up at the podium. Or if you're turning virtually, please use the raise hand feature or dial star nine. Seen none. That concludes public comment.'",
        "'speaker_5': 'Thank you. Roll call vote with District one.'",
        "'speaker_0': 'My district to. I. District three i. District four i.'",
        "'speaker_1': 'District six. I.'",
        "'speaker_0': 'District eight. High District nine. All right.'"
    ],
    "Reward for Information on Octavio Montano Islas.": [
        "'speaker_1': 'Motion is carried. Seven zero.'",
        "'speaker_5': 'Thank you. Item 21 with.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, Councilwoman Allen.'",
        "'speaker_0': 'Councilmember, your UNGA.'",
        "'speaker_1': 'Recommendation to request city manager to enter discussions with L.A. County to partner on establishing a reward of no less than 25,000 for information leading to the arrest of Octavio, Montano is less.'",
        "'speaker_5': 'Thank you. Take it from here. I'm introducing this motion. We had a tragic circumstance two weeks ago in my district. We lost two members of our community to a hit and run. 42 year old Jessie Palacios and three of Samantha Fields.'",
        "'speaker_5': 'It's a deeply heartbreaking circumstance. At the request of the community and the family, I am advancing this request for our city to formally request to partner with L.A. County on establishing a reward of no less than $25,000 for information leading to the arrest of several months of Huntley's list.'",
        "'speaker_5': 'And I'm happy to make this motion in your hand up for a second. Councilman Allen. Okay, Counsel. Now our second. Anything.'",
        "'speaker_0': 'Yeah. I just. I just wanted to say that I know how important it is as a former police officer to have these rewards, to get people to come forward that has any information. And I just appreciate you leading on this item.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Thank you. Any further council deliberation? Any public comment on this?'",
        "'speaker_2': 'If there are any members of the public that would like to speak on item 21, please line up at the podium. Or if you're attending, virtually, please use the raise hand feature. Seen. And that concludes public comment.'",
        "'speaker_5': 'Fantastic. Will cover.'",
        "'speaker_0': 'District one. My district to. I District three i. District four.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'District six i. District eight.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District nine. I motion is carried seven zero.'"
    ]
}