{
    "Ordinance to Repeal Tenant Relocation Assistance Chapter. ": [
        "'speaker_2': 'Okay, we're going to do item 23, please, Madam Clerk. 23.'",
        "'speaker_0': 'Communication from City Attorney Recommendation to declare ordinance repealing chapter relating to tenant relocation assistance. Read the first time and lead over to the next regular meeting of City Council for final reading, declaring the urgency thereof and declaring that this ordinance shall take effect at midnight on January 1st, 2020, citywide.'",
        "'speaker_2': 'Thank you. I do have three public speakers, if I can, because, Mr. Emerson, you make sure the full council is out here really quick. Thank you. Okay. If Norberto Lopez, Liana Noble and Marlene Alvarado could please come forward.'",
        "'speaker_2': 'Norberto Lopez led a noble and Merlene Alvarado could please come forward. Please. Go ahead, sir. All right.'",
        "'speaker_4': 'Um, so my name is. I work with Libra, the project director there currently. And once again, you know, we stand behind Long Beach amounts. There's a lot of misinformation that has been going out in the media saying that the state amount is higher than the Long Beach amount.'",
        "'speaker_4': 'We're still saying the Long Beach amounts are higher than the state amounts. And the fact that the average rents in 2019 were approximately 1400 dollars here in Long Beach. And so currently the way that the ten and below policy works in the city of Long Beach is if you live in a studio, you get 27 or six'",
        "'speaker_4': 'and then it goes up to 4500, depending on the amount of bedrooms. Where we would like is for a policy that comes back hopefully soon, sooner rather than later, that just implements everything from HB 1482 and just substitutes the relocation amounts from the state policy to the Long Beach amounts in order to help protect some tenants from'",
        "'speaker_4': 'going homeless. Average moving amount right now for a lot of people that we work with is around $6,000. Even then, with the current Long Beach amount, that isn't enough for people to move out but is definitely a big lift and helping them find a new home.'",
        "'speaker_4': 'So we're hoping that you can revisit this item and, you know, hopefully maintain the Long Beach amounts one way or another. I'm pretty sure you could find some way of maintaining these amounts for their Long Beach residents. And hopefully you can find, um, you know, the perfect policy, which I know is going to be hard, but nonetheless'",
        "'speaker_4': 'it's doable. I also ask that you take a closer look at how are you going to repeal something? And I have another substitute ready to go. I don't think that the senior and disabled program will be ready to go by the time that the repealing of the tenant relocation policy is done with.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you so much. Liana Noble and Marlene Alvarado, please.'",
        "'speaker_6': 'My name is Liana Noble. I live in downtown and been active in our North Pine Neighborhood Alliance. There's several points of I'd like to make tonight. I appreciate that. There we have members of the council who have been consistent and clear advocates on affordable housing.'",
        "'speaker_6': 'However, what I am seeing now is a resident is that while you have your your intention of, as you put it, I think previously of clarifying what's going on and making it clear to landlords as well as to tenants what is applicable here in Long Beach in terms of the extreme housing crisis that we have.'",
        "'speaker_6': 'What I'm experiencing is somebody that pays a lot of attention to City Hall is that this is a critically important issue and yet it's being dealt with in a piecemeal basis. So my experience is that you are approaching a critically important problem that affects more than 60% of those of us who live here in Long Beach.'",
        "'speaker_6': 'And you are doing it piecemeal. That in and of itself is creating confusion. I would ask, therefore, that you not proceed with this sanction of relocation. If you rescind this, then you're adding to the confusion. You've made a made it public that you want to put together a program for seniors and disabled.'",
        "'speaker_6': 'And yet that is currently up in the air. In my neighborhood, we have.'",
        "'speaker_3': 'Three.'",
        "'speaker_6': 'Section eight senior housing towers, which doesn't begin to address the needs of the disabled and seniors literally living in our neighborhood. So if you look at the whole town and all of the other districts, this is a serious problem.'",
        "'speaker_6': 'And again, instead of coming to us with a package, you're doing it piecemeal. The other concern I have and the reason why I believe it is important that we have a Long Beach ordinance, is that the burden for enforcing these laws is falling on individual tenants.'",
        "'speaker_6': 'This is completely unacceptable as a tenant. We have we're in no shape to take on the corporate landlords.'",
        "'speaker_3': 'Or landlords that own.'",
        "'speaker_6': 'Properties here. If we have a local ordinance, you and our city staff can play a role in enforcing that ordinance. And as we know, the relocation ordinance here in Long Beach hasn't been implemented. It's not been enforced. We know of way too many tenants who aren't receiving the relocation benefit.'",
        "'speaker_2': 'Thank you so much. Thank you. Marlene Alvarado.'",
        "'speaker_7': 'Please.'",
        "'speaker_3': 'I'm only Alvarado.'",
        "'speaker_6': 'I'm in the first district. Quickly. I.'",
        "'speaker_3': 'I own a property. Not here, but.'",
        "'speaker_6': 'My tenants barely are able to pay rent, housing and everything else. I can't imagine anybody who is a landlord and takes out poor people and then expects them to pay for first and last month's rent. The state is not enough money for them to do that, especially here in Long Beach.'",
        "'speaker_6': 'It's really important that we continue the amount of money that we have already passed this law, which is more than what the state has. Gee, I can't. I can't. It breaks my heart to see so much greed here.'",
        "'speaker_6': 'I mean, this is Christmas, and I make a decent living charging reasonable rents. Why? I wouldn't want to kick out my tenants. They're really good people. They're hardworking people. And that's what's happening with most poor people who do this to the poor.'",
        "'speaker_6': 'It's tragic. Thank you.'"
    ],
    "Feasibility of a Long Beach Community Choice Aggregation (CCA) and Next Steps.": [
        "'speaker_2': 'Thank you. There's a motion and a second. Members, please cast your votes. I know we're having some delays with the motion carries. Okay. Thank you. We are moving on to item 20, please.'",
        "'speaker_0': 'Item 20 Report from Energy Resources, Financial Management and Water Department Recommendation to receive and file a report on the feasibility of a Long Beach Community Choice aggregation. Direct the city manager to continue to monitor the energy market regulations.'",
        "'speaker_0': 'Prepare a study that analyzes the potential CCI governance options of forming a standalone city enterprise. Perform community outreach regarding the concept along with potential benefits and risks to customers. Continue the city's partnership with Southern California Edison to raise awareness of existing programs and defer for two years any decision whether to participate in a citywide.'",
        "'speaker_2': 'Thank you. This is actually a we have a change. We're not going to hear this item tonight. But I want to turn this over to Councilmember Pearce.'",
        "'speaker_3': 'Thank you. Yes, I'd like to make a motion to hold this over to February or March next year. We just haven't had enough time to really get our hands around the report.'",
        "'speaker_2': 'That's the motion in a second. So if I can, I do have four members of the public. The motion is not is not the report, but to move the item. And so if therefore, those four members, the public want to speak to that, I'm going to call them up now.'",
        "'speaker_2': 'Marlene Alvarado, Caren Reside, Dave Chocola and Larry Goodhew. I wouldn't want to speak on that, Mr. Goodhew. You want to speak on moving this? It's just on moving it, though, sir. Dave Shot Collection Resign. Marlene Alvarado. Do they want to speak on moving the item?'",
        "'speaker_2': 'Please come forward.'",
        "'speaker_1': 'Is this? Make sure I've got two kids over.'",
        "'speaker_2': 'This is just a motion to move Tim to February or March. The whole.'",
        "'speaker_1': 'Report. The issue dealing with the cannabis.'",
        "'speaker_2': 'No, this is not cannabis, sir. Okay. Thank you. All right. Marlene Alvarado.'",
        "'speaker_6': 'You know, once again, I'm with the First District, and I think this is a really good.'",
        "'speaker_0': 'Alternative.'",
        "'speaker_3': 'To climate change. Right now, we're.'",
        "'speaker_6': 'Having an existential crisis. You, city council member, will not stop.'",
        "'speaker_3': 'Extracting oil from our land.'",
        "'speaker_6': 'And we have to stop it. But this is going to be the best thing that we can we can have. I would prefer that all of you stop accepting money from from the oil companies and also that we stop getting our taxes from oil companies.'",
        "'speaker_6': 'This is a good solution.'",
        "'speaker_2': 'Thank you. So. I just wanna make sure that we speak to moving the item, not the item itself. So. Thank you. Misery side.'",
        "'speaker_6': 'Karen reside in the First District.'",
        "'speaker_3': 'This is a really critical.'",
        "'speaker_6': 'Item for our city, and it's apparent that we're not going to make the December 31st deadline for this year.'",
        "'speaker_3': 'So moving it with the intention of.'",
        "'speaker_6': 'Establishing a deadline of December 31st of 2020 would be.'",
        "'speaker_3': 'Preferred by the Long Beach Panthers.'",
        "'speaker_6': 'And we feel that this is an opportunity to impact climate change and to shift the direction that our city is going in. We are heavily dependent upon oil.'",
        "'speaker_3': 'But the marketplace is going to determine.'",
        "'speaker_6': 'When the value.'",
        "'speaker_3': 'Of oil is greatly reduced. And we need to be looking forward to that because it's going to happen sooner than we all expect.'",
        "'speaker_6': 'But the developments are a new form of energy, so we support moving this to March.'",
        "'speaker_2': 'Thank you. And Mr. Shukla. Dave Shukla Oh.'",
        "'speaker_1': 'Shukla Third District. Can I support the motion? And I'd like.'",
        "'speaker_7': 'To alert the council to.'",
        "'speaker_1': 'Ab11 722.'",
        "'speaker_4': 'And SP 719 2011, along with the CP C guidelines on I.O.U. Neutrality concerning.'",
        "'speaker_7': 'Community choice.'",
        "'speaker_1': 'Programs. Thank you.'",
        "'speaker_2': 'Thank you. That concludes public comment. There's a motion the second to move the item to February or March. Please cast your votes.'",
        "'speaker_0': 'Council on Sunday has. Washing washing cars.'"
    ],
    "Lease Agreement with Platinum Capital for Office Space at 500 West Willow Street.": [
        "'speaker_2': 'Thank you. And now we're going to go back to item four, which is pulled from consent. I can read that item, please.'",
        "'speaker_0': 'Report from Economic Development Recommendation to authorize City Manager to execute all documents necessary for a lease with Platinum Capital Inc for office space at 500 West Willow Street, District seven.'",
        "'speaker_2': 'Thank you. We can, Mr. Councilman, regular. Do you need a report or anything on this or.'",
        "'speaker_7': 'Yes, I'd like to.'",
        "'speaker_1': 'Bring up Mr. Nick Schultz from the Pacific Gateway.'",
        "'speaker_7': 'Programs so he can give us a little bit of an update as to what this project is all about. That's in the Senate district. And I think it would be very.'",
        "'speaker_1': 'Beneficial to get more information as to what is coming to the seven.'",
        "'speaker_4': 'Council member. Yeah, good evening. This is really an exciting project for us in.'",
        "'speaker_1': 'Economic development and a wonderful economic development resource for our youth. I actually have Nick Schulz, our deputy director and executive director of Pacific Gateway, to talk a little bit about the services and resources that will be available.'",
        "'speaker_4': 'Thank you, John. Honorable Mayor, members of council. What we're looking at with this item is a satellite center to our workplace at 4811 Airport Boulevard. It's about a 7900 square foot facility on the on the block of Willow between Daisy and Magnolia.'",
        "'speaker_4': 'It would actually be the furthest west workforce services have ever been located in the city. It also places us in close proximity to our youth Starbucks store at Willow in Long Beach, as well as Silverado Park and Cabrillo High School, where we have some workforce programing continually going specifically to the Teen Logistics Academy with the Port of'",
        "'speaker_4': 'Long Beach at Cabrillo Cabrillo High School. It's along a major corridor and near the metro will stop and service by bus lines one or 2104 and 181 along Magnolia. It currently provides a a much needed space for our youth program services given the.'",
        "'speaker_4': 'Rejoining of our city staff at 4811 Airport Plaza by the Employment State Employment Development Department. Everything that we're doing at the site is funded through federal and special grants. No city funding is dedicated to this space so far.'",
        "'speaker_4': 'You'll be seeing a new future. L.B. Brand. That will. Co-design the space around specific input and a human centered design process with city use city youth. 4700 square feet of the 79 is dedicated to the youth center. It includes spaces for mental health training, afterschool homework, mentoring, meeting areas and conference room for other academic projects.'",
        "'speaker_4': 'Will House projects in this site, delivered in conjunction with the Health Department for Precariously House Youth, and it will serve as a portal to training and services citywide, not just those federally funded programs. We may include other partners like Job Corps in the center.'",
        "'speaker_4': 'Six staff will be dedicated there, teaching and leading our programs, and it will have both day and evening hours. Also, what we're excited about is we're going to dedicate 3200 the remaining 3200 square feet as a full satellite extension of the work place and on spring for staff to provide a whole host of adult career advisement.'",
        "'speaker_4': 'And we're also negotiating with other partners to provide adult services in that space. Normal work hours and some evening activity well will transpire for our adult clients. A little bit about the design. The rear entrance from the parking lot will be for adult services under the workplace banner and the front willow street entrance will be the future'",
        "'speaker_4': 'will be youth service entrance. It's a flexible modern design. New staff. New storefront windows will allow you to see right into the lobby area. It's a bright and inviting space. Classrooms will have walls, glass to see deep into the building and watch programs as they happen.'",
        "'speaker_4': 'So youth who wonder and can actually see what's going on. A pause there and I'll take any questions that the council might have.'",
        "'speaker_1': 'A very extensive description of the facility there. I could see that you're going to be providing services for both youth and adults, as well as adults experiencing other kinds of challenges. As you mentioned, there are some behavioral health and some perhaps some housing as well.'",
        "'speaker_1': 'You also, during our discussion earlier yesterday mentioned that there were some other facilities that are there. So what's what makes this facility unique in than other facilities that you might know exist for this type of services?'",
        "'speaker_4': 'Sure. And I think that ties directly to the point about homeless the homeless or transitional youth that we talked about many times. We experience the fact that that youth or even other customers don't want to enter into the facility because they're they're bringing possessions, their belongings with them.'",
        "'speaker_4': 'They don't have any place to store them. There is dedicated storage at this facility for youth and adults to store belongings as they as they seek to access services. There's also a very extensive remodel to that, to the restroom facilities that allow for our participants to take some time, get themselves cleaned up in a way that in'",
        "'speaker_4': 'other facilities we don't have the opportunity to offer them.'",
        "'speaker_7': 'And that sounds great.'",
        "'speaker_1': 'Now, the the funding is current is currently targeted towards federal funding or state funding or a combination of the two.'",
        "'speaker_4': 'Right now, the facility would be supported by our federal formula funds and a series of competitive grants that we have for youth.'",
        "'speaker_1': 'And with the upgrades and the remodel that you have to do with the what do we anticipate in terms of opening, getting this ribbon cutting? I'm certainly looking forward to that.'",
        "'speaker_4': 'Second quarter of 2020. We hope to be in there by April, May at the latest.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_7': 'So given that this is a new facility, that going to be sure we've seen.'",
        "'speaker_4': 'A lot of.'",
        "'speaker_1': 'Youth and adults in the seventh District, especially when you're looking at the West Long Beach area where a lot of services are most desperately needed. I would.'",
        "'speaker_7': 'Hope that I could get the support of my my council colleagues to.'",
        "'speaker_1': 'Move this forward. Thank you very much.'",
        "'speaker_2': 'Thank you. There's a motion and a second count, Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. And I wanted to chime in and just say, first of all, congratulations. This is this is a big deal. We've been talking for over a year about decentralizing work force, particularly for youth who have, you know, transportation, transit issues.'",
        "'speaker_1': 'And so you've you know, we've talked about this. The Local Workforce Workforce Development Coalition has talked about it. Everyone in committee has talked about it. And here we are. You've you've identified a great space, you know, former, you know, former swap meet, right.'",
        "'speaker_1': 'That's been redeveloped. And, you know, it's got some great retail in the space now. And so now is going to be a hub for for jobs. I think that's great. And I want to I want to acknowledge that lift that up.'",
        "'speaker_1': 'Councilman Urunga, great job in landing this. And I know we have more conversations about continuing to expand into our parks and other things. So I wanted to just lift that up and say, this is great work and I wanted to recognize it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'I want to say thank you, Councilmember. We heard you. We heard the conversations and more to come in terms of expansion of services in 2020.'",
        "'speaker_2': 'Thank you. There's a motion in a second with no public comment, so please cast your votes.'",
        "'speaker_3': 'Councilwoman? Yes.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Interim Park Use Permit and Categorical Exemption for Community Garden at 914 Redondo Avenue.": [
        "'speaker_2': 'Thank you. We are now we have two hearings which we need to do. And so we have both hearings at 715 and 16. They both require an oath. So I'm going to go ahead and have Vice Mayor Andrews begin the first hearing.'",
        "'speaker_0': 'May the witnesses please stand. You see the UN each of you solemnly state that your that the testimony you may give in the course now pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_0': 'So help you.'",
        "'speaker_3': 'God. Linda Tatum, director of development services, will be providing the report.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_6': 'Good evening. Council, we're pleased to present this is the first community garden permit since the Council adopted that new legislation about a year ago. And I would like to introduce Nick Voss, a taste of what the project planner to make tonight's presentation on this item.'",
        "'speaker_7': 'Thank you, Linda. Good evening, Mayor Council. The project site is located on the east side of Redondo Avenue, between 10th Street to the north and eighth street to the south. The property is located in the neighborhood of commercial and residential zoning district.'",
        "'speaker_7': 'The project site currently consists of a 6250 square foot vacant lot. Redondo Avenue Street consists of a mix office and residential corridor, and the subject is generally surrounded by dense multi-family residences. Vacant lots have the potential to attract nuisance activities such as illegal dumping, lack of maintenance, visual blight and create criminal activity disrupted neighborhoods.'",
        "'speaker_7': 'In addition, vacant lots may negatively affect the value of adjacent properties. In 2017. And in recognition of these problems, the City Council amended the Long Beach Municipal Code to discourage vacant lots through a vacant light registry requirement to facilitate positive uses such as these urban uses.'",
        "'speaker_7': 'The proposed community garden will establish use beneficial to both the individual gardeners and people living and working nearby by improving a blighted, vacant lot with the term temporary argues. The improvements will consist of 2210 by ten rentable plots, two five by 15 raised rentable plots intended for the elderly.'",
        "'speaker_7': 'One prefab tool shed approximately four by four by six feet high, one arbor, eight by 16 by eight. Eight spigots and water hoses. And one compost and one mulch area. The applicant. Long Beach Organics Inc is a local nonprofit organization founded in 1994 and is seeking to operate its eighth location here in the city.'",
        "'speaker_7': 'Here's a photo of the various sites scattered throughout the city, and they include the Pacific in six Mary Molina, seventh and Chestnut Zafira Aria Junction or Zomba Park and South 40. Some of the community benefits that come with establishing a community garden on a vacant lot include one reducing vegetable blight and protecting property values.'",
        "'speaker_7': 'Two, promoting safety and reducing nuisance activities such as overgrown weeds, illegal dumping.'",
        "'speaker_4': 'Squatting and loitering.'",
        "'speaker_7': 'Three provides a local and organic food source that eliminates smells of food travels from production to consumption. And four provides more walkable, bicycle accessible destination with non-motorized vehicles and would be consistent with the city's sustainability goals. The general plan land use element and the draft climate action adaptation plan.'",
        "'speaker_7': 'In review of the required findings needed to be made in the formative staff, has found the project to be compatible for the neighborhood in compliance with all the applicable development standards, allowable hours of operation parking and refuge provisions as provided in your packets.'",
        "'speaker_7': 'Additionally, the proposed community garden has been conditioned to ensure that the property will continue to be operated in a neat, quiet and orderly manner. So the use will not be detrimental to the adjacent properties and occupants in the area.'",
        "'speaker_7': 'Its preference and conditional approval number 18. Also conditional approval. Ten and 12 require signage to be posted on the site displaying the operating protocols along with the contact information of the community garden manager. So any problem or question arise.'",
        "'speaker_7': 'The project's environmental review is classified as a class for mine alterations of land and is categorically exempt from any additional environmental analysis. The project here is also being reviewed in tandem with the city's urban ag program and is part of.'",
        "'speaker_7': 'A future request. Public notices of her received application was sent to the Wiltshire neighborhood and Greenbelt Heights neighborhood associations on October 31st, followed by additional public hearing notices distributed November 21st in preparation of staff's report. No formal comments were received, however, leading to.'",
        "'speaker_3': 'The tonight's hearing.'",
        "'speaker_7': 'Staff did receive three letters of support and one letter of contention, accompanied by the petition of 93 signatures in opposition to the project, which is also included in your council packet. In summary of those concerns, they were centered around the topic of additional parking impacts, a place to attract homeless and transients leading to criminal activity in a'",
        "'speaker_7': 'place that attracts vermin. Staff's response to the comments acknowledges these concerns as existing conditions prevalent in the neighborhood and is in the opinion that activating this lot will ultimately be a step in the right direction and and ideally, hopefully reduce those comments or concerns.'",
        "'speaker_7': 'With that staff is recommending approval of the interim use permit IPU 1901 and C 19 239. This concludes staff's presentation. The applicant.'",
        "'speaker_4': 'Is also here in the audience today.'",
        "'speaker_7': 'Who may want to expand. It's nice presentation. Thank you. Mm hmm.'",
        "'speaker_5': 'Yes. Would the applicant like to speak on this?'",
        "'speaker_6': 'Thank you. I'm Valerie Condon. I am currently the president of Long Beach Organic, a nonprofit. We currently have seven community gardens. We're really pleased to be here at this point. We've been working for more than eight, nine months to get this garden approved and off the ground.'",
        "'speaker_6': 'It's been a lengthy journey from a done identifying location, negotiating with the landowner and actually signing the land lease with him in early summer. In August, we had a fundraiser specifically for the purpose of funding the construction of this garden.'",
        "'speaker_6': 'We had. $5,000 in net profit from that fundraiser in September. We were fortunate enough to be part of Long Beach gifts and we were able to raise another $6,000 for the purpose of constructing this garden. The cost of developing a garden of this size is approximately $17,000.'",
        "'speaker_6': 'That includes permits. Lumber, irrigation, fencing, signage. The bulk of our financial support comes not from our active gardeners. We have 170 different. Families units who garden in our existing gardens. The bulk of our support comes from the larger community.'",
        "'speaker_6': 'Over the years, we've received the matching grants from Southern California Edison and the Boeing Corporation from Wells Fargo and from the Floor Corporation. Home Depot and Lowe's have provided financial as well as in-kind donations. Long Beach Organic has been the recipient of several neighborhood improvement grants, and we have received the support of the City of Long Beach'",
        "'speaker_6': ', entrusting us with four garden sites we currently manage on City Park Land. The local community, these organizations and these companies believe in our mission and see us as good stewards of the land. Thank you.'",
        "'speaker_5': 'Thank you. Thank you.'",
        "'speaker_7': 'Honorable Mayor and council members. My name is Joe Corso. I have been garden director of Long Beach Organic for ten years now, but the organization has been around for 25 years with the simple mission of turning empty lots into organic gardens.'",
        "'speaker_7': 'We currently operate seven gardens in the city, providing 170 household space to grow food for their tables and to experience the joy and health benefits of gardening. In addition, we host two groups for the disabled and the children's nonprofit Adventures Two Dreams, Enrichment and an internship and volunteer program with CSU RB.'",
        "'speaker_7': 'We're a destination for the annual Make a Difference Day and Leadership Long Beach's Martin Luther King Day of Service. Our education program offers gardening and cooking classes to the broader community, and we recently began a kid's garden program, which will be expanding in 2020.'",
        "'speaker_7': 'Our gardens, they become focal points in their neighborhoods. Members get to meet each other sometimes for the first time, and an interest in gardening cuts across barriers and cuts across age, gender and ethnic lines. The proposed garden on Redondo would provide this opportunity for 20 more 24 more households on what is now a blighted mine.'",
        "'speaker_7': 'The demand is very high in this area, as our nearby garden, Safra Junction, has a year long waiting list, and we do plan to prioritize those who live closest, encouraging gardeners to walk or bike to the garden so we don't aggravate the parking situation.'",
        "'speaker_7': 'So I ask for a yes vote on this recommendation. Thank you.'",
        "'speaker_5': 'Thank you. Thanks.'",
        "'speaker_6': 'Good evening. My name is Oscar night. I live here in Long Beach. I do belong to.'",
        "'speaker_3': 'The Long Beach Organics. As a little girl, I was raised with my grandma and she taught me how to farm.'",
        "'speaker_6': 'She had a half acre. So by the time I was like seven or eight years old, I didn't even know what a kangaroo creeping was. So I share my garden with my children and also with the kids that I teach a cooking class at Saint Cyprian.'",
        "'speaker_3': 'It means a lot to me. I share with my neighbors who are vegetarians and vegans.'",
        "'speaker_6': 'They really like it. I also cook for them. So it really.'",
        "'speaker_3': 'Means a lot.'",
        "'speaker_6': 'To me and I really would like to see this go.'",
        "'speaker_3': 'Forward. And more land for gardeners because I do live in an apartment, so there's not a lot of area for me to do the gardening that I would like to. So being a member of Long Beach Organic, it gives me that privilege to do so and.'",
        "'speaker_6': 'To expand my.'",
        "'speaker_3': 'Gardening like.'",
        "'speaker_6': 'I would like to do so. So thank you for your time.'",
        "'speaker_5': 'Thank you. Next Speaker.'",
        "'speaker_4': 'Good evening, Honorable Vice Mayor and council members. My name is Tony D'Amico. I'm the vice president of Long Beach Organic District three, resident and co-director of Long Beach Fresh Local Food Policy Council. I wanted to take this opportunity to just give a little context for community gardening and urban agriculture.'",
        "'speaker_4': 'Sort of a quick debrief of where the city has gone in the past several years. We've seen a lot of growth in the past ten years or so thanks to leadership on this council and community efforts. There are currently 15 community gardens citywide, serving about 700 households and donating about 75,000 of produce annually.'",
        "'speaker_4': 'Seven of these are managed by Long Beach Organic. These figures have doubled since 2009. Around that time, the city established their first community garden policy, where community gardens were classified as open space, aiming to get gardens and large parks throughout the city.'",
        "'speaker_4': 'And this is where the requirement for the Interim Park permit was begun. This is proving to be a bit of a challenge because it's a quite an expensive, tenuous and confusing process to establish a community garden in Long Beach.'",
        "'speaker_4': 'You can't really see all the pipeline in one place for if you're trying to do an urban farm or community garden to understand how that might dictate your choices. And I think there's a lot of room for improvement.'",
        "'speaker_4': 'With Long Beach Organic, we've been shepherded through this process by development services staff, so we're grateful for that. But I don't know that like a starting group or a start up would really have the same privilege. And I would hope they would continue to work to streamline the process to make it more efficient and less affordable or'",
        "'speaker_4': 'more affordable for everyone to be able to thank you and thank you.'",
        "'speaker_5': 'Yes. Next speaker.'",
        "'speaker_3': 'Good evening, everyone. My name is Joanne Bentley. I live at the Cooper Arms at Linden and Ocean. It is a high rise condo complex and at the beginning of the year, one of my neighbors asked if I would like to partner with her in a community organic garden.'",
        "'speaker_3': 'And having spent 12 years in Las Vegas before moving out here in January, I thought, Yeah, I can grow anything there. So we have been stumbling over ourselves, growing artichokes and tomatoes and bell peppers and all kinds of peppers.'",
        "'speaker_3': 'And then we got another neighbor, Joe Dorn, who joined us, and he can do the hard stuff between the three of us. We're learning. And the cats have tricked us. They killed our artichokes. They thought they were Airbnbs.'",
        "'speaker_3': 'So we're learning as we go day by day. And our goal, my goal. I think we can do it. There is apparently a food bank somewhere in Long Beach. People have been talking about and my ears went, okay, we can do a ten by ten.'",
        "'speaker_3': 'My tenant goes to the food bank. I don't know where it is, but we can grow enough food. And I drove past 914 Redondo yesterday. That place has some healthy, tall, green weeds. A lot better than we're doing over on 20th and Santa Fe.'",
        "'speaker_3': 'And as far as.'",
        "'speaker_6': 'Parking, the parking on Redondo is.'",
        "'speaker_3': 'Better. And we're only there for an hour because there's no bathroom.'",
        "'speaker_5': 'Thank you very much. Yes.'",
        "'speaker_3': 'Good evening. I am Misty. I live in First District support Long Beach Organic and ask the council to vote yes to permit the new garden proposed for ninth in Redondo and greeted my sixth street sixth grade schoolmate one day.'",
        "'speaker_3': 'He answered Diane a little bit every day. This made me mad. I knew it was true, but we were kids. And that's not what you say when a friend asks how you're doing this year, that friend and others asked me how I'm doing.'",
        "'speaker_3': 'More than ever I have answered Not great. And hanging in there. My reality mirrors my friends words decades ago laid off from work. Five Rent increases on a fixed income escalating violence at the neglect of the building. I have called home accidental deaths of a 14 year old nephew and within weeks an uncle on Easter Sunday, disability'",
        "'speaker_3': 'caused by stage four cancer. Months of debilitating treatment and side effects. Mental distress from all of the above unknowns within my body, mind, space and reality have become kryptonite that poisons my Virgo superpower daily. Through this Long Beach, Organic is helping me coping healing in many ways.'",
        "'speaker_3': 'My neighbors fellow seventh and chestnut gardeners rallying help maintain my plants, share their veggies and make me smile when I barely have the will to do so. I eat broccoli organically grown from seeds I learned I can buy with the monthly $15 I get on an event card, I retreat to the garden safe green space as violence'",
        "'speaker_3': 'and property destruction threaten me. Despite calls to authorities. When I joined Long Beach Organic, I was working healthy, safe and thank you and I thank you.'",
        "'speaker_5': 'Thank you so much. Next.'",
        "'speaker_3': 'Good evening. My name's Margo McCall, and I'm a Long Beach organic gardener in the area garden. And I've also been a neighbor of the Zachariah Garden for ten years. And when I was looking to buy property in Long Beach, I looked for a property close to an organic garden.'",
        "'speaker_3': 'And, you know, in all the years that I've lived near the garden, you know, I've never seen, you know, an increase in, you know, homeless people or, you know, vermin. So I think those fears are, you know, maybe not founded.'",
        "'speaker_3': 'And in regards to the parking, the gardeners, they'll show up. You know, many of them live in the neighborhood. So we'll just walk down to water our garden and that takes like ten or 15 minutes. And those that drive, they'll drive, they'll park and just stay a few minutes and then leave.'",
        "'speaker_3': 'So I'm not sure that, you know, it would add to the parking, but to me, the benefits are, you know, immense in regards to everyone's already mentioned, you know, building community, cutting across divides. There's also support for the pollinators, you know, bees and, you know, green space.'",
        "'speaker_3': 'And it's also adding to Long Beach's reputation as like a livable, progressive city. So I hope you support the additional garden because there is a waiting list. Thank you.'",
        "'speaker_5': 'Thank you. Next week place.'",
        "'speaker_3': 'Hi. My name is Patricia Davenport. I'm a 20 year Long Beach resident, and I live adjacent on the map that you just put up there on the board to the property over at 915 Newport. Hi, Suzy, good to see you again.'",
        "'speaker_3': 'My concern and I'm here to speak against your approval for this garden on behalf of myself and 97 other people in the immediate area who signed and submitted a petition to stop this garden. None of us has objections to community gardens in general and their ability to add to the community.'",
        "'speaker_3': 'We just don't feel that this is an appropriate site. This is a standard residential lot. It is not like this. Alfred Theresa Gardens, which are on a community, are community gardens on a real easement, much larger and safe interior, while it is a wonderful community garden, has not been without its issues.'",
        "'speaker_3': 'And I'm not talking about vermin, I'm talking about break ins and theft and vandalism. My concern on this area is it's a very small lot. And as your representative pointed out, it's only 6200 square feet. And if you set out plots that are ten by ten, that's roughly the size of a white canopy.'",
        "'speaker_3': 'Not a lot of space to grow things in. The parking in the trash have already been brought up. There are only two access points the Alley and Redondo Avenue. Most of the business owners on Redondo Avenue would describe to you their difficulties in having parking for their customers.'",
        "'speaker_3': 'The alley has been a nightmare, I can tell you personally. Thank you. Fires that have happened in the last five years. Thank you.'",
        "'speaker_1': 'Hello. My name is Joseph Dorn and I also live at the Cooper Arms building on Ocean and Linden.'",
        "'speaker_7': 'Downtown Long Beach.'",
        "'speaker_1': 'I'm a recent I'm actually a California native. Can you hear me? Sorry, I'm not used to, Mike. First, I'd like to excuse my appearance. I'm a carpenter, and I came here not wanting to be late, so I'm a little bit humble in my appearance.'",
        "'speaker_1': 'I'm sorry. As a new resident of Long Beach, I'm very much for this program. I was raised by people. My grandfather, my maternal grandfather was part of the Bracero program back in the 1930s, a works project type program developed by the government.'",
        "'speaker_1': 'I've always had my hands in the dirt and but by living here the last few years, I didn't have a place to do that. And now I do. And I'm grateful for that. That life is blighted now, and I understand the concerns of the previous speaker.'",
        "'speaker_1': 'It's very real concern. But I don't believe this type of project brings any negatives to what is there now. And I think even in the short term, if we can consider putting this garden in there, maybe it sometime in the future reconsider it.'",
        "'speaker_1': 'But for now, this is a positive and I'd like to support it. Thank you for your time.'",
        "'speaker_5': 'Thank you very much. Thanks.'",
        "'speaker_6': 'Speaker Hi, my name's Lourdes Patrick Grayson, and I'm a resident of Miami for 36 years. I have a bachelor's in child development and I'm also a master gardener through UCLA Extension Program. I taught preschool at the Apogee CC for 12 years, teaching everything from reading and art to gardening.'",
        "'speaker_6': 'Through my years of gardening and teaching, I've learned many of the benefits of gardening in early childhood. However, tonight I'm here to talk to you a little bit more. My Personal Experience on the therapeutic benefits of gardening. My son was born on December 18, 2018.'",
        "'speaker_6': 'He was born with a very rare genetic brain disorder called Ponto cerebellar hypoplasia. It's a short. Unfortunately, my son passed away on November 2nd and I reached out to Long Beach Organics and I was fortunate enough that they were able to have a pop for me to that.'",
        "'speaker_6': 'I'm sorry. The garden's allowed me to be.'",
        "'speaker_3': 'Able to dig and pull weeds.'",
        "'speaker_6': 'And have a place to go to where I'm upset. But, you know, I have community.'",
        "'speaker_3': 'Gardeners and friends.'",
        "'speaker_6': 'And a place where I can just remember him and be happy. So please remember that gardening is not just about food and community, it's also about their peace as well. Thank you.'",
        "'speaker_5': 'Thank you. Thanks. Here.'",
        "'speaker_3': 'Hi. My name is Jacqueline Case and I am here to support when everybody is here is for Lomita Organics. And I hope too that you can actually reach out to the animal shelter as well. If if animals become an issue, that communities can work together and we can support not only the the actual Long Beach Organics, but'",
        "'speaker_3': 'also make sure that stray cats or any animals that can impede the the gardens that we can work in tandem together.'",
        "'speaker_5': 'Thank you. Next Speaker.'",
        "'speaker_6': 'Good evening. My name is Dee Johnson and I am a Long Beach Organic Gardener. I'm alumni also from Cal State, Long Beach and I have been in separate garden for.'",
        "'speaker_3': 'Over 16 or 17 years. Since its start.'",
        "'speaker_6': 'It has been extremely. Therapeutic.'",
        "'speaker_3': 'I find it to be a growth factor for learning about composting, about holistic eating.'",
        "'speaker_6': 'Health, good health, organics, care of bees, care of orchards, care of soil. Also, there have been quite a few children.'",
        "'speaker_3': 'That have been raised or have participated in the garden.'",
        "'speaker_6': 'Those children have been growing around us, and you can see how eager they are to come to the garden, roam the garden, learn about planting, learn about growing, seed care, etc.. So I just wanted to say tonight that I would like the Long Beach City Council to.'",
        "'speaker_3': 'Continue to support Long Beach Organic and.'",
        "'speaker_6': 'All the neighboring gardens.'",
        "'speaker_5': 'Thank you. Next speaker.'",
        "'speaker_3': 'Hi. My name is Ashley and I live on 909 Newport, which actually backs up to this vacant lot that is currently there. I think what I would just like for you to consider is we've had a lot of discussion about the community garden and obviously all the assets that it brings, and that is undisputable.'",
        "'speaker_3': 'But we haven't talked a lot about the location of this particular place. And I can tell you that vermin homelessness is a massive problem in that area and especially with an enclosed space. I had an enclosed I have an enclosed space with my friends and I've had people try to live there, homeless people living there, look through'",
        "'speaker_3': 'my fences backyard so that there's no dispute that the gardening is an absolutely great addition to our community. But I'd really, really appreciate if you could consider this location the lot on Redondo, a busy street. And again, there's a big problem with the homelessness and alley and tons of rodents.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_5': 'Thank you. Next speaker.'",
        "'speaker_3': 'Thank you. My name is Jose Jenniskens. I am an original gardener at the Zahran Zakariya.'",
        "'speaker_1': 'Junction Garden Farm. Originally the Wild.'",
        "'speaker_3': 'Oats Gardens there on 10th.'",
        "'speaker_1': 'And Grand.'",
        "'speaker_3': 'My husband and I.'",
        "'speaker_4': 'Garden there since 2004.'",
        "'speaker_3': 'We were also both on the.'",
        "'speaker_4': 'Board of Long.'",
        "'speaker_3': 'Beach Organic for a period of.'",
        "'speaker_1': 'Time. My husband Spencer.'",
        "'speaker_3': 'Was the president for a while while we were on the board. We had the great.'",
        "'speaker_1': 'Fortune to usher in.'",
        "'speaker_3': 'The Wrigley.'",
        "'speaker_4': 'Garden, which was on.'",
        "'speaker_3': '20th and Pacific, I believe, which is.'",
        "'speaker_8': 'Similar. It was mixed use, quite a bit of commercial there.'",
        "'speaker_3': 'And when Long Beach Organic took that lot over, it was a mess and it.'",
        "'speaker_8': 'Was filled with.'",
        "'speaker_3': 'Weeds, it was filled with trash. And the neighborhood, I think, was at first a little bit suspicious about it, but very quickly came to embrace the garden. It became a haven for people in the neighborhood. It became a gathering place for people in the neighborhood.'",
        "'speaker_1': 'It was beautiful. It provided a place, a place.'",
        "'speaker_3': 'For local residents to.'",
        "'speaker_4': 'Garden.'",
        "'speaker_3': 'And to meet their neighbors. And it was it was a sad day when the landowner decided that she needed to sell and we had to give that garden up. I just wanted to also point out that both the police and the fire department were appreciative of the fact that it was in use and being watched.'",
        "'speaker_5': 'Thank you. Thank you very much. This is the last speaker I'm looking.'",
        "'speaker_3': 'My name is.'",
        "'speaker_5': 'Not you, the young man. You're the loudspeaker. Okay.'",
        "'speaker_3': 'Go ahead. My name is Susan Pound. My address is 908 Redondo Avenue, which is right next to 914. And I'm against this neighborhood garden. I have lived in this neighborhood for more than 30 years. I have seen the amount of rodents and homeless people in this neighborhood and the like escalate to the point is no longer acceptable'",
        "'speaker_3': 'for a safe and healthy neighborhood. Transient people walk through the alley, digging through trash cans, turning the trash cans over, leaving trash over the alley, ruin subtracted it is trash. Cars are vandalized as well as garages in the alley, the commercial garden with its growing food to attract these homeless people and rodents, as well as more homeless'",
        "'speaker_3': 'people and rodents. And we really have here this commercial garden will create a place for these drones to come, to feed, to breed and to multiply. What is the commercial garden's plan to contain this problem? Okay. And people are saying that parking is okay in this neighborhood.'",
        "'speaker_3': 'I have witnessed this point now where I have to walk as many as five blocks away to park at times and whatever the weather is raining or nice, I have to walk home in the dark. And if I'm alone neighborhood so far away from my home in the dark.'",
        "'speaker_3': 'If I arrive after 5 p.m., there's often no parking, even five blocks away. Other streets close by, such as Newport, have the same problem. When I'm walking home from parking, I've seen people riding bicycles in the street, tossing the handles on cars, trying to break into them.'",
        "'speaker_3': 'Will there be more of these bicycle riders attracted to commercial garden? For whatever reasons, this neighborhood cannot support any more cars at all. Even if one person from the commercial garden has to park on Redondo Avenue, it will displace a person who lives in this neighborhood from parking their car, let alone all the vehicles who will need'",
        "'speaker_3': 'to park from the demolition program and construction of this pool and this garden, this commercial garden is supposed to have the effect of increasing perceptions of neighborhood safety. Thank you.'",
        "'speaker_5': 'Thank you very.'",
        "'speaker_3': 'Much. Can I just say something? The police have not been able to control these problems in the neighborhood. So why should a commercial garden be able to make it safer?'",
        "'speaker_5': 'Thanks, Mika.'",
        "'speaker_1': 'Hi. My name is Raj. Where actually, I mean, owning businesses over.'",
        "'speaker_7': '18 years in Long Beach in the same.'",
        "'speaker_1': 'Sector on the corner. I love the idea of the gardening.'",
        "'speaker_7': 'And I support all the.'",
        "'speaker_1': 'Nonprofit.'",
        "'speaker_7': 'Organizations.'",
        "'speaker_1': 'In Long Beach and they meet at one of my restaurants right now where we get what I.'",
        "'speaker_7': 'Have right now to ask is we have a lot of vandalism, no parking. And a couple of the people here who spoke for the project.'",
        "'speaker_1': 'Know they've been living in the neighborhood for a long time and they knew that there's.'",
        "'speaker_7': 'No parking lot of vandalism, homelessness, if you guys are going to take care of that situation. And I have no issues with that. So I recommend seriously think about before you guys put a.'",
        "'speaker_1': 'A.'",
        "'speaker_7': 'Garden in the location. Just take care of that first and then go from there.'",
        "'speaker_5': 'Thank you. Thank you. Now, I would like to go behind the glasses.'",
        "'speaker_6': 'Thank you, Mr. Vice Mayor. So just a couple of questions. I want to thank everyone who came out tonight, but for our and Nick, wonderful job. Is this your first city council presentation?'",
        "'speaker_4': 'Well, yes.'",
        "'speaker_6': 'You killed it. It was awesome. Nice job. So can you tell me a little bit about the parking on Redondo itself, if you know. Is there public parking on Redondo?'",
        "'speaker_7': 'So on. Redondo There is public parking a limited amount. It's a free for all. And of course on the.'",
        "'speaker_4': 'Site there is nothing there at the moment.'",
        "'speaker_6': 'So people would have to park on the on street parking.'",
        "'speaker_4': 'Correct.'",
        "'speaker_6': 'And there are I notice in looking through the proposed permit that there are maintenance standards and trash standards, lots of conditions there that have to be complied with by the operator. True.'",
        "'speaker_7': 'That is correct.'",
        "'speaker_6': 'And do we retain would the city retain the right to revoke the permit if the conditions were not complied with?'",
        "'speaker_4': 'Councilmember Christopher comments. So yes, like any other entitlement or.'",
        "'speaker_1': 'Permit, we retain the ability to revoke.'",
        "'speaker_4': 'We would need to make a finding of fact and provide the applicant some due process.'",
        "'speaker_1': 'But at the end of the day we have the ability to seek them to correct. And if they don't correct to revoke the permit.'",
        "'speaker_6': 'Okay, great. Well, this this property has been vacant for many years. I want to say at least four years that I'm aware of. We've received complaints, a lot of complaints regarding the maintenance or lack thereof of the property as it currently stands.'",
        "'speaker_6': 'And so for years, we've tried to work through code enforcement, I know, to try to address some of the concerns, I'm sure, of those who live adjacent to the property. And, you know, while I understand the concerns of those who live around this proposed site and some of the fears that you have about maintenance and access.'",
        "'speaker_6': 'I'm supportive of this permit and I'm going to be supporting it tonight. And I'll I'll share with you why in a moment. But I do want to ask the residents who live adjacent to this property to take a copy.'",
        "'speaker_6': 'If you want to email me tomorrow, I will send you a copy of these conditions. I need you guys to help be my eyes and ears in terms of maintenance and what's happening there and what we can do to try to improve any situation that might present itself, whether it's related to parking, security risks or maintenance.'",
        "'speaker_6': 'I think this is a really great opportunity for us to be able to take this vacant, blighted property and turn it into something positive. I also know that I'm I'm happy to hear that you had a robust fundraising effort.'",
        "'speaker_6': 'The third council district is also going to give you guys 20 $500 towards your efforts. So we want to support you. And we also want to be able to have our interns involved in sustainability projects. So my office I'm going to ask you guys to to send me an email tomorrow, if you wouldn't mind, so that I'",
        "'speaker_6': 'can be in personal contact with you. We can talk about how that relationship might work, because I think it's a great opportunity for our students at Cal State Long Beach to get to see how sustainability works and this whole concept of the community coming together.'",
        "'speaker_6': 'So, you know, a couple of times a year we can bring them there, maybe even have a third district plot where we can grow, grow some things and share with the community. But we would love to be engaged on that level.'",
        "'speaker_6': 'When I was a student at Cal State Long Beach, we did have a community garden right there at Bellflower where now sits vacant area. And really I couldn't agree more with everyone here in regards to the benefits of a community garden and I support it.'",
        "'speaker_6': 'I will say that as a council member, it's very difficult to have a community garden built in your district because of all the reasons and concerns that some of the residents raised. Sometimes community gardens are not maintained as well as the ones that Long Beach Organics is maintaining.'",
        "'speaker_6': 'And for me, that was a pivotal decision making point in terms of who's going to be involved in helping maintain this community garden. Because sometimes when those conditions are not followed, then it looks even more blighted than it did when it was a vacant lot.'",
        "'speaker_6': 'So I know that we have good partners, and because you operate them throughout the city and the city has chosen you as a partner on other occasions. And so I'm grateful for this opportunity. I do ask the residents who live near there to please keep me in the loop.'",
        "'speaker_6': 'We want to make sure this is not a detrimental impact on you. And a lot of that is speculation, right? So that's one of the things where we implement something. We need to watch it and monitor it. And I and I ask everyone to partner with us on doing so.'",
        "'speaker_5': 'Yes, Mrs. Spears. Okay. All right. Okay. Ms.. Longo.'",
        "'speaker_9': 'Thank you. I want to tell everyone how proud I am of you for taking this big step. I am not a green thumbed person. Inside my house is all silk plants. However, when I became a councilperson, I had always admired the community garden in my neighborhood, and I was strongly encouraged by my neighbors to take a chance'",
        "'speaker_9': 'and try. There was a comment made that a ten by ten plot doesn't produce very much. Once you have a ten by ten plot, you will feed your entire block spinach, tomatoes, squash the size of cantaloupes if you'd like, or watermelons if you get out of control.'",
        "'speaker_9': 'The community garden that I belong to donates 50,000 of vegetables to the homeless community and to the soup kitchens. And I think that talking through and I don't know a lot about this particular community garden, but I'm just going to say a couple of things.'",
        "'speaker_9': 'The entire city has vermin issues. Not nearly what some of the bigger cities in L.A. County have. But within the garden, when you have an active group of people, they watch for and support and trap and help control the garden as long as it's within state guidelines.'",
        "'speaker_9': 'And so, again, working with animal control is key. Parking during the year will probably not be a problem. But for your leadership of this garden to talk about your planting deadlines for spring and winter, that's what a majority of the cars arrive to do.'",
        "'speaker_9': 'Their planting maintenance throughout is going to be very, very light. And the turnover of cars and walking of people to and from the community garden reduces the number of people experiencing homelessness in the area and the mischief that goes on.'",
        "'speaker_9': 'Because when you have someone who goes into a facility for, let's say, a dental appointment, people know that those cars are left unattended for a longer period of time. A community garden has no designation. Any criminal who's watching can't tell if you're going for 10 minutes to water or an hour and a half to tend to your'",
        "'speaker_9': 'garden. And so it actually has a turnover and a security that at least in our community garden area, we have almost no homeless issue. The areas around us that are not as widely monitored do. But they they don't have the same opportunities.'",
        "'speaker_9': 'I want to comment and support the comments related to therapy. We have a lot of individuals in our garden who use gardening for therapy. We also have a lot of elderly individuals who it keeps them active and coming out.'",
        "'speaker_9': 'And so this is more than just vegetables. It's it's a bigger opportunity. And so for many of those reasons, I'm very, very supportive. You talk about trying to get rid of crime or trying to get rid of elements that you're not familiar with.'",
        "'speaker_9': 'There is nothing that works better than activation. You could never hire enough police officers to compensate for activation unless you had 24 hour police coverage standing on site. And still, sometimes that would be less productive than activation. And so I'm here to support.'",
        "'speaker_9': 'We've had a lot of lessons learned in our 65 years as a community garden. I don't know all those lessons, but there are people that are willing to help out. There are also many successful gardens under Long Beach organic, and I hope that one day, while there have been occasions over the last three years where many of'",
        "'speaker_9': 'the gardeners from multiple gardens have gotten together. I hope that we grow that and flourish it even more as more gardens come up. So thank you for working so hard on this, Councilwoman. It is very difficult to activate a space like this and it takes a considerable amount of work.'",
        "'speaker_9': 'And Suzy and her staff deserve a big vote of gratitude. Thank you.'",
        "'speaker_5': 'Yes, thank you very much. And with that, please cast your vote.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_5': 'We go back to item seven.'",
        "'speaker_0': 'Item seven is on the consent calendar. Would you like item?'"
    ],
    "Amendment to Entertainment Permit for Marina Wine.": [
        "'speaker_5': 'Which is the next item coming out?'",
        "'speaker_6': 'Next 1516.'",
        "'speaker_5': 'Oh, yes. Okay.'",
        "'speaker_0': 'Final report from Financial Management. Recommendation receive supporting documentation to the record. Conclude the public hearing and approve an amendment to the conditions of the entertainment without dancing permit issued to Marina Wine at 194 Marina Drive, Suite 101 District three.'",
        "'speaker_5': 'This is no one has to be sworn in for this.'",
        "'speaker_0': 'There is an oath for this item. If the witnesses will please stand. Do you and each of you do you solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_3': 'I have Brett, Jackie's business services officer, presenting the. Thank you.'",
        "'speaker_4': 'Good evening, our mayor and members of the city council. Tonight have before you an amendment to the conditions of the entertainment without dancing permit issue to relevant in doing business as marina wine located at 194 194 Marina Drive Suite 101 operating as a restaurant with alcohol in Council District three.'",
        "'speaker_4': 'At its meeting on November 5th, 2019, the City Council granted an amendment to the entertainment without dancing permit subject to approved permit conditions. The permit conditions approved on the number of November 5th required entertainment activities occurring indoors with all doors and windows closed be restricted from 7:00 PM to 10 p.m. Monday through Thursday, 8 p.m. to 11'",
        "'speaker_4': 'p.m. Friday and Saturday and 2 p.m. to 6 p.m. on Sundays. Entertainment occurring indoors with the roll up door facing the patio open is restricted to 10 p.m. Monday through Saturday and 6 p.m. on Sundays due to a procedural error that occurred during the hearing.'",
        "'speaker_4': 'The conditions were not approved as intended in the entertainment permit. As a result, staff recommends amending the permit with the conditions as contained in the hearing packet. We stand ready to answer any questions Council may have.'",
        "'speaker_1': 'And that concludes staff's report.'",
        "'speaker_5': 'Thank you. Councilwoman Pryce. Would you like to have. Publicly.'",
        "'speaker_6': 'Time's a charm. I'm hoping it passes tonight, and we don't have to come back on this one.'",
        "'speaker_5': 'And we do have public coming in. This is a good. You actually going to try to. Fine. Okay. Will you please cast your vote?'"
    ],
    "Urgency Ordinance and Report on Mobile Home Rent Stabilization.": [
        "'speaker_0': 'Motion carries. Item 17. Report from Development Services. Recommendation to request a city attorney to draft an urgency ordinance to temporarily limit mobile home space rent increases and direct the city manager to prepare a report on long term mobile home rent stabilization options citywide.'",
        "'speaker_5': 'I. When reporting that any.'",
        "'speaker_6': 'Mr. Vice Mayor, this is it. This is my item. Is it possible to get a staff report and hear public comment first?'",
        "'speaker_5': 'Thank you. Yes, that'll be fine. We have 13 individual. I can speak on this item. So could you please line up and you get 90 seconds?'",
        "'speaker_4': 'I think we're going to go with the staff report.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Everyone, please. Thank you very much. So, Patrick, you're our housing development bureau manager, will be given the staff report.'",
        "'speaker_7': 'Good evening, Mayor. City Council. On October 22nd, the City Council requested that the city manager research options for regulating mobile home park space rents. We've conducted some preliminary research on the California mobile home residency law. The number and type of mobile home parks in Long Beach.'",
        "'speaker_7': 'And Mobile Home Park. Rent stabilization ordinances in California. The California mobile home residency law regulates mobile home park tenancies, including rental agreements and leases, fees, terminations of tenancy and noticing. It does not limit the amount of rent increases, and it explicitly allows for rent increases to cover pass costs for capital improvements, taxes and other government fees.'",
        "'speaker_7': 'The morale also requires just calls for termination of tenancy and provides seven reasons for termination. Land. These parks are parks owned by a single owner, by a single owner or operator. Spaces in land lease parks are leased to mobile home owners.'",
        "'speaker_7': 'There are ten such parks in Long Beach containing 696 mobile home spaces. Seven of these parks containing 1139 spaces are not age restricted, and three parks with 557 spaces are restricted to seniors. 55 and over. About a hundred cities in California have adopted a rent stabilization ordinance or so RSS limit, annual base rent increases, often basing allowed'",
        "'speaker_7': 'increases on changes to the Consumer Price Index. However, RSA was still allow for owners to pass on capital, improved pass on capital improvements and other expenses to tenants, resulting in potentially significant increases to overall monthly rental expenses for tenants.'",
        "'speaker_7': 'RSS also require the establishment of a rent control board and ongoing city administration and enforcement result resulting in potentially significant cost to the city. Those costs would likely be passed on to tenants as pass through fees and some jurisdictions have repealed their are also due to excessive litigation.'",
        "'speaker_7': 'Terms of recommendations and next steps the city council could receive and file staff's report and take no further action at this time. Or if the Council would like to consider restricting mobile home spaces rents. The Council can consider today's recommendation to request the city attorney to draft an urgency ordinance to temporarily limit mobile home space rent increases'",
        "'speaker_7': 'and direct the city manager to prepare a thorough report on long term mobile home rent stabilization options. This will involve hiring an expert consultant to assist staff with research, the preparation of a report and the development of recommendations for the Council's consideration at a future date.'",
        "'speaker_7': 'That concludes my presentation. Thank you.'",
        "'speaker_5': 'Thank you very much. Not only glad to have a wonderful comment on becoming so, we have a doting individuals. Would you please line up? Actually, it's a win. Deborah. Tom Lockhart, very silly. Karen Irvine, those individuals, you have 90 seconds.'",
        "'speaker_3': 'Hello, Council. With great respect, I wanted to speak on this. My name is Windsock. I'm a mature mobile estate resident and I wanted to report to you the newest information that we've received at 245 this afternoon. Our attorney, as you know, had been put in touch with attorney Matt reports for park ownership.'",
        "'speaker_3': 'And that occurred on November 18th when Susie Price, our respected counsel women, had facilitated that connection. And so on the 19th, Rich Anthony facilitated the introduction of the two attorneys. They proceeded to dialog and make progress with respect to some of the nuanced language in the most recent offer that we received, one which was dated actually it'",
        "'speaker_3': 'was dated the 18th, but we received it. What I'm saying is that we have this information that we've not been able to process yet. It's been scanned into the record, so you should have it available to you. I'm not lobbying for a moratorium or against a moratorium, simply asking for more time to assimilate the information in this'",
        "'speaker_3': 'most recent communication.'",
        "'speaker_6': 'From Attorney Matt Reps. To our attorneys so that we can understand why.'",
        "'speaker_5': 'Thank you very much next week.'",
        "'speaker_3': 'Honorable Mayor and city council members. Thank you for bringing this back up on the agenda from November 19th. We appreciate your report. And we look forward to a positive outcome as and when just explained. And we just got new information in in the content.'",
        "'speaker_3': 'It's two pages long with very fine print and very a lot of information. Six times it mentions that everything will be confirmed later in a written document. So it's almost like a proposal that maybe this and maybe that it's better than the situation we were in before.'",
        "'speaker_3': 'You mentioned in your report about capital improvements or I don't think you talked about gambling premiums, you're talking about capital expenditures. And I talked to a gentleman yesterday who's lived in the park for 30 years. He says from his perspective, no maintenance has been done in the park the entire time he's lived there, except for securing the'",
        "'speaker_3': 'streets and being coming up to speed here. The last two years, we've been in progress with lots of maintenance things that should have been taken care of over decades, and it's just now coming almost to fruition.'",
        "'speaker_9': 'We've got a lot of places really in disruption still, even though.'",
        "'speaker_6': 'They're trying to get.'",
        "'speaker_3': 'Them by the by the end of the year. So we're asking probably we do need an ordinance, emergency ordinance, because at least it would put a halt to and we can still look at this documentation that just came today.'",
        "'speaker_3': 'And so we are in favor or support rent stabilization. If you want to go that direction.'",
        "'speaker_5': 'Thank you. Next speaker, you please state your name.'",
        "'speaker_3': 'Deborah McNamara. In 2011, there was another mobile home park in this and they raised the rent so high that people lost their homes, they had to walk away. Now there's 153 homes that people just walked away. And 2012 I moved into that mobile home park, the Belmont Shores.'",
        "'speaker_3': '2014, I moved my family, my parents in so I could take care of them. Well, they just passed away. So I have two houses in the game. If I have to lose my house because I can't afford to pay because their raise it, their goal is to raise our rents up to $2,000, they're going to go to'",
        "'speaker_3': '88%. Was there a second initiative that they gave us? $88 extra and for the next four years and what's going to happen in four years? They're going to do the same. They're going to raise another $88 until we get the total of $2,000.'",
        "'speaker_3': 'And who's going to be able to pay that? We're seniors. We're getting older. We're not getting younger. Thank you.'",
        "'speaker_5': 'Thank you very much. Next speaker.'",
        "'speaker_1': 'Tom Lockhart. I'm a resident of BSM, a mobile home park. We have received, as Wen said recently today, very promising news from our attorney, who has made considerable progress with the park owners to the point where it is an acceptable agreement now based on specific assurances from the property owner, which will be followed up in writing.'",
        "'speaker_1': 'We want to thank all of you for helping us over the past couple of months, but there is no further action needed from the council. And we all will have to remember when you're considering this moratorium in our last rent offer from the park owners, it very specifically said if a moratorium is passed, they will rescind all'",
        "'speaker_1': 'their rent offers and hit us with the maximum rent they're allowed, which is anything they're allowed. They could put it up to $2,000 a month on January 1st. That's the overriding consideration. We cannot afford that. So I ask all of you respectfully to vote against this moratorium motion.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Next speaker.'",
        "'speaker_6': 'Hello, I'm Mary Sealy. I live at Belmont Shores, Mumbles states. I too am against this building on the moratorium and the RSL, along with six of my neighbors that I was able to find out from. We can't afford to take the chance that they will follow through with their threat of raising it to market value.'",
        "'speaker_6': 'I spoke to Newport Pacific this week and they told me that if this does go through, they will raise our rent to the market value. So even if it does go through, I will lose my home because I cannot afford to pay that.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Next speaker. Thank you very much.'",
        "'speaker_3': 'Good evening, Vice Mayor and Council Members Karen and Goni from Belmont Shore Mobile States. First of all, I'd like to thank the council, the council and particularly Councilwoman Susie Price and Deputy City Attorney Rich. I really, really, really appreciated your input and your hard work towards getting us what we have today.'",
        "'speaker_3': 'Well, I would love to continue to pursue long term protection through an interim moratorium and eventually in RCO. We cannot do so due to the fact that our management Newport Pacific properties will remove any rent credits and charges the $2,000 a month effective January 1st to 2020.'",
        "'speaker_3': 'Therefore, we cannot place our residents in jeopardy by continuing working towards protection by way of an RCO. However, I do congratulate you on protecting the other tenants in Long Beach, and I only wish that you could have protected us.'",
        "'speaker_3': 'Mobile home owners. We're very captive tenants, and it would have been nice to to have the time to educate everyone on the council to really what an hour or so does in comment to the the report. I looked at a property down in Oceanside.'",
        "'speaker_3': 'There are also cost $6.30 to each tenant. So it's not very costly.'",
        "'speaker_5': 'Thank you very much. You know, I finished the first six because the next six speakers will be John Gonzalez, Greg and Kirkpatrick Lopez. And very good you. And Elsa and Maria. Those are the last six figures.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_4': 'Mayor and City Council.'",
        "'speaker_1': 'My name is Jared Gonzales. I represent Western Manufactured.'",
        "'speaker_4': 'Housing Communities Association, a mesa statewide.'",
        "'speaker_1': 'Trade association that represents mobile.'",
        "'speaker_4': 'Home park.'",
        "'speaker_1': 'Owners and.'",
        "'speaker_4': 'Operators throughout California. Mobile home park owners in Long Beach are mom and pop family owned businesses.'",
        "'speaker_1': 'Who provide an affordable housing solution to a few thousand Long Beach residents. Our partners are compassionate and care for the residents and from the parks they operate. They invest in their parks to help create communities both they and their residents can be proud of.'",
        "'speaker_1': 'That's the status quo in Long Beach. A moratorium is not needed. There is no widespread problem with rent increases for mobile home parks in Long Beach.'",
        "'speaker_4': 'A moratorium creates uncertainty and will stall plans.'",
        "'speaker_1': 'For park improvement.'",
        "'speaker_4': 'Moratoriums will create an unnecessary citywide tension between park owner.'",
        "'speaker_1': 'Park owners and residents that doesn't exist.'",
        "'speaker_4': 'Today. Therefore, I ask that council keep in place.'",
        "'speaker_1': 'What's been working for decades.'",
        "'speaker_4': 'And not move forward with an unnecessary limit on mobile.'",
        "'speaker_1': 'Home rent increases. Thank you very much for your time.'",
        "'speaker_5': 'Thank you very much. Next we go.'",
        "'speaker_1': 'Evening. Vice Mayor and council. My name is Greg Kirkpatrick. We own several mobile home parks in California mostly, and we own the largest one in Long Beach up at Villa Park up in North Long Beach. We've had a great rapport with our tenants for over 20 years.'",
        "'speaker_1': 'We've gone through increases. We've gone through all of the improvements to the parks similar to Belmont Shores. We've been involved with cursory met with certain council members, given our opinion, particularly based on our experience with other cities. We have several parks in rent stabilization, rent, court, rent control.'",
        "'speaker_1': 'We know how to deal. It's not our suggestion by any means to go that route, particularly a more a moratorium. It causes us as landlords to seek the highest rent possible because we don't know what the future is.'",
        "'speaker_1': 'So it impacts our tenants. What you guys decided to do tonight? We're a big advocate of meeting with the tenants. I personally got out of a big all hands meeting with a park in Northern California just this week.'",
        "'speaker_1': 'We are involved. We're passionate. We monitor these parks and we are concerned and we deal with some of them on a day to day basis. We have senior parks where they have fixed income. We deal with those people personally.'",
        "'speaker_1': 'We come up with customized rent structures, which is exactly from what I can tell is going on here. So I would not suggest going out.'",
        "'speaker_5': 'Thank you very much, sir.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_4': 'Hello, counsel. Once again, Alberto Lopez. Oliver here in support of the moratorium, supporting the mobile home folks as well. You know, the rents continue to go up and people are ending up in the streets. And I don't think it's right for mobile homeowners to end up losing their property because they can't afford a rent increase.'",
        "'speaker_4': 'We always hear, you know, landlords come in or owners come in and saying, well, I talked to my tenants or my mobile home residents, but not other landlords or not other mobile homeowners do that. Only a very few.'",
        "'speaker_4': 'And so I do support this and hopefully you take a stance in supporting homes for all and supporting our seniors as well as they fight for their homes. Thank you.'",
        "'speaker_5': 'Thank you very much. Next speaker.'",
        "'speaker_3': 'Good evening, city council. My name is Ailsa Tung with Long Beach forward. Here to stand in strong support of mobile home.'",
        "'speaker_6': 'Owners and mobile homes.'",
        "'speaker_3': 'Citywide rent stabilization for both mobile home owners and for rental tenants. This item is an urgency item and agree.'",
        "'speaker_6': 'With the urgency of this.'",
        "'speaker_3': 'Item. The urgency is to protect mobile home.'",
        "'speaker_6': 'Owners, to protect.'",
        "'speaker_3': 'Tenants, and to prevent homelessness.'",
        "'speaker_6': 'The urgency is not to wholesale repeal a.'",
        "'speaker_3': 'Local tenant protection ordinance without any regard to preserving the.'",
        "'speaker_6': 'Strongest parts of that ordinance. That's exactly what happened.'",
        "'speaker_3': 'Earlier tonight on item.'",
        "'speaker_6': '23 with the repeal of the.'",
        "'speaker_3': 'Tenant Relocation Assistance Ordinance. So once again, we stand in strong support.'",
        "'speaker_6': 'Of mobile home. Citywide rent stabilization and rent stabilization for all tenants.'",
        "'speaker_3': 'Let's protect tenants, protect mobile homeowners, prevent homelessness.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Thank you very much. That's.'",
        "'speaker_6': 'Good evening, council members. My name is Murray. I'm a proud Yuan resident since I migrated here at the age of three. And now I'm the director of Community Organizing for Housing Long Beach. I've been doing this work for about three, three years, and every day I saw a tenant.'",
        "'speaker_6': 'What they told me specifically was that LA Beach needs rent control. So last year, in 2018, we pulled paperwork to put rent control on the ballot. One thing we do know is that rent control works for the people that need it the most the poor, the elderly, people with disabilities, families on low income, etc. You already know'",
        "'speaker_6': 'this and I hope you do know this. It's very clear that tenant issues have come up substantially this year, and I invite you to expand the dialog on what needs to follow after this. We are directly connected all as tenants, and I am here to say that we support this.'",
        "'speaker_6': 'So to keep our diversity and our strength as a tenant majority city, what should follow next as examples is a local enforcement mechanism to allow both tenants and landlords to be a part of this bigger dialog. I just want to remind you all again.'",
        "'speaker_6': 'Each and every time I come up here to talk about tennis, to support tennis, to support families, I'll let you know one thing, that when tennis rise, our cities with our city will thrive. Support these tenants today. Thank you.'",
        "'speaker_5': 'Thank you very much. Mr. Good, are you planning on speaking? Goodbye. Just five.'",
        "'speaker_6': 'So I think to hook up right here took my laptop. I think this is the first time we've been doing this from the dais. So I'm going to hook up here and see if. It worked. Great. Excellent. So I want to thank everyone for coming out tonight.'",
        "'speaker_6': 'And I think a lot of the general comments we're hearing about rent control and tenant protections don't apply to this situation. And I'm going to talk a little bit about why it's apples and oranges. And I didn't know that before we started this conversation.'",
        "'speaker_6': 'So I'm going to go quickly through a timeline of events. So beginning in October, the Beaumont Shaw Mobile Estates resident started to contact my office about notice of a rent increase that they had received on October 18th. Within a short period of time, I filed a supplemental counsel item to educate counsel on our options, which happened earlier'",
        "'speaker_6': 'this evening and was continued to today as at a request, the request of the residents. On October 21st, I had a conference call with the residents attorney and our city attorney, Rich Anthony, who has been a tremendous partner to me and my team on this issue.'",
        "'speaker_6': 'I want to thank him for that. We've both learned a lot about mobile home law since October, and it really, really is not analogous to regular tenant law. And I'm going to talk about that some more. From a legal standpoint.'",
        "'speaker_6': 'On October 22nd, I spoke with the Belmont Shore Mobil Estate's owners and asked that they make several changes as a result of the discussion I had had with the resident's attorney the day before. So I did not waste any time.'",
        "'speaker_6': 'I was asked by the residents attorney. There were three deficiencies that he identified. I reached out immediately to the owners and they immediately complied on November 1st with the three things I asked for. On the on November 1st, they sent a revised contract with the changes that I had requested, which included extension of the rental credit for'",
        "'speaker_6': 'an additional time, a legally binding contract, which is what the residents attorney wanted, a subsidy program which the attorney did not ask me to ask for, but I myself asked for, and eliminating the timeline for signing the agreement, which their attorney did ask me.'",
        "'speaker_6': 'They agreed to all of those things. On November 18th, the city and I it's the city attorney and I met with the residents. There were hundreds of residents in attendance to discuss options and answer questions. Many residents indicated that they had not received their personal rent letters.'",
        "'speaker_6': 'On the very next day, the personal letters were received. They were hand-delivered, is my understanding, at my request to all of the residents. The council item was continued at the request of the residents and the Council office requested the management team ensure all residents have their letters and that they are all offered one on one meetings.'",
        "'speaker_6': 'Since that time, 18 one on one meetings have been requested and 18 have been completed. Subsidies have been given to every single resident that qualified. Ongoing discussions between the attorneys at the facilitation of our city attorney and myself has resulted in assurances by ownership that have taken care of.'",
        "'speaker_6': 'The main concern that I and this Council had, which was displacement and homelessness. And those discussions have resulted in assurances that will assist with those two critical issues. And our office has heard from residents as early as last week, letting us know that they were happy with the agreement.'",
        "'speaker_6': 'While happy is probably not the right word, but that they were satisfied that management had met with them. Some indicated that they did not want to come to council meetings and they felt intimidated to speak at the meetings with the residents.'",
        "'speaker_6': 'These were calls, phone calls and emails that our office received from residents saying that they felt management had come a long way. So going back to the October 18th item, I filed the supplemental. And when I did so, my intent was to protect residents from being displaced.'",
        "'speaker_6': 'That was my concern. That has always been my concern. What happens to the property in perpetuity? Who get it gets assigned to if someone moves out? What the property value may be are not my concern. My concern is displacement and homelessness of residents.'",
        "'speaker_6': 'I thought naively, that we should offer our mobile home park residents the same protections that we offer residents throughout the city and other rental situations. I did not know that mobile home law is very different. Specifically, mobile home law allows for a rental increase, a cap usually limited to CPI.'",
        "'speaker_6': 'But mobile home park law, which is state law, also allows for pass through payments by the property owner for improvements to the property. Now we can argue all day long whether what happened in the Belmont or Mobile Estates qualifies as an improvement or is deferred maintenance.'",
        "'speaker_6': 'But those are issues that cannot be litigated or adjudicated by the city council. Those are issues that would have to be litigated in a court of law or with an arbitrator. But at the very least, the property owner would believe that they can pass through certain payments, not just at the mobile home park in Belmont Shore, but'",
        "'speaker_6': 'at all mobile home parks. And there's also some question about whether the mobile home park owner can reassess the property to create a market rate as the base from which rental increases come. To me, that exposes residents throughout the city, not just in Belmont Shore, to risks that are unimaginable for them, especially when they are not requesting'",
        "'speaker_6': 'any change to their current situations. There are ten mobile home parks in the city of Long Beach, one in Council District three, two in Council District nine and seven in Council District eight. We have conducted outreach, outreach and meetings, and there is.'",
        "'speaker_6': 'These are what officially qualify as mobile home parks, according to our definition, I believe, according to the staff report. There is no desire in any other park at this time to take any action because it may result in additional risks to the tenants.'",
        "'speaker_6': 'There are only three parks in the city of Long Beach that are senior parks. So what has been accomplished as a result of the discussions since October? Well, I would say a lot, and I'm very proud of the accomplishments that we have made, and I'm going to go through them.'",
        "'speaker_6': 'The rent increases are now spread over four years, resulting in 8 to 9% increase per year. This is inclusive of improvements and pass through costs. Management has agreed at the request of the residents attorney to not raise rents beyond the legally binding amount, despite plans at Belmont Shore to conduct major improvements in the next year.'",
        "'speaker_6': 'In the next year, this mobile home park will receive a new clubhouse, a new pool, a new gym, a new library, a new lots of other features. And those costs will not be passed through to the residents as a part of this legally binding agreement, which to me is a win for the residents, I believe.'",
        "'speaker_6': 'A subsidy program was created and no resident will be displaced. I have been assured of that by the owners. I believe that. And if there is a single resident in here or you know of a resident who gets displaced as a result of income, please let me know.'",
        "'speaker_6': 'I guarantee you no resident will get displaced from the mobile home parks because of their financial status. Rental Assistance Program was created by the Belmont Shore Mobile Estates, and it's modeled after the Manufactured Housing Educational Trust Program, which operates now in multiple counties.'",
        "'speaker_6': 'But our program that we're using in Long Beach through the Belmont to our mobile estates is actually better because it doesn't have an age qualification. The Met program requires you to be 62 years old to get the subsidy.'",
        "'speaker_6': 'The Belmont Shore program does not require any age. Anyone can get it if they meet the financial requirement. It is not alone. Residents will never have to pay it back and a lean will not be placed on their homes.'",
        "'speaker_6': 'These are all things that we were able to negotiate with the property owners. Additional requests were made by the residents on by their attorney on Friday afternoon, this past Friday afternoon. Five requests were made. Three of those requests were agreed to by the mobile home park owners at my request.'",
        "'speaker_6': 'I spoke with them after seeing this list. I had a phone conference with them yesterday and I asked them to please identify some of those requests that they could actually meet. And out of the five, they came up with three.'",
        "'speaker_6': 'And I think that has made a lot of effort on their part. And one thing that I want to make clear is a decision for one park in the city of Long Beach will impact all of the parks.'",
        "'speaker_6': 'Not everyone may want to take the risks that are involved with a pass through laws for mobile home parks. We expect in the city of Long Beach that our landowners will work with tenants on setting rents and we expect them to be reasonable.'",
        "'speaker_6': 'We also expect. Fully that they will want to maintain their investments and get a return on their property. That is a reasonable concern for them and we expect that they should invest in our city with the hope that they will be able to maintain their investment.'",
        "'speaker_6': 'The goal of the council, should it get involved in situations like this, has always been to ensure that people are not displaced and find themselves homeless. We have accomplished that goal here. Absolutely no resident will be displaced from Belmont Shore.'",
        "'speaker_6': 'Mobile estates. So I ask my colleagues to support me in receiving and filing this report. I am asking that we not take any action at this time. I want to thank the residents and I want to thank the property owners for working together with us.'",
        "'speaker_6': 'This was a very unique situation for the city attorney and myself. We served in many ways as mediators in this process. And I think as a result of that and your engagement, we were able to make a lot of progress.'",
        "'speaker_6': 'I know not everyone is going to be happy, but a decision that we make today for one group of residents will apply to a larger group of residents, and some may not be as willing to take the risks as others.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_5': 'Thank you very much. With that, we actually have a personal first and second. Would you please cast your vote? Yes.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Ordinance to Authorize Local Temporary Cannabis Special Event Permits.": [
        "'speaker_5': 'I am 18. Clara, could you please regain item 18?'",
        "'speaker_0': 'Communication from Councilman Austin. Vice Mayor Andrew's recommendation to request the city attorney to draft an ordinance to authorize the city manager to issue local temporary cannabis. Special Event Permits.'",
        "'speaker_5': 'Good. We will do another report on that. Or you want. You take it.'",
        "'speaker_3': 'I need to speak. Need to speak first. Yes.'",
        "'speaker_5': 'Oh. Oh. Okay. Okay. Councilman Pierce, please.'",
        "'speaker_3': 'I plan on recusing myself from participating in this item due to the possibility of a conflict of interest. I have a financial interest in two business entities in the cannabis industry through prior consulting work with DHS, Verde LLC and Global Growth Investments and their principal partner, Danza Ronnie.'",
        "'speaker_3': 'While there has been no formal determination regarding the financial effects of this decision on these particular entities, I am recusing myself out of abundance of caution and would appreciate when staff notifies me that this item has been concluded.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Thank you very much, Councilman Orson.'",
        "'speaker_7': 'Thank you very much. So the Long Beach voters have repeatedly voted to approve the sale and use of cannabis in our city. Long Beach's ordinance allows for the cultivation, manufacturing, distribution and the sale of cannabis products. However, Long Beach Ordinance, Long Beach's ordinance does not address temporary cannabis events, and so they are not currently permitted.'",
        "'speaker_7': 'As of January 1st, 2018. The State of California began issuing state temporary cannabis event licenses, which authorize events with onsite adult use, cannabis sales and consumption pursuant to the state's medical and Adult Use, Cannabis Regulation and Safety Act.'",
        "'speaker_7': 'Some other cities in California have begun permitting cannabis related special events. For example, in Santa Rosa, the Emerald Cup has been successful, a been successful special event that features entertainment, education, competitions, sales and consumption. Last year, the Emerald Cup generated over $200,000 in tax revenue and about $17.3 million in total economic output for the community.'",
        "'speaker_7': 'The Convention Center has also received inquiries about holding trade shows for their cannabis or CBD products. Given Long Beach's success in hosting many notable special events. This seems to be an opportunity to include a local temporary cannabis special event at specific locations with controls in place for other special events.'",
        "'speaker_7': 'This could also be an opportunity for Long Beach businesses to benefit from these events, and the city can foster that local economic benefit. I understand that there are many factors that the city staff in the city attorney's office will have to look at and discuss to make this work as an ordinance.'",
        "'speaker_7': 'And I also understand the state law requires the city to identify specific locations in the ordinance where a temporary special event would be allowed. With that said, therefore, I would like to make a motion that is slightly revised from the agendas motion to request the city attorney to work with the city manager and appropriate departments, and in'",
        "'speaker_7': 'return to the City Council within 60 days with a draft ordinance that would allow the city manager to issue local temporary cannabis special event permits, provided that all appropriate criteria for special events are met. And at least 75% of the retailers at the event are Long Beach, based at the Queen Mary Events Park and allow the Convention'",
        "'speaker_7': 'Center to host cannabis CBD related trade shows business to business that involve the sale of such products without consumption. Ask my colleagues for their support. Thank you.'",
        "'speaker_5': 'Thank you, Councilman Orson. I do also you will second this motion because in fact, I think we need to have some form, you know, like I say, where we can go and see what are we going to work this?'",
        "'speaker_5': 'Because it can be. But in process, I think we still need to go to our city council. I see the attorney to find out what we have to do and can do. So thank you again for my colleague for bringing this forward to anyone and anyone.'",
        "'speaker_5': 'And honestly, I can speak on this item. Please, come on. State. Your name, please. Very good, Hugh.'",
        "'speaker_1': 'Not only repeating the objections I had last time this came forward. I would just say it's really a strong indictment. Of this council. You say that you cannot. Meet the needs of this city. Without the revenue from this.'",
        "'speaker_1': 'And I remind you, I'm reminded of the. The reprimand delivered by Haile Selassie. Decades ago. Relative to inappropriate behavior. The dollar cost of this. We'll be more than this city will be able to measure. I urge you to reject this.'",
        "'speaker_1': 'And find another way. You get center city revenues. Other than this. Absurd. Rely on relying on drugs. Thank you.'",
        "'speaker_5': 'Thank you. Mr. Goodman. The next speaker.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_10': 'Mayor, vice mayor and city council members, and thank you for the opportunity to speak with you this evening.'",
        "'speaker_4': 'My name is.'",
        "'speaker_10': 'Jim Louis and I'm the head of special projects for Red Light Management, as well as the festival director for the Emerald Crop, the largest and most respected outdoor cannabis competition and consumer event in the world. I bring over three decades of experience to the Emerald Cup and I've been producing thousands of events, concerts, festivals around the world'",
        "'speaker_10': '. Our company, Red Light Management, besides managing over 250 musical artists and more important to this conversation, has ownership in most of the major music festivals in North America, including Outside Lands with San Francisco, Lollapalooza in Chicago, Austin City Limits and South by Southwest in Austin, Texas, and Bonnaroo in Manchester, Tennessee.'",
        "'speaker_10': 'The Emerald Cup takes place each December in Santa Rosa. The resulting in economic impact to the region is significant. Per the Beacon Economic Impact Report, the 2018 Cup generated 17 million to the county. The events is supported more than 200 jobs and 271 local vendors.'",
        "'speaker_10': 'And half of the nearly 30,000 attendees stayed in hotels and private homes in. In the area. The Emerald Cup is grateful to the City Council for the opportunity to develop an events ordinance and is enthused by the prospect of building it on the legacy we've created by launching an annual event in Long Beach beginning next year.'",
        "'speaker_1': 'I can tell you.'",
        "'speaker_10': 'That producing these events and implementing and planning perspective takes a minimum of six months to develop the compliance and infrastructure for an event of this nature. Thus, we urge you to continue expeditious policy development to allow us to announce a 2020 event by the end of the year.'",
        "'speaker_10': 'The Cup is the ideal partner for the city. We have a stellar record of compliance, secure operations and positive impacts to the community. Finally, we understand that while the burgeoning legal cannabis industry represents significant economic opportunity, many local jurisdictions are grappling with low or excuse me, with how to implement public policy that balances economic opportunity with the'",
        "'speaker_10': 'public health and safety. The economic excuse me, the Emerald Cup has achieved this balance and would welcome the opportunity to show you this firsthand. I invite you to join us at the Emerald Cup this weekend in Santa Rosa.'",
        "'speaker_10': 'We would be happy to give you a tour of the event, its infrastructure, security and operations, and provide a real time case study on economic impact and how licensed cannabis events can function. Excuse me appropriately and beneficially within the community.'",
        "'speaker_5': 'Thank you very much. Next speaker.'",
        "'speaker_1': 'Good evening, vice mayor and council members. I want to follow up with what Jim said about the Emerald Cup and the professionalism in pulling off a successful event in Santa Rosa. They've had no incidents at all since they started the event at the County of Sonoma Fairgrounds.'",
        "'speaker_1': 'To confirm that, I reached out to Long Beach PD along Beach Fire over the past several days and gave them their respective counterparts and their phone numbers up in Santa Rosa so that they could do their due diligence and determine the success of the event.'",
        "'speaker_1': 'Lessons learned and all that. In addition to that, Emerald Cup has also reached out the Santa Rosa Chamber and Santa Rosa Events Bureau to have them contact their counterparts in Long Beach, the CVB, the Hospitality Alliance in the Long Beach Chamber.'",
        "'speaker_1': 'Finally, we also provide to city and elected staff contacts with the State of California Bureau of Cannabis Control, the chief Laurie Ajax, and Governor Newsom's point person on cannabis, Nicole Elliott. We want to be as transparent as possible.'",
        "'speaker_1': 'We want you to do your due diligence as you go through this. We invite staff to call their counterparts in the state of California. Also in Santa Rosa, we've got nothing to hide. We encourage you to move us forward quickly.'",
        "'speaker_1': 'Thank you for your time.'",
        "'speaker_5': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'And hello. Good evening, counsel. My name is Pam Charter Society. I'm an 18 year Long Beach resident in District four. I'm also the community education director at Long Beach and Long Beach Collective Association LBC. Allowing temporary permits for cannabis events will offer safe, regulated spaces for social consumption, which will promote public safety.'",
        "'speaker_6': 'It will also add another type of special events bringing a new.'",
        "'speaker_3': 'Experience to group growing tourism that Long Beach offers. That's all I have to say.'",
        "'speaker_5': 'Thank you. Excuse me.'",
        "'speaker_4': 'Hello. Good evening, Vice Mayor and Council. My name is Steven Contreras. I'm the community outreach director for the Long Beach Collective Association. I would just like to support this recommendation to move forward with the temporary cannabis event permit.'",
        "'speaker_4': 'This allows potential, great potential for economic opportunity, opportunity, tourism tax revenue and will illuminate the city of Long Beach to be a premier destination.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_5': 'Thank you very much. I see there's no more public comment and one the. Would you please cast your vote?'",
        "'speaker_3': 'Councilman Mongo.'"
    ],
    "Report on the Independent Redistricting Commission Plan.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_5': 'Thank you. No, I'm a 19.'",
        "'speaker_0': 'Item 19 Communication from City Clerk. City Manager. Recommendation Receive and file a report on the status of the Independent Redistricting Commission plan. JT Nakayama is here to present on behalf of the City Clerk Department.'",
        "'speaker_4': 'Good evening, Mayor and City Council. We will be presenting a brief overview of the Independent Redistricting Commission plan. Here's a background of the process. The last time redistricting occurred in Long Beach was in 2011, when the city council adopted the current map after directing staff to conduct the process.'",
        "'speaker_4': 'The new process for redistricting changed last year when voters approved the charter amendment to create the commission. The Commission has been given the exclusive authority to redraw the boundaries and adopt the new map through an open, independent and transparent process.'",
        "'speaker_4': 'The first step in the process is the recruitment and selection of the commissioners. The Commission will be comprised of 13 members and two alternates who reasonably reflect the diversity of Long Beach. The commissioners, which must meet specific requirements outlined in the Charter and must not have any conflicts of interest.'",
        "'speaker_4': 'Application period will be open from April 1st through June 30, 2020. After the commissioners are selected, there will be approximately 20 commission meetings with at least one in East District. The final map will be adopted by September 2021, which is a deadline mandated by the charter.'",
        "'speaker_4': 'On this slide, there's a screenshot of the website that was launched last month. The communications plan is broken up into two phases. The first phase is the recruitment of commissioners through early outreach and education, along with motivating, activating community members to apply.'",
        "'speaker_4': 'The second phase will be to involve community members in the redistricting process through education and activation. Encouraging participation in meetings. The second phase will also include creating awareness of new district boundaries following the adoption of the map. If any changes are made.'",
        "'speaker_4': 'The following video, the PSA announcement we created with MLB.TV that will launch next month.'",
        "'speaker_1': 'Attention. Long Beach residents, your city and the Independent Redistricting.'",
        "'speaker_4': 'Commission is looking to.'",
        "'speaker_1': 'Appoint commissioners to redistrict our neighborhoods. The Voting Rights Act, 1965, has determined the city's boundaries for decades. But now we want to hear from you. Ooh, help redraw the lines. Applications will be accepted from April 1st, 2020 through June 30th, 2020.'",
        "'speaker_1': 'You must be a registered voter and live in Long Beach. For additional requirements and to apply, check out our website or visit the city clerk's office. It's your community, your voice.'",
        "'speaker_4': 'Now. Deputy City Manager Kevin Jackson will continue the presentation.'",
        "'speaker_10': 'Thank you, J.T.. Good evening, Vice Mayor and members of the city council. We just want to give you some share some information with you about how we're cooperating on the census so that you have an understanding of who's doing what and what the current status is and, you know, and what our funding situation is.'",
        "'speaker_10': 'So starting with how we're working together. The city clerk is responsible for coordination of the recruitment selection process, for the redistricting effort and overall coordination of the Commission's activities. The city attorney is going to be working on coordinating training and advisory legal support for the Commission and staff on the redistricting process and the city manager providing support'",
        "'speaker_10': 'for the overall effort in promoting, supporting interdepartmental engagement in the effort is going to also be coordinating an RFP process to select a consultant for redistricting advisory services. In addition, we are currently and will throughout the process be providing support for communications and public engagement.'",
        "'speaker_10': 'And when the Commission is operational, we will be providing operational support, meaning support for the effort as well. I just wanted to point out that the the timelines for these two concurrent efforts, the Census 2020 outreach, as well as the redistricting process, there is some overlap with these timelines.'",
        "'speaker_10': 'We have been carefully coordinating the Census 2020 and redistricting planning activities to ensure the success for each of the processes and to identify opportunities to combine resources where possible on the outreach activities. We have some specific outreach activities and communications activities that we will we will be doing for redistricting.'",
        "'speaker_10': 'But we are doing extensive public engagement on the Census 2020 process. And we realize that there will be opportunities to to leverage the engagement from the 2020 process to support outreach on the redistricting process. I want to point out just some key dates between the two efforts.'",
        "'speaker_10': 'So we just spent the last five months wrapping up a strategic planning process for Census 2020. Our overall planning for the Census 2020 started in 2018. So we've completed that and we're now moving into the implementation plan for Census 2020, which will begin in January and go through July.'",
        "'speaker_10': 'The apportionment counts after the census is done are due to the president by December 20, 31st of 2020. And the the the census data for the redistricting process has to be released by March 31st, March 31st, 2021. The redistricting process then will effectively begin, as J.T. suggested earlier on April nine, April of 2021, and wrap up in'",
        "'speaker_10': 'September of 2021 with a new map adopted by the Commission. We are currently working on initiating RFP process for the selection this month of selection of a redistricting consultant in January 2020. We are starting the selection process a little early in an effort to onboard the consultant early enough to start providing support for the redistricting recruitment process'",
        "'speaker_10': 'for commissioners. There are some core services that will be provided by the redistricting consultant, including commissioner and staff training on the requirements of the redistricting process, as well as providing demographic data and analytical support and training on a mapping tool to assist the commission with map redrawing as well as assisting the public or engage in a public'",
        "'speaker_10': 'in the map redrawing process as part of the public engagement process. The consultant will also work with us on an ongoing basis to provide meeting and facilitation support to ensure for the efficient operation of the Commission's activities. So the proposed redistricting plan spans three fiscal years by 2021 and 22.'",
        "'speaker_10': 'The FY 20 adopted budget included $250,000 to initiate the proposed work plan. Currently, the city clerk in our office is working to identify the unfunded balance in FY 20, and we will be working during the successive budget processes in FY 22, 21 and 22 to identify the unfunded balance in those particular years.'",
        "'speaker_10': 'And that concludes our presentation on the receipt of our report for the redistricting process. Thank you.'",
        "'speaker_2': 'Thank you. I'm going to turn this over to councilman also in just a minute. But I want to just add and thank staffer. I just working really hard on putting together this plan. This is obviously the will of the voters who adopted Measure D and have asked us to have an Independent Citizens Redistricting Commission.'",
        "'speaker_2': 'And like I've said before, having lived through the last process here as a council member, I'm very grateful that we will have a commission that will be doing the process instead of us. And and so I think this is really also the the gold standard.'",
        "'speaker_2': 'And where redistricting is going are these commissions and it's happening across the country. And so I'm very grateful that that this is happening. I also just want to add that there I know that common cause and Lou Leggett submitted a letter of some thoughts on our process.'",
        "'speaker_2': 'And I think there's just some good ideas there for us to take a look at. Mr. Jackson, just want to make sure that that's something that we have we have looked at. And I also want to just just add that.'",
        "'speaker_2': 'I think the, the, the layout in the timeline that you've all set out, I'm including trying to be a little bit more aggressive as far as the timeliness I think is really smart. And so thank you for that.'",
        "'speaker_2': 'And I just think there's really good work on staff's part. Councilman Austin.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And I want to thank Mr. Jackson and staff for great work on planning this, uh, this, I think, historic commission and process. As the Mayor alluded to the last time we went through the redistricting process, it was pretty, pretty eventful.'",
        "'speaker_7': 'And I don't want to see that revisited. And so this is why we were so so. So intent on on creating a citizens ridiculous redistricting process. I'm concerned about the budget and which you are. Maybe some shortfalls in identifying these budget budgets over the next couple of years.'",
        "'speaker_7': 'What do you expect and what do you think? We're going to need to implement this over the next two years?'",
        "'speaker_10': 'Well, the current budget estimate is $1.2 million. We over the next couple of months, will be in a position to refine that budget estimate. And and we'll be coming back with a recommended budget adjustment for 2020 to add to the funding that we currently set aside in 2020.'",
        "'speaker_10': 'So overall, at this point, as far as we can see, it's a $1.2 billion effort over the next three years. But certainly we're going to be looking for opportunities to, you know, to economize.'",
        "'speaker_7': 'Okay. In terms of opportunities to economize, are there any sort of grants, good government grants available in terms of or that you're aware of that we may be able to to identify or apply for?'",
        "'speaker_10': 'Uh, we are we are not aware of any grants that are available for this effort at this time. Monique, I don't know. In your office.'",
        "'speaker_0': 'We can take a look at that. But at this time, there are no grants that we've come across that are available for redistricting, independent redistricting commissions. But we can definitely take a look.'",
        "'speaker_3': 'And get back to you.'",
        "'speaker_7': 'Okay. That might be something that we can work on. Creating. And then secondly, the you mentioned the the delay over what the census process, what type of funds do we have for census? And will there be any sort of.'",
        "'speaker_7': 'Opportunity there.'",
        "'speaker_10': 'Well, as part of the EFF Y20 budget, the Council had approved $600,000 for census activities, 250 for the redistricting effort and 350 to support the census 2020 outreach effort. At this point, we are it's not likely that we will have any additional funding from the Census 2020 outreach outreach effort to to support redistricting.'",
        "'speaker_10': 'Where we might where we will be able to support the redistricting process is through the relationships that we built with the community based organizations and through our complete count committee to assist with outreach. So that will allow us to give get, you know, some economies of scale on the outreach.'",
        "'speaker_10': 'But in terms of dollars, we don't we don't envision any additional dollars coming from the census 2020 effort to support the redistricting effort.'",
        "'speaker_7': 'Well, thank you for answering those questions. You've given me a few things to think about and as well as to to work on. I know there are a number of cities throughout the state that are looking at adopting this citizen redistricting process.'",
        "'speaker_7': 'And perhaps there are some some opportunities for for our state to test as well, because I think this is just the way I said a good government move and one that will engage but also demystify the process of redistricting.'",
        "'speaker_7': 'Thank you very much for your report.'",
        "'speaker_2': 'Thank you, Councilman Mongo.'",
        "'speaker_9': 'Thank you. I'm so proud of our city for taking these big steps forward. I've been to some of the meetings. I think that the team is working very diligently with the community. I appreciate the work that you've done.'",
        "'speaker_9': 'I know that we've had several meetings about budget and other things, and I appreciate you keeping me updated and any additional budgetary related things that may come back to the Budget Oversight Committee. We will be meeting early this year, so thank you for your continued partnership on this important endeavor.'",
        "'speaker_1': 'Pierce.'",
        "'speaker_3': 'Yes. Thank you very much for these efforts. I know that you guys are working really diligently and I.'",
        "'speaker_6': 'Know that we have minimal.'",
        "'speaker_3': 'Resources. And so I hope that we can find some more and partnerships as well. I had a question on the community meetings.'",
        "'speaker_6': 'It looks like there's one at City Hall.'",
        "'speaker_3': 'And there's also one at the library. I assume that one of those is supposed.'",
        "'speaker_9': 'To be intended for District one and one supposed to.'",
        "'speaker_3': 'Be for District two. Where it would make a lot more sense, I think for my district, if we have one at City Hall, that we also have one maybe at Bixby Park, because there's a lot of my constituents on the east side that do not make it all.'",
        "'speaker_9': 'The way over here if we have.'",
        "'speaker_3': 'Community meetings. So I would just ask that we explore options to make sure that it's spread out evenly. Thank you. You bet.'",
        "'speaker_2': 'Senator Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. Having participated in the last process, I'm looking forward to, you know, the citizens independent process, you know, in, you know, when the state went to an independent process. You know, there's a little bit of apprehension about, you know, protecting your communities and things like that.'",
        "'speaker_1': 'And so I just had a quick question. I see on page two, it talks about the process of recruitment and selection, and the Ethics Commission randomly selects the first nine commissioners. In the first nine commissioners select the remaining four members and two alternates.'",
        "'speaker_1': 'So in that process, I'm, you know, you know, I support randomizing it, keeping it fair. But how do you maintain some geographic representation if you don't get, say, a lot of applications in certain areas? How do you do that?'",
        "'speaker_10': 'I'm going to ask the city clerk to Monique, if you want to help respond to this question.'",
        "'speaker_4': 'So through the application selection process will be reaching out to different CBOs throughout the community, to outreach and to disseminate information, to recruit commissioners, and then will also be doing demographic information and gathering that through the supplemental questionnaire that's not included in the initial application.'",
        "'speaker_4': 'So we can provide statistics and we'll provide that in the update that the one month update planned during the application period.'",
        "'speaker_1': 'So you're going to conduct outreach through community organizations to get the word out for applications. Is there any KREJCI screened for criteria before the entire list is submitted to the Commission for random appointment?'",
        "'speaker_4': 'Yes. So the Ethics Commission will create a sample of 20 to 30 applicants from the total of all the applications. And that will include, I believe it's two or three applicants from each district. And then the chair will randomly select the first nine commissioners from that 20 to 30 applicants.'",
        "'speaker_4': 'And that one will just be like probably my district and it's one per district. And then after that, those first nine will select the remaining four members and the two alternates from the remaining of the sample.'",
        "'speaker_1': 'Okay, understood. So it'll be within the district. There's a random selection. Yes, that makes sense. And then in terms of sort of, you know, representation. So, you know, racial diversity, you know, ethnic diversity, LGBTQ representation, all those things.'",
        "'speaker_1': 'How do we make is the process already prepared to make sure that those groups are represented?'",
        "'speaker_4': 'Yes. So we're going to be reaching out to different organizations and through ethnic media and through the different CBOs that we've connected through, like the Long Beach Complete Count Committee and through Common Cause. And then it's also in the charter like diversity includes is but not but is not limited to racial, ethnic, gender and sexual orientation diversity'",
        "'speaker_4': '. Right. So we'll be looking into trying to outreach to each of these different communities to.'",
        "'speaker_1': 'Get a equitable applicant pool. Okay, great. Well, good luck. You definitely are going to have a lot of eyes on you, but I'm supportive of this process and let me know how I can be helpful. Thank you.'",
        "'speaker_2': 'Mr. King, you do you have any comment on this? Okay. There is a motion in a second to receive and file the report. Please cast your votes.'",
        "'speaker_3': 'Councilwoman.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Amend Resolution on 4th Street Parking Meter Hours.": [
        "'speaker_0': 'Councilman Richardson. Motion carries.'",
        "'speaker_2': '24 Council member Pearce.'",
        "'speaker_0': 'Communication from Councilmember Pearce recommendation direct the city manager to work with public works and the city attorney to amend resolution changing for street parking meter hours.'",
        "'speaker_3': 'Yes. I want to thank staff for all their work. I want to thank Retro for their work as well. I know that we had this item come before us last year. It's just in front of us today. We are changing the hours from 9 p.m. to 7 p.m., which is in.'",
        "'speaker_6': 'Alignment with the other.'",
        "'speaker_3': 'Meters that we have. And other business improvement districts and staff will also be reducing the footprint, but that doesn't require a vote today. So again, thankful for community members that have come out and participated, engaged in this conversation and for everybody being patient with us as we, you know, figure this out, how we balance residential homes while'",
        "'speaker_3': 'they're surrounded by businesses as well and wanting to support both of them. So, again, thank you, staff.'",
        "'speaker_5': 'Thank you very much. Hmm. Let's begin this year. Goodbye. Okay. Nobody can come in on this idea. Now, will you please cast your vote? Motion carries now in final. That's right. I've become my.'"
    ]
}