{
    "Climate Resiliency Assessment Report from the Aquarium of the Pacific.": [
        "'speaker_0': 'Mr.. Dr. Schaeuble is here and I had initially told him, I think. 530.'",
        "'speaker_4': 'So.'",
        "'speaker_0': 'Dr. Schaeuble, if I can have Madame Claude, can you read. Item number six, please.'",
        "'speaker_1': 'Communication from Mayor Garcia Recommendation to receive and filed City of Long Beach Climate Resiliency Assessment Report from the Aquarium of the Pacific.'",
        "'speaker_0': 'Thank you. Let me let me just begin by one, welcoming Dr. Schaeuble back to the council. We know Dr. Schaeuble well as not just a great resident of Long Beach, but obviously directs our great aquarium, which is not just one of the most important.'",
        "'speaker_0': 'We're not one of it's not only one of the most important cultural institutions that we have, but as an educational institution, it's a research institution. And so we want to thank you for your leadership. A year ago, I asked Dr. Schaeuble to prepare a climate change and climate adaptation resiliency report to present to the city and the'",
        "'speaker_0': 'city council. Dr. Schaeuble, over the course of the last year, brought together some of the top minds across the state in the country, including at the federal government, local universities and a bunch of other folks, to put together a really comprehensive and important report for the city.'",
        "'speaker_0': 'I think it's important to remind us, remind ourselves that climate change is real. Climate change is happening. It is having an impact on Long Beach and other coastal cities. And it is a serious challenge. We should not ignore it.'",
        "'speaker_0': 'It is it is already having an impact here and and globally. And it's our job as elected officials to do the responsible thing and to learn to adapt and do what we can to stop and slow really at this point, slow down what is already happening.'",
        "'speaker_0': 'As a community, we've done we've done two major things in the last year. One is we joined the Compact of Mayors Agreement. We are one of 250 cities in the U.S. that has agreed to a pretty strict standard of emission reduction over the course of the next 20, 30 years.'",
        "'speaker_0': 'And we've also asked the aquarium to put together this information and report for the council to review. And so I want to thank you, Dr. Shuba, and your team, and I'm to turn it over to him. Thank you.'",
        "'speaker_9': 'Thank you very much, Mr. Mayor. Honorable members of the city council, members of the city staff. You have the report and it's posted on our website if anybody behind me wants to read it in full tonight. What I want to do is give you a very brief overview of some some of the major findings of this report'",
        "'speaker_9': '. That's what the cover looks like. It's in two parts. There's the assessment report, and then there are a series of appendices. What does it mean to be a climate resilient city? A climate resilient city is a city that's able to continue to function in the face of challenging circumstances due to climate change and to recover quickly from'",
        "'speaker_9': 'disruptions. And those disruptions with climate change would take the form in general of extreme weather related events. And there are four different dimensions of community resilience. There's leadership and strategy, infrastructure and environment, economy and society and health and wellbeing.'",
        "'speaker_9': 'And to have a resilient city, you have to be able to function in all of these areas, areas during trying circumstances. We have some unfair competitive advantages. I use the word unfair in the sense that Jack Welch of GE used to use it.'",
        "'speaker_9': 'Companies, cities, organizations should look at what with their unfair competitive advantages are. We're just the right size. We're small enough to be manageable and large enough to have national impact. We have wonderful, strong leadership, starting with the mayor and all of you in the city council and with the city manager's office and with most of the department'",
        "'speaker_9': '. We have an outstanding water department. We've got in the in the health department transit and we have the the greenest port in the United States and probably the greenest port in the world. So we're off to a good running start.'",
        "'speaker_9': 'And as the mayor already mentioned, we're a member of the Compact of Mayors and the we'll become soon, I think, a member of 100 resilient cities. It's important to distinguish between mitigation and adaptation because they are totally different.'",
        "'speaker_9': 'Mitigation is when you reduce the driving forces of climate change, that is, you reduce the emission of greenhouse gases. You first stabilize the concentrations in the atmosphere, and then you have to reduce those. Adaptation is a recognition that no matter what we do, if we eliminated all greenhouse gases tomorrow, we would still have to adapt to a'",
        "'speaker_9': 'climate changing climate, to a rising C, to a warmer world. And this report focuses on adaptation. California is a leader in mitigation among all the states. And we as a city now as a member. Of the Compact of Mayors will join becoming a major leader in the city.'",
        "'speaker_9': 'The steps in this study were to identify the major threats of climate change to Long Beach. Effects of climate change vary with geography. And so we had to look specifically at Long Beach to assess the impacts and the vulnerability of these threats to our city.'",
        "'speaker_9': 'To review the existing plans and efforts that are already in place. To address these threats. To explore additional approaches. And then to summarize our findings and to suggest some additional approaches. So the major threats of climate change to Long Beach are drought, extreme heat, and the number of hot days increase in the number of hot days, sea'",
        "'speaker_9': 'level rise and coastal flooding, deteriorating air quality public health and social vulnerability. And I'm going to give you just a few comments about each of these major threats. Drought obviously, drought is a period when a region experiences below average precipitation and it results in decreased water supplies.'",
        "'speaker_9': 'And we are entering the fifth year of drought. We have to remember we are in a semi-arid region and our area was designated as one of extreme drought starting several years ago and as recently as January of this year, we get 53% of our water from groundwater.'",
        "'speaker_9': '40% of it is imported and 7% is recycled. And some of that groundwater depends upon imported sources of water because we use it to recharge our groundwater. And the two sources of imports from Northern California and from the Colorado, both are at risk because of climate change.'",
        "'speaker_9': 'This is a map of California on the left and and on the right. You can see the United States and the deep, deeper the the red, the more serious the drought. This was from January the fifth. And you can see that we are in a serious situation and not just here in Long Beach, but in much of'",
        "'speaker_9': 'California. The impacts of drought, if you have to, you have to look again. I mentioned where our water comes from and how the drought will impact those different supplies. The biggest source of our water comes from snowpack in the north and where last year we had 5% of the long term average snowpack on April one, which is'",
        "'speaker_9': 'the date when it's inventoried every year. We're ahead of schedule this year and we're all hoping, hoping that we will continue to do that. This is what Lake Oroville looked like in 2011. That's what it looked like in 2014.'",
        "'speaker_9': 'So you can see many of our reservoirs, including, as I say, our largest, the snowpack, they're disappearing. What's happening now? Long Beach is a leader in water conservation. We have a lot of different programs and incentives. We have the low impact development.'",
        "'speaker_9': 'We have schedule. Landscaping is restricted to certain days, Tuesdays and Saturdays only. We use some recycled water. And at the bottom we have been a leader in converting lawns to drought tolerant vegetation. But that's still an area where we have a lot of opportunity because fewer than 5% of our lawns of single family dwellings in Long Beach'",
        "'speaker_9': 'have been converted. So we need to continue to increase the shift to drought tolerant landscaping. We need to continue to increase use of recycled water. We have to figure out ways to promote onsite stormwater capture and retention. Right now, that's a serious problem, not just here, but throughout much of California, because we we are not capable of'",
        "'speaker_9': 'capturing rainfall and putting it back into the ground. We lose much of it and we need to decrease the reliance on imports for groundwater, recharge extreme heat. 2015 was the hottest year on record. 2014 was the hottest year on record before 2015.'",
        "'speaker_9': 'We will continue to see an increase in temperature and we will continue to see Greece see an increase in the number of hot days. Heat kills more people than earthquakes, tornadoes, hurricanes combined. And heat really is a serious issue.'",
        "'speaker_9': 'We're fortunate being here in Long Beach, and I'll come back to that in a second. These are two scenarios. One on the left is for lower emissions of greenhouse gases. So you can see that in California, the temperature would rise by 2100 or three or four degrees Fahrenheit in the higher emission scenario.'",
        "'speaker_9': 'It would rise by 5 to 7 degrees. Both of those are significant in significant increases. And we probably are going to be closer to the map on the right than to the map on the left. This shows the increase in the number of hot days.'",
        "'speaker_9': 'And you can see the star down there, Long Beach. We're very fortunate. And Long Beach, Santa monica. And being in the San Gabriel Mountains, we benefit here, as does Santa monica, from being close to the ocean. But we will still see an increase in the number of hot days that is days over 95 degrees by three or'",
        "'speaker_9': 'four times. The plans that are underway to cope with warming, where we have a network of cooling centers and we're planting trees. Both of these are very important initiatives and they should be continued and expanded. We can expand the number of cooling centers, and one of the challenges is to make people aware of where these cooling centers'",
        "'speaker_9': 'are and how they can get there, because many of the most vulnerable people do not have transportation. We can add even more trees. We have this plan to add 10,000 trees. We can add more. This is a double edged sword.'",
        "'speaker_9': 'Trees are thirsty and so they give you some shade. They cool because of the transfer transpiration, but they also use water. And at the bottom you can see we can add shade structures, green roofs, cool roofs, cool pavements.'",
        "'speaker_9': 'All of these can reduce heat island effects or go along with being cities, sea level rise, coastal flooding and inundation. They're not like mitigation and adaptation. They're quite different things. Coastal flooding is a temporary condition that's caused by storms or very high tides or the two of these together.'",
        "'speaker_9': 'Inundation is a permanent condition that's caused by sea level rise. Coastal flooding is a problem right now, and it will become a more serious problem as sea level continues to rise. Inundation is something that we probably don't have to worry about for a few decades, but after that, we will have to worry about it.'",
        "'speaker_9': 'This is from the California Coastal Commission and their guidance on sea level rise for three dates 2030, 2050 and 2100. And this is for the area of the coast where we are, south of Cape Mendocino, 2 to 12 inches by 2035 to 24 inches by 2050, 17 to 66 inches by 2100.'",
        "'speaker_9': 'There's a lot of uncertainty in these estimates, and partly it's because of the models that are used. And partly it's because we don't know what's going to happen to Greenland and Antarctica. And those are the two areas that could move these rises to the upper end.'",
        "'speaker_9': 'But the real issue now and in the future will be what gets superimposed on these rises of sea level king tides. We just had a couple on January 20th and 21st, El Nino. We're in an El Nino and coastal storms.'",
        "'speaker_9': 'We can learn a lot from the present El Nino because sea level rise from this present El Nino is equivalent to about 25 years of average sea level rise. And when we superimposed storms upon it, it's giving a look, giving us a look at what the future of California, Southern California and Long Beach will look like in'",
        "'speaker_9': '25 or 30 years. I'm sure most of you can't see this map, but this is a 100 year storm with present sea level. In about 2020, 23,000 people would be at risk of flooding during a 100 year storm right now without any further rise in sea level.'",
        "'speaker_9': 'And you can see where the flooding is concentrated along Second Street to Peninsula Alamitos Bay, plans that are underway, beach nourishment and protective sand berms. This is ongoing activity along the peninsula. The we're cleaning out storm drains to reduce urban flooding.'",
        "'speaker_9': 'We have a boom on the L.A. River that keeps a lot of debris from reaching the ocean. And we have Cosmos, which is a modeling program of the U.S. Geological Survey, and we also have an El Nino preparedness program and the alert Long Beach.'",
        "'speaker_9': 'So we have a lot of efforts that are underway. These are approaches we think need to be further considered. We should inventory and review all of the existing studies. This was one of the challenges we had. It's very hard to get your arms around these studies.'",
        "'speaker_9': 'We should delineate historically flooded and damaged areas. We should collect additional data. I think El Nino is a great opportunity for us. It's going to go on for another several months and we should be getting some additional data during that period.'",
        "'speaker_9': 'We will need you will need to select an appropriate hydrodynamic model for Long Beach. It has to be a detailed, dynamic hydrodynamic model that can take into account the complicated bathymetry we have near shore and the complicated topography that we have.'",
        "'speaker_9': 'And we will also need to inventory all infrastructure and assets at risk of flooding. And I would recommend that you develop and maintain a coastal hazardous hazards database that you can call upon when when we need to look at things.'",
        "'speaker_9': 'Deteriorating air quality. Air quality always gets worse with warming because the chemistry of the atmosphere changes. And California currently has the worst air quality in the nation, with more than 90% of the population living in areas that violate state air quality standards for ground level ozone and small airborne particles.'",
        "'speaker_9': 'Now, this we're very fortunate because there has been great progress in the last few years, particularly by the port. But 73% of Long Beach has diesel particulate emission values that are greater than those of 90% of California. And we have so many cars, it's more than 75% of air pollution in the region is related to mobile sources'",
        "'speaker_9': '. So we still have some work to do, but we're moving in the right direction. Air quality monitoring stations are critical, green space initiatives are critical, getting people out of their cars and into public transportation or onto their bicycles, complying with regulations.'",
        "'speaker_9': 'And if you look at the Port of Long Beach, these efforts, they've reduced diesel emissions by 75% since in the last decade. These are very impressive. Some additional approaches to consider would be to install additional monitoring stations not just near the 17 freeway.'",
        "'speaker_9': 'One of the problems we have is we often get lumped with all of Los Angeles County and within the city of Los Angeles they do it by zip code. But in Long Beach, we get lumped into one big area.'",
        "'speaker_9': 'That's not good enough. We should be studying the pollution effects in Long Beach. We should inform and engage the public on air pollution, especially children, the elderly, those who work outdoors. And we should continue to promote alternative transportation.'",
        "'speaker_9': 'Public health. Climate change is one of our biggest threats to public health. You warm the climate and a lot of things change the spread of infectious diseases. And this is a great concern right now with the with the mosquito borne disease and the poor, the elderly, the very young, the homeless and those with compromised health are the'",
        "'speaker_9': 'most vulnerable. And we have significant populations in some of those categories. We have a lot of plans and efforts that are underway that are good. California Green Building Code, The Heal Zone, Livable West Long Beach Implementation Plan and Cooling Centers.'",
        "'speaker_9': 'All of those are important moves in the right direction. We probably should include health issues as part of the Sustainable City Action Plan, and I would encourage you to invite public health and local health organizations to participate in the development and implementation of the Sustainable City Action Plan and engage the public in climate change resilience by identifying'",
        "'speaker_9': 'the health benefits of adaptation. There are a lot of advantages to being a climate resilient city, and many in the public are not aware of those. So building climate resilient communities by building social capital. It's been shown in Katrina, it was shown during Sandy that it's where you have strong social capital and we have strong neighborhoods.'",
        "'speaker_9': 'You are more resilient and you rebound much more quickly. So that is a program that the city is already in good shape. And we have a program that we're developing. We're applying to Noah for support. It will it involves already a group of MBA students at Cal State Long Beach.'",
        "'speaker_9': 'We're involving at Jordan High School and a number of others. And we will keep you engaged in that. It will be important to engage the diverse communities and neighborhoods so that they can develop a shared vision of resilience.'",
        "'speaker_9': 'What is it that they want to protect? What is it they value most? And then to develop tailored messages for each community? And we already have partnerships with two. And I will have three different cities that have signed on with you, Mr. Mayor, to the Compact of Mayors that will have similar city studies going on in parallel'",
        "'speaker_9': 'with what we're going to do. So I think the way we would encourage the city to form a climate resilience team and to complete and publish a risk assessment plan to review, adopt and implement that plan and to monitor, review and update the plan.'",
        "'speaker_9': 'Long Beach has a great opportunity. I think we have a head start. We're well positioned to become a model of a climate resilient city, and it not only will protect the city and its residents, but it will get a fair amount of attention on this city.'",
        "'speaker_9': 'So we thank you, Mr. Mayor, for inviting us to be part of this study. And we will continue to work with you and members of the city council and the city manager's office. Thank you.'",
        "'speaker_0': 'Thank you. Dr. Schaeuble, if you can just stay up there for a couple of minutes. It's really important work. I know that the whole council has the full report. And I think at this point now the ball is back on on this body's court.'",
        "'speaker_0': 'And I think it's the council's responsibility. I know that will be thoughtful over the course of the next few months ahead to consider all these recommendations and and your data. Let me turn this over to Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And thank you, Dr. Schaeuble. I wanted to commend the mayor for making this request and for you to conduct the study and the work and present this report to us. Also your team of experts for gathering all the information and the facts that informed this assessment report that you shared highlights from today.'",
        "'speaker_2': 'And it's already been clearly stated your presentation as well as the mayor's opening remarks. But climate change is real. This is a different day from over ten years ago, I'd like to say almost ten years ago when I worked at a water agency and we conducted a press conference about new technology to address sea level rise at'",
        "'speaker_2': 'the Alamitos Superior. And at that time, the administration, the federal administration, your U.S., you're smiling because you know the story. U.S. Bureau of Reclamation sent me a message saying that they were disallowed from participating in the press conference because we made it clear statement that climate change is the reason for sea level rise.'",
        "'speaker_2': 'And at that time, the president did not acknowledge that. And so none of the staff was allowed to attend. But we went ahead and we conducted that press conference, and your team was very supportive in providing us with the information, as well as Dr. Bill Patzert from JPL.'",
        "'speaker_2': 'But we have come a long way, and I'm very proud to be a part of this community that has an institution, a learning institution and research institution like the aquarium that can provide such key research and documentation and an assessment of our community.'",
        "'speaker_2': 'How you ended the slide is really important to me personally. It's a shared vision and that is the Long Beach way. We have never addressed our water quality issues, beach water quality issues, storm water quality issues, trash issues coming down the L.A. River, which I know that Councilwoman Gonzalez and the rest of us are very aware of'",
        "'speaker_2': '. We've never addressed that as though that they have geopolitical or geographical boundaries. Trash doesn't know boundaries, pollution doesn't know boundaries, stormwater impair doesn't know boundaries. And we've always addressed it by looking upstream and see how we can support our cities upstream.'",
        "'speaker_2': 'And so your strategy in your recommendations is very much aligned with the Long Beach Way. That is how we achieve successes for our community is acknowledging that upstream cities have to be treated as our partners and that we have to work with them rather than penalizing them or shaming them for what contributions their cities may provide to'",
        "'speaker_2': 'any impairment to our source water quality or water quality in general, working with them and collaborating with them. So I appreciate that the approach of a shared vision, we have a shared obligation to support one another as cities and and to build capacity or social capital.'",
        "'speaker_2': 'As you articulated, it's not just collaborative, but it's really the right way. So thank you. I appreciate you taking science, knowledge, research and hard work and making it very able for all of us to understand, be a part of and really be a part of the solution.'",
        "'speaker_2': 'Because as one of your programs in the aquarium is aptly titled, it all flows to me. So thank you.'",
        "'speaker_9': 'Thank you very much. And over that last ten years, the aquarium has changed a great deal. And we appreciate your support and leadership. We're in your district.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'Dr. Schaeuble, I just want to say congratulations and thank you for a wonderful presentation, similar to what Vice Mayor Lowenthal said. We hold these issues very important to many of our districts, but also our city. We were just in the state legislative committee up in Sacramento and.'",
        "'speaker_5': 'For the Lower Los Angeles River and making it a larger master plan to ensure that we're getting enough attention as Upper Los Angeles River plans. So thank you for your attention to this and your hard work in all this.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'Thank you for the great work you've done. I guess I have a question for Steph. I know that this body has referred to commissions. The work that you believe is our next steps. Would that be something that we could make a motion to move to the Sustainability Commission to review and come back to us?'",
        "'speaker_4': 'So certainly we do have a number of commissions that and committees that deal with this. We have our Environmental Committee of the City Council. We also have a sustainability commission. They do have a sustainability action plan and they review a number of these things and that work is ongoing.'",
        "'speaker_8': 'We in kind of working with Dr. Schubert, we've done a report to the council as.'",
        "'speaker_4': 'Well in November talking about a lot of the things that the city is doing. And we're certainly.'",
        "'speaker_8': 'Going to be taking this report and merging those efforts together.'",
        "'speaker_4': 'So I don't believe in front of you tonight. And that would be a question for the attorney, whether you can make that motion or whether it's just a receiving file.'",
        "'speaker_8': 'But we'd certainly be willing to work with commissions and with the council and to come back and talk about some of.'",
        "'speaker_4': 'The steps that that we're working on that need to happen over the next several years in order to keep the work moving in this area.'",
        "'speaker_1': 'Thank you. I think it's great when we have someone who comes to the council with a plan and here are the next things that we need from you as elected officials. So I look forward to hearing from the city staff over time on where we're going to go with that.'",
        "'speaker_1': 'But I think that we need to make those next steps and commitments to those next steps. So thank you for making sure that was in your presentation.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Ringo.'",
        "'speaker_10': 'Thank you, Mayor. I want to also extend my thank you to Dr. Schaeuble. You're doing great work at the aquarium. I was over there earlier last year for a symposium you put forward on sea level rise. And it was a great presentation.'",
        "'speaker_10': 'And it's great that we had such an institution, such as the Aquarium of the Pacific, looking at at our climate and what changes taking place and how we can fit into that plan to address climate change and make improvements by changing our own habits.'",
        "'speaker_10': 'One of the things that we always have to look at, we have to see if we see something and we have and we know there's something needs to be changed. It's, first of all, accepting the fact that there is something happening and that we do need to do something about it.'",
        "'speaker_10': 'And your work at the aquarium is certainly a at the forefront of doing that, of recognizing what's taking place and presenting the facts as we need to see them, to know that we need to have some kind of change taking place.'",
        "'speaker_10': 'So I want to commend you for that. And it also fits a very well. We just had our retreat this past weekend and we had a report from the Port of Long Beach. And many of the changes that they're doing there to address particulate matter and the increases they have out there, and especially when it looks in'",
        "'speaker_10': 'regards to my community in the West Palm Beach area, we just recently also adopted a West Side livability plan that addresses changes that we need to do in the West Palm Beach area to lower the the the our carbon footprint, if you will, and have a more sustainable city and increasing mobility out there.'",
        "'speaker_10': 'So the work that you're doing out there is wonderful and it's great, and I'm glad that you're bringing that forward because that's a first step in recognizing that we need to do something. Thank you for your work.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Supernanny.'",
        "'speaker_8': 'Thank you, Dr. Kubo, for the presentation. And in particular, I'd like to thank you for mentioning and showing a graphic of the Sustainable City Action Plan. As a charter member of that commission I worked on, seven of those are between 2008 and 2014.'",
        "'speaker_8': 'I worked on those. I wasn't sure anybody saw them, but I'm glad you did. So thank you. But to Councilwoman Mango's point, I think we have the pieces in place, but it's just a protocol we have to deal with.'",
        "'speaker_8': 'And I actually referred one of the commission members to Tom Modica last week. So this type of idea can be and this is still a receiving file. I get that tonight. But I think we need to find a pathway for your conceptual or your ideas, either to make the staff to get in front of that commission, or'",
        "'speaker_8': 'I happen to also chair the Environmental Committee too. So what could come in that direction? So I'd really like to see that worked out. Thank you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. And Councilwoman Pryce.'",
        "'speaker_5': 'Thank you. Ditto to everything that my colleagues have said. I know that you know this, and I'm sure that my council colleagues won't be surprised to hear that many of the very vulnerable areas in the city of Long Beach in regards to this discussion fall in the third district, in regards to the homes that might be impacted'",
        "'speaker_5': 'by sea level rise. And so the residents in the peninsula community, in the Naples community have gotten very involved in these discussions. They have attended several forums as of late hosted by the Aquarium and other organizations in this topic.'",
        "'speaker_5': 'And I know that our office, as a result of the TFF that city staff provided in November, sent out a mass email to our residents, kind of highlighting what the city's plans were going to be. I expect that our office will stay on top of this issue in regards to partnering with staff to move us forward in'",
        "'speaker_5': 'this discussion and do everything that we can. And I appreciate you making us aware of it. And I asked you to continue your partnership with us as a body and also with us individually, as I think you have a lot of expertize that we we may or may not have.'",
        "'speaker_5': 'And hearing from you in terms of what we might want to be looking into or maybe what's being talked about in the industry, we obviously want to be doing everything that we can to have a very successful adaptation phase as we go through this process and figure out some long term solutions to mitigate what is coming.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. With the attorney public comment on this issue, please come forward. Mr..'",
        "'speaker_9': 'SHIBLEY Can I, can I just make one absolute? We love the partnership that we have with this city, and we want it to continue. I can't think of a single city better suited to create the kind of an aquarium that we're trying to create right here in Long Beach.'",
        "'speaker_9': 'We have enough problems to make life interesting, but the problems are soluble and we have most of the pieces are in place. So we thank you very much.'",
        "'speaker_0': 'Thank you. Public comment on this. You.'",
        "'speaker_4': 'Larry. Good to hear that. Clark has the address. My first introduction to no Nino type weather was back and it was either 78 or 79. I moved here April 1st, 1978, and it was either that year or the following year that it began to rain on November the first and rained all November, all December and well into'",
        "'speaker_4': 'January, late and early February. And I remember as December was approaching, we saw on the news what we see here know the past few weeks, houses slipping into the water, beaches being eroded, boats being slashed, smashed up on the rocks.'",
        "'speaker_4': 'And there was a genuine concern by everybody, particularly the city officials in Pasadena, as to whether or not the Rose Parade might have to be for the first time canceled. And, of course, this is all great fodder for Johnny Carson if you I don't know how you remember Johnny Carson, but about seven days before the Rose Parade'",
        "'speaker_4': ', he came up with a great idea what he thought was a great idea, which was that everybody, anybody attending the Rose Bowl parade planning on it, should the day before go out and buy, in addition to the Christian Science Monitor and make a paper hat out of it, and then it wouldn't rain at all.'",
        "'speaker_4': 'Four days later, he walks out on stage wearing such a hat the publisher erm kind of had. Seen that heart and therapist and I hope that that support. I think, and certainly that wouldn't stop what we're doing now.'",
        "'speaker_4': 'But that same paper, parenthetically, does a weekly or bi weekly update on the climatic conditions around the world and they turn out they are pretty accurate and so forth. Thanks.'",
        "'speaker_0': 'Thank you. Any other public comment on the climate change climate resiliency report? Yes, sir.'",
        "'speaker_3': '000. Mr. Romberg Garcia and the City Council Team Deandra.'",
        "'speaker_4': 'I want to say thank you very much for the. Further further black history celebration.'",
        "'speaker_3': 'You know, I want to capture that country's means in the new year.'",
        "'speaker_4': 'And my birthday is coming with that film. I always feel so much.'",
        "'speaker_3': 'Love from people they care. And now we know the the.'",
        "'speaker_4': 'The El Nino import.'",
        "'speaker_3': 'Anything new being.'",
        "'speaker_4': 'A.'",
        "'speaker_3': 'Kicker here they kick back kick the with that mosquito. So we had to pray and believe and keep open day.'",
        "'speaker_4': 'The virus is spread. No wonder.'",
        "'speaker_3': 'We need more water and rain. It's all things.'",
        "'speaker_4': 'Being. We had so much good time at.'",
        "'speaker_3': 'The unit he celebrates. That Martin Luther King and that was it to perform well. I'm all.'",
        "'speaker_4': 'For you. Remain my birthday, right?'",
        "'speaker_0': 'Happy birthday. Early birthday to you.'",
        "'speaker_4': 'So things. Mayor Robert Garza. Thanks to you all. We'll always remember. Long Beach in that California. Mo where mo believe there is.'",
        "'speaker_3': 'But give the rema. We keep.'",
        "'speaker_4': 'Moving forward.'",
        "'speaker_0': 'Thank you, sir. Thank you very much.'",
        "'speaker_4': 'For coming to my birthday.'",
        "'speaker_0': 'We will remember it. Thank you. Happy birthday.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, sir. Thank you. Any other comments on this report? Okay. See, now there is a motion by Vice Mary Lowenthal on the second by Councilwoman Gonzalez to receive and file it. Please cast your votes. And, Dr. Schaeuble, you and your whole team.'",
        "'speaker_0': 'Thanks again. We look forward to the next step. So thank you.'",
        "'speaker_1': 'Vice Mayor Lynn Bell. Motion carries.'",
        "'speaker_2': 'Thank you, Madam Clerk. And I believe it's time for our public comment. Our first series of public comment, we have ten speakers that have requested to speak during this time. First, I have Gordana Cager.'"
    ],
    "No agenda item needed since the recommendation is withdrawn.": [
        "'speaker_2': 'Thank you. And hearing item one.'",
        "'speaker_1': 'Communication from City Attorney. Recommendation to receive supporting documentation into the record. Conclude the hearing and declare ordinance. Amending the Long Beach Municipal Code relating to medical marijuana. Read the first time and lead over for the next regular meeting of the City Council for final reading, declaring the urgency thereof and declaring that this ordinance shall take effect immediately'",
        "'speaker_1': 'citywide.'",
        "'speaker_2': 'Thank you, Madam Clerk. I have a motion by Councilwoman Price and a second by Councilwoman Gonzales. Councilwoman Price.'",
        "'speaker_5': 'Thank you, Vice Mayor. I just have a quick question before we move forward tonight. So the way that this is structured, Mr. Mays, I just want to confirm with you the copy process for the delivery operations. They would have a process they'd have to go through.'",
        "'speaker_5': 'Once council takes up the issue of whether to allow storefronts, they would have to apply for a copy for the storefront. They don't automatically convert. Is that correct?'",
        "'speaker_11': 'Councilwoman Price Members of the City Council is partially correct. We have a process that relates to coops. If council did authorize the storefront dispensaries, they would be able to apply for a modification to their existing CFP that would permit that activity and the same types of conditions that would typically be imposed for a see a new cup'",
        "'speaker_11': 'would likely be imposed at that time. So it's it's part of the CPA process, but it definitely will have a public hearing appealable to the city council. Okay. Other protections.'",
        "'speaker_5': 'Because what I'm thinking about is that when they if for the for the companies that apply for the delivery only model our analysis would it be limited to the operation of a brick and mortar site for delivery? No onsite sales?'",
        "'speaker_5': 'Or would we be looking at the future, the possible impacts to the community, etc., for on site sales when we're making a decision as to the delivery operation?'",
        "'speaker_11': 'If I understood your quip, if I understood your question, the Council would have the opportunity if you wanted to go further with a brick and mortar retail outlet to look at everything you would be able to. You could, in theory, require a separate CFP.'",
        "'speaker_11': 'We would recommend modifying the original one, but usually that's left in the hands of staff to fashion conditions that would be appropriate to a retail outlet. And the ordinance that we did draft for your consideration already has built into it many of the types of things and requirements perform operational standards that you would expect for a bricks'",
        "'speaker_11': 'and mortar facility if it went in that direction.'",
        "'speaker_5': 'Okay. So just a I'm just to clarify, though, let's say we're okay with a delivery operation at a particular site, but that site wouldn't necessarily lend itself well to an on site on site sales, whether it's, you know, crime stats in the area, lighting, neighborhood, proximity to a particular problematic site, whatever the case may be, the analysis'",
        "'speaker_5': 'that we would take for a regular CFP application, it may be that that location is perfect for a delivery only facility, but not for an on site sales.'",
        "'speaker_11': 'That's correct. The matter would first go to the Planning Commission. The Planning Commission would have to make a finding that the use at that location, the modification was appropriate. If findings couldn't be made, it would be conceivably denied at the Planning Commission level.'",
        "'speaker_11': 'The applicant would still be able to appeal that determination to the city council.'",
        "'speaker_5': 'Or they could find another location.'",
        "'speaker_3': 'Correct.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Are we still are we at the start of the hearing here or did we have a staff reporter? No. Okay. So. Okay. So. Okay. Got it. Got it. So. Well, actually, just to make sure. I want to make sure we do.'",
        "'speaker_0': 'Know. I know this is a hearing. Did we do? There's no oath required in the hearing. Did Mr. Mason, do you want to say anything additional as far as before I go to the second of the motion?'",
        "'speaker_11': 'Well, I if if the counsel would like me to give a staff report, I certainly could. I will say an abbreviated form of the staff report is we did incorporate into the draft ordinance before you. All of the items that counsel did request on December eight.'",
        "'speaker_11': 'If you would like me to go through those in detail, I'd be more than happy to do that. But if not, that's fine too.'",
        "'speaker_0': 'Okay. Sounds like we're just moving forward because you have started the start of the process, so I know you all have that the material. The second part of the motion was Councilwoman Gonzales.'",
        "'speaker_5': 'Yes. Just a quick question. I think I believe I already had this answered, but the 6% business license tax, we can the maximum would be 10%.'",
        "'speaker_1': 'Is that correct?'",
        "'speaker_5': 'Right now we've set it at 6%.'",
        "'speaker_11': 'When the initiative was placed on the ballot and put before the voters, they voted for a range, starting initially at 6%. But we built into that ordinance that was voted for the ability of city council to raise that anywhere between six and 10%.'",
        "'speaker_11': 'But that's not part of what's on the agenda tonight. But at a future date. Yes, you could do that.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'And then I just want to confirm in here in your report, the sink, the sanctioned ratio versus versus unsanctioned. Are we still looking at 1 to 6? Is that.'",
        "'speaker_1': 'Correct?'",
        "'speaker_5': 'I remember seeing that in the last report. And I just want to make sure when we're looking at these costs, that if that's what we're facing, this.'",
        "'speaker_1': 'Off of.'",
        "'speaker_4': 'The Eriksson. Assistant Finance Director will answer for staff.'",
        "'speaker_1': 'So, Councilwoman Gonzalez, when we had the varying number of dispensaries, we realized that it's probably more a facet of the demand in the city of Long Beach is more than a ratio of 1 to 6. So if there's only four dispensaries, the ratio might go up.'",
        "'speaker_1': 'So for this round of analysis, we actually assumed roughly 50 dispensaries total in the city of Long Beach. That would be unsanctioned. Okay. Okay. Great. And I think that's it at this time. Thank you.'",
        "'speaker_0': 'Thank you. I'm going to just keep going down this list. Did you guys go to the public? Did you go to the public? Okay. So I'm going to just keep going, Councilman Richardson.'",
        "'speaker_8': 'Thank you, Mr. Mayor. There's a couple questions and then another thought on this. Mm hmm. So I know that we went through months and months of, you know, task force meetings and a lot of resources spent on this and and an iteration of the ordinance.'",
        "'speaker_8': 'Now, my my first question is, what is the timeline from adoption of this ordinance to full implementation of open retail facilities? Seven. The full implementation.'",
        "'speaker_1': 'Councilmember Richardson. So we worked with the Department of Development Services and other departments to look at when we could actually reasonably do the process. And. We would start with the application process in March of 2016 that would be completed, the copy applications would be done in April and the CP process in November of 16.'",
        "'speaker_1': 'Planned process check would probably be completed of January of 17. And so January 17 would be the estimated date first delivery dispensary would actually open. Six months later we would have the report back to Council on Fiscal Impact and Safety Issues.'",
        "'speaker_1': 'That would be July of 2017. So if a city council chose to open onsite store fronts, we would end up having a copy modification process that that mine, which the earliest that could probably possibly be completed would probably be October 2017.'",
        "'speaker_1': 'And so that would be when we would have the first retail dispensary. Then six months after that April 2018, we City Council would look at considering three additional dispensaries. And because at that point, these would be new locations with a full copy process, the earliest those three additional dispensaries would possibly open is looking like to be March'",
        "'speaker_1': 'of 2019.'",
        "'speaker_8': 'Okay. So this ordinance, the timeline from today to full implementation puts us at March of 2019. Which we should be in our new civic center, I think, around that time. I think the original intent was to put forth sound public policy and actually take a step in that direction.'",
        "'speaker_8': 'And that's just not what this is not what's happening today. I think this is really insincere, is a waste of time and resources. My next question is my next question is, will this still have a fiscal impact on the city if we move forward with this?'",
        "'speaker_8': 'I mean, I know that was a major concern leveled by a number of council members. But I think this proposal, as I understand it, still costs resources that won't be fully recouped. Is that true?'",
        "'speaker_1': 'Councilmember Richardson. So, yes, we did look at both the the upfront cost, the one time cost and the ramp up cost related to implementing and administering this ordinance as well as the revenues that would be received once the the dispensaries are opening or opened.'",
        "'speaker_1': 'And the timeline that I had mentioned before and when we looked at that, there was a shortfall between revenues and expense in 16, 17 and 18, which we are recommending. If that was the case, we would be using one time resources to get through that period totaling about 2.4 million.'",
        "'speaker_1': 'And then once we get to seven dispensaries, we would be at a break even point where ongoing revenues would cover ongoing expenses. In order to do that, we did have to ask departments to to reduce some of their their administration costs.'",
        "'speaker_1': 'And this is all just rough estimates based on a set of assumptions. So the actual results could vary.'",
        "'speaker_8': 'So. So that said, here's here's what I'm thinking. This is not smart in terms of fiscal policy. It doesn't achieve any particular public policy goal. I know that. I mean, we've been through this. So there is not consensus on the council to do a more robust policy.'",
        "'speaker_8': 'So I don't think we should move forward. So I. And I know that. And I'll just want to say this. A lot of work's been done by a lot of council members. Vice Mayor Lowenthal. I know this most recent motion is Council Member Suzy Price.'",
        "'speaker_8': 'And I would say that and I want to thank everybody for their hard work, but I think enough is enough. So I think we should. There are we know that there are a number of ballot initiatives happening across the state, potential rumors of local ballot initiatives.'",
        "'speaker_8': 'If we're not going to give it a good run at it, I think we should stop here. So I'm going to offer a substitute motion to receive a 5/2.'",
        "'speaker_0': 'Okay. There's a substitute motion to receive and file. Just to clarify, Mr. Mays, a receiving file would not move the ordinance forward in a nutshell, correct?'",
        "'speaker_11': 'That's correct. And the current ban that's in place would remain in place.'",
        "'speaker_0': 'Okay. Can I ask you a question? I know we have a couple of speakers, but there were some state mandates as far as dates. I just I just want to make sure that we understand what those are and we can get through the other speakers first.'",
        "'speaker_0': 'But I, I don't know that those have an impact to this discussion or not.'",
        "'speaker_11': 'A couple of weeks ago, they probably would, but today I don't think that they do. When the original Medical Marijuana Regulatory Act was passed back in October of 2015, there was a provision in one of those three laws that said that if city councils did not adopt a regulatory ordinance dealing specifically with cultivation by March 1st, 2016'",
        "'speaker_11': ', the state law in that regard would automatically be imposed. Since that time, the person who authored that portion of the bill realized that or at least put out a statement that that March 1st deadline was put in there in error.'",
        "'speaker_11': 'And recently he put forth an urgency measure that now as of today was passed by both of the state and. The Assembly and the Senate to do away with that March 1st criteria, because it had the unintended effect of cities adopting bans because they couldn't get up and running by March 1st.'",
        "'speaker_11': 'As we speak, I don't believe it has yet been signed by the governor, but the governor has given every indication he will sign that. So the March 1st date should go away. So I feel fairly confident that if the receiving file is passed, the ban would stay in place and the state law regulation in regard to cultivation'",
        "'speaker_11': 'would not be imposed on the city. That's my best estimate of what would happen.'",
        "'speaker_0': 'Okay. Councilmember, your anger.'",
        "'speaker_10': 'Okay. Point of clarification. In terms of if we receive a file, this report here and there you see a ban would be in place. Should there be an initiative on a ballot? In a ballot initiative pass? What is the status of the ban?'",
        "'speaker_11': 'Councilmember Urania if a obviously would depend on what the ballot initiative was, but if it was a ballot initiative that put forth a regulatory ordinance and it was passed by the people, and assuming the city did not put on like L.A. did a competing ballot initiative, the ban would dissolve.'",
        "'speaker_11': 'By virtue of that public vote. Okay.'",
        "'speaker_10': 'Thank you. Well, I have to agree with Councilman Richardson in the sense that there's been a lot of work that's been put into this. When I brought this forward with Councilmember Lowenthal, we were talking about creating the task force, and we created the task force wanted to review this.'",
        "'speaker_10': 'The task force took much longer than I would have wanted to, but it would it did its job. And I want to thank the members of the task force in coming forward and bringing in the report. I also want to thank all the the patients that came forward, who gave their personal stories in regards to what this'",
        "'speaker_10': 'would mean for them. And and I want to thank, of course, the city attorney. I mean, I think that the they saw one item going forward and got redirected to create another type of ordinance that was completely different from the one that was originally thought of.'",
        "'speaker_10': 'I wanted my intent at that time were to step out in front of this, to get to place the city of Long Beach in a position that would be at the forefront of legalizing medical marijuana, to put us at the forefront in in the state, to create an ordinance that would be a role of being a role'",
        "'speaker_10': 'model for everybody to follow. But that did not happen. So what we have here, I think, is very much watered down. I think it's one that is not enforceable. Obviously, when you are transporting a product from one location to another, there are so many different things that can happen within a one mile stretch.'",
        "'speaker_10': 'There's also no guarantees about the product that you're going to be ordering and or receiving. So there's there's a lot of there's a lot of questions on this. And there's also questions about in terms of timelines. We're looking at full implementation in two years, which by that time we already have probably have something else in place.'",
        "'speaker_10': 'And we're also looking at getting a a break even point in terms of revenue in two years. So for the first year and a half, you know, the city will be making quite an expenditure on this, an expenditure that we can't and should not be making.'",
        "'speaker_10': 'And the original ordinance that we had out there would have put us right in place with that right away. In the meantime, it's it's not something that that I can support. So I'll be supporting the substitute motion to receive on file.'",
        "'speaker_0': 'Vice President, Joe.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I wanted to thank Councilmember Richardson for putting forward a reasonable solution to what I believe is not a workable policy. I'd like to thank the city staff, actually, because I don't know how many opportunities I'll have to do this, but especially Charlie Parkin and his team, Mike Mays and your staff for the countless'",
        "'speaker_2': 'hours that you've put into this issue since I originally brought the item forward back in 2009, and then we brought it forward with current council members. So it's been almost seven years we've been trying to figure this out and opinions vary, but we may have had it right at one point.'",
        "'speaker_2': 'We may not have, but over seven years, constituencies and communities evolve. I do know that we've worn out many colleagues past and present, but I do thank them all for taking this journey with us. Some of them are not here at the dais today and some of you are.'",
        "'speaker_2': 'So this issue of medical marijuana will continue to shape and evolve and regress and evolve again and again. And that's the beauty of public policy. There is a back and forth and an ebb and flow, but our job is to actually know the pulse of our community.'",
        "'speaker_2': 'And what saddens me is that we had so many opportunities to do the job, to do a good job. We called on many people to participate in a task force, and then we really just let everyone down with a policy that's not a great one and not one that's workable for the city, not one that's definitely manageable'",
        "'speaker_2': '. And what saddens me about that is, after all that time, we have pushed our community to take to the ballot and sometimes that's necessary. But I think having seven years to get it right and having a very thoughtful council behind the dias today would have allowed us the opportunity to come forward with meaningful public policy, having learned'",
        "'speaker_2': 'from all of the discussion and input over the last seven years. And so I think and I would like to urge my colleagues to consider supporting this. I think receiving and filing is the best thing to do, to take no action, to not have a new ordinance in place, revert back to what we had and really let'",
        "'speaker_2': 'the ballot process take place, which, for better or for worse, will be the will of the people we had an opportunity to do right, and we did not. And so many of you know that I'm very motivated by public policy and robust conversations, and I do enjoy the stamina that it takes to get things to the finish'",
        "'speaker_2': 'line. But I'm also very honest about what the outcome is. And I can honestly say, and I don't hide my frustration, but I can honestly say that what we are considering tonight is not the best we could have done.'",
        "'speaker_2': 'So I would rather have nothing than have a bad something. So, colleagues, I hope you support Councilmember Richardson. Substitute to receive and file. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Pryce.'",
        "'speaker_5': 'I, I actually. This is music to my ears. I've been asking for us to continue the band forever, like every other city that this has come to has done since AB 266. So the question I have Mr. Mays I have a couple questions.'",
        "'speaker_5': 'The first is this. There's been some talk of ballot initiatives. Can you explain to us very clearly what are the ballot? And then what does the ballot initiative process look like? One, if the city has a delivery only ordinance in place and then there is an initiative that allows for storefront dispensaries that would supersede the ordinance.'",
        "'speaker_5': 'Correct?'",
        "'speaker_11': 'It probably would supersede the ban. Yes, if it was a regulatory ordinance. So in a nutshell, what could happen is the council could put an initiative ordinance on for the public to vote on, just like the council put the medical marijuana tax.'",
        "'speaker_11': 'If the council did not desire to do that initially, members of the public could start an initiative petition, gather enough signatures to satisfy the city clerk. And there's a percentage of signatures that must be gathered in order to qualify for the ballot.'",
        "'speaker_11': 'That could go on the ballot. Council. Then, as I mentioned, this happened in L.A. The city of L.A. decided to put a their council, decided to put a competing measure on that could may or may not happen in this case, assuming it qualified for the ballot.'",
        "'speaker_11': 'I am guessing it's pretty close to too late to qualify for June. Most likely, if it local initiative, it would qualify for November and council could decide at that time whether they wanted to put a competing measure on.'",
        "'speaker_11': 'And then obviously whichever of the two measures, if there were two got the most votes would pass and then the city would be required to implement that new ordinance.'",
        "'speaker_5': 'And so whatever the new ordinance is, what what the city has, whether it's a ban or a delivery only model, the new ordinance that would be adopted by way of petition would then supersede it.'",
        "'speaker_11': 'If the new ordinance or the new initiative was inconsistent with the ban, the new ordinance would take its place and I assume it would be inconsistent with a ban.'",
        "'speaker_5': 'Right. Okay. And. In regards to the timing of initiatives, can you talk a little bit more about that?'",
        "'speaker_11': 'I hate to put the clerk on the spot, but the clerk might be in a better position to talk about that.'",
        "'speaker_5': 'Someone who did that to her last week. Okay.'",
        "'speaker_11': 'I'll tell you what. We could either we could bring back an off agenda item, if you would like, that could give you the timing about initiatives in general. We could describe what it would take to potentially get it on the June ballot or more likely what it would take to get on the November statewide ballot.'",
        "'speaker_5': 'That would be great. So if we could do that.'",
        "'speaker_11': 'Be happy to do that.'",
        "'speaker_5': 'I just want to make a final. Comment about fiscal impact. I'm really interested and pleasantly surprised that any other council member is mentioning fiscal impact in regards to medical marijuana because this is the first. Other than Councilwoman Mango, she has mentioned it, but this is the first time I've heard some of my colleagues talk about fiscal impact'",
        "'speaker_5': '. So let's talk about fiscal impact for a minute there. Since Councilman Richardson refers to my efforts in this process to compromise as a waste of money and resources. So my understanding from the first fiscal impact report that staff wrote was that it was projected that the sales tax revenue from this industry with nine dispensaries would bring into'",
        "'speaker_5': 'the city $3 million. And the initial costs that were provided by multiple departments were $5 million to enforce the operations, including licensing, police and code enforcement. Then staff was asked to reevaluate the numbers and come back with a different enforcement model so that we could break even in this operation.'",
        "'speaker_5': 'And staff was able to do that. And what that meant was that rather than having a police based enforcement, we were going to have more of an administrative enforcement, which means for all of the unlicensed facilities that the police department using millions of dollars and hundreds of search warrants to try to shut down that process would go'",
        "'speaker_5': 'away. And instead, our code enforcement officers would be sending letters and asking people to politely and nicely shut down their operations. And that was going to be our new enforcement model for $3 million in order to break out into a break even situation.'",
        "'speaker_5': 'So let's not talk about fiscal impact as as a way to highlight the position, because I think it's pretty clear what the fiscal impact of this marijuana statute would be for the city of Long Beach. And by all accounts, any adoption of medical marijuana as an industry in the city of Long Beach is going to have a'",
        "'speaker_5': 'negative fiscal impact at a time when we need more police officers patrolling our streets and helping us deal with a rise in crime. And that is the reality. Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Lowenthal, them going to go to public comment?'",
        "'speaker_2': 'That's okay, Mr. Mayor. I don't have to have the last word. Thank you.'",
        "'speaker_0': 'Okay, let me go ahead and do public comment. So if you have any comments, please come forward.'",
        "'speaker_4': 'Very good. I go back to what the governor said a year ago this past January. California already has enough potheads. Period. It's from the governor. And he pointed out that's that we are also at or near the bottom of the barrel.'",
        "'speaker_4': 'In every almost every paradigm of import in the country. Period. Frankly speaking, I don't know. I don't have a friend. I don't know anybody. That smokes marijuana. This marijuana medical marijuana is bogus. Any Tom, Dick and Harry can pick one up.'",
        "'speaker_4': 'As they say, it is as easy as getting a promise from a politician in election time period. Kids from the high school can tell you how to get it. Period. So you just hold the line? Absolutely no. If somebody wants to move out of the city and maybe develop a policy, if somebody wants it bad enough will'",
        "'speaker_4': 'pay for their moving out of the city, period. But the council in the third district was absolutely correct. We have enough problems. All right. The country itself, this this state itself is our nature directory. Within the next 30 years, to be this city of Long Beach, notwithstanding that which we get accomplished, which we'll see will be something'",
        "'speaker_4': 'like you'll find in Guatemala or Honduras, period. A fourth rate city. Below that. And if you don't think that you're clearly out of touch with what's going on, you may be fine. That I can tell you now. Your kids.'",
        "'speaker_4': 'Kids will be living in something a fourth world country as it is now. So what you need to do is hold the fort. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Thank you. I'm Lynn Figure and founder and CEO of Highway Distribution Group, a legally licensed distributor of medical cannabis and cannabis infused products. I'm here tonight to offer my support for the ordinance, which you have before you and urge you to pass it.'",
        "'speaker_4': 'I have been a California businessman for over 25 years. I have a background in real estate development in California and in Pennsylvania. I'm also a highly respected music publisher, and I recently sold my company in December of last year.'",
        "'speaker_4': 'I'm also a producer of concerts nationwide featuring the top touring artists of the last 40 years. For the sake of clarification, distribution as defined by the state of California means the procurement, sale and transport of medical cannabis and medical cannabis products between business entities licensed by the state as distributors.'",
        "'speaker_4': 'We have been given the responsibility to coordinate all legal cannabis activities in the state of California under our license. We engage in the business of purchasing medical cannabis from a licensed cultivator or medical cannabis products from licensed manufacture for the sale to a licensed dispensary.'",
        "'speaker_4': 'This is the first positive step in creating a legally accountable business for the sale of medical cannabis in the state of California. My primary objective is to distribute products for patients that is high quality, effectively effective, properly tested, labeled, and most of all has been produced in a facility that complies with the state and local health regulations'",
        "'speaker_4': '. I am here tonight to respectfully encourage that you pass the ordinance before you and help us in establishing a reputable and trusted business. In addition, I would also like to respect the request that distributors of medical cannabis be incorporated into your ordinance.'",
        "'speaker_8': 'Our goal is to work cooperatively with the city.'",
        "'speaker_4': 'Officials, law enforcement and health officials and the community at large to understand and address the concerns that exist. We want to establish our operations in the city of Long Beach to create new jobs and taxable revenue that will benefit the local community and economy.'",
        "'speaker_4': 'We also want to earn the trust of the city and the community at large by giving back through programs focused on eradicating homelessness in the city of Long Beach. In closing, I urge you to pass the ordinance and to include a provision that includes the distribution of medical cannabis edibles and other derivative products in the city of'",
        "'speaker_4': 'Long Beach. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_4': 'Hello. I'm Mitch Klaus. I'm CEO and founder of Something Chocolate, a music inspired gourmet box chocolate that's cannabis infused. And I'm also here to encourage supportive of today's audience. I'm an entrepreneur started many businesses over the years in a variety of industries including tech magazine publishing, digital music distribution and gourmet food.'",
        "'speaker_4': 'And I worked with some of the biggest companies in the world in doing so. And I've created hundreds of jobs in the local, local communities in which we've in which we've operated. And I'm quite proud, quite proudly, even taking one of my companies public on Nasdaq in a Nasdaq IPO and became the largest digital independent digital music'",
        "'speaker_4': 'distributor in the world, controlling 25% of the content you see on iTunes. I began my company as a regular chocolate company. We have distribution at L.A.X. Airport. You'll even see it at Ralph's supermarkets and in places like the W Hotel, Hard Rock Hotel, Renaissance Hotel and others.'",
        "'speaker_4': 'I started the cannabis company for reasons that were pretty obvious that the industry needed responsibility and reliability. And my primary objective in producing a product for patients is that of high quality that are effective, taste great or properly labeled tested and most of all have been produced in a facility that complies with state and local health regulations'",
        "'speaker_4': 'by licensed food managers and food handlers. Safety to our customers and quality of our products is our primary concern. So with recent passage of Mersa, the American Medical Marijuana Regulation and Safety Act recently set forth recent rules and regulations for at the state level.'",
        "'speaker_4': 'But at the local level, it continues to frustrate us. While the passage of Mersa was a good start to doing things, quote unquote, by the book, the reality is the book is still not completely written, and there's plenty of blank pages in it.'",
        "'speaker_4': 'And that's why I'm here tonight. You have an opportunity here to start filling in those blank pages, to do the responsible thing, to help guide the industry and do something hard for a change. Doing something new is very, very difficult.'",
        "'speaker_4': 'This is a teachable moment for you and for us. So we can work cooperatively with the city, with city leaders, with law enforcement, with the community at large to make sure we understand your concerns and can alleviate those concerns in a way that's responsible and benefits the community, that creates jobs and that provides products to the community'",
        "'speaker_4': 'that is that are safe and tested. I believe this kind of reciprocal cooperation will result in the creation of a template that will become the model for which all city governments in the state and, frankly, in the nation that their will and that they will envy and replicate.'",
        "'speaker_4': 'So I really urge you to pass this ordinance before you include a provision that allows for manufacturing of edibles and other derivative products in the city of Long Beach. Thank you for listening.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_4': 'Hello. My name is Bill Napier. Honorable City Council. I've decided, and I think Long Beach will back me up. We'll take two punch ups. And I also want to thank you very much for approving the Breakwater study. Surfing USA.'",
        "'speaker_4': 'And we'll take to pot shops. And, uh, so we don't have to go out of city further than were able to go by bus or most certainly can't bike it or walk it. And, uh. Two pork chops, please.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_4': 'Mayor Council members. It is with great sadness that I had to pin this. But I must tell you of my bitter disappointment with this council and the charade that's been playing out now for seven years. My engagement in legalizing medical marijuana and the other civic affairs in Long Beach at this later stage in my life have has'",
        "'speaker_4': 'left me with this notion that there really is no adherence to constituents needs and wants by this council. A recent 74% approval by ballot and over 30 to 43000 signatures must mean nothing to this Council except neat soundbites and more lip service to patients for 1/2.'",
        "'speaker_4': 'Think patients needs, not stoners needs. This is medicine, period. Me I'm just a Woodstock generation kid and an all around believer in the idealism of a possibility of a better tomorrow. I kept my hopes alive throughout six decades.'",
        "'speaker_4': 'To see my country, who I love and I cherish, become more enlightened as I age. But it is now clear that it's not going to be seen in my lifetime. The cause of marijuana legalization that I took up officially 36 years ago is still being discussed in many circles with that decidedly racist intellectual dishonesty of the 1930s'",
        "'speaker_4': '. In some California cities, they are rushing to ban the evil that marijuana may bring to their city. Sadly, we're calling it the ban a palooza. This rush to prohibition does nothing to take marijuana away from the cartels, gangs, teens, and the ever growing black market.'",
        "'speaker_4': 'Again, with the ban, the city loses all control and the tax money that would be generated. Every business report I read says Long Beach needs more money. Now, I might not mind so much, but I've told you this before.'",
        "'speaker_4': 'Our surgeon general, our would be surgeon general. Sanjay Gupta has connected the dots. Weed number three, CNN special available on demand. He stated For the world to hear that PTSD symptoms can potentially be mitigated by medical grade marijuana.'",
        "'speaker_4': 'For heaven's sake. Even the VA has recently acknowledged that this medicine should be allowed for vets in states that permit marijuana medical marijuana. However, we have seen the VA bureaucracy and I can imagine it'll take 3 to 4 more years before that gets implemented.'",
        "'speaker_4': 'But how many vets will commit suicide while Long Beach waits? Why insist that a vet in need must act in a criminal manner in order to receive the herbal medicine that works for him or her? Mind you, this is at the same time as the VA is now documenting the effectiveness of PTSD, PTSD mitigation.'",
        "'speaker_4': 'Additionally, it is now documented that marijuana can help vets and others to break the stranglehold of alcohol, cigarets and prescription drugs. Think about the devastating pain pills that lead to heroin. L.A. Times. So still, reports evolve as I speak to you that an average of 22 vets per day kill themselves.'",
        "'speaker_4': 'My adult sons went before Ray Gavlak and Tonya Urunga initially in August of 2009 to beg for med pot rules, begging for VA rules. And this is where we're at today. Just two more seconds, sir. These patients are your friends and your neighbors.'",
        "'speaker_4': 'Every occupation, every walk of life is in the medical marijuana community. Please stop conflating legitimate medical marijuana patients and perhaps your own beliefs. Thank you, sir. Only stoner teens will be the winners. Again, I say these editorials.'",
        "'speaker_0': 'Thank you, sir. We're going to wrap it up. Okay.'",
        "'speaker_4': 'These editorials came out over and over saying we next time we got to get it right.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_4': 'Times did we get it right?'",
        "'speaker_0': 'Thank you very much, sir.'",
        "'speaker_4': 'We'll see.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_8': 'Good evening. It's an honor to be here. My name is Kyle Turley. I'm a founding member of a group called the Gridiron Cannabis Coalition. I played ten years in the National Football League. One of my partners is Jeff Chase, was one of the original dispensary owners here in Long Beach just last year.'",
        "'speaker_8': 'A little over a year ago, I moved back to California from Nashville, Tennessee, to take part, particularly as I am from here. So that's another reason. But to take part particular in the medical marijuana program, playing football in the National Football League brought me a number of ailments, brought our community a number of ailments.'",
        "'speaker_8': 'My brothers have suffered greatly because of their commitment to this dream. If we want to continue to have our children fight for these dreams, to be soldiers, to be football players, and to accomplish these great goals, we need to think about what it is we are giving them to help them along their way.'",
        "'speaker_8': 'Unfortunately, because of some of these career choices, this leads to long addictions, to prescription medications. Myself personally, 20 year addiction, to prescription medications that went from pain killers to psych meds to anti-inflammatories, and then into psych medications for the last seven years.'",
        "'speaker_8': 'And dealing with this brain injury that we now are starting to understand, if it was not for cannabis, I would not be standing here today. I would likely be standing next to my friend Junior Sayer, who is not with us, because he was not allowed to understand what cannabis could do for his brain.'",
        "'speaker_8': 'We heard a lot of things tonight about why this needs to happen in Long Beach, why that needs to happen to Long Beach with climate control. Alzheimer's was a discussion. There is no current medication in western medicine that addresses Alzheimer's disease like cannabis.'",
        "'speaker_8': 'Cannabis has been shown to reduce and stop the progression of Alzheimer's disease in multiple studies. The fact that in California and I've come back from Tennessee that we're having this conversation, it's quite archaic to me, to be honest.'",
        "'speaker_8': 'But at the end of the day, I hear a lot of things leading to kicking the can down the road. This no longer needs to exist. There is an initiative on the ballot to move forward, to have something in place and something is better than nothing.'",
        "'speaker_8': 'I urge the Council to push forward on this ballot, to allow these dispensaries, the new initiative to move forward so that something can be established, much like has been talked wildly about our health care model and that it needs to be improved.'",
        "'speaker_8': 'But nobody wants to throw it out because it's helping people. Cannabis will save football and it will save many communities, Long Beach included. I appreciate your time. Thank you for your understanding.'",
        "'speaker_4': 'And your ear.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mayor and City Council. I'm Jack Smith. I live at 240 Chestnut Avenue in the first district. I was on the Cannabis Task Port Task Force representing the second district, which is where I lived at the time last summer.'",
        "'speaker_4': 'Now living in the first district. I don't have a marijuana business. I don't intend to have a marijuana business. I thankfully don't need the medicine that cannabis provides. I don't intend to use it recreationally. My goal and intent in all the attention I've been paying to this effort has been to make sure that our neighborhoods were safe'",
        "'speaker_4': 'and that these businesses were not a nuisance in the neighborhood. That's why I've worked so hard to help create some regulations that I believe accomplish that while accommodating the needs of medical marijuana in Long Beach. One of the things that I think could be modified now.'",
        "'speaker_4': 'I usually don't talk if I know I'm going to lose. And I've already counted five votes for the ban. I don't call that a lose. That's always an option since day one to continue the ban. So anyway, the point is I usually don't talk that there's no point in talking, but today I'm going to offer a potential'",
        "'speaker_4': 'change to the proposed ordinance for you to consider. That might streamline it just a little bit. I was glad Councilmember Price asked the question about the process of changing between a delivery and into a storefront. I believe if you treated the SIU process and the vetting process, that is quite complicated and lengthy and expensive in creating storefront'",
        "'speaker_4': 'sites. Who could only do delivery. That are then reevaluated in the six month time period. And the only change that has to happen is that delivery is permitted. It wouldn't have to be a modification of the cup. It would just be at that point now.'",
        "'speaker_4': 'Now, I mean, now that you can have a storefront, you can open your doors. It would be the exact same rules and regulations as if it was a retail operation. But they can't open their doors. They can only.'",
        "'speaker_8': 'Deliver. And when they.'",
        "'speaker_4': 'Have behaved appropriately, come back. And very simply and quickly be able to open their doors for business, then the idea of eventually being able to have as many marijuana businesses as you specify. Right now you're saying seven. At that point, you might have evaluated something enough to know that a different number is appropriate.'",
        "'speaker_4': 'So I think that you have an ordinance in front of you now that can be slightly modified to clarify that process, process to make it a little more streamlined. Also, the businesses would not have to be a delivery business and in a totally different process for a retail business.'",
        "'speaker_4': 'The same business could continue in this city, having demonstrated that they're a good business for our city. I hate to see you punt. It is Super Bowl week, though, so punt, if you will. And I would encourage you to.'",
        "'speaker_8': 'Pass the ordinance that you.'",
        "'speaker_4': 'Have with some minor modifications. Thanks.'",
        "'speaker_0': 'Thank you, Jack. Next speaker for final speaker.'",
        "'speaker_4': 'When he was somebody left to phone or something up here present for the. Excuse me. I hope you've all read The Beachcomber. I hope you've all been reading The Beachcomber. I know Ms.. Price thinks Mr. Downing is very dangerous and has said so.'",
        "'speaker_4': 'I believe she's very dangerous as a prohibitionist. I believe we should recall our city attorney.'",
        "'speaker_8': 'For giving erroneous advice to this council and previous councils.'",
        "'speaker_4': 'By Mr. Shannon as well. He's followed the same line as with Mr. Shannon and the reason we've had 20 years. Of. No action, really. It's because of the prohibitionists inordinate influence over this council. And our local criminal justice membership.'",
        "'speaker_8': 'We need to do something about this, but it isn't what you're doing.'",
        "'speaker_4': 'You need to excuse yourselves from the discussion and.'",
        "'speaker_8': 'Follow state law only. I believe state law says that the dispensary, the the delivery service must be connected to a dispensary. So to have just delivery services doesn't work.'",
        "'speaker_4': 'It won't work. Fiscal responsibility.'",
        "'speaker_8': 'This Council and previous councils and our law enforcement.'",
        "'speaker_4': 'Agency, the Long Beach Police Department, have spent billions. Billions. To avoid dealing.'",
        "'speaker_8': 'With this issue. To keep a ban in place.'",
        "'speaker_4': 'That's the prohibitionist agenda. The prohibitionist agenda is corruption. Clearly it's corruption. Read The Beachcomber if you want to know what's going on in City Hall. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next beaker, please.'",
        "'speaker_4': 'My name is Nicholas Khemka. I live in the second district. Long Beach has recently developed a program for delivery of medical marijuana, and I applaud the city for that. For many years. There's been a lot of hand-waving by some people behind me, by some people in front of me about safe access.'",
        "'speaker_4': 'I believe delivery does provide safe access, safe access for patients, safe access for other people who are not users. But in reality, for a lot of people, it's not about safe access, it's about profit. Clearly, some of the people behind me profit from this.'",
        "'speaker_4': 'And if anybody in front of me profits from it, it conforms to the definition of the elements of malfeasance as defined by appellate courts. My second and last point is that the size of the Long Beach Police Department has decreased from about a thousand officers to 700, and that's 300 officers less to deal with documented cases of'",
        "'speaker_4': 'murders. Attempted murders, arson, illegal drug use and sales. Assaults, batteries and large numbers of property crimes. And note that this also lowers our property values and it interferes with other people's constitutional rights to live peacefully and safely. Allowing storefront storefront dispensaries to be reestablished.'",
        "'speaker_4': 'Might also meet some of the definitions of malfeasance. And this, in turn, opens up the city to lawsuits. And that's taxpayer money. I beg the city to adopt a delivery only model. For marijuana, medical marijuana. And that safe access for patients and it's safe for everybody else.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Final speaker, please.'",
        "'speaker_8': 'Hi, my name's Stephanie Dawson. So I'm a resident district to my.'",
        "'speaker_4': 'Address is on file. I'm going to be very brief.'",
        "'speaker_8': 'The Rand Corporation recently came out with a very expansive study that surveyed both medical and recreational patients. I think going forward for both for regulation purposes and for whatever audience comes out of this this process, again, I would be in strict opposition to the current audits that that's being proposed for a myriad of reasons.'",
        "'speaker_8': 'One of which being, if you look at the particular at this survey that the RAND Corporation recently concluded, the particular section on concentrates and edible production within the city of Long Beach is not going to be serving the interest of patients.'",
        "'speaker_8': 'One of the things that they came out that one of the interesting things that came out of this because of the survey was a result showing that medical patients, one, spend more money on their own on their weekly amount of marijuana than admitted recreational users, and they are more likely to book to use vaporizers and edibles as'",
        "'speaker_8': 'a means of consumption, something in the range of 70% for both vaporizing and edibles versus 90% for smoking flower, which is mostly associated with recreational use. This means that without a clear manufacturing license or the ability availability of commercial kitchens under an ordinance, a license activity that under.'",
        "'speaker_8': 'So, by the way, we're going to be creating a negative environment that will more likely suit recreational users than actual legitimate qualified medical patients. That is the present ordinance as constructed. I urge you, please, to disregard it entirely and to start anew that you have a good day.'",
        "'speaker_0': 'Thank you. With that, I'm going to go back to the council. There is a motion and a second by Councilmember Richardson to receive and file, which would essentially not move forward with the ordinance. And a second by Vice Mayor Lowenthal, please, Councilwoman Price.'",
        "'speaker_5': 'Terms. If the city council adopted an ordinance that had buffer zones in place for brick and mortar operations and a subsequent ballot initiative was passed hypothetically with no buffer zones or less buffer zones. What would happen then?'",
        "'speaker_11': 'In that hypothetical, the buffer zones would disappear the in if if the ordinance that we had on the books was inconsistent with the one that was voted on, then the the voted on measure would take precedence.'",
        "'speaker_5': 'So regardless of what is in place prior to a ballot initiative. Early speak the. Because it would be inconsistent with the ordinance. Presumably that would be the reason for the ballot initiative, correct? Okay, great. Thank you.'",
        "'speaker_0': 'Thank you. Bye. Okay. Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you. And I appreciate Councilman Councilwoman Price's questions. I don't want there to be a supposition that the ballot measure would have taken place if this council had actually developed a good policy. A lot of the partners that are motivated behind the ballot measure were also working with this council very honestly and very sincerely to develop a'",
        "'speaker_2': 'policy, come up with the buffer zones, all of which had agreement and general agreement. So none of that. Was in place and therefore folks are going to the ballot measures. So I don't want us to be left with this impression that this ballot measure was going to happen anyway.'",
        "'speaker_2': 'So it's okay. Whatever policy we had, if we had a good policy, I assure you, no one would have gone to the ballot. Thank you.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'A quick question about the ballot information, Mr. Mays, you said you would be drafting some sort of information for us. When would that be likely to come back? Do we have to formally ask you at this time?'",
        "'speaker_11': 'But I hopefully would be able to prepare that by next week and send it to you on and off. And the item and it would basically just describe what the ballot initiative, the local ballot initiative process was.'",
        "'speaker_1': 'Okay. So that would.'",
        "'speaker_5': 'Be by next.'",
        "'speaker_1': 'Week or so. Thank you.'",
        "'speaker_0': 'A county councilman Richardson.'",
        "'speaker_8': 'Just want to be clear, the motion here that I or doesn't and my comments haven't said that I plan on or I haven't heard from the City Council that it plans on placing an item on the agenda. What I said was what I said was I you know, I have heard of initiatives happening both in the state'",
        "'speaker_8': 'and locally around this issue. To clarify my position. I don't think if if an idea was a good idea, it's okay to bear a fiscal impact if it is, you know, additional hours in the library, if it is expanding summer hours for be safe.'",
        "'speaker_8': 'Those things all have a fiscal impact. And I'm okay with that because those are good ideas that it sound public policy. What I'm saying here is if that's not if that there's not true consensus, if no one on the council is truly expressing something that's a true compromise motion, then we shouldn't proceed on this process.'",
        "'speaker_8': 'I'm not saying anything about a ballot measure in the future. If someone puts forth a ballot measure, I honestly believe that if we put forth sound public policy, we probably wouldn't be in a position where we hear from the community about ballot measures.'",
        "'speaker_8': 'So I just want to be clear. I'm not saying that we should stop this and then start a ballot initiative on behalf of the city council.'",
        "'speaker_0': 'Okay. So that is that they're going to go and go to a vote, which is Councilmember Richardson's motion to receive and file. How I was just alerted by the clerk that the rebooting the voting system, is that correct?'",
        "'speaker_0': 'It's still not rebooted. Okay. So I'm going to I'm going to have to take a hand vote.'",
        "'speaker_11': 'Just to be clear, Mayor, this would be the substitute motion, correct?'",
        "'speaker_0': 'This is a substitute motion to receive and file. And Mr. Mays, the city clerk, told me that the voting machine is not working. So which would do a hand vote or.'",
        "'speaker_11': 'A hand vote would be fine.'",
        "'speaker_0': 'Okay. So what we're going to do then is, is counsel. So if you are in favor of the motion, which is the substitute motion to receive and file. Oh, the voting is a backup. Okay, just kidding. So forget that.'",
        "'speaker_0': 'Sorry. Is the motion back? Is the motion loaded, Madam Clerk? Okay. Motion is loaded. Councilman Richardson's motion substitute members. Please go and cast your votes on the motion.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Motion carries. Thank you. And with that, we're going to go ahead and go to the next item, Madam Clerk.'"
    ],
    "Resolution to Approve and Update the Emergency Operations Plan.": [
        "'speaker_1': 'Item number seven. Report from Disaster Preparedness and Emergency Communications. Recommendation to adopt a resolution approving the emergency operations plan citywide.'",
        "'speaker_0': 'Councilman Austin. Is there any public comment on the item?'",
        "'speaker_4': 'Please come down. Larry. You're good. You work as the address. I am suggesting that. At this point, the city should undertake the following action. They did return the responsibility of the police dispatch. To the police department. And the fire dispatch to the fire department.'",
        "'speaker_4': 'Period. Over the last year, I've been before this council and also through one of the police review commissions or whatever else. There's a serious lack of training. Relative to. The operators that are answering the phone. I don't know where that is.'",
        "'speaker_4': 'And we didn't have that much of a problem until this merging. So I'm suggesting that you give very serious consideration to returning the. Communication paradigms. To the police department. They will have the direct responsibility. And the fire department will have their direct responsibility.'",
        "'speaker_4': 'Quite frankly, I have absolutely no confidence that these people that the present paradigm would be able to handle an efficient manner, a major disaster period. So before you rubber stamp this, I think this needs to be given very careful consideration.'",
        "'speaker_4': 'I'm not sure how often you call, but there's it's an absolute absurdity, period. They have no cognitive skills relative to what needs to be done. In my view. Thank you.'",
        "'speaker_0': 'Thank you. Got some roasted.'",
        "'speaker_7': 'Yes, Mr. Mayor, I'd like to get a brief staff report on this shirt.'",
        "'speaker_4': 'Mr. West. Reggie Harrison. Mr. Mayor, members of the City Council. The item before you.'",
        "'speaker_8': 'Is to adopt a resolution approving the emergency operations plans and operate and authorizing the city manager to amend and update the plan on a periodic basis. The while the causes of emergencies vary greatly.'",
        "'speaker_4': 'Earthquakes, floods, tsunamis those.'",
        "'speaker_8': 'Impacts that we encounter with these various emergencies, the potential effects of the emergencies do not change a lot in terms of loss of property, loss of life, sheltering needs.'",
        "'speaker_4': 'Etc.. So those things.'",
        "'speaker_8': 'Are constant when we deal with an emergency. And so what the emergency operations plan does is it provides an organizational framework by which we can manage these kinds of disasters.'",
        "'speaker_4': 'The the the plan.'",
        "'speaker_8': 'Defines the responsibilities for city staff. Who is responsible for notifying the public of a disaster? Who is responsible? Who is responsible for providing for food and.'",
        "'speaker_4': 'Shelter of residence?'",
        "'speaker_8': 'Who is responsible for coordinating necessary resources through the county and through the and through the state?'",
        "'speaker_4': 'So our plan.'",
        "'speaker_8': 'Identifies all of those responsibilities that act. It authorizes the activation of the.'",
        "'speaker_4': 'Emergency operations center, as well as the expanded duties of.'",
        "'speaker_8': 'Designated staff. As we talked earlier about the the newly approved emergency procurement. Documents that we've recently entered into. It also positions the city by having a plan in place that positions the city to be in a better place for.'",
        "'speaker_4': 'Reimbursement for FEMA in terms of grants and.'",
        "'speaker_8': 'Reimbursement for our expenses associated with disasters.'",
        "'speaker_4': 'So it puts us in a position where able to identify a plan that we have in process. We've we've coordinated the plan with all.'",
        "'speaker_8': 'Of the city, with all the city departments. We have also coordinated our plans with the County Office of Emergency Management, as well as with the State Office of Emergency Services as well. So our plan, we believe, follows all of the FEMA guidelines and we request your approval for it.'",
        "'speaker_4': 'And that concludes staff's report.'"
    ],
    "Early Works Agreement for Civic Center Project Design Development.": [
        "'speaker_0': 'Thank you. There's a motion in a second. Members, please cast your votes. We already did. Public comment. Motion carries an excited please.'",
        "'speaker_1': 'A report from Economic and Property Development and Financial Management recommendation to execute an early works agreement between the city, the harbor department and plenary more civic partners to continue the design development of the Civic Center project for a limited period of time.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'Okay. Any public comment on the item? Come forward, please.'",
        "'speaker_4': 'Very good. You click as the address. I sent you guys each an email. I don't know if you have seen that access and you'll see it as super over Super Bowl day. NBC Today they had the Academy Award winning Marie actress Helen Mirren, who is going to be doing the Super Bowl spot for a Budweiser.'",
        "'speaker_4': 'And the thrust of it they are to be commended for it is they're going after drunk drivers. And essentially she spends 15. She spends the entire I don't know if it's two or 3 minutes essentially creating a new orifice in the rear end of someone that's drunk.'",
        "'speaker_4': 'And she concluded at the end that. Drunk people are so bad. That if they died and left their. Brain to medical science, it would be rejected. And that immediately, the moment she had mentioned that, I thought of this council relative to embracing this buffoonery.'",
        "'speaker_4': 'Relative to the City Hall Project. The only intelligent way to approach this is I have mentioned the last couple of meetings is one. On this terra firma here. We build two economic engines, a hotel and office building. Number two, the port, the city hall, together with the Port Administration building, will be built back out in the port'",
        "'speaker_4': 'period. And then the school, the main library will be interface with the Paradine over the art school, so forth, which will name after Marian Anderson. That's the only intelligent way to do this. And I was very glad to.'",
        "'speaker_4': 'And that was an excellent retreat you had. And I remind you of what you were cautioned about from the bond expert relative to your. Well turned out to be your personal exposure in this day and age. All the words good, bad and ugly have to be out there.'",
        "'speaker_4': 'Know, it's my understanding that in closed session you have been advised that there is nothing wrong with this building in terms of earthquake stability, so forth. And I find it very difficult to believe that you'd be able to put a bond out there, not only for this, but for anything else, if you were to follow a course'",
        "'speaker_4': 'of action. That would suggest that your brain has either been impacted, if not by alcohol, by maybe that which. Is Pablo in Flint, Michigan, or Porter Ranch? Very it. Rethink your for your own financial stake.'",
        "'speaker_0': 'Thank you, Mr. Goodyear.'",
        "'speaker_4': 'Check it out with your spouse.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Roger Suarez. I represent the International Association of Machinists and Aerospace Workers. I'm here to speak on this issue. The city is gambling with large sums of taxpayer money. Here on this Early Works Agreement motion, the city management is solely responsible for being in this predicament.'",
        "'speaker_4': 'The AM was ready to come to the table last year at the beginning of October and made requests for information early on. City management was unresponsive to our requests to meet and confer at this time. At that time.'",
        "'speaker_4': 'And it wasn't until just recently that the majority of the information was provided after being strung out in piecemeal fashion for months. We still can't get answers to some of our questions as these managers at the table don't seem to know the answers and don't know who to get these answers from.'",
        "'speaker_4': 'This lack of transparency and willingness, ability to bargain in good faith in the prescribed manner is what led us to this predicament, not the IAM or its members. You can build your Taj Mahal while city workers will continue to qualify for food stamps and you can continue to manipulate the work hours so they don't qualify for the'",
        "'speaker_4': 'Affordable Care Act. The act. The act. Excuse me? The act actions you are being asked to sign off are are reprehensible. Please honor the oath you took. To protect the community, the city. And more importantly, your own labor force your employees.'",
        "'speaker_4': 'Stop sanctioning whatever the city manager wants you to do. You're the council. It is your decision. Mr. Work, Mr. West works at your pleasure, not the other way around. The IAM continues to be ready to meet and confer in good faith.'",
        "'speaker_4': 'We've got a problem here and it seems that the problem has been put on our shoulders. We're the ones that are not cooperating. We're being asked. To go along with an agreement that has taken place. Do you give up?'",
        "'speaker_4': 'Our work rights to the new civic, civic, civic project for 41 years. We weren't asked to be a part of that. Now you're asking this community to pay $1 million, $900,000 a month so that you can preserve some commitment and some building funds a month.'",
        "'speaker_4': 'And if you look at the fiscal impact of the letter that stated today that you have before you from the city manager that he approved, the fiscal.'",
        "'speaker_0': 'Impact says.'",
        "'speaker_4': 'There's no guarantee that you're going to get that money back. It's right there in black and white. This is a huge gamble. It's $1,000,000 a month. I ask you to really think about this? Thank you.'",
        "'speaker_0': 'Thank you. There's emotion and sickened on the floor to approve the agreement.'",
        "'speaker_4': 'Mayor Garcia? Yes. Sorry to interrupt. If I could do a couple of small changes to the early works agreement. May 1st is a Sunday. We'd like to modify the Early Works Agreement to expire April 29th, which is a Friday.'",
        "'speaker_4': 'Secondly, plenary more is in the process of changing its name, so we'd like to have the early works agreement effective for successors and assigns as well. And that's it. Okay.'",
        "'speaker_0': 'Council made a note of those two changes. There's a motion on the floor. Members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Next item, please.'"
    ],
    "Resolution to Approve Housing Revenue Bonds for Mercy Housing California Partnership.": [
        "'speaker_1': 'Report firm Financial Management and Development Services recommendation to receive supporting documentation and to the record regarding the Equity, the Tax Equity and Fiscal Responsibility Act. Public Hearing and adopt resolution approving the issuance of multifamily housing revenue bonds. District six.'",
        "'speaker_0': 'Is there any public comment on the item? Mr. Greer.'",
        "'speaker_4': 'I. Part of my comments echo what I told the council in Andrews last Saturday and so forth. I took Atlantic up to the to the meeting and I generally don't go up that route because it's not close to the Marine.'",
        "'speaker_4': 'I'm not around that area very much, but I was very impressed, very impressed with the housing that starts at Atlantic and PCH, then going north for about 8 to 10 blocks. It looked like a housing section that you would see any place in Belmont Shore or any other mills or any other place and so forth.'",
        "'speaker_4': 'And if this mirrors that, I think it's well worthwhile. However, however, I still have the same concerns relative to this is a bond measure. Period. And your exposure is tremendous given the kleptocracy, the corruption. Not only in the state of California that flows down into this city, which is there's a few fountain heads of that here, period'",
        "'speaker_4': '. And if you didn't notice, the FBI has now moved into the city of San Francisco relative to the sheriff's department. And that, of course, is the the stomping grounds of she that the United States Circuit Court and the U.S. Ninth Circuit.'",
        "'speaker_4': 'Opined, was responsible for an epidemic of corruption. Right now, the nexus between that and our mayor is something you're going to have to post on those bonds, if not your individual financial liability, that of your spouse. Is in jeopardy.'",
        "'speaker_4': 'So I would suggest that you check and the smile from the Peter Principle of city manager will not protect you. I would suggest you seek your own counsel, period. For the protection of your family as well as the cities.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Members, please cast your votes.'",
        "'speaker_4': 'Krispy Kreme.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Next item, please.'"
    ],
    "Ordinance to Establish a Veterans Affairs Commission.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': '13.'",
        "'speaker_1': 'Communication from Councilwoman, Mango Chair and Economic Development and Finance Committee recommendation to approve the establishment of a Veterans Affairs Commission and declare ordinance amending the Long Beach Municipal Code relating to establishing a Veterans Affairs Commission. Read the first time and laid over for the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_0': 'There's a motion and a second councilman, Mongo.'",
        "'speaker_1': 'I'm just excited that the veterans will have a seat at the table. Our committee considered Rex Richard Councilmember Richardson's suggestion. We think it's an excellent one. Thank you.'",
        "'speaker_0': 'Councilman Richardson. He's fine.'",
        "'speaker_8': 'So thank you so much. The Eady enough committee for processing this and bringing it forward. I think it's certainly worthwhile and it seemed like low hanging fruit. This is one of the first things we took on when the new counsel came to office.'",
        "'speaker_8': 'I know that it took us a while because we had to go through the budget. There was some fiscal impact, but it made a lot of sense to do and it was a good idea. So I'm happy you finally made it to this step.'",
        "'speaker_8': 'Thank you so much. Let's get some commissioners, get it online and get some commissioners appointed.'",
        "'speaker_0': 'Any public comment on the item signal? Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Item 15.'"
    ]
}