{
    "Presentation and Ordinance Preparation for Measure A Transactions and Use Tax Extension.": [
        "'speaker_0': 'We have one one big item before us. So you can come back if you'd like for for that item. And with that, let me turn this over now back to the regular agenda. And we're going to begin with item 25.'",
        "'speaker_0': 'Now we have and staff has a presentation on that.'",
        "'speaker_1': 'Item 25 is communications from City Manager recommend a recommendation to receive and file presentations on the potential extensions of the existing measure transactions and use tax citywide.'",
        "'speaker_0': 'Thank you. We're going to go ahead and start with the presentation. So Mr. West and Mr. Motor.'",
        "'speaker_4': 'Mr. Mayor, council members, this presentation is going to be given by the Assistant City Manager, Tom Modica. Tom.'",
        "'speaker_11': 'Thank you, Mr. West. So, Mary Council, we have a fairly lengthy presentation we'd like to walk you through to talk about something pretty critical that staff is recommending that you consider tonight, and that is the extension of Measure A, we'd like to kind of go through what measure has been used for, talk about some of the challenges'",
        "'speaker_11': 'that we foresee over the next 30 years that we really believe Measure should be a part of and kind of walk you through kind of our recommendation to you. And so on the screen, we'll get started. There we go.'",
        "'speaker_11': 'So just to remember, what is Measure A and how it came to be. July seven, 2016, we brought a measure to the voters to basically do a 1% sales tax for ten years, dropping down to half a percent after after six years.'",
        "'speaker_11': 'And Long Beach voters approved that by 60% of the voters it needed, 50 plus one to pass. It was a ten year sales tax that the council said by resolution was going to be for public safety and for infrastructure.'",
        "'speaker_11': 'As I mentioned, it was one 8% for six years, then declined half a percent for four years and expired in 2027. As part of that measure, we established a five member citizen's advisory committee to really review the use of the funds by the city.'",
        "'speaker_11': 'They meet about 3 to 4 times a year. They take action to determine is the spending that the city's doing consistent with the resolution and the promise made by this Council of Voters. And they've approved that every single year.'",
        "'speaker_11': 'The number that it is generating is about $60 million a year at 1% and then about 31 million a year when it hits half a percent. And so we'll talk a little bit about. The new challenges that we're facing related to community health services tonight.'",
        "'speaker_11': 'We still have infrastructure challenges. Measure A has been a huge success and we'll talk about some of those successes. But we really do have long term funding solutions that we need to identify over the next 30 years for our infrastructure.'",
        "'speaker_11': 'We've also dedicated about half of the tax towards funding operations, and 2027 really isn't that far away where we have to make some decisions about whether those positions are at risk for elimination or whether they're going to continue.'",
        "'speaker_11': 'And Missouri really has been an enormous success. We've added public safety officers. We've maintained public safety personnel that otherwise would have been reduced. And we funded an unprecedented investment in our city's infrastructure. So let's take a look at some of the projects and services funded by measuring.'",
        "'speaker_11': 'One thing we did is we enhanced our public safety. We added 41 new public safety positions. We did Paramedic Rescue 12 and Fire Station eight restored to service. We used to have four police divisions and in the recession, we went down to three.'",
        "'speaker_11': 'And with Missouri, we're able to bring that back to four police divisions with the addition of South Patrol. And that's now at the same operational level as the other patrol divisions. We now have dedicated staff at our police academy, which allows us to to hire additional police officers.'",
        "'speaker_11': 'And we are supporting fire departments, heart team and our quality of life units. Those are two key units from the public safety side that are out in the field dealing with homelessness every single day. Important as well is that we've maintained 108 public safety positions.'",
        "'speaker_11': 'These are positions that otherwise would have been reduced and not available had we not had Measure eight to to help protect them. We've provided additional police and fire academies and we've renovated. We're planning for the future renovation of their training facilities.'",
        "'speaker_11': 'We've also been able to invest in new technology for public safety, including operational radios and body worn cameras. Looking at some of the infrastructure. And we'll dove a little deeper here in a second. But it's been about $88 million so far from FOIA 17 to FOIA 19 in measuring funds.'",
        "'speaker_11': 'And that is the largest investment we've seen in a long time. We've done $42 million. The vast majority has gone into streets and sidewalks and alleys. About $27 million into our parks and recreation facilities, about $15 million into our other public facilities and $3.5 million in stormwater projects.'",
        "'speaker_11': 'You'll all recognize this map. When we went out to voters, we showed them a map and said, these are all the projects that are going to get done. They're are based on need. They're pushed throughout the entire city.'",
        "'speaker_11': 'And we have kept true to that promise. So these dollars, these projects are all getting done with the current measure that the voters had voted on. And we we're getting nothing but accolades for the projects that are happening out in the community.'",
        "'speaker_11': 'So let's look a couple of those in detail. We have one of the first projects we did with Measure eight in the first year is we identified every street that could have a protectant sealant put on it to help with the preventative maintenance.'",
        "'speaker_11': 'Maintenance. We call that slurry seal. And we slurry sealed every eligible street in the city. 232 lane miles. We identified the worst of the worst alleys. Those are the alleys that were dirt. And those will all be paved with measure.'",
        "'speaker_11': 'We've done three miles so far. We had a new park space, brand new park space in the red car greenbelt. And as the vice mayor mentioned earlier today, we broke ground on Houghton Park Community Center, and that's under construction.'",
        "'speaker_11': 'We built five of the best playgrounds that we have in the entire city with major a signature playgrounds that are really, truly amazing. And we have another four in the works. We repaired a number of roofs. And, you know, you know, those aren't always the most exciting things, but those are things we have not been able to'",
        "'speaker_11': 'fund just with basic dollars until there's a crisis in emergency. So we're able to proactively replace roofs, which saves the community a lot of money and lots of service. We've improved stormwater protection, we've done park improvements. We've also funded 102 lane miles of complete street projects, which include everything from curbs to ramps and sidewalks.'",
        "'speaker_11': 'We've repaired and upgraded 30 public facilities and we've done parking lot improvements and all of these projects are all on the web. We have an interactive GIS map where you can click on, see the project and see the status and how much money it was funded for.'",
        "'speaker_11': 'So I'd like to talk a little bit about our funding needs and what our challenges are coming up in front of us. And they really fall into three categories. Excuse me. The first is community health. So we do have some new challenges in community health.'",
        "'speaker_11': 'First and foremost, it's community hospital. So Community Hospital stopped accepting basic life support patients in spring 2018. That was completely unexpected and closed completely in July 3rd, 2018. That happened after Missouri was adopted. That was something that was presented to us in 2017 and happened shortly thereafter.'",
        "'speaker_11': '27,200 emergency service visits occurred at Community Hospital in 2016 and since its closure. Ambulance transport times have increased by 10%, which is a significant number. The City Council has been very familiar and involved in creating a strategy and a solution to reopen community hospital.'",
        "'speaker_11': 'We've identified a great private partner who is interested in that, and under the proposed deal that we're in, that we're working on finalizing our cost share would be about $25 million over the next 15 years. It's a city facility.'",
        "'speaker_11': 'We need to put put our share into the seismic improvements while the private operator shares in those improvements and also puts in the money for the operating. So this council has made the initial decision to move forward with that, which we fully support, but it came without any revenue.'",
        "'speaker_11': 'So we do not have a solution on how to pay for that $25 million. And without additional solutions, we're likely facing other service reductions to make that a priority. The next category is infrastructure. When we came out with Measure eight, we estimated a backlog of about $2.3 billion.'",
        "'speaker_11': 'That really was an estimate at the time. We know that number is going to change as we both improve and also get additional data through our studies. And measure has been a huge help. It invested immediately $88 million over the last three years.'",
        "'speaker_11': 'But that is a small number. When you're looking at funding infrastructure, you're looking at funding it over the long haul. So what we've done with some of the infrastructure money is we created four plans really to assess and prioritize our investment.'",
        "'speaker_11': 'So this council has real data to understand what the need is and how we can best prioritize. We funded a pavement management plan which showed that we have about $510 million in street needs. We funded the city's first alley assessment plan and found out that it's about 98 million.'",
        "'speaker_11': 'There are sidewalk management plan has been completed with 631 million. And we're underway with a facilities investment plan. We have 200 facilities. We've done 17 so far, and that need is about 38 million. So if you extrapolate in rough numbers, it could exceed 500 million.'",
        "'speaker_11': 'And we'll know in the next two or three years as we finish that plan what that actual number is. And so what's important here is the sooner you can invest in your infrastructure, the cheaper it's going to be.'",
        "'speaker_11': 'If you wait until it's completely dilapidated, the cost just as much more is much higher. The third major area is public safety, where public safety remains our top priority. 70% of the dollars the council allocates goes to public safety and personnel costs.'",
        "'speaker_11': 'Really? We do public safety with people, with police officers, with firefighters. And those personnel costs grow every single year regardless of salary increases. The cost of having a force from all it takes to have a police force and a fire force grows every year.'",
        "'speaker_11': 'And so measure has been enormously helpful with both adding and enhancing, but also maintaining what we have and keeping those officers on the force. And so to date, right now, when you add the additions, plus all the officers we've been able to keep, officers and firefighters, it's 150 positions are funded by Measure A.'",
        "'speaker_11': 'So I want to talk a little bit about the public support for this. Just one thing we hear a lot is that Long Beach is the highest city with the highest sales tax. You'll hear that from time to time.'",
        "'speaker_11': 'It's not the case. I wanted to show you this data here. While we were in earlier, adopter, since we went, 16 additional cities in our area in California have increased or proposed to increase their local sales tax. There's one city, Santa Fe Springs, that got special legislation to be at 10.5.'",
        "'speaker_11': 'And you can see the list of all the cities at 10.25 and the cities right behind us at ten.'",
        "'speaker_0': 'Mr. MODICA Just to clarify that, but that list is not a that list is of the cities that are kind of in this in Southern California.'",
        "'speaker_11': 'This is primarily Southern California. There may be one or two in Northern California. As a rule, we looked most of the cities with this sales tax tend to be in Southern California rather than northern California.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_11': 'So before bring in the staff recommendation to you, we wanted to go out and do some polling to understand kind of how people perceive measure and also was there a public support to extend it. This is something a lot of cities do.'",
        "'speaker_11': 'There's a firm called FEM three, which are the premier firm out there that does this type of work. They've done 135 other California cities, and they also have done have done work for the county of Los Angeles and the Long Beach Unified School District.'",
        "'speaker_11': 'So we interviewed in April 600 Long Beach voters. We did interviews in English and Spanish. So I want to walk through some of the summary of what they found. One of the key questions you ask is, do you think that there's need for additional funding in Long Beach for quality services?'",
        "'speaker_11': 'And that number in Long Beach is very high. It's 70% to show that there is a great need or some need. And so that's a very strong number. We asked what the top three areas were for a measure of priorities.'",
        "'speaker_11': 'The top one was fixing potholes and repairing streets at 83%. The next was retaining all the new additions that we've been able to put in at 78% for public safety and revitalizing neighborhood parks at 76% and maintaining officers and others are right behind that.'",
        "'speaker_11': 'And when you do polling, you tend to ask the same question three times so that you can get an accurate gauge of of a number of different factors. So you asked the first time, just without a lot of information, here's what measure is would you support extending it?'",
        "'speaker_11': 'And in Long Beach, that number was 68%, which is an incredibly high number. When you talk to talk to the experts that do this. You then provide some messages about, you know, what is long? What is this measure?'",
        "'speaker_11': 'What could it be used for? You provide some of the positive messages to see what that does to the number. And in Long Beach, it went up to 74%. And then you provide some of the other arguments that you'll hear from an opposition campaign just to understand what that would do.'",
        "'speaker_11': 'And that actually brought it down only to 71%. So actually higher than where you were on the initial vote. So those are incredibly strong numbers. You don't often see that, you know, from what we understand in in many cities.'",
        "'speaker_11': 'So do you want to talk a little bit about why we would need this money and what our current financial situation is as well? So over the years and the last probably seven or eight years, there's been three major events that have helped us from a financial perspective.'",
        "'speaker_11': 'And the first one is the termination of redevelopment agencies. So while we lost a lot on the redevelopment side, that was a big significant improvement in the general fund side of our ledger. We also got a lot of cost savings from pension reform alone, which was one of the first cities to do pension reform.'",
        "'speaker_11': 'And what that did is had all of our city employees paying a much higher percentage into the pension system than they were before, and that's ongoing every single year. And the third was money for measures to both enhance services and maintain services.'",
        "'speaker_11': 'So when you add up those three, you actually end up with $55 million in support from those three major actions and $30 million a year from in infrastructure and one time uses. So without that, we would have been looking at some pretty drastic reductions.'",
        "'speaker_11': 'However, all three of those are fully allocated and they're all used to support current operations. But our cost, just like every other city in a high cost state, continued to rise. So looking at our what are the projections look like?'",
        "'speaker_11': 'I do want to say that, you know, the further out you get, the harder it is to project. So these numbers can and will change. That's why they're also expressed in a in a potential range based on a number of assumptions.'",
        "'speaker_11': 'But when you see the budget in about a month, you're going to see a very good budget, the FY 20 budget. It's essentially balanced, not a lot of service enhancements, as we had mentioned over the years. But it's going to be a good, strong budget in Fy21 there are some challenges in Fy22 and then measure would be'",
        "'speaker_11': 'an option for the council to look at and make some decisions in about $15 million in FY 23. And then not sure on this chart is right now in 27, you wouldn't have any more measure of money under the staff's proposal.'",
        "'speaker_11': 'You would with voters approve. You would have an additional $60 million that we aren't currently receiving. So there's some complexity about the ballot measure, and I want to walk through that a little bit. So state law currently puts a cap on sales tax at 10.25 for all state and local taxes, including city and county tax.'",
        "'speaker_11': 'And so any extension of Missouri really needs to take that cap into account. And so we recommend that you do that in concert with some of the other tax measures that are out there, which includes Measure H, which is the homelessness tax that the county has put on, which also has a sunset provision.'",
        "'speaker_11': 'So we're recommending you keep basically the rate at where it is today, 1%. From a practical standpoint, the voters would not see any difference. It would be 1%, but it would go for until 2023 at 1%, then drop down 2.75% for a measure rather than go back up to 1% at 2027.'",
        "'speaker_11': 'And I'll show you that graphically in a second. There is some importance as to the staff's recommendation on the timing of the ballot measure and why we're recommending that you put this on the March 2020 ballot rather than November.'",
        "'speaker_11': 'And, you know, the typical state law shows that you should be asked that you put these in front of voters when you have your your general election, which for us would be November 2020. But there's a provision for doing that earlier.'",
        "'speaker_11': 'And so one is we are hearing that there are some other entities that are interested in taxing and doing sales tax. First and foremost would be assumed. And there's a potential for L.A. County as well. And we're all competing for that same amount.'",
        "'speaker_11': 'So if they get to the ballot first and voters approve that, the tax that the voters would pay would be the same amount but actually wouldn't stay local. It would go to a different entity. So we really think that you should consider putting this on March 2020 and, you know, that amount would still be 10.25%, but it'",
        "'speaker_11': 'would just go to a different entity rather than Long Beach. So this is how it's represented graphically. This is what this staff would recommend is once you get to F 22, that's what Measure eight currently authorized, you can see it's 10.25%.'",
        "'speaker_11': 'We would go down 2.75% and the county would take that extra point 25. Again, from from a consumer perspective, they would continue to pay what they're paying today. 10.25 that that's what they're paying now. And then we would go about four years, five years on the calendar year rather than fiscal year.'",
        "'speaker_11': 'And then it goes back up to 1% in FY 28 and beyond. So in order to put it on the March 2020 ballot, you do have to do what's called a fiscal emergency declaration that's required under the state constitution, Prop 218.'",
        "'speaker_11': 'And so, you know, we would recommend that you do that for the reasons that we mentioned in the report community, hospital infrastructure and public safety. So in summary, we really believe Measure would be a major positive fiscal impact to the city.'",
        "'speaker_11': 'It would be $15 million a year that you'd be able as a council to make some financial decisions with after fy22. Then after that, there would be $45 million a year available in 2027, which we aren't currently programed for and would put us in a much stronger fiscal position.'",
        "'speaker_11': 'And so next steps, if you would like to move forward with this, you would direct the city attorney tonight to prepare an ordinance. There'd be a second chance to consider this. And essentially we would come back to you in July with that ordinance and the resolution declaring an emergency, and then it would really be up to the'",
        "'speaker_11': 'voters. So it's important that, you know, you don't make that decision. Staff don't make that decision. It's really up to the voters whether or not to extend a measure. And so our recommendation is in front of you. And with that, thank you for your time and we are available to answer questions.'",
        "'speaker_0': 'Thank you, Mr. Modica. And we're going to have if anyone's here for public comment, now's the time. Please come forward. And then after that, we will go to I'll make some comments and go to the council. Please come forward.'",
        "'speaker_0': 'I'm going to close the speakers list. So if you're not in line because this will be closed. So I have four speakers and after that the speakers list will be closed.'",
        "'speaker_4': 'Please come forward. All four speakers. Gwen Stefani, Orson Welles second district with regards to measure a as of crime rate is falling citywide it seems that seems to say that fewer armed police officers would be necessary. So an adjustment composed with that would probably would be a good idea.'",
        "'speaker_4': 'However, additional funds for the fire department are necessary as they are the primary response of agency for both the increasing homeless epidemic and general paramedic emergencies. Additionally, locally funded social and health workers would also be a nice addition to all necessary funds.'",
        "'speaker_4': 'Other than that should be going towards a critical reopening of the mental health floor community hospital. The loss of this has been a huge problem for the for the city and with regards to the projects that have originally that have already been funded.'",
        "'speaker_4': 'I think Public Works really deserves a heavy hand from the city. It's been a very, you know, overall easy transition. The disruptions to public service to the public, especially in the second District, have been minimal. The recent contract, you know, some supposed controversy over the road dying and on the Broadway has been overblown.'",
        "'speaker_4': 'As somebody who lives in the second District and is a father of a cyclist who's starting out in the second district, the measure funding has created a protected bike lane, which has frankly slowed down traffic and created a safer neighborhood.'",
        "'speaker_4': 'More additions like this in terms of making a pedestrian and cycling friendly city would be extremely welcome with an additional $50 million. Thank you for your time. Thank you.'",
        "'speaker_0': 'And our next speaker, please.'",
        "'speaker_4': 'Mayor and city council members. My name is Paul Mize. I'm a board member of the Long Beach Firefighters Local 372. Rex Pritchard apologizes for not being here tonight. However, he's out of town with his family. Long Beach firefighters fully supports and asks you to vote yes on this agenda item.'",
        "'speaker_4': 'We need to extend measure to maintain vital public safety services, improve emergency response times, and continue our investments in infrastructure. Extending Measure A will maintain our current tax rate to ensure Long Beach maintains the 150 public safety officers personnel funded by measure pay and including 37 new public safety workers, police officers, firefighters and paramedics hired since measure'",
        "'speaker_4': 'has been approved. Long Beach will be able to make safety repairs required to reopen Long Beach Community Hospital. Community hospital is a vital part of the 911 system. And reopening this hospital will be a tremendous positive impact. And save lives.'",
        "'speaker_4': 'If we don't act now to make Measure eight permanent, we will lose our ability to invest directly in Long Beach. Instead, we will pay the same tax rate we are paying now. However, the money will go to other agencies and not Long Beach.'",
        "'speaker_4': 'Extending measure ensures that we will continue to invest in our community. Missouri has been a huge success and has made improvements in every single council district while I'm standing here supporting me, making Missouri become permanent. As a member of the Local 372 Board of Directors, I'm also standing here as a resident of Long Beach asking you to'",
        "'speaker_4': 'support the agenda items. I lived in Long Beach for 18 years and I've seen on a daily basis, you know, while I'm driving around in my personal car, responding to emergency calls and the fire engine. That measure. Investing in our communities has been very noticeable.'",
        "'speaker_4': 'We need to continue invest in ourselves in years to come. Please vote yes. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_8': 'Hello, counsel. I'm Joel Weinstein. I wish Measure A could do the job, but it inherently cannot. Even management admits that with measures in place now, the city is getting ever further behind on infrastructure. It's no surprise, given a consistent commitment to Oscar Wilde's style of budgeting.'",
        "'speaker_8': 'Give me the luxuries of life. The necessities will take care of themselves. You know. Most of you politicians in your top management unabashedly and relentlessly work to exploit our ignorance and naive trust to get us to pay ever more in extra taxes like Measure A and M for the very same services that elsewhere require no new taxes'",
        "'speaker_8': ', do not have the benefit of oil revenues, title and revenues, enterprise revenues. In each case, the pitch is that the new revenues will be dedicated carefully and exclusively to the services. A true but deceptive claim because revenues from the new tax can be legally dedicated.'",
        "'speaker_8': 'But council can divert and in case after case has diverted to other purposes the funds from the old sources that used to go to the services. Measure H in 2007 was going to give us a better fire. Protection.'",
        "'speaker_8': 'Result, you actually reduced engines and fire stations. Houses have almost burned down because there were not. And they remain. Absent. Engines and stations. And then there's those 200 police officers. Yeah, yeah. 200 less police mean a less safe.'",
        "'speaker_8': 'Long Beach was the. What was the pitch? And apparently that's what you want because you have not budgeted for anything like 200 new and worse to promote these little tax bites, these little more details. City Hall, you and your management have engaged in deceitful and arguably illegal pseudo rationales and campaign practices, including pretending that this building is'",
        "'speaker_8': 'about to fall down from seismic problems. And yet you made here you have put no employees out of here for three years and more. You send out costly and supposedly useful information fliers to some rather than all duly registered voters.'",
        "'speaker_8': 'You omitted from mailers and online information readily provided instructions on how to conveniently access the actual legal text. And you totally misrepresented in promoting Measure B-BBEE. You totally concealed that there would be a repeal of existing term limit provisions in the charter.'",
        "'speaker_8': 'So what? The needed new step is not a new tax, but a new council professionally as a decision analyst and math and stat analyst. My recommendation is, and as a citizen, I demand that all of you resign. We need a new council.'",
        "'speaker_0': 'Thank you very much. And our last speaker, please.'",
        "'speaker_4': 'Good evening, counsel Jim Foster, president of the Long Beach Police Officers Association. Honestly, it would take me the rest of the night to try to explain all of the good things that came out of Measure eight for our city.'",
        "'speaker_4': 'I'll try to limit that just to some of the really specific ones. Clearly, the maintaining and addition of staff as presented by Mr. Modica has been unbelievably helpful for us to be able to accomplish our mission. Some of the very specific things in here in this measure allowed us to get a full time training staff at the'",
        "'speaker_4': 'academy. And when you look at the attrition rate that we have had over the last several years, we're on the verge of, I think somewhere in the area of 15 to 20% of our officers have now been trained by the staff.'",
        "'speaker_4': 'That measure allowed to be there full time. In addition to that, we have a training facility at the academy that is falling apart. It is 20 years we've been in some temporary trailers. And I guess in the terms of life, everything is potentially temporary.'",
        "'speaker_4': 'But these trailers are falling apart. They're getting dangerous. And we've been good partners for many years with the citizens of working with what we had. But we're to a point now where we know we're going to have significant attrition over the next few years.'",
        "'speaker_4': 'We can become a regional training facility, and we have to do this on behalf of the safety of our of our team members that go through there and really for the benefit of the city to allow us to continue to retain and attract new candidates to be in our police department.'",
        "'speaker_4': 'In addition, one of the things that the taxpayers aren't always aware of is even after this measure was initially passed by such a large margin, the state, the federal government come down with new mandates that require the police department to get on board with new events like our radio system is no longer supported.'",
        "'speaker_4': 'We needed new radios. We couldn't function as a police department without them. That came from Measure eight body cameras, which is something that voters want and demand. This is a function that we need to provide. Coming from Missouri, I can go on and on, but I want to add one more part about the importance of community hospital'",
        "'speaker_4': '. That hospital for decades has served not only my family but the residents of this city. It's where we kept our sexual assault response team, where we did some of our higher level things with the community. The most sensitive things were there.'",
        "'speaker_4': 'It's where we treat a lot of our prisoners that are in custody coming from nearly half of the city. And clearly the mental health facility there is of immeasurable help to the public safety mission that not only firehouse, but we have also the taxpayers are getting their money's worth out of measure eight and then some.'",
        "'speaker_4': 'And so I would encourage all of you, as you look at the long laundry list of things that have done, the mission is not yet accomplished. This money is going to good use. And all of us on the police front, we urge your support in this measure.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thanks so much. That concludes public comment. Let me make some I'm going to make some comment and then we'll go to the council for comments as well. So I just want to I just want to just first of all, just take a quick step back and kind of walk through kind of what got us here and then'",
        "'speaker_0': 'make some general comments as well. And I think, staff, you've done a great a great presentation and a a very thorough job. I know that the finance team and a lot of your team was in front of us together.'",
        "'speaker_0': 'And I just want to thank you for for doing that. And so I just a few things have happened. I think there's there's two things that have kind of happened around the same time. The first is one that the council's already been discussing, and that's been the issue around community hospital.'",
        "'speaker_0': 'And I want to just point out that I think the council certainly had asked staff maybe a few months ago to look at solutions and how we would permanently fund community hospital. I know that that began some initial work from at the staff level.'",
        "'speaker_0': 'And part of that is in front of us today. And I think it's important to note that this measure extension is well, that is a piece of it. There's certainly a much broader focus, which is really about infrastructure and public safety.'",
        "'speaker_0': 'And that's kind of what I'm going to focus most of my comments on. But I do want to thank you. I know that when we asked you to bring back some information on community hospital about about a long term source, this was obviously a response to that.'",
        "'speaker_0': 'And the other probably more a larger piece of this has been, I think, what most of us have been reading sometimes on the front page of the Press Telegram and in other publications about other agencies, HMD being the largest of which have been discussing bringing forward an additional measure in front of voters, which would keep our tax'",
        "'speaker_0': 'rate the same, but certainly divert resources that are currently going in a major way into other agencies, which would be a loss for our community. I think that's for many folks. The bigger issue for for me, it's it's it's simple.'",
        "'speaker_0': 'And I think I strongly believe that we should extend measure aid to maintain our vital public safety services, our emergency response times, and to continue investments in infrastructure. I want to start by saying that we have through the current through the current measure that was voted on, we have maintained about 150 public safety personnel.'",
        "'speaker_0': 'That is actually pretty significant. This has been through our everything from restoring a paramedic units, as you heard, to our our engine bill. Onshore to the police work that's happening across the city as well. But the larger investment and the one that I think people have felt most immediately has been around infrastructure, the fact that we have'",
        "'speaker_0': 'already spent and fix $88 million worth of infrastructure is enormous. And we are this really is an era that we will look back on and be able to remember as a time when we really fixed our city when it came to infrastructure that is significant and it's something that I'm really proud of.'",
        "'speaker_0': 'I want to thank our public works team who have really had to re, you know, re-energize and rethink of the way they approach streets because there is now so much more work for them to do and be on our streets.'",
        "'speaker_0': 'It's been programed within our parks. When you look at our park playgrounds, when you look at it, fixing up many of our restrooms or our roofs or our libraries, there have been significant investment. And so we have made these investments to our parks, athletic fields, playgrounds, and they have really been really great to see.'",
        "'speaker_0': 'And I want to thank the voters and community for supporting that. I also want to just just make a note when when we went out in 2016, we were talking about a $2.3 billion backlog of infrastructure. And that was, of course, an estimate.'",
        "'speaker_0': 'And the fact that we have brought that and continue to move that number down with the investment, I think is significant. And we should really this new this new extension could allow us not just to put together a five year plan, which we currently have in front of us, but a plan that could really last ten, 20'",
        "'speaker_0': ', 30 years and it could really rebuild our community. Let me I will also note that the part that staff mentioned, which I think is really critical, is this idea of what other taxing agencies are doing. When Long Beach first chose to vote to move its tax structure to 10.25.'",
        "'speaker_0': 'We were actually an early adopter. There were a few cities that had done that. Now there are many cities that have done that. And today I can tell you that we will not be the only city doing this in 2020.'",
        "'speaker_0': 'In fact, there are cities up and down the state of California that for the very reason that I that we're discussing tonight are actually choosing to go up to fill their cap because they are aware that the economy, the county of Los Angeles and others, and then they I think they do great work.'",
        "'speaker_0': 'But everyone is looking at doing additional measures in the November ballot, and particularly a vacuum in pretty public about theirs. And so now the Long Beach voters will not be paying any more tax if measure is extended. But if these other measures pass, they will still be paying the same tax, but the money will be going to'",
        "'speaker_0': 'other agencies versus fixing our streets and roads and supporting our paramedic units and public safety. And so I think those are some critical questions. I think it's it's obviously important to note that over 60%, about 60% of the voters approved measure the first time that that was a huge, resounding show of support.'",
        "'speaker_0': 'I think I am proud that this council has done a fantastic job of ensuring that what we told the voters the money would be spent on is where the money was spent. And to me, making a promise about where those dollars would be spent and then fulfilling those is really important.'",
        "'speaker_0': 'And it's about that is it to me about also about public trust. The money has been spent on fire, police service and infrastructure. And that's where we where we put it. What we're asking, I think staff recommendation is also to include the community hospital piece, which is something I strongly support as part of what we're doing moving'",
        "'speaker_0': 'forward. And so I know I've said already I fully support this and I want to thank our Art, the city team for their work on being able to to get these projects done. And so with that, let me turn this over to the council and begin with Councilmember Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I think that was articulated very well. I want to thank staff for these 31 pages of this staff report. I love the way that it was organized in the fact that we looked at our history, we looked at the landscape around us, and we really drilled down on this this methodology of the'",
        "'speaker_2': 'tax. I think that makes sense. You know, Mr. Mayor mentioned the rate in which measure was adopted the first time at 60%. But I think I want to just lift up the opinion survey. I'm grateful that was published, showing that even after positive and negative arguments, the support for this extension was over 70% of of the sample'",
        "'speaker_2': 'of voters in the survey survey. And I think that was that's a very compelling point. So thank you for including that in this presentation. Broadly looking back on Measure eight the first time around, you know, the reality is our infrastructure was in a very different place in Long Beach.'",
        "'speaker_2': 'And I and I remember, you know, making the case for the Highland Park Community Center. You know, I personally took a number of council members there so they can see that the issue is not it's not fake. It's real.'",
        "'speaker_2': 'You know, the roof was collapsed and I grabbed, you know, Harry Salts gave her from the Gazette and brought him there and grabbed a piece of the wall and showed it how that how it crumbled in our hands.'",
        "'speaker_2': 'And and that's been the reality for many of our facilities. And the truth is, it's been an unfair it's been really unfair to have to make choices between rusted playgrounds and roofs that are collapsing. And that's been the reality for a long time.'",
        "'speaker_2': 'And since we've adopted Measure A, I think that that proposition has changed for for our citizens. They can finally, finally see a community center, which was a project that was simply too big because of our revenue constraints, to see that it's under construction and see that this community center will open this year really is a testament to'",
        "'speaker_2': 'the faith of the voters placed in Measure A the first time. So I'm a big fan there. I think secondly. You know, it's been it was seven years that we went without rescue 12. It was seven years. And those and what that meant for us in North Long Beach was that we dealt with 3 minutes, slower response'",
        "'speaker_2': 'time than everywhere else in the city because of that paramedic rescue. And it wasn't every six months or year we were back at council, you know, pleading to the public in Cleveland, the council that this was a real situation here.'",
        "'speaker_2': 'And we learned firsthand that as it relates to first responders and public safety, it's really a sum of all of its parts. And so the addition of of engine eight and the restoration of Rescue 12 brought our response times down by three entire minutes in North Long Beach.'",
        "'speaker_2': 'And that is the same concern I have about about community hospital. If we don't come together and make, you know, and band together and make sure that we keep our safety net in place is going to impact all of us across the whole city.'",
        "'speaker_2': 'So I strongly support taking this action, if not simply to make sure that we maintain the the commitment we've made to our public about public safety and our emergency response. I want to lift up page 27 where it talks about and I know this has been underscored, but, you know, this is this has come to me I'",
        "'speaker_2': 'know some of the press has been has it had an opportunity to really kind of flesh out this case? But I think this is a really smart case that I want to lift up once again. I think the fact that the city is looking to do this in March and to March of 2020 and and fully optimize'",
        "'speaker_2': 'that cap means again that whether we do this or not, the effective tax rate and please confirm this for me once again. Mr. MODICA The effective tax rate to citizens won't still, you know, won't drop below below 10.25% if these other measures go go through.'",
        "'speaker_2': 'So they're still going to pay the same tax rate. Is that right, Mr. Modica?'",
        "'speaker_11': 'So if under our proposal, if we basically extended everyone, it would continue at 10.25%. We wouldn't receive the full 1%. County would get point to 5%. We would get 2.75%. If that. Or is there a different question?'",
        "'speaker_4': 'Yeah, in.'",
        "'speaker_2': 'Answer. If we didn't move forward in the assumed measure and these others move forward, there is a reality that the 10.25 effective tax rate would still remain for our taxpayers, but we wouldn't capture that additional money.'",
        "'speaker_11': 'I see. So let's let's say the council does not put this in front of voters, then there would be about 0.75% still available and that would be available for AQ, M, D or county or somebody else to pay.'",
        "'speaker_11': 'Then you would have voters paying the 10.5% and that would not go to Long Beach. You'd go to a different agency.'",
        "'speaker_2': 'And for that reason, I think it's also smart to say we should give the voters an opportunity to vote and say, Do I want that effective additional point, 75% of my taxes to go to a different agency? Or do we want to keep it local where we know our city council members and we know our mayor and'",
        "'speaker_2': 'we know you know, we know we use our parks and our streets and we know what streets need to be fixed. And I think that is a vote that needs to go in front of the residents. So that said, thank you.'",
        "'speaker_2': 'Thank you for putting together such a well thought out presentation. And and this earns my support tonight.'",
        "'speaker_0': 'Thank you, Councilmember Vice Mayor Andrews.'",
        "'speaker_10': 'Yes, thank you, Mayor. I also think that you really articulated exactly what we should be doing, and I support this extension on average for March 2020. You know, Measure eight has provided the city the ability to do a lot of good things in Long Beach, everything from roads, sidewalks and more public safety to repair our library and'",
        "'speaker_10': 'playgrounds. In my district, it has funded improve libraries, new playgrounds, MLK, Veteran's Park, as well as new improvements at Market MacArthur Park. And I don't know how many miles of street is paved in my district, but it seems like every week a new street repaired or repaved.'",
        "'speaker_10': 'We need to continue our efforts on public safety, continue to repair road sidewalks and alleys, and for the reopening of the hospital. I believe that we've given the choice to our residents. They will support our efforts to make Long Beach a much safer place for us to live.'",
        "'speaker_10': 'And thank you very much, Mayor.'",
        "'speaker_0': 'Thank you, Vice Mayor. Councilwoman Price.'",
        "'speaker_6': 'Thank you, Mr. Mayor, and thank you to staff far too, Mr. Modica, for the presentation. I agree that we have had a lot of really great restorations as a result of measure moneys and for me the most important thing is going to be to make sure that we continue to maintain the resources that we have.'",
        "'speaker_6': 'Of course, it would be great to add to them as well. I think we absolutely need more police officers, more fire resources, as one of the speakers mentioned, more technology to ensure that we are operating both our police and fire department with the most up to date and comprehensive community policing, community firefighting, all the different technologies and'",
        "'speaker_6': 'practices that have been developed to build transparency, bring about efficiency, and result in a more streamlined public safety team for the city. So I absolutely think we need more. I will tell you, in my district, as hesitant as folks are to celebrate new taxes, one thing that I think every resident in my district would agree on is'",
        "'speaker_6': 'that we need more public safety resources. That is a huge, huge priority in my district, has continued to be the number one priority for our district. And with the increase of homeless populations, our police and fire department are being tasked to handle issues that frankly are not their issues to handle, but they are viewed as the source'",
        "'speaker_6': 'and the solution for a lot of the problems that residents are seeing. And so they are being asked to do more with very limited resources. So I do think that that maintaining those resources at a minimum is what our goal needs to be.'",
        "'speaker_6': 'And we've done very, very steady and consistent restorations in the time that I have been on council, and I want to ensure that that work is not reversed and undone and that we continue to maintain those assets for the city at the current levels, if not add to them.'",
        "'speaker_6': 'I will say one argument that I think speaks to me and it didn't I didn't really appreciate it or understand it as much as I do now after watching the presentation, because I think it really hit home for me is the fact that there is a statewide sales tax cap.'",
        "'speaker_6': 'And that and I said this the last time we were having the discussions about measure to begin with, a lot of people said we're going to be the highest tax city in the area. And I said to people, you're talking about a point in time, which is now if you look at 3 to 5 years down the'",
        "'speaker_6': 'road, you will find that many cities are going to be struggling with how to deal with some of the challenges that we're all facing, whether as a result of pension costs or whether as a result of dealing with homelessness.'",
        "'speaker_6': 'And my predictions were absolutely true. Day after day, we read articles about cities grappling with how they're going to pay for some of these challenges that they're facing. And tax increases, sales tax increases are have been proposed and will continue to be proposed over the next 3 to 5 years.'",
        "'speaker_6': 'So I don't think having a conversation about what's going to happen, you know, where we're going to be in ten years and speculating that we're going to be as high as well. Actually, we're very much in line with a lot of cities around us.'",
        "'speaker_6': 'But but assuming that we're going to be higher than the cities around us in the length of time that we're looking at for this sales tax increase, is is really an irresponsible speculation to make, because it is not the trend that we are seeing in nearby cities as as many cities and counties are grappling with how to'",
        "'speaker_6': 'deal with this issue. I've been very, very concerned and very proud of this board. And, of course, our advisory committee. Bless you. That views the expenditures for Measure A to ensure that the commitment that we made to the residents on what we would spend Measure A for is limited to those areas.'",
        "'speaker_6': 'I've been very concerned about that. And I, I will you know, I'll be I'll be the first to say it. I was not completely confident that there wouldn't be an attempt to spend money beyond those areas that we had committed to as a council.'",
        "'speaker_6': 'But thus far, we've been very measured and very much in line with the intent of this body when that tax measure was passed, I hope that that will continue. And when we're talking about community health, there is nothing more pressing in terms of.'",
        "'speaker_6': 'Community health, at least to the east side of Long Beach right now than the reopening of community hospital. So that is a major priority for for me and I know many of my colleagues in ensuring that we have the funding in place to make sure that the community hospital opening is facilitated with the city's assistance is very'",
        "'speaker_6': 'important to me and some of my colleagues. So bless you. Bless you. So I look forward to continuing to have these discussions. Obviously, the details of the action that we take, how we word the resolution and what the legislative intent of this body is when we move forward with the next steps of this process will be very'",
        "'speaker_6': 'critical to me in terms of how I vote. But for now, spending money on our police, our fire, our infrastructure and community hospital are all priorities that I believe are. Definitely priorities that are citywide, priorities that we need to make sure that we fund not just today but for many, many years, decades to come.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_8': 'Thank you, Mr. Mayor. So I'll just try to be brief and say that I think this is. I think Steph's presentation was excellent. I think it's certainly worth moving forward with and exploring, extending, I believe Measure A puts our city in a position to control our destiny infrastructure, public safety, public health, our priorities of this city.'",
        "'speaker_8': 'Because the residents have communicated to us as a body city council year after year. I've been on the council for seven years. Those have been priority issues and I think Measure A addresses all of them. Homelessness, as we know, is an ongoing challenge for us.'",
        "'speaker_8': 'So we'll need to continue to plan for on how to address that issue with resources and from a public safety standpoint. Today, we have funded a hard team with fire fighters who are full time engaging homeless. Citizens, also quality of life officers.'",
        "'speaker_8': 'So I think but externally measure a man hands our ability to engage this very serious issue of facing us all. From a. Resident standpoint, I've seen so much improvement in my community as a result of measuring the parks works, but the infrastructure, the street repairs.'",
        "'speaker_8': 'But I know that the need is still, still pretty vast throughout our city. I get communicated with regularly from residents who are asking for their streets to be fixed, and I know that that's a priority. It's one of my priorities.'",
        "'speaker_8': 'And so I want to make sure that we have the resources to continue to be able to do that and to deliver, not just today, but also in the years to come. Speaking to one of the residents who came before us.'",
        "'speaker_8': 'I think the way Missouri was also laid out there was and has been some public confidence because people have seen the results of Missouri. But also, there has been civilian oversight over the process in terms of how the expenditures and who's in are being spent.'",
        "'speaker_8': 'So it's not just the city council. Obviously, we're watching it. Our Budget Oversight Committee is on on it. But we have a civilian oversight commission that that is very engaged in in the day to day details of how Missouri is being expanded.'",
        "'speaker_8': 'And so I think that that I know that will be in place moving forward, I'm certain. And then I think this afternoon I wouldn't. I think infrastructure is important, but new infrastructure is also important. And the values of the city is also can be can be moved through this this extension.'",
        "'speaker_8': 'And I would just say we can can also improve our economic development. It all works together. We have improved economic development through the use of infrastructure funds. And so I'm interested in seeing how we can do that to improve the vitality and continue the renaissance, particularly in the north part of our city, but citywide as well.'",
        "'speaker_8': 'So I'll be voting in support of this moving forward. I'm looking forward to having some engaging conversations with our residents over the course of the next few weeks and months ahead.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_0': 'I think it comes from Boston Councilman Pierce.'",
        "'speaker_7': 'Yes. Thank you. Thank you. Tom Modica and the team for the great presentation. I think it's really helpful to have a full picture of how our constituents are feeling and not maybe just listening to The View. And so you really answered a lot of questions that I had.'",
        "'speaker_7': 'I, I was not here when Measure was passed the first time, but it was has been great to serve. While we have measuring not only Broadway or alleyways or street repairs as we bring forward I know Public Works is getting ready to bring forward our Vision Zero plan, which is really committed to by 2026 having zero traffic'",
        "'speaker_7': 'fatalities in the city of Long Beach. And we can't do that if we don't have infrastructure repairs on our main streets, whether it's Seventh Street, whether it's Broadway. And so I'm thinking of Measure eight, not only as an infrastructure plan, not only as a public safety with adding police officers and fire, but really as a life saving'",
        "'speaker_7': 'measure that we really need to have for our city to make sure that we're thriving. So I'm not going to take up a lot of time, but I think for me in the second district, what's important is we have conversations around adding police officers on bikes.'",
        "'speaker_7': 'To me, that means not just giving bikes to police officers that we already have, but making sure that we're increasing our officers so that we can have those bikes in those key areas where cars can't get to making sure that we're thinking about fire in our downtown.'",
        "'speaker_7': 'We've increased density as a result of the downtown plan, and we do not yet have a plan to increase our fire safety in our downtown and then considering our Vision zero and how we are making sure that our streets are safe.'",
        "'speaker_7': 'So I wholeheartedly support this. I will look forward to supporting this and having a thoughtful conversations with our constituents as we move forward. So thank you for bringing it forward.'",
        "'speaker_0': 'Thank you. Councilmember Ringa.'",
        "'speaker_9': 'Thank you. I agree with all the comments that have come forward from my council colleagues. I remember back in the fall, ten, 15 years ago when the city was in a in a tremendously difficult situation. We were trying to make our budget balanced.'",
        "'speaker_9': 'We're trying to maintain services. And we had a difficult time about it when major aid was proposed and passed by the citizens in the electorate. It was a game changer for the city of Long Beach. Now we were able to replenish our public safety personnel to return some services that we had lost or that over the course'",
        "'speaker_9': 'of the budget cuts over the years. And to go back into that era where we were having to struggle to balance our budget is unacceptable. And I think that it would be a tragedy for us not to continue to to have imagery as part of our built in infrastructure.'",
        "'speaker_9': 'We've I constantly get bombarded in my office with requests for trimming trees, which fixes sidewalks for restoring services. And I could say that thanks to Marjorie, we have been able to do that and will continue to do that into the future.'",
        "'speaker_9': 'So I'm fully supportive of this item here and I would be voting for it.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Supernanny.'",
        "'speaker_4': 'Thank you. I'm in full support here. I don't want to be repetitive. All the. Critical points have been made. I've been a long time supporter of community hospital, but I think both the Police Officers Association and the Firefighters Association articulated just what this hospital means to the public safety network.'",
        "'speaker_4': 'And that's really what this measure supports, in my view, is that as a system of public safety, that the hospital is just a critical component, too. So thank you. And I stand in support.'",
        "'speaker_0': 'Thank you, Councilmember. Councilwoman Mongo.'",
        "'speaker_5': 'Yes. I want to echo the comments of many of my colleagues related to that of public safety and community hospital. They are both critical to the successes that we've been able to see in our city. If you don't feel safe, there's nothing more important.'",
        "'speaker_5': 'And you cannot live and thrive in a community where you don't feel safe. And so those restorations were necessary. And I'm very thankful for the great work that our public safety teams are doing. I think it's also good that we spend a little bit of time on the infrastructure side.'",
        "'speaker_5': 'Over the last three years. District five residents have endured the dust of construction, and they've done that because of Measure A, we've paved and slurry to over a hundred streets and repaired many of our critical facilities, including something I consistently hear from residents to be of the utmost importance.'",
        "'speaker_5': 'Park Bathrooms. This council made the fiscally prudent decision to repair what we could and to fix our street. Yes, many of them need it. I hear colleagues mentioning park bathrooms on both sides. But those streets and those park bathrooms are daily needs of our community.'",
        "'speaker_5': 'You have to drive on those streets to get to and from your home into your workplace. And when you're in the park, you need the facilities to be able to take your kids and or yourself to the restroom.'",
        "'speaker_5': 'Today, District five has more than $31 million of very poor streets, and that's after we've paved in slurry to 100 of those streets. We made some fiscally prudent decisions to not let streets fall into disrepair, but to be able to dig out of $31 million in very poor streets.'",
        "'speaker_5': 'It takes something longer than a five year plan or a ten year plan. We really need to be able to to plan out longer. So we've also done work to dozens of our bathrooms, but the list is ever longer and there are too many bathrooms that are just unacceptable.'",
        "'speaker_5': 'And so I think it's important for residents to have the opportunity to decide if Measure A has demonstrated the return on investment that they had hoped for, and if they trust this council and the Citizen Oversight Committee to maintain a focus on the priorities that they set out.'",
        "'speaker_5': 'I hope that the discussion around what we will spend that money on will remain focused on the much needed repair of our very poor streets and our worst park bathrooms. The city of Long Beach still has over $200 million of streets that are in very poor condition.'",
        "'speaker_5': '200 million. And repair that along with our our worst park bathrooms. I think we need to come up with a plan that every year we pave a certain number of our worst streets and we repair or completely refurbish our worst park bathrooms.'",
        "'speaker_5': 'Residents deserve a plan that says your street will be repaired in and then I should be able to tell them the year that their street is planned for repair. The idea that some day will come is just not enough.'",
        "'speaker_5': 'So as a taxpayer, I want to see my taxes spent in this community. And so for that reason, I'm supporting giving the residents the choice to maintain the tax at this level and keep it local, instead of maintain the tax at this level and see it go off to another agency or for the state.'",
        "'speaker_5': 'So for that, I'm supporting this item tonight.'",
        "'speaker_0': 'Thank you very much, Councilwoman. And let me just also just say the last thing I think. I'm not sure we made clear in the presentation. I want to be clear because it's been asked. This council has approved about 140, $150 million infrastructure plan as part of the measure, a, the Missouri ballot measure that passed in 2016.'",
        "'speaker_0': 'Everything that has been proposed by this council under the first plan is all being funded under the Measure eight plan. So anything beyond that, it's extended, of course, will be new projects and new streets and new investment. So I think want to make that clear as well.'",
        "'speaker_0': 'I think we've been asked that a few times, but I want to thank everyone for their thoughtful comments and and certainly for giving the voters an opportunity to consider extending something that's really transforming our community every single day.'",
        "'speaker_0': 'And so with that, members, please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Vote and Public Hearing on Mosquito and Vector Control Program Benefit Assessment District.": [
        "'speaker_0': 'Great. Thank you very much. We'll be moving on to the rest of the agenda. Next is the consent actually of hearing number one.'",
        "'speaker_3': 'I am.'",
        "'speaker_1': 'Item one is a hearing, a report from Health and Human Services recommendation to authorize city manager to vote in favor of the proposed mosquito and Vector Control Program Benefit Assessment District measure for the parcel owned by the city and submit them to the city clerk and receive in supporting documentation into the record.'",
        "'speaker_1': 'Conclude the public hearing to consider the establishment of the VCP Benefit Assessment District. Closed the balloting at the conclusions of the public input. Directs the City Clerk to tabulate the ballots and report the result during the July 16 City Council meeting citywide.'",
        "'speaker_1': 'I also wanted to make an announcement that for those that do need a replacement ballot, please see the table out in the lobby and the ballot must be turned in at the end of this hearing. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion and a second, Mr. Modica.'",
        "'speaker_11': 'Thank you, Mr. Mayor. We will have a staff report on this from Kelly Collopy, our director of Health and Human Services. And Nelson Kerr, our manager of Environmental Health.'",
        "'speaker_5': 'Excuse me, Mayor. I believe an oath is required for this item.'",
        "'speaker_1': 'Those wishing to give testimony, please raise your right hand. You in each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_4': 'I do. Okay. Mr. Kerr. Okay. Thank you. Mayor and City Council. I have with me today Mr. John Bliss, who is president of the engineering firm MCI. This is the company we are working with on the vector control benefit assessment item.'",
        "'speaker_4': 'We also have Maria Davi also with Sky here with the City of Clark to assist with any procedures related to the balloting. And she is as stated in the main lobby. So if there's any issues or needing for replacement ballots or corrections or any questions related to the balloting, folks should go upstairs and see Maria Davi and'",
        "'speaker_4': 'our city clerk. Okay. This item is a continuation of the Vector Control Benefit Assessment item originally brought to council in October of 2018 at the most recent council meeting. On May.'",
        "'speaker_8': '7th, the City Council provided approval to.'",
        "'speaker_4': 'Proceed with the mailing of benefit assessment ballots to property owners within the boundaries of the proposed service area. Ballots were mailed on May 17th at the rate of $8.21 per single family equivalent per year. At the May 7th meeting.'",
        "'speaker_4': 'The city council will also.'",
        "'speaker_8': 'Establish today's date for the.'",
        "'speaker_4': 'Public hearing, which concludes the state mandated 45 day balloting period. The proposed mosquito vector and Disease Control Assessment will provide new or enhanced services to control mosquitoes and other vectors in the Vector Control Program Service Area.'",
        "'speaker_8': 'This enhanced level of service.'",
        "'speaker_4': 'Would provide year round control of invasive mosquitoes and other vectors using environmentally sound methods and would monitor vector borne diseases such as West Nile Virus, Zika, typhus and other emerging vector borne diseases that impact public health.'",
        "'speaker_8': 'If approved, the proposed.'",
        "'speaker_4': 'Mosquito Vector and Disease.'",
        "'speaker_8': 'Control Assessment will be included on the September October.'",
        "'speaker_4': '2019 annual.'",
        "'speaker_8': 'Property tax bill for parcel.'",
        "'speaker_4': 'Owners in the proposed service area. A key provision of today's public hearing is to conclude this 45 day balloting period, as required by state.'",
        "'speaker_8': 'Law, and for the city clerk's office to accept.'",
        "'speaker_4': 'Any additional ballots that have not been cast yet. The balloting period officially closes at the conclusion of the public comment portion of this hearing. Following the close of the public hearing, the mayor will direct the city clerk to tabulate the ballots.'",
        "'speaker_4': 'The ballot counting location and hours are currently.'",
        "'speaker_8': 'Posted at City.'",
        "'speaker_4': 'Hall and at the main health department and are also available online at the city clerk's website and the City Health Department Main Page website. On July 16th, 2019, as part of the regular council meeting, the official results of the balloting will be announced.'",
        "'speaker_4': 'This will allow sufficient time for the city clerk to tabulate the ballots received. Also at the July 16th meeting, the city council may consider.'",
        "'speaker_8': 'Provided a majority. Protest does not exist.'",
        "'speaker_4': 'A resolution to levy the assessments for fiscal year 1920. If a if the benefit assessment does not pass, no action will be required. Finally, I wish to thank all the staff at ASI, the city clerk's office, and the Bureau of Environmental Health Staff, for all the work on this project.'",
        "'speaker_4': 'And this concludes my report.'",
        "'speaker_10': 'Finally, is there any public comment on this? Plissken like.'",
        "'speaker_4': 'Larry. Good. I saw this on the agenda earlier when it was published a couple of days ago. And I thought that excellent program. There's nothing I can add to it. I was up in L.A. most of the day until about noontime, came back.'",
        "'speaker_4': 'And in my mailbox, I received something that I think might have a bearing on this. It was from the attorney general of the United States. It was following up on the earlier communications rally relative to the epidemic, the epidemic of corruption.'",
        "'speaker_4': 'That the Ninth Circuit Court has held that has enveloped much of California. As well, particularly in Long Beach. And areas of Sacramento we've already discussed. Two of those are going to be I mean, who's covered for that and who's in queue to go to prison?'",
        "'speaker_4': 'There's no question that's going to happen. It'll be in about two and a half to three years. But then looking at this, it occurred to me. That we can get federal funding. To help launch these Community Day Hospital as well as others to get inside of the minds of the people like the mayor.'",
        "'speaker_4': 'The other Crim Leigh completes the other criminal complicit councilperson that preceded the good Councilwoman Price. As well as other people. You spent a half an hour among all of you discussing in the need for of ensuring we have community hospital.'",
        "'speaker_4': 'This is a classic opportunity in classic case of providing. I mean, we've got the guinea pigs there. Yes. They're going to prison. But I think we can use that. We can get the federal money to get inside of and find out what the mindset is, why people think they can continually conduct themselves in what, again, the U.S.'",
        "'speaker_4': 'Ninth Circuit has found is criminal conduct, no ifs, ands, no buts. I see this measure here. As I said, it wasn't until I had seen that I would receive this, at least this, and put the two of these together.'",
        "'speaker_4': 'So I think it's it's it's a positive thing to do. And I'm going to communicate and gain back up to the U.S. attorney that here's an excellent opportunity that had not occurred before. And I'd like that at least to me and like them to consider it.'",
        "'speaker_4': 'And we'll get some more federal money. Thank you.'",
        "'speaker_10': 'Thank you, Mr. Video. Is that the end of the public speaking? No. No. I know I'm behind you. Are you the last one? Because we'll close it. If anyone else want to speak with you, please. Goodbye in here, because we're closing to now.'",
        "'speaker_10': 'Thank you. Okay, you can go and speak.'",
        "'speaker_4': 'My name's Dave Weisbrot. I'm a resident and I live right at Fourth and Wisconsin. And when I saw the notice of the assessment for the vector control, I said, hallelujah, because we have an issue there and it has to do with infrastructure.'",
        "'speaker_4': 'So I was very interested to hear the earlier conversation about infrastructure. The AIDS mosquito loves stagnant water. All mosquitoes love stagnant water, and there is always stagnant water in the gutter at Fourth and Wisconsin. I know that Eddie's Market Eddie there has complained previously about the fact that there are no storm drains within a quarter mile in'",
        "'speaker_4': 'either direction of fourth and Wisconsin. Fourth and Wisconsin gets flooded when there's even a moderately large rain to the point where he has to put up sandbags around his front door, because when the cars go through the intersection, the water washes up.'",
        "'speaker_4': 'But even today, an 80 degree day when I was coming here, there was stagnant water sitting in that good. And the eighties mosquito can lay its eggs on the border of a water body. And even if that water body dries up, those eggs are viable for months.'",
        "'speaker_4': 'And as soon as the water comes back, they can hatch. Last year I had over 40 bites of AIDS mosquitoes, and I will spare you the details, but my lower legs are just now healing. The scars are just now healing from all that I went through with those people using DEET, using other horrible insect repellents.'",
        "'speaker_4': 'I think the city needs to do a survey of intersections in particular where stagnant water is a problem and install storm drains. I took a little survey when I was coming here. I'm I was on my motorcycle. I went down to Ralph's and I came back.'",
        "'speaker_4': 'Ralph's at or Isabella or Isabella. Gladys Temple. Molino, Wisconsin. Carroll Park. East. No storm drains. There's a storm drain down at Luna Peril. That's it. So we really do need to look at the storm drainage. And I noticed that Mr. Modica presentation talked about stormwater management, and I think that needs to be a part of it.'",
        "'speaker_4': 'That's my comment. Thank you.'",
        "'speaker_10': 'Thank you. Next week.'",
        "'speaker_7': 'Good evening, Vice Mayor and City Council. My name is Teresa marino. I live in the second district. I'm a retiree from the city of Long Beach Department of Health. And this is a Department of Health major issue. I have been a resident of Long Beach over 40 years and I have been a property owner for more than'",
        "'speaker_7': '20 years. I'm in support of this. In fact, I wish I had one of those. I voted because I voted on June 5th for this. The effects of West Nile virus are very, very known to me. I have two friends who died of West Nile virus.'",
        "'speaker_7': 'Vector control is very important. The county does it in other areas, but we have our own public health jurisdiction and we need to have our own public health vector control assessment group. Many people are going to complain, Well, I'm a property owner and that's going to raise my tax my my property taxes in zone A, where I'",
        "'speaker_7': 'live, I am going to be paying $8.21. I also have rental income, so I will be paying an additional $8.21. But when you think about that, I spent more on that fighting those eight eighties mosquitoes last year just on cortisone alone.'",
        "'speaker_7': 'Or you remind people, my God, if you go out and buy yourself a double macchiato espresso with caramel and and whipped cream on it, you're going to find that you've spent your. 871 Well, more than that. So I don't think that people should use that as an excuse.'",
        "'speaker_7': 'Climate. Climate change is causing us to have these horrible AIDS, mosquitoes and other vectors that are coming in as a result of climate change. We need to control these. They will. Right now, the eighties mosquito is not carrying West Nile or Zika or dengue fever or other, but it's only a matter of time.'",
        "'speaker_7': 'So I urge folks who haven't voted if they can grab that and vote and support us, we need to do that. Climate change is here and those mosquitoes are going to stay. I have on my street on the on third near between Redondo and in Coronado.'",
        "'speaker_7': 'I get out and I sweep my street every day. I can do that as a retiree, but it more than that, it's important to keep the mosquito and the rodent population down. Thank you so.'",
        "'speaker_10': 'Much. Thank you. Thank you. Next speaker.'",
        "'speaker_8': 'This is a another proposal.'",
        "'speaker_4': 'To please.'",
        "'speaker_10': 'State your name.'",
        "'speaker_8': 'I'm Joe Weinstein. Thank you. This is another proposed tax that with regret I had to vote against. I would have liked to have voted for it because I really believe in the importance of effective vector control. But I had to vote against it because.'",
        "'speaker_8': 'Well, here for a couple of reasons. First of all, the proponents responsible for creating this assessment election hid themselves. They never said who they were and what action they took on what date to give us this election. This is suspicious.'",
        "'speaker_8': 'I do not want to have to deal with people who are ashamed or want to disguise their actions. I learned only from the agenda papers for the day that those people were you on May 7th. So the presentation flouted our basic rights to simply transparency, accountability.'",
        "'speaker_8': 'You know, why are we having to do this? An even more important reason. There's no guarantee that a yes vote will result in more funding for vector control than what a no vote. And the reason is, as I outlined in a previous message today, is that there's a history of diverting funds, you know, dedicating new funds to'",
        "'speaker_8': 'a purpose and. Yes, yes, matching that allocation correctly, but thereby using that as a device method, an excuse to divert old funds to other purposes, such as unneeded new city halls, a fancy swimming pool in the middle of what will be tidal waters to cost 40 to 60 or 100 million when Torrance built a swimming pool of'",
        "'speaker_8': 'the same kind for 15 million. Extravagances like that. So we simply can't trust that the money will, in fact result in a net increase for vector control. And finally, you know, a. A tax on just property owners is doubly unfair.'",
        "'speaker_8': 'Now, of course, property owners benefit from the public health benefit because quality of life is improved and anything that improves quality of life and public health in the city is a boost to property values. But unfortunately, the engineering report misrepresented this as a benefit only to property values rather than all residents.'",
        "'speaker_8': 'This is fallacious logic, and in fact, a tax just on property owners is especially illogical and doubly unfair because property owners have special vector control responsibilities beyond those of other residents.'",
        "'speaker_4': 'With or without.'",
        "'speaker_8': 'A public vector control program. As a.'",
        "'speaker_4': 'Property owner, you are morally.'",
        "'speaker_8': 'And legally liable and responsible to prevent occurrence on your property of avoidable nuisances and threats to public health, including stagnant water and mosquito breeding. So imposing. Thank you for your time is just on us. It makes no more sense than putting a special tax for public ambulances just on doctors and nurses.'",
        "'speaker_10': 'Thank you. Thank you very much. Now we'll take behind the guises.'",
        "'speaker_3': 'Spears.'",
        "'speaker_7': 'No comments. No comments. Thank you.'",
        "'speaker_10': 'No good. In closing, I call for.'",
        "'speaker_5': 'Mr. Vice Mayor.'",
        "'speaker_6': 'On this item.'",
        "'speaker_7': 'The item requires two votes.'",
        "'speaker_5': 'The first is on the recommendation to authorize the city manager or designee to vote in favor of the district. And the second item is to receive the supporting documentation into the record, conclude the public hearing and consider the establishment of the district.'",
        "'speaker_5': 'So we'll need to do it in that sequence.'",
        "'speaker_10': 'Fine. Thank you very much. So could you please first vote? Please cast your vote.'",
        "'speaker_1': 'Council member Wananga. Motion carries.'",
        "'speaker_5': 'And at this point, if the city manager has the ballots that they cast, we can provide them to the city clerk.'",
        "'speaker_10': 'Bankrate.com.'",
        "'speaker_5': 'So now we can take our second.'",
        "'speaker_10': 'Please cast your second vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Report on Pilot Program for Non-Retail Cannabis Businesses.": [
        "'speaker_10': 'Great. Thank you, Congressman, but. Okay, fine. I close public speaking. Now we go to item 23. Item 23, would you please read the item?'",
        "'speaker_1': 'Item 23 Communication from Councilmember Richardson, Chair of the Economic Development and Finance Committee.'",
        "'speaker_4': 'Vice Mayor, Council Member Pearce says announcement.'",
        "'speaker_10': 'Yes.'",
        "'speaker_7': 'Yes. My announcement is I have to recuse myself since global investments is a source of income for me and they are an investment company with from the Earth cannabis. Thank you.'",
        "'speaker_10': 'Thank you. Okay. Ready? Could you. Could you please. We got.'",
        "'speaker_1': 'Item 23 is communication from Councilmember Richardson, Chair of the Economic Development and Finance Committee. Recommendation to receive a report on the feasibility of creating a 24 month pilot project to expand the tax base of non-retail cannabis businesses.'",
        "'speaker_10': 'Please, I'm going to turn it over to the staff.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. Council members, we have a presentation by A.J. Curie, who is our cannabis manager. And A.J., take it away.'",
        "'speaker_9': 'AJ, I'm sorry.'",
        "'speaker_12': 'Good evening, Mayor and members of the City Council. My name is A.J. Hillary and I work for the Office of Cannabis Oversight in the city manager's office. I'm here to present the findings of a report requested by the Economic Development and Finance Committee on Non-retail Cannabis Businesses in Long Beach.'",
        "'speaker_3': 'With a clear. Thanks.'",
        "'speaker_12': 'On April nine, 2019, the Economic Development and Finance Committee requested staff to refer to the City Council a report on the feasibility of the creation of a 24 month pilot program to expand the tax base of non-retail cannabis businesses by streamlining processes, adjusting tax rates and providing incentives.'",
        "'speaker_12': 'In response to this request. Staff from the city manager's office met with departments responsible for regulating cannabis activity in Long Beach to solicit ideas for a pilot program. Staff also met with cannabis industry representatives to receive feedback on the current licensing process.'",
        "'speaker_12': 'Before discussing the findings of the report, I'd like to first define a few key terms referenced in the EDI and F committee request. First, what does it mean to expand the tax base? Expanding the base means increasing the amount of economic activity subject to taxation for the cannabis industry.'",
        "'speaker_12': 'This can be accomplished in two ways either increasing the number of licensed cannabis businesses in Long Beach or increasing the amount of taxable sales at existing businesses. Next, what is a non-retail cannabis business? There are four business types that fall into this category.'",
        "'speaker_12': 'Cultivators which grow and harvest cannabis plants indoors only in Long Beach. Manufacturers which extract essential oils from the plant and use that oil to create other types of consumer goods. Distributors which warehouse and transport cannabis products. And finally, testing laboratories which test cannabis goods for mold, pesticides and other contaminants.'",
        "'speaker_12': 'The common denominator for all non-retail business types is that unlike dispensaries, they do not sell cannabis goods directly to consumers. The next few slides are meant to provide an overview of the Long Beach cannabis market. This slide provides a breakdown of all proposed cannabis facilities in Long Beach and where they currently stand in the application process.'",
        "'speaker_12': 'As seen in the table of the 248 proposed cannabis facilities, only 37 have been issued a license to operate. The remaining 211 facilities are at various stages of licensing process, which includes zoning review, application review plan, submittal and construction.'",
        "'speaker_12': 'The vast majority of these pending cannabis facilities are for non-retail business types. Non-retail businesses in particular have moved slowly through the application process, hence the significant discrepancy between the number of pending and licensed facilities in Long Beach. This slide shows general fund cannabis tax revenues collected in FY 18 and estimated in FY 19, broken out by business'",
        "'speaker_12': 'type. As you can see from the table, the city is collecting more in tax revenues from dispensaries than from all other non-retail cannabis business types combined. In FY 18, 51% of all cannabis tax revenues were collected from dispensaries.'",
        "'speaker_12': 'The remaining 49% were collected from non-retail businesses in Fy19. Staff estimates this discrepancy will grow, with 75% of cannabis tax revenues coming from dispensaries, 25% from non-retail businesses. The main reason for the underperformance of the non-retail sector are twofold.'",
        "'speaker_12': 'First, the slow pace of business openings. And second, the fact that those non-retail businesses that have received a license have reported minimal gross receipts to the city thus far. In preparing this report, staff contacted cannabis businesses to better understand why non retail activity has not taken off.'",
        "'speaker_12': 'The most common responses are summarized on this slide. First, almost every non-retail cannabis business expressed concern over the tax rates charged by the city of Long Beach compared to other jurisdictions. Some non-retail businesses indicated they were considering relocating to other cities with lower tax rates.'",
        "'speaker_12': 'Second, some non-retail businesses have struggled to navigate the building plan check process, sometimes requiring multiple corrections and resubmit prior to receiving building permits to start construction. Third, some businesses underestimated the amount of capital necessary to construct a non-retail facility and have been forced to secure additional investments midway through the application process.'",
        "'speaker_12': 'Fourth, some non-retail businesses report weak demand for licensed cannabis products due to the limited number of licensed retailers operating throughout the state. And finally, some businesses have found it difficult to cover the inflated cost of real estate charged by property owners, who often demand a premium from cannabis businesses relative to other business types.'",
        "'speaker_12': 'Staff has prepared a set of options for the City Council to expand the tax base of non-retail cannabis businesses. The options are broken into two categories. The first category includes options that require changes to the Long Beach Municipal Code and therefore must be approved by the City Council.'",
        "'speaker_12': 'The second category includes administrative improvements that can be made by departments. As a result, departments already began implementing these changes upon release of the report. In theory, all of the options identified in the report can be adopted as a 24 month pilot, as required as requested by the EDF committee.'",
        "'speaker_12': 'However, there are some limitations to taking a pilot approach. First, businesses tend to avoid uncertainty when making decisions. The shorter a pilot, the less likely businesses will respond by increasing investment in Long Beach. Second, given the significant, significant amounts of volatility in the cannabis market, it will be difficult for staff to measure the impact of temporary policies'",
        "'speaker_12': ', which is typically the purpose of a pilot program. Having said that, staff can implement any of the policy options identified in the report on a trial basis if requested by the City Council. The first option is for the City Council to direct staff from the Planning Bureau to conduct a study of cannabis building, design and zoning requirements'",
        "'speaker_12': '. Once completed, the study will be submitted to the Planning Commission for review. The Planning Commission may then recommend changes to the Long Beach Municipal Code and refer those changes to the City Council for final approval. Through the proposed process, the Planning Bureau will be able to study and adopt best practices in cannabis facility design.'",
        "'speaker_12': 'Currently, adult use cannabis businesses are required to meet industry specific requirements relating to signage, window installation, exterior lighting, visibility and other important architectural elements. These requirements are meant to discourage the construction of fortress like facilities that detract from the overall esthetics of the surrounding area.'",
        "'speaker_12': 'For businesses, however, facility design requirements create additional costs during construction. Since passage of the Adult Use Ordinance, the Planning Bureau has gained a deeper understanding of the cannabis industry and its specific needs relating to safety, security, lighting, product, visibility and other aspects of cannabis business operations.'",
        "'speaker_12': 'As a result, the Planning Bureau is in a position to conduct a one year review and recommend improvements to the Planning Commission. The second option is to adjust tax rates for manufacturers, testing laboratories and distributors to a level determined by the city council.'",
        "'speaker_12': 'Generally speaking, the lower the tax rate, the more commercial cannabis activity will expand in Long Beach. However, at this time, staff is not able to recommend specific tax rates without further direction from the city council. The reason for this is that the ideal tax rates for each business type will depend on city council preference in the following'",
        "'speaker_12': 'areas. First, whether the City Council wishes to stay competitive with other jurisdictions charging lower non-retail cannabis tax rates. Second City Council's preference for short term versus long term general fund tax revenues. And third, the impact that a change in tax rates may have on other non cannabis businesses through an increase in demand for industrial property.'",
        "'speaker_12': 'I'll discuss some of these issues further in the next few slides. But first, some clarification on City Council authority to adjust cannabis tax rates pursuant to the Long Beach Municipal Code. City Council has the authority to increase or decrease cannabis tax rates by ordinance, subject to the maximum and minimum rates approved by voters for cultivation.'",
        "'speaker_12': 'The city currently charges a tax rate of $12 per square foot of plant canopy. The city council can increase the tax rate up to $15 per square foot or reduce the tax rate to $0 per square foot for all other non-retail business types.'",
        "'speaker_12': 'The city currently charges a tax rate of 6% of gross receipts. The city council can increase the tax rate up to 8% of gross receipts or reduce the tax rate to 0% of gross receipts. In terms of the competitiveness of tax rates, Long Beach continues to compare favorably to many jurisdictions in Southern California.'",
        "'speaker_12': 'However, there is one elephant in the room, and that is the city of Los Angeles. Los Angeles charges significantly lower tax rates than Long Beach for most non-retail business types. Thus far, the Los Angeles market has had a limited impact on business location decisions in Southern California due to a delay in implementation of the Los Angeles application'",
        "'speaker_12': 'process. This delay has prevented most new businesses from being able to apply for a cannabis business license in L.A.. However, that is set to change with the announcement of what they are calling phase three of the Los Angeles licensing program, which will allow for new businesses to apply for a cannabis business license.'",
        "'speaker_12': 'At that point, Long Beach may no longer be able to compete for new non-retail cannabis businesses locally. If competitiveness and the ability to attract new non-retail investment locally is the primary concern, then City Council may consider reducing non-retail cannabis tax rates to a level more in line with the city of Los Angeles.'",
        "'speaker_12': 'The second consideration. Is for a short run versus long run general fund tax revenues in the short run. Staff estimates that a reduction in tax tax rates will lead to a temporary reduction in general fund tax revenues. Specifically, staff estimates that for every 1% reduction in non-retail gross receipts, tax rates, general fund revenues will be reduced by'",
        "'speaker_12': '$31,000 in FY 19 and $120,000 in FY 20. In addition, for every $1 reduction in the cultivation canopy square footage tax. General fund revenues will be reduced by an additional $28,000 in FY 19 and $58,000 in FY 20.'",
        "'speaker_12': 'The projected loss in general fund revenues assumes that in the short run, non-retail businesses will not increase supply in response to lower tax rates, nor will the pace of business openings in fy19 and FY 20 change as a result of lower tax rates.'",
        "'speaker_12': 'In the long run, however, it is far less clear what the impact of a tax rate reduction will be on the general fund. The main reason for this uncertainty is the fact that in the long run, non-retail businesses have much greater flexibility to adjust supply in response to lower tax rates.'",
        "'speaker_12': 'For this reason, staff cannot estimate long run impacts without collecting greater amounts of tax revenue data. In summary, if regional competitiveness is the main concern, City Council may consider reducing non-retail tax rates to a level more comparable to the city of Los Angeles.'",
        "'speaker_12': 'If short term revenue, if short term general fund revenues are the primary concern, then rates may be kept constant. Finally, if long term general fund revenues are the priority, additional data is needed to determine the appropriate rate structure to maximize revenues.'",
        "'speaker_12': 'The third option for the City Council is to direct staff to research the feasibility of allowing for shared use manufacturing in Long Beach. In 2018, the state of California created a new license category called Type S Shared Use Manufacturing.'",
        "'speaker_12': 'The license type allows for multiple manufacturing businesses to operate out of a single premise, with the requirement that only one business utilize the space at a given time. Allowing for shared use. Manufacturing could expand the tax base for non-retail businesses by creating new opportunities for less capitalized businesses to partner together to share in the cost of facility'",
        "'speaker_12': 'design, construction and operation. However, should the City Council decide to pursue this option, staff would first need to complete a study identifying the resources needed to regulate this business type. As part of this study, staff would contact other cities in California that currently license shared use facilities.'",
        "'speaker_12': 'Once finished, staff would refer the study to the City Council for additional input and policy direction. That concludes the set of options requiring city council approval. In addition, staff identified a set of administrative changes to expand the tax base of non-retail business types.'",
        "'speaker_12': 'Departments began implementing these administrative changes following release of the EDF report. This includes adjusting the timing of the initial cultivation business license, tax payment to be due later in the application process, creating application flowcharts and inspection checklists to help applicants better understand and navigate the application process.'",
        "'speaker_12': 'And finally, closer coordination with Southern California Edison, who we met with during preparation of the study and identified some areas where the utility upgrade process could be streamlined. I have included a summary of items discussed in the report on this slide.'",
        "'speaker_12': 'I'm happy to go into more detail on any of the items if needed. That concludes my presentation and I am available for questions.'",
        "'speaker_10': 'Thank you. Thank you very much. First, we go into public comment and then we'll. Come on, guys, would you please line up if you want to speak on this item?'",
        "'speaker_4': 'Larry Goodhew. As I've referenced before, my views of. Cannabis is in the same level as sex trafficking. Period. My views on it, I think I've shared this before or shaped back in the late sixties or early sixties when I would work up in Maine during the summer at a.'",
        "'speaker_4': 'Nice Resort hotel where every year General Paul would rendezvous, who is Ike's chief of staff with his Oasis buddies, and reminisce about those days and so forth. And one of the things this was back at the time that Timothy Leary was advocating LSD, and he pointed out and he to all the people my age and even of'",
        "'speaker_4': 'people older, how dangerous that was. He's pointing out that LSD was so dangerous, even the Nazis. Would not deal with it. So far, so unstable. Is it so unstable? And that's to have shaped my view. And it's absolutely the same view with cannabis.'",
        "'speaker_4': 'It's this city. Certainly should have. I know we've got some dubious leadership. There's no question of that. And, you know, we don't have to do that. But there should be enough solid citizens in this city. Sitting behind this council.'",
        "'speaker_4': 'And those with proper elections will get you get a full council with. Good mental stability to figure out how to meet the financial challenges of this city. Without getting into the drug business, which is essentially what you're doing.'",
        "'speaker_4': 'And don't try. Try. Tried to try to dance around it. It's no ifs or buts. It's a it's a dangerous road you're going to travel down. So I would suggest you do your research and diligence and find out just how dangerous the drugs can be.'",
        "'speaker_4': 'And then figure out a way how to. And I think we will get, as you referenced earlier, we're going to get some federal money, considerable federal money to help the city and dealing also with the crime issues. Thank you.'",
        "'speaker_10': 'Thank you. Next speaker.'",
        "'speaker_4': 'Good evening, stephanie Dawson. So Second District. Thank you again for your attention to this issue. Crafting good public policy takes time and constant bickering, and I'm glad that we can cordially address these specific issues where we can make the system better work for everybody involved in the city.'",
        "'speaker_4': 'When voters approved measures made in this earnings council later passed, I spoke to Municipal Code Section 5.92. It demonstrated the city's collective decision to create a highly regulated local monopoly for commercial cannabis, including these policies, were a strict commitment to preventing underage sales, enacting labor standards and unionization, ensuring purity of products at the local level.'",
        "'speaker_4': 'Given the absence of the FDA in this matter and providing local tax revenue to offset any increased regulatory burden on the city with regards to the taxes, it must be said that this local industry here has been consuming, has consistently more in the city about the highest tax threshold placed be a major may specifically were concerned regarding'",
        "'speaker_4': 'a consumer choice to participate in a local licensed retail market and be preserving a competitive advantage for non-retail businesses in this city. As it stands today, businesses in the city are suffering both points and immediate moderate as modernization is necessary.'",
        "'speaker_4': 'We've seen similar actions in Oakland, Berkeley, West Hollywood and Palm Springs, all of which are either in the process of drastically reducing their tax rate or already have done so in direct response to the falling wholesale price at the commodity level for commercial cannabis.'",
        "'speaker_4': 'With regard to the specific regulatory burden, I think that Mr. Corey's department is deserving of praise as well as the rest of the your bureaucracy, for doing their sincere best to keep these projects chugging along despite constantly changing regulations at the state level.'",
        "'speaker_4': 'However, it is also clear that the fire department specifically is dramatically understaffed for this work, specifically in licensing volatile manufacturing within the city. The opposite seems to be true with regards to enforcement. Despite dozens of officers assigned and funded for the four narcotics abatement, it seems that very few, if any, misdemeanor charges or municipal code violations are'",
        "'speaker_4': 'being filed by the Long Beach Police Department or the city prosecutor. Despite the flurry of unlicensed scab delivery services currently selling untested marijuana to any child capable of operating a smartphone, again, thank you, council members, for your willingness to continue sharpening this policy and seeking out ways to improve it.'",
        "'speaker_4': 'Please modernize the total local local tax system in a manner that increases the competitive edge for licensed businesses. Please allocate additional forces in Long Beach fire departments so we can complete the inspection process for the manufacturing businesses. And please direct the city prosecutor and code enforcement to follow similar campaigns in the City of Los Angeles and the'",
        "'speaker_4': 'city of Anaheim against unlicensed delivery services who are selling untested marijuana to children. And with all due respect, the pilot program is not broad enough in its scope or fast enough to address these systemic issues. We need an expansive and thorough approach, including reforms to the retail rate.'",
        "'speaker_4': 'Thank you and have a nice day.'",
        "'speaker_10': 'Thank you. Thanks, Speaker.'",
        "'speaker_4': 'Dear City Council. My name is Hab Hadad. I am the CEO of Greenpoint Holdings. We are a cannabis manufacture and distributor located in District nine and on the border of District eight. We wanted to take this opportunity to thank you, the City Council, for being proactive in reviewing the burdensome tax code placed on cannabis businesses by local'",
        "'speaker_4': 'and state regulations. We wanted to thank you for broadening the tax base and allowing cannabis businesses and the industry in Long Beach to evolve into the great industry it can be. We want to bring a few points to your attention as you consider this topic.'",
        "'speaker_4': 'Cannabis is taxed at every step in the supply chain. Do not tax the supply chain. Manufacturers, distributors and testing labs should have a lower tax base to keep the entire pricepoint competitive at the retail level. This will curb the underground market.'",
        "'speaker_4': 'We recommend evolving the tax base to be competitive with neighboring cities, let alone the entire state. For example, the city of Oakland has recognized us recently and modernized their tax base to help small businesses compete. Los Angeles does not burden the supply chain with aggressively high tax rates.'",
        "'speaker_4': 'Companies have already started to exit Long Beach as a result of the high distribution tax. GROSS receipts needs to be redefined. The way that Long Beach defines gross receipts is oppressive to businesses. Cannabis businesses need to take the cost of goods deduction in order to stay competitive, let alone survive.'",
        "'speaker_4': 'Oakland voters, for example, approved Measure V, which amends the tax code to allow for cannabis manufacturers and cultivators to deduct the value of raw materials cost of goods sold when calculating their gross receipts. In Long Beach, under the current definition, when a distributor facilitates testing and is reimbursed for those costs, the city would tax them at the'",
        "'speaker_4': 'entire transaction, which would net the distributor losing money. Distribution businesses typically charge 10 to 20% for their services. So for the city of Long Beach charge, 6% on gross revenue realistically means they receive 30 to 60% of earnings before income tax, employee wages or expenses.'",
        "'speaker_4': 'Long Beach is not attractive until we fix the tax rate and cost of goods sold deduction. Thank you for your time and considering an evolving our cannabis business tax rates. Thank you.'",
        "'speaker_10': 'Thank you. Well before the next speaker, is anyone else Spanish speaking? We're close enough to speak English right now. No one else. Okay, fine. This is the last speaker.'",
        "'speaker_7': 'Hello. My name is Stacey Loucks. I want to thank vice mayor in the council for meeting with us tonight. First of all, I'd like to also thank the city for the research that was done to put this report together.'",
        "'speaker_7': 'I get asked quite often why there aren't many more manufacturers open and running. I manufacture license here in Long Beach. I got calls from AJ. I got calls from other people in the city. The research was done. And so I just want to thank you for the for following through with that and saying we would do our'",
        "'speaker_7': 'research and dove into it. So thank you for that and other members of the city to the help that we get on the fourth floor. It's not always crazy there. We did get some support there and seventh floor, too.'",
        "'speaker_7': 'We do get some great support. Like I said, I'm a licensed manufacturer in Long Beach and to my knowledge, there's only a few handful of us that are open and operating. There are other licenses issued, but a lot of them are not open and operating.'",
        "'speaker_7': 'I'm asked often as to why they're not open and operating included by the city. I was asked that the expenses of licensing filled out equipment purchases. Legal and compliance issues are certainly the first hurdle, but not the last.'",
        "'speaker_7': 'The limited number of licensed retail outlets which result in less places to sell our product has obviously changed our model significantly. Price increases due to taxes and other compliance issues have driven people to the black market. And that's not good for any of us.'",
        "'speaker_7': 'Many of us, many people have just simply run out of money and cannot operate with a five figure loss every month. In the supporting documents for this agenda item, there were two estimates for cannabis revenue tax for manufacturers.'",
        "'speaker_7': 'One was 78,000, the other was 17,000. Based on the number of operating manufacturers, I don't know which number is correct. However, based on that the number, I would suggest that is probably closer to the 17. Just to give you some perspective on that number.'",
        "'speaker_7': 'I personally have already paid $10,000 and I saw two more quarterly payments that I have to make this year. I'm currently losing $50,000 a month in my business. I think Long Beach has one of the most well-thought out and fair social equity programs, and I am proud to say that we have completed the orientation and certification for'",
        "'speaker_7': 'this. We would love to be more involved and benefit more individuals, but the reality is we cannot afford to hire them. Instead, I worked 70 hours a week wearing many hats. I would like to point out two potential issues with the agenda item.'",
        "'speaker_7': 'The two year pilot program will cause businesses to think twice before setting up shop in Long Beach. Cannabis businesses need to be able to operate on a five year plus plan. The investment is very significant and the returns are very slow.'",
        "'speaker_7': 'Most will not be profitable for 12 plus months. Second, the recommendation that cultivation be excluded is not in the best interest of the cannabis cannabis industry or expanding the tax base. Cultivation is where everything begins and we need the starting point to have financial stability as well.'",
        "'speaker_7': 'Again, I appreciate all the efforts of the City Council said in city offices for taking the time to dove deeply into this issue. We are facing and addressing these issues tonight in the meeting. Thank you.'",
        "'speaker_0': 'Thank you so much. Thank you. Thank you very much. Let me turn this over now to Councilmember Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And thank you all for for attending. I want to start with just thanking staff, including Deputy City Manager Kevin Jackson and AJ. I don't really know your title, AJ, but you're the czar on these issues.'",
        "'speaker_2': 'So thank you for taking your time and particularly the really good outreach. I know how seriously you've taken this issue and you've learned a lot, and that's clear. And you're very, very open and transparent about the things you've learned since we took this step forward, since adopting this this this ordinance.'",
        "'speaker_2': 'So just in terms of the process here, you know, this you know, this issue has been raised over the last few months. And the idea here is this is a big, big issue. It's not simply something we can place on the agenda and move forward.'",
        "'speaker_2': 'We're going to need a number of levels of review. And the council has talked about doing a lot of work in the appropriate committees. When we talk about taxes and and growing taxes and the bottom line for the city, the appropriate committee, city council committee is the Economic Development and Finance Committee.'",
        "'speaker_2': 'And so we took up this issue. And, you know, and the idea here is we want it to go over a basic overview of the facts. We can't make policy changes at the committee level, but we can begin with a high level overview of the facts.'",
        "'speaker_2': 'So we asked city staff to take a look at the facts and sort of break out this issue into something the city council can deal with. And they have they've come together with some changes that need city council direction in order to take that next level of review and then administrative changes that they can move forward with'",
        "'speaker_2': 'administratively if the case is made. And I think that's what's happened here. So I want to thank staff for seeing the distinction between the things that need further city council review and the things that just simply make sense because they were asked to talk to the industry about making those changes.'",
        "'speaker_2': 'So that was sort of step one, the community committee high level review. And so we've asked for this broad conversation and this study and that moves now to phase two. It's been referred to the city council. And what you get is instead of just a simple agenda item from a council member saying, look at this, now you'",
        "'speaker_4': '. Have a lot of.'",
        "'speaker_2': 'Facts and data and details to begin to look.'",
        "'speaker_4': 'At.'",
        "'speaker_2': 'And the city council can now, you know, the committee has limited power. We can't ask for full review. The city can now say thank you for doing that high level review, go ahead and conduct a further fiscal impact on this or the Planning Commission review on that.'",
        "'speaker_2': 'And so that's where we are today. The idea is that next, after, you know, we get past this next level review, all the things that require city council action will come back and we would adopt changes based on that next level of review.'",
        "'speaker_2': 'So if anyone's confused about it tonight, we're not actually adopting anything tonight. We're taking these questions that are really organized by staff and taking the next step of a deep dove and asking staff to go back and connect that conduct, that next level of review that's been happening tonight.'",
        "'speaker_2': 'So there's been a lot of questions and and I'm thankful to my colleagues for raising some of these questions. And I had a chance to kind of warm up on some of this earlier today. Why retail versus non-retail?'",
        "'speaker_2': 'Why not retail versus retail? Right. Why the non-retail? Why are we tackling non-retail versus retail? And there's a number of reasons why it makes sense to address this in this way and to start this conversation with non-retail number one as a political issue.'",
        "'speaker_2': 'The retail businesses have been a political hot, hot button issue for generations of this council. And it's really comes down to a real need to protect the quality of life or any perceived impacts to the quality of life to residents that are brought into a neighborhood with a dispensary.'",
        "'speaker_2': 'And so sometimes we can't even get to the substance of the conversation because of the impact of a dispensary. What we're going to do, some dispensary, we're taking that and setting that to the side. We're talking about the part of the industry that largely has zero blight impact or neighborhood impact because they're not dealing with customers as'",
        "'speaker_2': 'residents there. These are business to business manufacturing entities and sort of upstream supply chain industries. So let's make that clear. We're not talking about dispensaries tonight. Secondly, it was brought up that we have this you know, it was brought up that we have a robust cannabis equity ordinance.'",
        "'speaker_2': 'Many of the economic opportunities associated with this industry are not with the dispensaries. Much of the economic sort of benefits are with the supply chain and the upstream businesses. These are these are jobs. These are union jobs. These are prevailing wage jobs.'",
        "'speaker_2': 'And this is the segment of the industry that is really stalled. And that's, frankly, the part of the industry I'm most excited about. And when we say stalled, we're talking about 37 out of 211. And we know that in conducting the staff review, staff said it today.'",
        "'speaker_2': 'The number one message coming back from the industry is number one, the check, the challenges with our ordinance as we're learning. And two, the tax rate associated with the non-retail businesses. So number four, why why why focus on non retail?'",
        "'speaker_2': 'Well, one, we've learned a lot in the last year or two. For example, this conversation about type s didn't even exist when we started this conversation. And state law has changed and the industry has learned and our staff has learned.'",
        "'speaker_2': 'And so we know that sometimes these new industries and these big issues need to be tweaked. And so this is why, again, focus on non-retail. And then and then lastly, I'll say, if this were any other industry, I don't know that we would have, you know, a tax structure that touches every single level of the industry.'",
        "'speaker_2': 'If this were if we were manufacturing other things, I don't know. You know, I don't know that it would be treated in such a way. And my I never really expected a huge windfall of taxes. I would love to see that.'",
        "'speaker_2': 'But what I see when a new industry comes in, I want to see that we milk all the economic benefits, including the jobs and most importantly, the jobs and opportunities to sort of invest in that that industry and that.'",
        "'speaker_2': 'And those are the opportunities that really haven't really taken root. And so so to kind of wrap my comments, I want to go through. So my hope today again, is the things that we know need further review and direction from council.'",
        "'speaker_2': 'We can start giving some direction on that next level of review. And I want to start going through that, some of that right now. So let's start with there were broken into sort of the changes that need direction from council, the options and then the administrative changes.'",
        "'speaker_2': 'The administrative change has already been handled. So we're just talk about options one, two and three. So option one really focuses on the facility design and zoning. These are non-economic issues. These are things that we learned through the process.'",
        "'speaker_2': 'Our intention was simply to make sure that things don't look a certain way or don't look like fortress fortresses. And and it's a good thing and we support that. But we've learned that there are some challenges with, you know, installing, you know, $6,000, $10,000 windows simply to just put plywood over it because it's a factory.'",
        "'speaker_2': 'And you wouldn't just put a, you know, window at a certain wall and factory and some of these planning standards could maybe be changed or tweaked. And so option one is requesting us to further send this collection of issues that's been reviewed at, you know, economic development.'",
        "'speaker_2': 'And now here, send it to the Planning Bureau and the Planning Planning Bureau and those folks in the Planning Commission to do what they do, take this feedback and come back to city council with something that's actionable. And so in terms of option one, it's not economic.'",
        "'speaker_2': 'I think that's something we can move forward with tonight. So within the my motion, I'd like to move forward with option one. And then the other thing that really is non-economic is option three. So if we look at option three, which begins on page 16, the shared use manufacturing, this is something that, you know, we have a'",
        "'speaker_2': 'shared economy. This type license didn't exist in the state when we started. That's something that we simply need to evaluate. So option three asks us to ask staff to go ahead and began researching the feasibility of option three.'",
        "'speaker_2': 'So again, it's not economic. If anything, it may be able it may be some opportunities for us to grow business here. And so I want to move forward with option three, which again will return to the full council as staff has the opportunity to evaluate the feasibility.'",
        "'speaker_2': 'So I want to begin with options. I want to also include option two, an option to into the motion. I mean, option three. And so the motion now as we get to option two, this was a high level review, right?'",
        "'speaker_2': 'We had we didn't do a full fiscal analysis on the tax rates yet. What we're able to do is really kind of break out, see what's happening across the region, understand what's happening with phase three, with the city and with phase three in the city of Los Angeles.'",
        "'speaker_2': 'And really take this time to understand fully what the industry is talking about. And so the idea here why it came to our committee is we want to expand the tax base. And so and the premise is the premise here is that if we have a you know, if we have a more competitive rate, we may see'",
        "'speaker_2': 'more than these 20, 30 businesses adopt, you know, roll out. But maybe we see a full, you know, a full adoption and roll out of these businesses, which creates more jobs. And so what they need from council here is further direction on what are some buckets of rates to do a full economic get full fiscal analysis on'",
        "'speaker_2': '. And so I think that we need to take a look at a fiscal analysis of something that's in line with the city of Los Angeles and bring us some options. I think we need to look at 1%, 2%, 3%.'",
        "'speaker_2': 'We need to do a fiscal analysis on all three of those, bring them back to council so we can make some decisions. And that and with that analysis, one thing that is missing that I'd like to see is if what's driving this for me is jobs, I'd like to see a job.'",
        "'speaker_2': 'I'd like to see an expectation of if we're able to ramp this industry up, these types of businesses that have very little impact on our neighborhoods, but high sort of economic impacts and job creation impacts. I'd like to see what the projections of job creation is.'",
        "'speaker_2': 'If we if we are able to get 50% of these permits through or 75% or 100%. So I'd like to see a real projection or forecast of what the job creation numbers are so we know what we're getting in exchange for a tax rate that's that's diminished, that's lower than what we initially set out.'",
        "'speaker_2': 'And so I'm certainly open to hearing more from the city council, but that's the framework of my motion. It's option one, option three, and then come back with fiscal impact on one on 1%, 2%, 3%, with also a jobs impact to the city council.'",
        "'speaker_2': 'So we can have the next level of of the discussion to make a decision. And so that that's my motion. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Vice Mayor Andrews.'",
        "'speaker_10': 'Yes, thank you, Mayor. And I want to thank Congressman Rex for bringing this forward because being chair of that committee. But, you know, a lot of things that I'm seeing and hearing is that these individuals. I put together a business for people that can.'",
        "'speaker_10': 'Getting things done in the city of Long Beach. I don't like to do that. We want to take a look and look at other individuals because most of these individuals who are doing business, they're very intelligent individuals because these are businesspeople.'",
        "'speaker_10': 'And I think we as the city of Long Beach are going to have to really get up off our butts, make sure that these people be able to do what they're planned in doing, what they've waited for many, many years and gotten this start started.'",
        "'speaker_10': 'So by getting this thing started, we're going to have to be very considerate and understand that the tax that we're putting on these individuals are making it almost impossible for them individually to do what they're supposed to do.'",
        "'speaker_10': 'And that's. Now. I'm not the guru on this. I'm just telling you what I feel and see. You know, the council is an industry which potentially could bring in huge new revenue to this city, but only if the cannabis industry can locate their businesses here.'",
        "'speaker_10': 'You know, as we find out, the industry has many different components manufacturing, testing, distribution, as well as retail sectors. Each of these sectors have their own special needs and require to open up and get established. Our audience, unfortunately, really doesn't seem to fit.'",
        "'speaker_10': 'Non-retail business. Further, our planning and zoning code should be looked at and ensure and not turn business away unnecessarily. We need a city manager review that we are doing as a city to recommend as a way in which we can ensure and capture the revenues and the opportunities for the jobs our citizens need.'",
        "'speaker_10': 'So this key, bring it in, look at it. I mean, how long have you guys been at this? I know you know what you're doing. Everyone knows that. The longer we wait, the more the underground will take. So I just want to let you guys know.'",
        "'speaker_10': 'Thank you for being here tonight.'",
        "'speaker_0': 'BECK. Thank you, vice mayor. Next up is council woman Mungo.'",
        "'speaker_5': 'First, I want to thank the czars of marijuana. They've been available to our calls at any time. I know that working hand in hand with the dispensary and facilities in my district, I've had a lot of calls, not only to them, but but an extensive amount of calls also to Lynda Tatum and our development services.'",
        "'speaker_5': 'And for that reason, I have personally seen requirements that just don't make sense related to you need to put a window here. There's three fronts to this building. You need a a sheer wall and there's a window. So how is that going to happen?'",
        "'speaker_5': 'And then you talk to the contractor onsite and they're like, that's an extra $30,000. And then the neighbor who lives next door is like you told me, they weren't going to have a window and now they are going to have a window.'",
        "'speaker_5': 'What the heck? And so I'm super supportive of option one. The requirements are too cumbersome and often confusing, and I know the fourth floor is very supportive as you go from desk to desk, but it really needs to be more of a one stop shop to each of those desks speaking the same language and coordinating, because sometimes'",
        "'speaker_5': 'you don't know the impact of the move that you're making until you get to the next desk. And that's another $30,000 and that's just not acceptable. Option two I'm supportive of a fiscal impact study. I think that when we look at page, um.'",
        "'speaker_5': 'Whatever it was. Here it is, page 14. If we talk about $178,000 of revenue per percent, a 1% reduction in the rate of 170,000, a 2% reduction would be 300 and 400,000 and so on and so forth. I think that it's important to think about over time what have we invested that money in and where do we'",
        "'speaker_5': 'see the long term implications? So currently we've invested about $1,000,000 into a heart team. Heart team that I think has been impactful for all of us, a quality of life team, a clean team, and a health outreach team.'",
        "'speaker_5': 'All homeless related services, which was the intent of the bill. I think that that also helps the community. I think that it's also important to discuss if the tax rate went down, would that even impact the number of people interested in coming to Long Beach?'",
        "'speaker_5': 'Because from what I'm hearing today, there are more interest than there are facilities. So there are a certain number of vacant facilities in the city, and many of them will not take a marijuana use. Others of them are through a bank that won't allow a marijuana use at the facility because they hold the title.'",
        "'speaker_5': 'We've had a couple of discussions about those. I'm interested in what the others are. And so in the fiscal impact, I know that our vacancy rate is super low. And so I'd be interested in knowing we want to expand the tax base rate.'",
        "'speaker_5': 'So instead of having ten people burden 100% of it, we'd rather have 20 people and 50% rate lower the base by 50%, but have the double the number of businesses. I don't even know if that's possible. So I think that it would be great if our marijuana czars could work with the.'",
        "'speaker_5': 'Either those in the industry, the brokers on the industrial commercial side and or EDI and F are economic government department to to better understand where we could help and support. Are the buildings not facing the right direction are they?'",
        "'speaker_5': 'What is the missing step of why there's still a vacant building in the city? And then I would ask, what would the other use be if it was not marijuana? And I think that people aren't always aware of what high paying jobs are in the industry.'",
        "'speaker_5': 'And so when you talk about it, if you have like an Amazon factory or a marijuana dispensary, how many jobs are at each of them? Because I don't see a lot of robots doing work in cultivators in cultivation facilities versus I see that more in the automation that we're moving through in the manufacturing side.'",
        "'speaker_5': 'But. It's a good question to ask because I don't know how many people work in a cultivation site. I just don't know. I have two in my district, but I've not seen a lot of people at those facilities going in and out of them.'",
        "'speaker_5': 'I don't know how many jobs they are. I don't know what upgrade they are, and I don't know if there are more jobs or less jobs at, say, a plumbing warehouse that has 70 plumbers that work out of it and help the community or a cultivation facility.'",
        "'speaker_5': 'And do cultivators make more than plumbers? I just don't know the data, and I'd be interested in that. I also think people forget that in the marijuana industry there's a created career path. Often when we have a dispensary opening in my neighborhood and one of the discussions was, Wow, it starts at a pretty reasonable price.'",
        "'speaker_5': 'And I get a 50 cent raise every six months or a year until I reach X percentage. And wow, I didn't know that I had a pension involved in these other things that people are looking for in jobs.'",
        "'speaker_5': 'And so I think that that needs to be included in the study. So even if there is a slight variance between one use and another, what's the total impact to the economy based on jobs and those facilities? And then.'",
        "'speaker_5': 'What would the other use of that facility be and is it even taxable? A lot of our first tier manufacturing is wholesale. Some of that is taxable. Some of it is not taxable. Some of it is service goods.'",
        "'speaker_5': 'When you have a drain cleaned, you don't get a tax on that. But if you purchase a product like a drain that actually is installed, then you actually have a tax base. And so I just think it needs to be a robust look.'",
        "'speaker_5': 'And does the tax rate decrease or increase really make that big of a difference in the total? I think that at least when I ran a business, one of my biggest challenges was cash flow because of the upfront investment.'",
        "'speaker_5': 'And so I didn't hear the maker of the motion make any direction related to the administrative changes at the end. We don't have to we're just going to move forward with that because I think the timing of the payments, how often you have to pay, all of those things are also a really big impact to a business'",
        "'speaker_5': 'owner who at the end of each month literally needs to sign checks for people to get their paycheck. And that's important. And so I'm very supportive of these administrative changes and better coordination with Southern California Edison. That has been a barrier on multiple properties in my district, not just marijuana related.'",
        "'speaker_5': 'And so I hope that those will be lessened. And then option three, while I don't really understand it, it sounds like a good idea, but I think I need to meet more with staff. I go the council members comments to date, but I'd like to better understand the specifics because I just it's a lot of nomenclature and'",
        "'speaker_5': 'terminology that I'm not familiar with, but it seems like something that would would be a good direction to go in.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_8': 'Thank you very much. First, I'd like to just appreciate the E.D. and that committee for bringing this issue to the council for discussion and consideration. I've had several conversations with some of our advocates in the community and in researching this issue for quite some time.'",
        "'speaker_8': 'Watching trends throughout the state with state legislation just came back from Oregon. Some interesting things are happening up there. And I love the issues that come before us that challenge us to think about today, but also the future.'",
        "'speaker_8': 'The cannabis industry is now legal in California. The voters in Long Beach have spoken loud and clear, as well as in the state and as local policymakers. I think we should be striving to make policy that is flexible and we're bending with the curves, particularly with this new industry, that that is changing still by the day.'",
        "'speaker_8': 'I'd like to make. And I think this proposal before us and what Councilmember Richardson's motion does is give us the opportunity to make some adjustments that allow our local businesses to be competitive and to succeed. We talk about often creating good jobs in this, and I believe this industry has a potential to do just that in the'",
        "'speaker_8': 'future as well. We have to, I think, be focused on and be very deliberate about facilitating an environment that's conducive to creating economic prosperity in our city, for our businesses and the jobs that they will create. And I also think we need to be looking at the long game.'",
        "'speaker_8': 'I think it's just a matter of time before the cannabis industry is legal on a federal level. Right. And I think supporting manufacturing here in and here in Long Beach, maybe put put us in a position to be ready for that long term.'",
        "'speaker_8': 'And so particularly those states, I think 11 states where it's legal, where we have the infrastructure, we have the manufacturing capacity. Once that happens, there's going to be economic benefits to our local economies, but our state. And so I think our businesses obviously are depending on us to get this right.'",
        "'speaker_8': 'Our consumers are depending on us to get this right. And the employees whose jobs are are dependent on this industry are depending on us to get this right. And so this is an economic development decision before us that that that I'm going to support wholeheartedly.'",
        "'speaker_8': 'And I really like option one. When I look at this table, I see. Two three cities that that connect. They have borders with Long Beach, Los Angeles, Carson and Bellflower. And looking at the the retail rates but not only that, I guess we're looking at the non-retail, but those rates are I think we need to be doing'",
        "'speaker_8': 'I think the proposal before us puts us in a position to be competitive with with all of those those those cities. And we have to look at it from strategically that way. I do like and I'm intrigued with the option three, so I look forward to hearing more about that.'",
        "'speaker_8': 'And then certainly I think a job analysis is merited with the option to. I still would love for the social equity piece to come back because I have some ideas about that and I don't know if this is the appropriate time to talk about that, but I think we're we have not discussed that.'",
        "'speaker_8': 'And I'm talking about it now. We have not talked about, you know, gang intervention and prevention programs in terms of social equity. We've talked about it from a job component. But when it comes to, you know, the profits that are that are coming from from this industry, I think it would be really, really wise for us to'",
        "'speaker_8': 'look at that direction as well as I look forward to having some further conversation about that. But looking forward to supporting this this evening. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. And just let me go to Councilmember. You just I want to make sure I had a request this also just to clarify the exact motion. And so let me clarify please correct me if I'm wrong on any of this.'",
        "'speaker_0': 'The motion currently, as it stands, is to basically take option one and for that after the planning commission so they can begin to do the work on those recommendations as kind of outlined by staff. Then to take option three and to basically ask staff to come back with recommendations and to examine that as as a possible see'",
        "'speaker_0': 'the feasibility of option three and bring that back to the City Council for for discussion. And then to take option two and four have to have staff do both kind of a fiscal and job analysis on option two and to come back with options that are within the range of of Los Angeles, which I believe the councilmember'",
        "'speaker_0': 'said between one and 3%. So I think I got the motion correct, but I get any of that wrong.'",
        "'speaker_4': 'I agree that the job impact, fiscal impact in one one, a 1%, 2% to 3%.'",
        "'speaker_0': 'Okay. And those would those would come back to the city council. Right. Okay. And I think that was I will ask Vice Mayor Andrews, just ask just to clarify the motion. So obviously, we we I know that the planning the the vice mayor part one, which is the planning to go to potentially planning to staff and then'",
        "'speaker_0': 'measures. And that will kind of go through that process through the Planning Commission, I imagine option three, that piece of it and the option two piece of it. What do you think the timing would be from staff on that?'",
        "'speaker_12': 'So for option one, which was.'",
        "'speaker_0': 'Well, we're actually I just want to I just want to understand not the planning commission piece, but the piece that that that that that our staff would have to do on option two and three. Would either of those come back first or to where they both come back at the same time?'",
        "'speaker_0': 'What's the timing on that?'",
        "'speaker_12': 'We'd probably be able to come back with option number three more quickly because I suspect from number two, which is that the tax analysis, we would probably have to hire an outside consultant to assist with the level of detail that city councils are requesting.'",
        "'speaker_12': 'So I don't know how long that might take, but option number.'",
        "'speaker_0': 'Three but you can get you can get back to us on the timing pretty fairly soon at least. So we know the timing. Yeah. Okay. Okay. Thank you. Let me let me just I just wanted to clarify the motion.'",
        "'speaker_0': 'Just let me continue with the with the with the council members council meeting.'",
        "'speaker_9': 'Thank you. Just for a clarification that we started out in the beginning with the possibility of a 24 month pilot program. So I guess, Councilmember Richardson, where are we with that? Is it still in place? Or do we want to look, consider a shorter period of time or a longer period of time?'",
        "'speaker_9': 'What's the what's the viewpoint on that?'",
        "'speaker_2': 'So though the viewpoint is I like 24 months because it gets us going into a pilot and if we want to make it permanent, we have the option as opposed to, you know, starting off with a permanent change that may change in the future.'",
        "'speaker_2': 'And so so I like the concept of a pilot respecting that. We heard all the concerns about it. I like the concept of a pilot.'",
        "'speaker_9': 'Well, also in that discussion that the staff brought forward with the 24 month pilot program, they were also concerned with the fact that it might not really be helpful to the industry, because there's so many unknowns in regards to having a 24 month program as opposed to having maybe a longer view for them to consider what's happening'",
        "'speaker_9': 'in Long Beach and all the changes and recommendations that we're looking at implementing. So I'm more in favor of extending that if it's a pilot program or basically just make it. Nancy, let's adopt a program that lets adopt a program that we're looking at for a permanent establishment.'",
        "'speaker_9': 'It's opposed to a pilot, but.'",
        "'speaker_2': 'I think it's time to have a recommendation because I'm flexible.'",
        "'speaker_9': 'Okay, I'll leave that to you. One of the other things one of the things that that I have here is is a somewhat unique perspective on this whole issue. As many of you know, I also serve on the Coastal Commission and cannabis growth and manufacturing and distribution has been a big issue along the 1111 100 mile stretch'",
        "'speaker_9': 'of California's coast and the establishment of not only manufacturing distribution, but growth of growth along along the the coast, in outside the locations not not only inside of case in point is a very large I don't want to call it a plantation, but a growth area after the Santa Barbara coast and up there and all the all'",
        "'speaker_9': 'the. Issues that that brings along with them. And that's including your employees union jobs at all at all parts of the of the chain of of getting cannabis ready for market. So the I think that in terms of the employee market, I think it's there.'",
        "'speaker_9': 'I mean, it exists. We're just not having a good handle on as far as what it would take for here in Long Beach. But so I think that the jobs basically are going to be there. Some might be automated and and can lend itself to automation, some aspects of it, but certainly not all.'",
        "'speaker_9': 'And so I could see I consider this as a job maker. And just like anything else, it's a it's a manufacturing, it's a new business. It's something that we're just getting into the the the tip of the iceberg, if you will, of an industry that that is new.'",
        "'speaker_9': 'And when I look at this chart of the report, which is an excellent report so far, that's that put together, you know, looking at already only 37 out of 248 applications being accepted. You know, that's 15%. And we've been going at this now for at least, what, two years that we adopted our our plan.'",
        "'speaker_9': 'And everybody who looked at law was saying, you know, language is really at the at the forefront, cutting edge of of marijuana licensing. But I see 50%. I see. No, we're not. We've got a long way to go still.'",
        "'speaker_9': 'And there's too many applications out there still hanging on the edge at all levels. So the time I'm talking about zoning and planning and building and those that are under construction with 53, which I hope is I hope they do finish.'",
        "'speaker_9': 'But in terms of what I was saying earlier with with the with the Coastal Commission, I've had an opportunity to visit a number of cannabis growth, distribution and testing labs up and down the coast from Arcadia to to locally to here.'",
        "'speaker_9': 'And I see a lot of people doing work in there. And, and I've seen the product itself in regards to its per in particular, it's always the, the big emphasis of the medical benefits that cannabis has. So I see this as something that is growing and we need to get behind it.'",
        "'speaker_9': 'I think that Long Beach is is at a very good position here to create a manufacturing capital, if you will, in Southern California, especially when it comes to this this this manufacturing area. So I'm going to support the motion on the floor.'",
        "'speaker_9': 'But I like I said, I would like to see that that not be as restrictive in terms of a 24 month pilot program. But to be more open on that open ended, if you will, maybe come back after a three or four year, five year evaluation to see where we're at with that.'",
        "'speaker_9': 'I especially think that in in like in any other manufacturing industry, we need to be competitive. I mean, if if our taxes are too high because we tax it at every level of production, it's ineffective, we're going to lose.'",
        "'speaker_9': 'And I think that we have to reconsider the the options that we have here in terms of taxing every step of the process. So we look at one process, one tax and get it and get it done. Also, looking at the in terms of of of that and also looking at the at the access to capital, you'",
        "'speaker_9': 'know, we have to be a little bit more flexible on that. I, I don't recall which of my colleagues stated this, but, you know, we know that that the federal regulations are going to be coming. We know that it's it's going to be delays.'",
        "'speaker_9': 'In fact, if truth be told, we're looking at other options of other natural world plants that are going to be available, though. Yeah. Mushrooms. Yeah. And mushrooms are the under consideration nowadays. So I mean, that's that's on the edge of coming in here.'",
        "'speaker_9': 'And we're probably going to be hearing about mushroom cultivation and distribution and manufacturing. Maybe not now, but but that's that's coming. Okay. Let me back let me backtrack it a little bit anyway. At the end at the end of the day, at the end of the day, I think that we in Long Beach need to consider ourselves'",
        "'speaker_9': 'to be competitive. We're a large city as we as we know. And we have some great staff and we have and we have people who here who can do can do the work. And and like I say, we're in a cutting edge.'",
        "'speaker_9': 'So let's. Hey there. And then let's let's move on. And hopefully staff can come back with a recommendation that will really be able to be put to use.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember. Councilwoman Mango.'",
        "'speaker_5': 'Yes. I have two additional small things. One is a jay. On page five. You have almost the same number of businesses in building round review and under construction 130. That is more than 50% of the businesses that are in the process at all.'",
        "'speaker_5': 'Do we have a timeline that we can get some of these guys online? Like what is. I mean, a lot of these people are already interested. They've already made the investment. It's the process that's holding them back and or construction.'",
        "'speaker_5': 'Do we have anything besides options one and three we can do to speed it along? Or do you have a timeline of how many will be online in 30 days? 90 days? 120 days?'",
        "'speaker_12': 'Yeah, it's hard for us to say because the timeline, once businesses start construction, is primarily up to that business. The timeline that they're construction team is on. We do have inspections, but generally once they reach construction, the holdup is the project itself.'",
        "'speaker_12': 'We have averages for those businesses that are licensed that have been able to get through the process, and we use those averages for our tax projection purposes. But offhand, I don't have those.'",
        "'speaker_5': 'Would you be able to work with development services to give us a a update on the 77 Building Plan Review? Like, have they been sitting on desks for weeks or are they back with the contractor so we could at least know that from them?'",
        "'speaker_12': 'Sure. We can provide more of a breakdown for businesses that you said. They're in the construction phase or in.'",
        "'speaker_5': 'The building plan review. That's on our side. In the city side.'",
        "'speaker_12': 'Sure. Perfect.'",
        "'speaker_5': 'Thank you. I have one last statement, which is I see the greatest ability to increase the gross receipts of the marijuana industry in enforcement. Until we crack down on the illegal marijuana sales in our city, it isn't going to.'",
        "'speaker_5': 'I mean, these things are all minor compared to that. A large percentage of the sales are still in the illicit market. And so one of the things I would ask Council Member Richardson to consider, if we do go to a consultant, which sounds like 30 days to get a consultant, all that stuff, the difference between 1% and'",
        "'speaker_5': 'just doing the cost out across the whole percentage. The one thing I've heard from I've talked with Elliott, Johnnie Adam consistently. They'd be willing to put money into a pot for enforcement. I don't know what we can do.'",
        "'speaker_5': 'We've talked about some options. We've offered to sit down between some of the industry, individuals and PD to talk about what options are available. But if there was a discussion of, Oh, we would like to settle on X percent tax, but we'd be open to 1% more if that $178,000 was put into enforcement of getting these illicit'",
        "'speaker_5': 'individuals out of the market. I know there was a a write up of a potential program that kind of came through the industry. But we need to be more serious about enforcement and we're closer together. So I hope that the industry will take us up on the offers we've made to meet with PD on potential options to'",
        "'speaker_5': 'help all of you, because the greatest path to increasing your gross receipts is enforcement.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman. Councilman Price.'",
        "'speaker_6': 'Thank you. That's kind of the topic that I wanted to talk about. I'm really grateful up until this point that we haven't had as much of a problem with the brick and mortar illegal dispensaries as our neighbors in L.A. have had.'",
        "'speaker_6': 'I think that's a lot of that is a testament to how seriously we've taken this issue as a council, how much of a priority we've made the enforcement issue, and really honestly, how often we talk about it being a priority for the neighborhoods.'",
        "'speaker_6': 'But the delivery concept is is completely out of control. And I don't know. I mean, I'm really looking A.J., I know you've worked really hard on this and on all these issues and you've been really plugged in to what other cities are doing.'",
        "'speaker_6': 'I think we've taken some really good, proactive measures as a city to increase our enforcement, our fines and fees for commercial property owners and things that we have passed as a council. That has been great. But the delivery market is completely something that we don't have control over right now.'",
        "'speaker_6': 'We need to figure out what to do in that regards because, you know, I'll tell you, I'm sick of the advertisements all over the city for the four places that. Deliver from businesses that are not licensed in the city.'",
        "'speaker_6': 'There's no testing in place. There's no consumer protections in place. And we're basically, you know, not we're allowing these people to advertise here. And we have zero consumer protections in place. And we and and we're not even able to tax these entities so that we can put that money back into to enforcement.'",
        "'speaker_6': 'You know, maybe it's what I do for a living every day that makes me think there's an opportunity for enforcement here, that we are not capitalizing, we're not being aggressive about it. We're not and I don't know, that's not a criticism because I think everyone's similarly situated.'",
        "'speaker_6': 'It's more of a we need to figure out some out-of-the-box ideas. You know, it's kind of like not exactly the same thing. But when we talked about short term rentals, one of the concepts we had is we've got this entity that's an intermediary between the homeowner and the renter, and that entity is trying to distance itself from'",
        "'speaker_6': 'regulations, doesn't want to be involved in the regulatory aspects of the industry. Well, that's kind of the same thing that we've seen with a lot of the advertisers for marijuana. They don't want to be involved in figuring out who's licensed and who's not before they advertise them.'",
        "'speaker_6': 'So maybe we can go to the table with some of the biggest online delivery companies and we we ask them if they can refrain from. I don't I don't know, maybe they can refrain from advertising from businesses that aren't located in the city.'",
        "'speaker_6': 'What that looks like, I don't know. This is not an area where I have subject matter expertize. But I do know that if you're violating the law and you're not allowing for some of the consumer protections that we are all entitled to as residents in the state, you should be held accountable.'",
        "'speaker_6': 'And if you're bypassing the testing requirements and you're bypassing all the different regulatory requirements that are brick and mortar operations, or are operations that are licensed in Long Beach have to follow, then you shouldn't be receiving a benefit.'",
        "'speaker_6': 'You should be held accountable for trying to bypass those because it's just not fair. And so I'm really hoping that we can figure.'",
        "'speaker_5': 'Out a.'",
        "'speaker_6': 'Way to find some out-of-the-box ways to go after the illegal delivery market that we're seeing here. In regards to this particular item, I'm totally in favor of looking at it and studying it. I do have a question probably for our city attorney, though, and perhaps you can just educate me on this because I will tell you I'm'",
        "'speaker_6': 'glad of the direction this item has taken, because when I initially read it, I was having a really hard time understanding how we could in one vote, vote to increase taxes potentially for our residents, and then in another vote, vote to reduce taxes on an entity that's providing income so that we can support enforcement operations.'",
        "'speaker_6': 'But so I'm glad that we're the timing of this is such that we're going to be able to evaluate it some more. But the question I have is how does changing our ordinance impact the fact that this has come to the city as a result of a ballot measure?'",
        "'speaker_6': 'Because I think it's very, very important for residents to understand that we're having the marijuana discussion, that we're talking about marijuana industry and we're talking about sales tax for the marijuana industry because of a voter passed initiative, not because of this council's actions, but because of voter passed initiative.'",
        "'speaker_6': 'So how does changing the ordinance impact the fact that this came to us as a ballot initiative?'",
        "'speaker_4': 'Well, it would it impacts what changes you can make to the ordinance, because it's a citizens initiative or the initiative that was passed by the voters cannot be just changed by the body itself. But the study and the taxes that have been approved were approved at rates that offered the opportunity for the council to adjust it up'",
        "'speaker_4': 'or down. And so you could do that. And that's within the authority of the council as.'",
        "'speaker_6': 'Long as you stay within that range.'",
        "'speaker_4': 'Yes, exactly. Otherwise it would have to go back to the voter. One of the other comments made from the Dias about dedicating a certain percentage of the tax if you're changing it would probably not be allowed based upon the voter action because you're creating a special tax by dedicating it to a specific resources as a general tax'",
        "'speaker_4': '. And so you could allocate any amount you'd like, but that would have to be done during the budget process.'",
        "'speaker_6': 'Okay. The other question I had, and I love the concept of a shared manufacturing space, but one of the things I'd love the report to include when it comes back is how we go about enforcement. When we're talking about a shared manufacturing space, how do you apportion negligence?'",
        "'speaker_6': 'How do you apportion lack of compliance? How do you apportion that when we're talking about a shared manufacturing space, especially when we're sharing? Utilities, other resources, assets of that nature for the manufacturing process. So that's something that I would be really interested in.'",
        "'speaker_6': 'But, you know, as a as a as the wife of an engineer who has worked in labs for many years and understands the lab industry, it's not it's not cheap to set one of those up. So anything that we can do to help bring quality.'",
        "'speaker_6': 'Industry to the city and work together to keep out illegal industry that is not complying with what the residents, the community and everyone here who's who's serious about consumer protections work together to keep those businesses out. I'm all in favor of.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Let me I have a couple a couple of questions, such comments for when this comes back. And let me go first, since I know that the next few speakers have had a bite at the apple already.'",
        "'speaker_0': 'Just a couple of things. So the first is, obviously, I think I'm supportive of of where this is going and is certainly of getting the information detailed out to the council. I think option one is is very interesting.'",
        "'speaker_0': 'I think there are a lot of planning, I think adjustments that need to be made to ensure that we just have a just a better system in place. And I think the Planning Commissioner is absolutely the right approach.'",
        "'speaker_0': 'I am also interested in the shared use manufacturing. I think that's that's certainly something I think Mr. Modica and the team can get back to us hopefully fairly quickly just to get that information. So that can be part of, of, of this process.'",
        "'speaker_0': 'It doesn't seem like it's something that is too much different than what we're doing, but certainly a way to to create some some synergy within within the industry. And certainly I think if that looking at what our our tax rates are and coming up with the recommendation from staff, I think is a very reasonable request.'",
        "'speaker_0': 'I do have one question as it relates to that, and I think this is something I've actually talked to some of the BCA members in the past about and it's actually something I want to understand better because I, I remember in our conversations and setting up on the cultivation side.'",
        "'speaker_0': 'We did this $12 a square foot number. And I know if you look at a bunch of cities, there is a difference. You know, some some cities are using the square footage measurement and others are just using the flat percentage.'",
        "'speaker_0': 'And so if when this comes back, can you just kind of walk us through why we went that in that direction and how and why this changes is is better or or in your opinion, not better, you know, for for the city of Long Beach, because I know there was some extensive conversations that we all had as'",
        "'speaker_0': 'to whether this was the right approach. And the truth is and I think it's important for us to note that as the council developed these rates and these percentages, it's not like we had the perfect formula to get this 100% correct.'",
        "'speaker_0': 'We were building something as we went as best we could, hearing input, ensuring that we would have the resources that we needed to provide, the services that we committed to with the residents. And we wanted to make sure that we found the right balance.'",
        "'speaker_0': 'And so a lot of these numbers were developed in partnership, I think, with with our partners, but also in a discussion and debate the council had. And so I'd love to hear from staff just a little bit more explanation on the square footage and the percentage when that comes back.'",
        "'speaker_0': 'I think that would be good for the council to hear. And then the last thing is I'll just reinforce something, something that a couple of councilmembers just added to me. The the, the when I hear, you know, you know, maybe the, the, the taxes aren't coming in maybe as high as we initially projected or, or not the'",
        "'speaker_0': 'numbers that we'd like to see. I mean, to me, the biggest reason for that has got to be or a huge reason has.'",
        "'speaker_4': 'Got to be.'",
        "'speaker_0': 'The illegal transportation that's happening across the city. And I think it's been mentioned now, and I think that the delivery services that are not getting taxed and they're not paying into our system are absolutely causing a major burden to the current operators are now illegal part of our process and so I don't know if there's more that'",
        "'speaker_0': 'we can do it I can't imagine that that that we're doing all we could be doing in that area. And maybe it's a resource question or a technology question, but I'd love to know and see how we could either invest on our side or figure out a way to capture more of that market and crack down more'",
        "'speaker_0': 'on the illegal deliveries. And I think that whether that's we do that through the budget process or whether there are maybe some additional new best practices that are happening in other communities, I will say this is not like unique to Long Beach.'",
        "'speaker_0': 'This is happening in a lot of in a lot of communities. But I hate that. I don't I don't like that our local, ah, local folks that have gone through the process and that are illegal entities we recognize are essentially being put at a competitive disadvantage.'",
        "'speaker_0': 'And, and the other group is being put at a competitive disadvantage is us because as a city we are losing. Do we have any idea how much how much we're losing in revenue because of the illegal deliveries?'",
        "'speaker_12': 'It's it's hard to say for sure, but I've read reports that estimate the size of the illicit market to be around 75% of the total market statewide. Whether that applies to the city of Long Beach as well, I'm not really sure.'",
        "'speaker_0': 'Well, I think I you know, I'd like to to do a little bit more if it's possible. I'm not sure if it's available data, but I'd love to understand how much we are missing out on it from a revenue perspective for the city because of the illegal because of the illegal delivery system we have.'",
        "'speaker_0': 'And if we are losing out on as much as I you know, I assume we are just by looking at what's out there from an illegal delivery perspective, that is an immediate place where we should be. We really want to focus on our public safety services and our health components and all these are the things that we'",
        "'speaker_0': 'want to do and ensuring that our current operators are successful. We I think we got to kind of figure that out. I'd love to see a number or a guesstimate on what we're losing. Can we get that? You think?'",
        "'speaker_12': 'We've we're working on analyzing the illegal market and we can prepare studies.'",
        "'speaker_0': 'Yeah, but I want. I want how much we're losing in tax revenue every year.'",
        "'speaker_12': 'Oh I see. Sure we can include that in the in the report.'",
        "'speaker_11': 'And may I think would be helpful to also show kind of the history of how we became to this decision. We spent a lot of time as we were developing the ordinance, talking about what our enforcement mechanism was going to be, what kind of staffing resources we were going to need.'",
        "'speaker_11': 'Try not to make this a police activity, but more of an administrative activity in keeping with state law. So we'd like to provide you a lot of that background to and just understand where we are today. And of course, we'll look at other cities if they found a way to do it within that model.'",
        "'speaker_11': 'We'd love to know that as well.'",
        "'speaker_0': 'Great. Thank you very much. And Councilmember Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Just. Just the talk. Just come back to a couple of things. So, one on timing. I know the mayor asked about option two. An option three. I want to go to option one. So. So, AJ.'",
        "'speaker_2': 'Mr. Jackson. So this planning commission. Look, how long do we think have you already engaged? Planning. Planning department? How long do you think it takes to do that process?'",
        "'speaker_12': 'We have and Planning Bureau believes that they should be able to complete the study by the fall. So as soon as three months that that would be the estimated timeline for that.'",
        "'speaker_2': 'So about three months. Okay. So three months on some of the planning stuff. How does that align with what we think is phase three in Los Angeles?'",
        "'speaker_12': 'Phase three, I believe, has opened or is scheduled to open soon, but within phase three, they actually have more phases within it. So the complete rollout of phase three, I'm not sure, but possibly by the end of this year.'",
        "'speaker_2': 'Okay. And then so option two, in terms of the consultant. So so I would imagine the job piece that we added in that something, you know, I don't think we need to do like a, you know, like a Buxton report or some elaborate economic analysis.'",
        "'speaker_2': 'I'm thinking we talk to Pacific Gateway, our internal folks. Figure out what the formula is on jobs and sort of forecast that out. So like an internal calculation, that's something we can do on the job. He's right.'",
        "'speaker_12': 'Yeah. We can take averages for existing businesses and apply those tests.'",
        "'speaker_2': 'That's, that's what I'm thinking. And then in terms of, you know, comparing what the fiscal impact is on 1% to 3% range, the fiscal impact we're talking about, that's not something that we can conduct in financial management because we see that all the time in the budget process.'",
        "'speaker_12': 'So we have prepared an estimate for for every 1% change in the tax rate, what the impact would be to the general fund. What I'm hearing is that city council wants us to dove more into the details and study those numbers further.'",
        "'speaker_12': 'So for that, I think we would need a consultant to help us prepare that analysis. And how long that would take? I'm not sure at this time.'",
        "'speaker_2': 'Well, so what? Like what? And and I understand people have asked about option three. I don't have a question on that. So what I'd like to do is understand. So when I think fiscal impact, I think, you know, let's compare what our our initial forecast was short.'",
        "'speaker_2': 'Right. We we looked at what we anticipate to open based on a certain amount of businesses opening. The forecast we're looking at is, you know, sort of looking at 1%, 2%, 3%. And assuming that we get a higher, the idea is we get a higher sort of open rate.'",
        "'speaker_4': 'Or sort.'",
        "'speaker_2': 'Of clearance rate of these businesses, and the idea is to try to offset it. So are you saying like to do that kind of analysis, you may need to bring in a consultant to do.'",
        "'speaker_9': 'Yes, I'll go ahead and take that. So what we have what the council.'",
        "'speaker_4': 'Has before them right now is a fiscal impact analysis that's been done by staff in order to do to go deeper, to do analysis.'",
        "'speaker_9': 'On the jobs impact and some of the other questions.'",
        "'speaker_4': 'That were raised in terms of the fiscal and economic analysis, we it's likely going to require some professional services to do that. We certainly can, you know, work with our economic development department to see how we might be able to economize on that or partner on that and get support on that.'",
        "'speaker_4': 'But based upon what's being requested, it looks like we're going to need to get some professional services to help us with that.'",
        "'speaker_2': 'So what what I would love to do is get an update sooner on what that timeline looks like, the fleshed out timeline. So like within the next 30 days, come back and just say, hey, after, you know, talking to planning, after doing our initial review on option three and looking at our resources internally, this is what the'",
        "'speaker_2': 'window could look like to bring this back. Because my my expectations, I and I want to put that in comparison to like if the idea is to be competitive and to try to boost, you know, sort of be competitive, to boost the tax base, then I want to understand that in comparison to sort of the timeline on'",
        "'speaker_2': 'phase three in Los Angeles. So if what we're saying is Los Angeles phase three begins in in fall and we'll fully optimize and people are making big business decisions within the three months of fall, by the end of the year, then that tells me you've got, you know, your 90 days to do your initial review and then'",
        "'speaker_2': 'implement over another 90 days or whatever it is to make sure that we're competitive. So so what I don't want is to put restrictions on you here at council that somehow trip up the intent, which is to try to be competitive.'",
        "'speaker_2': 'So that so the hope is we can do as much as we can in house, not spend the money on consultants if we don't have to and see if we we can sort of achieve that. That's that's the hope here.'",
        "'speaker_2': 'And then the other thing here. The other thing I'll say is so, so, so yeah, a two from four early that says, hey, this is what the timeline could look like and this is what we heard. I think I'd like to see that in the secondly on the conversation on on enforcement, I completely I completely agree on'",
        "'speaker_2': 'the conversation on sort of the legal delivery stuff. And and I would grapple with I, I understand that this is something that people have unanimous generally unanimous support for sort of tamp down on that market. But I also understand I understand that also understand that when we say new industry, I put quotes because it's not a new'",
        "'speaker_2': 'industry at all. It's it's it's not a new industry. This product is existed in the community. This is the process of bringing it into the into the sunshine. I think while, while we do a lot of enforcement and we should still think of the innovative ways to do that, I think we should focus our time will figuring'",
        "'speaker_2': 'out how to capture as much as possible of the legal industry. And if they have if they're overburdened with regulations and taxes and all those things, it doesn't help us. It doesn't help them to compete with the illegal market.'",
        "'speaker_2': 'And so we just have to keep that in mind as we connect that to the timeline. If we're overburdened, we're overburdened and we have a long time on this process. All it does is just support the legal market and support the legal delivery market as well.'",
        "'speaker_2': 'So so those are those are my thoughts, my comments. So is that okay? Can we do that? Is it okay to get back with the two from for within 30 days on simply the timeline? Yes, because I know there's been a lot of questions by counsel.'",
        "'speaker_2': 'I know you need a minute to kind of think all this out.'",
        "'speaker_4': 'Yes, absolutely. We can do that.'",
        "'speaker_2': 'Great. Thanks a lot.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'So I think what I heard of Jason is that page 14, 178,500 number is the loss to the general fund per percent. So 178 times 3% would be 534 over a 24 month period. 36 month period. You go 1 million, you go 1.5 million and so on.'",
        "'speaker_5': 'I think that I'm in complete agreement that we don't need an outside consultant, if possible. I don't want to spend $60,000 to save $178,000. What I'm really looking for is a staff member to reach out to the industrial real estate community, pull a report of vacancies in the city.'",
        "'speaker_5': 'They say everything on it. They say cost per square foot. They say all these things. It's a quick survey of the vacancy, our vacancy rates 2% or something that I think that they presented that I see not that easy enough.'",
        "'speaker_5': 'Give a call through. Real quick, are you open to taking in marijuana facilities? If so, find out which one of these they fall in and how much revenue we think they could bring in. Make them growth estimates. Here's the high.'",
        "'speaker_5': 'Here's the low. That's what I'm looking at. Hope that brings some help to what my series of questions was, because I don't I just don't think it's that complicated.'",
        "'speaker_0': 'Sure. Thank you. There's a there's a motion and a second on the on the floor. It's a motion by Councilman Richardson as presented. And so with that members, please go ahead real quick.'",
        "'speaker_2': 'Bickerstaff, just respond to Stacey's comments about the council, about their consultant.'",
        "'speaker_5': 'Mine is just an opinion. It's still their decision.'",
        "'speaker_0': 'I think at the end of the day, I think it's I think they're suggesting to staff that that the government members suggestion of staff that if you can do it in-house, preferably preferably to do it in-house is the suggestion.'",
        "'speaker_0': 'And so there's a motion and a second. The motion as made by Councilor Richardson. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. Motion carries. We're now moving on to the rest of the agenda. So thank you all for being here for the other item. Item 20.'"
    ],
    "Presentation of Public Service Announcement on Illegal Fireworks.": [
        "'speaker_0': 'Vice Chair Andrews. Yes. Yes.'",
        "'speaker_1': 'Okay. Motion carries.'",
        "'speaker_0': 'Thank you. Item 21, please.'",
        "'speaker_1': 'Item 21 is communication from Councilwoman Pryce. Recommendation to receive and file a public service announcement video on the dangers and impacts of illegal fireworks.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_6': 'This is our third video that was created by the Cal State Long Beach film students. And I believe it should be ready to go. I don't know if Eric's back there, but. Let's do this.'",
        "'speaker_13': 'Welcome to God's blood. Today is the 4th of July. This is my big dog, Tito. Fireworks are awesome, but the bright lights and loud noises scare Tito and other pets. I made a few steps so that all our pets can be safe and stay with it.'",
        "'speaker_13': 'Now, as I was saying, make sure your pets have their colleagues on at all times.'",
        "'speaker_3': 'And then.'",
        "'speaker_13': 'Close your doors and your windows say pets can run away. And make sure to bring them inside. The floor. That way you can hide and feel safe. Keno can silly dog feel the bee journal to music.'",
        "'speaker_14': 'The high the shelves.'",
        "'speaker_13': 'Keep your pets safe this 4th of July before.'",
        "'speaker_6': 'So that was that was Tito, the star of our third PSA and the Cal State Long Beach students who put the films together did an amazing job. These videos have gone out all throughout the city. They've been showed on digital board displays.'",
        "'speaker_6': 'They've been just promoted really, really well, considering it's our citizen committee that initiated this project and has been the one that has been spreading the word. So everyone, please be safe. Watch out for your pets. Watch out for each other.'",
        "'speaker_6': 'And in addition to illegal fireworks, please, please, please don't drink and drive, please.'"
    ],
    "Feasibility of Electric Shuttle Service or Free Ride Program for 2nd Street Corridor and Alamitos Bay Landing.": [
        "'speaker_0': 'Thank you. There's a motion and a second. Any public comment scene and please cast your votes. Can someone close the door on the top? Thank you. Item 22, please.'",
        "'speaker_1': 'Item 22 Communication from Councilwoman Price Councilmember Peers Recommendation to direct the City Manager to work with economic development and public works to assess the feasibility of funding an electric electric shuttle service or Free Ride program to transport people from Belmont Shore to Second and PCH into Los Alamitos Bay Landing.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_6': 'Thank you. I'm glad to be bringing this item tonight before my colleagues and I ask for your support. East Long Beach has been seeing major investments in business and as a result, we are anticipating major increases in visitors coming to the area to enjoy the businesses and the beautiful corners of the city.'",
        "'speaker_6': 'Recently, we have seen Ballast Point become a major draw as a brewery and restaurants, bringing more people to Alba Alamitos Bay landing in addition to the existing businesses in the landing like boat house on the bay. We are also seeing San Pedro Fish Market coming to this area in September, which is a huge regional draw that will'",
        "'speaker_6': 'add to the activity of the crab pot and sooner or later. Not to mention the second PCH project is coming online in October of 2019. So for all of these reasons, it's essential that we develop some creative ways of better managing the movements of people who want to spend time there and transfer to the Belmont Shore and'",
        "'speaker_6': 'Naples business corridors. All of these areas are constrained by parking and traffic impacts. So what we can do as a city to make it easier to move people through these areas is essential for us to consider and explore.'",
        "'speaker_6': 'We saw the successful use of the free rides in downtown and we have seen the first Fridays shuttle work well. So looking forward to applying a similar success to other parts of the city, including East Long Beach. So I thank you for your support.'",
        "'speaker_6': 'And this item formally requests that our economic development team start to explore and hold stakeholder meetings to determine the feasibility of this program. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion and a second is your public comment on this. CNN members, please cast your votes. This is very needed. Can attest to every time we go out there.'"
    ],
    "Agreement with California Department of Public Health Office of AIDS for HIV/AIDS Health Care Services.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please, is 27.'",
        "'speaker_1': 'Item 27 is a report from Health and Human Services. Recommendation to execute an agreement with a California Department of Public Health Office of AIDS. To accept and expend grant funding in an amount not to exceed 5.7 million for the provisions of HIV, AIDS health care services citywide.'",
        "'speaker_0': 'Thank you. There's a motion. And the second is any public comment saying none. Before we voted, I want to say just congratulations again to the health department and to the the the entire planning group that's been involved in our HIV strategic plan.'",
        "'speaker_0': 'So I know that this will this relates to that as far as our ongoing funding, at least. And we're also looking at some additional funding moving forward to kind of really get us really more in line to where the county's at and hopefully much below that and trying to get us to much less infections and transmissions of'",
        "'speaker_0': 'STIs. So thank you for your work on this. There is a motion and a second. Please cast your votes.'"
    ]
}