{
    "Ordinance on Transitional and Supportive Housing.": [
        "'speaker_1': 'Kerry Number one agenda item number one report from Development Services recommendation or receive supporting documentation into the record. Conclude the public hearing and declare ordinance amending Title 21 of the Long Beach Municipal Code related to transitional and supportive housing.'",
        "'speaker_1': 'Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_8': 'Mr. City Manager.'",
        "'speaker_11': 'Thank you, Madam Vice Mayor. Members of the Council. The staff presentation will be made by Amy Bodak, our Director of Development Services.'",
        "'speaker_2': 'Mr. Mayor, members of the City Council tonight before you is essentially a cleanup item of our municipal code as it relates to various definitions that comprise our housing definitions. We have a couple of housing definitions in the code that are severely outdated and that need to be updated.'",
        "'speaker_2': 'We also need to change some of our definitions to comply with current state housing law, and those definitions have been included in your staff report.'",
        "'speaker_6': 'We are essentially.'",
        "'speaker_2': 'Asking you to add four definitions to the municipal code supportive housing, target population, transitional housing and single room occupancy. And then we're also asking you to revise the existing definition of a family that we can have in our municipal code, because it, frankly, is an antiquated.'",
        "'speaker_2': 'We did take this information to the Planning Commission, and the Planning Commission did approve this request in April, provided that you approve this request. Also, we would submit it to the Coastal Commission for their update as well and then revise the municipal code.'",
        "'speaker_2': 'That concludes my staff report. I'm here if.'",
        "'speaker_8': 'You have any questions. There's the motion and a second. Councilmember Richardson or Councilmember Andrews. Would you like to address the motion? Okay. So any member of the public that wishes to address Council on hearing item one. Seeing nonmembers cast your vote.'"
    ],
    "Zoning Amendment and Categorical Exemption for Transitional and Supportive Housing.": [
        "'speaker_1': 'Motion carries. Are we on to conserve? I'm sorry. We're in stone. Hearing item number one Adopt resolution to submit the amendment to Title 21 to the California Coastal Commission for their review and certification and accept the categorical exemption.'",
        "'speaker_1': 'S.E. 14 DASH 135 citywide.'",
        "'speaker_8': 'There's been a motion and a second. So any member of the public that wished to address councilmember your anger.'",
        "'speaker_10': 'Just inside, I'm sure that we'll get a positive vote. And, of course, the commission.'",
        "'speaker_8': 'We hope so. So any member of the public that wishes to address council on hearing this this motion on hearing item one seeing nonmembers cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Okay. Thank you very much. We did the hearing. Now we're moving on to public comment. So we all know public comment is limited to 3 minutes. A speaker. I have five members of the public. I'm going to call the first three to the podium.'"
    ],
    "Development of the PATH Program for Disconnected Young Adults.": [
        "'speaker_1': 'Item number 16. Communication from Councilmember Richardson, Councilwoman Price, Councilman Andrews, Councilmember Ringa, recommendation and request. The city manager and city prosecutor to work with the Pacific Gateway Workforce Investment Board to develop the promising adults tomorrow's Hope Program and identify budget options in fiscal year 2016 to support a path.'",
        "'speaker_1': 'Young Adult Diversion Coordinator in the city prosecutor's office and separately the development of a path young adult workforce strategy.'",
        "'speaker_0': 'Thank you. I want to turn this over to Councilmember Richardson.'",
        "'speaker_12': 'Thanks, Mr. Mayor. So thanks to everyone in the community who who came out to see this. I know that there's an NBA finals game, but this is a very important issue. And so, you know, a matter of months ago, I was on a trip to Washington, D.C. with the federal pledge Committee, joined by the mayor and council'",
        "'speaker_12': 'members, Gonzalez and Mongo. And and we were really able to take a look at national standards and national policies and have a higher level conversation about where we are as Long Beach as leaders and where are some opportunities for us to to expand our leadership and personally.'",
        "'speaker_12': 'And there's a particular issue I want to talk about tonight at 31. I'm thankful for the opportunity to provide for family and contribute to society. But if you were to ask Mina, my wife, she wouldn't mince our words by telling you I wasn't her type when I was 21.'",
        "'speaker_12': 'And and the reason for this difference in character is is basically rooted in the concept of young adulthood. And so so I'm here in this position as a council member and blessed with this family because I was provided opportunities, opportunity to get an education, opportunities to have be supported by my family and many disconnected out of school'",
        "'speaker_12': 'and out of work. Long Beach young adults could use some of those same opportunities. So tonight I'm asking the City Council to consider creating a comprehensive path for all young adults, particularly those disconnected from work, school or other support systems.'",
        "'speaker_12': 'Last week, on Monday, June 1st, I hosted a community conversation to discuss these exact issues and how to help more young people succeed in life. We were fortunate to have our city prosecutor Doug Halbert, as as a presenter, as well as Brant Cohen, a special adviser to the U.S. attorney, assistant attorney general in the Department of Justice'",
        "'speaker_12': 'and the Children's Defense Fund. So I'd like to just show you a highlight video that provides an excellent reference on why we're bringing forward this item tonight. And this meeting, we're going to have a conversation on how we can work together as a community in a kind of way.'",
        "'speaker_12': 'Let's go take a look right now.'",
        "'speaker_7': 'And before I before I started applying, I would like to note how critical it was to the deadline, both for colleagues. There are no second chances.'",
        "'speaker_11': 'But the question of what I wish I had known I wish I would have known more about the management process.'",
        "'speaker_7': 'The financial.'",
        "'speaker_3': 'The job.'",
        "'speaker_6': 'Needs.'",
        "'speaker_7': 'Of the area before you choose and.'",
        "'speaker_11': 'Engage financially.'",
        "'speaker_6': 'The real financial.'",
        "'speaker_7': 'Burden of students start in kindergarten. How to manage my social load.'",
        "'speaker_11': 'The independence that you gained to go to college. You got to be pretty much.'",
        "'speaker_0': 'Getting things done. Nobody holding your hand. You got to show up. These types of initiatives only work when we're all working together, whether it's community, it's our faith groups, whether it's our public safety team. What is our. Our prosecutor's office?'",
        "'speaker_0': 'We're all working together. We really can make a difference.'",
        "'speaker_12': 'Too often, a bad decision turn into a loss of life or loss of livelihood unless they have opportunities presented to them. And so today's conversation is really about opportunity. According to the last census in 2010, young adults make up the largest segment of our population along the East Coast Pacific Gateway.'",
        "'speaker_12': 'The unemployment rate for folks that are 20 to 24 is 20.7%. That's almost triple the Long Beach. Young adults are also more susceptible to violent crime. In Long Beach, you represent a significantly disproportionate percentage of victims of violent crime.'",
        "'speaker_12': 'So a lot of these police department data tells us that since January 2014, 50% of all murders in the city of Long Beach occurred to victims ages 18 to 29. 43% assault with a deadly weapon. Victims are between the ages of 18 and 29.'",
        "'speaker_12': '38 for roughly 40% of all robbery victims are aged 18 to 29.'",
        "'speaker_11': 'And that's all recent advances in developmental neurological science tell us that the brain isn't fully developed until someone's in their mid-twenties. It's not 18 is not 16 is not 21. When you can drink is 25. The only people who really have this right are the rental car companies.'",
        "'speaker_11': 'Which are you extra if you're doing one? On the other hand, the part of the brain that deals with pleasure seeking, reward seeking, that's fully developed. And so you have this gap between rewards that give you behavior and the ability to sort of mitigate that impulse control.'",
        "'speaker_11': 'All right. So essentially, young adults look like fully grown adults. They talk like fully grown adults. They're like a car without a brake pedal. Right. It looks right from the outside, but then it really does sort of slow down, isn't fully there.'",
        "'speaker_11': 'Well, we also know now through the science is that the period of adolescence and adulthood is equally as important and is, in fact, our last opportunity.'",
        "'speaker_7': 'When when a young person steps into the courtroom and is in that waiting room, even in the waiting room, and it's sometimes a 12 year old, 13 year old, 14 year old. The type of experience that is, is traumatic and the kind of influences that they're going to have if they continue down that path.'",
        "'speaker_7': 'Again, like Brant said, the brain is very malleable. So it could be positive. It could be negative. And it's our job to switch that net from sweeping young people up and and criminalizing them to to making a wide net that puts them into mentoring programs.'",
        "'speaker_11': 'Is it those that are absent from school and they're in third grade, fourth grade, fifth grade, sixth grade, fall behind, 75% of chronic truants don't finish school. We also know that if you don't finish school, if you don't get a high school degree, how are you going to be competitive in the job market?'",
        "'speaker_7': 'The core issue, what is the root cause for this tension at school for this this young person is behaving in escalating to that. Before, it used to be a trip to the principal's office. And, you know, you would have a conversation in calling your parents and you would figure out what went wrong, how could that have been'",
        "'speaker_7': 'prevented? And there would be a consequence that it was all based in positive development. And now young people are going to court for these things that some people.'",
        "'speaker_11': 'Here in Long Beach, I can say that again for working now, I think for the first time in a collaborative way that's never been approached by any city, by having health department, police department, prosecutors, district attorneys, probation officials have a wide range of folks with the leadership that we have in the city of Long Beach with Robert'",
        "'speaker_11': 'Garcia, an education focused mayor, with people like Greg Richardson who are leading the charge in the city on the policy side. I believe we're uniquely situated to do something here in Long Beach that has not been done before.'",
        "'speaker_6': 'Having this conversation together in one room when. We're here all listening to each other, realizing that we have a stake in it.'",
        "'speaker_11': 'Imagine if the chief of police was held accountable, at least partly for graduation rates. What if the superintendent of the school district was held accountable, at least partly for the youth crime rate in the community? What if prosecutors were held accountable and were measured not by the number of convictions they secure of 18 to 24 year olds'",
        "'speaker_11': ', but how many? 18 to 24 year olds are moved into mentoring programs, job placement programs, job training programs, and actually come out better for what they had done for.'",
        "'speaker_12': 'Thanks. So. So, as you just heard in the video, there's obviously interest and much that can be done to help our young people have the opportunity to succeed in life. So a few things that you might have heard or might not have heard, but young adults make up for the last since it's the largest sector of of'",
        "'speaker_12': 'individuals in our city. And oftentimes, they're confronted by a set of conditions that have serious enduring costs for individuals, neighborhoods, businesses and our and public safety. So as Brant Cohen mentioned from the Department of Justice, Justice, while individual individuals between the age of 18 to 24 are considered adults.'",
        "'speaker_12': 'Research confirms that the brain development continues through age 25. So what this means is that young adults are more susceptible to peer pressure, risk taking, impulsive behavior and most and more likely to misread social, social cues and drastically overreact.'",
        "'speaker_12': 'And this can lead to activity that has dire long range consequences affecting their future ability to gain employment, complete their education, and pursue life goals. In terms of the workforce, the unemployment rate in Long Beach, residents age 20 to 24 is almost triple the unemployment rate for all people in the city of Long Beach.'",
        "'speaker_12': 'More specifically, between 20 and 24, it's 20.7% compared to the rest of our city at 7.7%. And that's significantly higher than California and U.S. averages at 16.9 and 9.6, respectively. Young adults are also more susceptible to violent crime.'",
        "'speaker_12': 'You heard the statistics there and and they're posted behind me. But half of the murder murder victims last year were between the ages of 1829. So despite these issues, I personally believe that Long Beach is well-suited to take on these challenges and make a lasting, positive impact on young adults for a number of reasons.'",
        "'speaker_12': 'We've been at the national forefront of violence prevention, as is evidenced by our selection as a participant in the National Forum on Youth Violence Prevention and the development of our safe Long Beach violence prevention plan. Our city prosecutor is a national leader on diversion and successful community based prosecution methods.'",
        "'speaker_12': 'Long Beach is home to over 70 community, community organizations, workforce and education partners who are ready and actively engaged already in increasing successful outcomes for disconnected young adults. And our Mayor and City Council have placed a focus on education and boys and men of color by becoming a partner in Long Beach College promise, as well as accepting'",
        "'speaker_12': 'President Obama's My Brother's Keeper Community Initiative. We've come a long way, but I think there's more that we can do. We have a significant opportunity to advance public safety, save valuable time and resources, and cultivate the human capital of our future by responding to young adults in more developmentally appropriate ways through education, workforce development and diversion.'",
        "'speaker_12': 'Everyone must have the access have access to education, workforce opportunities, the Promising Adults Tomorrows Hope Program or path. In short, which our city prosecutor Doug Halbert figured out on a napkin after racking my brain for two weeks, is in partnership with our city prosecutor Doug Albert's office and the Pacific Gateway Workforce Investment Board, and establishes two components'",
        "'speaker_12': '. The first is a workforce strategy that will strive to ensure that all disconnected young adults, whether justice involved or not justice involved, will have access to quality, workforce training, education, mentorship and supportive services. And then the second is really focused around diversion.'",
        "'speaker_12': 'So I'd like to ask our city prosecutor just to highlight a few points around the diversion aspect of the PATH program.'",
        "'speaker_11': 'Thank you. Councilman Rex Richardson. I want to thank the city council and the mayor for giving me this opportunity. Also, let me start by giving apologies to the chief of police. If he's still here, who's going to be sorry to hear that?'",
        "'speaker_11': 'In addition to all the other things he's measured by, he's going to now be measured by graduation rates within the school district. And I made that statement really to pronounce what is already happening here in Long Beach. At least in the short time that I've been in office, I've noticed the city of Long Beach is working together'",
        "'speaker_11': 'in a way they've never worked together before. I look at truancy, for example, as a indicator of future crime. So why does my office work so closely with the school district? Because we know that these things are not separate.'",
        "'speaker_11': 'They are connected. We are connected to each other in many ways as far as diversion goes. Many of you may know that the city of Long Beach has been a leader in diversion for many years. The Community Service Worker Program was started by my predecessor, city prosecutor Tom Reeves, who started a pre filing diversion program that allows'",
        "'speaker_11': 'persons who are cited for low level misdemeanor offenses, first time offenders. They're given an opportunity to perform community service in Long Beach in order to avoid having that citation filed in court. Now, the natural sequence of things is a citation.'",
        "'speaker_11': 'Is issued and filed in court, and often that results in a conviction on a person's record. A conviction often can lead to negative consequences that involve denial of financial aid harder to get employment. There are a number of things that follow a conviction.'",
        "'speaker_11': 'By having this pre filing diversion program. People in Long Beach are given an opportunity to clean out the wetlands. To help with beach cleanups and alley cleanups. They weed at the Martin Luther King Peace Garden. They help with the farmers markets throughout the city.'",
        "'speaker_11': 'They perform a number of tasks that help us get the city become more beautiful while at the same time avoiding a conviction and potentially facing jail time. That's one of the most successful examples of diversion here in Long Beach, but we've also championed a few others in particular this in this last year, we've created an anti recidivism'",
        "'speaker_11': 'class. We've also worked on a class focused on getting your driver's license back if your license gets suspended, because we've observed that a number of people will get a ticket if it's not paid the ticket results in their license getting suspended.'",
        "'speaker_11': 'If they get caught driving on a suspended license, they now could have 2000 or more dollars in fines. And they also don't have a license, which means if they drive to work, they're going to get potentially arrested, have their car impounded as well.'",
        "'speaker_11': 'So by helping them get their driver's license back, we're preventing future incarceration and we're preventing fines that then go unpaid and a number of other problems that result from the convictions. What I think is being proposed today is something that has not been proposed anywhere else that I'm aware of.'",
        "'speaker_11': 'I think Long Beach is well-situated, perhaps uniquely situated to do something that hasn't been tried anywhere, and that is to create a more comprehensive diversion program that actually moves people from a criminal justice system into a job path, a career path, a job training, a mentorship program that makes them better and helps them come out of the'",
        "'speaker_11': 'system better than they went into it. It's not going to be easy, but I think we're well-situated here in Long Beach. We have our own prosecutor's office, we have our own police department. We have a network of community based organizations that for years have been providing terrific services to the people here in Long Beach.'",
        "'speaker_11': 'And I noticed Jessica Canton is in the audience. She's one of those. And her organization has helped my organization and we've cooperated with them and collaborated with them in a way that nonprofits and prosecutors have not collaborated together in the past.'",
        "'speaker_11': 'So although we are a leader in diversion, and I appreciate the recognition for that, I think there's a lot more that we can do here in Long Beach. I'm excited to be engaged by the city council on this, and I look forward to working with every council member who I know has a sincere desire in their heart'",
        "'speaker_11': 'to make this work. And if it can work anywhere in the country, it can work here. Thank you very much.'",
        "'speaker_12': 'Thank you. Thanks. Thanks, Doug. So by making the cities criminal justice and workforce systems more responsive to the needs of young adults, we can change their trajectories for the rest of their life. And like. Like the life of myself and many others, we can make our communities safer and more stable for years to come.'",
        "'speaker_12': 'I want to thank Councilmember Price Andrews and you Ranga, for your support and co authoring this initiative. And I just wanted to add your input and some of that input has led me to just say say a brief thing about the potential fiscal impact of this.'",
        "'speaker_12': 'My motion tonight is just simply asking the city manager, our workforce board, as well as our city prosecutor, to come back and to go out and see if this is something that we can either find in our budget or something that we can seek through fully philanthropic or grant resources.'",
        "'speaker_12': 'And if it is, then I'd like to see it included in the next budget, and now will be the appropriate time to make a request as such. And you know, I received nothing but positivity from city staff in terms of their willingness to do the work and seeking something out for a cause like this.'",
        "'speaker_12': 'So that said, I'd urge the rest of my colleagues to vote in favor of this program. And thank you for your time.'",
        "'speaker_0': 'Thank you. Council Councilmember Tauranga.'",
        "'speaker_10': 'Thank you, Mary. And I want to thank Councilmember Richardson for inviting me to co-sponsor this bill with him this evening. Father Greg Boyle, the director of the famous agency of Homeboy Industries and in Los Angeles, has a has a famous quote.'",
        "'speaker_10': 'He says, Nothing stops a bullet like a job. And this is an opportunity for us to create jobs, for youth, to get them engaged in our communities, to make them viable citizens, and contribute to the growth and the wealth of Long Beach.'",
        "'speaker_10': 'So I'm looking forward to working with us, working this through, and also want to encourage my colleagues to support this item as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pratt.'",
        "'speaker_6': 'Thank you. I, too. First, I want to thank my colleague, Councilman Richardson, for bringing this item forward. That was an excellent presentation. So I want to thank him and his staff. That was just very professionally done. So, Shauna, congratulations to you two.'",
        "'speaker_6': 'That was just beautiful delivery. So thank you for that. And I want to commend our prosecutor. He's he's a leader on many things. And this the idea that you can make diversion, a successful program in the criminal justice system is something that not all prosecutors embrace.'",
        "'speaker_6': 'I will say that because I've been a prosecutor for 15 years, but I do think that where there is a willing partner, the accused, the defendant, the suspect, the wrongdoer or whatever you want to call them, when there is a willingness on their part to take advantage of the opportunity, which really is what diversion is.'",
        "'speaker_6': 'It's an opportunity. It's a gift to avoid a criminal consequence. And where there is that partnership and there has to be a partnership, where there's a partnership, diversion can be very successful. So, you know, as a prosecutor, I absolutely believe with with every bone in my body that people should be held responsible for the decisions that they'",
        "'speaker_6': 'make. Absolutely. And especially when the decision that they make impacts the life of another and someone else is victimized as a result of their decision. They should absolutely be held accountable to the full extent of the law. I believe that.'",
        "'speaker_6': 'I do believe, though, that we have an opportunity and a duty as a society to reach out as early as we can to the young people in our society and try to educate them about choices and opportunities. And I say that not just as as fluff, but for the last five years of my life.'",
        "'speaker_6': 'I speak every Friday to fourth, fifth and sixth graders in impoverished areas in the city, in the county of Orange. And I've been part of a program that does it every year, and I spend my lunch hours doing that on Fridays.'",
        "'speaker_6': 'And my goal has always been if there's just one child who walks away feeling inspired by my story, which a lot of people don't know, but it's an interesting path if there's just one child who believes that they even though they've had adversity, they can succeed and and make a life decision as a result of that inspiration'",
        "'speaker_6': 'or mentorship than we've succeeded. And we work in gang impoverished neighborhoods. Our entire program is focused on gang prevention and education and drug prevention education. So I think that trying to get to the youth is very, very important.'",
        "'speaker_6': 'And, you know, I.'",
        "'speaker_8': 'Fully believe.'",
        "'speaker_6': 'That people make bad decisions generally in life out of a place of insecurity or lack of self-confidence, that that really is what leads to people making bad decisions, whether it's the way they treat another human being or whether it's the decision to commit a crime.'",
        "'speaker_6': 'It really comes from a place of insecurity and lack of confidence. It's why we all lash out sometimes when we lash out at people, and it's why young people make bad decisions to join gangs or to get involved in criminal behavior.'",
        "'speaker_6': 'So. I think one way that you can give people confidence, you can tell them all day long that they're special and they can achieve anything they want in life. But one actual way that you can give people a sense of confidence is by allowing them to be successful in a job.'",
        "'speaker_6': 'Giving them the opportunity to learn a trade. Letting them have something that they can feel proud of. And so that's why this particular diversion program and this proposal is so interesting and intriguing to me, because it's beyond the community service, which I think is really great.'",
        "'speaker_6': 'We've actually utilized our city prosecutor's office and their community service programs in the third district, and I think that's a very valuable program. But I think that giving people something that they can be proud of is the number one.'",
        "'speaker_6': 'Preventative action that we can take to allow them not only to learn from the gift of diversion, but also for them to change their course in life. So I think that this is a really great opportunity. It's and I know the city prosecutor would agree.'",
        "'speaker_6': 'It's not every day you're going to have a prosecutor come out publicly in support of diversion. It's diversion has thought to be something that is necessary in light of prison overcrowding and in light of our our current criminal justice system.'",
        "'speaker_6': 'It's it's a it's kind of a a necessary methodology that we've utilized to clean out the courts. But diversion can be very, very beneficial and very helpful when there's a willing partner on the other side. And so I hope that we can utilize this program I'm very much in favor of.'",
        "'speaker_6': 'I know this is probably something that's going to cost money to the city. And I'm hoping and I would encourage our city staff and our prosecutor to look for grant opportunities because money is something that we don't have.'",
        "'speaker_6': 'But I think it's very important for us to invest in decisions that help our city. I mean, every item that we bring forward has some sort of cost attached to it. And I think it's important for us to evaluate how is this particular item going to benefit our city, how is it going to benefit our residents?'",
        "'speaker_6': 'And this has the potential for great benefit. So I'm hoping that there are other non general fund dollars that will allow us to fund this program and I support it 100%. The one thing I would ask the city prosecutor is, is there an opportunity for organizations such as the Conservation Corps to be involved in any of the'",
        "'speaker_6': 'job training opportunities? Because we have a strong partnership in the city with the Conservation Corps, and I would like to see them be included in this discussion.'",
        "'speaker_11': 'And to answer your question, absolutely yes. In fact, no organization, I think, is going to be left out of this discussion. I think they are very valuable participant and can provide a lot of service to a diversion program like what we're envisioning.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Andrew.'",
        "'speaker_13': 'Yes, thank you, Mayor. I first of all, I'd like to thank Councilman Richardson by allowing me to be a co-sponsor on this item and to hear our city prosecutors say that, you know what I think we got at this time?'",
        "'speaker_13': 'You know, this is one of the most important issues that I think I've done all year, because the fact that you guys realize what the night is all about, to me, it's like going and watching Cleveland and, you know, Golden State.'",
        "'speaker_13': 'But after I said this, I'm going to stay here and go through this. You guys, this is so important because you guys know, ever since I've been on this thing, all I talk about is jobs. And I know what you just said up there.'",
        "'speaker_13': 'Jobs can stop a bullet. This is so, so important to our young generation and the passionate that to secure the future for our youth. You know, last year, I create a similar program for youth with the Pacific Gateway and Long Beach Memorial Medical Center called the Heart Health Care Pathway Program.'",
        "'speaker_13': 'You know, the program was very successful with 25 youth and five of the youth were hired for employment in 15 of the youth decided to pursue a career in health care. You know, programs like this, it does work.'",
        "'speaker_13': 'And anytime you talk about jobs for our young future, you guys know that we're doing something. And I would not even want to think about what it costs money and not how can we put a price on our future?'",
        "'speaker_13': 'There is no price because look what we say when we do put that on our future. So, you guys, I cannot always think about building a future for you. You know, I use. But we can't prepare you for a future.'",
        "'speaker_13': 'So I want to thank you again, Rex, so, so much for this and for you, for the audience coming out. And, you know, at least here, not opinions. And I hope you guys totally support this item. And I want to thank you again.'",
        "'speaker_13': 'Thank you very much, Mayor.'",
        "'speaker_0': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_8': 'Thank you, Mr. Mayor. And I'm very excited about the program as well. Just from the budget procedure, I want to be sure that Mr. West does present whatever recommendations he has, especially if he's recommending any general fund impact.'",
        "'speaker_8': 'To me to go through the Budget Oversight Committee, I think that's that's the process. And so I don't want us to stray from that. And that's not a statement on how great this private project or program is, but it's just we need to stick to that process.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_6': 'Just want to say thanks to my colleagues for bringing this forward. We don't often talk about this demographic, this age group. I know a lot of you are already doing work, central chore. Many of you in the cereal community I'll be cap.'",
        "'speaker_6': 'There's so much that we're already doing and to collaborate with our city prosecutor and existing agencies is just wonderful and I hope we can see this through somehow. I mean, I know as many people mentioned, it does take a budget and so I'm sure we'll be looking at that and seeing what kind of great opportunities are available'",
        "'speaker_6': '. I know we'll be doing that very diligently, but this is wonderful work and I just hope that if it does come to fruition, that we we really publicize this as much as possible to give people this opportunity. Thank you.'",
        "'speaker_0': 'Thank you. Council Member Austin.'",
        "'speaker_9': 'Thank you very much. And this is a welcome agenda item. I'm glad we're having a conversation to deal with this very important age demographic in our in our city. I think it's often forgotten group. It's a group that has a very high unemployment rate and a lot of hopelessness right now.'",
        "'speaker_9': 'And I think, you know, we if we if we we focused like we're doing today, this with this and other efforts, we can certainly make a difference. I was most impressed with the the emphasis here and the mention of our partnership, our education partners with Cal State, Long Beach and Long Beach City College.'",
        "'speaker_9': 'Because I think the best type of a diversion program other than having a job because I was once in this age demographic with a job, and I think that kept me out of a lot of trouble. But the other other component is education.'",
        "'speaker_9': 'And I would like to see certainly a greater emphasis on education because our community college system is a great resource here to to to put young people on a path to success. And so I did have some questions and I do appreciate Council Vice Mayor Lowenthal the attention to the process here, because I think we need to'",
        "'speaker_9': 'stay stay on process and not divert from that. This would be a programmatic cost and we say program. It means whatever we do to fund it. If it's a grant, if it's a general fund, it's going to be ongoing.'",
        "'speaker_9': 'And so that that that needs to be taken into consideration. And it would be a significant commitment. And I think we should be prepared to make that commitment, but allow the city manager and city staff the latitude to to figure that out.'",
        "'speaker_9': 'The the question I had regarding the position of the Youth Diversion Coordinator in this, and I guess it would go to the city city attorney or city prosecutor, how would that rule differ from would they be coordinating the CCW program and the anti recidivism program you have in the driver's license program?'",
        "'speaker_9': 'What above that? What else would they be doing?'",
        "'speaker_11': 'Well, certainly. Well, the discussion tonight is purely conceptual. I think one of the things you want to do is actually have a vision before you go out and seek grant funds. So as far as specifics of who would do what and what role they would serve, and none of that has been decided yet.'",
        "'speaker_11': 'And if the council isn't interested in us moving forward, we wouldn't even go to the point of trying to decide how we would formulate it. But I think tonight's a discussion about the concept and later on we can decide how that would actually function within my organization.'",
        "'speaker_11': 'We may have to move things around. We may combine what we do with CCW into a larger diversion program. And there are other organizations that may want to partner with us that may be able to provide services as well.'",
        "'speaker_11': 'So at this point, I don't know. This is more of a conceptual discussion.'",
        "'speaker_9': 'Okay. So so that that is what I kind of glean from this, that this was kind of open ended and we have the blink chalkboard to kind of create a position and create a role coordinating with your office in Pacific Gateway, is that correct?'",
        "'speaker_9': 'Through your office, through Cathay Pacific Gateway as a partner.'",
        "'speaker_11': 'Think this discussion would, after tonight's vote would result in my office meeting with the city manager's office and then approaching Pacific Gateway. But I don't think anyone has approached anyone yet, so we haven't even started that part of it.'",
        "'speaker_9': 'Let me let me just say I'm going to support this because I think it's necessary. And again, I do appreciate the fact that we are having this conversation to deal with this important demographic. As many of you know, I have put forth in my my district office resources to to to focus on this group through our Peace'",
        "'speaker_9': 'League that that is in its third season, second year. We're dealing with 40 or 50 young individuals who are who fit this this age demographic and addressing many of the same same areas of concern here through that process.'",
        "'speaker_9': 'And and I would love to see some of that program and other programs that are currently doing that addressed in this as well. So thank you very much. I plan to support.'",
        "'speaker_0': 'Thank you, customer.'",
        "'speaker_10': 'Thank you. And I just want to make one last observation about this. The city council often gets criticized for the fact that they travel to conferences or they attend seminars or they go somewhere outside the city to learn something new.'",
        "'speaker_10': 'This is one of those instances where our council member went. To D.C.. Attended a conference. Attended a workshop. Learn something valuable, brings it back to this city, reports on it, and comes up with this idea. And Councilmember Richardson, I want to applaud you for being engaged in in your job, for being for being responsible, for being attentive'",
        "'speaker_10': ', and for more importantly, bringing back the valuable information that you learn when you are out of the town. Because it's the present, not out of the town. Out of town that's out of the town. And out of town are two different things.'",
        "'speaker_10': 'But that you bring this positive program back to us. And I hope that in the end, we are able to. Adopt something that's going to be working for our community. Thank you.'",
        "'speaker_0': 'Councilor Richardson.'",
        "'speaker_12': 'Thanks. And and so, again, I want to thank all the council for their comments and just reiterate that, you know, this the intent here is to really give great flexibility to city staff, to our prosecutor, and to Pacific Gateway so that we can find something that works.'",
        "'speaker_12': 'I don't think that the finer details should be hashed out here at the city council. I think that we have experts and they've been working together for a long time in terms of our content public safety continuum as we see at City Council during the budget discussion in our city prosecutor.'",
        "'speaker_12': 'And and so I would say that this the intent is that conceptually this is where we want to go to particular focus is diversion and a young adult workforce strategy to particularly focus on disconnected out of work young adults.'",
        "'speaker_12': 'The funding I think we'll figure out I think we're pretty confident that we could sort that out. And then just the comment on the education piece, so on the item, it says combining occupational training, life skills development, mentoring, job placement and post-secondary education as an alternative to criminal prosecution.'",
        "'speaker_12': 'So that would include Long Beach, City College, Cal State, Long Beach, any of the educational institutions that might want to be part of this. And I would imagine there are a number of degree completion adult education centers that might want to be part of this.'",
        "'speaker_12': 'So this is sort of us making an affirmative, affirmative step in the right direction. Thanks.'",
        "'speaker_2': 'The mayor let me know I was going to be next. Thank you for bringing this item forward. I'm really glad that the Workforce Investment Board is going to be a part of this because these are the standards that can be built into the federal grant we already receive from Workforce Investment Act.'",
        "'speaker_2': 'And so I hope that. I can't think of a next last name right the second, but that he'll build that into his budget because we all know what tough budget times we're facing. And so it's going to be really important to better utilize the nonprofit organizations that we partner with to ensure that these things are getting handled'",
        "'speaker_2': '. It doesn't necessarily mean that we need a staff member inside the house of the city. Sometimes our community partners are even better at the things that that they do. So I'm supportive of this item and thank you for bringing it forward.'",
        "'speaker_2': 'It was great to participate in the discussions in D.C..'",
        "'speaker_0': 'Thank you. There's a motion and a second before we vote. Is there any public comment before we vote? Okay. Come forward, please.'",
        "'speaker_2': 'Good evening, Honorable Mayor Garcia and council members and staff. Thank you. My name is Wendy Nichols. Julian, I'm honored to serve as the executive director for the California Conference for Equality and Justice. You don't see us here very often because we don't really do a lot of politicking.'",
        "'speaker_2': 'We do a lot of program work. But this project is near and dear to our heart and our mission of eliminating bias, bigotry and racism through conflict resolution, education and advocacy. I'd like to ask before I start, if just everybody who's in the audience still, who's here to support the PATH program, if you could stand so you'",
        "'speaker_2': 'can see how many people came out to support this. So CCG has been serving and located in the city of Long Beach for over 52 years. I've worked in the city of Long Beach doing work with disconnected youth for for 15 years.'",
        "'speaker_2': 'I'd like to ask you to support the PATH program as a proposal. That's a really big step in the right direction. It's the right step in the right direction from the perspective of an agency with a mission to eliminate bias and bigotry and racism, because we are focused on looking at systemic issues that particularly impact youth of'",
        "'speaker_2': 'color. And certainly the criminal justice system is one of those. The obstacles to success for disconnected youth and young adults in Long Beach are systemic and they're real. One of the systematic problems is the way that we deal with people when they have committed crimes.'",
        "'speaker_2': 'You heard about brain science, but common sense also tells us that young people make mistakes. The good news that you maybe didn't hear about the brain science is that also means that youth brains are more susceptible to rehabilitation.'",
        "'speaker_2': 'This effort is a way for youth who commit misdemeanors to be held accountable for harm that they've caused. And CCJ is here to offer those services which were funded to be able to provide around holding youth accountable and being able to help address the harms that are caused.'",
        "'speaker_2': 'If that's a part of the program, we're willing to support the PATH program and very excited about the the potential collaboration between Big Win, Pacific Gateway and the prosecutor's office. Youth need to have an access to education. They need to have access to services and mentorship.'",
        "'speaker_2': 'And they don't need to have records that haunt them and create a barrier to success. And we believe that the PATH program provides them with a shot at education and employment. I'd like to also share with you that Pastor Gregory Sanders was here earlier and had to go to serve on an alliance committee.'",
        "'speaker_2': 'But he asked me just to share a couple of words, which is that as many of you know, he's committed to shifting the culture. Picture me and my bow tie and green glasses. He's committed to shifting the culture of our community by revisiting the long term consequences of disproportionate incarceration.'",
        "'speaker_2': 'He believes there is a benefit in substituting education for incarceration because no one is disposable. Let us, as a city, create a model of transition from young adults to adulthood that's reflective on their ability to rationalize their choices.'",
        "'speaker_2': 'Youth are worth investing in. The next generation is worth it. Thank you.'",
        "'speaker_0': 'Thank you. Speaker.'",
        "'speaker_1': 'Good evening. Mayor Garcia, Vice Mayor Lowenthal, city manager, members of the City Council. My name is Jessica Quintana and I'm the executive director of Central Cha, also a long, lifetime resident of the city of Long Beach. Very proud.'",
        "'speaker_1': 'Go Beach. So as you may know, Central Asia is a nonprofit organization. We've been providing job training, workforce development, higher education opportunities to our young men and women, specifically of color here in the city of Long Beach for over 14 years.'",
        "'speaker_1': 'We have been a consecutive partner of workforce development for the past 14 years. So what I'm saying here to you today is that this evidence based practice that our councilmember has brought to the council today works. We have over a thousand stories of success transforming the lives of our young men and women here in the city of'",
        "'speaker_1': 'Long Beach, helping them to go on to graduate high school, helping them with their FAFSA applications, go on to post-secondary education, helping them to become and understand what the role of a young man is in our community and what the role of our a young woman is in our community.'",
        "'speaker_1': 'And so we want to thank our Workforce Investment Act, Nick Schultz and his team, because, you know, they have been a true partner of our community based organization. They understand the importance of job training and workforce development. And I want to especially thank Councilman Richardson for bringing this here and and all the council members, because, you know'",
        "'speaker_1': ', making a trip to D.C. and really understanding what is happening at the federal level really helps us here at the local level. And bringing this to work and being very bold really furthers our work as a community based organization, working in the forefront with our families and communities.'",
        "'speaker_1': 'Here is a challenge. You know, we we have a great, wonderful city, but we all need to understand and recognize we have very impacted communities. And so a lot of our young people are facing a lot of barriers to employment and education.'",
        "'speaker_1': 'So it's important that you all, as decision makers and stakeholders who have the ability to make change in our community and really take on an initiative like this is very bold and it's really helping our kids face forward and really get the hope and the help that they need.'",
        "'speaker_1': 'And I'd like to lastly say to our city prosecutor, Doug Talbot, which actually he should be Doug Kennedy, because he really does have a kind heart, you know. And so we have been able you know, we've me and Doug have had many conversations, you know, in regards to our youth.'",
        "'speaker_1': 'And what I can tell you is, Doug, you know, really in the end wants to help, you know, our youth in the city of Long Beach. And I think we are measured by the number of youth that we don't put into the criminal justice system, because we've had a high number, an incident number of really incarcerating our'",
        "'speaker_1': 'young people and adults in the city of Long Beach. And so that really needs to change. And so I think that I'm really confident also that it's time. And I think that, you know, the state of Washington is standing up and looking at Long Beach.'",
        "'speaker_1': 'And I think it's time that we bring those federal dollars, those state dollars to our community and really make a difference. We're very lucky to win $1.5 million of the face forward Department of Labor dollars to the city.'",
        "'speaker_1': 'And we're the only organization in the whole western area who won that grant because of the great work we were able to do and because of the great partnerships with the city and our city prosecutor's office and our health department.'",
        "'speaker_1': 'And I've seen Susan up here somewhere, but maybe she left already. But, um, so again, I just want to thank you so much. Our youth are here today. You'd be surprised. A lot of our youth were in our workforce investment programs from 2005 2004.'",
        "'speaker_1': 'They went on to lobby City College. They went on to Cal State, Long Beach. They worked for central China. So those are the commitments you got to make when you have these young people come through your organizations and they say, I want to work at Central Asia, but it's like you have to go to school, you have'",
        "'speaker_1': 'to complete. And they made it and they did and they came back. And so you'll see a lot of our case managers.'",
        "'speaker_3': 'Thanks to you. And I know.'",
        "'speaker_0': 'I'm letting you go a little bit over because you have a big group with you. So I appreciate.'",
        "'speaker_1': 'That.'",
        "'speaker_0': 'And I know I appreciate you consolidating. So so we've got to wrap it up.'",
        "'speaker_1': 'And we have our case managers who are who are very, very experts in what they do. And you'll see them running around with youth in their cars, taking them to job training and and working with our Long Beach City College and our construction training program and also in the court system, really representing our youth to divert them'",
        "'speaker_1': 'to make sure that they have opportunities and hope in our community. So thank you for your time. Thank you, Councilman Richardson, for putting this well forward. Thank you all council members for all what you do. And Doug. Thank you so much.'",
        "'speaker_0': 'Thank you very much. Thank you guys for coming. Next speaker, please.'",
        "'speaker_2': 'Good evening, Mayor Garcia, vice mayor and city council members. My name is Maryanne Drummond. I'm a math teacher in Long Beach Unified School District. And I've been to I'm very much for this measure. I have volunteered for with CCJ for six years as a facilitator in the Building Bridges program and as a recruiter at Wilson High School'",
        "'speaker_2': 'for Campers. Over the years, I've had a lot of students who and certainly we take all different, uh, kids, but we have every year kids who go to camp, who have, are regularly truant, have low grades, um, and are heading toward bailing out.'",
        "'speaker_2': 'And every year after attending a camp, I witness these students have oftentimes some of the biggest turnaround in attitude in plugging in to school and making grades in in participating and then in returning to school to for training to become youth leaders and youth mentors.'",
        "'speaker_2': 'Really embracing the power of positive leadership and. So. And they learn human relations skills. They learn to become more connected to their community. They learn mentoring and training and camaraderie. And they become great volunteers. I've seen many a life path redirected through the programs that CCE does.'",
        "'speaker_2': 'And I guess I'd just like to stipulate that when we have groups like CCJ and so many in this city that together putting all of that power together to we can this can culminate into an incredible.'",
        "'speaker_7': 'Think in my opinion.'",
        "'speaker_1': 'So thank.'",
        "'speaker_8': 'You. Thank you. Hi. Good evening, Vice Mayor. All of the council, I. Councilman Richardson, I am so. My name is Dr. Jane Galloway from the third district. I am so excited about this measure. Our city prosecutor. This is such a visionary idea.'",
        "'speaker_8': 'I feel like I'm dreaming this because I've been working on the arts as intervention for at least 25 years. So I was actually not going to say anything tonight. But I think the fortuitous juxtaposition of all of these artists coming in here to talk and then this wonderful measure brings these things together.'",
        "'speaker_8': 'So I just want to plant a couple seeds. First of all, arts, diversion, brain development, multiculturalism all go together in a wonderful pot.'",
        "'speaker_7': 'The arts build.'",
        "'speaker_8': 'Different neural pathways, turn antisocial behaviors into pro-social behaviors, create visions for the future. So part of the workforce development can actually be through the arts and can also bring revenue in through this program. So I really just want to advocate for thinking about linking these two ideas that came up this evening.'",
        "'speaker_8': 'For a long time. I was a professional actress for 30 years. I actually got a scholarship, a Screen Actors Guild mid-career scholarship to get my doctorate. So the arts are I made a wonderful living doing that and now I have a whole other career.'",
        "'speaker_8': 'But what I wanted to say was this The movie industry is one of the largest exports of California, of the state of California, economic exports, post-production facilities, editing. All of the stuff that goes into putting a film together are perfectly linked in with this computer skills of the younger generation.'",
        "'speaker_8': 'They are a wonderful livelihood, very creative work. Also help people really learn to edit. We learned to edit our futures right by the choices we make. So I would say let's partner with the movie industry. Let's partner with people to bring funds in to really create careers.'",
        "'speaker_8': 'It's great to go to the farmers market. It's great to go to all this other stuff. I think this could be such an exciting program to really also bring the arts community and bring this wonderful work of diversion.'",
        "'speaker_8': 'I have worked with kids in this demographic for so many years and watch terrible tragedies and some wonderful successes. I'm very excited about this work. Thank you so much for bringing this forward. Thank you.'",
        "'speaker_13': 'Well, good evening.'",
        "'speaker_11': 'Honorable Vice Mayor and.'",
        "'speaker_12': 'Esteemed City Council. My name is Steve Neal. Address is on file. I would like to rise in favor of this item. I think this is one of the most innovative and creative things that I've seen come out of this council in some time.'",
        "'speaker_12': 'I had the fortune of hosting this event last week with our city prosecutor and the council member and the Children's Defense Fund. And the conversation that I was privy to has potential to be really groundbreaking. City Prosecutor Prosecutor Howard mentioned how long beat has the ability to do something that has never been done?'",
        "'speaker_12': 'I personally believe by going down this path, you positioned the city, the region to be in line for some federal assistance and federal dollars because this is very creative and innovative. I stand before you today as a member of the Ministers Alliance.'",
        "'speaker_12': 'We pledge our support to work with whomever and in moving this agenda forward. I also had the privilege of seeing Council Member Austin's Diversion Basketball League, and you're absolutely right, those gentlemen fit into this demographic. And if there's ways that we can produce opportunities to find work, to find career paths, to ply.'",
        "'speaker_12': 'The ability to change people's lives, I think goes a long way. I want to commend the author and all of the coauthors. You know, a few years ago, I took a fly on a young man that fit into that demographic.'",
        "'speaker_12': 'And today sits before you as a council member. So and believe me, he had some rough edges at that time. So folks do change and become positive influences in the community. And I just think this is a wonderful path to venture down and I hope that you guys will all support it.'",
        "'speaker_12': 'Thank you very much.'",
        "'speaker_8': 'Honorable Vice Mayor and City Council. My name is her Linda Chico, and I'm the board president for fostering a change. And this is Jennifer Elko, the executive director of Fostering a Change. And we're in complete support of the PATH program, fostering a change as a privately funded nonprofit that helps young women who are ages 18 to 24'",
        "'speaker_8': ', who've been aged out of the foster care system, and we help them with housing and resources and programs. And one of the components of that is trying to connect them with job opportunities, and that has been a challenge.'",
        "'speaker_8': 'So it's it's wonderful to see this this conversation happen. I think another very important statistic to remember, I hope you remember this, is that more than 70% of penitentiary inmates have spent time in the foster care system. And so that is incredibly important when we're talking about diversion programs.'",
        "'speaker_8': 'So we are in complete support. I want to thank Councilmember Rex Richardson and and the coauthors, council members of Price and Andrews and Suranga for bringing this forward. And then especially to our city prosecutor, Doug Halbert, who continuously looks for ways to help those who are most vulnerable in our community.'",
        "'speaker_8': 'And we really do appreciate that. So we look forward to partnering and helping in any way that we can to help our youth get on the right path. Thank you. Next speaker, please.'",
        "'speaker_1': 'Good evening, Vice Mayor, City Council, city.'",
        "'speaker_2': 'Staff and community members. My name is Joanna Diaz. I'm here representing Greater Long Beach.'",
        "'speaker_7': 'Interfaith Community Organization.'",
        "'speaker_2': 'ICA. I just wanted to say thank you to Councilman Richardson for presenting this. I'm really excited and I believe we're really excited to to hear the support here.'",
        "'speaker_7': 'Where we're a nonprofit organization.'",
        "'speaker_2': 'Grassroots organization that's been working with our communities to act on their faith values and also to become more civically engaged. We feel this is an amazing opportunity. I did a lot of work on Proposition 47 that allows individuals to have second chances.'",
        "'speaker_2': 'So this is something that our community is looking forward to, right? Being able to prioritize those opportunities for our youth, for our community members as a whole, to be able to prioritize education over incarceration. Right. Also, along with our school system right now, I think it's an amazing.'",
        "'speaker_1': 'Opportunity to be able to.'",
        "'speaker_2': 'Kind of navigate away from some of that more militarized approach in some of our schooling. But I think it's an amazing opportunity to look forward to hearing some more of the details of the funding and some more of the logistics coming up.'",
        "'speaker_2': 'But I just wanted to say thank you. We're really excited and I'm all for this arena.'",
        "'speaker_8': 'Thank you. Thank you.'",
        "'speaker_10': 'Hello. My name is Alexander.'",
        "'speaker_12': 'I'm from the city of Long Beach and I represent Central Asia. At first I didn't know programs like this existed. And personally, I just want to say.'",
        "'speaker_11': 'It's good that we all deserve a second chance and that they're taking students that make bad choices and want to change their.'",
        "'speaker_13': 'Life around.'",
        "'speaker_12': 'And I'm going to have to, um, go ahead and disagree with Susie said.'",
        "'speaker_11': 'Because she said there are choices already made. And I just want to say she she knows she's never been into our shoes and what we see daily in.'",
        "'speaker_3': 'The in our daily basis. And. I just want to say thank you, guys.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_4': 'Thank you much. My name is Dr. Leon Wood. I am the president of Success and Challenges, and I wanted to express our full support of this PATH program. We have. A large number of young African-American males in my city who are failing in school, who are not attending college, are dropping out.'",
        "'speaker_4': 'A program such as this will re-energize the community, redirect the youngsters and give them a chance and move them forward. The age of 18 to 24 is a very critical time in the life of African-American men at this time.'",
        "'speaker_4': 'Opportunities are not available to them. What our council was trying to do is bring some opportunities to the city to change the paradigm, to change how they lived, the change the the scope for their future. And so I fully support and you have the full support of success and challenges.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_8': 'Thank you. And I want to thank the speakers for coming in support of the program. I think several of us have worked with diversion programs and and Alexander, I just I wanted to assure you that. That statement about the choices being made wasn't about the students that are involved in the process.'",
        "'speaker_8': 'It's just sometimes that choices are made for you that you had no control over. I think that's what the comment was, but I'm glad you cleared that up. We in agreement with you and the fact that you participate in a program like this tells us that despite the destiny that was handed to you, you are changing the'",
        "'speaker_8': 'course of that destiny. And that's what Councilmember Price, his comments were intended to convey. Thank you. With that, there's been a motion and a second is there's no further comment on the side of the dais. Members, please cast your vote.'",
        "'speaker_8': 'I mean. Yes.'",
        "'speaker_1': 'Motion carries nine zero.'"
    ],
    "Resolution to Approve Revenue Bonds for Springdale West Preservation Limited Partnership.": [
        "'speaker_8': 'Item 17.'",
        "'speaker_1': 'Item number 17 Report from Financial Management and Develop and Development Services Recommendation to receive supporting documentation into the record regarding the Tax Equity and Fiscal Responsibility Act. Public Hearing and adopt resolution approving the issuance of relevant revenue bonds to benefit Springdale West Preservation Limited Partnership in an amount not to exceed $80 million.'",
        "'speaker_1': 'District seven.'",
        "'speaker_8': 'There's been a motion and a second councilmember your UNGA or Austin would you like to.'",
        "'speaker_10': 'Thank you, Mayor. First of all, I want to thank city staff for preparing the team, for hearing today's vote, especially important because it will allow us to continue to offer affordable housing at Springdale, West and west Long Beach, while bringing property upgrades to the residents such as landscaping, new kitchen appliances, countertops, canned cabinets, fencing, painting, water heaters'",
        "'speaker_10': '. All of these are very important to raise the quality of life in the Springdale housing area, and I would really want to encourage your support of this.'",
        "'speaker_8': 'Council member, Austin.'",
        "'speaker_9': 'I think that Motion Council member, I think said it best.'",
        "'speaker_8': 'Council member super or not.'",
        "'speaker_4': 'Yes. I just had a suggestion. I noticed in the discussion that newer kitchen appliances are included in the rehab. And I just wondered if Senate Bill 88 might apply, and that is assistance for low income residents to purchase energy efficient appliances.'",
        "'speaker_4': 'Maybe the developer can exempt sales tax and use tax from the appliances in the modernization, since the property will be designated as low income housing for the city's housing element.'",
        "'speaker_2': 'Vice Mayor and members of the City Council. We did discuss this with the developer representative and unfortunately AB 88 requires that the local public utility purchase the appliances in order for them to qualify for this. And in this instance, the local public utility is not purchasing those appliances.'",
        "'speaker_2': 'So the project does not qualify.'",
        "'speaker_8': 'For for that. Is that it, Councilmember? Yes. Okay. Thank you. There's been a motion and a second. Is there any member of the public that wished to address the Council on item? 17. Seeing nine members cast your vote and I'm a yes.'",
        "'speaker_1': 'Councilwoman Mango. Thank you. Motion carries nine zero.'",
        "'speaker_8': 'Item 18.'"
    ],
    "Grant Application for HUD Homeless Assistance Program.": [
        "'speaker_1': 'Item 18. Report from Health and Human Services. Recommendation to authorize the City Manager to submit a grant application to the U.S. Department of Housing and Urban Development for the 2015 Continuum of Care for Homeless Assistance Program Citywide.'",
        "'speaker_0': 'There's been a motion in a second council for Austin.'",
        "'speaker_9': 'I move in urging your full support on this. This is something that we have been involved in for many years. And this grant will help. You know, several homeless folks with services.'",
        "'speaker_0': 'Councilmember Gringa.'",
        "'speaker_10': 'Ditto.'",
        "'speaker_0': 'Counsel a supernova. Clear you. Now you're clear. Okay, so we have a motion and a second. Any public comment on the item? CNN, please cast your votes.'",
        "'speaker_1': 'Vice mayor. Councilman Price. Motion carries nine zero.'",
        "'speaker_11': 'Mr. Mayor. Yes? Councilmember Kelly, call if you would like to make a quick introduction.'",
        "'speaker_0': 'For item 18, the one we just voted on. Yes. Okay.'",
        "'speaker_3': 'If she wants it, she wants.'",
        "'speaker_8': 'Just an introduction.'",
        "'speaker_0': 'She wants to make some comments about item 18. So let me just. Okay, go ahead.'",
        "'speaker_7': 'Sorry. I just thought I'd just like to make an introduction.'",
        "'speaker_8': 'Mayor and council members. We have our new homeless services officer here in the audience, Theresa Chandler. So if you see her out and about, please let her know. Please like who say hi, welcome her and know that she's out working in our community.'",
        "'speaker_0': 'Welcome to Long Beach and welcome. Oh, actually not. You know, you're part of the Long Beach family already, but welcome to your new role. So thank you. Next item. Oh, Councilman Superdome.'",
        "'speaker_4': 'I was just going to say she's already been out in the community. And thank you for attending our our community meeting last week. And just one other item, that path is involved in this item, and that's people assisting the homeless.'",
        "'speaker_4': 'The same acronym as the last group that presented it. But they're different groups.'",
        "'speaker_0': 'Thank you. Let's move on to item number 19.'"
    ],
    "Contract Award for Bixby Road Rehabilitation Project.": [
        "'speaker_1': 'Item 19 Report from Public Works and Financial Management. Recommendation to Award a contract to Sally Miller Contracting Company for the rehabilitation of Bixby Road between Atlantic Avenue and Orange Avenue for a total contract amount not to exceed 819,958 District seven eight.'",
        "'speaker_0': 'Thank you. Count Summary Ringa.'",
        "'speaker_10': 'Thank you, Mary. And I want to thank Ara for bringing this forward. It's a street that so highly traveled and greatly in need of repair. And I want to thank the public works for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilmember Austin.'",
        "'speaker_9': 'I also want to thank our public works department for their diligence. This has been in the works for for now, about two and a half, three years. We're excited about a Bixby Road being repaved between Atlantic and Orange.'",
        "'speaker_9': 'I did have a question for a public works director in regards to the timing of this project. When do we expect to get started on this project after our vote this evening? Honorable mayor, honorable councilmembers, Honorable Austin. Based on our conversations, you indicated that there is a there's a two schools in the vicinity.'",
        "'speaker_9': 'So our goal is to start in July and finish before school starts in beginning of September, end of August. So we're going to do our best to start and complete this project within that time period before the school starts.'",
        "'speaker_9': 'Well, Mr. Moulin, I do recall that conversation, and I'm glad that we have it on record that those are two extremely busy schools, Hughes and Longfellow. What I would think a combined about 3000 students. And so it's a very heavily traveled street and so hopefully we can get that done before the school year.'",
        "'speaker_9': 'Thank you so much. Yes, thank you. And I will. We'll get it done.'",
        "'speaker_0': 'Any public comment on the item? There's been a motion, a second seeing analyst castro votes.'"
    ],
    "Contract Award for Shoemaker Bridge Replacement Project Design Services.": [
        "'speaker_1': 'Councilmember Richardson Andrews. Okay. It's. Motion carries 7 to 20. Item 20. From the Office or Department of Public Works and Financial Management. Recommendation to award a contract to HDR Engineering for Engineering and Architectural Design Services for the Schumaker Bridge Replacement Project in an amount not to exceed 4,000,700.'",
        "'speaker_1': 'Districts one and two.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_6': 'I want to first think that the dynamic threesome over there, which is are a million Derek Leask and Keiko Andersson for their very hard work on this project. I know every meeting we talk regularly about the updates for Shoemaker Bridge, and I'm always asking for updates and they're always gladly providing that.'",
        "'speaker_6': 'So I really want to thank your diligence in your hard work. I truly mean that in all of this. This has been a long time in the making, and I know that we're finally here at one point. And it's a it's a very large priority for the west side of the city and also for the district residents'",
        "'speaker_6': 'in the first district. I know the more that we connect and redesign the bridge to the park project, this will greatly benefit and contribute to the sustainability for our downtown and West Side residents. As I mentioned, for many reasons for safety, beautification and functionality, including green and open space, bike patters, bike and pedestrian paths.'",
        "'speaker_6': 'And and, you know, I couldn't be more proud of this project and what it will become hopefully done in the future. And I know this is only about a third, about 30% of the funding needed for the design portion.'",
        "'speaker_6': 'But we're looking for future collaborations with the public with public works and our government affairs director who's been wonderful as well, donating to find other funding streams. I know we went to D.C. a few months back to the Department of Transportation.'",
        "'speaker_6': 'We talked to them about what we could do. And I also want to think I would be remiss if I think or mayor as well, because he's the one with all these great ideas. And so I'm kind of finishing the times of great ideas.'",
        "'speaker_6': 'Yes. And so it's great to have that collaboration. So thank you very much for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilmember Ringa.'",
        "'speaker_10': 'Yeah. There's also been a lot of discussion and the 710 committee that both leader and I said, well, you I used to sit on it. Lena sits on it now. And it's very important not only for the community of Long Beach in West Palm Beach, but also for the lower end of the 17 freeways as it transitions'",
        "'speaker_10': 'into the city. So looking forward to this development, finishing up. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_9': 'Yes, I'm in full support of this. And also, I sit on the Gateway Cities Caucus of been a priority of that body as well. I did have a question. I know this is the initial study will be will be used with the funding with early action funds.'",
        "'speaker_9': 'And I wanted to know from Derek if if other early action items would be funded in this first round as well.'",
        "'speaker_12': 'Mayor, members of the City Council Council member Austin.'",
        "'speaker_0': 'Currently Shoemaker.'",
        "'speaker_11': 'Bridge Replacement Project is one of two funded early action projects. We anticipate more in the future as funding becomes available. There is 590.'",
        "'speaker_12': 'Million available over a 30 year period for the 710 corridor early action projects. However, the majority of the funding.'",
        "'speaker_11': 'Is in the what they call the second decades, which starts in 2019 is the second decade, and we anticipate a large chunk of funding at that time.'",
        "'speaker_9': 'Okay. I know that the the sound walls along the 17 Metro Blue Line near Los Cerritos were part of that early action request. Is that in the first decade or second decade?'",
        "'speaker_11': 'That's an excellent question. Let me be clear. The two projects I just mentioned are the two where the city of Long.'",
        "'speaker_12': 'Beach is the lead agency. The other early action project that is very important to the city of Sound Wall, but currently Metro as the lead agency are the sound wall projects. Those are broken up into freeway and non freeway sound walls.'",
        "'speaker_12': 'Council Member We've talked about what they call the non freeway sound walls in your district.'",
        "'speaker_11': 'The currently we're still in the inverter. Metro is still in the.'",
        "'speaker_12': 'Environmental phase and they anticipate that the actual design process will begin this year and construction is anticipated to begin as soon as funding is available within the next two years.'",
        "'speaker_9': 'Thank you for that clarification. Just just to compliment on Derrick's comments, there's a total of $10.8 million dedicated for the design of the sand walls for the entire corridor. But the most of the sand was in the city of Long Beach.'",
        "'speaker_9': 'So hence the city of Long Beach will benefit from majority of these sand walls. And as soon as a 710 environmental document is released, then the boundaries of the sand walls will be will be clear at that point, and then they can finish the design and the construction immediately following that.'",
        "'speaker_9': 'That's welcome news to many of our residents. Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Supernova.'",
        "'speaker_4': 'Yeah. A question is brought up about the support structure for the new bridge. And would you have to take out the old bridge to accommodate for that? I guess it relates to maybe displacement of water or impeding the flow of water.'",
        "'speaker_4': 'And do you have a response to that?'",
        "'speaker_9': 'Absolutely. I have a small presentation if you have the appetite for it at this time, but we have a part of our design is to repurpose the existing bridge. And because of that we're going to leave the existing bridge in place and modify the, I would say, the West End to allow for a bike lane to connect'",
        "'speaker_9': 'the east side to the west side because of that and also because of army course requirements that hydro hydraulic calculations have shown that putting anything in the river will increase the hydraulic grade line or will cause the water line to exceed its that the dam at this point.'",
        "'speaker_9': 'So we probably will have to design a bridge that is a simple span spanning the entire span of the river without any supports. So even if the existing bridge remained or it did not remain, the new bridge had to be designed to be spanning over the entire span of the river.'",
        "'speaker_9': 'But also, if we want to have a signature bridge, we do want to have some kind of a stay cable state design that will be a signature to the entrance or the exit to the city at that point.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Or did you have any anything that you wanted to show the council briefly on?'",
        "'speaker_9': 'I have a presentation. It depends if you want to see it or not. If there are any questions, we can answer it. That's amateur. We'll in pleasure. And you have the presentation at your disposal in front of you.'",
        "'speaker_0': 'Okay. So I think, Councilman, did you did you want to go through.'",
        "'speaker_6': 'There's just some highlights that you'd like to point out just to get the the.'",
        "'speaker_3': 'What?'",
        "'speaker_0': 'Okay. Why don't you briefly go through it? I know it's a project of significance, so you can just take the council really quick through it.'",
        "'speaker_9': 'Absolutely. Oops. Okay. This is basically a site plan that shows the location of the project in reference to the overall IE 710 corridor and specifically the location of Shoemaker Bridge. This aerial photograph shows the location of the Shoemaker Bridge in reference to the other bridges, the Anaheim Bridge and Ocean Boulevard Bridge.'",
        "'speaker_9': 'As you can see, this is the third bridge from the mouth of the river. And it's. And it said the next slide will give you a little bit more history. This this bridge was designed and constructed and opened in 1959.'",
        "'speaker_9': 'It was the longest bridge span in that time. It was named after the chief harbor engineer, Robert R Shoemaker. And it connects the 710 to downtown Long Beach. This bridge is approximately 1300 foot clear span. The new bridge will be 1300 foot span spanning over L.A. River.'",
        "'speaker_9': 'It's 200 foot longer than the Gerald Desmond Bridge. I'm having some technical difficulties. Here we go. In 2000. In 2000, US City of Long Beach got into a milieu with the CTSI. Basically, the decision was at that time to relinquish the Tie Freeway to City of Long Beach and Caltrans will take over the the ownership of Shumaker'",
        "'speaker_9': 'Bridge. Deserve comparison between the I7 ten. The purpose and need and compare the shoemaker. Basically, you'll see there's a lot of similarities between the two projects, with the exception that Shoemaker Bridge now has to connect to Cesar Chavez and Direct Park Master Plan and also be part of the park expansion and re-use of the existing bridge is'",
        "'speaker_9': 'considered in this in this proposal. This is to define the project vision. We're basically trying to connect to downtown. Esthetically, it has to be a significant and a signature gateway to Long Beach. My comments have been to the consultants and to city staff that I would like to see this bridge on a U.S. stamp one day as'",
        "'speaker_9': 'far as it has to be sustainable and it has to have the safety elements that the current bridge does not have. These are our current partners and stakeholders. We have about 40 stakeholders and partners that we will be dealing with planning.'",
        "'speaker_9': 'Parks Harbor Department I 710 Esthetic Committee, the Willmore City Heritage Association. Caltrans Metro Gateway called the LBA and numerous other partners. The project goals are to create an extraordinary entrance to the city, enhance and improve green and open space.'",
        "'speaker_9': 'Preserve and repurpose the existing shoemaker bridge. Improve safety and calm traffic at entering downtown. This is just a picture of the two parks and how this bridge will be part of the the combination of these two parks and how we can combine them and create create a master park.'",
        "'speaker_9': 'This was a this is a picture or concepts of how the existing bridge can be repurposed and used for park and other recreational purposes. Going really fast. Basically the selection process we had so queues and RFQ sent out about May of 2014.'",
        "'speaker_9': 'A team which I'll tell you who they were before, are selected for firms that pre-qualified them. We ask them to to to bring their projects. We interviewed them and unanimously the team selected the HDR engineering company. The team was comprised of city managers, office and different departments, COG and Metro.'",
        "'speaker_9': 'Highlights of the HDR team's work in the city of Long Beach that are a local business. I'm kind of excited also that the structural consultant is Thailand International. They are very famous in designing long span bridges and they have designed the bridge at Hoover Dam.'",
        "'speaker_9': 'If you've seen the new bridge connecting it, that's part of that that work. First, look at the project schedule. We're hoping that by if you're gracious enough to allow this contract to move forward tonight, we will be able to have 30% design by mid 2017.'",
        "'speaker_9': 'With having more funding. We should complete the design of the bridge in 2018 and pending funding start construction in 2020. Potential cost for the bridge is between 130 to $200 million. That includes the repurposing of the existing bridge.'",
        "'speaker_9': 'And we estimate that this bridge construction will generate about 800 local jobs. It will require significant state and local funding and local funding. These are the coordination with the future. Future coordination as there are needed with a 7 to 17 corridor improvement project director Chavez and park master plan planning peer be with with the port they'll be'",
        "'speaker_9': 'must which is another public works project for municipal urban storm water treatment plant Yellow River Master Plan Improvements. I just conclude this report. If you have any more questions, you're more than welcome to ask.'",
        "'speaker_0': 'Thank you very much. Good report, Councilman Richardson.'",
        "'speaker_12': 'I just want to take a moment and say, you know, I've heard about this project for a long time. I know how important this is to the council districts wanting to congratulations. I think it's encouraging when you have a big vision.'",
        "'speaker_12': 'I know, Mayor Garcia, you worked on this a long time as well. I know when you have a big vision and you want to go for it and sometimes you might not have all the funding, but you want to shoot for it.'",
        "'speaker_12': 'Eventually it comes around. So congratulations. This inspires me to think even bigger in North Long Beach. So congratulations. I can't wait to see this. This park.'",
        "'speaker_0': 'Thank you. See? No other comment. Any public comment on the item? Senior public comment. Members, please go ahead and cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Thank you. Next item.'",
        "'speaker_1': 'I am 21. Communication from City Attorney Recommendation to declare ordinance amending ordinance number c-6646 Providing for a change in establishing an IT and advisory body. Read an adopted as read citywide.'"
    ]
}