{
    "Shoemaker Bridge Replacement Project: Environmental Impact Report and Mitigation Measures.": [
        "'speaker_0': 'Okay. Consent calendar is passed. Item 15 has been withdrawn. And so we'll move on to. Which was a hearing. So we're going to now move on to item 16 and if I could. And please Mr. Phones. Thank you.'",
        "'speaker_3': 'Item six.'",
        "'speaker_0': 'Madam Court.'",
        "'speaker_3': 'Report from Public Works Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution approving and certifying Environmental Impact Report and adopting a mitigation, monitoring and reporting program for the Shoemaker Bridge Replacement Project Districts one and two.'",
        "'speaker_0': 'I can turn this over to staff. Thank you. Thank you very much, Mr. Mayor. So this is American. So we are really at a juncture for a very important project that we want to give you a briefing on.'",
        "'speaker_0': 'I do want to point out that this isn't the first time that we're using the WebEx system to display the PowerPoint. So that should be on the screen for everyone at home and for you as well. And so we do have a presentation we'd like to go through.'",
        "'speaker_0': 'Craig back will give that presentation. This really is a project that could be one of those signature Long Beach projects. As you come into the downtown with some fantastic architecture. It's a park project as well, as well as a mobility and a safety project.'",
        "'speaker_0': 'And so it's many years in the making. We're asking you to certify the air tonight. And with that, I will turn it over to Craig back to walk us through it.'",
        "'speaker_1': 'Thank you, Mr. City Manager, Mayor, Members, City Council. Thank you for the opportunity tonight to present a fantastic project. This is ai7 ten early action project and it essentially entails the construction of a new bridge connecting the 710 to downtown Long Beach.'",
        "'speaker_1': 'As the city manager details. It also provides us an opportunity to create new park space in the west end of our downtown. So this has been a long time in the making with a lot of community participation and and a lot of support from staff.'",
        "'speaker_1': 'Our lead staff is the city's engineer, Alvin Papa. He's been involved in this from day one. And I'm going to ask Alvin to go through some of the details of the air, what the study was, general timelines on this project, and then be available to answer any questions.'",
        "'speaker_1': 'So, Alvin. Thank you, Craig. Hello, honorable mayor and members of city council. What you have here today is for the public hearing for approval and certification of an environmental impact report for the Shoemaker Bridge Replacement Project. For the format of this presentation, I'm going to talk a little bit about the purpose and need and then discuss the'",
        "'speaker_1': 'various alternatives that were evaluated, how we arrive to a preferred alternative, along with a summary of the environmental process and the timeline, along with next steps. On the second slide. This is the purpose and need slide. So with regards to the Shoemaker Bridge, the bridge was built in 1954.'",
        "'speaker_1': 'The current structure has structural and operational deficiencies, and it also has a higher accident rate than the state average. So the goal of the project is actually to build, to rebuild the bridge so that we have a new facility that's current with highway safety standards.'",
        "'speaker_1': 'In addition, the new bridge will enhance the regional connections to our downtown by providing better access to the 710 freeway and connections. It should be noted that this project is an early action item.'",
        "'speaker_0': 'But once again, the mayor, everyone's on me and you never want to go into it except for the staff making a presentation once.'",
        "'speaker_1': 'I thank you. So it should be important to note that this project is an early action project of the ice of intense South Corridor Improvement Project. It's consistent with our planning documents for future growth, and it's also compatible with our planned future projects and developments in the area.'",
        "'speaker_1': 'On slide number three, what you have here is a map of the project along with the limits. So the project is located at the terminus of the Ice 710 Freeway. The new bridge that's being proposed is proposed to be built south of the existing bridge.'",
        "'speaker_1': 'As part of the project, ninth and 10th Street. Off ramps on the west side of the L.A. River are proposed to be closed. So the project limits were spent extended to the north and to the west so that we can consider any potential impacts as a result of those closures.'",
        "'speaker_0': 'Additionally, additional. Additionally, though, this is the mayor. 1/2. I need everyone to bring me down. Right.'",
        "'speaker_1': 'Additionally, there are local street connections that are going to be realigned to improve circulation throughout the downtown. And as part of this project, six and Seven Street will be converted from one way streets to two two way streets.'",
        "'speaker_1': 'This will help align those street segments with the connection over by Atlantic, which are currently two way streets. On Slide four, you'll see an overview of the different alternatives that were looked at. There were three alternatives and two design options.'",
        "'speaker_1': 'And as part of this environmental impact report, there were various technical technical studies that were looked at in various topics, and we evaluated each of these alternatives and options through those studies to see if there's any potential impacts and any mitigation or monitoring that would be required.'",
        "'speaker_1': 'So on the next slides, I'm going to go through each alternative and the two design options. On Slide five. This is alternative number one, the no build otherwise known as a do nothing option. In this option, there is no project.'",
        "'speaker_1': 'As a result of that, the structure would continue to be structurally deficient. We would continue to have high accident rates. And then in the future, this this area and the project would not be consistent with our future growth and any developments that came in the area.'",
        "'speaker_1': 'The next slide. Slide number six. Alternative number two. This calls for building a new bridge and then reusing a portion of the existing bridge for non transportation use where it would accommodate walking, biking and potentially jogging. Slide number seven is alternative number three, which is very similar to alternative number two, where we would build a new bridge'",
        "'speaker_1': 'south of the existing bridge. Except the difference is that we would completely remove the old structure. And this. This includes removal of all the piers that exist within the L.A. River. Slide number eight shows the design option A, which is a roundabout.'",
        "'speaker_1': 'So as part of the two design options, this design option A would be an elevated roundabout which would provide access to and from the I7 ten Freeway via Shoreline Drive and Seventh Street. And one thing to note is this hasn't been done in California.'",
        "'speaker_1': 'So this would be a one of the first of its kind in California. The next option is design option B, which is the Y intersection. This is a more traditional design and this is a design that we've been looking at and working with with Caltrans over the years.'",
        "'speaker_1': 'And it also has a smaller visual footprint when compared to the roundabout. It's going to take a lot of time here on this slide. This is the preferred alternative. So this preferred alternative was selected by the project design team.'",
        "'speaker_1': 'And the project design team consists of a mixture of Caltrans staff, city staff and consultant staff that designed the project. One thing I want to mention is that back in 2000, the California Transportation Commission passed a resolution to accept the Shoemaker Bridge as part of the I7 ten Freeway.'",
        "'speaker_1': 'And as part of the planning for the Shoemaker bridge process, when construction is done, the Shoemaker Bridge is going to be transferred to Caltrans for maintenance. The city, in the end ultimately will be responsible for all the local street connections, and Caltrans will be responsible for the Shoemaker Bridge with its associated ramps.'",
        "'speaker_1': 'And as a result of this and the reason I bring this up is Caltrans input has a lot to do with influencing the preferred alternative. And the preferred alternative is alternative three a. And this this alternative is construction of a new bridge.'",
        "'speaker_1': 'Complete removal of the existing bridge. And its construction of a roundabout at the terminus of the freeway. And as part of the selection of the preferred alternative, the project design team determined that this best satisfied the purpose in need of the project.'",
        "'speaker_1': 'It also minimizes the risk to habitat and hydraulic hydraulics due to the removal removal of all the piers within the L.A. River. And based on the traffic models that were were done to evaluate analysis of the different options, the roundabout had better safety and operations within the traffic model that was used.'",
        "'speaker_1': 'One thing I want to mention is that Caltrans and Long Beach staff, we did differ in opinion in some categories with this, but ultimately we agreed to move forward with Caltrans preference, which was this roundabout option. And the reason we did that is so that we can approve this environmental document today, so that we can meet the'",
        "'speaker_1': 'funding deadlines that we have for future design funding. This next slide, slide 11. This is a this is a concept of what this project could look like under this preferred alternative. Ultimately, the final project might be different based on the different options and alternatives.'",
        "'speaker_1': 'So although we selected a preferred alternative, it is just that it's a preferred alternative. If you remember, I think a couple of months ago when we had a design contract that we amended, there's additional design that we're doing.'",
        "'speaker_1': 'So we are looking at the roundabout and we option a little further along with different alternatives, and we're going to get them a little bit further. And if it's decided in the future that those options are preferred, we can always come back and amend it and supplement the IIR as needed to reflect the final design.'",
        "'speaker_1': 'So looking at this design, after the environmental impact is completed, we would start a bridge type selection process. So one of the concepts, the concept you're looking now is single pylon cables, the type bridge. But what we would actually do is when we start the design process, we would come back to City Council with various types of'",
        "'speaker_1': 'design options so that council could make a policy decision on the type of bridge that would best fit the city. And the final design would move forward based on that policy decision. And the cost would also reflect that decision.'",
        "'speaker_1': 'On the right hand side, you'll notice this is Drake Chavez Park and you'll also see on the top right hand side, that's the existing configuration of shoreline drive. So for those of you that drive Shoreline Drive, you'll notice that there's a there's a no man's land between both sides of Shoreline Drive.'",
        "'speaker_1': 'And as part of this project will be realigning that street and combining those two segments so that the bifurcated portions of park could be reintegrated together. And so in the end, what this does is remove five and a half acres of roadway within Chavez Park and we'll have a this will result in a net gain of approximately'",
        "'speaker_1': 'four acres of parkland. And as part of that, we'd also establish enhanced active transportation connections to downtown through Drake Park and to the L.A. River. On the next slide, slide 12. This is a summary of all the environmental impacts.'",
        "'speaker_1': 'If you look at this table, there's a lot of different topics that were investigated as part of this environmental study. I mean, overall, to summarize it quite succinctly, the majority of environmental topics reviewed revealed that there were there was no impact or less than a significant impact.'",
        "'speaker_1': 'You see, there were a few categories where mitigation does need to be incorporated. Um, but these have been looked at and these mitigation measures are fully enforceable through permits and agreements which are, which are identified in the environmental commitment record and as part of the mitigation monitoring plan.'",
        "'speaker_1': 'On this next slide is the project schedule. You'll see the schedule here over the next couple of years with anticipated start of construction somewhere around 2023 in the box to the right. You will see next steps. So if the environmental document is approved today, the next step would be to move forward with the design.'",
        "'speaker_1': 'We would move forward with allocation of funding for a design process to finish the design process. We would start the bridge type selection process and return to City Council with further information on the different type of options. And then we'll continue to look at the different alternatives to be included in the final design and amend the environmental'",
        "'speaker_1': 'document as needed. And with that, the recommendation today is for city council to receive the sort of supporting documentation into the record, to conclude the public hearing, to adopt the resolution approving and certifying the E.R. and to adopt a mitigation and monitoring and reporting program as part of the resolution that you are approving today.'",
        "'speaker_1': 'And that concludes my presentation. And staff, along with our consultants, are here to answer any questions that you may have. Thank you.'",
        "'speaker_0': 'Thank you and really just much presentation. So I think that. Going to go ahead and turn this over to Council Member Sandy Haslam, District one of the motion.'",
        "'speaker_2': 'To get in is something that I'm personally very excited to see moving forward, especially in looking at how this might impact space in the First District, having access to green spaces, incredibly important to my residents that they I will not lose opportunities for being there.'",
        "'speaker_2': 'So I'm really excited about this. This is something that I'm passionate about and I think that is something amazing that we can bring to our city. So I'm seeking the support of my colleagues to move this forward, to get into this that this resolution and the report.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilman Pierce.'",
        "'speaker_2': 'Thank you, Mayor. And thank you, Alvin, for the great presentation. I think the designs obviously look very exciting, something that we've all been waiting years for I to support additional green space. I would be remiss if I did not say that a a floating roundabout kind of terrifies me, but it looks really cool.'",
        "'speaker_2': 'So I have just two questions on. I appreciate that we can come back as we explore other design models. What's the speed limit going to be in that area? Do we expect it to be? I'm just curious.'",
        "'speaker_1': 'The speed limit will be determined by the final design and is based on kind of the geometry and and a lot of other factors that we're going to we're going to design.'",
        "'speaker_2': 'Well, I think the circle looks really cool. And but I'm terrified that somebody would go flying off the side. But I welcome you guys to continue to do the good work and look forward to getting this through this next hurdle.'",
        "'speaker_2': 'So I do support this and I hope my council colleagues will, too. Thank you.'",
        "'speaker_0': 'District eight. Hi. I'd like to offer my support for the design. We are going to add Environmental Impact Report as is no small deal. So congratulations to 2 to 2 staff, but also to the residents of Long Beach.'",
        "'speaker_0': 'This has been a long visit. This has been discussed as long as I've been on the city council. I believe this is a project that is in the long term interest of our city and consistent with our vision of making our downtown more accessible, but also improving our just thruway accessibility for residents as long as the goods'",
        "'speaker_0': 'movement while coming over to the freeway. I did have a question regarding the construction number that I hear construction would be ready in 2023. Will we be ready for construction if the timeline.'",
        "'speaker_1': 'Councilmember Austin. That is correct. I think if we can meet our timelines that were laid out, which includes adoption of the E.R. today. Also funding of the design by the CTSI scheduled for June that we believe we can complete the necessary final design, get council support of that final design, get bid documents out, and be ready to'",
        "'speaker_1': 'start construction by 2023. So that is our schedule. You have a team that's committed to delivering that as long as we can meet some of these milestones.'",
        "'speaker_0': 'And are we are we the project funded? I know this to some the air and some of the early funds that we are putting forward are actually some measure are of early action items. But where is the funding for this project coming from and what is there own?'",
        "'speaker_0': 'Is there a gap?'",
        "'speaker_1': 'Council member. I think you've identified that as correct. It was one of the early action projects identified as part of the I 17 overall effort. We don't know exactly what the gap is. There are some estimates as to the preferred design and costs associated with getting that final design completed.'",
        "'speaker_1': 'There's roughly $14 million of funding identified that we're going to be requesting the CTSI to approve in June. The current estimate shows that there is a funding gap beyond that 14 million. We'll be working with our partner agencies to to finalize commitment for this design and move this all forward.'",
        "'speaker_1': 'And we can keep council apprized as those conversations move forward.'",
        "'speaker_0': 'I was looking more for the overall for construction. I think this as chair of the Fed merged committee and hearing conversations from Washington DC about potential future stimulus regarding infrastructure. I think this should be a high priority and will be a high priority for the city to fund this project, because I think it's very important for our'",
        "'speaker_0': 'future for many levels economic development, but mobility for our residents and goods movement from the port. And so I like I said, I really support this. I think this is an important project for the city. And to to one more request is that this was presentation.'",
        "'speaker_0': 'If you can email the documents as well, because I don't think the staff report that we have.'",
        "'speaker_1': 'Councilmember. We're happy to do that.'",
        "'speaker_0': 'Thank you. Councilman Glenda. Thank you. This is exactly what we've been talking about in the, you know, infrastructure committee that we have that we have in council. When I was a member of it were six years ago. So this is a culmination of a long series of meetings and discussions, especially with Caltrans and the Southern Committee.'",
        "'speaker_0': 'So really looking forward to the completion of this project. And I want to congratulate staff a job well done. Thank you. Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I, too, want to thank staff for the presentation. And like my colleagues just said, this is a project we've been talking about for many years now. So I want to acknowledge the work that. Now, Senator then Councilwoman Gonzalez and Councilman Lowenthal did in these conversations.'",
        "'speaker_2': 'I know that we talked about them a lot when they were on the council and how the ones that they asked hasn't missed a beat. She picked up right where they left off and is bringing this project forward.'",
        "'speaker_2': 'And I think staff did a great job on the presentation, so I offer my full support. Thank you.'",
        "'speaker_0': 'Thank you. That concludes council comments. We have a motion any second. I will go ahead with. Of course the comments have been any comments or submitted? Three comments. And with that, we will take the vote. Madam, what happens?'",
        "'speaker_3': 'District one.'",
        "'speaker_2': 'And.'",
        "'speaker_3': 'District two? District two.'",
        "'speaker_2': 'I spoke about that district three. I.'",
        "'speaker_3': 'District four.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District five. My District six.'",
        "'speaker_0': 'Right.'",
        "'speaker_3': 'District seven. District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District nine.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Motion carries.'"
    ],
    "Funding Transfer and Contribution for Black History Month Video Exhibit.": [
        "'speaker_0': 'Thank you, madam. Close. Let's read item number 17.'",
        "'speaker_3': 'Communication from Councilmember Richardson recommendation to increase appropriations in the special advertising and promotion fund group and the city manager department by $5,000 to provide a contribution to agency ETA for the Remembering Our Roots Black History Month video exhibit.'",
        "'speaker_0': 'Councilman Richardson, a motion. Yes, I'm a. Can I get a second, please? Into the messaging system. Waiting on a second, please. On a mission. Okay. A second by Councilwoman Pierce. I see no other public comment or on or council comment on this or after the walk over.'",
        "'speaker_3': 'Council District one. District one. District two.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District three. I district for.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District six.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District eight. By District nine.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'The motion carries item 90.'",
        "'speaker_0': 'Please, if I can just have a read and then Mr. Monica will begin.'",
        "'speaker_3': 'Item 19 report from Financial Management Recommendation and Filing for fiscal. Excuse me.'"
    ],
    "Commitment to Adopt Policy for Animal Care Services.": [
        "'speaker_0': 'Madam. I think I skipped over eating there.'",
        "'speaker_3': 'That's management item 18 meeting. Communication from Councilwoman Mango. Councilwoman Price. Vice Mayor Andrews. Councilman Austin. Recommendation to implement a commitment to adopt policy within 60 days.'",
        "'speaker_2': 'See if I can.'",
        "'speaker_0': 'Have Councilwoman Mango motion in.'",
        "'speaker_2': 'Time to motion.'",
        "'speaker_0': 'To a party.'",
        "'speaker_2': 'To. I don't see it because I can't see anywhere else.'",
        "'speaker_0': 'Into the. Not into the chat it into the texting messaging service that we emailed earlier today or yesterday. Okay. Last week. It was last week. It's okay. Go ahead. Cut one mango. I do it.'",
        "'speaker_2': 'Thank you. This is the culmination of bringing together a lot of the ideas from many who have come to council meetings and written.'",
        "'speaker_0': 'Office related to.'",
        "'speaker_2': 'How to support animal services and getting the animals into the homes. Over the last six weeks, we've seen an amazing amount of work on the part of.'",
        "'speaker_0': 'Our foster.'",
        "'speaker_2': 'Partners, and we want to continue that progress on a go forward basis. Many of you know, the shelters are on the verge of empty. We do have a few cats left, but it would be great if they had a home.'",
        "'speaker_2': 'And so as we come out of this crisis and return to normal, we want to get ahead of it and make sure we have processes in place that support our animal control director and our employees working hand in hand with the community and our foster partners to make sure each animal finds a home.'",
        "'speaker_2': 'So you may remember that in the state of California, there used to be a ten day sale policy for owners to reclaim their animals, and that was rescinded several years ago and during a prior financial crisis. And so the shelters are only required to be a lot on three days that we do as a best practice for'",
        "'speaker_2': 'the protest. This would allow people during that time their whole period to. Commit to adopting the animal and then have a backup person. This will allow.'",
        "'speaker_0': 'The director.'",
        "'speaker_2': 'And the city manager a lot of leeway in crafting the policy and ensuring that the organizations that follow through on those commitments are rewarded with the ability to make more commitments. But if organizations make commitments and don't follow through, then they would lose their ability to make those commitments so that we ensure that animals have the best'",
        "'speaker_2': 'chance of finding a home. With that, I hope that my colleagues will support this item. We've done a lot of outreach in the community and we really think that this is a step in the right direction. Also very open to any suggestions that have come up since item was written, which we felt that could improve it both'",
        "'speaker_2': 'on the city manager side or the Parks.'",
        "'speaker_0': 'And Rec slash.'",
        "'speaker_2': 'Animal care side. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, I have Councilwoman Price who's going to make a second.'",
        "'speaker_2': 'I'm happy to support this item, and I want to thank Councilwoman Mongo. She's always very, very creative and thinking about our animal care services division and all the different things that we can do to increase adoptions. And I really appreciate her leadership and happy to support this item.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up is Vice Mayor Andrews. Yes. Thank you. I also would like to thank our cast in Mungo for bringing the site on board. It was about any measure, you know, everything. I've seen more animals arriving in the home.'",
        "'speaker_0': 'I think it's worth giving it a try again as a notable bonus item. But the next is council this year. Oh.'",
        "'speaker_2': 'Thank you, Mayor. Thank you, Councilmember Mungo, for bringing this forward. I think completely and a real compassion.'",
        "'speaker_0': 'To once again. Can I go and get the times, please? I can see that there's a lot of books that are not me, including city staff. Everyone needs to mute their phones except for the person. So thank you so much.'",
        "'speaker_0': 'But Council Member Pearce.'",
        "'speaker_2': 'Thank you. I was saying I appreciate the item. I think it is a step in the right direction and aligned with the work that we've done over the last two years with Compassion Save. I did make sure to check in with city staff first and I had a couple of questions that I just want to ask publicly'",
        "'speaker_2': 'and then I'll give my full support to the item. I know that we the last time we talked about our animal shelter, we had given direction to city staff to start working on an operational agreement, which would seem that some of these items laid out in this item would include could stop.'",
        "'speaker_2': 'Just give us a report on where we're at. I know that COVID pops up, but what's the timeline for getting an operational agreement with the SPCA?'",
        "'speaker_0': 'Take out some of our time, Erica. So we were given the assignment by the council to first before we got to the operational agreement, really dove into the review of the agreement and the lease and all the documents that are currently in place.'",
        "'speaker_0': 'So that work essentially was very close to being finished when COVID 19 happened. So that has been we're very close on that part. We were actually in the process of setting up the negotiation meeting and sitting down with SPCA when I believe it was even on the day that we implemented either Safer at home or declared an'",
        "'speaker_0': 'emergency. And so that has unfortunately impacted our work to be able to to have those discussions. It is currently on pause and we know it's important to the council. We would like to get back to it as soon as we're able to.'",
        "'speaker_0': 'But we ideally this item was going to wait until we were done with those negotiations. But we do feel this is a relatively easy step to implement. But the ongoing discussions and operations and the negotiations would take a fair amount of time.'",
        "'speaker_0': 'So I don't have a date for you. Stephen, does he? He can chime in. But at this point, we're a little bit on a pause.'",
        "'speaker_2': 'That's that's okay. I just wanted to make sure that we kept that at the forefront of what we're thinking. And my next my next comment would be just and one of the issues that continues to come up is tracking animals that go to the SPCA and making sure that if we're focusing on Forever Home, which has been'",
        "'speaker_2': 'the continued intent of this council, that we are also tracking what happens to the pets that go to Assisi. So I would ask as part of this, that that staff figure out a way to track when those adoptions are happening so that we have a count of that.'",
        "'speaker_2': 'So that those are my my two comments. I support the item and think it's a good step following all the work that we've done and want to thank all the advocates that continue to do great work and advocate and again, thank our shelter staff and want to make sure that they have the tools that support them to'",
        "'speaker_2': 'do their good work. So thank you.'",
        "'speaker_0': 'Thank you, Councilmember. And we can certainly add to the list of the things we're going to discuss with SPCA, the reporting requirements that you talk about and have that be part of those operating agreement discussions.'",
        "'speaker_2': 'Thank you, Tom.'",
        "'speaker_0': 'Councilmember. Thank you. I thank the board. Thank you, Councilman Mongo, for bringing this forward. You did ask for suggestions, so I will really get into the weeds on something a constituent brought up. And that's the last bullet point number eight.'",
        "'speaker_0': 'If no committee member has requested or allow refuge to pull at 4 p.m. the night before, and what was suggested was that information needs to be out there publicly. So if someone is anticipating an animal still being available for a rescue on a Friday or adoption on a Friday, you don't want to disappoint them by the animal'",
        "'speaker_0': 'being gone before. That's all I have. Thank you, Councilmember Austin, but thank you. Would also like to lend my support to this. Obviously, I was closing in on this item. I think it's very important. But I also want to commend my colleague, Councilmember, a longer term commitment to this issue.'",
        "'speaker_0': 'I know she and her husband, Scott, they spend a lot of time and they're very close to an animal shelter near and dear to her heart, the dolphin. I'd also like to think that this this policy that we are moving forward with will help support many of our dogs and partners who are doing some amazing work.'",
        "'speaker_0': 'I mean, there are a lot of where some of our unsung heroes in the city of Long Beach for their commitment, compassion and work to adopt out my pet. I can speak for my personal experience. Just a little over a month ago, my family, we adopted a pet and know I want to thank our school board member'",
        "'speaker_0': 'Megan Crawford of fostering and facilitate that. Also want to give a shout out to Sparky and the gang for their efforts to really save the lives of countless amount of animals in the community. And so this is this is a good framework to work from.'",
        "'speaker_0': 'I think this does kind of get into the weeds, but I'm okay from that. And I hope that you can actually build on this and come back with a really good policy. So I'm happy to support Cities Home as well.'",
        "'speaker_0': 'Thank you. I'm now a compliment.'",
        "'speaker_2': 'And they think you're a member longer for me. But I just also wanted to go with my colleagues have said in support of this item and I'm thinking.'",
        "'speaker_0': 'Well, thank you, Councilwoman. That concludes comments of Councilman Mungo. Your your Q and and it's in motion was I think you did already. Do you have any additional comments to close or. No.'",
        "'speaker_2': 'I just want to appreciate the adult membership. And I think the same committee member called my office is on my call list. We do have a procedure that smooths that process out and we do need a lot of local information and that will be available.'",
        "'speaker_2': 'That tells people that some of that so that they can. We really, really want the public to make that commitment to adopt during the ten day period. That's our ideal service. Thanks so much for the and support.'",
        "'speaker_0': 'Thank you. I just want to add I want to I also want to thank Councilwoman Mongo. I think she has been just really bold in the work at the shelter. Obviously, the shelters have been in the district and there's been a lot of great work on the council.'",
        "'speaker_0': 'But I know, Councilman, you've been putting a lot of time with the organizations, and I think that the proof is in kind of the new reality that we have with the amazing director and team and volunteers. And this is really great work happening.'",
        "'speaker_0': 'So I just want to thank you and everyone on the side and integrity and support for the work. So thank you. With that, please do the work. Okay.'",
        "'speaker_3': 'District one.'",
        "'speaker_0': 'Lake.'",
        "'speaker_3': 'District one.'",
        "'speaker_0': 'Park.'",
        "'speaker_2': 'West Lake.'",
        "'speaker_3': 'District two.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District three. Our district for.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District six.'",
        "'speaker_0': 'Five.'",
        "'speaker_3': 'District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District eight.'",
        "'speaker_0': 'Oh.'",
        "'speaker_3': 'District nine.'"
    ],
    "Fiscal Year 2020 First Budget Performance Report. ": [
        "'speaker_0': 'Hi. Motion carries with you now item 90.'",
        "'speaker_3': 'Item 19 Report from Financial Management Recommendation to receive and file the Fiscal Year 20/21 Budget Performance Report City Wide.'",
        "'speaker_0': 'Mr. America. Thank you very much, Mr. Mayor. We will have a report from our Director of financial management, John Growth, and our budget manager. Manager Great Noon. Essentially, we provided a document to the public and to the council about the impacts of COVID 19.'",
        "'speaker_0': 'And that's something that we'll go over with now with our with our finance team.'",
        "'speaker_2': 'Good evening. And member of the city council. This is Greece. This is the first performance report of our flight and includes an initial assessment of the COVID 19 pandemic impact on our flight to finances, as well as the potential impact on outyear budget projections.'",
        "'speaker_2': 'This report, as our city manager just mentioned, is based primarily on the April 13th, 2020 memo that is needed as an attachment to the performance. The COVID 19 pandemic, along with the measure and litigation, has exacerbated our projected budget situation.'",
        "'speaker_2': 'The Budget Office, under the direction of the city manager, will develop a plan to address the situation, which may be a multi-year plan to be implemented over several years. The size of the projected shortfalls indicates that there will likely be significant impact assessments beginning next year and at Fy21.'",
        "'speaker_2': 'Long Beach is not alone in this. As many cities in California and across the country are dealing with the financial crisis caused by the pandemic and having to consider similar major actions. This projection is based on assumptions and information available during the early stages of the pandemic.'",
        "'speaker_2': 'So it is important to note that the economic and.'",
        "'speaker_0': 'Can't hear anything. Hi. This is John GROSS. I can continue this. Can you hear me? Okay. Go for it. Okay. So but Grace was saying is it's important to note that the economic environment and impacts are constantly changing and we will be impacted constantly.'",
        "'speaker_2': 'We will. Shortfall at the end of.'",
        "'speaker_0': 'I think Greece is coming in and out. Let me continue. For this report. We anticipate that there are five funds that are impacted, the general fund measure a special advertising and promotion entitlement and the airport. Yes, Grace. I'm continuing because you're going in and out, so it might be easier for me to continue.'",
        "'speaker_0': 'So we expect about 38 to 44 million in overall revenue losses or unbudgeted expenditure increases across the fund, across all these funds for the general fund we're talking about for FY 20 potential shortfall of 14 to 22 million.'",
        "'speaker_0': 'If no corrective actions taken in Greece, then the manager will be taking some corrective action. This shortfall takes into account potential revenue losses and expenses related to the pandemic that are unbudgeted and not reimbursable. And it does not include any costs that may come from assistance to businesses.'",
        "'speaker_0': 'For Measure A based on the current projection. We're expecting a shortfall in revenues of around $7 million, but due to strong up by 19 performance, we are expecting to end on budget based on current projections for Measure eight.'",
        "'speaker_0': 'We just don't have extra money for special advertising and promotion fund. Were anticipating a revenue loss of about $2 million and by the end of the year the funds available may drop from 5 million to only about 900,000 at the end of the year.'",
        "'speaker_0': 'The budgeted expenses in Fy20 are not reduced. We still do have an operating reserve of 5 million set aside for operating profit fluctuations and the future Olympics. Four Titans. There's going to be a revenue shortfall of at least $6 million, primarily in oil revenue.'",
        "'speaker_0': 'And future projection updates will also take into account the potential loss of ancillary revenue used to pay debt service entitlement fines, which include potentially the aquarium, the Queen Mary and Rainbow Harbor. For the airport fund. We're expecting a revenue loss of about $10 million in this year due to low passenger volume.'",
        "'speaker_0': 'And there is currently a very high cash stream due to both that revenue loss and the cost of capital improvement projects. And the airport staff is reviewing those actions. We've been really helped recently by $18 million from the CARES Act and that will really help the situation.'",
        "'speaker_0': 'Other funds are anticipated to be impacted by the pandemic, but with a lesser overall impact. As the manager and a decrease talked about, the city manager is implementing budget actions with regard to the pandemic spending to protect the city and its services as much as we can.'",
        "'speaker_0': 'We will certainly spend whatever we need to spend to address the pandemic. The actions we may take and the is looking at is evaluation of one time projects for saving, reduction of non-pandemic operating expenses where feasible, and actively looking for funding and other mechanisms to offset the cost.'",
        "'speaker_0': 'In addition, if we need to, we may need to go look at using city's operating and emergency reserves at the end of the year. The bottom line is that the pandemic is having a significant and severe impact on our finances.'",
        "'speaker_0': 'We will continue to update our projections and update City Council on new development strategies and actions being taken, and that includes the staff report. And hopefully Greece is back on the line and we're available to answer questions.'",
        "'speaker_2': 'Yeah. Thank you, John. I am back on a daily there this time, so hopefully the connection will be better. But thank you very much.'",
        "'speaker_0': 'Thank you and thank you both for a great presentation. So I want to just just briefly just say that I'm just so impressed with our finance team. I think we all have nothing but great things to say about this team.'",
        "'speaker_0': 'And you guys have been just really fantastic during this crisis. What's the most important thing in this emergency is to ensure that we are providing assistance to the public, making sure that public safety resources are out there and that we are doing everything we can with our resources to take care of the public and make sure people'",
        "'speaker_0': 'are safe and healthy. And you guys have all been quick to make that adapt, to make changes, and to then begin preparing for the future. I think we should all be prepared and understand that the budget this upcoming year is going to be tough, it's going to be hard, and we're going to have some tough decisions to'",
        "'speaker_0': 'make. And I know that the Council is committed to centering and ensuring that people remain safe and healthy as our top priorities. And it's going to require us to also reprioritize other things that may have been important in the past.'",
        "'speaker_0': 'And we need to know and be certain that that that the future of our city has to be being being prepared to take on these large health challenges to stay, keep people safe, and provide those basic services that people expect.'",
        "'speaker_0': 'And so I think all of that is going to be in front of us in the future, and I look forward to those discussions in the months ahead. Councilmember, your anger. Thank you, Mary. I think I totally support everything that you said.'",
        "'speaker_0': 'The staff has been doing an excellent job and making solvent through a move to approve the report. Thank you. Could somebody cue up a second, please? If I can get a second and a second by Councilman Richardson. But then government.'",
        "'speaker_0': 'Do you want to add anything? But for the most. Okay. Councilwoman, I'm going to give anything to add.'",
        "'speaker_2': 'I just want to thank everyone for the work. And I think it's going to be critical that the reimbursements come in. And the second tier on a multi-year approach, I think is the most.'",
        "'speaker_0': 'Prudent.'",
        "'speaker_2': 'Way to handle a lot of these big challenges. And I think that we're are just going to need to be patient.'",
        "'speaker_0': 'With Aaron and pitch in.'",
        "'speaker_2': 'Because we need to come up with a way to make sure that we.'",
        "'speaker_0': 'Protect our.'",
        "'speaker_2': 'Workforce and our city services for the taxpayers.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_2': 'I support the motion and I really want to thank the team, both the finance team and POM. I think you guys have done a great job. I'm really happy that years ago somebody decided to put together an additional fund, so I know that we'll end up relying on that.'",
        "'speaker_2': 'Hopefully not as much, but I think everyone's done a great job. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'No comments, Mr. Mayor. I was just a little late to the game of extending the motion.'",
        "'speaker_0': 'No, no problem. Catherine Ashton. They also want to just congratulate. Well thanks down for for this is very very clear look at our budget projection over the next fiscal year. I want to go to the summary of actions.'",
        "'speaker_0': 'It's certainly support this, but I did have some questions regarding this four points in the summary on the staff report and the three. As far as where people place a hold or counsel discretionary one time pandemic related expenditures, which I certainly support and suggest that we should avoid starting or expanding to what are discretionary and structural programs'",
        "'speaker_0': '. I would absolutely support reduced budgets, structural costs, while support that improves because you see savings in that piece. I want to kind of get in on what exactly does that mean? Mr. GROSS Increase simplification. That means we're going to institute potentially hiring freezes.'",
        "'speaker_2': 'A couple. Remember at this time we are not implementing a hard hiring freeze, but that is definitely something. We are working with the city manager's office to evaluate and consider what we mean by increasing vacancy savings. And we are taking a much harder look and scrutinizing requests from departments to fill positions that are currently vacant right now'",
        "'speaker_2': 'and evaluating the filling of those vacant positions to ask whether this position can be delayed in hiring due to the redirection of staff to respond to the COVID response? Or is this something that we could put on pause longer term?'",
        "'speaker_2': 'And as we evaluate each case on a case by case basis, and if there are positions we delay in hiring, that will naturally create savings within the department's operating budget on a one time basis, at least for now, within FY20.'",
        "'speaker_0': 'So in approving this item tonight, are we giving staff the go ahead to move and take these actions? Implementing actions.'",
        "'speaker_2': 'Just remember we.'",
        "'speaker_0': 'So Councilmember this time. So we're essentially just kind of outlining what our strategy is. The council is going to be fully plugged in before we start canceling any major projects. So we're in the evaluation phase. We're managing the budget kind of on a daily basis.'",
        "'speaker_0': 'So in terms of, like great said, we're going to evaluate whether we need to fill positions or not. But we if and we're looking at every single expense about whether or not we should move forward. So I am placing some holds on those so that we can generate savings.'",
        "'speaker_0': 'But before we completely cancel any projects that, you know, you'll get a report from us on, on what our recommendations are and be able to weigh in on those going forward. Thank you. I just need that clarification. Thank you, Councilmember.'",
        "'speaker_0': 'I think that concludes our coverage of the questions, councilman, often about. Okay, great. We'll do a roll call vote on the motion in a second. Madam Court.'",
        "'speaker_3': 'District one, district two.'",
        "'speaker_2': 'By.'",
        "'speaker_3': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District four.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District six. District seven.'",
        "'speaker_0': 'II. District eight.'",
        "'speaker_3': 'Art District nine.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'Motion carries.'"
    ],
    "Health Equity Lens Policy and Training for COVID-19 Staff Reports and Joint Information Center.": [
        "'speaker_0': 'Thank you. Motion carries. Thank you for that. We're going to have a had a request to move item 28. So we'll go ahead and move item 28. Adam Court.'",
        "'speaker_3': 'Communication from Council Member Richardson. Vice Mayor Andrew's Council member Urunga Councilman Austin. Recommendation to request city manager to work with the Office of Equity to establish a policy requiring a health equity lens. Statement on all staff reports related to COVID 19.'",
        "'speaker_0': 'Okay. Thank you. I'm going to. I'm going to turn this over to Governor Richardson. Thank you, Mr. Mayor. Okay, so I wanted to start off just thanking the Coal Agenda's vice mayor Andrews, Councilman Austin Austin Councilmen Ranga for signing on to this proposal.'",
        "'speaker_0': 'The idea here that this COVID 19 crisis has really impacted cities across the country and here in Long Beach, we're noticing, you know, based on the data that we see, that the demographic data really shows that there's disproportionately impacts on African-American AAPI communities.'",
        "'speaker_0': 'And we also know that we've learned a lot over the last few years about making clear that we understand this concept of equity and undertaking need into account in how we respond. I think that's that, for the most part has done a good job of thinking about the concept of equity.'",
        "'speaker_0': 'I saw when we are you know, I really want to applaud the memo when we talked about the demographic data, which, you know, the city council asked for it. There was really a lot of context put there. And in my opinion, that really showed how much growth the city has really taken on in becoming a leader, in'",
        "'speaker_0': 'really understanding this concept of equity. Well, all of that comes from a number of practices we've taken on. You know, we've made a commitment to join the Governance Alliance and Racial Equity. We've participated in the National League of Cities, a real conference that's reached equity and leadership, where, you know, our deputy city manager attended trainings in New'",
        "'speaker_0': 'Orleans and we've traveled the country and learned from what other cities are doing. And we also took an important, important step. We're one of just a handful of cities around the country that has actually established an Office of Equity to ensure that we understand what this equity concept is, and that is baked into the decisions that we'",
        "'speaker_0': 'make and that sprinkled on top. I think, given what's taking place with this, with the COVID 19 emergency, I think we should look at best practices of what's happening around the country. And we see that many jurisdictions place an equity impact statement on agenda item.'",
        "'speaker_0': 'And now is an opportunity, I think, for us to really demonstrate that we are thinking about all communities and and that is a central driver of our response, not an afterthought. This activist, you know, this action is take effect.'",
        "'speaker_0': 'People are doing this all around the country California, Texas, Washington, Minnesota, Wisconsin. And it's widely supported in our own communities. You'll find letters of support from a number of community organizations from the Advancement Project, the Filipino Migrant Center and Long Beach Interfaith Community Organization Lobbies Forward Long Beach Coalition for Good Jobs, Healthy Communities, Mangrove Action, a nonprofit'",
        "'speaker_0': 'partnership. So it's this is a practice that has brought support within the community. I think our staff has taken steps to be prepared for this. And I think now is the moment that we really demonstrate that we understand the concept of equity and we're going to play to how we respond.'",
        "'speaker_0': 'Actually, I've I've talked through this with Carmen on how you receive it, how you handle it, and you have a good understanding of what the expectation is. Staff Report The memos related to the COVID 19 response should have a statement related to, you know, how this impacts equity or helps us to close gaps or takes need into'",
        "'speaker_0': 'consideration. We have an equity toolkit in the city and it really helps staff that's out, I believe, seven, seven or nine questions. And there's really questions to consider as you make decisions. And those are the types of things you would consider in when you issue this statement.'",
        "'speaker_0': 'Another thing I'd say is, you know, when you add statement agenda items, it it does it triggers it's good practice for all of us to really think about certain impacts. I remember back in, I believe it was 2011 when then council member James Johnson initially made the motion to include fiscal impact statements on agenda items.'",
        "'speaker_0': 'And it was a bit controversial that initially happened. Folks thought it would be an additional step, additional thinking. But now that process is well, it's refined. It's it's really been it's really been a good process that we've seen that's really been embraced by both the city council and staff and the community.'",
        "'speaker_0': 'And I envision that this is this you know, this is something that we can do today to make sure that we place this equity lens on our decision making. So that's it. I'll conclude my comment and this is my motion, and thank you for your support.'",
        "'speaker_0': 'Thank you both, Mr. Andrews. You know. I want to thank our special counsel in Richardson, you know, for bringing it to hate and blow it. You know, just last week, this is the day we've done the days of speaking about mental illness.'",
        "'speaker_0': 'And today we're talking about health equity. Every one of these issues boil down to continue to be an exclusive, supportive city for all residents. There's no secret that the community with a large concentration of minorities and people of color and it's not a light.'",
        "'speaker_0': 'It's you know, it's a it's an expensive project. But, you know, with this pandemic, we showed that once again, the African-American community is affected at a large scale. Yeah, I'm looking forward really to use. Now these have equities, you know, lithium, you know, statements on staff report and how the GC team implement that equity toolkit and really'",
        "'speaker_0': 'recalibrate in the way that we look at things and implement strategies for this. Because I think this is something that we really, really should take a serious look at and think you when we for bringing this to the.'",
        "'speaker_0': 'All right. Thank you. Vice Mayor. Next up, I have with your Councilwoman Van Day.'",
        "'speaker_2': 'Thank you. I also want to thank Councilmember Richardson and Cosigners and council vice mayor and Councilmember Austin. And I think that this is very important. It is becoming more and more clear that the impacts of this pandemic are spread evenly among our community.'",
        "'speaker_2': 'What is to come from the people of color living or being hospitalized in Long Beach? I hope the.'",
        "'speaker_0': 'Next step.'",
        "'speaker_2': 'That is just to make sure that we are aware and mindful of the issues in our conversations about COVID 19 and supportive of this item. And I think it will lead to more equitable and just policies as we respond to this president's crisis.'",
        "'speaker_2': 'Thank you. And I fully support this item.'",
        "'speaker_0': 'Thank you, country ranga. Thank you. I want to thank all the comments that have been made thus far from our less colorful colleagues. This is a this is a growing pattern in our country. And we need to identify the fact that we are a diverse country and that where they were sitting and this action would make it'",
        "'speaker_0': 'a lot stronger and much more informed as to how our policies were affected our communities. So thank you for bringing this forward, and I hope that I get that we get the support of the full council. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Upton. Thank you. Happy to support this open season and take a whole other side when I was in school to cosign this because this is obviously an important issue with a diverse city, with a diversity of language, it's important that we understand, analyze and understand the data so we can make smart decisions to deliver'",
        "'speaker_0': 'services, but also protect our residents. And, you know, looking at the data from last week, it's clear that 55% of those who were hospitalized due to COVID 19 were African-American or Latino. But that was the same disparity, to be my understanding, that we can be smarter with our resources in terms of targeting.'",
        "'speaker_0': 'We're testing test methods. Are education campaigns well, in other words, to just be a high functioning city that serves everybody. So I'm happy to support these items and kudos for bringing it through. Thank you. Thank you. That concludes a couple of comments.'",
        "'speaker_0': 'So, one, we're going to do a roll call vote. And I'm.'",
        "'speaker_3': 'District one.'",
        "'speaker_2': 'By.'",
        "'speaker_3': 'District two. I District three. District three. District four. I am District five. District five. District six.'",
        "'speaker_2': 'I went. Yes. Yes. Thank you.'",
        "'speaker_3': 'By District seven. By District eight, by district nine.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Motion carries.'"
    ],
    "Presentation on the Equity Toolkit by City Manager and Office of Equity.": [
        "'speaker_0': 'Great. Thank you. I've also had a request to move up item 27. So, Madam Quirk, please read that item.'",
        "'speaker_3': 'Communication from Council Member Pearce. Council Member Urunga. Council Member Richardson. Recommendation to request City Manager to work with Office of Equity to schedule a future presentation on the Equity Toolkit.'",
        "'speaker_0': 'Councilmember Pearce, you obviously.'",
        "'speaker_2': 'Thank you, everyone. And I want to thank Councilmember Richardson for the other item related to the Office of Equity Toolkit and COVID. I figured I'd save my comments for this part. We actually drafted this item before the COVID crisis hit us, really to try to highlight the work that the city has done over the last several years'",
        "'speaker_2': 'around Equity. Our Office of Equity and our Health Department have done a lot of work in the community and with city staff already. They released a equity toolkit a couple of months back that the council has not yet had an opportunity to look at.'",
        "'speaker_2': 'And it really highlights the fact that Councilmember Richardson just mentioned, which is equity is when everyone has what they need to be successful. Well, equity is treating while equality is treating everyone the same. We want to make sure that we promote fairness and it can only work if everyone starts from the same place and receives the resources'",
        "'speaker_2': 'that they particularly need. And so I think the COVID situation definitely highlights the fact that not only is it race age, and we know that some of our nursing homes have been the location where we've had the biggest outbreaks.'",
        "'speaker_2': 'And so these are examples for us to take to heart and really demonstrate that we as a city, as we are coming back and doing recovery, needs to have a full understanding of the toolkit, which really is fantastic.'",
        "'speaker_2': 'If you guys haven't had a chance to look at it yet, it really talks about what burden and benefits there are. How do we understand the data, community engagement, decision making and implementation? Accountability in a ways out of several questions.'",
        "'speaker_2': 'And they give examples for policymaking, how we do our budget priorities. And so my request today is that as staff come back and do a full presentation on this toolkit so that when we have other items come forward, WHITE Councilmember Richardson has brought forward we all already have a shared understanding of what that toolkit is and how'",
        "'speaker_2': 'we can use it to ask questions as we are drafting policy and giving staff direction as well as how we are crossing our budget. And I think it's a particularly important time to do that. So I thank my colleagues for signing on.'",
        "'speaker_2': 'I know that there was a lot of support for this item previously, and I know we move quickly to get it on the agenda. So I appreciate everybody's effort and look forward to coming back with a full presentation for.'",
        "'speaker_2': 'And I urge your support.'",
        "'speaker_0': 'Thank you. Thank you, Governor Pearce. You didn't. You also just sent a Q in on the motion, please. We have a recorded and then camera angle. Very glad to look at the motion on this side of this. And it's very much needed at this point that we know what we're getting into in this presentation and what we'",
        "'speaker_0': 'mean by this issue. So thank you. Thank you. We have a motion and a second and we're going to do a roll call vote, please.'",
        "'speaker_3': 'District one.'",
        "'speaker_2': 'And.'",
        "'speaker_3': 'District two. I District three. District four.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'District five. District six.'",
        "'speaker_0': 'II.'",
        "'speaker_3': 'District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District nine.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'Motion carries.'",
        "'speaker_0': 'Thank you. I'm going to go for items 21 through 25. I'm going to ask if people can just queue in for the motions. I'm going to do. I'm going to take unanimous consent on the votes for these. And so I'll just go through these and let them and watch their presentation.'",
        "'speaker_0': 'We'll start and do the presentation like we typically do in the council meetings. So item 28 and 20. Can I get a motion in a second motion by Councilor Richardson, seconded by Councilwoman Zendaya's? Unless there's any objection, we'll take that as unanimous consent.'"
    ],
    "Resolution to authorize Revolving Line of Credit with JPMorgan Chase Bank for Long Beach Water Department.": [
        "'speaker_0': 'Item. Next item is. Item 21.'",
        "'speaker_2': 'Please.'",
        "'speaker_0': 'Can you read the item, Madam Clerk? I'm sorry, but through the item to.'",
        "'speaker_3': 'Report from Financial Management and water recommendation to adopt a resolution authorizing the execution of a revolving line of credit with JPMorgan Chase Bank by the Board of Water Commissioners on behalf of the City of Long Beach in an amount not to exceed 60 million citywide.'",
        "'speaker_0': 'Okay. I have emotion by customer anger and a second by councilman's on behalf. Unless there's any objection, I'll take that by unanimous consent. Oh, I'm sorry. I believe I have a question. Bye bye. Councilwoman Pryce.'",
        "'speaker_2': 'Mr. Mayor, I just. I did have a question for staff as to why. Why Chase?'",
        "'speaker_0': 'Thank you very much for that question. This is David Nakamoto, city treasurer. We conducted an RFQ to identify potential business partners for this product, and we only received two responses out of a pool of nine major banks. Chief was the most advantageous as far as pricing and flexibility in terms.'",
        "'speaker_0': 'Therefore, we recommend them. Thank you. I also have a question by Councilman Mongo.'",
        "'speaker_2': 'It is important to recognize that. I guess next up are each of the three vendors for the borrowing that we're doing over 30 and the borrowing that the water department is doing. Stuff that I noticed that there are is.'",
        "'speaker_0': 'I. This is David Nakamoto, city treasurer, again. Could you repeat the question?'",
        "'speaker_2': 'Did you say that there are two items on the agenda tonight that request the opportunity to set up a structure where we might be able to borrow money should it be necessary? Are the banks? Is it the same banks or both?'",
        "'speaker_2': 'And did they have the same process or two different processes?'",
        "'speaker_0': 'Thank you very much for that. What we did was combine the two and put both of both deals of all out in that RFQ and ask for independent quotes. Got it.'",
        "'speaker_2': 'Thank you. That's very helpful. And I appreciate that. That makes it a more competitive process.'",
        "'speaker_0': 'I think you better do a better job in your strategy.'",
        "'speaker_2': 'Thanks so.'",
        "'speaker_0': 'Much. Thank you. Thank you. That concludes the questions for this item. So please do actually, I'll just ask unanimous consent must have any objection and the the 21. Okay. Madam Court, can you please read item 22?'"
    ],
    "Contract Award for Tree Trimming and Related Services to Great Scott Tree Service, Inc.": [
        "'speaker_0': 'Madam Court, please read the next item.'",
        "'speaker_3': 'Item 23 Report from Parks, Recreation and Marine Recommendation to award a contract to Great Scott Tree Service to provide tree trimming and related services for a total annual contract amount not to exceed 970,025 citywide.'",
        "'speaker_0': 'Yeah. I'm just looking for a motion to see a motion by Councilmember Pierce, so I can have a second, please. Looking for a second on the item. And a second by councilman's and de Haas. Thank you. Councilmember Pierce, you have any any comments or questions?'",
        "'speaker_0': 'No comments any from customers and they have. Yeah. Okay, then, unless there's any objection, I'll move those without his consent. I know before we get the items 24 and 25. Customer Pearce's You want to say something?'",
        "'speaker_2': 'Yes. I'm going to be recusing myself from item 24 and 25 from my previous work with From the Earth. Thank you.'"
    ],
    "Report on L.A. County Emergency Rental Assistance Program and Additional Funding Sources for Long Beach Families.": [
        "'speaker_3': 'Communication from Councilman Austin, Councilwoman Zendaya's, Councilwoman Price, Vice Mayor Andrew's recommendation to request city manager to report back on how Long Beach households will be able to utilize the L.A. County Countywide Emergency Rental Assistance Program when it's implemented.'",
        "'speaker_0': 'Thank you. I'll turn this over to Councilmember Austin. Well, thank you, Mr. Mayor. And I want to thank my colleagues, council members, and they have praised Virginia Andrews for signing on. This is an extension of the spirit of the economic relief that this country has already committed to in terms of protecting families who've been devastated by this'",
        "'speaker_0': 'economic fallout of COVID 19. Obviously, we're experiencing a public health emergency, but this is also an economic crisis as well. So our citizens passed an eviction moratorium or other economic relief to protect workers and renters who are unable to pay their rent over the long term.'",
        "'speaker_0': 'However, this this measure protects households during the crisis. This will require, as we all know, to pay back rent or do in the months following this emergency order is lifted. There's a significant financial burden on these families that we know.'",
        "'speaker_0': 'We know this will be the case. We. We have a significant number and it's been echoed many times. Roughly 60% or more of our population are renters in the city. And this puts this tremendous, tremendous strain on the entire community.'",
        "'speaker_0': 'Not only are families facing tremendous burdens pass well, but also our housing providers and landlords are property owners who are relying on rental income to support their families, their families, as well as significantly impacted by the crisis. And so lastly, what really give close to the Board of Supervisors, L.A. County Board of Supervisors, who unanimously approved the'",
        "'speaker_0': 'motion by Supervisors Janice Hahn and her party wide emergency rental assistance program. This to me, when I first saw this exactly when when proposal, the proposed program would provide up to $1,000 a month for three months to renters who have lost income due to the crisis.'",
        "'speaker_0': 'The town was looking at CTG and other federal funding to help fund this program. This proposal, my opinion, as I said, is a win win solution that would take a major step in providing housing stability as we get through this crisis.'",
        "'speaker_0': 'The Board of Supervisors asked for an implementation plan within 30 days, which means they will be coming back within the next few weeks. I'd like to request that our city manager look at the county's recommendation to when it becomes available and see how long these families can best utilize this program.'",
        "'speaker_0': 'We also expect the need to likely exceed the allocating resources. So we're also asking the manager to look at federal, state private funds that would allow us to see how we can leverage those funds, including city dollars that lawmakers will be receiving as part of the federal cares out to offer emergency rental assistance to additional mortgage.'",
        "'speaker_0': 'How is it possible that you won't stop the spread of coronavirus? We're also putting a priority on how we pull together the community to get through the difficult economic times for so many of our families are experiencing. This will be another tool that we can help allies to help in this effort.'",
        "'speaker_0': 'So I would ask my colleagues to support this this measure. Again, this is in line in spirit with our existing economic relief package. Thanks. Thank you. Councilman, I have a second by Councilman Price. Councilman.'",
        "'speaker_2': 'Thank you very much. And thank you very much, Councilman Austin, for bringing this item forward. I echo your comments completely. I'm grateful that you brought this item so early, because one of the things that we have seen is that the small business owners with the federal relief is that so much of it had to do with the'",
        "'speaker_2': 'timing that the applications went in. So if we're able to be in a position as a city to understand what the program is going to be and how our residents can access those funds early, we'll be putting them in a better position for hopefully getting the grants that they need without doing so at a time when the'",
        "'speaker_2': 'funds, whatever funds are identified, are depleted. So I think that's really great. I think for me, the biggest concern I have is I think it's great that rent has been deferred in situations where people can't make their rent due to COVID 19.'",
        "'speaker_2': 'I'm glad that we've offered that deferment, but I worry about the back rent and how difficult that's going to be for people to pay. You know, as a commercial property tenant for small business, I know that the backdrop we're going to have to pay is it's really going to be backbreaking.'",
        "'speaker_2': 'I mean, it's impossible to put that kind of burden on a small business. I can only imagine how difficult that will be for families, many of whom are out of jobs. So anything that we can do to try to provide that support through a grant money I think is really good and I'm glad we're doing it early'",
        "'speaker_2': '. So thank you, Councilman Austin.'",
        "'speaker_0': 'Thank you, Councilwoman. Vice Mayor Andrew. You know, the leadership on the podium. You know this you know, I'm looking at all of this. And I think every day, you know, there seems to be one new way I projects and help, you know, resources or assistance.'",
        "'speaker_0': 'And I think we intend here to be what we've been we've had $10 coming into the city of Long Beach. Know, I am fully supportive of this argument. I ask that we also take a look at that, you know, to see the big dollars, whereas, you know, currently than what we plan on doing with them in any'",
        "'speaker_0': 'way we can move some of these priorities, you know, in light of this crisis, that would be something I would really be interested in, you know, hearing about. So I want to thank you for bringing this up, Mrs. Price.'",
        "'speaker_0': 'And speaking of everybody's been affected that need and said, you know I heard in situations do I think this is going to be something that we will be able to help someone else if this can come to fruition?'",
        "'speaker_0': 'Thank you again, Councilman. Awesome. Thank you, Vice Mayor. Councilman. Super now. Thank you. Thank you, Councilman Austin, for bringing this item forward. I fully support it. I did have a question and I communicated with the city manager on this today and we don't know what the answer is.'",
        "'speaker_0': 'So I guess this would be in terms of a friendly. I would like to ask is would the community development block grant funds go directly to the landlords? And we don't know if we have to follow the lead of L.A. County.'",
        "'speaker_0': 'I assume so. I'd like to ask that that be added to the study. Open to the staff. It's suggested as a friendly and certainly open for staff looking at all possibilities for this. This was fun to work. Right.'",
        "'speaker_0': 'And and when they come back to give the city council an opportunity to provide that type of direction. So we don't know at this point. I don't know if we know enough to be able to prescribe actually how we're going to make such expenditures.'",
        "'speaker_0': 'But I'm not opposed to it. I think it's worth looking at because it will help all parties involved. Right. Okay. Well, at the time, I think that's a very good point as we don't really know the answer to this super nice question right now because we haven't seen the report back from the accounting, though.'",
        "'speaker_0': 'Exactly how it gets paid or who it goes to is a key question, and we would certainly include that. Thank you. That's all I have. Thanks. Thank you. Councilwoman Zendejas.'",
        "'speaker_2': 'Thank you. And thank you. Remember Aspen and all the cosigners on this? I think this is important here. I absolutely listened to me from Stephanie's point back on this policy. The majority of Long Beach, this is open truth.'",
        "'speaker_2': 'And this is especially true in the first district. We have a higher percent of renters. With that being said, we also have a high percentage of property owners. And we believe that our renters are going to be affected by not being able to pay rent.'",
        "'speaker_2': 'And so that trickles out. And so that means that our property owners will also be affected by not being able to receive the rent that they are owed. So I think this is very good for us to take a look at this.'",
        "'speaker_2': 'Like Councilmember, I said.'",
        "'speaker_0': 'This.'",
        "'speaker_2': 'Early on so that we can make sure that we all come out stronger at the end. So I'm super excited to see what the next steps are obsessed. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilmember Richardson. Thank you, Mr. Mayor. I wanted to chime in and say thank you to Councilman Austin and the COSIGNERS for introducing this motion. I think it's in alignment with what the city council has taken on in the last few weeks, and it's an important program.'",
        "'speaker_0': 'I think taking a look at what the county does and understanding that, you know, I completely agree with council members, places and us that we need to get to the table and understand just how far this will go.'",
        "'speaker_0': 'I know that we we have a number of people who are who are struggling. So I want to make sure that whatever we do is we're able to kind of stretch it or spread it out. I'm pretty sure we won't be able to cover, like, all right.'",
        "'speaker_0': 'So whatever the criteria is, let's figure out how we target those who need it, those who maybe have a gap and just need to close the gap to make make, you know, make their landlords whole. People who have, you know, demonstrated the faith payment plan.'",
        "'speaker_0': 'You know, I just want to make sure that we have some criteria that really rewards rewards, you know, people's willingness to really kind of work together with landlords and get it and get it done. I also want to say, I know that, you know, we are going to look at additional resources and funds.'",
        "'speaker_0': 'I know that CDBG, for example, could be a good use for this. I also know that it's going to be tough looking at what was going to be required to get some of these businesses back open, particularly the ones on CDBG corridors.'",
        "'speaker_0': 'And so we need to keep in mind that we have to look at. So our eviction moratorium was both for commercial and for residential. And I think as we think about what resources we have, we should think about some some support for those small businesses and commercial businesses on the CDBG corridors as well, to see how we'",
        "'speaker_0': 'can make sure that that they can, you know, can help keep their doors open and take one barrier away as they get to their recovery. Those are my thoughts and considerations, but this item has my support. Thank you.'",
        "'speaker_0': 'Councilmember Pearce.'",
        "'speaker_2': 'Thank you. Agree. I think this item is in alignment with the work that the council's taken on in the last several weeks. I did have I guess I want a few things. I want to take a moment to share our story.'",
        "'speaker_2': 'I talked to a small business owner today that owns three different small businesses in the city of Long Beach and as a renter at his home. And he shared how fascinating it is for him with the way that his landlords have been.'",
        "'speaker_2': 'The one landlord called them and said, you know what, for the month of April, you don't have to pay rent. We'll talk about what happens in May. The next landlord said, We're going to reduce your rent to 10% and then we will add on to your lease three more months and you can pay the full amount of'",
        "'speaker_2': 'rent for those three months. And then another landlord called and said, We we need to make sure you're paying your for your full rent because she had many other tenants that weren't paying rent. So I think it's really interesting to be able to look at the different situations that tenants and landlords have.'",
        "'speaker_2': 'And I agree with Councilmember Richardson's comments that really looking at the means and making sure that we're being thoughtful about maybe it's a percentage of gap for those tenants. And I think the same thing goes for landlords. We know that there are some landlords that have many properties and some that only have a few and trying to'",
        "'speaker_2': 'be get as much information from the county on how these funds are going to be distributed. If there is a conversation about paying it straight to the landlord instead of the tenant. I think that that also changes the conversation about the need of that landlord.'",
        "'speaker_2': 'You know, if they've got, you know, how many tenants do they have that are unable to pay? And so I would ask for a staff to look at that as part of the conversation. My one other comment is about the funding sources.'",
        "'speaker_2': 'I'd like to know how much of the funding sources are federal dollars. We know that our undocumented communities, which the City Council has taken a stand for many times, cannot accept dollars from the federal level. So making sure that we really have a full understanding of all of the funding sources.'",
        "'speaker_2': 'And then my last question is the county also put in 12 months the payback list, which makes it a lot easier for tenants. And so I guess my question for staff is if this council wanted to extend it from six months to 12 months, is that something that could be done on an item like this tonight, or'",
        "'speaker_2': 'is that something that we would need to bring back to council?'",
        "'speaker_0': 'This is Charlie Parker. Can't remember. That item would be, if I understand your question correctly, an amendment to the eviction moratorium. And that would have to be brought back at a separate time. It could not be done this year.'",
        "'speaker_2': 'Okay. But that is including it would be helpful for us to make sure that there's a report. Thank you for that, Charlie. But whenever we're looking at these funds and helping people pay back their rent, that we do understand that at the county level that they are giving people 12 months to pay back.'",
        "'speaker_2': 'So what that timeline looks like and an understanding that. So those are my comments. I support this item. Thank you for bringing it forward.'",
        "'speaker_0': 'Super or not. Not there were supernova. Am I looking at an old one or is this. That was my original comment, I think. Okay. Okay. Thank you. That concludes public comment. I was going to do a roll call vote on the motion in the second.'",
        "'speaker_3': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District two.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District three.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District for.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District six.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'District seven. I District eight.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'District nine.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'Motion carries.'"
    ],
    "Relinquishment of City's Rights and Termination of Covenants and Easements for Boeing Property.": [
        "'speaker_0': 'Thank you. I have two items left, but we'll.'",
        "'speaker_2': 'Do item 29.'",
        "'speaker_3': 'Report from Economic Development Recommendation to execute all documents necessary for the relinquishment of the city of long beaches, right of first refusal pertaining to real property owned by the Boeing Company District five.'",
        "'speaker_0': 'Okay. Can I get a country in Mongolia? You want to put a motion in first? Count them among. Do you want a promotion and. Okay. We'll have a motion by both Councilman's and de Haas. Can I get a second?'",
        "'speaker_0': 'Second about Councilman Bill Richardson? I think Mr. Modica did. Is there any additional updates on this? Yes. And we can give a short snap report if you want to have one. I don't think I think I think we've got the report.'",
        "'speaker_0': 'But unless you have anything additional work and. Okay, then unless there's any objection with unanimous consent, remove item 29. Please. Madam Cook, you recorded 29%.'"
    ],
    "Policy Options for Citywide Street Cleaning Program.": [
        "'speaker_3': 'A unanimous consent on item 29.'",
        "'speaker_0': 'Great. Thank you. Well, yeah. We'll move on to item 13, and then why don't I have the, uh, the clerk read the item, and then Mr. Modica, we will have a staff report on this because I know there's a lot of interest.'",
        "'speaker_0': 'And so we'll just go right in from the moment to the reading of the item into the staff report. Thank you.'",
        "'speaker_3': 'Report from Public Works. Recommendation to support reinstatement of citywide street cleaning program, including enforcement on May 4th, 2020, or adopt a policy directing staff to defer full reinstatement until the city's safer at home order is lifted. Or direct city manager to develop an implementation plan for a new citywide street cleaning program that would provide services twice a'",
        "'speaker_3': 'month citywide.'",
        "'speaker_0': 'So Amir and members of the City Council. So we did want to have a discussion with you tonight about streets within. So that is one of our critical services that we provide the community. And we every week we come and we collect thousands and thousands of pounds of trash and debris.'",
        "'speaker_0': 'And it really is one of our bigger environmental efforts that we do to keep our streets clean, but also to impact our water quality. And so when COVID 19 hit and we had the safer at home, orders go into effect that put a lot of people at home suddenly.'",
        "'speaker_0': 'And so one of the things we did under the emergency powers was to suspend the enforcement of streets we being and to do our best to continue that service while not issuing tickets. So we've done that now for about a month, and we did that as a way to provide relief as we created a program to offer'",
        "'speaker_0': 'free parking. But we really needed to come back to the council to have a higher level policy discussion about how we either continue that service or modify that service. And so we have provided you a couple of options and a recommendation.'",
        "'speaker_0': 'I will turn it over to Craig Beck to really kind of walk us through that and for us to have the debate and receive some direction tonight about how you want to move forward. So with that, I turn it over to Mr. Beck.'",
        "'speaker_0': 'Thank you, Mr. City Manager. So just to add a couple more detail, point to the information that Tom provided. I think it's important to understand that street sweeping is done citywide to not only address the dirt and debris in the gutter, but to also ensure that we have clean water because our storm drains flow into the L.A.'",
        "'speaker_0': 'River and then ultimately to our beach. So part of the National Pollution Discharge Elimination System Permit, or you may hear us say in the PD, yes, the city is responsible for ensuring that the water is clean before it is pushed into the river.'",
        "'speaker_0': 'And so one of the main ways that we we meet that standard and that requirement is through our streets, our streets sweeping efforts. As Mr. Modica said, we did suspend enforcement of street sweeping restrictions, parking restrictions on March 17th and we've been operating under that program now for a little more than a month as a way to'",
        "'speaker_0': 'try to address some of the parking challenges that many of our multi-family community neighborhoods have. We implemented the free parking program and so we have through this free parking program, made available over 4000 parking spaces. The number is actually 4307, to be exact.'",
        "'speaker_0': 'And we have roughly 1200 residents who have taken advantage of that free program. All of our lots under that program, with the exception of maybe one or two, are still open and have parking available to be utilized. And so since we've been operating under this program, one of the challenges that we've been experiencing is that people are'",
        "'speaker_0': 'now not moving their cars. In the beginning, we did see that people would move their cars on their designated street sweeping day. But now that is not happening. And we're before council this evening making a recommendation that we move back to an enforcement model so we can get to our street sweep program.'",
        "'speaker_0': 'And for women, are our clean streets strategy under our MVPDs permit. As as you may have read in the Stack proposal, there are three opportunities that we've presented to you. I think the one that staff is leaning towards is that we move back towards an enforcement mechanism, but maybe we implement a a warning instead of issuing tickets'",
        "'speaker_0': '. So we could provide a warning for those that don't move their vehicles and then also provide information about where there is free parking opportunities. That concludes our report, and we're available to answer any questions. Thank you. I have a full list of folks that are queued up.'",
        "'speaker_0': 'Let me just make a couple a couple of comments and then turn this over to the to the council. I just really want to thank staff. I know that this has been one of the more challenging issues for us.'",
        "'speaker_0': 'I think it's important to note, and we've said this many times, that sweeping is a critical health and safety function and ensuring that streets are not only cleaned for for for health purposes. And they are it's a water quality issue, like you mentioned, and it's really a store management issue as well.'",
        "'speaker_0': 'And when we get rains, it just becomes more difficult, of course, to manage when you have drains that are full and that have not been cleaned. And so I really understand the work and and the strategic push back during the crisis.'",
        "'speaker_0': 'I'm also very, very sensitive to the idea that in areas that are parking impacted, which is not a majority of the city, but in these areas that do have impacts on parking, whether these are areas that are laid out in the code or whether they're not in the code as parking impacted areas.'",
        "'speaker_0': 'But but areas that we know still have challenges with parking. You do have serious, serious challenges. These are, in some cases, cases lower income communities, families that certainly would have a hard time paying the ticket during this time.'",
        "'speaker_0': 'And so I just want to thank the staff for pushing the sweeping citation process.'",
        "'speaker_2': 'Back.'",
        "'speaker_0': 'And and trying to work with the community on that as well. I am a. I'm interested to see what the council's thoughts are on this. I have personally some interest that we just don't go immediately back to fighting folks.'",
        "'speaker_0': 'I think there's a way to ease into that process in a way that includes some warnings, but that we make it clear that streets we need to continue. And so I'm happy to share those. But I want to also hear from the four from the full council as well.'",
        "'speaker_0': 'And so I've got a full list of folks. So let me just go through that list. And Councilmember Richardson. Thank you, Mr. Mayor. My comments would be brief, though. So, you know, I'm not a district that has immense parking impacts.'",
        "'speaker_0': 'We have just, you know, one or two few areas that have apartment. However, you know, my district is one that sees a lot of damage when the streets are not clear and especially when there's rain. We have tremendous flooding in the Grant neighborhood and the Hamilton neighborhood.'",
        "'speaker_0': 'And so street sweeping is incredibly important. I also understand I completely understand, you know, folks are staying home and getting tickets and, you know, people are well, the people not shouldn't necessarily get tickets. So we need to figure out a balance here.'",
        "'speaker_0': 'What I think I'd like to see is a slow, gradual phase in of the street sweeping enforcement. I think that might look like, you know, for maybe in in part of the impacted areas. You know, those tickets are maybe it's a warning.'",
        "'speaker_0': 'Like the mayor mentioned, maybe a warning system in the park impacted areas for a few weeks while the phase is in. And if even a little bit a little bit faster, more immediately in the non parking impacted areas.'",
        "'speaker_0': 'So I again my, my comments will be short, but that's what I'd like to see. And so I move the item, I move the item for staff to sort of present a process that allows us to have some gradual phased in the more parking in impacted areas.'",
        "'speaker_0': 'But we do begin the process of collecting parking, ticket fees and enforcement in streets. We think yes. Street sweeping enforcement. So that so that's my most. Okay. And then, councilman, maybe you'll be open to kind of refining that as we as we move forward.'",
        "'speaker_0': 'Okay. Councilmember Pearce.'",
        "'speaker_2': 'Thank you, Mayor, and thank you for your comments. I want to thank staff as well being one of the most parking impacted districts. We definitely appreciate that. We've been able to not give tickets. I did walk almost all day on Saturday and saw many residents cleaning out their gutters.'",
        "'speaker_2': 'This is in addition to the emails and phone calls that my office has gotten about the streets being not clean. Of course, balancing that with the parking needs and the fact that people do not have income or their income is much smaller than it was before is really important.'",
        "'speaker_2': 'So I like the motion that was made by Councilmember Richardson. I think that there is we did a phased in approach. So I think around May 4th, if I recall the day the that staff wanted to go back to Street three being if we had a phased in approach through the day of the stay at home order'",
        "'speaker_2': '. And so we would be doing. Warning with those cars two weeks prior. I think that that would make a lot of sense. We know one of the most difficult things about changing city services is really informing the residents of what services are changing and what that timeline is.'",
        "'speaker_2': 'I think that if we did those warnings, it would also make sense to include in there the information about the city lights that are open. While I appreciate that the city that we've opened up so many lot of lives aren't in the middle of neighborhoods, which is why people are still, you know, aren't moving their cars as'",
        "'speaker_2': 'often as we would like and why we still have spaces available. I would ask that if I know that we have been hesitant to waive meters and one of the arguments has been that we have small businesses that count on those meters to turn over.'",
        "'speaker_2': 'The fact is, if you drive down by March or you drive down Fourth Street or down find, there aren't people parked in those meters. And so if we did a two week period, I would like to see staff give us a presentation or include some information on waiving the meter fees up until the stay at home order'",
        "'speaker_2': 'so that people have a place to move their car on street sleeping days because right now they don't. That's not not something that makes sense for them, but not by box at ten blocks away. And then the other question, and I don't think I asked this last time we talked about parking and I'm going to put our'",
        "'speaker_2': 'city attorney on the spot because I know we've talked offline about this with Starbucks, but I wanted to clarify one more time. A year ago or so, we had asked for the city to propose funding to allow people to park in a private lot and that we wanted to work with those private lots to open them up'",
        "'speaker_2': ', whether it be something like we have at Fourth and Cherry, which has a city meter and we share the meter revenue. I had heard from from staff that that was something that was not able to move forward because of legal concerns.'",
        "'speaker_2': 'Is that? I'm not sure. Probably if you remember, it's been a while. But do you recall legal concerns with us partnering with Private Light?'",
        "'speaker_0': 'Council member not I don't have a clear recollection of that. A while ago we did look at some private lives for this current situation, and there have been several legal issues that have come up with trying to reach agreements with the private lives or the private property owners who want the city to either indemnify them or compensate'",
        "'speaker_0': 'them for the use of the lots. There have been some businesses that, after we've spoken to them, have just decided they would allow the public to park in those lots and others have have remained off limits. But there have been some concerns raised by the private property owners and some of them are very justified on the liability'",
        "'speaker_0': 'issues.'",
        "'speaker_2': 'Mm. Thank you. And I think that that was what we had talked about before was the city providing an insurance policy, but that that came back being too expensive. So I've had lots of people ask about this because we have lots of empty private lights in my district.'",
        "'speaker_2': 'So that's why I want to go on record to just make sure that. The city has done their due diligence to try to open up those lots and that that has not happened, not on any part of the city.'",
        "'speaker_0': 'That's to say this is time that the same issue that Charlie enumerated now was the same issue that we were having back then. So it really is a question of who accepts the liability if there is a claim.'",
        "'speaker_0': 'You know, we're not in charge of those lights. So that was a concern. If somebody has an 88 claim and we've taken it over, who then accepts that liability. So that is something, you know, we're in different territory and times now, we're in a much more of a of a crisis.'",
        "'speaker_0': 'Now, if there's certain lights that are really important for us to look at, and that's a policy choice that you're willing to accept that that risk. We can look at those. But just looking at every light, I think would be we want to be a little judicious on how we do that.'",
        "'speaker_2': 'And I think that there are you know, there's lot so in my district on seventh Street, we've got Beatty, which has over 50 parking spots in a parking impacted area. And I know years before they had that they were open to it.'",
        "'speaker_2': 'And so we obviously everything's closed has been difficult to get hold of people, but I think it's another issue. But just bringing this issue back at now might not be the time if we've already kind of done our due diligence there, but I think we have to revisit it because we have parking impacts, those people that are'",
        "'speaker_2': 'extremely that are in tough situations. And so I just want to make sure that we're doing everything that we can, if that means revisiting it. I would appreciate that right now for this item. I like the motion that was made by Councilmember Richardson.'",
        "'speaker_2': 'I would hope that we can kind of hone in. I want to hear the rest of the council. But if we could do two weeks of warning in the parking impacted district in particular, I think that that would be great if there's an option for lower ticket prices or ticket fees.'",
        "'speaker_2': 'And then I think making sure that we're sharing information on those notices or warnings that there are other parking options because there are still people that that aren't aware of that. And so I look forward to hearing from my council colleagues at the.'",
        "'speaker_0': 'And this is time, you know, Mr. Mayor, can I respond to one thing? Her. So we can certainly look again and revisit the issue of private lives. I do think we are in different times than before where that was a pretty large liability that we were accepting that, you know, was was not really related to what we're'",
        "'speaker_0': 'looking at now, which is some, you know, some very, very tough times on people. So if you would like us to look at one or two, we could get that direction from counsel. I'd like to ask that we keep it focused.'",
        "'speaker_0': 'And if you have ones in your district that you really want us to look at again, we can do that and and go and contact those groups and hopefully they'd be willing to let us use their lights and we would work on the liability issue.'",
        "'speaker_2': 'Thank you, Tom. I yes. I mean, at least right off the top of my head, that is a lot that is, like I mentioned, kind of in the heart of it and would be a great lot. The other one is it's called the Broadway Bar, which is on Broadway, has about 20 plus spots in the back and'",
        "'speaker_2': 'it's gated. They have not been willing before, but but they might be now. So would love it if you guys could work with them.'",
        "'speaker_0': 'Thank you. Vice Mayor Andrews. You know, Tom, I want to really commend you and your leadership with our city team, which has been incredible during this crisis. You know all of you. Your department should be proud of, you know, the hard work.'",
        "'speaker_0': 'You know, the key issues doing, you know, this crisis. You know, but I read the South report that, in fact, there are that I met with that with the apartment building and mass and multifamily complexes. Only 15% of the street sleepers has been successful.'",
        "'speaker_0': 'You know, it concerns me that the cleanest of which result may help satisfy our residents, you know. But I believe. And anything that we implement. A large outreach campaign needs to be followed soon so that the residents are clear on what we are planning to do.'",
        "'speaker_0': 'No opportunity cost as information come when it changes week by week. So there's a lot of confusion. And I'd like to ask you, Tom, what you know with this. What can we do with this information and our utility to act on the affected by the fact remains that need to be you know you are smart enough to'",
        "'speaker_0': 'ask given that information about the program and the utilities both have information and know what to do about the possibility that we could do that. I don't know what we could enact. I'm just asking. So thank you for the suggestion, Vice Mayor.'",
        "'speaker_0': 'We have a lot of different ways to get information out. We can certainly look at utility buildings that tend to take 28 day cycles because we do it every single day. So we would miss certain areas if we did that just from a timing perspective, but we would definitely look at ways.'",
        "'speaker_0': 'I think the council had a good suggestion of putting it on people's cars is probably the easiest way to do it and get it directly to people. So when we're doing those those warnings that we would basically just put something right in there and so that they could find out about our programs.'",
        "'speaker_0': 'But we'll look at a lot of different options, including what you add four times a year. Thank you very much. Thank you. And before I go, let me just a quick announcement on the queuing system. I have everyone queued up.'",
        "'speaker_0': 'However, if you queue if you say if you go, if you push your service the number twice, then you lose your place in the queue and you go back to the very end. So I'm just asking. So once an item comes up and if queue and one don't, don't, don't put a second message into the system because'",
        "'speaker_0': 'it goes to the end of the line. Did that make sense? So I think Councilman Price may have done that. And I'm going to put you back in your original spot. So just please. And Rex, you also did the same thing.'",
        "'speaker_0': 'So if you guys can just just queue one, that's great. Okay. So. DB So Councilwoman Price and then that customer prices for next.'",
        "'speaker_2': 'Thank you very much and thanks for that clarification. I felt like I queued up right when they announced the item, but in any event, I like the motion that's on the floor. If I if I understand it correctly, my recommendation or my motion was going to be based on my conversations with Craig back that we resume normal'",
        "'speaker_2': ', we resume normal street sweeping operations May 1st, of course, and then we have a two week warning period where there are no citations issued and warnings are given. And in my discussions with Craig, that would align perfectly with right now, we're not ticketing up until May 1st and then we're looking at some of the stay at home'",
        "'speaker_2': 'orders being extended till May 15th so that that time period would coincide with what we think where the state is headed. So that was going to be my recommendation, hopefully, Councilman Richardson, you're open to refining your motion a little bit to add some of those details.'",
        "'speaker_2': 'Otherwise, I support the motion and concepts that I think two things are important. But supporting people at this unprecedented time is important as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman, Mango.'",
        "'speaker_2': 'I think you and I could put out of this. I wasn't sure if it was a recommendation of a friend of mine. We have a lot of areas that have seniors that when people park.'",
        "'speaker_0': 'In front of their house.'",
        "'speaker_2': 'They are not really as mobile to go out into the street. But as Olympia Snowe seems that her neighbors have gone out and cleaned up the as I mentioned, to come to America on several occasions. There have been times where my husband or I go out and get a dustpan and help a neighbor.'",
        "'speaker_2': 'But we.'",
        "'speaker_0': 'Have neighbors who are.'",
        "'speaker_2': 'Actually regularly.'",
        "'speaker_0': 'For us to resume.'",
        "'speaker_2': 'Those simply being so my has to be that the warnings are given in Turkey and actually we maintain and go back to the way we announced we would in areas that are not parking impacted, at least similar to Councilman Richardson during the day.'",
        "'speaker_2': 'So people are home, they can move their cars is even a possibility. I know our previous public works director talked about some efficiencies that could be had in the system.'",
        "'speaker_0': 'With doing multiple streets in a.'",
        "'speaker_2': 'Day in a different way. That wouldn't be possible with a fully engaged workforce. So I'm open to explain everything. But from our side we really do have a challenge with the gutters being pretty filthy and with the amount of debris falling from the trees.'",
        "'speaker_2': 'It gets to a point where if a car has been there for one week, that's two weeks of debris and a street sweeper can't even pick up the amount of debris that's in the gutter, it literally has to be picked up.'",
        "'speaker_2': 'And our.'",
        "'speaker_0': 'Team teams are very.'",
        "'speaker_2': 'Busy and other things.'",
        "'speaker_0': 'Keep thinking, Councilwoman. I mean, I know we still have a couple customers on that field. I'm going to make some comments because I think a lot of this is actually aligning. And it seems like there's a similar theme that's kind of emerging from the comments.'",
        "'speaker_0': 'Councilman Price has made a customer, Richardson, Councilman Mongo Pearce. And so maybe if I can just make a couple of comments to the maker of the motion and and refine it. And then if there's additional comment or if we don't like the refinements, I'm sure we'll we'll I look forward to hearing from the members.'",
        "'speaker_0': 'So I also agree I do like but for starters, I think that the the the citation period and signing period. I think that Councilman Price just mentioned the the the March 17th date or the end of the safer at home date.'",
        "'speaker_0': 'And I think that certainly should be the case or whether it's citywide, which I could support. Absolutely. Or whether it's for the parking impacted areas. But I think that should absolutely be the time when we get back to normal citation that should end with the separate homes.'",
        "'speaker_0': 'So really support that. I would also add that there should be, I think, a two week warning system. I like that that's been mentioned on the call and I would just get into a little bit of the details.'",
        "'speaker_0': 'I think what I'd like to see from staff is that in those two weeks leading up to it that on week one you would have essentially what would look like a citation or a version of a note that would go in the car.'",
        "'speaker_0': 'And that note would essentially say, you know, on this date. Citation and enforcement will begin again. And we have, you know, what's available for you to park your car for free and to access these lots. Here's the website or here's a phone number where you can call.'",
        "'speaker_0': 'And so not only that people have two weeks to adjust, but we're also giving them the information about where they can park their car for free in their nearest lot that we've created. We've created lots. I know across the city there's an opportunity to create maybe, maybe more of those.'",
        "'speaker_0': 'And so I'd like to see a system that way that where they can it's on their car. All right. The warning done for two weeks. And and I think that's especially important in parking impacted areas. I would also ask the maker of the motion to consider the code has a very defined version of what parking in a'",
        "'speaker_0': 'parking parking area actually is. And there actually aren't that many across the city. I believe Councilwoman Price and Councilwoman Pierce have official parking impacted areas, but not very many other parts of the city are are called out that way.'",
        "'speaker_0': 'In the coach I would ask that it's it's areas that are either defined in the code or defined by the city manager in consultation with the council members that might have areas where they feel are going to need that additional support.'",
        "'speaker_0': 'If if if we if we go with the the tiered system, which Councilman Mongo is saying. So I could support either the, you know, the citation citywide and parking impacted areas yet get you know, get noticed but I also like just giving everybody the we the the the the notice as well and not doing citations until we'",
        "'speaker_0': 'get closer to the safer at home. And so I can support either and look forward to hearing what witnesses comments are. And maybe Councilman Richardson, we can discuss those once we go to the the council comment. Absolutely. Okay.'",
        "'speaker_0': 'Next up is Councilwoman Zendaya's.'",
        "'speaker_2': 'You think your council members are just going for the motions? Understood that is a very high level protein impact said even before this crisis and have in a lot of our lives and in my district this was people with disabilities.'",
        "'speaker_2': 'I think that it's very important to to really recognize where those. Hoping impacted areas are testing in.'",
        "'speaker_0': 'Parcel effects to.'",
        "'speaker_2': 'Be more specific and maybe start work on old street sleeping works not so parking impacted. So I think that it's really important to make sure that we that we only stay at home order in a lot of things this seniors who aren't drinking and or aren't parking out in the street.'",
        "'speaker_2': 'You know, they're very nervous about going outside, period. And so it's going to be hard for them to go outside every week and, you know, move their coat. But for.'",
        "'speaker_0': 'Clarification.'",
        "'speaker_2': 'We are hoping to resume parking with what the previous council members have have added and and the mayor on May 4th, is that correct?'",
        "'speaker_0': 'And I think that.'",
        "'speaker_2': 'When you have.'",
        "'speaker_0': 'What you would.'",
        "'speaker_2': 'See a phase in time. Up until then, the stay at home order is lifted. Am I correct?'",
        "'speaker_0': 'Yeah, I think, Councilwoman, I think just to clarify, I think the day that staff is looking at is May 4th for kind of for resuming of street sweeping was their suggestion because I think that the Monday if I'm not Ms. right there right.'",
        "'speaker_0': 'Mr.. Modica and then the main corrective and then the May 17th date is essentially the Monday after the stay at home is left. Is that also correct? Yes. The stay at home goes through the 15th and the Monday would be actually the 18th.'",
        "'speaker_0': 'Okay. The Monday would be that would be when enforcement would could begin. Okay. So. So, go ahead, Councilwoman.'",
        "'speaker_2': 'Yes, I absolutely support that. Keeping in mind that we focus on the highly impacted parking areas and being a little bit more flexible with those that are not so highly impacted. And I think that would bring some kind of a balance, too, to this item.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Mayor. This was hey, I just out on the. I think from a legal standpoint, we're going to be have a very difficult time. As you pointed out, we have very limited the impact areas are defined and we can't just ask the council or staff to start determining which block is going to get a citation and which isn't'",
        "'speaker_0': '. So I would from from the seat it would be much more manageable if there was a two week notice period for the city. And then he went back to issuing the citations versus trying to break up neighborhoods by block by block.'",
        "'speaker_0': 'Thank you. This is Tom. The city staff would agree with that as well, that it would be difficult to really identify what those parking impacted areas would be. We do have a map, but we know that many of you get calls about areas where people believe that they're parking impacted, but they may not actually be according to'",
        "'speaker_0': 'the definition.'",
        "'speaker_2': 'Yes. Yes. Thank you for that consultation and it makes complete sense. So in other words, what we're trying to do is.'",
        "'speaker_0': 'We still.'",
        "'speaker_2': 'Are quite keen on this place.'",
        "'speaker_0': 'With.'",
        "'speaker_2': 'Citations. Well, not really, say patients that have validation or that come with a cost, but actual information where they can go into a meeting.'",
        "'speaker_0': 'Yeah. Yeah, yeah. Come through it there. Yeah, I think. I think there's. Yeah, I think we're, we're, we're getting there. I think that you're you're seeing citations I made keen to get clarity on. That is very important. Yes.'",
        "'speaker_0': 'Okay. So let me do that. I have I also have two more speakers or three more that have not spoken yet and then everyone else kind of queued up again. And then I'd like to also get clarification on what the actual meant were.'",
        "'speaker_0': 'The main motion is that I think there's been kind of friendlies, but maybe not official friendlies. And so that way we can we can know we know where we are exactly. So let me keep going through that through the speakers list or American Council.'",
        "'speaker_0': 'Give the questions.'",
        "'speaker_2': 'No, no, that's okay. You.'",
        "'speaker_0': 'Okay. Thank you, Councilmember Superman. Thank you. I appreciate all the input so far. But the fourth district is very unique due to its extremes, so I really can't support the motion at all as made. So for instance, on the eastern half of the fourth district, I agree with Councilwoman Mango.'",
        "'speaker_0': 'We have the same challenges in terms of leaves. 90815 is the least dense zip code in the city with 5300 people three square mile the western part, the park district is 90804 that is the most yes zip code in the city with 18,200 residents per square mile.'",
        "'speaker_0': 'So we have tremendous parking impacts on the western half of the district couple that were the parking lot that were suggested by public works. And we had one in our district route library, which I believe we suggested a total of six parking spaces.'",
        "'speaker_0': 'That's the lowest number and we just don't have the commercial lots available. So it really doesn't work at all for the fourth District to have citations again. And let me say one thing about the warnings, because we've had experiences with this.'",
        "'speaker_0': 'Unfortunately, the warning citation looks identical to a parking ticket. So what happens to the person, the resident approaching the car gets that sinking feeling in their heart as they approach the car, and you have to study it to see that it's a warning.'",
        "'speaker_0': 'So if we do go with warnings, I would highly recommend that it looks completely different from a from a parking citation. We've had a lot of pushback on that. So as it stands, I think we couldn't do anything until the stay in order stay at home order is removed.'",
        "'speaker_0': 'If there's a warning system, I would not want it to look like any type of citation. And I guess the last thing is we would certainly have to have a confirmation that the stay at home order was lifted before we could ever accept, you know, the return of the citations.'",
        "'speaker_0': 'That's all I have. Thank you. Thank you, Councilmember. And next up is customary Ringo tacular in a big screen with everything he said about the plan to get this medication as to how we're going to implement this program.'",
        "'speaker_0': 'I do like the fact that we are going to have a warning system that at the end of the day, you will say nothing at all. But when we're looking at the fact that we want to warn people, we're re-implementing the street sweeping sentencing program where those control over supervised results are included.'",
        "'speaker_0': 'Every district should weigh on that is impacted as perhaps is in my district is how you residential what I do have these positive stories that are impacted that may not be the definition as it worked and could. So what I'm thinking about is that on top of that, we're looking at a drug that that I don't really'",
        "'speaker_0': 'agree with that we're looking at the what we've seen since the fraudulent injury reinstitution that we can control the treatment program. What happens if for some reason and we know what the reason is, obviously we have to extend the stay at home program and it goes down to 15 and we have these impacted neighborhoods.'",
        "'speaker_0': 'That will continue to be that way. And then the people are going to have to remain with continue to stay home. And here we are again. And then with the reinstitution of the sweeping program, again, I would say a little bit nebulous as to what direction that is going to take.'",
        "'speaker_0': 'I'm hoping that maybe we can work with some of those councilmembers who have more impacted local runners to identify those areas. So should the. Stay at home, mom continues. Because we are on the 15th, but we are able to work with with our council colleagues, with public works to determine what those levels are so that we can'",
        "'speaker_0': 'determine whether we should continue to invest in that area or not. And then from there, the other issue that I have with with the warnings, obviously, is the fact that we just went through an equity tool kit resolution this evening.'",
        "'speaker_0': 'And obviously, language access is going to be a big part of this. And I know it's going to be difficult. But if if the warnings are short enough, I would love to see those warnings put in the three languages that we need, most notably Spanish to garlic and cravats, especially in those areas where we know that those'",
        "'speaker_0': 'are the holy places, which is basically the six and seven remain are the ones we've had no problem with, of course, where we're getting easier. So that's another. There's a little a little penalty in the in the issue that we got to look at in regards to making sure that everybody gets workable.'",
        "'speaker_0': 'Celebrity guest set at the same time and everybody is on the same page when it comes to this. So all that my comment, we were looking forward to see if we can work this out. Thank you. And Councilmember Austin.'",
        "'speaker_0': 'Thank you, Mr. Mayor. So I think I support the direction that this ends and possibly the motion on the floor. I want to I'm looking at this from a public health lens and the public health issue. And I think there is because we're making changes to to policy and operations in the city in response to COVID 19'",
        "'speaker_0': '. There's a big conclusion that comes with that potentially with many of our residents and seniors are no longer issuing parking tickets and reversing course and going I to require a level of thought and sensitivity in terms of how we kind of get back to normal.'",
        "'speaker_0': 'So I think the phased approach, you know, the carrot approach to getting us back to some place where, you know, unfortunately parking tickets will be awesome because, you know, that's part of the system. I want to re-emphasize, too, that I don't think that this is and I'm glad that I haven't heard of any of this, but I'",
        "'speaker_0': 'heard from, you know, some. Social media comment regarding the shooting, wants to get the money for parking tickets and we've had more discussions before. This has less to do with revenue from parking tickets and more to do with public health and our ability to clean our streets.'",
        "'speaker_0': 'We've been doing a disservice to any neighborhood in the city if we were to say, okay, we're going to ignore stupid things in this particular area of this city versus that particular area of the city, because we would be further exposing population to vulnerabilities of public health that born of ability.'",
        "'speaker_0': 'So I think know, I do appreciate the thought that's going into the conversation here. I think as far as warnings, I'd like to to be creative and possible with those warnings and stuff. But we've always been innovative and creative.'",
        "'speaker_0': 'You know, I agree that, you know, just having someone out there issuing tickets looks like standard operating procedure. I'm willing to take something a bit further. And I know we're reclassifying duties of city employees. You know, there may be an opportunity for some to do some some outreach, actual outreach in the communities, particularly in the impacted communities'",
        "'speaker_0': ', to provide warning and really check the busses and say, we have done all we can do to ensure that residents are well informed about. That's kind of closing in on these policies again. And then, you know, when I talk about creativity, damage to babies, there's no technology available on our disposal.'",
        "'speaker_0': 'You know, I think it would be really helpful if I were to get a text message from a similar language to let me know straight people want as well. I've got a 15 minute notice on that. I'm probably going to give some thought to moving my vehicle.'",
        "'speaker_0': 'I think that's something that should be looked at. I don't know if there's time to do that to implement this, but just something that I know we have data and cell phone data on a lot of our residents.'",
        "'speaker_0': 'But, you know, it's possible sometimes you know, how to make an emotion as friendly to, I don't know, suggestions. I mean, I was also thinking about the weather forecast because I'm like the major function of states. Would we have to do with, you know, prevention and smoking and other issues that can come from that, having taken in'",
        "'speaker_0': 'always taking into consideration weather forecast on its own? No, I think we haven't turned the corner. Have we seen the worst of the rains and potential flooding in the city, which is something that we've got to respond to as well.'",
        "'speaker_0': 'But again, I like the direction this is going in. I think I can support the what is on the floor. I hope that to be a phased in model and phased in approach, not the only one in and then stepping it up.'",
        "'speaker_0': 'I think that's the best approach to take, but I would love to get some clarification on what's on the table, what's before us as well. My comment is don't take a compliment. And I have just for people that are chewed up for a second time.'",
        "'speaker_0': 'So I'm going to do I'm going to ask some clarification as well, and then I'll go to the folks for the second round. I mean, go back to the original motion, Councilman Richardson. And so. Great. And so I think you've heard obviously from from everyone.'",
        "'speaker_0': 'I think that and you've heard from me, I think staff comment especially on kind of the difficulty of doing that, you know, two separate groups. And I think what I've heard is that they would that the enforcement piece word would begin after the fifth third home order is lifted.'",
        "'speaker_0': 'I think I heard that from almost everyone and would begin on on May 18th, the enforcement piece. But the actual street sweeping kind of slash warning system would begin two weeks before that on me, or for that matter, once again, I think that's where I kind of heard that.'",
        "'speaker_0': 'Captain Richardson. Yeah, sure. Thanks. So, you know, I think what we have in front of us now are fine. It's clear, simple. We're going to start back street sweeping activities on the fourth. We're going to do warnings for two weeks.'",
        "'speaker_0': 'And on the 18th, after the stay home order is lifted, we'll be in sexual activity. So that's what the motion is. Also want to make sure that, you know, acknowledge, you know, some great comment and some direction the city staff around the gravity station.'",
        "'speaker_0': 'I think we should make sure that those are reflected as well. And the other thing that came up a bit earlier, we continue to look for of support, not only quite a lot of, but I think it's a pretty straight forward motion that is reflective of where I think the council is.'",
        "'speaker_0': 'What I've heard from majority of people where we are right now. Thank you. Can I just add also I want to just also uplift councilor a super I comment that we don't make the the the warning system look exactly like a parking ticket, but there's some deference to that.'",
        "'speaker_0': 'And then I do like I think councilman asked and if there's there's a I mean it's staff will have to see but if there's an opportunity in putting impacted areas to do some kind of door to door work or some more kind of on the ground warning on top of the warnings that we'll be doing on the'",
        "'speaker_0': 'on the cars. I think that's great as well. So I like all of that as well. And I think that's a great I think that's a good motion that's on the floor. And you're going to start with those items, right, Governor Richardson?'",
        "'speaker_0': 'Absolutely. Okay, great. So let me if I can have two questions. Yes. So we I heard two different things and I just wanted to get some clarity. We talked about very specific date to which was May 4th to May 18th, but then we also heard until Safer at home is lifted.'",
        "'speaker_0': 'And while we all hope that by the time we get close to that March 18th, there's going to be amendments to our safer at home ordinance. It may not be that it's completely lifted. There may be certain types of restrictions, so there might be some changes.'",
        "'speaker_0': 'And so those are kind of two different concepts. The May 18 or completely changing. I do want to remind us that we are one of the few agencies that actually has a date in our order. And the governor's order is unlimited.'",
        "'speaker_0': 'It does not have a date. So the governor's order is would be in place. So if I can just get some clarity on that, we can certainly reassess as we get closer to the 18th. I think that I think yeah.'",
        "'speaker_0': 'I think Governor Christie is at the 18th, correct? Yes. Okay. And I think I want to also just note that obviously as we get closer, there are other changes. So the council can come back and make and make adjustments, obviously.'",
        "'speaker_0': 'So let's open up. Absolutely. Thank you. I go back to the second round, Councilmember Pierce.'",
        "'speaker_2': 'Thank you and thank you for clarifying the item as it is of the motion that's on the floor. I wanted to queue up and just look three things. One is I had also mentioned about meters and so I wanted to clarify a request on that would be that we waive the meters during suite three sleeping days and'",
        "'speaker_2': 'find out if that is something that is doable. So could staff respond to that request?'",
        "'speaker_0': 'Councilmember Pearce regarding waiving the meters. I don't know how that would work. I think that it would be if this is a direction that this council wants to go, I think it would be better to agenda's that item and talk specifically about when we would waive metered parking.'",
        "'speaker_0': 'What you find is that most of our parking meters are in commercial areas and they're separate from where we find most of the residential parking impacts. And so I'm not sure how it would provide relief, but I would defer to the city attorney.'",
        "'speaker_0': 'My guess is we would have two agendas separately.'",
        "'speaker_2': 'So I guess the areas that I like to diverge.'",
        "'speaker_0': 'In that.'",
        "'speaker_2': 'It would have to be a separate agenda item. Okay. And maybe at this point, I mean, we're just a couple of weeks out, I wish I would have thought to agenda that earlier. But really, the thought for me was the fact that Fourth Street is in the middle of a parking impacted area and it's completely vacant.'",
        "'speaker_2': 'And so I was hoping that during the time that we were trying to get cars to move, that might be an option, but we'll explore that later. The other piece that I wanted to lift up was the language access.'",
        "'speaker_2': 'What is the protocol for a parking ticket? I mean, I used to get them all the time. It's been a while. Is there language that somebody needs to sound like someone's buying? Thank you. What is on the tickets right now as far as language access?'",
        "'speaker_0': 'To Councilmember. I think what we would bring forward as your staff is that we would essentially create an informational piece. And so instead of using a ticket warning system, we would use more of a flier that's more of an informational warning system so that those would be placed on the cars.'",
        "'speaker_0': 'It would talk about the neighborhood parking program. It would talk about street sweeping and and the reasons why we clean our streets for it, for health and safety of our population, and that that we would ensure it was in multiple languages.'",
        "'speaker_2': 'So that's what I was I was looking for. And then I know everybody's already gone around and I'm. Maybe if I could just. Maybe hear the mayor on this on the citation beginning the day or the day after the stay at home order is lifted.'",
        "'speaker_2': 'I do not imagine that the day after the stay at home order is lifted that people are not are not going to be home. They're going to be you know, they're going to be waiting for their job to start again.'",
        "'speaker_2': 'They're going to be waiting for businesses to reopen. So even if we had a week delay. I just. I wanted to propose that. I'm curious what the mayor's thoughts are on it. Yeah.'",
        "'speaker_0': 'But I think I mean, I think that I think the motion on the floor is is a good reflection of kind of other council comments. I do think that, you know, the only caveat is that as we I think we're going to know a lot more in a week, ten days about our stay at home order day'",
        "'speaker_0': ', which, of course, is the same as all 80 cities in the county. So we're all together. I, I could be wrong, but I expect that our stay at home order is going to look different. I will look differently on May the 16th, and it might, you know, and I think that there are going to be changes that'",
        "'speaker_0': 'are that are on on their way. I don't know exactly what yet, but I think that because we've been because we have been promoting that may stay at home order date. I think it's it's a nice date for this to kind of align with which is the closing of that stay at home order.'",
        "'speaker_0': 'And then if we've got to change it, we'll be back having a debate or a discussion, I think, in the future.'",
        "'speaker_2': 'Thank you. I'm going I'm great with the idea as it is. Appreciate it.'",
        "'speaker_0': 'Thank you. Let me see. I have councilwoman and they asked.'",
        "'speaker_2': 'Me thinking I can type. Quick question then. I am hoping you will be able to answer that. I am wondering in the days when these street people go, if they wait for.'",
        "'speaker_0': 'The.'",
        "'speaker_2': 'Second person, because I'm assuming they can see behind them that they could be a great behind the street sweepers to avoid hitting people with tickets. Who saw the street sweeper passed already like 3 minutes ago. I'm not sure how that works.'",
        "'speaker_2': 'Is that how that works? Like become ratings in them?'",
        "'speaker_0': 'So council members in their house? Yes. Typically as a parking enforcement vehicle will follow the sweeper. But if but but there are situations where that enforcement officer is stopped to issue a citation. And the sweeper keeps going. And so sometimes there's there's there's a delay until they get caught up.'",
        "'speaker_0': 'One of the things that we have really been working on first, we really we did our third sweeping optimization program, you may recall, where we changed the start times in residential neighborhoods. We moved the start times back and that was really at the leadership of the mayor in this council to make it easier for folks to to'",
        "'speaker_0': 'be able to comply with those time restrictions. So the next phase of this that we've been looking through and we're hopeful that we can implement this year, is that we would be able to shorten those sweeping times, time and and that at that might be addressed that might be able to address what what you're bringing up, which'",
        "'speaker_0': 'is that instead of a two hour restricted time zone, maybe it's only an hour.'",
        "'speaker_2': 'Yeah. So especially during this time, maybe see if that's a possibility for, for it to happen during this next coming month. That would be nice of you guys to look at that. And in addition, I know that a lot of people will be dealing with not having jobs and not having the financial means to heal people's tickets'",
        "'speaker_2': '. And I don't know if this is the place or if, you know, I have to see this for a different time. But is there a way that we can upgrade to possibly even cutting that place on the ticket, that they get it in half?'",
        "'speaker_2': 'How much is that right now if you guys know? I don't know that off the top of my head.'",
        "'speaker_0': 'Thank you, Councilwoman Councilmember Mongo.'",
        "'speaker_2': 'Oh, I'm sorry. I was waiting for an answer.'",
        "'speaker_0': 'I'm sorry about that, Mr. Modica, and I'm sorry we had we had a little technical issue there. Can you ask that again, please?'",
        "'speaker_2': 'Oh, you're kidding me.'",
        "'speaker_0': 'I didn't hear the question either. Oh.'",
        "'speaker_2': 'My question was that how much are the tickets right now? And if we could look, we may be cutting the tickets maybe in half or in the next couple of weeks or so once that is implemented, to give the residents a chance to recoup from this crisis financially.'",
        "'speaker_0': 'So Councilmember currently the streets within circuit is priced at $70 and I believe it would require a change to be tabled to to move forward with what you're suggesting.'",
        "'speaker_2': 'So at a different time.'",
        "'speaker_0': 'Yes. You couldn't you could not reduce that. This is Charlie Parker. I'm sorry. You could not reduce the fetus even I believe it requires a public hearing. And then, as Craig mentioned, a change to the fee schedule. Okay.'",
        "'speaker_0': 'So it would not be possible to do it this evening.'",
        "'speaker_2': 'Okay. Thank you, Tony. Thank you for that.'",
        "'speaker_0': 'Thank you, Captain Burger Mungo.'",
        "'speaker_2': 'Thank you. We will.'",
        "'speaker_0': 'Be.'",
        "'speaker_2': 'Putting in some of Lewis letter about this, but the note goes to the warning.'",
        "'speaker_0': 'Could.'",
        "'speaker_2': 'Also encourage them to clean the gutter running or parked at the time. Potentially that could discourage them from not building their car if they're able in the future. I mean, as I mentioned. The health and safety of our community is at stake.'",
        "'speaker_2': 'And we have already started to see mosquitoes here in the side and will continue to watch their herds and encourage people to disperse is when the sprinkler masters into the gutters and then the and with leaves and debris from all of the overgrown trees in the south destroying the water pools and it pools quickly and so perhaps'",
        "'speaker_2': 'that could be identified in the warning along with. If you or a local organization you belong to has the energy and resources to get out and take some dust pans and clean the gutters in your neighborhood, we strongly encourage it or something because the clean water is just a big problem.'",
        "'speaker_2': 'So I'm supportive of the motion on the floor. I'm just hoping for additional language in the warning that tells people. Okay. If you're going to park here and you can't leave your car, consider that you're maybe parked in front of someone who is unable to clean up their gutter.'",
        "'speaker_2': 'And then in talking with Mr. Modica, the clean teams are already very lean because they're stretched as bent on so many other things. But I think we really need to be honest with ourselves that May 12th or whatever the first day, when we go back to street sweepers, we're going to have significant delays due to.'",
        "'speaker_0': 'Multiple.'",
        "'speaker_2': 'Dumps from the excess debris that has been building up. And so I just want us to be prepared for that and make sure that Mr. Medico has a plan in place to address and make sure that everyone gets swept and that not large areas are just avoided because of the massive pile up.'",
        "'speaker_2': 'And if they are avoided, a clean team or other source is deployed pretty quickly. And if it needs to be Boy Scouts or neighborhood groups, we're happy to help coordinate that different neighborhoods. But we need at least a notification so that they're happy to go out and help.'",
        "'speaker_0': 'The Council member will work on an education piece as well. Thank you. Thank you, Councilwoman. Councilmember Superar. Thank you. I think I've got a lot of questions answered that we have multiple languages now going on on Wired and I realize that we can't lower the price of the citation.'",
        "'speaker_0': 'The other kind of conundrum we have here is that we have fires being distributed during a stay at home order. That seems counterintuitive, but I guess we could solve both if we gave another week's question. Probably don't have the support for that right now, but if you waited a week till after the stay at home order was'",
        "'speaker_0': 'lifted, you could get fliers distributed during that time and also maybe lighten the load because the $70 tickets will have a tremendous impact in parts of my district. And I think that's what Mary Sun House was alluding to in that I support the motion.'",
        "'speaker_0': 'Thank you. Thank you, Councilmember. That concludes the comments. Madam Clerk, welcome.'",
        "'speaker_3': 'District one, District two.'",
        "'speaker_2': 'High Court.'",
        "'speaker_3': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'District four.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'District five. By District six. High District seven.'",
        "'speaker_0': 'By.'",
        "'speaker_3': 'District eight. District nine. High motion carries.'",
        "'speaker_0': 'Okay. Thank you very much. I'm going to go ahead. And unless there's any new business from anyone, if I don't see anyone coming out for any new business or announcements. That concludes our agenda for for this evening. And I want to thank everyone for joining us.'"
    ]
}