{
    "Easement Deed and Categorical Exemption for 1542 Seabright Avenue.": [
        "'speaker_1': 'The motion is carry.'",
        "'speaker_0': 'Thank you. Item 24, please.'",
        "'speaker_1': 'Item 24 Report from Public Works. Recommendation to accept an easement deed from 1542 Seabright Holdings for the installation of Public Utilities District seven.'",
        "'speaker_0': 'Mr. America.'",
        "'speaker_4': 'And Mr. Lopez, if you have a report.'",
        "'speaker_2': 'On this.'",
        "'speaker_8': 'And I think it's on the on the side that we need to have the exhibit be a revised sequel or and we've submitted it to learn more about. And then we can incorporate a revised view that would that would allow us to be able to complete this process.'",
        "'speaker_8': 'I wouldn't even be.'",
        "'speaker_0': 'Anything else, Mr. Modica?'",
        "'speaker_4': 'That's it.'",
        "'speaker_0': 'Thank you. There's a motion and a second, please. Can I get those? There is no public comment on this item.'",
        "'speaker_1': 'There's no public comment.'",
        "'speaker_0': 'We will go ahead and cast her votes.'",
        "'speaker_1': 'Vice Mayor Richardson. The motion is carried.'",
        "'speaker_0': 'Thank you. Why don't we go ahead and do general public comment? I think there are three speakers. If the clerk wants to facilitate that.'"
    ],
    "Public Hearing and Resolution on Appeals of World Oil Tank Installation Project. ": [
        "'speaker_0': 'Sir. That concludes public comment. So we're we're going to move on now to our hearing. We were going to have a presentation that's been canceled, I think partly for pandemic reasons. But we are going to move right into hearing item 26.'",
        "'speaker_0': 'Madam Clerk.'",
        "'speaker_1': 'At 26 is report from Harbor Recommendation to receive supporting documentation into the record and conduct a public hearing on two appeals of the Board of Harbor Commissioners. Adoption of the final initial study. Negative Declaration for the World Oil Tank Installation Project Fire by Save for California and the Coalition and Adobe Resolution Denying the appeals and upholding the'",
        "'speaker_1': 'Board of Harbor Commissioners adoption of the final I guess anti for the project this items requiring an oath. Please stand for those of you who are going to testify on them. You and each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the'",
        "'speaker_1': 'whole truth, and nothing but the truth, so help you God. You may be seated.'",
        "'speaker_0': 'Thank you. As we as we begin, we do have a a motion that's going to be made here by the of Councilmember Ranga. And so, Councilman, did you want to move. Make them put in the motion that. That you're going to.'",
        "'speaker_0': 'To begin as we begin the hearing.'",
        "'speaker_3': 'Yes. Good evening, everyone. Thank you for being here. I want to first say that, as you know, we're in the middle of a COVID 19 surge due to all my current variant and various other COVID 19 positive numbers of hospitalizations.'",
        "'speaker_3': 'And people are getting sick even tonight. We have instituted different protocols for public participation and have limited entry to the Council chambers for public comment. Am also sure that this COVID 19 surge has also kept folks from wanting to show up and participate this evening.'",
        "'speaker_3': 'In the interest of fairness and to hopefully have our city in a better place with our COVID 19 positivity numbers, I would like to make a motion to continue this hearing to the next regularly scheduled City Council meeting on January 18th, 2020, and I hope to get your support.'",
        "'speaker_0': 'There is a motion and a second to essentially continue this item to January the 24th, I think. Is that is that right? 18th, I'm sorry, to January 18th, that is the motion on the floor. There is a motion by Councilmember Urania and a second by Councilwoman Price.'",
        "'speaker_0': 'Councilman Price. To have anything to add to that?'",
        "'speaker_6': 'No, I support that motion and I think there are a number of issues that need to be addressed on this particular appeal that I'm hoping the parties will have an opportunity to talk through before the 18th. So thank you.'",
        "'speaker_0': 'Thank you. Mr. City Attorney, do anything to add to that?'",
        "'speaker_2': 'No, no. We would continue.'",
        "'speaker_3': 'It to the next available date, and that is the 18th.'",
        "'speaker_0': 'Okay. Thank you. Before we take a vote on the continuation, actually, Councilman Mongo.'",
        "'speaker_7': 'Thank you. Because it is a hearing. Are we not able to ask questions to help resolve those issues now?'",
        "'speaker_3': 'If it's not illegal. I mean, it is. It is. The motion is now at the it can be made now it can be made after the presentation by both parties. It could be made at any point during the hearing to continue it.'",
        "'speaker_3': 'Yeah, but generally speaking, you would decide to continue it now or let both parties present.'",
        "'speaker_0': 'But let me let me just add to I want to make sure that we do have a motion on the floor. So the motion on the floor is to continue. So that's unless there's a different motion, we need to vote on the motion on the floor and do public comment on that motion.'",
        "'speaker_7': 'Right. And I'd consider making a motion to support, but I don't know what my colleague's concerns are because I received a briefing and so I only know what I received in my briefing. And so I would be interested in knowing what my colleague's concerns are, because I think that that would help me considerably.'",
        "'speaker_7': 'But that's, I guess, where I was.'",
        "'speaker_0': 'Well, I think comes from hearing it did list his his reasons for. For the postponement. You made the motion. So I'm not sure if the council needs to restate those.'",
        "'speaker_7': 'I'm so sorry. Would you mind? I was in the restroom. I wasn't feeling well.'",
        "'speaker_3': 'Basically, as you see, we have an empty chamber.'",
        "'speaker_7': 'Oh, okay.'",
        "'speaker_3': 'There are people outside, which I feel that if we did not have this, COVID 19 would would be inside. Okay. And we'd have a good, solid hearing. Okay. That is not possible today. There are going to be some change protocols for the 18th that I think would provide a better opportunity for more participation from the public in'",
        "'speaker_3': 'this hearing. So that's basically putting it off two weeks and next week we have our state of the city. So the next regularly scheduled meeting will be on the 18th. And that's when I that's what I proposed.'",
        "'speaker_7': 'Oh, I apologize. When I was walking back in from the restroom, I thought there was a specific item that was an issue with the Declaration. I misunderstood.'",
        "'speaker_3': 'Thank you. Thank you for a clarification.'",
        "'speaker_0': 'So there is a motion in a second. Now, I know that people signed up for public comment for the hearing. Just to be clear, we can still take will still take public comment, but the public comment needs to be only on moving the item two weeks, not on the merits of the hearing, not on the merits of'",
        "'speaker_0': 'information as far as that relates to the hearing. So if there is public comment, it has to be only based on whether or not we are going to move the hearing to the 18th. Just to be clear and so, Madam Clerk, if there is public comment on that part of the hearing, please let me know and facilitate'",
        "'speaker_0': 'that.'",
        "'speaker_1': 'We do have some public comment. They're on the way. But I will make an announcement. It is to the the continuing of the hearing.'",
        "'speaker_0': 'Then make sure that anyone from the public knows what the actual public comment is. Thank you so much.'",
        "'speaker_1': 'Franklin Sen.'",
        "'speaker_0': 'Thank you. And before we get we a about it and I just want to make sure that our folks are folks are being letting folks are being told that they can only speak to the continuance, not to the merits of the hearing itself.'",
        "'speaker_0': 'Correct.'",
        "'speaker_6': 'We've told them.'",
        "'speaker_0': 'Everyone knows it. Okay, great. Excellent. Thank you.'",
        "'speaker_2': 'Please. I'm proud to say that Long Beach had a vision for the first the world's first green port. And we've got to live up to that name. The color green makes you think of words like refreshing, clean, open and honest.'",
        "'speaker_2': 'This isn't a tough call. It's a matter of right and wrong. Cancer causing emissions are going to increase in Long Beach because of this project. And because of that, there are to be a report that ought to be heard today.'",
        "'speaker_0': 'Okay. I need you to focus on whether or not the hearing should be today or not or two weeks from now. Please.'",
        "'speaker_2': 'Based on. Everyone who came to speak on this item is out in the hallway ready to talk now on the merits. We came here facing COVID 19 to delay our ability to speak for your State of the city.'",
        "'speaker_2': 'Address that already on the 11th that you requested is to further delay what needs to happen today. I respect Councilman Tauranga's call because in some ways it speaks to his embracement of a democratic process. But let's be honest.'",
        "'speaker_2': 'We know there's more to it than that. I came here to talk on the merits, and now I can't. And it creates an opportunity for deals to be made away from this deal. And that's the sort of shady business that we're tired of.'",
        "'speaker_2': 'So don't get in front of it and say, oh, we're who want to preserve the democratic process. Most of the people out there are here for this item. The public has arrived. And one of the major issues regarding this agenda, at least by the dissenters, is that the ports data did not allow for public engagement in the'",
        "'speaker_2': 'first place because the data is not there. So my question is, is the data going to come down the 18th? Is there going to be more data? The last thing I want to say is this. The South take one day.'",
        "'speaker_2': 'Our vice mayor sits on it. I think he should recuse himself from this item when it comes time for a vote. And he knows why. I'm very disappointed in what's happened. I feel like we've been shafted. I'm not happy about it and I don't like the thread of this is the democratic way to go because it's not'",
        "'speaker_2': '. Thank you, Mr. Mayor.'",
        "'speaker_0': 'Speaker, please.'",
        "'speaker_2': 'I guess. I mean, the two week delay, I wanted to say that it sounds good. I think one of the, uh, I think this gives time for the city council to make, uh, some, some, uh, some questions to make some really important questions before the public.'",
        "'speaker_2': 'As the previous speaker just mentioned, there really wasn't much of a public process when it came before the Harbor Commission. I've seen nothing but climate denial. I just want to acknowledge the movie that came out called Don't Look Up, which was about climate and saying, Oh, look, there's a comet in the sky.'",
        "'speaker_2': 'The comet is symbolic of the climate crisis, and two weeks from now, the climate crisis will be that much worse. We'll be that much further into the future. So I would like at a certain point for this council to show genuine climate leadership.'",
        "'speaker_2': 'Garcia has mentioned running for office a wonderful, ambitious, very proud to be mayor. If you believe in a Green New Deal, this gives you two weeks to actually demonstrate that and show that you have courage in your heart to represent us in Washington.'",
        "'speaker_2': 'Same with you, Mr. Richardson. As mentioned, you are on the AQ, M.D. As mentioned, you also have mentioned that you would be interested in representing the citizens of Long Beach. When are we going to see a change in Long Beach?'",
        "'speaker_2': 'When are we going to see an acknowledgment of the crisis as the warmest December in history? A town burn down to to a crisp. On New Year's Eve, another city, another small town burned. So in two weeks from now, the climate crisis will be that much warmer.'",
        "'speaker_2': 'We'll be that much further into the future. And so I want you to take these two weeks to do some type of climate analysis. You know, really ask that question of staff. Has there been a thorough climate evaluation?'",
        "'speaker_2': 'If you look in the air, you'll find that there is no significant they say no significant difference by by adopting this project. I've mentioned climate concerns to the to the to the Harbor Commission. When there was a public comment I mentioned they referred me to this one sentence.'",
        "'speaker_2': 'I says no significant difference. How is that possible? I want you all to ask questions that show that you have a genuine understanding of the severity of this crisis that shows that you're connected to the community in some way to understand the health impact on the precious children on the lungs of the community.'",
        "'speaker_2': 'I want to see that from each one of you in two weeks. Some actual courage to pronounce. Do you have courage in you? I don't know that I've seen from anybody here on this council quite yet genuine courage.'",
        "'speaker_2': 'So I just want to let you all know what the public is expecting in two weeks, but yeah, sounds good.'",
        "'speaker_0': 'Speaker, please.'",
        "'speaker_2': 'Good evening. My name is John Edmund. I'm here on behalf of the Long Beach Area Chamber of Commerce, the Harbor Association, Industry and Commerce, Southeast Association, Chamber of Commerce. And Bill said, We're all here. There's a room full of people that are ready to present public testimony.'",
        "'speaker_2': 'You have both applicant, the applicant and the appellant in the room right now. You have staff prepared to make a staff report and you're going to punt it to the 18th when I'm pretty sure we're not going to be able to be here.'",
        "'speaker_2': 'And you're going to limit public speaking. I mean, this is what you guys are here for. You have a fiduciary duty to be here and to hear the issues at hand. Win, lose is your responsibility. COVID is a terrible, debilitating, terrible thing.'",
        "'speaker_2': 'But are you postponing anything else on the agenda today? Why this issue? Because it takes a little more time. I'm sorry. I record asking you guys to hear the people's business conduct the city government. We want the item heard.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_2': 'Dave Shukla, resident of the third. I am proof positive that Councilman Ringo's reasoning is sound. I support the motion. I think, as we heard earlier, the hearing can still be had and then be continued. So you're not telling anyone to go home without being heard?'",
        "'speaker_2': 'There's a lot of questions I'm going to have after the hearing, and I think it would be. Advantageous for all parties, given how much COVID is already kind to constrain the process over the past year. I mean, I woke up this early to read those, you know, 600, 700 pages.'",
        "'speaker_2': 'It's complicated. I think you would do well to continue the hearing. Thank you.'",
        "'speaker_0': 'They can expect police.'",
        "'speaker_6': 'Good evening. My name is Khalilah Fetterman on behalf of Safer California, the appellant tonight. And we support the continuance until the 18th. To allow for public participation and for the Council to review and consider the comments that we submitted today.'",
        "'speaker_6': 'And we ask the Council to require any I.R. for this project. Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_2': 'Good afternoon. My name is Carter Garage. I'm an attorney for Earthjustice representing the Coalition of Community Groups, appealing this project. I greatly appreciate Councilman Franco's concern for a public engagement, and I understand his rationale for this motion to continue the hearing.'",
        "'speaker_2': 'However, I'd like the Council to at least consider hearing the folks who did come out here today despite the adversity, who might not be able to make it on the 18th. I think we could have had a lot more public engagement today if there was a telephonic or online opportunity to provide verbal public comment.'",
        "'speaker_2': 'So I'd like the council to at least consider hearing those who are prepared to speak on the merits today, but the members of the public who could not attend in person at the 18th and we've heard the protocols will be different, but we haven't heard the details of what that would be and how much that would facilitate'",
        "'speaker_2': 'public comment at that time. So we'd like you to consider to make sure everyone's voices could be heard in that front. And if and if they cannot, then we would support that. We think that it should be heard today so that the folks outside are not ignored.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you very much. Madam, quick, is it more public comment on the continuance?'",
        "'speaker_1': 'That's in the public comment.'",
        "'speaker_0': 'Okay. Thank you. A couple a couple just things. First is just to also just to be clear, you know, there is a motion on the floor and a second that was made. And so that is the motion on the floor.'",
        "'speaker_0': 'And that's a process we're going through right now. The public comment has to be to the motion as far as additional public comment like was suggested by the gentleman that just spoke, that's not allowable in the in the scope of the way this hearing is set up.'",
        "'speaker_0': 'The hearing has to be done a certain way, and we have to speak to the motion that's on the floor. And so I just want to make sure that to clarify that for the for the gentleman that's here.'",
        "'speaker_0': 'And so the motion and a second is to continue this for two weeks on til the 18th before we take that vote. Let me go and go to Councilman Mongo.'",
        "'speaker_7': 'Thank you. Is this staff able to tell us how many people were signed up for public comment tonight? 820.'",
        "'speaker_1': 'We have.'",
        "'speaker_7': '909. Okay. Okay. And do we know if we will be virtual on the 18th? Like, I guess there's just a lot of questions.'",
        "'speaker_0': 'I can I can answer that question. We actually don't. So we have not received the full recommendation yet, and I have not, as the chair of the body earlier tonight, Mr. Morgan said there might be adjustments in a couple of weeks, but we don't know what those are yet.'",
        "'speaker_0': 'And we're waiting to hear back from the Health Department what those will be. So as soon as I know or as soon as Mr. Modica knows what those are, I think he's intending to work with the clerk to put those out there.'",
        "'speaker_0': 'Mr. Mark, is that correct?'",
        "'speaker_3': 'That's correct.'",
        "'speaker_4': 'So we focused on today in order to make today as safe as possible. But clearly COVID is going up. But we are looking at some alternate methods about how to do that, which could include a virtual meeting. But we've not made that decision yet, and we'll make that definitely in advance of the 18th meeting.'",
        "'speaker_7': 'And our current rules as a body are that if we hear an item, a person can speak to it multiple times. So if someone spoke on an item and then it was continued, they wouldn't be barred from speaking on it again.'",
        "'speaker_7': 'I know other bodies have it where if you speak at committee that you don't speak at the council or any of that, but we don't have that.'",
        "'speaker_0': 'That's correct.'",
        "'speaker_3': 'That's correct. We have had that type of situation come up in the past where they have one opportunity to speak. But generally speaking.'",
        "'speaker_4': 'You are correct.'",
        "'speaker_7': 'Okay. Well, I, of course, want the most public input as possible. I think we're in a tough situation to know and understand where we'll be in two weeks. And I, of course, didn't want to turn away the nine people who are here.'",
        "'speaker_7': 'And maybe we'll have more participation if it is online or not online or I just I just hope that we can work really hard to tell people far enough in advance what the plan is for the 18th, because it seems like there are a lot of people very concerned about this item.'",
        "'speaker_7': 'Those are my comments.'",
        "'speaker_0': 'Thank you. Ever. We have a motion to confirm your ring a second bit. Councilman Price to postpone this for two weeks. Public comment has been closed as part of this hearing. We will to take a vote on that.'",
        "'speaker_0': 'Mr. City Attorney, I know this is a hearing. Anything else that we need to do as far as that piece? Okay. Thank you.'",
        "'speaker_1': 'The motion is carried.'"
    ],
    "First Amendment to Operating Agreement with Grand Prix Association of Long Beach.": [
        "'speaker_0': 'Okay. Thank you. We're now moving on to the rest of the agenda. First up will be item number 34.'",
        "'speaker_1': 'Item 34 is a report from Economic Development Public Works. Recommendation to execute a First Amendment to amended and restated operating agreement with Grand Prix Association of Long Beach District one and two.'",
        "'speaker_0': 'I think we have a council district to comment.'",
        "'speaker_5': 'Yes, I will be recusing myself on this item since I live within 500 feet of the elephant lot.'",
        "'speaker_0': 'Thank you. Can I get a motion and a second, please? There's a motion any. I'm going to begin by having you staff report, Mr. MODICA.'",
        "'speaker_4': 'Just very briefly, if the Council wants a lot of detail on the intricacies of the arena of the contract, we're happy to do that. But in the interest of time, just saying this has been a lot of negotiation, a very strong partnership with us in the Grand Prix to look at how we can reduce some of the'",
        "'speaker_4': 'impacts on the residents, on the businesses while holding the race and also looking at a number of other goals to just make the next five years of the Grand Prix one of the best in our history. So very appreciative of the partnership that we've had with the Grand Prix Association and the good staff work from economic development'",
        "'speaker_4': '. If you have any questions on the actual item, I can turn it over to John Keisler to answer any of those questions. And I do believe that we have a comment that the Grand Prix Association would like to make when it's their turn.'",
        "'speaker_0': 'I have to a public comment. So, Mr. Killian.'",
        "'speaker_2': 'Good evening, Mayor Garcia. Members of the city council, city staff. It's a pleasure being here with you this evening. I wanted to take just a moment for us to evaluate the tremendous relationship that has evolved over these last 47 years between the Grand Prix Association and the city of Long Beach.'",
        "'speaker_2': 'We know what immeasurable benefits are. We know about $33 million worth of economic impact that comes in and on an annual basis. The millions of people who watch this event, both nationally, internationally, on television and seen the growth of the city over these many years.'",
        "'speaker_2': 'And the fact is that the city is recognized as having capability of hosting major events, whether sporting or other activities, and doing it in a very successful manner. But let's set aside for a second. What I want to do is focus in on the fact that the Grand Prix really is a community event.'",
        "'speaker_2': 'It was started that way. It has continued all the way through its history. Let me give you a few examples. We work very closely with the Long Beach Unified School District and the Bank of California to bring 150 of the top STEM students from the high schools here in Long Beach to the race every year on Friday'",
        "'speaker_2': '. They have an opportunity to engage with the various technicians and see what the opportunities are in terms of vocational activity. In addition to that, we go, as most of you are familiar with each of the council districts every year to one of the grade schools with a power and a show element and a driver and engage in'",
        "'speaker_2': 'vocational and safety instruction that I think is beneficial to all the younger students in those schools. And as you know, we've engaged with the committee of 300, the Red Coats, which you all recognize. They do an extraordinary job as being ambassadors, not only for us, but also for the city, because you see them in a variety of'",
        "'speaker_2': 'different events, all performing the extraordinary service, and we're very grateful for that. In addition to that, the Grand Prix Foundation is has dispensed four and a half million dollars into the local charity community here based on the activities they have been the leadership of that has come from a victory.'",
        "'speaker_2': 'And he's done an extraordinary job. And and all of that has been for benefit of the local charities. And we've worked with Steve Goodland at the CVB and all the members there in order to provide the opportunity for them to invite potential clients who want to come out and sample what Long Beach is all about.'",
        "'speaker_2': 'And we've been very fortunate because they have had the opportunity to book a number of major events that have come out of these relationships that are centered around attendance here at the Grand Prix. Those are very important factors in terms of how we have interwoven ourselves into the community.'",
        "'speaker_2': 'Let me just say a word of thanks.'",
        "'speaker_0': 'And I'm just trying to follow the time that I have to follow. Okay. But if you can just wrap.'",
        "'speaker_2': 'Up, let me let me just say a word of thanks to the city staff for their work in terms of putting this agreement together. It was a long, arduous effort. But thanks to Tom, the John and people of John Keisler and those in Eddy and also for Rich Anthony.'",
        "'speaker_2': 'And thank.'",
        "'speaker_0': 'You. Thank you. I've got to get the time.'",
        "'speaker_2': 'And thank you, too, for all of your support over the years. If you approve this agreement tonight. Thank you.'",
        "'speaker_0': 'So much. Can I have to? Yeah.'",
        "'speaker_2': 'We're going to have the opportunity. Sorry about that. I have to think about the time.'",
        "'speaker_0': 'Thank you. Sorry. I'm just following the. The timer. Let me let me just add that. Mr. King, I just want to thank you. The Grand Prix is an incredible event in the city that brings, you know, folks from across the world.'",
        "'speaker_0': 'I just want to thank you and the team and not just the the foundation as well, but just all the volunteers and everyone that gets involved in the event throughout the year. So thank you very much. Where we are continue to be incredibly supportive of really what is an event for for the entire community.'",
        "'speaker_0': 'Councilman, in the House, you made the motion. Any comments?'",
        "'speaker_6': 'Yes. Thank you, Mr. Mayor. Thank you very much, Jim, for those wonderful words. The Grand Prix always brings fond memories of fun times during the races. I'm glad to see the partnership between the association is standing strong and will continue to do so for the upcoming years.'",
        "'speaker_6': 'I'm very supportive of this item. I know for many of my residents the set up and the tear down time duration has not always been the best, but now it's been limited thanks to your partnership and you are always focusing on the community.'",
        "'speaker_6': 'One of the things that I admire the most. You already know this because I tell you this every time is the partnerships that you do have with our Long Beach Unified School District and bringing opportunities to our students, I think is very important and it just speaks volumes of your association and we're just so happy to have'",
        "'speaker_6': 'you. And we look forward to continuing bringing this wonderful event not only to the residents here in Long Beach, but to the whole world. And we thank you for that opportunity.'",
        "'speaker_0': 'Not so on price.'",
        "'speaker_6': 'Mr. Mayor. So I do have a couple of questions. I don't want to prolong the item, but I think it's very, very important that the public know that the council has been very active in the conversations regarding the negotiation points in terms of city assets and our concerns about city assets.'",
        "'speaker_6': 'So I would like to ask staff if you guys can provide a high level overview of the major negotiating points and what the agreement reached has been because I know that our business sector is extremely concerned about the impacts and of course our residents are very concerned about the quality of life impacts.'",
        "'speaker_6': 'So if you can provide an overview, I'd appreciate it.'",
        "'speaker_3': 'Absolutely. Happy to do.'",
        "'speaker_4': 'That. I was John Kaiser to give a brief overview of the summary of the major terms that were negotiated that are different in this agreement. Thanks.'",
        "'speaker_8': 'Thank you, Tom. Mayor, members of the city council. I want to thank Jim McMillan and the association. And through this process, this has been one of the most extensive negotiations, because there were many concessions asked by the city to improve the quality of life, environmental mitigation, road repair and some other items that I'll highlight right now.'",
        "'speaker_8': 'As you know, this this amendment actually takes us through June 30th of 2028. So just before the Olympics are anticipated to be here in Long Beach, the city and the city council asked that we retain rights to develop portions of the race circuit if needed, that would include surrounding areas that might displace or cause disruption of the'",
        "'speaker_8': 'race track as it currently sits. So there are a number of conditions in this new agreement that allow for us to involve the associations and notify and then work together throughout that process in the event that the city needs the rights to develop that lot.'",
        "'speaker_8': 'Additionally, the Mayor and City Council asked the association to reduce, set up and tear down time. And so with this new term, which starts January of 2023, for those races, the set of time will be reduced from 53 down to 50 day days for setup and 21 to 20 days on on tear down.'",
        "'speaker_8': 'So that's another 5% reduction of set up and tear down time. We needed to maintain safety, of course, and ensure that the inspection process ensured the safety of both guests as well as participants in the race. So additionally, we've maintained and improved on construction timing.'",
        "'speaker_8': 'There will be no street improvements or street decoration before 7 a.m. in the morning or after six p. We want to make sure that adjacent residential and businesses are not impacted negatively. And there are also additional inspections that will occur beginning in advance of actually the 22 race.'",
        "'speaker_8': 'So this race that's happening in April, we will be doing additional pre-race inspections of the roads to ensure that anything that is impacted with regard to tire marks or or other blemishes, that that those are detailed and ultimately addressed.'",
        "'speaker_8': 'And following the race, there will also be a full grind and overlay of Pine Avenue prior to the 2023 race, which will repair the area on Pine Avenue between Seaside Way and Shoreline Drive. We also will have what's called an emulsion treatment, which will, for all the asphalt areas, make it look like new to make sure that'",
        "'speaker_8': 'we establish a new standard after the 22 race, after this April race, so that we have a very attractive environment for our our entertainment district. There will also be, from the association, a annual road restoration contribution of $30,000 per year for the period of five years.'",
        "'speaker_8': 'That'll be $150,000, which will go to public works and in the city to continue to maintain that standard. That's established after this next 20, 2022 race. With regard to the look and appearance of the roadway. We also there are a couple of other issues with regard to permit fees that the city didn't waive any permit fees, even'",
        "'speaker_8': 'though the association experienced financial hardship over the past two years. They will pay all their fees. We will be spreading those over the next few years. But the association has is continuing to make those payments and and will continue to do so in this new agreement.'",
        "'speaker_8': 'And then the association has agreed to work with the city to accommodate the 2028 Olympic Games, as I mentioned, beginning. So a lot of other environmental mitigation efforts that IndyCar and the Association are implementing over the coming years.'",
        "'speaker_8': 'We have a full listing and details of some of those efforts underway with regard to fuels and and tires and recycling and other kinds of things that that might impact the air quality or the environmental quality of the area.'",
        "'speaker_8': 'So lots more detail, but I'm happy to answer any questions if needed.'",
        "'speaker_0': 'Thank you, Councilman Price. Anything else?'",
        "'speaker_6': 'No, I don't think so. Thank you very much for that overview.'",
        "'speaker_0': 'Thank you. Thank you, staff, for that. There is a motion any second. Is there any I don't believe any additional public comment on this item.'",
        "'speaker_1': 'There is no other public comments.'",
        "'speaker_0': 'Thank you so well called. Please cast your votes.'",
        "'speaker_1': 'The motion is carried.'"
    ],
    "Donation to AIDS Food Store from Sixth Council District Funds.": [
        "'speaker_0': 'Thank you. Thank you, Mr. Cohen. Next up is item 28, please. Actually, before me, 28, let's do the first transfers items, which are 29, 30, 31 and 32.'",
        "'speaker_1': 'Adam, 29, is a communication from Councilwoman Sarah recommendation to increase appropriations by $500 to provide a donation to the AIDS food store to support the grocery pickup program. Item 30 is a communication from Councilwoman Allen. Councilwoman has recommendation to increase appropriations by $800 to provide a contribution to partnership parks to support the Kriseman Village Historic District Doc'",
        "'speaker_1': 'Ways BAT Program Back Program. Item 31 is a communication from Councilwoman Allen. Recommendation to increase appropriation by $3,000 to provide a contribution to Musica Angelica to support their 2021 2022 season. Item 32 is communication from Councilwoman Allen. Recommendation to increase appropriations by $500 to provide a contribution to new image.'",
        "'speaker_1': 'Emergency shelter for the homeless for their 27th annual Children's Christmas store, operated on December 18, 2021.'",
        "'speaker_0': 'Thank you. Is there any public comment on these items? There is a motion. Can I get a second, please? Unless there's any comment from the makers of the motions, which I don't believe there is some else that you have something.'",
        "'speaker_0': 'Okay. Please cast your votes.'",
        "'speaker_1': 'The motion is.'",
        "'speaker_6': 'Carried.'"
    ],
    "Pre-Approved Accessory Dwelling Units Program Report.": [
        "'speaker_0': 'Thank you. Now we're going on to item 28, please.'",
        "'speaker_1': 'I'm 28. It's a communication from Councilwoman. Councilman Alston. Councilwoman Sarah. Recommendation to require city manager to report back to the City Council in 60 days with the recommendations for implementing a approved accessory dwelling units program.'",
        "'speaker_0': 'Thank you. Council Member Austin.'",
        "'speaker_3': 'Thank you very much. First of all, I'd like to thank Council Member Sorrell for joining me on this this item. And as we begin 2022, we've heard a lot of goals about our our housing crisis and the need to build quality, affordable housing in our city.'",
        "'speaker_3': 'And this is just another tool in the toolbox. This item aims to assist the city as it looks to increase the number of quality, sustainable and affordable housing units in our communities. In November, we proposed the proposed housing element, Long Beach's arena allocation increase to 26,502 units, with over 11,000 of those being low and very low income'",
        "'speaker_3': '. We've fallen short of these goals in the past, and only 16% of our affordable housing target is the fifth housing element cycle permitted. I hope this item can be a useful tool that we can leverage to increase production and alleviate the housing crisis in our city.'",
        "'speaker_3': '80 youth presented a unique solution because of their small size and compatibility with single family housing and zoning. Wait times and design costs can can become barriers for projects prospective residents interested in constructing to use. And we want to eliminate that.'",
        "'speaker_3': 'For these reasons, the cities throughout California have started adopting approved edu plans to streamline the approval processes for employees and residents alike. Our developments the services department previously intended to develop a new preapproved program for those plans were direct but derailed by the pandemic.'",
        "'speaker_3': 'This item makes use of the preliminary research already done by the department staff and ensures that we develop a program based on best practices for the city of Long Beach. And I just would note that the city of L.A., La, San Jose, Chico and other cities have all adopted strategies to streamline their development processes, and this will'",
        "'speaker_3': 'decrease permitting time. Pre-approved 80 plans will provide applicants for 80 new construction plans. They've already been reviewed by the city with necessary permitting staff, which potentially could streamline the approval processes for able to use from weeks to days.'",
        "'speaker_3': 'And so this is an efficiency item as well. And so with that, I would. That's what my colleagues support on this. All right. Thank you. Next is Councilwoman Sorrow.'",
        "'speaker_6': 'Vice mayor. I want to thank Councilmember Austin for his leadership on this item. You know, last month seems like a lifetime ago because of the holidays. But just last month in last year, we just finalized the housing element plan for the city of Long Beach.'",
        "'speaker_6': 'And I think we heard loud and clear consistently that we need to increase housing and we need to explore every option possible. And I think that one of the ways that we can do it is through making it easier through this preapproved accessory dwelling unit program.'",
        "'speaker_6': 'And so I think that and I think that it's just, again, one of the many avenues we can take to make sure that we just really ensure that we're meeting our numbers, but most importantly, ensuring there's increased housing.'",
        "'speaker_6': 'So for that reason, I completely support this item and understand that hopefully, you know, when we get a report back is seeing what are the various options people can choose from based on the pre approved plan. So thank you very much.'",
        "'speaker_3': 'Thank you, Councilwoman Mongo.'",
        "'speaker_7': 'Thank you. This is a very interesting one for my district. On one side, we're very supportive of reducing government regulation and red tape and barriers to entry and finding ways for people to be able to get through city processes faster.'",
        "'speaker_7': 'On the other side, we also don't want to incur additional government costs. And so I hope that when the report comes back, we would be open to when a. Applicant plans to use one of these, that they would have a small nominal fee that would go towards reimbursing the city for the cost.'",
        "'speaker_7': 'So let's say that they cost the city 30, $50,000 to move forward with this program of a current application fee is $6,000, maybe it's 6200 because they're using one of the previous plans. It saved them in architectural and engineering $9,000.'",
        "'speaker_7': 'So the $200 fee could make up for and feedback into that pot. I know that there's a lot of discussion and calls to our office regarding individuals who want to use to use to. Allow family members, particularly parents, to move in with them.'",
        "'speaker_7': 'I know that there's one that's pending right now. That is for a daughter who was recently left by her husband and her kids and and her are going to move into a adu at her parent's house that they're building.'",
        "'speaker_7': 'And those delays are significant. When you don't have somewhere to live, being able to move a process forward more quickly can mean the difference between months, months of living care for an elderly parent. So I've been torn on this item because I know that there are conflicting feelings.'",
        "'speaker_7': 'But I do want to reduce government regulation, and I do want to support a plan for a nominal way to reimburse the city for that. A lot of these ideas that Council Member Austin have brought forward are very innovative and I appreciate the research and I look forward to seeing the report back with the recommendations in 60'",
        "'speaker_7': 'days.'",
        "'speaker_3': 'Thank you. Councilmember Super.'",
        "'speaker_4': 'Now I was going to go to public comment, but because I've inherited a lot of Councilmember Mango's district, I might as well just follow up on what she just said, and that is it. We don't even have to go to the merits of aid to use and affordable housing or what impact it will have.'",
        "'speaker_4': 'To me, this item is about reducing staff time and improving these units or streamlining the staff process. So I would love to get there, but I'd also like to ask staff now. That's a great goal. But but is it going to be minimal impact for the study to happen?'",
        "'speaker_4': 'Do you see much time spent on that? Mr. MacGregor. Mr. TIM.'",
        "'speaker_6': 'Because some of it is. Is development services on the line?'",
        "'speaker_8': 'Yes, department services is on the line.'",
        "'speaker_6': 'Go right here to ask if you could respond.'",
        "'speaker_8': 'Thank you, Mayor and council members. What we plan to do is report back to you with different options, some of which could provide the staff with additional time and expenses that we currently don't have. There are other options that potentially could be easier to administer and quickly and cost the city with little impact in terms of funding'",
        "'speaker_8': '. So we'll well, what we'd hope to do is provide you with those options. We have already done some preliminary investigations, including the use of pre-fabricated modular units and a housing project and a funding for such a for those types of projects.'",
        "'speaker_8': 'So we'll provide that information to you in short order.'",
        "'speaker_4': 'Okay. Thank you for that. Mr.. Morsi. And so based on that, the fact that the study is not going to impact staff time tremendously with the goal of streamlining the process and taking some burden off planning or development services.'",
        "'speaker_4': 'I'm supporting the item.'",
        "'speaker_3': 'Thank you, Councilman Price.'",
        "'speaker_6': 'Thank you. I'm very supportive of this item. And I just want to say I really appreciate the frequently asked questions sheet. It really helped break down the issue for me. I guess my question would be to the to the author of this item.'",
        "'speaker_6': 'I mean, it seems to me that this also affords an opportunity for people who want to have an EDU to be able to do so at a reduced cost, because the all the investment that they would have to take to build an idea would be such a deterrent for most people.'",
        "'speaker_6': 'And it seems like this item does that. Am I reading it correctly?'",
        "'speaker_3': 'I think you're reading it absolutely correctly. If you look at the cost of building 80 youths that are not pre-designed in prefab. It's significant today and I think it becomes a barrier. And so we need to remove barriers as much as possible.'",
        "'speaker_6': 'I agree. I mean, it's it's no secret. I've spoken very publicly about the fact that I thought our council did a very good job outlining our new laws. We listened to public comment. We incorporated many characteristics and variables that we wanted to make sure were met before we allowed an ADU and our ordinance was superseded by the'",
        "'speaker_6': 'state. And that's just a reality that sometimes happens and it took away some local control. So now that that ordinance is now in place or that state laws in place allowing for a readily accessible way to use and more of them, then I want to make sure that everybody has an opportunity to participate in that process and'",
        "'speaker_6': 'that cost is less of a barrier, although let's not make any mistake about it building. And Adu is very expensive with this item or without, and it is a barrier for many people. But if it allows folks to have an opportunity to earn some additional income on their property, then I think we should try to remove those'",
        "'speaker_6': 'barriers. So thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_7': 'Thank you. Just to circle back, I think that after finishing reading the FFA cuz I think it's important to kind of highlight a few of the things that Councilmember Austin has brought to the forefront, which is that the costs of ADU use for garage conversions all the way through detached units, really in construction costs alone, you're talking'",
        "'speaker_7': '90,000 to this says 180,000. But I'm aware of a bit of a recent ADA in our our area that was over 250,000 just for construction costs. And the individual had mentioned not only had they already been in for thousands of dollars in engineering and architectural costs, but I don't think that they were aware of the fees.'",
        "'speaker_7': 'And so one of the other things I'd love to see on this, because the family was pretty blindsided, is there a set of fees associated, whether they're sewer fees, Long Beach, unified fees, all these different fees. And in fees alone, they had upwards of 6000, $10,000 in fees.'",
        "'speaker_7': 'And a lot of those fees are directly tied to the square footage. And so there's calculations that are involved. And so I would love to see that if we do bring back something that discusses the specifics of these different little options that you could have.'",
        "'speaker_7': 'So like San Jose says, okay, here's here's a two bedroom floor plan for 500 square feet. Average construction costs in the Southern California area are x per square foot. And by the way, your sewer fees would be this year.'",
        "'speaker_7': 'Let me unified fees would be that your community college fees would be this and that there should be a schedule so that people know what their all in costs are before they get started. Because once they do get started, a lot of people are all in and then they overleverage themselves or they try to get loans and'",
        "'speaker_7': 'they can't afford to finish the project. And we have a couple of projects that are just stuck because people ran out of money and that's also not good for the community. So if we could get those fee schedules attached and some estimates, that would be very helpful.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'All right. Thank you. I'll I'll add my support here, then we'll go to public comment. First of all, I love this. I think it's a great item. It's not a referendum on IOUs use. We already proved a to use in the city.'",
        "'speaker_3': 'I think this is a recommendation to make it better and I support that. It is a tool we're counting on to use. We are certainly counting on to help meet our arena numbers and our housing shortage. And so if this helps make that happen, I'm supportive.'",
        "'speaker_3': 'Growth is going to happen. This just helps make sure it's done safe and up to code and not haphazard and illegally converted garages and things like that. I think cut sheets are good. Like when we have cut sheets on other things and make it easy, you can say, hey, build it like this and it's approved.'",
        "'speaker_3': 'It takes one layer out of the planning process and that's always good. I also think, you know, I always get these cards. I'm sure my colleagues do, too. Hey, we can build a you and your backyard and all that.'",
        "'speaker_3': 'So, you know, I've called some of them and it's not Stand B, they can't give you a flat rate. They have to do a lot of work. Just to give you a quote, I think doing something like this, when you standardize, hey, this is what this is what this size will look like, so that looks sides look'",
        "'speaker_3': 'like. I think the business community will respond and say, I think people would actually design businesses around where they're at, you, experts in Long Beach, so on and so forth. So I fully support this. You know, I think I think just a suggestion.'",
        "'speaker_3': 'I think it would be good if staff were to just work with the apartment association or developing companies that are developers of this to help make sure it actually, you know, that that is something they will utilize and that'll work.'",
        "'speaker_3': 'But I love this item and I'm happy to support it. Let's go to public comment and congratulations, Councilman. I think I will go let's go to public comment. We have three votes and I can say John Edmond and Tiffany Davey.'",
        "'speaker_3': 'So now you're up.'",
        "'speaker_2': 'So I said I can face six votes for president. I want to commend first of Councilman Austin for bringing this to this item to the agenda. And, Dr. Sophy, sorrow for second unit. As we know, 80 youths are the future.'",
        "'speaker_2': 'And it's a very harsh reality to the affordable housing crisis that we have here in California. A You seem to be one of the few very visible examples of development, specifically towards the income brackets that need the most housing and so falling in support of it.'",
        "'speaker_2': 'UC Berkeley says that UC Berkeley did a study and they said the average ADU cost is about $156,000. We need some teeth. With respect to this program, I think that a preapproved, a streamlining effort will help some solutions.'",
        "'speaker_2': 'I would like to offer would be very simple. I think there should be no fees. Forgive me, Councilwoman Mongeau. I think that the city should eat all the cost. The reality is that if the city incentivizes the free market to take advantage of something like, you know, fees and stuff like that, you're talking about, you know, 12'",
        "'speaker_2': 'to $18000 in fees, blueprint blueprint fees and the planning permits and loan that $18,000 added to the cost of whatever you have to use. If the city was to eat that up, we would easily knock out a lot of the arena issues that we're facing.'",
        "'speaker_2': 'You know, we're behind and we need to incentivize the market to take to take advantage of this. A second thing that I would offer is that we create a, you know, similar to the gun buyback program where we allege that we take guns off the street, even though most of them are not guns used in crimes.'",
        "'speaker_2': 'We need to actually actually incentivize people who have illegal garage conversions to legalize them. And, you know, if that's a one time fee, like you're talking about a nominal fee where people are incentivized to bring their illegal garage conversion or granny flat and make it a legal one.'",
        "'speaker_2': 'I think that those units, when then legally added into the our arena unit that were behind would help us a lot because people have already done this, they just didn't do it legally. And oftentimes people, you know, are in fear of either selling their house or making it unaware that they have to use because they didn't illegally'",
        "'speaker_2': 'get it converted. So I think if we created a process for people, that would help a lot. And then finally, I think that RFP should be put out for a pre fabricator, a sizable one to do modular adus and the city also using maybe some of the code good money to eat up the cost for them.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you. Next is John Edmonds. Hello.'",
        "'speaker_2': 'It's not even here. Thank you, Mayor. Councilmember, city manager, city attorney, city staff. For all your hard work. Greatly appreciated. Wonderful item. Thank you so much for putting this forward. I'm speaking on behalf of the Apartment Association of California Southern Cities and in many ways city staff is fantastic, but their hands are tied a lot of the'",
        "'speaker_2': 'time, so the state constantly changes and then the city has to update their rules and regulations and codes to meet what some of the state rules are. But I think we can we can do more, right? I think there's always an opportunity to do that.'",
        "'speaker_2': 'I ask if there is a way that we could work with local stakeholders that are their subject matter experts on this issue, that can aid the city in finding, you know, more opportunities to be able to do a to use couple of examples that come to mind.'",
        "'speaker_2': 'We have a new construction of new apartment buildings which allow under state law the the one of the parking units to be converted to EDU and the person has to fill in the concrete, put all the things up, and then submit for an application.'",
        "'speaker_2': 'You know, why can't that be done concurrently? Why can't we have the inspector come out before you fill in the concrete, make sure all the pipes are there, and that we make sure that we have these units done successfully to protect life and property, but that we have a more streamlined system so that under new construction they're'",
        "'speaker_2': 'able to fully maximize the number of units that are able to be made. To me it seems like a no brainer, but the city's hands are tied because it doesn't speaks clearly to that issue. And I think that we can work together on finding those types of solutions in terms of process, right, because they have a lot'",
        "'speaker_2': 'on their plate. The second thing is like, for instance, height, there's duplexes that are within the height restrictions for the state. But because it's a duplex, it's not a single family unit, it's not viewed the same way and being able to have an ADU and so therefore staff, you know, again, have their hands tied because.'",
        "'speaker_2': 'Current code does not recognize what the intent surely of the state. I mean, whether it's a duplex or a single family home, as long as the heights compliant. What issues with there really be. So I think that looking at real world market examples of what the current limitations are and applicants that have gone through the process that'",
        "'speaker_2': 'have been denied and finding sort of, you know, common sense solutions, I just welcome that and hope to be part of those conversations. So it's fully enveloped and we can really capitalize on all the opportunities. But tremendous hats off.'",
        "'speaker_2': 'Wonderful item. Thank you very much for being able to bring this forward and thank you city staff for all their hard work that they do to make this happen and make Long Beach. Great. So thank you. Have a great evening.'",
        "'speaker_0': 'Thank you, Mr. Redmond. I think that concludes public comment. Or do I have another one?'",
        "'speaker_6': 'We have one more. Davey? Yes.'",
        "'speaker_0': 'Oh, yeah, please. Thank you.'",
        "'speaker_2': 'Good evening. It's not every Tuesday that housing advocates and the California Apartment Association are on the exact same page, but we are definitely in support of this item. As we all know, the conversations regarding housing being the need for housing being a crisis requires innovation.'",
        "'speaker_2': 'That said, beyond just this program, which I'm again, fantastic, I saw the 13 units example with three different sizes, a wonderful way to bring more units on board as soon as possible. But to the two comments from the previous speakers in regards to those that are already in existence, we do need to have a streamlined process for'",
        "'speaker_2': 'that as well. I shared I believe in last year that I had a lot of experience during the pandemic, speaking with homeowners who had been denied within the past 15 years to have their units go online. And we have units sitting empty.'",
        "'speaker_2': 'We also have units that were very reluctant to even take part in the census for the shame of living in an illegal unit and of fear of just reporting that they live somewhere to protect both their landlords and themselves.'",
        "'speaker_2': 'Housing is a human right, but it's also something that during the pandemic we have fought day and night for. Whether you're working till midnight, helping folks with emergency rental assistance applications, or again walking door to door to make sure every community member is counted.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'That concludes the public comment.'",
        "'speaker_0': 'Thank you. We'll go back comes from Austin.'",
        "'speaker_3': 'Thank you. I'd just like to thank my colleagues for their input there on this particular item. I think it's very important that we come out in 2022 with a real aggressive approach to dealing with our housing crisis here in the city.'",
        "'speaker_3': 'And I think this item certainly speaks to that. I'd like to just step to to speak to what is already been done in terms of the the pre-approval or the template for garage conversions. Because I heard a little bit about that and I think we need some clarification on that.'",
        "'speaker_8': 'Yes, thank you. Council member staff began in two page process before COVID. The first phase we were successful was successfully implemented and that was the conversion developing country that someone mentioned earlier or typical to help those individuals wishing to convert their garages into EDU.'",
        "'speaker_8': 'So that's there that's available online. And it's it was something that we in the city paid for to be able to more easily convert garages. We started with looking at the different options that you listed in the council letter as well as visiting several different locations, a pre manufactured edu type.'",
        "'speaker_2': 'Of.'",
        "'speaker_8': 'Fabrications throughout the surrounding area in hopes to be able to learn a little bit more. So we've already done that. One other thing too is that the state rules regulate the amount of fees and funding you can charge on these fees.'",
        "'speaker_8': 'So that regulated by them. We do still, however, and again, as Councilmember Mungo indicated, it depends on its size. So we have that information that we will provide to you and report back. So there have been several efforts done, but again, COVID and funding kind of limited our phase two.'",
        "'speaker_8': 'So we're hoping to get back to completing our efforts. So we do appreciate this. Councilor Councilmember Hoffman.'",
        "'speaker_3': 'All right. Thank you. And my my just last words is we've heard a lot of good comments from an input from the council as well as public comment. Please take that all into consideration. When you come back with some recommendations, we asked for the best options possible for this Council to consider with the goal in mind to'",
        "'speaker_3': 'expand and streamline production of a to use in our city. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_7': 'Thank you. I just have another question for our director, Oscar. Are the fees regulated only for the city or are they regulated for every government entity that you pay fees to the regulated for every government entity that we pay fees to?'",
        "'speaker_2': 'That is correct. Wow.'",
        "'speaker_8': 'There are certain fees. We will engage our city attorney's office on the school fees. School fees are requesting fees and there may be a bit of a conflict there, but we'll get you that information as well in our report back report.'",
        "'speaker_7': 'Good to know. Thank you.'",
        "'speaker_0': 'There's a motion and a second and we've heard public comment to members, please cast your votes.'",
        "'speaker_1': 'The motion is carried.'"
    ],
    "Cancellation of City Council Meeting of January 11, 2022.": [
        "'speaker_0': 'Thank you very much. I appreciate that. We're moving on to our next item, which is going to be item 27.'",
        "'speaker_1': 'Item 27, communication from Mayor Robert Garcia Recommendation to cancel the City Council Meeting of January 11, 2022.'",
        "'speaker_0': 'If there's a public comment, please come forward.'",
        "'speaker_1': 'If Shukla.'",
        "'speaker_2': 'Please, Sugar. It must be said that the work of your office has not ended. You can have the meeting, you can cancel the meeting, you can have the meeting in person. You can have the meeting in a hybrid way.'",
        "'speaker_2': 'You can have the meeting, uh. Uh, online. There are words to express how disappointed I am that you could not control your worst impulses, Robert, and that you interfered, in my view, with the redistricting process. Every cloud has a silver lining.'",
        "'speaker_2': 'And I suppose I don't have to go in there again. Not if. Today. Today. Without any relish or rancor. I can look you in the eye and say, this city would have been better off past eight years. Bonnie Lowenthal had been mayor.'",
        "'speaker_2': 'If for no other reason than this wouldn't have happened. Now, I sincerely think that this city shouldn't contract with redistricting partners again. I also think that even if in the next five years. Even if, you know, next week you give us the best possible, you know, State of the City address or whatever.'",
        "'speaker_2': 'In the next five years, we're able to to deal with some of the inequities that are built in structurally to the redistricting process. There's a whole group of youth voters that are going to be disenfranchized regardless. For more over the next few months, Robert, you're going to have to show us that the heat working in the best'",
        "'speaker_2': 'interest of the city while simultaneously making the case that you've got to leave the city to keep working in the best interests of the city gives you security.'",
        "'speaker_0': 'And I appreciate everything you're saying. I want to make sure it's about the cancelation of the meeting.'",
        "'speaker_2': 'Please. I think the meeting shouldn't be canceled. And I'm telling you why we want to break ground and to again. This is a difficulty for me. It's a difficulty for me because there is a lot of things that I'd like to be able to do to do, or at least try and do the city things that aren't'",
        "'speaker_2': 'easy from a technical perspective, from an intellectual perspective, from a planning or, you know, community organizing perspective, it can get sort. I mean, why build a nonprofit on climate stabilization in Long Beach? Why not just, you know, sort of program in Duluth or Ortega?'",
        "'speaker_2': 'I mean, why is the source worth my time? Why is next week worth my time?'",
        "'speaker_1': 'Thank you, Mr. Sugar.'",
        "'speaker_0': 'Killers are in motion in a second. Please cast your votes.'"
    ],
    "Contract Award to Geocko, Inc. for Long Beach Recovery Act Grant Administration Support Services.": [
        "'speaker_1': 'The motion is.'",
        "'speaker_6': 'Carried.'",
        "'speaker_0': 'Thank you. Next up is item 33, please.'",
        "'speaker_1': 'Item 33, Support from Economic Development Recommendation to Award a contract to Gioco for Long Beach Recovery Act. Small Business and Nonprofit Grant Administration Support Services in a total amount not to exceed $690,000 citywide.'",
        "'speaker_0': 'Thank you. Mr. Murdoch is there. A staffer put on this.'",
        "'speaker_4': 'Just that this we are going to be launching our Recovery Act programs in 2022, and a lot of those are going to be grants for businesses and others out of a multiple different categories that the council has approved will be bringing on some assistance to help with the thousands of applications we expect and all of the paperwork'",
        "'speaker_4': 'it requires to get federal reimbursement. And that's what this is.'",
        "'speaker_0': 'Thank you. Any public comment on this item?'",
        "'speaker_1': 'There's no public comment.'",
        "'speaker_0': 'Kevin motioned a second. Members, please cast your votes.'"
    ],
    "Resolution to Hire Michael J. Mais for the Law Department.": [
        "'speaker_1': 'The motion is carried.'",
        "'speaker_0': 'At 1036, please.'",
        "'speaker_1': 'Item 36 Report from Human Resources for recommendation to Adobe resolution approving an exception to the 180 day waiting period for public agencies to hire Michael J. Mays for a limited duration to work in the office of the City Attorney's Office.'",
        "'speaker_0': 'Mr. City Attorney, there is a version of the motion in the second in this controversy for a.'",
        "'speaker_4': 'Thank you. As one who was honored by being sworn in by Michael Mays in 2016 for that term in office, I'm very happy to make this motion. And I'd like to thank our city attorney, Charles Parkin, for doing a great sales job.'",
        "'speaker_4': 'I don't know how you did it, but thanks for bringing them back.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_3': 'We love Mike. Can we just bring him back indefinitely? Thanks.'",
        "'speaker_0': 'Yeah. I just want to add, what's the best item on the agenda?'",
        "'speaker_2': 'I think.'",
        "'speaker_0': 'Just I think I think he's someone that's just greatly loved. So I look forward to him helping out and doing, you know, doing whatever whatever you and the team need and moving forward. So there's emotion any second. There's no public comment on this item, so please cast your votes.'"
    ],
    "Renaming of El Dorado Park West Senior Center. ": [
        "'speaker_1': 'Emotion is key.'",
        "'speaker_0': 'Thank you. Annexes. 37, please.'",
        "'speaker_1': '37 is a report from Parks and Recreation and Marine recommendation to rename the Eldorado Park West Senior Center, the Dr. Thomas J. Clark Community Center, District four.'",
        "'speaker_0': 'Thank you. There is a motion and a second counsel Supernanny.'",
        "'speaker_4': 'Thank you. This proposal was unanimously approved by the Government Personnel and Elections Oversight Committee on September 28 and unanimously approved by the Parks and Recreation Commission on October 21st. As I've said in the past, Dr. Thomas Clark is the longest serving councilmember in the history of this city and also served for 16 years as a city college'",
        "'speaker_4': 'trustee. I was asked in the past, you know, why Eldorado Park? No one associated that with the Fourth Council District. Ironically, these items came before these committees and commission prior to our most recent redistricting. But Tom Clark originally served on the Parks and Rec Commission.'",
        "'speaker_4': 'He led the way to acquire the land for Eldorado Park, and that was in the fourth District in the first part of his term. Ironically, he returned to the fourth District on December 18th. So we'd appreciate your support on this item.'",
        "'speaker_4': 'And I would add to that, I had the ability to talk to Dr. Clark when he was still alive and and asked him about what recognition he'd like to have. And he said if anyone wanted to ever name something for me, I'd like it to be associated with Eldorado Park.'",
        "'speaker_4': 'Some very pleased to bring this item forward tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Alan.'",
        "'speaker_5': 'I'm very much in support of this item.'",
        "'speaker_0': 'Councilmember Ringa.'",
        "'speaker_3': 'I had the honor and privilege of serving under Dr. Clark when I was an employee for the city, as well as serving alongside him as a member of the Long Beach City College Board of Trustees. The man was honorable, honest, direct, and he was a mentor to me.'",
        "'speaker_3': 'So I'm very proud to support this item.'",
        "'speaker_0': 'Thank you. I'm also enthusiastically support this item. I think customer support, this is a great honoring of a really incredible leader and man. I have also had a chance to spend time with with Dr. Clark, and I think he's someone who has just such an incredible legacy.'",
        "'speaker_0': 'And this is a great way of continuing to honor him. And of course, not the only way we've honored Dr. Clark, but he's someone that that makes a lot of sense for this naming. And so I just want to thank you for your for your leadership on this and to the Parks and Rec Commission, to everyone involved'",
        "'speaker_0': 'in the process. It's a great move idea. With that, there's no public comment. I believe so. Members, please cast your votes.'"
    ],
    "Contract Award for Prefabricated Junior Lifeguard Facility Modular Building.": [
        "'speaker_1': 'The motion is. Kate.'",
        "'speaker_0': 'Item 38, please.'",
        "'speaker_1': 'Item 38 Report from Public Works Recommendation to award a contract to accelerated modular concepts for furnishing and delivering a fabricated junior lifeguard facility. Margin of a building in a total amount of $930,000. 390 5263.'",
        "'speaker_0': 'Thank you. Is there emotion? Can I get a second, please? As you probably comment on this item. Members, please cast your votes. Oh, yes.'",
        "'speaker_6': 'I just wanted to thank city staff on this. This has been a project that we've been working on for years now, and it's finally coming to fruition. And I'm so grateful to Chief Medina for his work with the Junior Guard program, and I'm excited that there's going to be a new facility that comes close to resembling the'",
        "'speaker_6': 'gem of a program that we have here in Long Beach, because the current building does not. So thank you.'",
        "'speaker_0': 'Thank you. And sorry about that. This Councilman Allen, do you have any comments? Okay. There's a motion to second. Please cast your votes.'",
        "'speaker_1': 'Councilwoman Zendaya's, Councilwoman Price. The most of these.'"
    ],
    "Emergency Ordinance to Amend School Board Districts.": [
        "'speaker_1': 'The motion is carried.'",
        "'speaker_0': 'Thank you. Next up is item 40.'",
        "'speaker_1': 'Item 14, report from City Attorney and Report from City Clerk. Recommendation to adopt ordinance amending the Lombard Municipal Code by amending school board districts. Establish declaring the urgency thereof and declared that this ordinance no take effect immediately read and adopted as read citywide.'",
        "'speaker_0': 'Thank you. There's a motion and a second. I do believe there's public comment.'",
        "'speaker_1': 'Dave Shukla.'",
        "'speaker_2': 'Here's the issue. As I stated at the last meeting in December evening, it meant that a 12 year old can understand a independently of LP with d uh keep me keep making. I kept making redistricting maps. And I'd like to to point out, not only do I support this motion and support what he did with their map'",
        "'speaker_2': ', but that if we'd had it, if he'd had an expert so called, uh, contracted for us, they clearly would have hit upon the same kind of logic that will be widely used to not overreach across the signal hill boundary and specifically over a temple street.'",
        "'speaker_2': 'For anyone who's interested, I was never interested myself in making the map, the redistricting map for the council districts of Long Beach, where I was interested in. Ah. Uh, the reason why we didn't just do the obvious thing, which was make historical Cambodia town as whole as possible, given the one chance we had with that aging population'",
        "'speaker_2': 'and why we didn't just use Temple Street the way the zip code map does, the way the city council district map used to and why we didn't doing the exact same weeks. We're not only are we getting an infrastructure bill passed for the first time, but some of those crucial components of that infrastructure bill are electrical vehicle'",
        "'speaker_2': 'charging stations. And where those charging stations are matter. It matters to Southern California Edison, for instance, for a kind of refilling of their existing assets. It matters for the rest of everyone else to not have a grid that is centralized around the wrong things.'",
        "'speaker_2': 'So there are major questions not only about our physical infrastructure, but about who owns and who controls them. And we don't have the time space to even begin to scratch the surface of them because, you know, frankly, I to come here and, you know, sit through our long redistricting meetings, they don't go anywhere because there seems to'",
        "'speaker_2': 'be an agenda in. And I would gladly sit here for a minute and just stare at you, if that's what it takes. It's really, really unfortunate. School board believed in itself and in the students and people of this city.'",
        "'speaker_2': 'Why didn't the Independent Redistricting Commission, why didn't the city manager's office and the consultant working with them? Why didn't you believe the people of the city? To do it themselves. I was sitting here each week making a map, making another map, people that do it themselves.'",
        "'speaker_2': 'I'm not the only one. Why don't you believe in essentially do it right. But you're going to you're going to represent us in Washington, yet you're running. Roberts running.'",
        "'speaker_0': 'Thank you. That concludes public comment for more than 40 members, including Castro votes.'"
    ]
}