{
    "Entertainment Permit with Conditions for Ballroom Craze.": [
        "'speaker_2': 'Would you please stand and raise your right hand if you plan to testify in this in this hearing? Thank you. Do you, in each of you, solemnly state that the testimony you may give in this course now pending before this body is the whole truth and nothing but the truth, so help you God.'",
        "'speaker_2': 'Thank you. The first hearing involves financial management with a recommendation to receive supporting documentation into the record, conclude the hearing and grant an entertainment permit with conditions on the application of ballroom craze at 4102 Orange Avenue with an entertainment with dancing by patrons permit.'",
        "'speaker_2': 'This is in District seven.'",
        "'speaker_1': 'Leicester City manager. When you turn this over to Jason McDonald. Mayor Council Members Jason MacDonald for Purchasing and Business Services Bureau for the Financial Management Department. Tonight you have in front of you the application for entertainment with dancing for Irene Castillo doing business says ballroom craze at 41 or to Orange Avenue number 112 in District seven.'",
        "'speaker_1': 'All the necessary departments have reviewed the application. The application and proposed conditions are contained in the packet provided. We would like to highlight the fact that this is an existing business relocating and has previously held an entertainment permit.'",
        "'speaker_1': 'We are prepared to address any questions or concerns along with the police department regarding the application or conditions. Thank you. Is there any other is that the end of the staff report? That's the end. Yes, sir. Okay. So with that, is there any public comment on the hearing?'",
        "'speaker_1': 'Seeing no public comment on the hearing, I'd like to begin by closing the hearing and ask for a council motion councilmember Durango.'",
        "'speaker_6': 'Move to approve. This is a go ahead move to approve.'",
        "'speaker_1': 'Okay. There's been a motion and a second customer. Durango. Yes.'",
        "'speaker_6': 'That's been mentioned. This is an existing business that was first located at 3092 Long Beach Boulevard. It's the former Salvation Army site where they were there for many years. It provides an opportunity for seniors to learn ballroom dance.'",
        "'speaker_6': 'It's also moved from there to the new location on the Atlantic Boulevard, Atlantic Avenue location. We contacted the PD to see if there was any kinds of issues that were related to the previous location. That was a new one, and we have found none.'",
        "'speaker_6': 'And so therefore, I move that we approve this application with the restrictions, as noted in the.'",
        "'speaker_1': 'Application kit has been in motion and a second on the floor. All those in favor, please go ahead and cast your votes.'",
        "'speaker_2': 'Motion carries eight votes.'",
        "'speaker_1': 'Okay. Now we're moving on to public comment. And the first speaker is Aaron Fletcher. Our mayor honored council members, citizens, thank you very much. My name is Erin Fletcher and I am a board member for the Long Beach Lifeguard Association.'"
    ],
    "Resolution to Initiate Coastal Development Permit Process for Belmont Plaza Pool Demolition.": [
        "'speaker_1': 'Okay. Moving on to consent, calendar item number five, Councilwoman Price.'",
        "'speaker_3': 'Thank you. I wanted to pull this item. We received a number of emails today from residents in the third district who were concerned about this particular item, specifically the planning of the demolition, the truck routes, the traffic related concerns that would arise as a result of the demolition.'",
        "'speaker_3': 'And I'd like to ask staff to address some of those concerns. I have forwarded several of the emails that I received today to members of our staff, and I'm hopeful that they can help address some of the concerns raised.'",
        "'speaker_1': 'Mr. WEST Mayor, council members, I'm going to turn this over to our development services director, Amy Bolduc, to respond to those issues.'",
        "'speaker_3': 'Mr. Mayor, members of the City Council and Mr. Mays. Hello.'",
        "'speaker_4': 'Sorry for that. We. A couple of the issues that were we've addressed.'",
        "'speaker_3': 'Related to the truck routes. That is something that we are working on with our Department of Public Works Traffic Engineer. That truck route will be something that is.'",
        "'speaker_4': 'Responded to and dealt with through our traditional process. In general, when we deal with demolition of buildings, there are a number of protections.'",
        "'speaker_3': 'That are required of any demolition site or any construction.'",
        "'speaker_4': 'Site, and that does include things like haul routes, how.'",
        "'speaker_3': 'How the construction activity is staged.'",
        "'speaker_4': 'How the area is fenced off and protected.'",
        "'speaker_3': 'So that.'",
        "'speaker_4': 'Members of the public that do not access the construction area and how we protect the surrounding environment. We have a number of municipal code regulations that also dictate how those demolition.'",
        "'speaker_3': 'Activities also occur. Back in April, to a point that was raised in one of the emails that Ms.. Price is referring to, back in April, the City Council executed an adopted a statutory exemption under the California Environmental Quality Act.'",
        "'speaker_3': 'So for all intents and purposes, CEQA has been done and and the.'",
        "'speaker_4': 'Project has complied with Sequoia.'",
        "'speaker_3': 'In order for us to proceed with the demolition phase only. I want to make it clear that we are only talking about the demolition of the existing pool. We are not discussing the new construction of the new pool because we don't yet have a program that has been approved by the City Council for us to move forward'",
        "'speaker_3': '. Any discussion about the.'",
        "'speaker_4': 'Long term location.'",
        "'speaker_3': 'Or quantity or quality of vegetation, landscaping and the eventual construction of the pool, all of those issues get vetted through a separate, secure process for the new construction of the new pool. So related to the demolition, we have cleared the demolition project under Sequoia.'",
        "'speaker_3': 'And the item before you tonight is allowing us to issue a coastal development permit because this project is in the coastal zone and because it is in dual jurisdictions of both the city and the California Coastal Commission, there is a process that allows us to request that only one coastal development permit be issued, and we give our'",
        "'speaker_3': 'authority to the Coastal Commission that does streamline the process and it does make sure that the conditions of approval that are placed on a project are consistent. If we were to do this separately, we might put on one condition of approval and the Coastal Commission may have the ability to put on a separate, conflicting condition of approval'",
        "'speaker_3': '. So by doing.'",
        "'speaker_4': 'A.'",
        "'speaker_3': 'Consolidated coastal development permit process, it does streamline that process and allows us to act as one agency. If you proceed with the adoption of the resolution tonight, we are hoping that we would go to the California Coastal Commission in October, and if they approve the coastal development permit, then we would initiate demolition activities by mid to late'",
        "'speaker_3': 'October. We have committed to the Coastal Commission that we would maintain protections above and beyond those required at this time for the vegetation surrounding the area, particularly related to trees and bird species. And we have done surveys on what birds are out there, whether they are nesting or roosting.'",
        "'speaker_3': 'And we have also had a certified biologist go out to the site as well. All of those issues have been cleared. We've shared all that information with the Coastal Commission in anticipation of of their reviewing this item in October.'",
        "'speaker_3': 'Hopefully that addressed the issues that were raised. And I'm here to answer any.'",
        "'speaker_4': 'Questions you may have, Councilwoman.'",
        "'speaker_3': 'In terms of the truck routes necessary for the demolition process, will there be obviously we want to make sure that we pick. Roots and a path that's least invasive to the residents there. So what kind of meetings or discussions are we going to have to make sure that we pick the route that's least invasive?'",
        "'speaker_3': 'So typically the traffic engineer looks at the existing truck routes within the city and we try to keep the all the trucks on those mapped existing truck routes. Clearly, there is not a direct truck route that goes to this facility.'",
        "'speaker_3': 'So the.'",
        "'speaker_4': 'Traffic engineer.'",
        "'speaker_3': 'Is tasked with coming up with options to get the trucks to the closest truck route possible. It will go through a couple of local streets, but that is the discretion of the traffic engineer to look at the various options and pick the route that is least invasive to the residential neighborhood.'",
        "'speaker_3': 'Thank you. I have nothing further.'",
        "'speaker_1': 'Thank you. Katherine Mongeau.'",
        "'speaker_4': 'I just wanted to comment on the path that's used in my district for another project that the city traffic engineer has been instrumental on, and that the residents have been very appreciative of the responsiveness and the penalties to contractors that do not abide by the guidelines and rules.'",
        "'speaker_4': 'I think the city has been very proactive to make sure that the neighbors are kept apprized of the situation and it seems like we've come to a great resolution. So when our area was destroyed, we're actually under construction now.'",
        "'speaker_4': 'Everything went very well and everyone was very responsive. So I look forward to that same thing with the blah blah.'",
        "'speaker_1': 'Thank you. Can we get a motion to approve some? There's been a motion and a second. Any public comment on the item? Very good. Clark has the address. So if I understand this correctly, what we're but what we're dealing with here is only only only that which is related to taking down the building and working out the'",
        "'speaker_1': 'traffic patterns. Is that correct? Of how the what is removed goes, which is which is central? We've been through that with the Terminal Avenue Storm Drain Project. And just in case I'm not here, when other items come up, the import of this is obviously it's going to take more than a fortnight to get this done.'",
        "'speaker_1': 'And history demonstrates, quite frankly. And some people may take it personally. Sometimes the staff can't be trusted. The majority of them can. So what we will end up with, what I want to try to avoid is a year from now, two years from now and down the pike, they have a permit for X, Y and for one'",
        "'speaker_1': ', two, three, four components and then slip in six or seven. That might be contentious and people may try to slip that in underneath the radar. And that has happened. And we don't have to go too far back in history to see that.'",
        "'speaker_1': 'So as long as we're confident, as long as there's an understanding now that this just has to do with the removal. That's fine. The only other comment I would have made, I would hopefully deal with that. We take a look at maybe just putting that stuff on a barge and taking it whatever it is, and remove it'",
        "'speaker_1': 'from our area that way and obviously not dumping it in the water, but maybe instead of a truck, we use a barge. We've got a pier there. Run the truck out there. Thank you. And they won't have any traffic lights.'",
        "'speaker_1': 'Thank you. No other public comment on the item. Members does go and cash your boats.'",
        "'speaker_2': 'Motion carries eight votes.'",
        "'speaker_1': 'Keep moving on to item number nine in the regular agenda.'"
    ],
    "Report on Metropolitan Water District Board Meeting.": [
        "'speaker_2': 'We have a report from the Office of Vice Mayor Susie Lowenthal with the recommendation to receive and file a report on actions taken at the Metropolitan Water Board District meeting in September 9th.'",
        "'speaker_1': 'Circuit OC Vice Mayor Lowenthal.'",
        "'speaker_4': 'Just briefly wanted to mention that Assemblymember Rendon was here to discuss Proposition one, which is the Water Quality Supply and Infrastructure Improvement Act of 2014. And one of the items that the Metropolitan Water District took up at its September 9th meeting was to approve support for that measure and to convey that to the legislature.'",
        "'speaker_4': 'But the summary of the remaining parts of the meeting are there as well. Thank you.'",
        "'speaker_1': 'Thank you. There's a motion and a second public comment on the item. CNN, Please cast your votes.'",
        "'speaker_2': 'Motion carries seven votes and one abstention.'",
        "'speaker_1': 'Keir Starmer Let me quickly go, Mr.. Mr.. City Attorney. I know we had a we just need a can we can call for a revote on the real briefly.'",
        "'speaker_4': 'Yes, I tried to uncool myself.'",
        "'speaker_1': 'Okay. Okay.'",
        "'speaker_2': 'Please cast your vote again.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Councilmember Andrews, you realize it was so controversial.'",
        "'speaker_2': 'Motion carries eight votes. Yes.'",
        "'speaker_1': 'Okay. Thank you. I'm going to I know that the suggestion is related to do a report out on the closed session. So let's do that quickly. Then we'll go back to the agenda. Mr. Parker. Thank you, Mayor. Members of the City Council pursuant to section 54956.9 this evening in closed session, City Council authorized the settlement of the'",
        "'speaker_1': 'case of Rockwell versus City of Long Beach by a unanimous vote of 8 to 0 to. And the settlement includes injunctive relief to make a number of minor structural changes instituted over the next five years at Queen Mary and the payment of $80,000.'",
        "'speaker_1': 'Thank you. Thank you. And now going on to number ten, Mr. Quick.'"
    ],
    "Report on Fiscal Impact of Waiving Business License Fees for New Businesses.": [
        "'speaker_2': 'To report from the office of Councilwoman Susie Price, Councilwoman Stacy Mango and council member Roberta Ranga with a recommendation request at the city manager. Report to the City Council within 30 days, identifying the fiscal impact of a search associated with waiving the business license fees for a new business hit for the in their first year.'",
        "'speaker_1': 'Thank you, Councilwoman Pryce.'",
        "'speaker_3': 'Thank you. I want to speak a little bit to this item because I want to make it clear what the intent and purpose behind this item was so that we we can move forward with no miscommunication in an effort to come up with ways to attract new businesses to this city.'",
        "'speaker_3': 'One of the things that I would like to do is to determine what the impact to the city would be, to waive the business license fee that is paid to the city for the first year of a new business.'",
        "'speaker_3': 'And the reason for the request is because over and over again, when you hear from small businesses who want to establish in the city and in other cities, what you routinely hear is that they get hit from every direction and that it's very stressful and difficult for them to get established because they're paying fees to get established'",
        "'speaker_3': 'to all sorts of entities. And so I want to find out what would be involved with our city waiving the fees for a year to allow these businesses to establish and perhaps encourage them to establish here in the city.'",
        "'speaker_3': 'And the costs associated for that business are relatively minor in the grand scheme of things, but can be very impactful to a small business that's trying to establish itself within a city. It is not contemplated and was not contemplated at any time that the analysis would involve any sort of detrimental impact to our business improvement district.'",
        "'speaker_3': 'Certainly the assessment fees that they collect, this really is purely an analysis of what the fees paid to the city are to get a business license and how much the city would be impacted if those fees were waived for one year based upon the number of businesses that were traditionally used to seeing in the city.'",
        "'speaker_3': 'So establishing kind of a range of businesses, the number of businesses that we expect would develop in the city and figuring out what the fiscal impact would be. This is an educational request so that we can get some information so that as a council and potentially as an economic development committee, we can think about what some programs'",
        "'speaker_3': 'and incentives would be that we could offer to businesses that want to establish here in the city. So with that, I would like staff to take a look at this issue. And I will say that I am mindful that this is not the first time the issue has come before the city council, Long Beach.'",
        "'speaker_3': 'And I understand it's it's a it's an issue that keeps coming up in terms of a possibility that of something that we can do as a city to make ourselves a little bit more attractive to new businesses who want to come in.'",
        "'speaker_3': 'It's an information gathering request really is what this is. And I look forward to staff giving us some information regarding what the impact would be to the city. Knowing that having a revenue source is very important to us and not taking away from our revenue source is very important for us in terms of continuing our services to'",
        "'speaker_3': 'the people, the city of Long Beach. So we'll have to balance all of that, but I'd like to balance it all with full information and reporting from staff. So thank you.'",
        "'speaker_1': 'And thank you, Councilwoman Mongo.'",
        "'speaker_4': 'I'm really glad that we're bringing this up again. We have five new faces on the council and we're looking to do things creative and different. I also want to comment that there are other motions in the works for our existing businesses.'",
        "'speaker_4': 'We don't want to limit opportunities to grow to new businesses. We also want to let other businesses that are already here know that we are looking out for them and that those motions are a little more complicated and they're going to take a little bit more time as we're working through some of the staff on some of'",
        "'speaker_4': 'those matters, but that they are not forgotten and they are appreciated and that we will be reaching out to them. Sector by sector, some sectors have already been contacted and we'll be providing more information to come. But both new and existing businesses are very important to our success in the future of language.'",
        "'speaker_1': 'Thank you. Councilmember Andrews. Yeah. Yes. I'd just like to kind of chime in on that, because I believe that we did bring this topic, you know, in the past and it went to the committee. You know, in the back in 210, we brought forth the amnesty program, which gave business owners an opportunity to avoid, you know, the'",
        "'speaker_1': 'pay and penalties as a result of non-reporting, you know, an underreporting in business taxes and license fees, you know, which is very beneficial. And I think it's very I think we definitely need to continue to, you know, look to new ways to keep the Long Beach businesses, you know, friendly.'",
        "'speaker_1': 'Thank you. Councilmember Austin.'",
        "'speaker_6': 'Thank you. So council members, I want to commend the council members, Price Mungo and Tauranga for bringing this forward. I fully support the mindset of supporting and creating incentives, incentives to bring new business and start up new business here in the city.'",
        "'speaker_6': 'I think it's just it's long overdue for us to be thinking like this. And I commend you for the thought. I'm very interested in supporting this item and getting feedback from from city staff in terms of the information requested.'",
        "'speaker_6': 'I, I want to know really what the impact of this is going to be. How much is the average business license? And how far does this go to really incentivize a new business to come to an empty storefront in downtown or or north Long Beach or on the West Side?'",
        "'speaker_6': 'I mean, we have to have some some real and realistic expectations here. And I'm also concerned about, you know, the businesses that have toiled away for many years and who who are looking for some relief as well. And so I'm glad to hear that they're we're looking in that direction as well.'",
        "'speaker_6': 'And so I will I will support this motion. And, you know, I commend you for bringing it forward.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_3': 'I want to thank all of you as well. We have a couple business improvement districts in our in our first district. I know a couple of questions that I had. I don't know if this had been thought about or perhaps it could be reviewed as well as the are we talking this is all brand new businesses.'",
        "'speaker_3': 'Is that correct? Is that the intent? That would that was the intent for brand new businesses to waive their fee for the first year to.'",
        "'speaker_4': 'Long Beach so they could have a business in another city, say, another neighboring city. And if they opened a location here, that would be a new business.'",
        "'speaker_3': 'And then the types of fees as well is something that I often hear about from our downtown businesses is the special events fees. Because so many events are going on, they already have a business license fee just for starting their business, but then there's another fee for just having a special event.'",
        "'speaker_3': 'And so that's perhaps something that could, you know, be included in that as well. And are there thresholds for the size of the business or. I know there's a lot to think about, but I'm just. Those are things that are certainly important on on our end.'",
        "'speaker_3': 'So. Thank you.'",
        "'speaker_1': 'Thank you. Vice Marie Lowenthal.'",
        "'speaker_4': 'Thank you, Mr. Mayor. I also wanted to be sure that when staff does come back with their report, when they're looking at other cities, if they could provide either a summary of any studies that were done or any of that data, I think it'd be helpful for at least it'll help me if I'm able to see that'",
        "'speaker_4': 'kind of back up in your in your report. I don't know exactly what your thoughts were on how you would report back, but it would be it'd be helpful for us to include any studies of measured values stemming from cities that may have wave fees in the past.'",
        "'speaker_4': 'I think I'm supportive. I think it's it's a great idea. And it's definitely one that could help incentivize businesses and encourage them. But I do want to know what other cities experiences are. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Price.'",
        "'speaker_3': 'Thank you. Just in response to Councilwoman Gonzalez. You know, I. One of the things that I'd like to be included in the staff report would be just an analysis of what are the fees. I understand that the fees vary depending on the number of employees.'",
        "'speaker_3': 'So obviously the fees of one that one business is paying may not be the same as another, but that's some information that I'd like to receive as part of the report so that we can move forward with all being on the same page.'",
        "'speaker_3': 'So the size of the business, really, I'd like to know how our fees impact the business size. And in regards to other cities, I think it's important to know what other cities have similar size charge in terms of their business license fees, because one of the things that we hear repeatedly, especially from small businesses, that is that'",
        "'speaker_3': 'Long Beach is not business friendly or that the fees are too high to allow them to get established. You know, that may be accurate or it may be a myth. I don't know. And that's one of the reasons we need a report like this, because it's really important for us to be able to answer with full information'",
        "'speaker_3': 'in regards to what other cities are doing and really what we can do. And to even look into this issue and to try to do something to help some of those businesses that are concerned about the additional $300 or thousand dollars that they have to pay to establish is really the intent behind this.'",
        "'speaker_3': 'This report is what can we do to help them out and help them get established. So with that and in regards to the bids, I do want to talk about the bids. You know, the bids. I don't think there's anybody here who would disagree with the value that the bids bring to each and every one of our'",
        "'speaker_3': 'communities and to the businesses that are within their organization. So it's not the intent of anyone to impact the service of the bids or to impact their operations at all. This really is about what we can do as a city to help small businesses get established in the city or even large businesses.'",
        "'speaker_3': 'We don't want the fee to be such a deterrent that they don't want to do business here. And whether it is or not, I don't know. That's one of the things that the report will hopefully convey. So with that, I'd like to make a motion to approve this agenda item.'",
        "'speaker_3': 'Second.'",
        "'speaker_1': 'There's been a motion and a second, Councilmember Richardson.'",
        "'speaker_7': 'Thank you to my colleagues for bringing this forward. I think particularly with the small businesses in North Long Beach and the vacancies that our property owners are facing, anything we can add now that we don't have tools like redevelopment enterprise zones, the tools that we can throw into the into the the the, you know, the shed into'",
        "'speaker_7': 'the toolbox. Anything we can do to help inspire folks to come here and invest, it's certainly a step in the right direction. Now, I want to, you know, just ensure that we're thinking about, you know, are we are we you know, should we limit this thing, this whole conversation to two small businesses?'",
        "'speaker_7': 'I mean, and, you know, and we and make sure that we don't expose ourselves to any kind of fraud or folks who might want to, you know, open multiple businesses under multiple names and, you know, and change business licenses every few years.'",
        "'speaker_7': 'You know, activities like that happen so where they can keep, you know, exposed in the system. So just let's make sure we evaluate that in this study as well so we don't, you know, create a loophole that we got to get ourselves out of.'",
        "'speaker_7': 'So it may be a way to do that, is when we actually talk about a policy, when it comes up, you know, we ensure there's some flexibility for staff to exercise some judgment there. Thanks.'",
        "'speaker_1': 'Thank you. Just a few comments. I just want to start by just Mr. West. I want to make sure that we also convey to to the staff that's down there of the incredible hard work that they're doing every single day.'",
        "'speaker_1': 'I know that our whole business licensing division and the finance group down there and the new business folk that they always get from, for many of us as well as the community, a lot of grief often because it's a very difficult job and a lot of our businesses do go through a difficult process on occasion.'",
        "'speaker_1': 'But I do want to make sure that we note that the improvements have been made down there over the last, you know, six, seven, ten years have been evident. I think that, in fact, the county recognized the city on a couple of occasions for the improvements made to the system and for moving in the direction of being'",
        "'speaker_1': 'a business friendly counter and for having service are a few superstars down there. And we hear those stories as well as some of the stories that that we don't like to hear. But certainly the ones that I often hear are of how things have improved, that things are going in the right direction.'",
        "'speaker_1': 'And so I just want to make sure that as part of its discussion, I also want that relate to them that they are working hard and we're thankful for for the improvements that are being made down there. And I think this is a really good item that this time has come again to have a discussion about.'",
        "'speaker_1': 'I also am hopeful that as the guiding principle of the Council and ICO and as well and the Economic Development Committee, that we that we look not just at this fee, but what are all the fees that we get to business.'",
        "'speaker_1': 'And so what makes the most sense if there was going to be relief? What is it that makes the most sense? Because I imagine that in my conversations with Councilwoman Mongeau and others are there are other types of fees and other types of burdens that the city should look at, should look at holistically.'",
        "'speaker_1': 'So I think that all of that would be great to see. And I know that I believe this will be brought back to the committee as well. So I think it's great. Very supportive. Councilwoman Price.'",
        "'speaker_3': 'I just wanted to point out because I know I said this has come up before. So, you know, credit where credit is due that this is something that the city looked at before. It's not like the city hasn't thought about it before.'",
        "'speaker_3': 'In 2011, they had a.'",
        "'speaker_4': 'Business growth.'",
        "'speaker_3': 'Incentive act agenda item, and it was a lot more involved than this. So this is more of just a very simplified, broken down request so that we can try to look at, you know, this item first as we think about the holistic approach that the mayor just mentioned.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_4': 'When we talk about what's happened in the past and where we want to go moving forward, I appreciate the simplicity of the motion that you've brought before us today, and I think that it brings a lot to the table to bite off small pieces.'",
        "'speaker_4': 'I think that sometimes organizations of our size try to take these giant bites out of things and there can be unintended consequences. So I appreciate the thoroughness and patience of all of our constituents because we're going to keep at this every week.'",
        "'speaker_4': 'You're going to hear us back here working hard to make sure that we can increase our business presence, our business friendliness, and the sales tax revenue that all of these small businesses bring in and big businesses as well.'",
        "'speaker_4': 'So thank you to everyone who's been supportive and I look forward to the vote.'",
        "'speaker_1': 'Thank you all. Any public comment on the item? CNN members discuss your votes.'",
        "'speaker_2': 'Motion carries. April. Yes.'"
    ],
    "Report on Pedestrian Safety Advisory Committee, School Crossing Guard Program, and Traffic Safety in School Zones.": [
        "'speaker_1': 'Excellent. Next item, please. Item number 11.'",
        "'speaker_2': 'Item 11 is a report from the Office of Council Member Al Austin with a recommendation to request the city manager to prepare a report on the status of the Pedestrian Advisory Safety Committee and an overview of the school crossing guard program.'",
        "'speaker_1': 'Council Councilmember Austin.'",
        "'speaker_6': 'Thank you, Mr. Mayor. And you know, in the agenda business item, we failed to realize that tonight is actually back to school night and Long Beach Unified. And there were a number of parents and PTA organizations and even students that wanted to come out and speak on this.'",
        "'speaker_6': 'And so I'm going to respectfully request to table this motion until the October 7th meeting.'",
        "'speaker_1': 'Thank you. Thank you. Yeah, there's been a motion and a second. Any public comment on the item? CNN, please cast your vote.'",
        "'speaker_2': 'Council member has and that's to continue it to October 7th on that agenda.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Motion carries eight votes.'",
        "'speaker_1': 'Next item.'",
        "'speaker_2': 'Item 12 is a report from financial management with the recommendation order contract to ABM on site services for providing custodial services at various locations in an amount not to exceed $1.007 million.'"
    ],
    "Construction Management Services Contract for the North Branch Library Project.": [
        "'speaker_2': 'Believe item 18.'",
        "'speaker_1': 'Oh, there's one more.'",
        "'speaker_2': '18 It's so report from Public Works Department with the recommendation to award a contract to veneer construction management for service management services for the North Branch Library Project in amount not to exceed $1.197 million.'",
        "'speaker_1': 'Some of it has been in motion. And a second and yes.'",
        "'speaker_7': 'I just want to say something about the library. So. Oh, sure. So quickly. So we had some challenges with Fire Station 12 and its construction. It's particularly important that we have construction management on this library. I think folks should know that we've you know, we've taken our time to select a construction manager to ensure that we we'",
        "'speaker_7': 'do the right thing and we don't have to run into the problems we ran into with Fire Station 12. The date for the for the fire station for the library groundbreaking will be will be within this next month.'",
        "'speaker_7': 'So it's a very exciting time. Now, this is the last agenda item for the library until we see some some shovels in the ground. So thank you.'",
        "'speaker_1': 'Oh, great. There's been a motion. Any public comment on this item? Mr. Goodhew. Very good. Your clinic has addressed, obviously, supporters of finance for libraries. My mother was a librarian, actually went earned her degree about a decade and a half earlier or before.'",
        "'speaker_1': 'Eleanor Schmidt, who was our librarian for almost two and a half decades here. Also my great great uncle who I never met but designed our is main library. I fully support this. I'm hoping you can find some money at some point in time and I'm going to recommend that you buy that they.'",
        "'speaker_1': 'One of the first books they buy there and then have an average library. This book called The Boys in the Boat. In fact, I've recommended to Mr. Steinhauser that it be required reading it put on the required reading list or social studies in the Long Beach Unified School District.'",
        "'speaker_1': 'It is a fantastic book about what it is. It's a story about the 1936 Olympic eight, the gold medal boat. But it is much more than that. It is a fantastic recount of what life was like in the Depression area era up in Washington and across the country.'",
        "'speaker_1': 'It's got you can Google of sight and you can see it. You can actually see a two and a half minute video of the final race in Berlin. But again, it's called Boys in the Boat. I think every single council person should read it.'",
        "'speaker_1': 'I think, as I say, I think it will be read in the schools. I know every athletic coach, regardless of the sport, will read it. But it's just a fantastic, well-written it's well-written account of the struggles of the average American family back in the Depression and the economic hard times they face, which will probably resonate with a'",
        "'speaker_1': 'lot of people today. And so they get a good perspective of what life was back in the United States, although it does center in the northwestern part of this country again. Boys in the boat. Google it. You can read the reviews and you can even see the the video of black and white, the final race in Berlin'",
        "'speaker_1': '. Thank you. Thank you. And let's I want to make sure that we're trying to keep the comments to the item at hand. The North Library.'",
        "'speaker_6': 'Will.'",
        "'speaker_1': 'Surely be installed.'",
        "'speaker_6': 'That book will.'",
        "'speaker_1': 'Be in the library. Right. That was that was that was the connection. You have libraries where they have books. Thank you. I did not.'",
        "'speaker_7': 'Know. Would you mind donating that book to the library?'",
        "'speaker_1': 'I'll. I will. This is somebody else's copy. I will. Great. Thank you. Thank you. Okay. Moving on. There is a motion on the floor. However, there anyone that has any comments and I think these people are queued up for new business.'",
        "'speaker_1': 'Probably hope so. Please go ahead and cast your vote.'",
        "'speaker_2': 'Motion carries nine votes. Yes, I mean eight votes. Yes. Sorry about that.'",
        "'speaker_1': 'Thank you. Run off to the bookstore. Okay. First up is Councilman Andrews. Yes. Thank you, Mayor. Thank you very much. I will be teaming up with the Cambodian American Business Association to host the fourth Cambodian Business Expo. That will be 8 a.m. to 5 p.m. Sunday, September 28, at Mark Twain's Library Park at night.'"
    ]
}