{
    "ABC License Transfer Application and Protest for The Deuce.": [
        "'speaker_2': 'Councilmember Schubert now and then.'",
        "'speaker_1': 'Thank you. And there were also item 21, which was pulled from consent. So we'll do that one very briefly when I read that item and a quick.'",
        "'speaker_2': 'Report from Long Beach Police Department recommendation to determine that the application serves the public convenience and necessity and receive and file the application of the Deuces for a premise to premise and person to person. Transfer of an ABC license at 2222 East Anaheim Street.'",
        "'speaker_2': 'Submit a public notice of protest to ABC and Direct City Manager to withdraw the protest if a cup is granted. District four.'",
        "'speaker_1': 'Councilmember Superdome.'",
        "'speaker_8': 'Thank you. I'd like to make the motion to withdraw the protest. We stand in full support of this establishment.'",
        "'speaker_5': 'They have a great they are great operators, great community members. They have.'",
        "'speaker_8': 'An establishment in the second district.'",
        "'speaker_5': 'That I believe Councilwoman Pearce would support. So thank you.'",
        "'speaker_1': 'Thank you. Vice managers. Okay. Councilman Pearce?'",
        "'speaker_3': 'Yeah, I just wanted to. To lend my voice. Jim has been fantastic in the district. He's made every change possible to ensure that his establishment meets with the neighborhood. And so congratulations on having a wonderful business owner in your district.'",
        "'speaker_0': 'Kim.'",
        "'speaker_1': 'Any public comment on this item? Seeing none. Members, please go and cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay, great. And we have three items that have been that have all been cued up to be moved up there, the item on commissions, the the Latino economic profile and the play items. So those will all be heard first.'",
        "'speaker_1': 'The first item will be the non charter commission appointments, which should be which will go pretty quickly. Can you read an item, please?'"
    ],
    "Status Report on the Economic Profile of the Latino Community in Long Beach.": [
        "'speaker_1': 'Okay. Let's see. Next item that's been moved up is item number 11. Madam Clerk, please read.'",
        "'speaker_2': 'Communication from Councilmember Urunga, Councilwoman Gonzales, Vice Mayor Andrews and Councilmember Richardson. Recommendation Receive and File Status Report by Central Asia and California State University, Long Beach on the economic profile of the Latino community in Long Beach.'",
        "'speaker_1': 'CA, Councilmember Yu Ringa.'",
        "'speaker_4': 'Thank you, Mayor. I'm very pleased to welcome the members of the community to come here and talk about the impact of Latinos in the economy here in Long Beach as well as originally. We had a nice conference a couple of months ago at the the Convention Center, which was very informative and provided a lot of good information'",
        "'speaker_4': 'about how we can all work together to create a better economy. So I'm very pleased to welcome Professor Armando Vazquez Ramos and our newest elected professor. Elected professor. Professor at Cal State Long Beach, an elected member of the Board of Education, Juan Martinez.'",
        "'speaker_4': 'So I don't know which one of you is going to be making the presentation tonight, but you're certainly welcome to come forward and get it going. We're also joined by the executive director of Central Cha. Jessica Quintana.'",
        "'speaker_2': 'Thank you so much, Councilman Harrington, and thank you so.'",
        "'speaker_3': 'Much for the opportunity to be here today.'",
        "'speaker_2': 'Bear Garcia, Members of the City Council.'",
        "'speaker_3': 'City Manager Pat West.'",
        "'speaker_2': 'We're thrilled to be here tonight. As you know, the organization is the largest Latino serving agency in the city of Long Beach.'",
        "'speaker_3': 'And we're.'",
        "'speaker_2': 'Bringing today the first Latino Economic Impact Data Report for the city of.'",
        "'speaker_3': 'Long Beach.'",
        "'speaker_2': 'If you can imagine, this data report has never been done in this city.'",
        "'speaker_3': 'And.'",
        "'speaker_2': 'You know, we were very fortunate.'",
        "'speaker_3': 'To be able to be commissioned by the state of California.'",
        "'speaker_2': 'Department of Social Services, to be able.'",
        "'speaker_3': 'To uplift this data.'",
        "'speaker_2': 'For years, we've been telling the story and the needs of the Latino community.'",
        "'speaker_3': 'But, you know, we needed to be able to have a data and a.'",
        "'speaker_2': 'Roadmap to be able to help guide some of the decisions, you know, with our families and youth and children here in the city of Long Beach. So we're just thrilled and pleased today. More excited, you know, for the first time, really having this.'",
        "'speaker_3': 'Partnership with the university.'",
        "'speaker_2': 'With our city government, with our community leaders that are here today. I know you see some of the folks sitting in the audience. And so this really took and a labor of love.'",
        "'speaker_3': 'Love, a little nervous. But, you know, we launched.'",
        "'speaker_2': 'The first ever Latino Economic Summit.'",
        "'speaker_3': 'We held a Latino.'",
        "'speaker_2': 'Economic roundtable to really look at the data and discuss, you know, what are some of the challenges, what are some of the successes? You know, what are we doing right? What are we doing wrong? And then really looking at our communities, you know.'",
        "'speaker_3': 'Where are our Latino families? Where are our children, where of our youth? You know, as an.'",
        "'speaker_2': 'Organization, we've been working on initiatives to promote.'",
        "'speaker_3': 'Better jobs. And I know we have our workers here today who will talk about jobs and better jobs, but really looking at, you know, how do we develop those.'",
        "'speaker_2': 'Education.'",
        "'speaker_3': 'Pathways, how do we.'",
        "'speaker_2': 'Strengthen our workforce.'",
        "'speaker_3': 'Development programs that we have an equitable workforce development programs for all.'",
        "'speaker_2': 'And really looking at the violence in our communities and in opportunity. So we are pleased to have this partnership with Cal State, Long Beach and with our local city government, with our economic development department. This can never happen without the partnership.'",
        "'speaker_2': 'This is how we work together to really look at our communities and and promote possibilities.'",
        "'speaker_3': 'And so without.'",
        "'speaker_2': 'Really? I know. It's just, you know, this is something that we have been developing for years. And, you know, this this partnership.'",
        "'speaker_3': 'You know, with Cal State, Long Beach and.'",
        "'speaker_2': 'The Center for Community Engagement, it really started with just, you know, looking at how do we make things better in our community. And so having a conversation with Dr. Wayne Bennett this and really pulling together our resources and saying, how can we make this happen, you know, with the resources and talent, expertize and time, you know, that'",
        "'speaker_2': 'it took to make this happen. You know, this this this was all done by the resources of our city.'",
        "'speaker_3': 'Of our.'",
        "'speaker_2': 'Education department, in the community. You know, there was not a.'",
        "'speaker_3': 'Dollar that was invested, you know, from any other place.'",
        "'speaker_2': 'And I don't think we would have been able to get this kind.'",
        "'speaker_3': 'Of report or paid for it.'",
        "'speaker_2': 'You know, for our city. So I just want to thank everybody for their time, for their investment in our community. I want to thank, you know, our economic development committee, our city council members, you know, our team who is here in the city and sitting in the audience.'",
        "'speaker_2': 'I know we have some of our leaders. We have Cal State, Long Beach, Armando Vasquez from the professor from Cal State, Long Beach. We also have run Aureus was a former director from the health department. We have Teresa moreno who sits here.'",
        "'speaker_3': 'We also have her, Linda Chico and our board chair, Mario Gonzalez.'",
        "'speaker_2': 'You know, these are all folks.'",
        "'speaker_3': 'That have, you know, lived Long Beach and and were really invested and.'",
        "'speaker_2': 'Want to see our communities and our families do well. So, again, thank you so much for your time.'",
        "'speaker_0': 'But.'",
        "'speaker_4': 'Jerry Garcia, distinguished councilmembers, city staff and our committee members. We ready rock n roll, ready to see this thing. All right. So I want to reiterate, this is a preview has not been rolled out or disseminated publicly. There are a couple of things here that are we're in the process of updating.'",
        "'speaker_4': 'So this is the kind of the first public roll out of this preview. So I want to make sure to address that. This is a best practices community engagement initiative. That's a partnership between, as Jessica mentioned, the nonprofit sector central to our university, Cal State, Long Beach, our distinguished city, in particular, our economic development leaders.'",
        "'speaker_4': 'So I want to make sure and highlight that this can be a model that we can continue to leverage and build on and share across our country as well. So the goals and objectives of our project, it's twofold.'",
        "'speaker_4': 'One, it's to help us better understand and address key economic education and health data for Latinos in Long Beach. And second, it's in alignment with our university's vision around the public good. And this can only be done through these partnership and community engagement opportunities.'",
        "'speaker_4': 'The concrete objectives of our profile, if you will, we're still trying to name it something. So any help with our branding is much appreciated, but our objectives are very clear. One is to share this report in community settings.'",
        "'speaker_4': 'So this is the first public opportunity for us to do that. Second, and it's to spark discussion around key policy considerations and implications. We want this to be an action oriented document. Third, to serve as a mechanism for ongoing work updates and further development and dissemination.'",
        "'speaker_4': 'And then lastly, it's to help inform future research and decision making. So that's why we take this very seriously, being able to roll this out with you all here today. So we're going to start off with the data, and it's my great pleasure to have partnered with the chair of the economics department, Dr. Seiji Steinmetz.'",
        "'speaker_4': 'Why don't you take us through the data? Thank you very much, Mr. Mayor. Members of the City Council on City Staff are looking forward to seeing many of you at the 2019 Long Beach Regional Economic Forum this Thursday.'",
        "'speaker_4': 'It's a collaboration between our Cal State, Long Beach and Mr. Kessler's department. Oh, he's not looking. I totally blew that. I'm giving you a pitch here, sir. So between our department and the economic department, there is so much we want to show you.'",
        "'speaker_4': 'And we only have a few minutes, so I'm going to take you through what I'm going to call a brief profile of the Latino community in Long Beach. I might even skip a few slides. So first, let's look at the population.'",
        "'speaker_4': 'There are about 230,000 Latinos living in Long Beach right now, representing 43.2% of the city's population. Close to 80% are of Mexican heritage. And about 13.2%, excuse me, are Central American or South American heritage. So we see the part of the Latino population in Long Beach has grown over the last few.'",
        "'speaker_4': 'Over the last decade, although it's been a bit flat in more recent years. And again, this is going to be a big data dump. I'm just going to show you a bunch of stuff and most of the slides in front of you.'",
        "'speaker_4': 'Population. One of the things I often ask people, just when they started asking me, how did I get involved in this project? And sort of what motivates me? I often ask, Well, let's look at all of the children or all of the young adults in Long Beach are all 18 excuse me, all youth, 18 and under in'",
        "'speaker_4': 'Long Beach. What what proportion of all Long Beach Latinos under the age of 18 were born in another country. And the number I usually get is 20, 30%. That's sort of the common discourse. But I want to point out that, yes, although 33.4% of Long Beach Latinos are immigrants, only 4% of all Long Beach Latinos under the'",
        "'speaker_4': 'age of 18 are immigrants. Put differently, there's only about 2400 immigrant and Latino children in Long Beach or. One thing to note, too, by the way, overall, of all the immigrant population approaching, half of the Latino immigrant community are naturalized citizens.'",
        "'speaker_4': 'All right. So what I've done is I know it's a little hard to see, but this is what you want to do is look for the patterns here, the darker shades of green. This is a heat map of the population, the Latino concentration in the city.'",
        "'speaker_4': 'So darker green means a larger share of Latinos in the neighborhood. So if you look for the darkest green areas, we see. The 710 freeway along the left side and then the four or five coming through the city.'",
        "'speaker_4': 'And then above the 91 up there is the greater Long Beach, we might call it, or north of Long Beach. And we see that there are some fairly you know, the darkest green are 50% or more Hispanic, Latino.'",
        "'speaker_4': 'And we see that there are some pretty identifiable areas that are predominantly Latino. Particularly in downtown and north of that, towards central and the north side of Long Beach. In terms of education. If we're looking at the population of Long Beach Latinos over the age of 25, 37.6% of Long Beach Latinos in that age group have less'",
        "'speaker_4': 'than a high school education. Now, by comparison, 10% of all other residents in that age group have less than a high school education. That being said, 15.3% of Long Beach Latinos have earned a bachelor's degree or higher. And we're going to skip that one in the interest of time looking at health insurance coverage.'",
        "'speaker_4': 'There are 23,000 plus Long Beach Latinos who do not have health insurance coverage. Looking at children. There are over 2200 children in Long Beach who do not have health insurance. The working of the working age population, 18 to 64, 16.3% of the Latino community is going without health insurance right now.'",
        "'speaker_4': 'Three and a half percent of kids in Long Beach and in the Latino community. Two and a half percent of our seniors. Health insurance covered rates have gotten better, though. Looking at the graph over here in the orange is the health insurance.'",
        "'speaker_4': 'It's the percentage of Long Beach who are uninsured, who are Latino. And below that, in the blue line is the percentage of Long Beach residents who are in, who are not Latino, who are also going without health insurance.'",
        "'speaker_4': 'So we've seen declines in the uncovered rate. That's good news, right, that the uninsured rate has declined by 13 and a half percentage points within the last decade. Probably in no small part due to community efforts like at Central Cha's.'",
        "'speaker_4': 'Thank you. But also, at the same time, there's you could see there's still a persistent gap between Latinos and everyone else in terms of being uninsured. Okay. So let's look at some more economic data. And again, we're just gonna give you a brief economic profile here.'",
        "'speaker_4': 'Look at the occupations of Long Beach Latino residents, and these are in very broad occupational sectors. So management, business, science and art. Think of that as like the professional sector, for lack of a better way of phrasing it, white collar jobs.'",
        "'speaker_4': 'And then we have their the service sector, sales and office sector. And then the last two categories are natural resources, construction and maintenance and production, transportation and material moving. We can think of these as more of the heavy lifting jobs in blue are all other residents of Long Beach, and in gold are the Latino residents of Long'",
        "'speaker_4': 'Beach. And it gives you a sense of the composition of the workforce who lives in Long Beach? There's a relative there's a disproportionately low number of Latinos working in the management, business sciences and arts sector. And but a relatively high proportion in what I'm calling the heavy lifting jobs and in the service sector.'",
        "'speaker_4': 'And what that's going to do is that will inform what we're going to see next. If we look at median household income among one resident, again, gold is the Latino resident's median household income over time in blue is in this case it's overall right.'",
        "'speaker_4': 'So while Long Beach Latino household incomes have been rising, although flat in the most recent year, there's about a 14.7% gap compared to the overall median household income. The Latino median household income of about $51,000 per year is about 14.7% lower than overall.'",
        "'speaker_4': 'Now, keep in mind, too, there's an extraordinarily large labor force participation rate among Long Beach Latinos. Now, if you were an economist, you wouldn't just geek out on this number. 70% is an extraordinary labor force participation rate. Seven out of ten working age Latinos who work in law, who live in Long Beach are in the workforce.'",
        "'speaker_4': 'That's phenomenal, actually. All right. So despite having a higher labor force concentration, there's still lower household incomes. All right. I'll skip that for now. Now, let's look also at unemployment trends over the or the more we'll say over the last decade.'",
        "'speaker_4': 'And what I want you to do is pay attention to. Again, we have in blue is everyone else in Long Beach. And in gold, we have the Latino community. I want you to pay attention to the end points of these trends.'",
        "'speaker_4': 'Right. When? Times are good during prosperous economic times. There's relatively little difference in the unemployment rates between Long Beach, Latinos and all other Long Beach residents. But when times become more difficult, when unemployment rates rise, who gets hit the hardest?'",
        "'speaker_4': 'Along those lines. The poverty rate among Long Beach, Latino families is 16.4%. One in six Long Beach Latino families lives below the poverty line. By comparison, 9.8% of all other Long Beach families live in poverty. All right. So looking at a trend of poverty rates over time, on the right, we see that the poverty rates have fallen'",
        "'speaker_4': '. All right. For the Latino community, they've been fairly flat for everyone else. But persistently, again, we see systematically higher poverty rate. Then among all other Long Beach residents. All right. And this is just one type of heat map we can do one snapshot.'",
        "'speaker_4': 'What we've done here is I've said let's look at predominantly Hispanic neighborhoods. In other words, neighborhoods that are at least 50% Hispanic, Latino. And also then I said, of those neighborhoods which have a 20% or higher poverty rate or some one in five families in these neighborhoods is living in poverty.'",
        "'speaker_4': 'In these predominantly Hispanic Latino neighborhoods. And what we see as a pattern, we we can identify. So you think of this as among the poorer Latino communities. Where are the most stricken, predominantly Hispanic family neighborhoods? And again, we could see along the seven, ten quarter around downtown towards central and up on the north side of Long Beach'",
        "'speaker_4': '. And also, by comparison, we can see some of these same areas in the surrounding region. It's almost as if there is a imaginary line at Redondo and the four or five that that divides the region. Okay. That being said, what we want to also illustrate for you what I mean, we basically illustrated some challenges for you.'",
        "'speaker_4': 'I think what we also want to show you is the extraordinary economic impact that Long Beach residents have on the community. And to take us through the economic impact analysis first, let me just I'm going to give you the world's fastest lesson on what economic impact analysis is.'",
        "'speaker_4': 'All right. And it's through my mad clip art skills you can see here. So. If I have a job right, I'm going to I'm going to take my earnings and I'm going to spend it on groceries and I'm going to spend it on coffee and I'm going to pay my rent.'",
        "'speaker_4': 'Okay. And then the grocery store and the coffee shop and my landlord, they're going to take my money and they're going to go spend it on goods and service as well. All right. So we call this the induced effect.'",
        "'speaker_4': 'My dollar in earnings spent in the community multiplies throughout the economy. In this case, we're going to focus just on the Orange County and Los Angeles County's almost trillion dollar economy and long, Long Beach Latinos contribution to that trillion dollar economy.'",
        "'speaker_4': 'Also, when I work, I need a computer and I need a chair. So the people who made the chair and who made the computer, they're also getting paid and they're spending is also rippling out into the economy. So these multiplier effects permeate through the economy.'",
        "'speaker_4': 'And what we end up with at the end of the day is we can measure for a specific group like Long Beach, Latinos, how their economic activity permeates through the economy and ends up having a large impact. All right.'",
        "'speaker_4': 'And to take us through that, we have our extraordinarily celebrated economics undergraduate student Megan Anni, who's going to teach us about the Long Beach Latino economic impact.'",
        "'speaker_3': 'Hello. So according to our.'",
        "'speaker_2': 'According to the findings from our impact analysis, we find that over 100,000 jobs held in the region are by Long Beach Latinos. These 100,000 jobs generate $33 billion to the local to the local region. And these 100,000 jobs also sustain an additional 79,000 jobs throughout the local region.'",
        "'speaker_2': 'This are the $33 billion of economic impact, also accounts for roughly 40% of long beaches. Total impact into the economy. So now. Now let's focus on Long Beach, Latino immigrants. 52,000 Long Beach. Latino immigrants are working in the local region.'",
        "'speaker_2': 'These 52,000 jobs create $16.8 billion.'",
        "'speaker_1': 'Real quick, I think the distinction is important. When you say immigrants, you're including both documented and undocumented immigrants. That's correct. I just want to make sure people are aware what that data point is.'",
        "'speaker_2': 'I just want to make sure. Yes. Okay. So that is correct. Immigrants we are going to consider undocumented in addition to documented. And so looking at Long Beach, Latino immigrants, we see that. 52,000 jobs in the local region are held by these Long Beach immigrants, Latino immigrants and the economic output generated by this by these by the'",
        "'speaker_2': 'Latino immigrants alone generates $16.8 billion into the economy. This accounts for 20.6% of long Beach's total economic impact. To the out to the region. So. These 52,000 jobs also create an additional 39,000 jobs into the local region. So let me restate that.'",
        "'speaker_2': 'The 52,000 Long Beach Latino immigrants employed in the local region are creating an additional 39,464 jobs in the local economy. Now, this. Oftentimes, we have a misconception that Latino immigrants are taking jobs when in fact the data supporting that they're creating jobs in the local economy.'",
        "'speaker_2': 'So now let's go ahead and just take a look at our self employed Long Beach Latinos and our self employed Long Beach Latino immigrants. These are essentially our entrepreneurs in the region, and we find that Long Beach Latinos represent about 9000 of these jobs held in the region.'",
        "'speaker_2': 'And their economic impact accounts for 2 billion. And that's roughly 2.4% of Long Beach, just total impact. And it also sustains an additional 5000 jobs into the local region. Focusing on self-employed. We see that focusing on self-employed Latino immigrants.'",
        "'speaker_2': 'We see that they account for 6852 jobs in the local region, and this generates an additional 3000 jobs throughout the region.'",
        "'speaker_4': 'Thank you, Megan. Okay. So moral of the story. Latinos work more than anybody else, but earn less. That's what the data shows. Higher labor force participation, less earnings. And Latino immigrants generate a huge impact into our regional economy.'",
        "'speaker_4': 'So Latino immigrants create jobs, don't take jobs away. So what's next for us? So we've had two community stakeholder meetings. As a Councilmember Wodonga referred to, we had a Latino Economic Summit in the fall. We also had a policy roundtable with systems leaders and these were some of the next steps that have been proposed to us that'",
        "'speaker_4': 'we were going to work on the rest of this calendar year. One is to present this rollout report in different community context and community settings and provide ongoing updates. We're working on the current update right now for this year, which will be released in fall of this calendar year.'",
        "'speaker_4': 'Second, to include more comparative data. So how are we doing in relation to other cities comparable to ours? And then how are Latinos doing in relation to other population subgroups? So that will be included in the update. Third, how do we leverage, support funding and partnerships both public and private around what the data is telling us here'",
        "'speaker_4': 'today? Next, how do we also explore alignment with our local, regional and state efforts, strategies and initiatives? Economic Blueprint. Dr. Simons referred to the Economic Forum in two days next to identified targeted action oriented strategies, policies and programs to address these conditions and issues, not just from a deficit approach, but how do we continue growing our economy'",
        "'speaker_4': 'based on the efforts of Latinos here in Lambics, and how do we make policy decisions again to enhance those efforts? And then lastly, a developing policy framework to better understand the data. The data by itself tells us something.'",
        "'speaker_4': 'But how how do we frame the data around policy needs, policy implications and move forward that way? So out of these stakeholder meetings, these are the policies have emerged. And what we're hoping to do is start developing recommendations out of the policy areas.'",
        "'speaker_4': 'This is a first sneak peek at how we organize the recommendations and the data provided at our stakeholder meetings. So policy areas are around economic inclusion, closing opportunity gaps in education, eliminating health disparities and immigrant integration. So this is the way we're framing the data moving forward.'",
        "'speaker_4': 'What do we mean by implementing economic inclusion? It's really developing policy framings that address Latino poverty and wealth in Lambic. What do we mean by closing opportunity gaps? Again, framing the data around Latino educational outcomes. So although in our region, high school graduation rates are improving, we still have a systemic gap which we refer to as an'",
        "'speaker_4': 'opportunity or equity gap. Next.'",
        "'speaker_5': 'Eliminating health disparities.'",
        "'speaker_4': 'Again, framing our discussions around Latino health inequities. So the fact that we have children uninsured in Long Beach tells us something, what can we do about it? And then the last piece here is around immigrant integration. So we have data here that shows that immigrants are a vital part of our economy.'",
        "'speaker_4': 'How do we build.'",
        "'speaker_8': 'Protections.'",
        "'speaker_4': 'Around our immigrant populations and how do we increase support for our immigrant populations, given that they are contributing.'",
        "'speaker_8': 'Members of not just our local society.'",
        "'speaker_4': 'But our local economy? So that's the preview for you, distinguished council members, city staff Mayor Garcia and.'",
        "'speaker_8': 'Our community members. And we're looking forward to providing you some.'",
        "'speaker_4': 'Next steps on what the data and the findings.'",
        "'speaker_8': 'Demonstrate. I want to thank again our colleagues here from the university, from the Economic Development Department here, and, of course, our partner in crime, Central Asia.'",
        "'speaker_4': 'In this effort.'",
        "'speaker_1': 'Thank you. Thank you very much, Dr. Benitez. Let me let me just do two things, and I'm going to turn this back to customary ranga in a minute here. What I want to thank, of course, just all the the collaboration that happened here.'",
        "'speaker_1': 'Obviously, any time that the university gets involved in such a large research project, I think is is a great thing, especially when you're partnering with Central Cha, a nonprofit agency in the work that's happening in economic development at the city.'",
        "'speaker_1': 'And so I just want to thank all the partnerships. We know when you get the head of the communication program in and the heads of our departments and all the folks at the university so engaged in this work.'",
        "'speaker_1': 'This work is also very important to President Connerly, who I know is very aware of the results. I just want to thank the Cal State Long Beach family for four for doing the work, which I'm a proud member of, by the way, which I love you guys.'",
        "'speaker_1': 'And let me let me let me add that two things that are not here that I think are critical. One is I remember and I talked to Jessica about this a few years ago, you might remember when the State of Black Long Beach came out, that report that was, I thought, really well done at the time.'",
        "'speaker_1': 'And I know a lot of folks had discussions back then when that report came out about all the information that that that provided around the African-American community and the challenges that there were different needs and other populations would also be great to have data on.'",
        "'speaker_1': 'And so I think, you know, the folks that were involved in that report and I think to where I think them also for that work and the fact that this is happening within within the Latino community is also really important work.'",
        "'speaker_1': 'And so I just wanted to uplift that. And then I also wanted to add that the number that the numbers that aren't in here that I that I find important are the numbers around Long Beach Unified. And I know Dr. Bennett is you know, this as good as anyone at the while, the population of of Long Beach'",
        "'speaker_1': 'Latinos is 43%. The population at Long Beach Unified is much higher than that.'",
        "'speaker_4': '54.5% mayor.'",
        "'speaker_1': 'And and can and continues to grow pretty rapidly year after year. And so I think what that what the what the data shows is, you know, we have to ensure that that I think it's our interests that every population succeed.'",
        "'speaker_1': 'Right. Regardless of of of color of where people are in life. And I think that is the mission of this work is to ensure if if Long Beach is going to have and be successful five, ten, 20 years from now.'",
        "'speaker_1': 'It will it will achieve success if the Latino community also achieve success because it's a growing continues to grow up growing piece of this pie. And so we know this is a community that still lags behind in some of these indicators.'",
        "'speaker_1': 'And so we want all of the we want every population wannabees to succeed. And and I just want to thank you for the work you bring on on this important topic. And so thank you very much to the whole team.'",
        "'speaker_1': 'So with that, I want to turn this back over to Councilmember Ringo.'",
        "'speaker_4': 'Thank you, Mayor, and very observant about what's taking place here. And I want to thank Seiji and Dr. Benevides for bringing this forward. The question I have is an effort for being here as well and to set the shop.'",
        "'speaker_4': 'We're putting this together. I mean, it's things don't happen in a in a vacuum. And there's there's a lot of support and impetus that goes into this when when I see my my, my my former colleague Ron Arias in the audience and my friend, my former professor and student Armando Vazquez Ramos, they're still involved or still engaged'",
        "'speaker_4': 'because we need to continue that into the future. But more importantly, I think that this preview is very timely. We know that in 2020 comes the census, the 2020 census, and we know that we're going to get a lot more information from a result of that, that census data and in terms of employment participation and community participation'",
        "'speaker_4': 'in the economy as a whole. But also one thing that wasn't here and perhaps it's another story for another time is voting rights. Obviously, if there's any one thing that's important to us as city council members is a voting patterns and and voting participation and education among the Latino community.'",
        "'speaker_4': 'We all you always hear the same refrain, yep, Latinos, maybe 40% population, but they only vote at like 5% or 10% of the total electorate. So that's another aspect of maybe what what I said Richard could focus in on in terms of not only the economic impact of Latinos in the region or an anomaly specifically, but also'",
        "'speaker_4': 'the affects of the voting patterns as well. But I want to congratulate you. Thank you so much for putting this together, bringing it forward. Perhaps two years from now, we could get another one once the 2020 census data is out and we could evaluate it and study it and see where we at at that point.'",
        "'speaker_4': 'So I want to thank you for for being here.'",
        "'speaker_1': 'Thank you very much, Councilmember and Councilwoman Gonzales.'",
        "'speaker_7': 'Yes. Thanks again for delivering this amazing report. I had the opportunity to see this live with over 100 or so, probably over 200 people that attended. And it was really great to see all of the in-depth data and be a part of that.'",
        "'speaker_7': 'And I know that thanks to all of you, Megan, Seiji and Dr. Benitez and Central Cha and Cal State, Long Beach. The collective work. I know this will be a living document and evolving document. We're already getting an update, which is exciting and I'm just very glad to see this.'",
        "'speaker_7': 'This is not only unprecedented in our city, but it's unprecedented in the region. You go to L.A. and they're like mind blown that we actually have an economic impact report dedicated to one demographic that is growing at a rapid rate here in our city.'",
        "'speaker_7': 'And I've said the same thing relative to Councilmember Turanga is that it'd be really nice. I mean, the Cambodian community is now asking for their own economic impact report, the LGBTQ community. So it's just we have so much potential there.'",
        "'speaker_7': 'And especially given the fact that Swedish Japanese friend of ours is delivering the Latino Economic Impact Report is amazing. Thank you, Seiji. What you're doing is is incredible, and I look forward to working with you in any capacity possible.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Vice Mayor.'",
        "'speaker_0': 'Fine, thank you very much. You know, I apply that.'",
        "'speaker_9': 'You know, I think after the mayor was speaking of, you know, the African-American Vietnamese, we have such a diverse city in which we live in. I think an impact like this should be done all over our city. So we'll all know where we are.'",
        "'speaker_9': 'But I think on first of all, I'd like to thank Councilman Murang'a for taking the lead on bringing this to the council. And I would also like to thank Central Cha and Cal State Long Beach for that diligently and effort in compiling these reports.'",
        "'speaker_9': 'This report validates what we have all known for a long time. Latinos are an important, are important, vital and growing segment in the city of Long Beach and in the sixth District. We as a city must take this fact into account and plan for the future.'",
        "'speaker_9': 'We must ensure that we develop the process of a 2030 strategic plan, and we use this strategy that will include Latino communities. We must dedicate more funds, more funds into the language, access and digital inclusion. Lastly, Senator, share your leadership on this effort has been extraordinary and it's always is is solving issues in our community.'",
        "'speaker_9': 'And I want to thank all of you again. Thank you.'",
        "'speaker_1': 'Thank you, Vice Mayor Councilmember Richard.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I wanted to just share some share some thoughts. Councilmember Ranga, thank you so much for allowing this opportunity to see this presentation here at council. I saw it the first time I saw it was with Councilwoman Gonzalez at the roundtable.'",
        "'speaker_5': 'And I was impressed then and I'm impressed now at the detail in the organization on how the data was presented. It really paints a clear picture and I love to see the team how organized the team is at presenting this one.'",
        "'speaker_5': 'Seiji Jessica from Central Cha. Megan You know I can't wait to hire Megan one day. So my my larger takeaway here is that, you know, over the last few years, there's been this constant threat of equity. And it's been coming up at council, it's been coming up in the community.'",
        "'speaker_5': 'This common denominator, it's common language. You know, you see, here's a Latino economic equity profile discussing racial equity. There was just the policy link equity profile. There's a conversation about Parks Equity and Office of Equity. And what we're hearing is that it's time for the city to really acknowledge that equity is important to our values and it'",
        "'speaker_5': 'needs to be woven into our service philosophy as the city. Baked in knots, sprinkled on top right braid at the root. What we do in every department. Because, you know, I think the mayor said said it best is that when the Latino population thrives, Long Beach thrives.'",
        "'speaker_5': 'And the same goes for people of color. And everyone in our city, as you know, as people thrive, our entire city thrives. And that's important. I also like the fact that the way you framed it, you you you tied in opportunity.'",
        "'speaker_5': 'And I would even say open with the opportunity. Have people understand that asset, the asset, the the aspirational framing that Long Beach is doing great. But imagine how much greater we would be doing if we had racial equity in our city, if we had if we closed our racial wealth gap in our city, if people had access'",
        "'speaker_5': 'to owning homes and starting businesses and we're making money, imagine how much greater Long Beach would be. And everyone can sort of connect at that point. And then we say, but here's the barrier, here's why we're not doing as great as we could.'",
        "'speaker_5': 'It's because certain communities need attention and they need you know, we need to make sure that we're being intentional at closing those gaps. And so those are my my thoughts that I think it's I think this is very timely.'",
        "'speaker_5': 'I thank you for for this presentation. You clearly have my support, as you know, as we continue this conversation on economic inclusion in the city, I'm going to continue to engage you to make sure that we again, we make this in and then we braid this throughout things that we do.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember. Councilman.'",
        "'speaker_2': 'I really appreciate the work. This was a phenomenally done report. I would only I want to echo councilman or vice mayor Andrew's comments, but I also would love to see the data. There's some L.A..'",
        "'speaker_3': 'County reports that also talk about mentorship versus home.'",
        "'speaker_2': 'Ownership and that ability to then be able to afford health care and the others and then what local opportunities we could have, where we.'",
        "'speaker_3': 'Encourage those who are selling off their wealth to sell it to those who live within those apartments already and to condo.'",
        "'speaker_2': 'Wise, even smaller, smaller units, whether they're even triplexes or quad plexus, so that there's the ability to have that ownership. Because the L.A. County report that I remember talked a lot about the difference of two communities that were significantly similar in every aspect.'",
        "'speaker_3': 'Except for.'",
        "'speaker_2': 'The ability to own your future through housing. And so just great report and I can't wait to see more. Thank you so much. And congratulations to everyone, especially all of you that pitched in to make this happen. So great work.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilwoman Price.'",
        "'speaker_7': 'Thank you. I echo the comments of my colleagues. Fantastic presentation. I definitely learned a lot and you guys did a wonderful job, especially to our student presenter. Fantastic job with your presentation, so thank you. I know that we live in such a diverse city and having come from an immigrant background myself, it's always interesting for me to'",
        "'speaker_7': 'hear the different economic data that we have and educational data that we have of the different communities. I know I actually save the presentation. I'm going to give it to my son's teacher tomorrow. He goes to Long Beach Unified and they're studying this issue right now in a human geography class and talking not just about cultural demographics'",
        "'speaker_7': 'and information, but also the impact of working families in terms of the development, the development of, you know, successful, I guess, contributors in society. So finding that in places where you have, you know, family members, everyone is working outside the home because they have to to, you know, live live within the expenses and the costs of living'",
        "'speaker_7': 'within that community. What kind of impact does that have on unemployment in the future, education, those kinds of things? So it's very interesting. We live in such a diverse city. It's very interesting to learn as much as we can.'",
        "'speaker_7': 'I welcome these kinds of studies and reports as to every every population in every different, diverse segment of our of our society. I think it helps us really understand the journey that everyone has to take, regardless of their race or financial background, but the diverse journeys that everyone has to take.'",
        "'speaker_7': 'So I appreciate it. And I thank you, Center Cha, for bringing this forward. And thank you for these awesome mugs. I appreciate it. I appreciate you guys continuing to educate us and partnering with us. Thank you.'",
        "'speaker_1': 'Thank you very much, Councilwoman and Councilmember Pierce.'",
        "'speaker_3': 'Thank you. Great job. Great collaboration. I applaud you. I think it's really important to remember when I was at Cal State where I met Professor Juan Benitez, I did one of my last papers there was on immigration and the contributions that it made that they make into society.'",
        "'speaker_3': 'And it's so fascinating to see where the different thoughts come from. And so I really appreciate having an academic look at the economic impact because it is so important. Jose Lin D.A., who I mentioned earlier today. He worked three jobs.'",
        "'speaker_3': 'He worked at the Westin. He worked at the Hilton, and he worked the convention center. And so now having, you know, he was Latino. He had three kids. And so what is the economic impact for somebody that finds themselves in this poverty area, finds himself working more but making less?'",
        "'speaker_3': 'What's that impact on families and how does that impact their health? How does that impact study practice like it is so intertwined? And so to be able to have you guys really make some policy recommendations to us. I mean, one thing that's clear being on council is we might have ideas, but we really need to rely on'",
        "'speaker_3': 'experts to come forward and say, here's some models that we should try. And so I, I also want to give a shout out to our economic development team. Recently, we had a small business that was going to be put on the market, and their employees, all Latino, had worked there for many of them for 30 years.'",
        "'speaker_3': 'And so he was talking about selling. And if he sold to a Starbucks or Jack in the Box, those employees would probably lose their jobs. But with the work of community members and council working with economic development, hopefully now that ownership is going to go to those employees with this great grant program that our team has worked'",
        "'speaker_3': 'on. And so how can we use opportunities like that to think outside the box versus just how do we just build this one level of wealth? You know, and so how do we think creatively about that? And then in downtown?'",
        "'speaker_3': 'One of the things that I think we're going to start working on is how do we fill our office spaces? Like what type of job should we have in downtown that will contribute to a thriving downtown? What opportunities are there for Latinos, for African-Americans, for our community and communities to own businesses and operate in our downtown as'",
        "'speaker_3': 'well? So I would say one other area that I don't think we talk about a lot, but prep I got to I'm a renter and I got a prep notice at my house and my landlord said, don't tell the city you're going to be here.'",
        "'speaker_3': 'You don't have to do that. Because he was scared about what they might find. If your landlord tells somebody that is undocumented or poor and struggling to make every single dollar count, they're likely not going to let somebody in to help make their lives better.'",
        "'speaker_3': 'And so I think we as a city have to continue to think about that. And so those are just some some thoughts off the top of my head, but I really appreciate the work and I look forward to hearing more from you guys and seeing how we can collaborate.'",
        "'speaker_3': 'Thank you so very much.'",
        "'speaker_1': 'Thank you so much, Councilmember and councilman.'",
        "'speaker_10': 'Thank you. And I'd just like to lend my words of support to this. This is a very, very powerful economic report. I want to salute and commend the the information. I want to salute and commend the partnership, but most importantly, to the work and the work that will be done.'",
        "'speaker_10': 'This this report really kind of warms my heart, makes me very proud of our city because I think very few cities actually can can put together this type of partnership with the city. A world class university driven by a passionate community based organization like Central China, with with with collaboration and and of so many people involved in'",
        "'speaker_10': 'this, I had opportunity to actually go in and personally attend the Latino Economic Summit a few months ago, sat at the table with some some very thoughtful leaders. I learned so much just in the couple of hours that I was able to see there to to to be there for that.'",
        "'speaker_10': 'And there was so much more powerful information shared during that period of time that obviously you couldn't go into all of it here today. But if there is an opportunity, I would love to get that entire report to and possibly to the entire city council, because that data is very powerful.'",
        "'speaker_10': 'And as an elected official, I want to know as much as I possibly can about all of my constituency groups to be able to make good, sound decisions. And I think the report that you guys have put together, the presentation here this evening, will help us move in that direction.'",
        "'speaker_10': 'Moving forward, I think one of the big takeaways that I got a few months ago after attending the the economic summit was that, you know, we really have to turn to really. Focus on creating good jobs in this city.'",
        "'speaker_10': 'And I think one of the indicators there was not so good in terms of the economic forecasts. One of the presenters gave in terms of the type of jobs that are going to be available in the future. I think we really need to look to to stem that tide and figure out how we can make sure that'",
        "'speaker_10': 'people are going to be compensated so that they can have the good health care and access to good health care, the access to education and good housing. And that is what's going to be the great equalizer or the equity that will come from that.'",
        "'speaker_10': 'And so, again, I wanted to just commend you all. Thank you for this report. And also thank my colleague, Councilmember Yarrawonga for bringing it forward is very conscious. Thank you very much.'",
        "'speaker_1': 'Thank you very much. And I want to thank all of you again for a great presentation. I'm going to do we're going to do public comment just as a as a note. We do have another large item right after this.'",
        "'speaker_1': 'So if we could just limit public comment as much as possible. If there's public comment, please come forward on this item. Okay. I guess that's going to be good. Okay.'",
        "'speaker_5': 'We like that.'",
        "'speaker_4': 'Good evening, Mayor. City Council. Ron Audio's eighth district. I simply just want to thank each and every one of you for your comments and your thoughtfulness in receiving this report. I can say that I've been coming down here for.'",
        "'speaker_8': 'Close to 40.'",
        "'speaker_5': 'Years, 24 as.'",
        "'speaker_4': 'A city staff member, and a lot more before that as a as a community activist and now as a as a a veteran of many of those things. But this council, without question, in my mind, is one of the most representative city councils that we have ever had.'",
        "'speaker_4': 'You actually look like the Long Beach that I know. And we just want to congratulate you guys to make us feel the way that you've done tonight. That was it. That didn't happen.'",
        "'speaker_8': '25, 30 years ago. You know, we were on the.'",
        "'speaker_4': 'Outside trying to peek.'",
        "'speaker_8': 'In.'",
        "'speaker_4': 'And now with each and every one of you and.'",
        "'speaker_8': 'Who you represent, I just want to congratulate you guys. You guys are doing good work.'",
        "'speaker_4': 'Keep it up. I think Long Beach is in very good hands. Thank you.'",
        "'speaker_1': 'Thank you, Ron. Next speaker, please. And I'm going to close the speakers list after these four speakers. Okay. So thank you.'",
        "'speaker_3': 'Good evening. My name is Lily and I'm the director of Health, Education and outreach for the Children's Clinic. And Dr. Nicholas, our CEO, sends her regards. She couldn't be here tonight, but we really wanted to thank Cal State, Long Beach, Go Beach.'",
        "'speaker_3': 'They teach students really well. Thank you very much. I think I graduated with a mayor's class. And we also want to thank Central Cha. Thank you very much for bringing this very important report.'",
        "'speaker_2': 'You're very right.'",
        "'speaker_3': 'We are geeking out over the data the children's clinic has. It's one of the largest nonprofit clinics here in Long Beach. We have 13 clinics across the Greater Long Beach area, and we serve well over 40,000 individuals ranging from ages zero two all the way to the grandparents.'",
        "'speaker_3': 'And this report is going to greatly influence our strategic plan moving forward. We don't just do 1 to 1 patient care. We're very focused on social determinants of health and from a public health point of view, socioeconomic resources and having success and access to all of these things that were presented in the report makes a huge impact'",
        "'speaker_3': 'on health. And it's really.'",
        "'speaker_2': 'Important for us to focus on these.'",
        "'speaker_3': 'Health and these economic and health inequities to.'",
        "'speaker_2': 'Make sure.'",
        "'speaker_3': 'That we have positive health outcomes in the community. And we're going to try to partner with all of.'",
        "'speaker_2': 'The stakeholders in the room and hopefully with the city and all of the council people to make sure.'",
        "'speaker_3': 'That TCC is able to.'",
        "'speaker_2': 'Deliver more.'",
        "'speaker_3': 'Services and health care and insurance to our community members. Thank you so.'",
        "'speaker_1': 'Much. Thank you so much. Next speaker, please. Our last speaker on this item.'",
        "'speaker_5': 'Uh, hello. Good afternoon. Uh, Mayor Garcia and the City Council. My name is Abraham Ordaz. Um, I was raised here in Long Beach. Um, I lived in the Eastside for the majority of my life growing up. I was, um, unfortunately gotten into a lot of trouble in and out of school.'",
        "'speaker_5': 'Um, never really attended school. Unfortunately, I didn't graduated when I was supposed to. Thankfully, um, after finding a few resources, I was able to complete my high school diploma. Um, I finished here Long Beach Conservation Corp in December 1328, 2018.'",
        "'speaker_5': 'Um, I found Santa Rosa due to a court mandate. I had to do a few community service hours for an altercation I got myself into with the law. Um, thankfully, my probation has been terminated on April 11th, 2019 on.'",
        "'speaker_5': 'Central Georgia has benefited me greatly by giving me access to job training, job certification, and now a part time job as a project coordinator here along Port Vila. I am grateful for the opportunity to learn, make, graphic design, screen printing, e-commerce and marketing with sales and retail.'",
        "'speaker_5': 'If it wasn't for Central China, I would probably not been in the position where I am. I probably would have been out in the streets doing what I was doing before. We have provided these lovely coffee mugs that we had made ourselves by our team members here.'",
        "'speaker_5': 'Lambie's. Uh, central to.'",
        "'speaker_8': 'Uh.'",
        "'speaker_5': 'Uh, please check us out is for the dot com. Um. All Oh all of the proceeds that we get back from the sale from making all of these. Um. Uh, cells will go back into the communities to help people out.'",
        "'speaker_5': 'I want to thank my mom, Jessica Anthony, in the central team for all these opportunities. Um, thank you very much.'",
        "'speaker_1': 'Thank you. Good job. Excellent. Where until. I want you to tell. Where can we. I'm going to. I'm going to go buy that hat you're wearing right now. So where can we get working? We buy that hat and other things that you're selling.'",
        "'speaker_0': 'Um, well.'",
        "'speaker_5': 'We have a.'",
        "'speaker_1': 'Budget to tell it, tell everybody.'",
        "'speaker_5': 'We have a location.'",
        "'speaker_1': 'And the mix of people back. People on the TV area.'",
        "'speaker_5': 'Um, we have a location here on Long Beach.'",
        "'speaker_4': 'Boulevard and PCH. Um.'",
        "'speaker_5': 'But if you, if a lot of people can make it out there, we also have a website. Um, it is a long beach port vila dot com. And right there you'll be able to find all their products.'",
        "'speaker_1': 'And what I mean a well-designed logo and look. And it looks good. Mm.'",
        "'speaker_5': 'Thank you very much. Thank you.'",
        "'speaker_1': 'Thank you. I'm definitely buying that hat. That's my new hat. Okay, so we have a motion in a second. Members, please cast your votes.'",
        "'speaker_0': 'Mm.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Project Labor Agreement Cumulative Report through February 2019. ": [
        "'speaker_1': 'Great. Thank you very much. We're going to go ahead and move on to the next item, which is item number 21. No, I'm sorry. Item for the play, item 14.'",
        "'speaker_2': 'Report from financial management recommendation or even file the project labor agreement cumulative report through February 2019, citywide.'",
        "'speaker_1': 'We're ready. Staff report.'",
        "'speaker_11': 'Great. Thank you, Mr. Mayor. So in 2015, in April 2015, the Council directed us to create something new for us, which was the project labor agreement, and that went into effect in May of 2015. As part of that motion, the Council asked us to come back in about three years for a discussion to really review how the'",
        "'speaker_11': 'play has been going to really look at some of the data, to talk about some of the the aspects of the play. And that's what we're here to do tonight as well as get any any input from the city council going forward.'",
        "'speaker_11': 'So we're going to have a staff presentation from our financial management department, which has been the department that has really been administering the play up to this point. And then you also hear from our economic development department who are going to be taking over some of this work.'",
        "'speaker_11': 'So we've found in the past three years that we can actually improve. We can do a little bit better. We can add some additional job coordination services, some additional better linkages to our workforce development. And we're excited to share that with you tonight.'",
        "'speaker_11': 'So we will be presenting this. And with that, I'll turn it to John GROSS.'",
        "'speaker_5': 'Thank you, Tom. Good evening. Mayor and city council members. As Tom says, this is a starts with a review, cumulative review of our project labor agreement. It is a partnership between the city and the Building and Trades Council of Los Angeles and Orange County.'",
        "'speaker_5': 'It is a five year agreement and as Tom said, started in May 2015. It applies to covered construction projects over $500,000, and it has the benefits of providing labor peace. Its effort is on training by unions and preference to local residents.'",
        "'speaker_5': 'It does require contractors to hire new employees through the union.'",
        "'speaker_0': 'Halls.'",
        "'speaker_5': 'And provides local and disadvantaged veteran hiring preferences and goals. From the viewpoint of the contractors that we contract with for construction, the key play provisions are that the contractor must use labor from union groups within the Trade Council.'",
        "'speaker_5': 'There are core employee requirements that require the contractor to utilize and allows them to utilize up to five existing nonunion employees. But they must be employed on a 1 to 1 ratio with union hall referrals and all employees, if they're not part of the union, must pay temporary dues to the union.'",
        "'speaker_5': 'From the union. There are certain requirements that the PLA puts on. The Union are the best efforts. They have to use best efforts to refer, recruit and or utilize local residents. This is a key requirement. They also must integrate referral mechanisms with Pacific Gateway and Long Beach City College to accept disadvantage and better veteran workers into apprenticeship'",
        "'speaker_5': 'programs. And they must refer local, disadvantaged and veteran workers, regardless of their places in the union hiring list and their normal referral practices. We have 25 projects that are completed, active or in bidding. There is a cumulative $146 million in construction value and we have 13 more projects anticipated.'",
        "'speaker_5': 'The administrative costs are about 8/10 of 1%. That is below the initial 1% estimate. So we're pretty pleased about the overall administrative costs. But this is about what are the goals? There were goals set in the play agreement.'",
        "'speaker_5': 'The first goal was there should be 40% local hiring. We are at 77% cumulatively. The local hire goal was only 40. We are at 77% for Los Angeles and Orange County, which is all three of the measured tiers.'",
        "'speaker_5': 'There was no specific goal for the first year Long Beach residents, but even with that, Long Beach residents must be referred first by the unions. And we are achieving a 19% goal with regard to that 19%. And that's based on hours worked, which is a pretty good requirement.'",
        "'speaker_5': 'Hours worked in the overall project with regard to veterans and disadvantaged. We had a goal or we have a goal in the hiring in the play of 10%. We are at 12%. That attainment varies by project, as does the local, because each project is unique and it depends on the availability of apprentices and requirements for the specialized'",
        "'speaker_5': 'trades. In terms of other aspects, we clearly are meeting our overall goals as set by City Council in the play. We have had one area where we're evaluating where we are with this and that's projects with a construction value of 500000 to 900000.'",
        "'speaker_5': 'We're seeing fewer bids submittals than we would like to see and some contractors have a of the play requirements as their reasons for not submitting a bid. We don't have any recommendations in this area. We're just letting you know that we're monitoring that issue.'",
        "'speaker_5': 'With regard to play management. As Tom Modica said, during this year we're transferring play management, which is here too for business and financial management to economic development. We think this is an extremely good thing where we can better integrate compliance monitoring into the overall Pacific Gateway activities, and we think that'll help develop and support the local workforce'",
        "'speaker_5': 'and also have some economies of scale. And now I'd like to turn it over to John Keisler, the director of economic development.'",
        "'speaker_12': 'Thank you, John. Honorable mayor and members of the City Council. As part of our economic development blueprint, we have seven different focus areas that we are recommending that will help to move the economy forward and create economic opportunities for people.'",
        "'speaker_12': 'One of those areas is workforce development and job creation. And so as part of our review of the play, our goal is to find ways to continue to help connect Long Beach residents and workers with training and ultimately place them in jobs.'",
        "'speaker_12': 'So this is a wonderful program and a wonderful opportunity for us to do that. So in working with public works and in financial management, the Economic Development Department wants to begin shifting the play administration from financial management to the Economic Development Department to focus more on our jobs and workforce development goals and the blueprint.'",
        "'speaker_12': 'This will mean that ultimately we'll hire a full time city play administrator to strengthen the partnership that currently exists between the Building Trades Council, Long Beach City College and of course Pacific Gateway, which is our Workforce Investment Board and Workforce Development Agency.'",
        "'speaker_12': 'This will also, by having this full time play administrator in House rather than using a contractor from the outside, will help us to proactively boost working with our partners to coordinate what we call in the agreement Tier one veteran and disadvantage worker recruitment.'",
        "'speaker_12': 'Hopefully, having that in-house play administrator will help create ongoing connections with the organizations, the community based organizations that exist in the neighborhoods and can help create those pipelines for worker recruitment. And ultimately, the way that we intend to or found the resources to pay for this was within existing resources.'",
        "'speaker_12': 'So as we worked with financial management to review the scope of work of our current contractor persons, we were able to identify some of the administrative tasks that we actually can perform in our Pacific Gateway organization because we already have administrative capacity to help monitor and report on our federal grants.'",
        "'speaker_12': 'So we're going to be able to repurpose existing resources to really fund this position. So to talk a little bit about what this full time Pacific Gateway play administrator will do, I want to turn it over to Nick Schulz, our executive director.'",
        "'speaker_12': 'Nick runs Pacific Gateway and will ultimately be responsible for implementing this new program.'",
        "'speaker_9': 'Thank you, John. Honorable mayors that are members of city council. I just want to walk you through some of the enhancements we hope to achieve for the project labor agreement by price, by placing the administration with Pacific Gateway.'",
        "'speaker_9': 'And first and foremost, we hope to implement strategies to boost results against the established pilot program goals and recruitment goals, specifically around the training and placement of Long Beach Tier one veteran and disadvantage workers. We want to document and communicate the performance of the play program.'",
        "'speaker_9': 'We believe there are several untold stories here in today's report that you are would would benefit from hearing and understanding regarding the project labor agreement. We would assume coordination of pre-bid and pre-construction meetings with the contractors and enhance efforts at promoting compliance.'",
        "'speaker_9': 'We would provide ongoing play program documentation and compliance. We would conduct outreach and develop relationships with community based organizations to market and promote construction job opportunities to the available workforce. We would continue to communicate with our bar, with our partners, the Building Trades Councils, and recruit more Tier one veteran and disadvantaged workers.'",
        "'speaker_9': 'We develop more multi craft core curriculum offerings in order to qualify pre apprenticeships and expand partnerships around that pre apprenticeship training. We look to identify and secure increased funding to support local workforce training programs, specifically those focused on construction careers and construction pathways.'",
        "'speaker_9': 'We would continue to connect workers with ongoing wraparound services at Pacific Gateway to promote ongoing success and successful job retention efforts. And we would be able to transition workers to job opportunities in other sectors during slowdowns, in constructions or the absence of available play projects.'",
        "'speaker_9': 'In addition to the roles that the full time administrative coordinator would carry out and help us to achieve the objectives I just mentioned, we've also been taking a look at what we might be able to do to supplement the services in times when we felt that was necessary.'",
        "'speaker_9': 'So some of the programmatic approaches we've looked at is. Issuing a request for proposals to actually look at qualified organizations to provide additional job coordination services and develop that pool for our use as needed. We would would then engage with supplemental local job coordination for larger projects, and we intend to do that within the current 1% of'",
        "'speaker_9': 'the projected budget that was established for project cost at the onset of the play.'",
        "'speaker_11': 'Thank you very much, Nick, for that. So in summary, I just do want to say that this has been a great partnership. We've got a real great relationship with the building trades and I think both parties are pretty happy with the agreement as it stands.'",
        "'speaker_11': 'And but we do believe, as you as we talked about, that there's more that we can do. So we've met the goals in the in the play. I do want to remind us that it's a five year agreement and it's coming up in just a little bit over than a year.'",
        "'speaker_11': 'And while we've already met our goals, we do believe some of the things we've outlined here can allow us to even go further with additional job outreach. And so we're excited about the full time play administrator that's contracting in taking somebody who's mostly doing paperwork for us now and getting us a live city body for the same'",
        "'speaker_11': 'amount of cost that can do additional services. We'll have that additional focus through the Supplemental Services Program on those bigger projects and really look at some additional job coordination services that we can do for additional local job outreach.'",
        "'speaker_11': 'So with that, we turn it over to the Council for questions.'",
        "'speaker_1': 'Thank you. Let me before I turn this over to the maker of the motion. Just want to add just to add to this, the staff report said just initially, I just want to make sure. I also think the the citywide project labor agreement was something that we instituted just a few years ago, I think, as most of'",
        "'speaker_1': 'us in this body were coming into office. And I just want to thank Ron to you and your team and all of the locals who have been involved in this agreement. We are we really set also a a statewide standard of really good, solid citywide project labor agreements.'",
        "'speaker_1': 'And I'm just very proud of the work that you all did at the trades. Do you want to thank city staff for the work you guys did in in getting to this point that we have a a a good document in front of us and of course, all the hard working guys and women that are here, but'",
        "'speaker_1': 'especially, Jane, because you're the hardest working woman. Just to thank all of you for being. Absolutely she is. You want to think all the trades? We we're not we're not only are completing all of these projects in a timely manner and in a way that's costing the taxpayers the least amount by producing the best work.'",
        "'speaker_1': 'But we're also providing through this project labor agreement, not only quality projects. We are providing jobs with benefits, jobs that folks can have dignity of of a good paycheck and a pension so that they can go back to their families and have that dignity at the workplace.'",
        "'speaker_1': 'And so I just want to thank thank you again and I'm really proud of this is to my in my opinion, this project labor agreement, of which this council worked very hard on, is one one of the best things that we've done as a body.'",
        "'speaker_1': 'And and so I just want to thank you guys for that amazing work. And with that, though, before I get to Vice Mayor Andrews, I think you've asked I want to hear public comment first, please. So let's raise any objection.'",
        "'speaker_1': 'We're going to do public comment. Public comment.'",
        "'speaker_0': 'Do you think?'",
        "'speaker_6': 'Good evening, Mayor. Council members staff. Neighbors. My name is Jane Templin. Thank you, sir. I am a proud member of the International Brotherhood of Electrical Workers. I'm a journeyman Ironman. I'm a happy District two resident. I am the outreach director of the Net zero Plus Electrical Training Institute.'",
        "'speaker_6': 'That is home to over 1800 apprentices. And we are growing. We are bringing in more. All of these apprentices. All of these men and women make good livings. All of these apprentices have a good career and their future is this career path that allowed me to buy my home as a fourth year apprentice here in Long Beach'",
        "'speaker_6': 'and 79. And happy to have done so. So I would like at this time to ask Local 11 to stand up all our supporters. And those that are Long Beach residents where you raise your hands and wave. These are our neighbors.'",
        "'speaker_6': 'Thank you, guys. As a Long Beach resident, I'm happy to support the work of the Long Beach Local Hire Coalition. It's important to provide opportunities to our local Long Beach residents, disadvantaged workers and veterans, and we do a lot of outreach in that area every day.'",
        "'speaker_6': 'As the outreach director, I speak to my neighbors, our community members, and work with you personally in your groups trying to get that opportunity of hopefully, if this is you're interested, this is a career. I want to thank you for your support, and I want you to know your work tonight is changing lives for the better.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_8': 'Good evening, Mr. Mayor. Council and Staff. I'm Ron Miller, executive secretary of the L.A. Orange County Building Trades. And I stood before you a couple of years ago and told you we were going to create this partnership and do good things.'",
        "'speaker_8': 'And I think you heard some of the good things we're doing. Can we do better? Absolutely. Those are goals in that agreement and this partnership. And we don't stop when we hit the number, we keep going. And so we can always do better.'",
        "'speaker_8': 'And through the partnerships that we formed.'",
        "'speaker_4': 'Here in Long Beach with the city.'",
        "'speaker_8': 'Long Beach City College and other institutions, we formed a nonprofit apprenticeship readiness fund. And that's to go after training dollars and be able to fund apprenticeship readiness classes with.'",
        "'speaker_5': 'Our building trades.'",
        "'speaker_8': 'M.S. three Curriculum with Beach City College. And we were able to put on a placement coordinator. You're going to meet him? He's going to.'",
        "'speaker_4': 'Speak. A couple.'",
        "'speaker_8': 'Couple people behind me. But his job is to work with the apprenticeship readiness classes.'",
        "'speaker_5': 'But as a go between between the classes and the local unions.'",
        "'speaker_8': 'And put these young individuals from the community into the apprenticeship programs, it's been very successful. He has some good numbers he'd like to.'",
        "'speaker_5': 'Share with.'",
        "'speaker_8': 'You. And I'll be here if there's any questions. Otherwise, we're going to have a women's conference. We're going to also have it at Long Beach City College. It's going to be May 31st and June 1st. So mark that on your calendars, you're all invited to stop by.'",
        "'speaker_8': 'We had it last year. We had over 200 women there. We expect to double that this year. And it's designed for women that are already in the trades to give them the support mechanisms they need to survive and also introduce the trades to more young women that think they may want to a good middle class career in'",
        "'speaker_8': 'in the building trades. So thank you very much.'",
        "'speaker_1': 'Thank you, Mr. Miller. Which campuses is it?'",
        "'speaker_8': 'You know, we're not sure yet.'",
        "'speaker_1': 'I think the PCC campus.'",
        "'speaker_0': 'Yeah. Okay. Yeah. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Miller. Next speaker, please.'",
        "'speaker_8': 'Good evening, Mayor and council members. My name is Francisco Aragon.'",
        "'speaker_5': 'I'm a very proud journeyman in said Wyman with.'",
        "'speaker_8': 'IBEW Local 11.'",
        "'speaker_5': 'I worked union and nonunion jobs all over L.A. County, and some of these were in Long Beach. And like so many working families.'",
        "'speaker_8': 'My family must juggle a daycare. So this is my little guys, little Frankie right here. And thanks to my union, he has great benefits. Four years ago. Yeah.'",
        "'speaker_0': 'All right.'",
        "'speaker_5': 'So four years ago, you authorized your staff to execute a citywide project labor agreement with the Orange County Building Trades Council. There are some.'",
        "'speaker_8': 'Facts in the staff report before you today. The plea has been applied. The plea has been applied to 25 projects and it has exceeded the local hire goal and the disadvantaged less veteran goal. In short, your workforce development efforts, your partnership with the building trades.'",
        "'speaker_5': 'Our desire to put people into family sustaining careers.'",
        "'speaker_8': 'It's all working on behalf of IBEW Local 11. I'm here to thank you. I'm also here to express support for the work done by the Long Beach Local Hire Coalition. Specifically, we support a pilot program to initiate a jobs coordinator.'",
        "'speaker_5': 'On some projects. Thank you for your time. Goodnight.'",
        "'speaker_1': 'Thanks, Speaker, please.'",
        "'speaker_8': 'Good evening, Mr. Mayor. City Council. My name is Ben Garcia and I am the jobs coordinator with the Apprenticeship Readiness Fund of the LA and Orange County Building Trades Council. I just came on in.'",
        "'speaker_4': 'February and I'm excited about the work, looking to put more Long.'",
        "'speaker_8': 'Beach citizens and high paying jobs within the union building trades. I just wanted to tonight share with you a couple of numbers over the last couple of years, two of our programs in Long Beach, Long Beach City College, as well as women in nontraditional roles, which is the winter program, have graduated 310 individuals from their pre apprenticeship'",
        "'speaker_8': 'programs and 80 of those have been placed. And what that equates to in total estimated hours worked.'",
        "'speaker_4': 'Based on an approximate 1700 hours per.'",
        "'speaker_8': 'Year is about 136000 hours per year worked by citizens.'",
        "'speaker_4': 'Of Long Beach. Also combined, that's 544000.'",
        "'speaker_8': 'Hours, over four years of apprenticeship. So I just wanted to share that information with you.'",
        "'speaker_4': 'And thank you for your time.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'How are you doing? My name is Marlon Anderson, and I'm a Long Beach resident of living in Long Beach all my life. When the O'Brien Elementary School, Rogers Middle School and the great Long Beach Poly High School. Unknown to me.'",
        "'speaker_4': 'I wasn't trying to speak to come up here saying anything, but I had no idea that the people on this council was directly responsible for the success of my life. A few years ago, I got in trouble with the law and I did some time in prison.'",
        "'speaker_4': 'And when I got out of prison, I was able to get into IBEW Local 11, literally six months after. So not only did it help me change my life, but I.'",
        "'speaker_5': 'Was able to discharge parole early.'",
        "'speaker_4': 'I was also a United States Navy veteran. Being a Long Beach resident, I was able to work on the Long Beach Aquarium, which is very beautiful inside. I hope everyone visits it. And I was also able to do the pump stations for the Rainbow Harbor, which was really simply about Long Beach Council.'",
        "'speaker_4': 'So I was willing to say whatever. What did you guys do for me in my family was a great thing and I really appreciate it.'",
        "'speaker_1': 'Thank you so much. Thanks, Speaker.'",
        "'speaker_4': 'Good evening. My name is Matthew Coats and I'm also a lifelong resident of Long Beach. I've been here my whole life, and I just want to say thank you for the support of this program and the place, because I, too, went through that preparedness program at Long Beach City College, and now it's been about two years.'",
        "'speaker_4': 'It's local 11 and my life is completely turned around. So thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker and our last speaker will be the gentleman at the end. So I can't see who it is. I see. I see Mr. Simpson's Totnes. Okay. There you go. All right. And then. Then we're close to speakers list.'",
        "'speaker_8': 'Son. I can't. District six. It's good to see all the union people out, and I appreciate the city, you know, brokering this deal. The plea deal in the agreement and seen the results of the last couple of years.'",
        "'speaker_8': 'That being said. I feel like we could do more. Personally speaking, as someone who's gone through a couple apprenticeship apprenticeships at Lambie, see Lambie City. You know, I've had professors tell me and teachers tell me there that I had a better chance getting a job, working on a yard in Long Beach if I went to L.A. Tech'",
        "'speaker_8': 'or I went to L.A. versus going to Long Beach City. You know, I can I'm just speaking as someone in my community. I was born and raised in this city, and I don't I don't see enough locals being hired.'",
        "'speaker_8': 'I think that's a big issue. I worked the last job recently. I worked on a yard. It was about a year ago, and I was one of four people that was from Long Beach. You know, I think a lot of Orange County crews are getting preferential treatment and they're acquiring a lot of these jobs.'",
        "'speaker_8': 'And just like my man, the swish Japanese gentleman who was speaking earlier about the economic analysis, you know, that's less we should have an economic analysis about all these Long Beach jobs and the money that's being acquired and used and coming out of them and how these a lot of these people is taking their money and they're'",
        "'speaker_8': 'going to L.A. or they're going to Orange County or what. So in regards to brokering the next deal, you know, I think that should be 19% is is abysmal. And I think that it should be non voluntary, that it should be over 50% because there's a lot of people out here that speak on the phone.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_3': 'Good evening, honorable mayor and council members. My name is Elsa tongue representing Long Beach Forward and speaking tonight on behalf of the Long Beach Local Hire Coalition, a group of organizations that came together in 2014 and have stayed together since to provide recommendations on local and disadvantaged hiring in the citywide play.'",
        "'speaker_3': 'Our coalition members include and you'll hear from next Long Beach Community Action Partnership. Long Beach Residents Empowered United Cambodian Community Pvt. Jobs Legal Aid Foundation and East Yard Communities for Environmental Justice.'",
        "'speaker_2': 'We thank the mayor.'",
        "'speaker_3': 'The city council and the city staff for your leadership in bringing forward the citywide plea for full discussion of the terms and conditions per the 2015 Council motion. Our Coalition supports the citywide play. We also appreciate the city's efforts to transition the play's management from financial management to economic development Pacific Gateway in order to increase the hiring'",
        "'speaker_3': 'of our underemployed Long Beach neighbors. Now, to this end, what progress has been made toward the local higher promise of 40% work hours and the disadvantaged higher promise of 10% work hours? Our Coalition's data analysis looks at work hours performed by Long Beach residents whom we define as local.'",
        "'speaker_3': 'And looks at compliance on a project.'",
        "'speaker_2': 'By project basis.'",
        "'speaker_3': 'Which is the standard reporting practices for other plays in our region out of 20 complete and active play projects. Only two have met the Long Beach Local Promise and only five have met the disadvantaged promise. That translates to a 10% success rate for local and 25% success rate for disadvantaged.'",
        "'speaker_2': 'As a city, we.'",
        "'speaker_3': 'Can do better. In fact, we know we can do better because if we look at Project six and the staff report aced at West PD Substation, that project met both the Long Beach local target and the disadvantaged target, and it was a relatively small project of less than $1 million.'",
        "'speaker_3': 'So we know that genuine success is possible and does not depend on the size or scale of the project. Unfortunately, Long Beach has not been able to replicate that success very much over the past four years. Therefore, based on play press practices, the local hire coalition recommends four targeted reasonable improvements to strengthen local and disadvantaged hire.'",
        "'speaker_3': 'Number one require an independent jobs coordinator for each and every play project. Number two.'",
        "'speaker_7': 'Disadvantage.'",
        "'speaker_3': 'Define disadvantage worker using Metro's definition, which targets residents.'",
        "'speaker_7': 'Facing multiple barriers to.'",
        "'speaker_3': 'Employment. Number three report disadvantaged work.'",
        "'speaker_7': 'Hours by city or tier. So we know.'",
        "'speaker_2': 'If Long Beach residents are.'",
        "'speaker_3': 'Benefiting. And number four, use Metro's process for holding contractors accountable. To be clear, our coalition supports the play and union jobs. We are simply recommending targeted improvements based on proven best practices. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_8': 'Good evening. Council. Mayor Garcia Vice Mayor Andrew's staff. I just want to say I'm P.B. Jobs. I'm Christopher Norwood. I'm here with my colleagues. I want to say, first off and foremost, I'm excited as well as people. Jobs and support for both the lobbies play along with the local hire coalition.'",
        "'speaker_8': 'P.B. Jobs. My job to slow them a little short guy. Sorry about that. Heavy jobs is the local. We're committed to providing career oriented employment opportunities to at risk youth, adults, veterans along with construction industry related traits. We advocate and serve national motto construction job programs which assist people with barriers such as homelessness, justice system involvement, welfare'",
        "'speaker_8': 'recipients and much more. Long Beach Veolia encompasses a community benefit program that resembles motto in which our organization is built upon. With our model, we have been able to serve 20,000 people and place over 8000 people in career track employment opportunities to this.'",
        "'speaker_8': 'We're excited about the potential of the opportunity that is exceeded, about the opportunity that is here before us, but as recognition and multiple infrastructure pieces that are missing in the play, which can be and make up for principles in a community benefit program which can be more successful.'",
        "'speaker_8': 'Now to this we are requesting stronger local hire language. Along with that, an additional of an independent jobs coordinator for all pilot projects and to define disadvantaged workers or encompass additional people for barriers to employment. All said, with these changes, PBE just feels that current people, they can be even more successful and truly make a community a'",
        "'speaker_8': 'community impact that we envision four years ago. So with that being said, I completely agree with Tom. There's a lot more things that can be done.'",
        "'speaker_6': 'And we're here to help out and make sure those things get done. Thank you. Thank you so much. Good evening, honorable counsel. I am Angelica Luna. I am a jobs partner with Peabody Jobs. I work with multiple contractors throughout the county as a community liaison.'",
        "'speaker_6': 'In this role, I assist local residents with union entry process. We provide referrals to contractors and help contractors reach their very local and disadvantaged hiring goals with the use of strong contractual paly language. Contractors are emboldened to hire locally and draw from employees that are often discriminated against and overlooked.'",
        "'speaker_6': 'Through this model, we have been able to help thousands of our participants start career in the field of construction. P.B. Jobs in particular, is a nonprofit organization focused towards helping the at risk be available for these opportunities and eliminating all barriers to employment.'",
        "'speaker_6': 'To this, our jobs coordinators help risk At-Risk residents by providing them with additional support and resources like childcare services, transportation, boots, tools, etc. all with the intentions of providing firm foundation for vocational growth. In closing, P.B. Jobs is a big supporter of labor and believes that the play with the right infrastructure can catapult the at risk into'",
        "'speaker_6': 'the middle class. With this, we ask that you strengthen the play to hold contractors accountable for local and disadvantaged hiring and assign independent job job coordinators to these projects to ensure continued employment opportunities for the at risk. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good afternoon, everyone. My name is Eric Miller and I'm executive director of Playa Vista Job Opportunities and Business Services. Long title, simple name. We help people with.'",
        "'speaker_4': 'Valuable jobs too.'",
        "'speaker_5': 'That as you stated, as we stated earlier, my colleague Christopher, we've helped over 20,000 people throughout the county find construction employment. And this is all through the model that this pilot encompasses. And so obviously, I can drown you out with all of the different statistics that.'",
        "'speaker_12': 'Players can.'",
        "'speaker_5': 'Provide. But I wanted to tell you a small story. Right now, we are the jobs coordinator on.'",
        "'speaker_4': 'One of the larger metro projects, which is the.'",
        "'speaker_5': 'Crenshaw L.A.X. line, over $1.8 billion worth of construction, too, that there have been over 100 different contractors on these projects. Most of these projects, in all honesty, are from outside of our area, either from.'",
        "'speaker_4': 'The Ventura.'",
        "'speaker_5': 'County area or from the Orange County. But two, that they are coming to here to this county and also signing up with the building trades to be a part of this large opportunity.'",
        "'speaker_4': 'With that, they also.'",
        "'speaker_9': 'Signed up to hire locally. With that, the Metro pilot required has two tiers.'",
        "'speaker_5': 'Which looks at first the five mile radius and then it also looks at the most at risk neighborhoods throughout the county. And two, that they are hiring directly from peavy jobs for these opportunities. Most recently, we parlayed one of our reentry grants for four young men who went from the halfway house to making a little bit shorter'",
        "'speaker_5': 'than $46 an hour. And this opportunity was created by this opportunity of using a strong.'",
        "'speaker_12': 'Play and a play.'",
        "'speaker_5': 'Language to make sure that we're setting aside jobs for the local and disadvantaged. So I'm asking you today and imploring you all today to recognize that we have a strong opportunity here. And yes, it is much smaller in scale than our local partners.'",
        "'speaker_9': 'In regards to the city of Los Angeles and Metro.'",
        "'speaker_5': 'But that doesn't take away from the fact that it can still have the.'",
        "'speaker_4': 'Proper infrastructure to help our people. So I'm asking you again.'",
        "'speaker_5': 'Consider this play as an opportunity to help the city of Long Beach. And thank you for your time.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_10': 'Good evening, Mayor. City Council colleagues in the chamber. I'm Derek Simpson, executive director of the Long Beach Community Action Partnership. I've been many thanks. Shared this evening. A lot of numbers, shared a lot of stories shared. The one thing I want to speak to is the fact that as the hands were raised here of our colleagues here'",
        "'speaker_10': 'in Orange Media, have them raise their hands from Long Beach. My reality is that the Long Beach Community Action Partnership, that 6100 families came to me in 2018 to help me to help them get their utility bill paid.'",
        "'speaker_10': 'They couldn't afford that. 48 teens came to me last year for a summer internship, and we pay them $1,000 each to help them. And they spent that on back to school supplies so that their moms didn't have to spend it on them.'",
        "'speaker_10': 'They could spend it on their little brothers and sisters. The reality is that with all the success that this play may have had local for us at Long Beach Community Action Partnership and those 6000 people that we helped represent your zip codes.'",
        "'speaker_10': 'Your zip code here in Long Beach. Those people deserve the opportunity to stand here if they would like to. In orange vest also and be proud that they have livable wage jobs. Our ask simply is that the opportunity for people who live in the zip codes that we serve here in the city of Long Beach have an'",
        "'speaker_10': 'opportunity to succeed and have an opportunity to pursue the jobs that are being spoken of. And if, in fact, they waiver because they can't pass a math test or they don't have the supplies that they need to get to and from work, that you allow the non-profits in our community to provide a safety net and wrap our'",
        "'speaker_10': 'arms around them so that we can again help Long Beach do better. I'm not anti-anything. I am all for Long Beach and at the Long Beach Community Action Partnership. I have been here at this podium from the beginning.'",
        "'speaker_10': 'From the beginning have not wavered and will not waver. Because if I do, I'm remiss in doing my job representing the people that we serve. I thank you for listening to me, and I thank you for hearing not just listening what we're trying to say to you as a community that we help the people of Long Beach'",
        "'speaker_10': 'get livable wage jobs just as we helping everybody else, too. Thank you.'",
        "'speaker_1': 'Thank you. Next week.'",
        "'speaker_8': 'Good evening. Mayor and council members? Yes. I mean, good. You're still awake. My name's Rodrigo Vasquez. I'm on APB Jobs on my case manager. Also, we like to say our coach. I work with a lot of reentry people.'",
        "'speaker_8': 'I work in the reentry field for over 15 years now. And when I heard about the plea agreement. I want to applaud the conversation. But at the same time, I want to echo the seriousness that it could grow to be.'",
        "'speaker_8': 'I think all of us that have worked in policy are, you know, know a big difference between a suggestion, a recommendation and something that's mandated and something that's law. So when you suggest then they could take it or leave it.'",
        "'speaker_8': 'When you suggest hiring people from the community are recommended, which is, I say all 20%, 30%, and this is policy, city ordinance, you know, it's taking more serious. And with the equity and employment conversation. I just want to urge every community being involved to look at the the racial proportions of how many Latinos and African-Americans live in'",
        "'speaker_8': 'Long Beach and how many of these populations are getting these jobs, this union construction jobs. So let's let's also look at the the the racial equity when we talk about play and the communities that the racial communities that live in play, that percentage should be proportionate to the percentage enter the play agreement.'",
        "'speaker_8': 'And that's how we know in terms of like people like benefiting from the play agreement. Right. My loneliness or. Yes. All right. Just a quick question. Just. And also, I just want to know that we're talking about lower class, working class are struggling, trying to reach middle class.'",
        "'speaker_8': 'We're not talking about trying to reach upper class. I think that play agreement conversation is another level. And I want to urge this committee to keep that in mind in terms of all the people in this community, especially the disadvantaged, poor people, a lot of black and brown and Asian Pacific Islanders.'",
        "'speaker_8': 'How do we prepare them to enter this other professional fields that we talked about earlier, quote unquote, blue collar professions? And there's a large proportion, a large population also of formerly incarcerated people here in Long Beach as well.'",
        "'speaker_8': 'So we want to make sure we create opportunities for them not to reenter the system as well. And I just want to say that, you know, let's let's start talking and let's get to work, you know. Thank you.'",
        "'speaker_1': 'Thank you very much. And and thank you to everyone that spoke. Let me turn we have a we do have a motion in a second. So let me start with Vice Mayor Andrews.'",
        "'speaker_0': 'Yes. Thank you, Mayor. You know, first of all.'",
        "'speaker_9': 'I'd like to thank each and every one of you for coming out here tonight. I think it's because part of me, even when I listen to all of this, because I think we've all have faced some form of adversities, and those adversities really have caused a lot of individuals to not to be able to get a job'",
        "'speaker_9': '. Because usually I remember when we first started off an individual who had any form of a problem. The first thing they asked you, have you ever been convicted of a felon and a felon automatically disqualify you for working anywhere?'",
        "'speaker_9': 'But I can remember if you were in jail when you had a felony, that you had to work. So we do.'",
        "'speaker_8': 'Have work ethics.'",
        "'speaker_9': 'So what I'm saying here tonight is that this report states that we are meting out. Our target, which is good, but we can always try to do better. You know, too many people in my district are still looking at the construction sites across our city and want to be a part of the workforce.'",
        "'speaker_9': 'Like I always said, a job can stop a bullet. It can buy a new way of life away from gangs and streets. I would ask the city manager and the Economic Development Department to strategize on a way to increase our local hiring number.'",
        "'speaker_9': 'And I disadvantage, you know, and veterans hiring and work with our partners with L.A and O.C. methods into the plan. I believe that there are ways that we can work together to bring good jobs to the people that need them the most.'",
        "'speaker_9': 'While we support our partners in labor, I encourage us to take a striking vehicle by the Long Beach Zip Long Beach zip code and not only by the county. You will see the diversity in this. So this is one thing that I feel so excited about and I see tonight that there is a possibility for those like'",
        "'speaker_9': 'the young man here, you know, a Latino brother, he has said, you know, if he wouldn't want to school, he didn't go and get his education. But yet and still, there's a possibility when I listen to these individuals, you can get a job.'",
        "'speaker_9': 'And this is what we're working on, Long Beach hiring. If you work here, you live here, we live here. You work here. And I know I wouldn't think you run so much of explaining that to me. We want jobs.'",
        "'speaker_9': 'That's all we asking for. Just give us some jobs. Can keep us off the streets, keep us in a place where we can live and eat. I want to thank you guys so much for coming out tonight and expressing to us.'",
        "'speaker_9': 'Thank you again.'",
        "'speaker_1': 'Thank you, Vice Mayor Councilwoman Price.'",
        "'speaker_7': 'Thank you. And I want to thank everyone for being here tonight as well. I've had an opportunity to go back and watch the council meeting where this item was passed. And this report is here tonight because of an amendment that I added that night.'",
        "'speaker_7': 'Not everybody was happy with the fact that I was adding that item because the additional data folks didn't think was necessary. But I'm so grateful that we did it because the data that we have before us in the report really justifies the need for the program.'",
        "'speaker_7': 'And it sets a foundation in terms of what our expectations are for future projects. And for me, I needed that data to be able to speak confidently about the proposal that we implemented, the pilot that we implemented, and the success that we've had.'",
        "'speaker_7': 'So I do recall and in watching the meeting, it did refresh my recollection that it was never, you know, I like the agreement that we have in place. It was never the intent of the council on that night to open it back up for any discussion, significant discussion at this juncture.'",
        "'speaker_7': 'It was to see how the project is working and whether it continues to be a success to lead us moving forward. And I believe we've done that. I do want to comment on a few things here. One of the things I was very pleased by and I want to thank staff for the for the report.'",
        "'speaker_7': 'The staff report is fantastic. But one of my biggest factors was what were the costs of the administration of this play be and how will that impact our project costs? And I was very happy to see that on average, the administration cost is under 1%.'",
        "'speaker_7': 'Is that correct? That's that's been our experience with.'",
        "'speaker_11': 'Yes, it's averaged about point 8% under the 1% target.'",
        "'speaker_7': 'Okay. That's fantastic. And the reason I say it's fantastic is because, you know, my concern was in terms of our residents and what the return on their tax dollars and revenue investment would be and whether or not the project costs would be inflated.'",
        "'speaker_7': 'I will say the projects that have been completed that I've had a chance to observe in my own district, of course, the public contracts which are part of this discussion, but also the private projects where we've had union labor have all been completed with very little drama, usually under schedule, usually under budget or around budget and in'",
        "'speaker_7': 'an exceptional manner. So I've been really pleased with the way that the projects have been carried out. I look at the huge public projects like the Colorado Lagoon, our North Shore section of it, our Leeway Sailing Center in my district.'",
        "'speaker_7': 'And then I look at private projects like yes and the labor component there. And I'm very pleased with how these projects have come to fruition. And I think it's set a standard in terms of, you know, very little disruption, efficiency, skilled labor, quality, development products, things that I think that we can really wrap our heads around.'",
        "'speaker_7': 'I will say that it's obvious that the construction is very active in the city such that our lower threshold project projects are not getting as many bids and as much. Competition. So that's one area where I think we should continue to to work on.'",
        "'speaker_7': 'In terms of the projects that are following in that, I think it's 500 to $900000 threshold level. One of the things that I was curious about is I know that we are going to be moving the administration to economic development department.'",
        "'speaker_7': 'Can you tell me a little bit more about how you think that will be a more efficient administration of this coordination position? And how is that coordination effort different than I believe it was Ben Garcia, who's the jobs coordinator with the building trades?'",
        "'speaker_7': 'I know that they're they help with the coordination, but what is it that we do in addition to or in lieu of?'",
        "'speaker_12': 'Councilmember Price, thanks for the question. So in in the in the past, we have actually contracted that 1% that contractors have to contribute toward the administration of the program has gone primarily toward the the auditing of ours payroll certification the reporting that you find online.'",
        "'speaker_12': 'There's a great website that you can see month to month reports, as well as working with the prime contractors to make sure that they understand their responsibilities. A sign they actually sign in a sent a letter that indicates that they understand the play our goals and objectives that the council has established and that, you know, the play'",
        "'speaker_12': 'administrator was more of an audit function. So what we're you know, what we envision in what we're working on now to to better attack the goals and objectives, both in the blueprint as well as the goals that are expressed in the play, is that we want to take advantage of some of the administrative back and that we'",
        "'speaker_12': 'have it at Pacific Gateway, which is, as many know, we have to do a tremendous amount of grant reporting to the Federal Government for our Workforce Innovation Opportunity Act funding. So we realized that, hey, some of the work that our contractor was doing within the 1% is actually work that we have capacity to do in-house, the Pacific'",
        "'speaker_12': 'Gateway, and that if we could absorb some of that, because many of these clients remember as they get into the workforce development system, we're tracking their progress. We're tracking not only the training that they're getting through these apprenticeship programs, but sometimes they even take advantage of other Pacific Gateway programs.'",
        "'speaker_12': 'Hundreds of people come through that might actually go into another sector. They might find that they do some work in construction, but then they might find a love for something else and take advantage of classes that we provide through City College and find themselves in another field altogether.'",
        "'speaker_12': 'So we want to take advantage of all of that capacity, not just on the administrative side, but to hire a play administrator that also has a responsibility for working with Mr. Garcia, the jobs coordinator and placement coordinator that the trades provides, partnering with our local community based organizations who have connections in the neighborhoods, the faith based communities'",
        "'speaker_12': ', the local hire coalition, all of the partners that you heard, heard from tonight. We would hope that the plan administrator being dedicated to that work, in addition to the administrative capacity, will make us more effective and give a face and a name and a person within the city that all of these groups can work with when they'",
        "'speaker_12': 'find workers or potential workers.'",
        "'speaker_7': 'I love it. I think it's a very positive step in the right direction. And I'm assuming that given the efficiencies that we're realizing in that this isn't going to result in additional costs to the developers.'",
        "'speaker_12': 'Correct at this this proposal and we're actually moving forward with it in this transition would be paid for within the existing budget. It would be paid for within the existing 1% that that has formally been used for the administrative outside contractor.'",
        "'speaker_7': 'And I and I said the developers. But these are public contracts so really do the taxpayers. They would not be shouldering a higher burden.'",
        "'speaker_12': 'Correct. And there wouldn't be an added cost to the actual prime contractor when they bid to the city. So remember, we are the customer or the client for these projects, but these projects are being built by private sector prime contractors.'",
        "'speaker_12': 'So it shouldn't add any additional costs which would, you know, result in less service to the community.'",
        "'speaker_11': 'And just to clarify how that 1% works so that it's not actually paid by the contractor, it is when we set aside our budget and we say, how much is the project going to cost? There is always your soft cost and then your actual construction cost.'",
        "'speaker_11': 'So that 1% is currently part of our soft costs that the city sets aside in order to do the administration of the play.'",
        "'speaker_7': 'That's fantastic. Okay. Well, a few of the things I agree that we should be focused more and try to do everything we can to meet the local hire component. I think that we have set forth some. High goals that we should not stop trying to achieve.'",
        "'speaker_7': 'Having said that, I'm a huge fan of having a tiered system in place because it allows for us to be able to recruit skilled labor from within and throughout the region. But also when we have consistency in the industry in terms of how these contracts are agreed upon and implemented throughout the region, we're in a position where'",
        "'speaker_7': 'we're allowing our own residents to have an opportunity through the tiered system to get jobs throughout the county and throughout the region, which is important because there may be additional construction jobs going on elsewhere and it opens them up for more variety in terms of job opportunities.'",
        "'speaker_7': 'And so so I think that, you know, obviously one of the things I was impressed at is we are meeting and or exceeding most of the thresholds and goals that we've set forth as part of the original play.'",
        "'speaker_7': 'Certainly when we renegotiate another play and enter into another contract, we can change some of those so those goals. But right now I believe that we are meeting and exceeding and in fact the tiered system allows for more opportunities, assuming that it's applied in a consistent fashion throughout the region.'",
        "'speaker_7': 'It allows for more job opportunities for our own residents. And the final thing I want to say, and I really want to thank IBEW for this, because they really. Took me by the hand when I started this this journey five years ago and educated me about what they do.'",
        "'speaker_7': 'And it was such an eye opening experience for me that I probably they're their biggest and loudest supporter now. So some people in here in the audience know and some may not that that I'm a prosecutor and in my job, I work a lot.'",
        "'speaker_7': 'I'm a manager now. So I oversee about, you know, many, many tens and tens of attorneys that work daily to give people second chances and opportunities. And one of the things I learned when I went to IBEW is how great the reintegration into the job workforce program is.'",
        "'speaker_7': 'And so I talk about that everywhere I go. I recently went to a parole hearing at Donovan State Prison about three weeks ago on a murder case that I prosecuted in 2005. The defendant was 17 years old at the time.'",
        "'speaker_7': 'It was a gang related murder. He is now 34 years old and 33 years old, and he was applying to be released on parole. And one of the things you have to do when you're asking to be released on parole is to identify what your parole plans are.'",
        "'speaker_7': 'And he had not taken advantage of any opportunity to learn a trade during his time in prison. And so he was denied parole for a variety of reasons. But at the end of the hearing, I asked his attorney if I could talk to him, which in 20 years I've never asked to talk with anyone.'",
        "'speaker_7': 'And this was the first time someone I prosecuted was eligible for parole. And I took him to the side and I said to him, you know, one, you need to get your GED, you're in there. They're offering it to you for free.'",
        "'speaker_7': 'You need to get your GED to you need to connect with a trade. And the next time you come up for a parole hearing in three years, you need to identify that you've been through some job training with a trade and that you are prepared to enter the workforce with one of the building trades.'",
        "'speaker_7': 'And he was very appreciative. His attorney said, I've never had a prosecutor reach out and talk to one of my one of the inmates like that. But I think that there is so many success stories about people who learned a trade and now have the opportunity to purchase a home and live in the community and be a'",
        "'speaker_7': 'productive member of the community. That's what second chances is all about. So to me, yes, it's absolutely important that we get our Long Beach residents working. But it's more important to me that we get people in the region who would not have otherwise had the opportunity to earn a pay and learn a profession working because that helps'",
        "'speaker_7': 'the entire region as a whole. And I think that's really where our focus should be in terms of how this pilot program has unfolded in the city of Long Beach and how it can continue to grow when it expires and is renegotiated.'",
        "'speaker_7': 'So I want to thank staff for their work and I want to thank all the people that came out today. And for all of you guys who have shared about how it's changed your life and how it set a path for you.'",
        "'speaker_7': 'It's inspirational to me and anything that I can do ever to continue to support those efforts, I will do personally, professionally, all of that. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilwoman. Okay. Let me go to the speakers list now, Councilwoman Gonzalez.'",
        "'speaker_7': 'Yes. Thank you so much. I'm excited that we're at this point. We it took us a lot to get here, I think, three years ago. And now we're here and we're talking about all of the successful datasets, you know, and points about the place.'",
        "'speaker_7': 'So just a few things I want to first thank. City Staff. Inclusive of financial management, economic development. PG Wynn Public Works City Attorney and Manager's Office, L.A., O.C. Building Trades and all of our nonprofits and job advocates that have been with us through this full three years and ensuring that we're getting this right.'",
        "'speaker_7': 'And I always say, you know, we're a city that enacted this three years ago. We're a city that's growing. We're a city that's learning not only about the play, but just about our jobs and workforce landscape. And what was exciting about this citywide play when we brought it forward three years ago is that it created a domino'",
        "'speaker_7': 'effect, in essence. Right? It then we had the Long Beach City College play and opportunities at the port and now we're looking at potentially hopefully pray that we have Long Beach Unified School District on board. And so this is the exciting thing about the play is that it's been opened up to a lot of opportunities, not just'",
        "'speaker_7': 'in our city but across the board in our various agencies within our city, which is very exciting. And it's not only given people a job opportunity, but a career as the daughter of a truck driver who worked for 30 years in a skilled career, I know exactly, you know, how important, how vital it is, not just as'",
        "'speaker_7': 'a policymaker, but as someone who's had a person in my. Family who has benefited from plays in this sense. So a couple questions and I want to just make sure I think there was some confusion and I just want to clarify because I have to to do that.'",
        "'speaker_7': 'This is a five year agreement, so we cannot open up anything at this point. And I just want to make that clear that we're not adding anything. This is just a received file. Five years is when the agreement is open up for additional renegotiation, correct?'",
        "'speaker_11': 'That's correct. We're not recommending opening up the play and it is not too far away. It's May 2020 is when the play would come. Would that five year term would expire.'",
        "'speaker_7': 'Great. So May 2020, that's coming around the corner. Fantastic. And I will clarify, though, back in 2015, we did ask for a full discussion of a of all terms and conditions and any recommendations to the Jack, which is the Joint Advisory Committee instead of a received file.'",
        "'speaker_7': 'And so I just want to make sure, I think for the respect of the Council and to ensure that we're getting it clear that we stay on track with these requests, because I know that that was clearly what we had asked for.'",
        "'speaker_7': 'And I think when this came up, I think everyone was thinking, Oh, we can add suggestions and recommendations and we can add this and that. And so I think we just want to make sure we're clear there. And I also want to make sure the community is clear so there's no confusion there.'",
        "'speaker_7': 'So with that said, just putting it out there. So now I digress to just a couple questions, and I'm just wondering how to do this, given that information, because I know that, you know, all of us, I think, are in the same the same mindset.'",
        "'speaker_7': 'We want to grow our local numbers. Absolutely. We want City of Long Beach employees or City of Long Beach residents to be on the workforce at 40, 50, 60, 100%. If we could, that would be fantastic. Oftentimes what happens and I worked with PPG When and Nick specifically on this, I remember a year or so ago, he'",
        "'speaker_7': 'gave me a list of exactly which jobs we had available, which trades and which districts they were located in, and like half were in the first half were in the six, the others were in the ninth and various areas.'",
        "'speaker_7': 'And we I had told him, you know, give me the storytelling on the data. And it was eye opening because you get, you know, we had about 80 or so people that were in apprenticeships or went through or started the apprenticeship.'",
        "'speaker_7': 'Some fell out because they decided to go to college. Some decided that they just didn't want to pursue the trade anymore. Some decided that they wanted to go into another career, not on any city, city jobs, and some decided to move forward and go through with that.'",
        "'speaker_7': 'And some just didn't have an opportunity here in Long Beach because the trade didn't call or the job didn't call for that specific trade. So I want to be very clear with community as well that sometimes it's hard to get those numbers given that opportunity, given those given that landscape.'",
        "'speaker_7': 'But I do think we need to do a better job of creating a pipeline of individuals. And so I'm excited to see Mr. Garcia and what I would say and hope that we could potentially do, knowing that we need to get more Long Beach folks on the job and knowing that we want to grow in communities like'",
        "'speaker_7': 'Justin. Justice involved, getting justice involved individuals into these jobs, high poverty areas, high areas of need of unemployed and underemployed folks. So my question to staff, given this information is how. Knowing that we can open anything up. Is there any sort of two from four that we can just slightly or suggest to recommend to the Jack not'",
        "'speaker_7': 'opening anything up? But half of them I think, are here today on the committee. So we can just say, look, in the interim, this year and a half that we are waiting, we at least want this information and we want it to be clear that we're trying to get.'",
        "'speaker_7': 'To those levels and set ourselves up for success at that five year mark.'",
        "'speaker_11': 'Certainly. So, you know, we do believe that you can give us direction today to be able to, you know, look at those things and come back. We certainly hear that. We would you want some more information about how we are meeting our goals.'",
        "'speaker_11': 'Part of your staff recommendation today is moving that over to development. You're moving it over to it is going to allow us to have additional outreach, additional services to be able to provides that information. So, yes, we can we're certainly moving in that direction and we think we're doing more than what we were doing just just a'",
        "'speaker_11': 'couple of months ago. So we can be bringing back additional data to you. We can year we can bring you any data that you would like to ask for us tonight.'",
        "'speaker_7': 'Okay. Well, I would just add, you know, my colleagues, I'm sure, have more to add, but I would just like something maybe in writing that just says that we are trying to work with these communities, that we're going to make good faith efforts to increase our local numbers to 40% here in Long Beach and do everything that'",
        "'speaker_7': 'we can basically to be able to make this a more robust opportunity for a better workforce here. With that said. See, I would just say I just want to thank everyone involved. I know we're really trying to get towards that, you know, goal of of meeting everyone and making everybody feel great about this this play.'",
        "'speaker_7': 'I feel confident that we're in the right direction, that we're headed in the right direction. And I think my colleagues for, uh, for hearing that.'",
        "'speaker_11': 'But I'm sorry, Councilmember, I just want to clarify that it sounds like you're requesting a two from four be added to this motion to receive and file. And you would also like a two from four from staff, is that correct?'",
        "'speaker_7': 'Well, just one. I was just thinking one that basically perhaps it could be a suggestion to the JAC and to the Long Beach City College coordinator, Mr. Garcia about. I know, I know he's already doing a lot of this work, but just stating that we want to make good faith efforts to increase our local Long Beach hiring'",
        "'speaker_7': 'where we can and just do a lot more and get deeper into these communities that we need to.'",
        "'speaker_2': 'Work.'",
        "'speaker_7': 'With. You know, the jobs is one we have winter. There's a lot of organizations that are doing this great work to get into these communities and we want to make sure we're making good, good faith efforts.'",
        "'speaker_11': 'But as you stated, and I just want to be clear on the Jack, the they have the ability and their primary role is to monitor compliance with this agreement. And they they can meet and they can discuss potential amendments with two exceptions, lowering the threshold and and the term of the agreement.'",
        "'speaker_11': 'And those recommendations would come back to the city council and to the Trade Trade Council for proposals either to amend the agreement before it expires or in the new agreement. They would recommend these additional changes that maybe you're discussing or recommending.'",
        "'speaker_11': 'But yes. And if I can ask John Keisler to add to that, I believe the Jack is meeting fairly soon and he can talk a little bit more about that.'",
        "'speaker_12': 'Yeah, Councilmember, it's, it's actually a part of the agreement that the Jack will meet periodically to review the status and compliance and discuss ways to to improve performance. So I think that we're taking notes tonight. So, so all of the things not only that are on the record, but also things that have come to mind are our'",
        "'speaker_12': 'discussion topics for our agenda. We'll discuss those with the Jack. And we're always happy after these meetings or these even these council meetings to come back to the council in writing with an update as to what we discussed and what the next steps are.'",
        "'speaker_7': 'Okay, great. Thank you very much. I look forward to hearing more from my colleagues and we'll leave it at that. But thank you again for all of your help.'",
        "'speaker_1': 'Thank you very much, Councilman Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Just a few thoughts and a few questions. So, number one, I'm proud to see the progress of the program in these last four years. I've seen the progress. We don't typically have a bunch of construction going on in North Palm Beach, where we have recently we have a Highland Park community center under construction'",
        "'speaker_5': 'that we check on. We're ready. We're excited about. That's a play job. It's a play project. We've got you know, we just recently finished our two force wetlands and both Councilman Austin in my district. Great project adding you know much needed amenities and the added bonus to understand that local folks are working these are union jobs and'",
        "'speaker_5': 'they're transforming lives. And to hear the young man come up and say, thank you, I was given a second chance. I think those are the narratives that we promised Long Beach. And that's and that's what we expect to continue to see.'",
        "'speaker_5': 'I think it's was very interesting that we had a conversation earlier on the Latino equity profile of Latino economic profile because, you know, project labor agreements while a long time ago they may have been controversial. Now they're considered best practice, their best best practice to close the racial wealth gap.'",
        "'speaker_5': 'They create opportunities for people to, you know, bill resiliency, make money, own a home, invest. And so I completely support that given, you know, I've led a conversation on economic inclusion for the last two years. So I recognize that and I appreciate that.'",
        "'speaker_5': 'I also don't want to dismiss the challenges that the community raised up, and I see it as a challenge to do better. We have to continue to do better and to improve and focus on things we can do to better connect and make sure more of our people feel connected to our local economy.'",
        "'speaker_5': 'And the one of the best tools to do that is this project labor agreement. So when I jump into some of the conversation, some of the questions here. So I want to hear from from staff. Tell me more about this.'",
        "'speaker_5': 'The stuff on what does that page 13, the pilot program on page 13. Walk me through that once more.'",
        "'speaker_9': 'So thank you for the question, Councilmember. The Supplemental Services Program would be in addition to the project leader, project labor administrator at Pacific Gateway. And what it would do is actually add capacity or support for job coordination services to that project.'",
        "'speaker_9': 'Labor Administrator. So what we would do is ensure that within the current budget of of 1% project cost. We could. Put together an RFP for those services. We identify firms to get the RFP out, to bring it in, evaluate the RFP and then have the opportunity to onboard those forms for that additional support on larger projects or'",
        "'speaker_9': 'when there were multiple projects that would be out of out of scope for a single administrator.'",
        "'speaker_5': 'And so this would be something in addition to in addition to what you're already providing.'",
        "'speaker_9': 'We haven't begun providing anything at this point. But yes, when when the duties transfer, it would be in addition to the duties we would provide. Yes.'",
        "'speaker_5': 'Okay. And we heard some examples of an independent jobs coordinator. How is the proposal that you're offering different than the independent jobs coordinator?'",
        "'speaker_9': 'I don't know that it is different in that respect. What we would be doing is opening up a competitive process to identify firms that provided those services that I believe we're both both talking about and developing a pool we could contract with to provide those services.'",
        "'speaker_5': 'Sure, that makes sense. So and so you said it would typically be within the 1% administrative costs. Isn't that the way it is? How is that different from the way it's structured? Over $10 million, the $10 million threshold for the independent jobs coordinator.'",
        "'speaker_0': 'At.'",
        "'speaker_9': 'At the $10 million threshold, the cost of the project administrator is a cost that's passed on to the prime contractor.'",
        "'speaker_5': 'And what do we know? What the average. What was the cost of that? We've had one. How many projects have we had that triggered the independent job coordinator?'",
        "'speaker_9': 'Release two that I'm aware of.'",
        "'speaker_5': 'Okay. Because I see it was we had one project listed.'",
        "'speaker_9': 'Airport and the ABC. Well, I believe I the two.'",
        "'speaker_5': 'Okay. And did it come in? My understanding is that it comes in at one point, typically 1% of the project costs. Do we have any data to justify that?'",
        "'speaker_9': 'I'm going to have to defer to them on.'",
        "'speaker_5': 'Those are those costs that are paid by the contractor are not part of the 1% that we're talking about.'",
        "'speaker_0': 'They would be.'",
        "'speaker_5': 'My question is, you know what I hear and I want to I want to get some evidence for this, is that typically the independent jobs coordinator costs about 1% of the project. Is that what the data shows? If we have the data we have, if I'm understanding the question is for the administrative costs, then we spend as'",
        "'speaker_5': 'a city, you know, the independent jobs. So we have end. Do we have an independent jobs coordinator threshold at $10 million? Yes. Okay. And did we ever utilize that in the last four years?'",
        "'speaker_0': 'The first one would be.'",
        "'speaker_5': 'The first one to be here. So it has been utilized how many times? Once.'",
        "'speaker_9': 'Once.'",
        "'speaker_5': 'Okay. In that one time. How much did it cost? The contract.'",
        "'speaker_12': 'Yeah. We don't know what that costs to the contractor to hire an independent jobs coordinator. So that would be something that they have on their side of the ledger. It's not something that is recorded as part of their project costs or something that we set aside as part of our 1%.'",
        "'speaker_5': 'Understood. So why did we opt to and in this pilot and I'm support I'm supportive of figuring out how to get a job independent jobs coordinator whether it's Peavy jobs or others to play that role for the remaining projects challenge for me is that I see that there's only one more project less on this left on this'",
        "'speaker_5': 'project list that's 10 million and above. I would love to see those additional services, the boots going to people who need boots, the rides and transportation. I would love to see that on the rest of the projects that are listed.'",
        "'speaker_5': 'I see is only three projects left within the term period. So I would like to I would like to see that happen. And so I want to ask some court process questions now. So in terms of the way that this this meeting was noticed, this is city attorney was this was placed on the agenda as a receiving'",
        "'speaker_5': 'file. So what does that what are the limits on that?'",
        "'speaker_11': 'So so under the Brown Act, the the noticing provisions are required to give the public an opportunity to determine whether they want to come down and hear what the council is going to debate and what what action or what they they may be doing on this.'",
        "'speaker_11': 'So a receiving file does limit the council from, for example, if if you were suggesting or wanted to suggest to staff to go negotiate an amendment to the existing play that wouldn't be allowed under tonight's action to receive and file a report.'",
        "'speaker_11': 'You could certainly agenda advise that for a future meeting or direct staff to look into making changes to the play or future in new plays. You'd like to explore the costs of adding additional features. But this evening, because of the noticing to receive and file this project labor agreement report, the Council is limited tonight to making substantive'",
        "'speaker_11': 'changes or recommending substantive changes to the agreement. You could certainly ask for a report. You certainly ask for additional information, certainly.'",
        "'speaker_5': 'And I think that makes sense. I think that wasn't the original intent. The intent. I think we'll get into which is the same things to the to the Jack for recommendation. If, you know, if we were if we had any recommended recommended changes.'",
        "'speaker_5': 'And so I want to want to talk about that a little bit. So there's you know, I've heard this term not open up the play. My understanding is that we couldn't unilaterally open up the play as it is.'",
        "'speaker_5': 'Is that correct?'",
        "'speaker_11': 'That is correct. It's it's an existing contract that would require under the contract, Article 20, the agreement can be renegotiated, supplemented, rescinded or otherwise altered, but only by mutual agreement of both parties. So you would need to have an agreement from the Trades Council also.'",
        "'speaker_5': 'That makes sense. I mean, there are partners, so they have to be bought into anything that happens. And so this apprehension that I'm hearing about don't open the play actually doesn't make any sense because you can't unilaterally do that.'",
        "'speaker_5': 'However, I'm having an issue reconciling, and this is a process issue that I have with city staff. I'm having an issue reconciling the report this in front of us now with the motion that was made four years ago.'",
        "'speaker_5': 'The emotion. As he says, it was a motion made by Councilwoman Gonzalez, seconded by Councilmember Richardson, to approve a recommendation as amended to have data provided the city council an annual basis. And the five year agreement returned to the City Council after three years for full discussion of all the terms, in agreement terms and conditions of the'",
        "'speaker_5': 'agreement and forward any recommendation to the Joint Advisory Committee for possible amendments. So. Can we forward recommendations to the Joint Advisory Committee for Four Amendments? Can we do that tonight?'",
        "'speaker_11': 'The answer to that is probably no, because the way it's worded in way the Brown Act requires you to receive and filed this report. You can you can direct staff to whatever potential amendments you want to send to the jack.'",
        "'speaker_11': 'You could ask staff to tell them what they are. Ask them to cast those out. Bring them back to the city council. And at that time we notice it for recommendations to possible amendments to the Jack, and then you would be provided with a report.'",
        "'speaker_11': 'What those impacts may or may not be to the city's cost or to possibly the trade council's expenses. And then the Jack could consider that recommendation.'",
        "'speaker_5': 'Perfect. And therein lies the problem. I was trying to get to City Council asked for you to come back and give us an opportunity to make recommendations. And you just told me what's presented in front of us does not give us the opportunity to make recommendations.'",
        "'speaker_5': 'Is that accurate?'",
        "'speaker_11': 'It just it does not allow you to do it tonight. It's a two step process.'",
        "'speaker_5': 'So we were expecting a second step.'",
        "'speaker_11': 'Well, you'd have to step staff, but I think that there was an obsession of the.'",
        "'speaker_5': 'Staff then, if you can't answer that. If the recommendation from from the council was to provide the report and you've provided the great report, thank you for that. And secondly, to have an opportunity for us to forward recommendations to the JAC.'",
        "'speaker_5': 'So is there a second part of this coming? Because I see the report when I don't see the second part here.'",
        "'speaker_11': 'Yeah. So that was an oversight by us that was not intended to do this in two different steps. We wanted to have that discussion. We expected to be able to have that. And if that wasn't if that wasn't put forward the way that it should have, that really was on us.'",
        "'speaker_11': 'So that just kind of escaped us. I apologize for that. And we would certainly want to take any input you have tonight. We could bring that back and and do it in a second step. And we would have been nice to have done it all at once.'",
        "'speaker_5': 'Thank you for acknowledging that for me. When when we agree on a motion and we just did this a couple of weeks ago with tenant protections, we said we were very specific about the language used by the three year checking.'",
        "'speaker_5': 'We said nobody lose their benefits and we continue, you know, on with the process. And when we did this, there was very specific language and there was a commitment to the community that we would come back and make recommendations.'",
        "'speaker_5': 'There was never an assumption. I keep hearing this open appeal. There was never an assumption to open up the play there. There's an assumption that we will have three years of good data come in and say, What can we do to make it better?'",
        "'speaker_5': 'That was always the assumption, and that's what I expected to do tonight. And there were people in the community who have come to me and multiple members of the council who have asked me to make these recommendations to staff and to make to raise some of these issues tonight and to be told that it wasn't noticed correctly'",
        "'speaker_5': '. She tells me that either was an inadvertent no. I'll tell you, I'll accept that as inadvertent or an intentional attempt to limit our ability to do our jobs as a city council. And I do not appreciate that. I frankly do not appreciate that.'",
        "'speaker_5': 'So we all support everybody on the dais who spoke and has said that they support the project. Labor agreement was not in question. The question here is, are we doing what we can to make sure that we are confident and 100% supporting and doing what we can to do and do to improve it?'",
        "'speaker_5': 'So, Mr. Modica, I want to make a recommendation and you figure out how to make it happen between you and the city attorney. But I want to make a recommendation that the independent jobs coordinator be included moving forward on the rest of the project.'",
        "'speaker_5': 'That's it. I completely understand. I completely understand that has a process that you have to have buy in from the trades. I would never want to undermine that. I want to I want to submit that publicly, that I want to support an independent jobs coordinator and risk the projects evaluated.'",
        "'speaker_5': 'Do we need to do you need to do. But I want to make sure that that happens. I want to enter that process. So how we go about that?'",
        "'speaker_11': 'Mr. MODICA So yes, we can certainly take that direction from the Council if the council wants to do that as a motion. You know, we felt in our recommendation we would go as far as we could with kind of the services that we had available to us, given the prior direction, which is what we presented tonight.'",
        "'speaker_11': 'The Council wants to go beyond that and give us direction to do that. We'd be happy to do that and sit down. The jobs coordination piece is a little tricky because there is already a discussion in the contract about what is a jobs coordinator and when does it trigger.'",
        "'speaker_11': 'So there is some nuance to figure that out, and we can certainly come up with different ways for you to consider that, if that's what you'd like to look at, as well as the cost and and bring those back to you.'",
        "'speaker_5': 'Absolutely. We don't want to circumvent any process. We don't you know, what we want to do is formally submit it into the process the council established for consideration of both parties. That's what we want to see. And I think there's a way to very simply say this is the one we're not asking to trigger a renegotiating of'",
        "'speaker_5': 'the whole play. We're talking about a very narrow issue. The independent jobs coordinator I think a strong case has been made here. I've personally spoken with representatives from the trades, individual trades and the Trades Council that this one issue is not very controversial.'",
        "'speaker_5': 'If anything, it just helps us present better and helps us to actually do the job we want to do. So that that's what I'd like to see. Vice Mayor are you good with that? Okay. Vice Mayors, good with that.'",
        "'speaker_5': 'Okay. So I think that satisfies my concerns at this point. Thank you.'",
        "'speaker_11': 'So if I can just get some clarification. So was that added into the motion to come back and find a way and cast out the jobs coordinator? That was that.'",
        "'speaker_5': 'In my recommendation to the Jack, however. Okay. Appropriately noticed a recommendation. We'll figure that part out. Thank you.'",
        "'speaker_1': 'A customer appears.'",
        "'speaker_3': 'Thank you. So I'm going to try to wait to to address the comments that Councilmember Rich just Richardson just made and just take a moment to thank everybody that has gotten us to this point. When this item came forward, I was on the other side of the dais trying to figure out how to work in between community'",
        "'speaker_3': 'members that hadn't worked with the building trades before and working with the building trades and recognize that it took a lot of effort to get to where we're at today. And so I really want to thank Ron Miller and IBEW, the painters, everyone that's really stepped up to make sure that we have these numbers in front of'",
        "'speaker_3': 'us today that we can really be proud of. To see this conversation and to hear my council colleagues being very proud of what we've been able to do in the city is great and it's also wonderful to meet people that have worked on my favorite project, the Aquarium, and also our Rainbow Lagoon.'",
        "'speaker_3': 'So it's wonderful to know that we have so many Long Beach residents here in the room tonight. I want to thank the local hire coalition for your efforts. I think that you guys have stayed together and you've tried to work to figure out what we could do together to strengthen the local hire piece, that building trades would'",
        "'speaker_3': 'be on board with that community members and that council members could be on board with. So I applaud that effort as well. I want to thank everyone that's reached out to us. And I think, you know, having this again, as Councilmember Richardson said, coming off of listening to the Latino Economic Report and really thinking about how many'",
        "'speaker_3': 'Latinos in our community work double the hours and get paid less, that we as a city are really taking the best foot forward to create new job opportunities for people in our community really speaks volumes about where we're at with the city.'",
        "'speaker_3': 'So I think that that's wonderful. I have a couple of questions just on clarity, because I have staff's numbers in front of me and I have the local hire coalitions numbers in front of me. And I wasn't here during the original vote, and I know staff is all talking over there, but could staff clarify for me what'",
        "'speaker_3': 'the tears were? In the local higher goals. I know we had tier one and a best effort in tier two. Anybody listening to me?'",
        "'speaker_11': 'Yes. We are listening.'",
        "'speaker_3': 'Okay. Go ahead.'",
        "'speaker_11': 'John King. You go through the tears, please.'",
        "'speaker_12': 'Yes, certainly. So within the agreement, the different tiers were established based on the geographic area that they serve. So the way we would describe it simply would be tier one, Long Beach, Tier two, I think we call it gateways.'",
        "'speaker_12': 'And then we have the L.A. and Orange County region. So the three different tiers reflect that the workers would come from those different regions. Of course, some of them are inclusive of the other regions, which makes it a little bit confusing, but it also allows for the trades to take a Long Beach resident who's in there on'",
        "'speaker_12': 'their list and probably employ them on a metro project or anywhere in the county. And so it allows for that ability for those workers to move around. So just because you are a Long Beach resident and you're on the list doesn't mean you wouldn't work on a job in Orange County, Metro L.A. City, because obviously those are'",
        "'speaker_12': 'much bigger projects, much longer timeframe. So presents opportunities for workers with each and in each of the tiers to do jobs in other tiers as well.'",
        "'speaker_3': 'Absolutely. And I understand that I was asking, did we have a specific goal for Tier one, Tier two and Tier three.'",
        "'speaker_9': 'That no councilwoman, that the total goal across the tiers was was 40% local higher, and then there was a 10% disadvantaged or veterans higher that was specific to Long Beach residents.'",
        "'speaker_3': 'Great.'",
        "'speaker_11': 'And I also do want to point out that there are different applicant or different applicability requirements for Tidelands projects. So Tidelands projects make up about 30% of all the projects, but they are not allowed because they're a state tidelands trust to have that local goal.'",
        "'speaker_11': 'So they are within the 40% goal, but it's for all of Orange County and all of L.A. County. So they're a subset of the plan.'",
        "'speaker_3': 'So we have a handful of these projects then that's on this list that wouldn't meet those. Okay, that helps me. I mean, looking at the numbers, you know, and I know how difficult it is and I support obviously the building trades, building a bench that is that is a deep bench.'",
        "'speaker_3': 'Looking at some of the Long Beach hours worked. I mean, there's some great projects on here that have 42% from the numbers the community provided. But looking at the disadvantaged worker ones, there's a lot that are, you know, 0%, 3%, 5%.'",
        "'speaker_3': 'What is how is the city reporting our tiers? Are we reporting that at all in zip codes where our hires are.'",
        "'speaker_5': 'For for disadvantaged? The play does not identify tiers and we do not report them that way as a result.'",
        "'speaker_3': 'So I went I went backwards. Is there a a report for the Long Beach hours by tier. I mean, does that make sense for disadvantaged?'",
        "'speaker_5': 'For local?'",
        "'speaker_3': 'For local? Yes. Sorry. Okay. Thank you for that. Um, so I to you know, I would like to make sure that the disadvantaged worker piece is as strong as possible. That is the area that we are going to see the biggest growth and support for our residents and to see the biggest economic impact.'",
        "'speaker_3': 'As our professors told us earlier, you get a dollar, it goes $3 back in the community. So getting these disadvantaged workers and veterans access to those jobs, I think is really important. So whatever we can do to make sure we're tracking that as we move forward, I hope that we can include that.'",
        "'speaker_3': 'I I to you know, I don't like to to talk too much about process up here, but this process was extremely frustrating. We had this item pulled from the agenda so we could try to get it right, so we could all be on the same page and to have it come back as a received file.'",
        "'speaker_3': 'Whenever I read the original motion, it was extremely frustrating. And so I just I have to say that I hope as we move forward that because there's not a recourse for us really to make sure that staff is bringing the items forward.'",
        "'speaker_3': 'So I was happy to hear that you guys both said that we can give you direction today, because when I talked to the city attorney earlier, that was not the case, which caused me a very stressful Tuesday that could have been avoided had we agenda set the right way.'",
        "'speaker_3': 'So I moving forward, if we're making a recommendation for jobs coordinator, one of the things I want to make sure that we don't do is insert the city in a position that's not our job and not our role.'",
        "'speaker_3': 'So I appreciate the staff within economic development, within Nick's shop to be able to have a coordinator. I think that's great. It's something that we should have had from the beginning to make sure that we're building a pipeline in Long Beach that's as rich as the pipeline in L.A. We deserve that.'",
        "'speaker_3': 'Long Beach deserves that. So I'm thankful to see that. What we what I don't understand is the RFP process for an additional jobs coordinator in every other situation I've seen. Their jobs coordinator is done in between the contractor and the building trades.'",
        "'speaker_3': 'And so setting a threshold and saying we need a jobs coordinator, they go figure it out. No. Okay.'",
        "'speaker_9': 'I'm. Look. Yes, Councilwoman, you would be correct. So if you if you made that recommendation, that cost would go to the contractor in that respect.'",
        "'speaker_3': 'Because I don't want us to take on the contract, which you'd if we can account for that in the contract, that's 1%. And whether that's the building trades jobs coordinator, whether that's I don't care who that jobs coordinator is, as long as it's somebody that does it and does it well.'",
        "'speaker_11': 'So and I think what you were seeing is the way that that the reason that looks a little bit different is we were trying to be creative and innovative and find a way to meet those goals while not well, realizing that we have a contract that already currently sets when that trigger is.'",
        "'speaker_11': 'And not to go into that into that contract language that we can't change by ourselves. So we were trying to bob and weave and find a way to do it. If the council would like us to look at it in a different way and give us direction as a body, we're open to that.'",
        "'speaker_3': 'I think Councilmember Richardson's motion was a good one work with the building trades to figure out how we can increase our local hire. The diversity. And so I think I think we're in a good place. But it was a frustrating process this week.'",
        "'speaker_3': 'I'm very proud of the work leading up to today. I'm very proud of the work that city staff has done, that the building trades have done and the community. And I look forward to strengthening our local higher numbers and making sure that more of our jobs have our residents on them.'",
        "'speaker_3': 'Thank you so much.'",
        "'speaker_1': 'Thank you. I want to just want to clarify. It's also just the the motion and the friendly amendment that's been accepted. It's to make sure that Council Richardson and vice mayor and staffers are all on the same page.'",
        "'speaker_1': 'The motion is to bring back cost analysis, any information possible to look at bringing on an independent jobs coordinator on all projects, and then take all that information. That information would come to the council and be forwarded to the to the JSC.'",
        "'speaker_1': 'Is that correct?'",
        "'speaker_8': 'It goes to the that.'",
        "'speaker_11': 'That's correct. It would come back to council with that information and that at the direction of council would be sent over to the JSC. The JSC.'",
        "'speaker_1': 'J.C., what did I say? I said JSC. So. Okay. And that is that. I think that's. Is that correct?'",
        "'speaker_5': 'How long does it take?'",
        "'speaker_1': 'I have no idea. How long how long would that analysis and then information take to get back?'",
        "'speaker_11': 'We'll do our best to come back in 30 days.'",
        "'speaker_1': 'Okay. All right. So I think that is the friendly. So we all that understand that, correct? Okay. Just making sure. Let me go and keep going. Councilman Austin.'",
        "'speaker_10': 'Thank you. I do appreciate the the conversation around this. First of all, I think this report let's get back to the report. I think it was well done. I think it highlights of what is can be described as a pretty successful project labor agreement the intended outcomes.'",
        "'speaker_10': 'I think far exceeded expectations for the most part. When you look at the numbers that that have been produced thus far, I want to congratulate my colleague's staff, but also the partnership with the Orange County L.A. Building trades for for working together to hit the targets.'",
        "'speaker_10': 'But I will say this, that the bar is set pretty high for the next report.'",
        "'speaker_0': 'And.'",
        "'speaker_10': 'You know, we exceeded 40%. We should probably got 77% local hire. We should probably be in 80 or 90% the next time. No, no pressure. I'll just say that jobs certainly do change lives, and I'm living proof of that.'",
        "'speaker_10': 'I'm very thankful that I had an opportunity to have a great union job right out of high school working for a major corporation. It laid a foundation for me and working kept me focused and out of trouble and gave me a social identity.'",
        "'speaker_10': 'And I was proud of who I was and how I was contributing to society at a very young age. Those opportunities, I believe, should be afforded to any young person who wants to work. Anybody in this city who wants to work.'",
        "'speaker_10': 'And as a council member, I take it very my my responsibility very seriously. I believe it is my job to help create and maintain good jobs in this city. So I'm proud to have been a part of this landmark policy during a great season in this city's history.'",
        "'speaker_10': 'We can't lose sight of that, but we still have a lot of work to do. There's unfortunately, Councilmember Richard Richardson will appreciate this. Not everyone is in. Not everyone is sharing in the success and not in it's not for lack of effort or political will.'",
        "'speaker_10': 'And that's it. There has been a lot of political will. There's been a lot of good intent from this council to to create good jobs, to maintain good jobs in it, to make sure that we are as fair and equitable as possible to to to all involved.'",
        "'speaker_10': 'And I think we're going to get there and we're going to work toward a continuous improvement. One one term that that seems to be a little bit of a hanging chad in here is the term disadvantaged and the under the current project labor agreement how is just advantaged population defined.'",
        "'speaker_10': 'That's for staff.'",
        "'speaker_9': 'So our our disadvantage criteria is is particularly broad. We take the annually published 70% lower standard of living and use that for the disadvantage criteria. It does it does two things. Usually that LSO is a threshold below a census track with with a low or low household.'",
        "'speaker_9': 'Income. So you're you're underneath that criteria. The other thing is many other places will ask for people to meet. A couple other criteria have have been adjudicated, be homeless, be a former foster youth, be be a single parent with multiple dependents.'",
        "'speaker_9': 'There's there's multiple other eligibility criteria in some of the plays, you have to meet to two of nine of those as well as being economically disadvantaged. We said if you're if you don't have a job or if you aren't earning sufficient for yourself and want to avail yourself of construction career pathways, that's all we need to know'",
        "'speaker_9': '. And so we used the lower standard of living in that didn't add any other eligibility criteria for an individual to have to chase.'",
        "'speaker_10': 'So I heard from some of the public commenters regarding other plays and thank you for for giving examples of how other places are structured. Obviously, when we put this together, this was our first time doing it as a as a council.'",
        "'speaker_10': 'We learned a lot on on on those who had the experience before. But there are other places that are there working today. Is there a best practice in terms of understanding what disadvantages population is?'",
        "'speaker_9': 'So, so again, there's, there's, there's a few ways to define it. What I talked about with the lower standard of living, you could use the federal poverty levels. Some some folks use census tract. With within certain zip codes and then a median household income at a certain level within a certain census tract within a zip code qualifies'",
        "'speaker_9': 'any resident as disadvantaged. But in those examples, there are other eligibility criteria tied to. The disadvantaged term. In addition to the income, we didn't add any other criteria here in language, in addition to income.'",
        "'speaker_10': 'Okay. And so could we add other criteria? And when would that in? If we could when, when, when could we do that?'",
        "'speaker_11': 'That would require to open the play. So in 2020, for a new play or a new agreement, we could renegotiate different terms and conditions.'",
        "'speaker_10': 'Duly noted. I will move on. Well, I'll just say that I think that is a key piece of this in terms of what I what I was mentioning, those who are feeling left out, who may not feel like they can can qualify.'",
        "'speaker_10': 'You know, I listen to to one of the commenters who said he went through a couple of trade programs and still did not get it. And then the lobby City College piece. I appreciate it. Gentleman, I forget your name giving numbers.'",
        "'speaker_10': '300 people went through a program. I think roughly one third of them were placed. I'm curious to know what happens to the people that weren't placed. You know, does that mean they're just not on a on a project laborer job or do they are they still equipped to use the trade to to do other work?'",
        "'speaker_10': 'I think that I think and it would be very interesting if we could be able to to kind of track that information as well. So that that's just maybe a suggestion and perhaps to get the question answered at some point.'",
        "'speaker_10': 'But I'm interested in understanding where were the rest of those those folks who went through those those classes that those trainings where they're falling in in the workforce? The. The other piece of it is I think that the partnership with Long Beach City College does offer some, some great opportunities.'",
        "'speaker_10': 'And I'm glad to hear that they are engaged and involved in this. I know there was a point where they were cutting trade programs and things of that nature, and we're on the way back. And, you know, a lot of our young people in our city will have an opportunity to not only experience the college promise, but'",
        "'speaker_10': 'hopefully a jobs promise, a careers promise and a future as well. That said, I think the bar has been set pretty high. Overall, I think good job staff, good job building trades. Let's continue to do good work and continue to improve upon what we've already established.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Thank you. Got somebody right.'",
        "'speaker_4': 'Thank you, Mayor. Great discussion and a lot of enlightening information. It was a good report. But piggybacking on a little bit of what Councilmember Austin brought up in terms of the disadvantage, while we may not be able to get additional criteria in there at this time because we had to revisit the play, the concert, he didn't want'",
        "'speaker_4': 'to do that tonight. But could we get a report on the participation of disadvantaged hours within this.'",
        "'speaker_8': 'This report that's coming.'",
        "'speaker_4': 'Back to us as a as an update.'",
        "'speaker_8': 'Prettier. Yes. A lot. Yes. Yes.'",
        "'speaker_5': 'There is a disadvantage. Summary Report Table E on page 18. That is in the report.'",
        "'speaker_4': 'Okay. All right. Well, having come from lobby City College when I was a trustee there, it's very correct because you were us and you pointed out something that was very painful at that time. And it was painful because the I guess the timing wasn't right at that time for a play to be created lobby City College, even'",
        "'speaker_4': 'though we were going through a major construction phase for the, you know, for the college. But and some programs had to be what they call discontinued, but it was they were discontinued, just for clarification, at the higher levels at the at the point of where a poor person would get a degree in.'",
        "'speaker_4': 'Yes. But not at the entry level positions. And that I have to make that clear. But I was very proud and I'm very proud of this council, quite frankly, for bringing forth a play that we voted for. We had one in place and that we were able to partner with lobby City College and and strengthen the trade'",
        "'speaker_4': 'programs at City College. I mean, that's that was something that needed to happen and we made it happen here. What the emotions on the floor I can live with because the last thing that I want to do, the last thing would want to do is jeopardize the play in its current form by by making any kinds of'",
        "'speaker_4': 'recommendations that would trigger a arena association and a revisiting of it, although we're going to have one anyway next year. Correct. So, I mean, we're I think we're in we're in a good path here. And I think that that can support the the motion and the amendment.'",
        "'speaker_4': 'One more thing could could help could. Is the council member Gonzalez's recommendation for ATF TFF also have taken care of this or is it they'd have to go through a motion because that's where I was before I was okay with ATF.'",
        "'speaker_4': 'But now if there's a friendly on the floor, is that is that okay? I mean in terms of being able to provide that and.'",
        "'speaker_11': 'Councilmembers, I understand the motion it is to receive and file. And then staff has been directed to look into the options for having an independent job coordinator on all of the jobs and come back to council with those costs associated.'",
        "'speaker_11': 'I don't know that the two from four as part of that motion. I don't have it down as part of the motion.'",
        "'speaker_1': 'I think I mean, I think listen, I think the two from four is a request for more information. I think so. I think that is reasonable to be all rolled into to the requests.'",
        "'speaker_11': 'Mr. MODICA Yeah, we think we can accomplish both. So we would come back with some information about, you know, additional services that can be provided and what those costs would be. And then you can make any recommendations you'd like to the JAC.'",
        "'speaker_5': 'Look.'",
        "'speaker_1': 'At the recommendations. Go to the JAC. Okay, great. Let me let me let me go ahead and just say a few comments before we vote. I think it's it's important as well. The first thing I'll say, they think that this is ending actually in a really good spot.'",
        "'speaker_1': 'I think that obviously getting to play, having the check in tonight and ensuring that we are preparing ourselves for a strong reauthorization next year, which I look forward to supporting well is on track and that and it really uplifts the work that's been going on on this council and within the trades and the workforce as well.'",
        "'speaker_1': 'I also think that I'm getting the information and that's been requested as it relates to the jobs coordinator and getting the information to the council and then getting that information to the JAC is also a good process. And so I think that's something that there is support on and I support as well.'",
        "'speaker_1': 'I want to also just point out, which I think is important. I think it's important for for the coalition, for that for the body. It's important that we also are, I think, first and foremost, acknowledging that. The the guidelines in the numbers that were set by this council have been met and exceeded.'",
        "'speaker_1': 'And sometimes I often hear that we're not meeting our Long Beach numbers or we're not meeting certain numbers. The numbers that were adopted by this council and inserted into the project labor agreement were not just met but have been exceeded by the work of the team at the trades.'",
        "'speaker_1': 'And so I say that because I just want to be very clear. Sometimes I will read that, that the hard work that's going on with Mr. Miller and his team, somehow we're not meeting the targets that they committed to.'",
        "'speaker_1': 'And I think we are meeting those targets and we're exceeding those targets. Do we want to do better? Of course. And I think we do. We want to have more Long Beach residents on jobs, of course. I also don't want to diminish that the way this the construction trades work.'",
        "'speaker_1': 'And I think, you know, I think most of all of us have visited a lot of the training centers across the county and across the region. These jobs are mobile. We want our construction workers have access to jobs everywhere across the region, in the county.'",
        "'speaker_1': 'And so that's something that continues, which is why we're pushing for places not just in Long Beach, but everywhere across across the region. And so we do want to have more Long Beach workers on our jobs. And I'm really glad that there's a commitment to do that.'",
        "'speaker_1': 'And I think we're all working towards towards that promise. I also just need to point out, I think we also need to work for the state. We can't have multiple data sets and compare apples to oranges. And I want to make sure that we're comparing the numbers to numbers.'",
        "'speaker_1': 'I know the L.A. Metro keeps getting brought up a lot, which is great because I'm on the L.A. Metro Board. But I also want to make sure that when we're looking at our Long Beach numbers and comparing them to the Metro numbers, it's not a good comparison.'",
        "'speaker_1': 'And not only is it not a good comparison, it's not a sign, I think a scientifically appropriate comparison. The L.A. Metro numbers include are not just a project labor agreement that includes our Construction Career Pathways project, and it includes a variety of different specialty types of programs that focus on disadvantaged communities, which are amazing, by the way'",
        "'speaker_1': ', and which I support on the Metro Board, and I support the work that happens within those projects. But it's it's it's not comparable to our play, which has, which is a completely different set of targets and goals. And so I look forward to working with the local hire and the local jobs coalition.'",
        "'speaker_1': 'I think in the next weeks and months ahead as we try to make improvements to what we send over to the the the Jack. But I also want to make sure that we are using the same set of, of, of numbers and that we are comparing things that are actually that are that are comparable to one another'",
        "'speaker_1': 'in the information that we have. And so I'm supportive of what we're doing tonight. And certainly I'm proud that the trades and the team have met all the numbers that set by this body in the agreement. And so with that and members, please catch me.'",
        "'speaker_11': 'I may or if I could just clarify that the report, the staff is going to come back in the table with. That the two from four will be separate from the information or part of the information that comes back to you within the 30 days.'",
        "'speaker_11': 'And given the timing. We understand that you want this back in front of you. We would try within 30 days to do the two from four, do all the research, get that to you and then put it on there.'",
        "'speaker_1': 'I think we want everything in 30 days, if possible. Yeah, great. Thank you very much. Please cast your votes.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Great. Excellent. Thank you very much. Next item, please. Madam Clerk, we will go back to the agenda.'"
    ],
    "Ordinance Amendment on Alcoholic Beverage Manufacturing. ": [
        "'speaker_2': 'So that hearing item number one. Report from Development Services. Recommendation Receive supporting documentation into the record, conclude the public hearing and accept categorical, categorical exemptions and statutory exemption. Declared ordinances amending the Long Beach Municipal Code relating to alcoholic beverage manufacturing definitions and accessory dwelling units.'",
        "'speaker_2': 'Read the first time in lead over the next regular meeting of the City Council for Final Reading and adopt a resolution directing the Director of Development Services to submit the ordinance amendments to the California Coastal Commission citywide.'",
        "'speaker_1': 'Thank you. Mr. West or whoever is presenting.'",
        "'speaker_5': 'Limitato on screen.'",
        "'speaker_2': 'Here evening, I'd like to introduce our new current planner, Alexis Oropesa. She'll be making tonight staff presentation for this item. Good evening, honorable members of the Council. The agenda item for you tonight consists of a handful of amendments that were continued from the City Council's March 5th meeting.'",
        "'speaker_2': 'The purpose of the Minutes amendments are to reflect the changes mandated by the California Coastal Commission's action last October when certifying the relevant ordinances. At last month's hearing, the City Council acted to continue that item directing staff to return with additional information related to accessory dwelling unit permits and lot size for the benefit of those who may'",
        "'speaker_2': 'not have been in attendance. A brief a very brief overview will be provided of the other ordinances, the first of which is the Alcoholic Beverage Beverage Manufacturing Ordinance, which was adopted by the City Council to streamline the permitting process.'",
        "'speaker_2': 'California Coastal Commission's amendment to this ordinance makes clear the parking requirement for office space that is equal to 25% of the gross floor area of the album use. The second. That batch of amendments is a compilation of changes necessary to create consistency between the zoning standards and Title 21 and the 2017 Training and Building Code Update, as'",
        "'speaker_2': 'well as the state's water efficiency standards. The California Coastal Commission made a number of amendments, including creating a new definition for demolish and rebuild. Among those changes make a recommendation that the definition of remodel and rebuild that was mandated for the coastal zone only be adopted as a citywide standard.'",
        "'speaker_2': 'As background. The Accessory Dwelling Unit ordinance was drafted in response to the completion that went into effect in January 2017, which invalidated the city's local adopted standards for A2 use. The local ordinance was crafted to provide local standards for the development of areas where possible to ensure that adus were developed in a manner compatible with the city's'",
        "'speaker_2': 'development pattern. The city map on the left illustrates the distribution of permits issued for youths since January. From January of 2017 to December 31st of 2018. The map gives us a snapshot of the distribution showing that districts 78 and nine have the greatest number of permits issued for 80 use.'",
        "'speaker_2': 'Of the permit trends that we see, approximately 10% of the permits are being issued for the legalization of unpermitted dwelling units within the city, which helps to create safer housing. The California Coastal Commission Commission acted to certify the city's 80 new ordinance with a number of changes, the two of which were were asked to come back on'",
        "'speaker_2': 'related to the minimum lot size, where staff was recommending 48 feet be applied citywide. And the second citywide amendment that was recommending was with regards to the parking requirement, which exempts parking for 80 youths under any number of conditions, including when located within a half mile of transit.'",
        "'speaker_2': 'So staff's recommendation was to change the citywide standard to 4800 square feet outside of the coastal zone. This creates opportunity for 5800 additional lots to be eligible for the development of a to use this additional the number of lots does not create a change in the geographic distribution of units of excuse me of eligible lots to any'",
        "'speaker_2': 'significant standard. 1% is the greatest change. Staff finds that the 4800 square foot minimum lot size is appropriate citywide for the following five reasons, which includes that it's equitable for property owners both within the coastal zone and outside of the coastal zone.'",
        "'speaker_2': 'It's also creating one standard creates an understandable and consistent regulation for the public. And finally, it creates an opportunity for relieving the housing crisis that is being experienced city throughout the city and state. Public noticing notices were published in the Press Telegram on March 28th in accordance with the Long Beach Municipal Code.'",
        "'speaker_2': 'In addition, staff sent notices to members of the public that had previously submitted communication on the ADU ordinances. Staff received a half dozen emails provided to you tonight. Two of the letters expressed support for the four for the ordinance changes and other.'",
        "'speaker_2': 'The other emails can be summarized as requesting additional information. Staff requests that the City Council take action to adopt the zoning code amendment tonight, with one correction to a typographical area error made in subsection B of Table 51.2 7.2762 related to required parking for A2 use.'",
        "'speaker_2': 'And the correction would be to strike the distinction that it would be isolated to the coastal zone. This concludes Dove's presentation. We welcome any questions that you may have.'",
        "'speaker_0': 'Yes. Okay. Cause you'd like to do public companies first. Okay. Is that okay? Do you come in on this idea? Okay, fine. Is there any public comment on this item?'",
        "'speaker_2': 'Hello. Good evening. Well, good night. Actually, my name is Mona Abbas. I actually lived in District nine and I was trying to move because of, you know, issues in the neighborhood and the Barbie bar that we were they were trying to approve the legalizing the the the bands.'",
        "'speaker_2': 'So I came here and I said, if that was passed, I was going to go ahead and move out. I did. I took my family elsewhere. I am the director of Families in Good Health in Saint Mary's Medical Center.'",
        "'speaker_2': 'And we purchased a home that, of course, we couldn't afford a bigger home as we had in North Long Beach. But with the with the goal of actually going and adding to our home so that we could actually live as comfortable as we were living in North Long Beach.'",
        "'speaker_2': 'But we only have 50, 100 square foot lot. And so we need 5200 square foot is what I was told when when I called and tried to get permits. So as a Latina, as you guys know, it's really hard to live in the 90808 zip code.'",
        "'speaker_2': 'However, it is really difficult to well, we don't believe I as a Latina, I don't believe in convalescent homes. So I'm trying to build a future for my mom. And so I am just asking today if we could please go ahead and approve for the minimum of 4800.'",
        "'speaker_1': 'Thinking Speaker.'",
        "'speaker_5': 'Sure. Good evening, Mayor. Councilmembers. My name is Ryan Kelder. I'm a I'm an associate at a Studio 111 architecture firm here in Long Beach. And also, I'm a vice president, president elect of the American Institute of Architects local chapter, Long Beach Gothic.'",
        "'speaker_5': 'So we're currently amidst a severe housing crisis, as you as you all know, in California and and elsewhere. And at current rates of housing production, we are falling for four. We are falling far short of many. Both current and future housing demands are already having serious consequences on our population's quality of life, especially those in the median'",
        "'speaker_5': 'and low income bracket. The supply of affordable housing is diminishing and causing displacement out of existing and established communities and pushing the workforce community further away from employment centers. Because of the severity of the housing shortage, it will take multiple approaches to solve the housing crisis.'",
        "'speaker_5': 'One important part of the solution is a responsible expansion of use woven into the fabric of our existing communities, specifically within our single family communities. 80 youths are a prime contributor to multi-generational housing and co-housing accommodations. The development of ideas promotes a blending of socioeconomic groups within our established communities.'",
        "'speaker_5': '80 youth provide an opportunity for a grassroots scale of development to support, and the resolution of the housing crisis allow allowing owner owner occupied single family residents who know and care about their communities a mechanism to play a contributing role and being a part of the solution.'",
        "'speaker_5': 'I'm a supporter of the California Senate and the former governor's position on in court and encouraging local jurisdictions to embrace the intent of state legislation by enacting local ordinances to promote the development of ideas. I advocate for the City Council to support the Long Beach Planning Department's recommendation for the reduction of lot size requirements for energy use'",
        "'speaker_5': 'for 4800 square feet. This policy, in my opinion, maintains existing community scale and character by utilizing current end scale, form based zoning requirements. Thank you for your consideration.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_8': 'Good evening, honorable counsel. My name is Art Richardson. I'm a real estate investor and builder of Addus. And we have many that are available that meet the requirements of being less than 600 square feet. We know our housing situation in all of L.A. County is in a desperate situation.'",
        "'speaker_8': 'And I really think that I wish the council would consider to even drop the minimum lot requirement beyond 4800 square feet Long Beach. We have some of the smallest lots and L.A. County, and we could probably even go down as low as 4000 square feet and still, you know, be able to meet and get along close with'",
        "'speaker_8': 'the requirements that Bill and his safety want us to have. Also, if we can consider maybe allowing us to build these adds you not just with single family residence. I think that's one of the requirements that only single family residence that it's available to.'",
        "'speaker_8': 'There are some duplexes in our town that have the space for us to put a 4 to 600 square foot adu and still provide more housing for our people here. So I would recommend that we would consider even reducing it down to 4000 square feet.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_8': 'Mr. Mayor. Members of the city council just two here supporting the change to the ADA ordinance. Really, we should encourage this form of development or community support of staff's findings to reduce lot area. I'd also note the parking standards shouldn't be unduly restrictive and and follow clearly established state regulations consistent with the staff recommendation.'",
        "'speaker_5': 'So in support of the proposed changes. Thank you. Thank you.'",
        "'speaker_1': 'Let me also. This'll be your last speaker.'",
        "'speaker_12': 'Good evening. I've heard a lot of talk about 1% tonight, so I'll try to make it quick. This 1% is important to me. I am the third district or homeowner within the third district. I am also a business owner.'",
        "'speaker_12': 'I own Harting design and construction and I help homeowners build adus and remodel and I help them early on in understanding their expenses and what they're getting themselves into. So first off, I'd just like to thank you all for everything that you've done to solve our housing crisis thus far.'",
        "'speaker_12': 'And I would like to thank you for protecting our city from overdevelopment and keeping the charm and uniqueness of our community. I would like to share a short story about why I support its use and why a little back yard rental has made me the man that I am today.'",
        "'speaker_12': 'Early on in my childhood, my grandmother, who we called Ooma, she helped my mom purchase a little two bedroom, one bath home with a backyard unit in the back. And at that time, we had renters living there for about four or five years, and they turned out to be fantastic people.'",
        "'speaker_12': 'I got to know them well in very many ways. They turned into parenting type of figures. And the rental income helped my mom. And it release the financial burden, some of the financial burden of raising two young boys.'",
        "'speaker_12': 'Later on in my life, after the renters had moved out, my grandmother Irma had moved in and that at that point, it really turned into a granny flat. The. At that point. She helped my grandmother, helped us a lot with raising us when my mom was going back to work.'",
        "'speaker_12': 'She cooks meals. She helped us with our homework. She basically took the place of an absent parent. And later on in college, when I was doing a counselor at Long Beach, I ended up moving into the granny flat.'",
        "'speaker_12': 'So I guess you could call it then from a dandy going to a Cindy, which was a student in my back yard, no longer the grandma in my backyard. And at that time, I had two of my friends.'",
        "'speaker_12': 'They moved into the front unit. And so there was three of us living in this two bedroom, one bath home with the little rental unit in the back. And we all focused on our studies. Once the community graduated through communications and speech within Cal State, Long Beach, we all rode gondolas in Naples, and we're still friends to'",
        "'speaker_12': 'this day. I guess what the moral the moral of my story and what I'm trying to convey is that ideas are multi-generational, they're multi-use, and they really will help solve our housing crisis. So I'm asking you today to approve this amendment, and thank you for your time and staying late.'",
        "'speaker_1': 'Thank you very much. I'm going to close public comment on on the hearing. Councilman Pierce.'",
        "'speaker_3': 'First, I was going to say this is early. It's only nine. Something about that late. Yes. I want to thank staff for their hard work. You know, I completely support staff's recommendations. And I think I did want to ask clarity on the duplex.'",
        "'speaker_3': 'They are not prohibited where duplexes are. Is that correct? They're not.'",
        "'speaker_2': 'So if you have two primary units, you you are not eligible to have an accessory dwelling unit. And accessory dwelling unit can only be constructed where there is one single primary dwelling unit. Okay.'",
        "'speaker_3': 'All right. Well, I totally support staff's recommendations. I do know I had a meeting with. Some folks from Airbnb recently, and I'm not sure if staff's aware of this, but they are going into the ADU development market, so they are developing a to use to go in drop in within 30 days.'",
        "'speaker_3': 'You have a whole new project there. So some interesting stuff. I wish that my districts had lot sizes that we could build more, but I appreciate the additions that could be added throughout the rest of the city so that we can tackle our housing crisis.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Excuse me, Councilwoman Pierce. I just want to make sure does your motion include staff's recommendation to correct the typographical error that occurs on.'",
        "'speaker_11': 'Page nine in the footnote B to.'",
        "'speaker_6': 'Remove the words in the coastal zone?'",
        "'speaker_0': 'Absolutely. That's what I thought.'",
        "'speaker_1': 'Councilman Austin?'",
        "'speaker_10': 'Well, I think in the motion, I strongly support this as I was part of bringing this this this motion to the council originally. I think this is a great way to help us solve our our housing crunch here in the city of Long Beach and throughout the region.'",
        "'speaker_10': 'I think the state legislation was was timely that that afforded us the opportunity to do it. And I want to commend staff for their work on getting us here. I did have one question, though. So I know that there are roughly 150 permits that have been issued for 80 youth since we passed this.'",
        "'speaker_10': 'Is that correct?'",
        "'speaker_2': 'That's correct. Let's. We have about round 100, but we've gotten over a couple of hundred actual applications in the process.'",
        "'speaker_10': 'Okay. So as we know, we will we will be creating housing as a result of abuse. Will this be credited toward our arena numbers?'",
        "'speaker_2': 'Yes. Our understanding is it is a legal habitable unit. And the arena criteria is that if a building permit has been issued for it, it counts and it will go generally unless it set aside for affordable housing, it would go to our moderate income arena account.'",
        "'speaker_10': 'Great. Thank you. I urge unanimous support.'",
        "'speaker_1': 'Thank you. Yes, I have a question.'",
        "'speaker_9': 'The young lady studio and spoke of her living in the ninth and she moved into eight. What is she like into that category? Would she be able to.'",
        "'speaker_8': 'Build.'",
        "'speaker_11': 'With the staff recommendation? She's at 5100. We would go down to 4800. She'd be able to build one.'",
        "'speaker_0': 'Thank you. Okay.'",
        "'speaker_1': 'Great. Thank you. I also support strongly the staff recommendation and I'm really glad we're moving forward. I think this is a great way of getting people into homes that are affordable and that are accessible and to deal with our housing crisis as well.'",
        "'speaker_1': 'So I do want to thank all the councilmembers who have been involved in this conversation. Let me just to to staff's point, I think Councilman Austin brought out some good points. I want to make sure that we're carefully tracking all of these so that we are counting them into all of our numbers.'",
        "'speaker_1': 'And in addition to that, it's a it's a good reminder for the council as well. And Councilman Austin, I think, alluded to this. When you look at arena numbers, I think there's a there's a misconception that, you know, well, it's true.'",
        "'speaker_1': 'You know, cities don't hit their arena numbers. But there's also a misconception that our biggest where we're doing the worse is in our low income affordable. The area within our arena numbers that we are need to do better on is actually in the market rate numbers.'",
        "'speaker_1': 'So we do need to build more affordable units and we are doing that. But whenever someone says we should stop building market rate units, we're doing actually worse in building market rate units according to our arena numbers. And so I, you know, let's let's use the data and we need to build market rate units and affordable units'",
        "'speaker_1': 'and meet and work to meet our meter numbers as best possible. And then the second thing I'll ask you, because I think I've brought this up a few times, I think, in briefings, but it's a good time to bring it forward more publicly.'",
        "'speaker_1': 'Ms.. Tatum is, I think, the same needs. We now have this this same effort needs to go into converting our minimum are our minimum number of square footage when it comes to micro units in Long Beach. And remind me again with the minimum number of square footage for a unit and long is.'",
        "'speaker_2': 'In the downtown plan that.'",
        "'speaker_1': 'Citywide citywide and downtown plan.'",
        "'speaker_2': 'Downtown is 600 citywide. We don't yet have a standard there is not currently a standard.'",
        "'speaker_1': 'And so that, you know, the 600 number for many cities is high. And so one of the one, if we really are to think are trying to create more density on both the affordable market rate side, that 600 number needs to be lower to whether it's closer to the New York number or some of the other cities'",
        "'speaker_1': 'or, you know, San Francisco or other places. But there is interest, whether it's on the student housing side, on the smaller unit side, to do 500 square foot units. In some cases, some cities are doing 400 to 450 square foot small studio units and are are and I know that for a lot of people, they couldn't imagine'",
        "'speaker_1': 'themselves living in that small of square footage. But if we want to build affordable units that people can build, the cost is less and we can build more of them. And so when can we see that proposal back in front of this body to lower that requirement?'",
        "'speaker_2': 'Mayor We are actually working on that now, but we've just started that effort, so I'd say probably 3 to 4 months.'",
        "'speaker_1': 'I'm very happy to hear that. So I look forward to that discussion in front of the council as well. And there's a motion in a second to to pass this. Please cast your votes.'",
        "'speaker_0': 'Mm.'",
        "'speaker_2': 'That motion carries a student.'",
        "'speaker_0': 'Oh, that's.'",
        "'speaker_13': 'Interesting. Okay. Okay.'",
        "'speaker_1': 'Thank you. Next up is item nine.'"
    ],
    "Downtown Parking Study Implementation and Progress Report.": [
        "'speaker_1': 'Item 11, please.'",
        "'speaker_0': 'You write that.'",
        "'speaker_2': 'We did item 11, item ten Communication from Council Member Pearce Recommendation to request city manager to begin implementation on priority areas identified in the downtown parking study and report on the progress of those initiatives.'",
        "'speaker_3': 'Thank you. Good. Okay. This is an item that we've worked on with staff, with Tom Modica and the team. And so I look forward to having you guys bring these back. My my priority out of all of these would be the parking impacted areas.'",
        "'speaker_3': 'Looking at the parking zone. I know my brain is not working. Maybe it is late, huh? Give me 1/2.'",
        "'speaker_0': 'I just been district.'",
        "'speaker_3': 'Yes, thank you. The parking assessment district. How soon do you think we could initiate that?'",
        "'speaker_11': 'Ask Linda Tatum to talk to that.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Councilwoman Pierce, we can get started on some of the preliminary research for that. But ultimately, in order to create a parking assessment district, we'd have to do some some studies to see how exactly what the fees could be to charge the property.'",
        "'speaker_2': 'So I'm going to say that would take several months to do that. But on some of the other items, and I understand that that's your priority, but some of the other items on that list that was in the staff report.'",
        "'speaker_2': 'We can certainly get started on some of those a lot quicker and come back sooner and concurrently. While we're taking a look at the the process and the potential fees for the property owners to create the parking and the process to create that parking assessment district.'",
        "'speaker_11': 'Okay. And the good news here, Councilmember, is there is some funding associated with this so that this is not one that's looking for new funds. $175,000. That does come as part of the successor agency. So as the properties are getting sold, that money goes to that account as per the settlement.'",
        "'speaker_11': 'So we'll be tapping into that as those funds become available.'",
        "'speaker_3': 'Great. The other one that I think would have a huge impact that seems like low hanging fruit that I'm curious on. The timeline is the private parking. I know that we've talked about different ways of doing this. And, you know, if you take the lot that's at fourth and cherry and it's got the one meter and people'",
        "'speaker_3': 'can pay to park there. I know that we have a list in my office of businesses that are willing to open up their lots. We just need a streamline process to do that. What's the timeline? You think we could have a city policy on on how to do that.'",
        "'speaker_2': 'On that process? We are coordinating with economic development. They've actually started that effort as well in terms of talking to some of the private property owners in the process to get those lots open up through those private property owners for for public parking.'",
        "'speaker_2': 'When they are, say, closed for the night. Those are some of the things that are currently in process. And I'd say the timeline would probably be within 60 days.'",
        "'speaker_3': '60 days. I love it, really. I just want to thank staff for their hard work. I know that this has been a long process and I know that we worked over a couple of months to get this. And so I really I know I pushed really hard to get it and then I didn't agenda it right away'",
        "'speaker_3': '. So again, I think you there's this one area that I really appreciated your efforts on. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Gonzales.'",
        "'speaker_7': 'Thank you so much. And I was forgotten on this item, just so you know. I'm just kidding. That's okay. As the other half of downtown, I just really want to thank Councilmember Pearce for bringing this forward as a supplement to the the study that we had already done.'",
        "'speaker_7': 'I know there's a lot of areas and gaps that we still need to fulfill and see where there's room to to succeed in parking. So thanks so much for bringing it forward. And thank you, Linda.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Public comment on this item, saying now there's a motion and a second, please cast your votes.'"
    ],
    "Ordinance Amendment on Hotel Worker Safety Precautions.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'How to request to move 19.'",
        "'speaker_2': 'Communication from city attorney recommendation declare ordinance amending the Long Beach Municipal Code by amending sections relating to hotel workers safety precautions red and adopted.'",
        "'speaker_3': 'As read citywide.'",
        "'speaker_1': 'There's a motion and a second. Any public comment? Nicholson.'",
        "'speaker_6': 'But perhaps my better. Good evening, Mayor Garcia, Vice Mayor Andrew's Council members. Administrators, citizens of Long Beach, one of the first towns. I ever commented here was in support of the United Nations Initiative to Protect Women, March 1st, 2016.'",
        "'speaker_6': 'And I remember, in fact, that it was Councilwoman Price who sponsored that. I think by now you know how deeply I'm dedicated to the welfare, well-being and safety of women. I've been active in the American women's movement now for over 50 years.'",
        "'speaker_6': 'I'm an era and Alice Paul scholar. When I moved here, I met Claudia's parents. I began to pick it on Ocean Avenue with the women telling the truth about sexual assault in the city's hotels. And for the first time in my life, Time magazine agreed with me on something.'",
        "'speaker_6': 'They were truth tellers, and actually they were here earlier tonight at that first council meeting addressing Claudia's law, one of the council members mentioned his concern that adopting the hotel housekeepers concern would dampen the booming party of the Grand Prix.'",
        "'speaker_6': 'You can only imagine what I thought when I went home that night. Have a fun weekend. See a race. Assault your housekeeper in the friendly city of Long Beach. After your testimony and city council majority entrenched in voting against women's protections, the people spoke.'",
        "'speaker_6': 'And I'm filled with inspiration by the wholesome heart of the vote of the people. I stand here and in bold enough to thank you and welcome you to the right side of this issue. For all women, no matter the size of the hotel, no matter the circumstances, no matter the management.'",
        "'speaker_6': 'Because you see, as I told you three years ago, women hold up more than half the sky. Women carry water from shore to home all over the world, across the globe, women bear, feed, clothe and educate the young.'",
        "'speaker_6': 'And you tonight care for the sick, the aging, the dying, your mothers. Thank you. The grandmothers of all directions. Thank you. We stand together in the clear light of day that you have protected. All women tonight. And I'm here tonight to say thank you very much.'",
        "'speaker_1': 'Thank you, senor. The public comment. Councilman Price.'",
        "'speaker_3': 'Well, just just.'",
        "'speaker_7': 'For clarification, this item is about hotel and motel panic buttons and nothing more, which I will say every council member was always in support of. Thank you.'",
        "'speaker_1': 'Councilman Gonzales.'",
        "'speaker_7': 'Happy to move this forward. Thank you very much for being here.'"
    ],
    "Youth Poet Laureate Program Proposal.": [
        "'speaker_1': 'Please cast your votes. Motion carries cane excited please. We'll go back to item number 12.'",
        "'speaker_2': 'Communication from Councilmember Richardson. Councilmember Pearce, Vice Mayor Andrews Councilmember your UNGA recommendation to request city manager to work with the Library Services Department and the Arts Council of Long Beach.'",
        "'speaker_3': 'To establish a youth poet.'",
        "'speaker_2': 'Laureate program in Long Beach.'",
        "'speaker_5': 'Well, when I envisioned doing this, I did this already. It would happen when we gave the poems. I promise no poems right now. This basically we thought about this, this idea a couple of years ago, but we waited to get the Michelle Obama library open and we brought it up a year ago.'",
        "'speaker_5': 'It was wait until after the main library's open. I think it's time that we start this program. Poet laureate programs, you know, 35 cities have them around the country. We have a national poet laureate program. We actually were visiting the keynote speaker at last year's Khj breakfast was the L.A. poet laureate, Luis Rodriguez.'",
        "'speaker_5': 'It's an amazing program that just lifts up literacy, lifts up art. And by starting with youth, we have a huge opportunity really to really formalize what's already happening in our community. And so so this recommendation and I've spoken with our library folks, I've spoken with the Arts Council.'",
        "'speaker_5': 'Griselda was here earlier. She sent an email. I think the clerk shared it with you. So this is an idea that I really want to see happen. I want to see a youth poet laureate program, you know, that that recognizes our youth, allows them to, you know, get showcased across the city for their art, be able to'",
        "'speaker_5': 'add that title to their resume as they grow up, potentially think about scholarships or stipends for them that helps them move and move them along. So I look forward to seeing what we can do with this idea. Thank you.'",
        "'speaker_1': 'Thank you. Vice managers.'",
        "'speaker_0': 'Echo to support a.'",
        "'speaker_1': 'Public comment on this.'",
        "'speaker_0': 'I just picked.'",
        "'speaker_1': 'Oh, I'm sorry. I'll go back to Councilman Pierce after the public comment. Go ahead.'",
        "'speaker_3': 'Okay. Thank you. Thank you so much. I live in Long Beach and my daughter's a poet, which means I drive her all over Los Angeles because they're more engaging. And her poetry at the age of ten took her to London, something I would never be able to afford myself.'",
        "'speaker_2': 'I'm a single mom also struggling.'",
        "'speaker_3': 'With where to live and, you know, working in Orange County. It's it's a big deal. But I want to let you know, this kid of mine, fifth grade was at the lowest and reading fluency the lowest. There was not a a slot.'",
        "'speaker_3': 'She could only get better. And with only three months of going to a nonprofit poetry Saturday class in L.A.. She passed the bar and exceeded reading fluency. So without further ado, I have the highlight of my daughter.'",
        "'speaker_7': 'Hi. I'm going to lower this a little bit.'",
        "'speaker_5': 'Let's give her a fresh three.'",
        "'speaker_7': 'Yeah, okay. Hi. My name is PHILIPPa. I'm in seventh grade and currently studying sustainable world studies. I don't know what the future holds for my generation or this planet with so many safe spaces lost. This poem I'm about to present reimagines Little The Little Mermaid in today's polluted waters.'",
        "'speaker_7': 'This poem is titled Mermaid Goddess. I shimmer like Hawaiian oceans speak every language of the sea. Lingua Heather. Sally Pavone. Tongue of salt and forgiveness. I've got gadgets and gizmos aplenty, sunken treasures of trumpets and pearls, a sacred coral necklace on the brink of extinction because of rising temperatures.'",
        "'speaker_7': 'I've got long, dark hair that goes past my shoulders, glows with sunkissed copper highlights.'",
        "'speaker_2': 'But remember.'",
        "'speaker_7': 'Mermaid hair don't care. Mermaids got bigger fish to fry. Mermaid goddesses know that climate change is real as our oceans spike a fever from the northeast Atlantic to the Western Pacific. Waves and worries increase kelp, forests dying, plankton poisoned, leaving nothing left to snack on.'",
        "'speaker_7': 'Don't underestimate bottom feeders for they are critical to life in the ocean. I've got who's it's and what is galore. 13 million tonnes of plastic cigaret.'",
        "'speaker_2': 'Butts polluting.'",
        "'speaker_7': 'Our waters shores blocking the airway of sea turtles bags 100 billion used per year. Choking our seals, whales and dolphins. Global warming gentrifying coral reefs no longer read like the tides of our demise. Mermaid goddesses don't care who you love as long as you're happy.'",
        "'speaker_7': 'Snails are well, starfish and starfish. All of them deserve to be loved. All of them endangered species. So much at stake with all that you take. My voice is 12 times stronger than the fake tan men who won't reduce greenhouse gas emissions.'",
        "'speaker_7': 'Mermaid goddesses don't lock my children in abandoned caves of the depths of the ocean. So. Did you get the mermaids? Be careful when you ride the waves of the future. Remember your beauty on the inside. Your compassion for the climate.'",
        "'speaker_2': 'Hope for your home.'",
        "'speaker_7': 'Have no fear of death as rising sea levels become the new normal. Little ones use your voice. Keep our home healthy. I've got gadgets and gizmos.'",
        "'speaker_2': 'A penny I've got whose? It's a what? Galore. You want to think about?'",
        "'speaker_7': 'I've got 20.'",
        "'speaker_2': 'Who cares? Yes. No big deal.'",
        "'speaker_3': 'I want more. Are.'",
        "'speaker_7': 'Please don't call me Little Mermaid. I'm like Ariel. I would never give up my voice for a man. Thank you.'",
        "'speaker_0': 'Dan. Oh, that's.'",
        "'speaker_1': 'Great. That was amazing. Very. Gosh, you're so talented. And I wanted to first say that that is my absolute favorite. One of my favorite songs of all time, but still my favorite Disney song ever. Composer written from The Little Mermaid part of Your World.'",
        "'speaker_1': 'And you did a great riff on taking that piece and making it something completely different on your own, and that was really special. So thank you and took a lot of energy to not like burst out on the mic and join you.'",
        "'speaker_1': 'So thank you. That was that was that was really, really wonderful. Let me go back to the council and thank you for that. That was that was that was amazing. Councilman Justin, you want to add to that or keep going to.'",
        "'speaker_5': 'Just one more one more thing. So April 25th, we have a thing called Pop Up Town. It's all this poetry themed that the Michelle Obama Library 530 April 25th will love for you to come out because we're doing a open mic spoken word situation in honor of National Poetry Month.'",
        "'speaker_5': 'Thank you. And then the last thing I will say is that by partner with our libraries, there's actually a really unique opportunity for these poets to get published early, which is incredibly huge for their career, to be able to be published at a young age for their career.'",
        "'speaker_0': 'And.'",
        "'speaker_5': 'Yeah, been there. Done that. Right.'",
        "'speaker_0': 'How many.'",
        "'speaker_5': 'More? Absolutely. And and thank you so much, Mom. Great job with your daughter.'",
        "'speaker_1': 'Vice Mayor Andrews.'",
        "'speaker_9': 'I can't say any more. I just wish you would have came on earlier because most of the people are now asleep. But you are great, I tell you.'",
        "'speaker_0': 'Thank you so.'",
        "'speaker_1': 'Much. Yeah. We're going to we're going to get you to do that piece again. I'm going to think about it. But that's that's a that's a great that was a great piece counts over a period.'",
        "'speaker_3': 'That was amazing. It's so wonderful to see young artists writing and performing their poetry, and it takes me back like we talk about poetry so often. But I grew up going to these like, you know, late nights all age places where you would do spoken word and drum circles.'",
        "'speaker_3': 'And that was where I fell in love with music, really. And so you just took me back to how wonderful that spaces. And so thank you for that. I too am going to figure out a place for you to do that.'",
        "'speaker_3': 'Poetry. There's a song that I want to tell you about. It's called The World on Fire. Have you heard the song? World On Fire by Louis the child. ASH And you will love it if you're studying that, but it's very poetic.'",
        "'speaker_3': 'But it's about our globalization and our world being on fire and people not noticing. But it reminded me of your comments. We have the main library that's under construction right now. And so I want to thank Councilmember Richardson for bringing this forward, allowing me to sign on to it.'",
        "'speaker_3': 'Anything we can do to uplift literacy and to bring that into our libraries and our community centers are welcome. And I think that at the beginning of every meeting before we do our Pledge of Allegiance or after, we should have a little poem.'",
        "'speaker_3': 'I'm just saying, it would really change the mood of our meetings.'",
        "'speaker_1': 'Thank you, Councilmember Kotsenburg Ringa.'",
        "'speaker_4': 'It would certainly mellow us out. I want to thank Councilmember Rich to for bringing this forward. But more importantly, that was so wonderful. So beautiful. Could I have a copy of that? Hello.'",
        "'speaker_0': 'Lou.'",
        "'speaker_4': 'Can I have a copy of that? I serve. I serve on the council. Commission and everything that you brought out, there are topics that we deal with on a monthly basis about pollution, the garbage patch, clean your beach, beach cleaning.'",
        "'speaker_4': 'And I'd love for you to give it to me so I could share it with my with my commissioners and perhaps get an opportunity for you to visit us. And one of the places that were located up and down the coast and be able to recite it.'",
        "'speaker_4': 'Okay. Thank you very much. And the most important thing I like about that, it was bilingual. And thank you, ma'am, for keeping your bilingual and and you stay with it.'",
        "'speaker_1': 'Councilman Gonzalez.'",
        "'speaker_7': 'You're so inspiring. I'm supposed to we're all supposed to inspire you, and you're inspiring us, especially as a young Latina. It's very exciting to see you in this capacity. I could never imagine myself. I used to write poems to my parents as Christmas gifts because I didn't have any money, clearly.'",
        "'speaker_7': 'But this is a real gift for all of us. And I know that there's a lot of things that we're thinking about in terms of where you could speak your art. And I know, you know, Earth Day events.'",
        "'speaker_7': 'We have one coming up and I know you'll probably be pulled in a million different directions. But I just want to say keep your art, keep it going. And Amazing Daughter means amazing mother as well. And thank you, Councilmember Rex Richardson, for bringing this forward.'",
        "'speaker_7': 'This is one of the best items I think you've brought forward. Thank you.'",
        "'speaker_3': 'So with that being actually actually.'",
        "'speaker_1': 'Thank you. Thank you, ma'am. We have to continue on our meeting, but thank you very much. Okay. We have the item. There's a motion in a second. We did have a comment, so please cast your votes.'",
        "'speaker_0': 'Yes. Yes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Great job. Excellent. And next up is item 13.'"
    ],
    "Resolution to Approve Road Maintenance and Rehabilitation Projects for FY 2020. ": [
        "'speaker_2': 'Are you a yes. This motion carries. Item 17. Report from Public Works. Recommendation to adopt a resolution to approve 14 repaving resurfacing projects proposed to receive Road Maintenance and Rehabilitation Account Fund Account Act funds funding totaling approximately 8 million for fiscal year 2020 citywide.'",
        "'speaker_1': 'There's a motion in a second. Is there anything you want to add, Mr. Beck, to this? Mr. Beck is not there.'",
        "'speaker_8': 'So Mr. Pappas or Diego.'",
        "'speaker_0': 'Very.'",
        "'speaker_6': 'We're available to answer any questions.'",
        "'speaker_0': 'For the country.'",
        "'speaker_1': 'Okay. Any public comment on this item? Seeing none.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'One, one, one. Commenter. Good. You since 1970. Sorry.'",
        "'speaker_0': 'Could you excuse the address? I have.'",
        "'speaker_8': 'My comments have been engendered by.'",
        "'speaker_6': 'Talking to the city traffic.'",
        "'speaker_1': 'Engineer.'",
        "'speaker_0': 'Over.'",
        "'speaker_6': 'The last few weeks. Relative to what we're experiencing, the city is experiencing at PCH and second, in trying to move traffic through areas.'",
        "'speaker_9': 'That are going through.'",
        "'speaker_6': 'Re pavement, which is what's going to happen here. And also we're experiencing up and down Long Beach Boulevard and many other places because of the.'",
        "'speaker_0': 'Blue line tobacco and have come up with this and.'",
        "'speaker_1': 'This.'",
        "'speaker_8': 'Thought.'",
        "'speaker_6': 'What we could do.'",
        "'speaker_1': 'Sir, it's amazing.'",
        "'speaker_6': 'Is have Mayor Garcia, we will get a Caltrans uniform for him. And with the approval of the residents of the various different areas where this is going to take place, he could flag, he could stand at the intersection.'",
        "'speaker_6': 'And hold up traffic, let it go depending upon what the need for. And I think we could make an arrangement with the U.S. Justice Department that for every hour he would spend there, they would take every full day he would be one of the intersections, whether it be a PCH in second or any other area in the'",
        "'speaker_6': 'city where he would be doing that. They would give him if he's to be there for the full 8 hours, they would take one hour off his pending prison sentence, which he will start serving at this juncture, based upon what the U.S. Justice Department tells me will probably be a little under six months, six years away.'",
        "'speaker_6': 'So that's something to consider.'",
        "'speaker_0': 'I mean, thank you.'",
        "'speaker_1': 'Councilman Price, if she's going to give me parole advice when I'm up for parole and can.'",
        "'speaker_0': 'Visit me on.'",
        "'speaker_7': 'The.'",
        "'speaker_1': 'Job training, I'm going to do I'm going to join a union. I run out. I'm ready to go. IBEW Local 11 Let's see what else? What are we waiting on?'",
        "'speaker_0': 'So yeah, those.'"
    ]
}