{
    "Reward for Information on Murders of Poe, Williams, and Torres.": [
        "'speaker_2': 'But we are close to 630 as possible. So let's will begin and go through the rest of the agenda as we move forward. So we're going to hear item 20. Third 23, please first.'",
        "'speaker_0': 'Item 23 A Communication from Mayor Garcia. Recommendation to approve the expenditure of 15,000 and the General Fund group as a reward for information to solve the murders of Maurice Poe, Junior, Melvin Williams, the Second and Ricardo Torres on October 29, 2019.'",
        "'speaker_2': 'Thank you. We are at the last council meeting. I know we had a strong moment of silence and remembrance for these individuals who lost their lives on October the 29th. We've, of course, know that the Long Beach Police Department is working incredibly hard with all of our resources into ensuring that we that we solve and bring justice'",
        "'speaker_2': 'to the families and to all those involved. On the horrific tragedy and shooting that occurred on October the 29th. I'm asking the council to to match and working with the county board of Supervisors the $15,000 that they are putting in to that, we have a total of $30,000 that that is set aside into a fund to reward'",
        "'speaker_2': 'anyone with information to solve the murders of Marist Poll Melvin Williams and Ricardo Torres. The Board of Supervisors is also taking action or just took action today. And so that will that fund will be, of course, as worked an administrator through our Long Beach Police Department.'",
        "'speaker_2': 'And this was also at their request. And so they have been working with the board and with our office to get this in front of all of you. And so with that, there's a motion and a second if you're going to do a public comment on this.'",
        "'speaker_2': 'Councilmember Pierce. Councilwoman Price members, please cast your votes.'"
    ],
    "Ordinance for Ballot Measure on Transient Occupancy Tax Increase.": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. Now we're going to be moving on to item 11, which is the transit occupancy tax item.'",
        "'speaker_0': 'Communication for Mayor Garcia recommendation requests City Attorney to prepare an ordinance establishing a permanent increase of the transient occupancy tax at the rate of 1% to be placed on the ballot on the March 3rd, 2020 municipal election.'",
        "'speaker_2': 'Thank you. Well, I want to I want to first thank everyone for being here. I know that we have a a group of folks here to to speak and to support this this measure. And I want to thank all the work that's gone into this item up until today.'",
        "'speaker_2': 'We do have a presentation from staff that's going to begin in just a few minutes. But I want to just say a few broader comments, and then I'm going to turn this over to our acting city manager, Mr. Modica.'",
        "'speaker_2': 'We all know that that arts and culture is incredibly important, not just to our economy here in Long Beach, but to the life of cities in general. Cities and great cities across the world and across the country have a thriving arts and thriving culture.'",
        "'speaker_2': 'We also know, and I think, that this council should be very proud that over the last few years there has been a focus and a commitment to the arts and to our tourism economy, which I'm going to speak to in just a minute.'",
        "'speaker_2': 'When you look at the arts as our as an institution and as activity that happens across our community, the city has been very committed to to our arts programs. We know that museum for our Long Beach Museum of Art, which houses art the city's art collection, has increased over the last few years thanks to the work of'",
        "'speaker_2': 'the Council and the commitment of the community. We know that we've been working with the Museum of Latin American Art to ensure that their facilities and masterplan continues to grow. And that's something this council did through its budget process.'",
        "'speaker_2': 'We funded permanently programs like POW Wow, which has brought over 100 murals across the city to really create an outdoor gallery of pieces and incredible artwork and murals. And most significantly, the council, just about a year and a half, two years ago adopted a new 1% for the arts program on public construction projects.'",
        "'speaker_2': 'That helps bring additional funding to our arts organizations. Last year alone, that 1% for the arts brought in about $218,000 for additional programing through the Arts Council and through the work that they do as well as are major arts organizations.'",
        "'speaker_2': 'But as we discussed then and as we know now. For our for our arts institutions to succeed, there has to be public investment. The truth is, is that we shouldn't look at the arts as a private enterprise. And art should not be expected to turn a profit to succeed or to maintain themselves.'",
        "'speaker_2': 'The arts are what we call what we know as the public good and all programs that that all programs and folks that are that work towards the public good know that there has to be government and public investment for those organizations to succeed.'",
        "'speaker_2': 'The truth is that funding for the arts across the country is viewed and invested through this public good lens. And it's something that we've done in Long Beach, but also that's something that we can do better or we know at the same time beyond having this investment in the arts, which is critical.'",
        "'speaker_2': 'We also are driven by our tourism economy, and most of that economic output and input comes through in and out of our amazing hotels that we have across the city, but also the convention center, our convention center, our Terrace Theater, the Beverly O'Neill Theater not just housed these great performances, but are bringing in hundreds of thousands of'",
        "'speaker_2': 'tourists, visitors, people that that book, hotels that fill our restaurants, that shop in our small businesses and make our city run. The tourism economy is an enormous part of the overall Long Beach economy, and we're very grateful to the work that the CVB does that the board works on.'",
        "'speaker_2': 'Of course, under the leadership of Steve, Steve Goodling and the entire board, the convention center and our tourism economy is also critical. Over the last couple of years, we've been having discussions, myself with Mr. Goodling, the art leaders of our arts organizations, about how we can provide more stable and long term funding for not just the arts'",
        "'speaker_2': ', but for the convention center as well. What we have in front of us tonight, which Mr. Modica will present in a minute, is a transformational opportunity to support the arts and tourism in Long Beach in a way that we probably have not been able to do in decades.'",
        "'speaker_2': 'And so this is an important presentation. I'm very thankful that so many art patrons are here tonight to support this proposal. And I want to turn this over to Mr. Modica to kind of describe the proposal we have in front of us.'",
        "'speaker_6': 'Thank you, Mr. Mayor. I think the mayor laid out the framework pretty well for the case of why we're here tonight. And I wanted to walk through some of the details. So the culmination of all those efforts the mayor talked about really ended in October 22nd when we received a letter that went to the mayor and city'",
        "'speaker_6': 'council and a number of other entities from the LBE CVB, their hotels, and our major arts organizations really outlining that need for a stable source of financial support for the arts and for the convention center. And in that letter, it was requested that we consider a 1% increase in the total, which is the transient occupancy tax, which'",
        "'speaker_6': 'is also known as the hotel bed tax. And we'll talk a little bit about how that works in a second. And really the concept behind it is to provide funding for student arts education programs, community arts, cultural programs, local museums and theaters, convention and entertainment center.'",
        "'speaker_6': 'And that was the request from the groups. And so what is a transit occupancy tax? It's essentially the bait, the bed tax. It is for any occupancy of a guest room in a hotel, a motel in or a short term rental like an Airbnb or a Vibro.'",
        "'speaker_6': 'Anything less than 30 days is essentially in our ordinance what is counted under a transient occupancy tax. It is not paid by Long Beach residents unless they are using those facilities as a guest. So if you were to go rent a hotel room, you as a city resident would pay it.'",
        "'speaker_6': 'Otherwise you are not paying that tax. Essentially it is it is collected by the operator and remitted to the city. And our rate right now is 12%. 6% is a rate that goes to the general fund, and 6% is the rate that goes to what is called the Special Advertising and Promotions Fund.'",
        "'speaker_6': 'And that's the fund that is dedicated to advertising, promoting the city public relations and special events that cause that call positive attention to the city of Long Beach. So what would a 1% total mean? Essentially, the the proposal here is to increase the general fund portion of the total to go from 6% to 7%.'",
        "'speaker_6': 'So a 1% increase. And what that means in terms of dollars to a visitor renting a room, it's about a dollar 80 to $2 more per night. Even though that's a very small amount to the individual paying paying that tax, it actually does add up because we do have a lot of people staying in our hotels.'",
        "'speaker_6': 'And so that would be approximately $2.8 million annually that would be available to be able to allocate to two programs. That number will go up and down to what is a revenue source that fluctuates. But right now, we're estimating it at $2.8 million.'",
        "'speaker_6': 'So how do we compare to other cities? This is a chart that we wanted to provide the council to show that cities charge different rates and they charge them in different ways. So there's something called the top, which is what we were talking about, the transient occupancy tax.'",
        "'speaker_6': 'It ranges from about 10%, up to 15% in Anaheim, and we are currently at 12%. We also have and other cities do as well a business improvement district where the hotels actually tax themselves. It's a voluntary tax that they come together and assess themselves that they use to promote tourism.'",
        "'speaker_6': 'In Long Beach and in Long Beach, that is 3%. In some cities, it's they don't have it at all. In some cities like Huntington Beach, it goes as high as 4%. And so when you add those two together, you have a total tax.'",
        "'speaker_6': 'Anywhere from 10 to 17%. And in Long Beach, it's 15. A couple of other cities do things differently. They don't assess a percent. For example, in San Francisco, it's a nightly fee of $2.25, which then adds to their 14%.'",
        "'speaker_6': 'And in San Jose, it's also a nightly fee of $2.50. And so the measure in front of you would put us at about 16% if if that were brought to the voters and approved, we would be at 16.'",
        "'speaker_6': 'And how does that compare to a city of Los Angeles? Well, different cities actually charge different amounts for their hotels. And so on average, we are still about $100 less per night than rooms in the city of Los Angeles when you consider the entire cost of the room and the taxes that are associated with it.'",
        "'speaker_6': 'And so arts and culture, I think I think the mayor did a good job, a really good job of going through the key components of why arts and culture are important to cities. They are critical for our quality of life and to our identity and well-being.'",
        "'speaker_6': 'They also have a direct partnership with tourism and our conventions. And people like to come to cities where there's a lot going on and there's a rich arts culture. And as the city grows, which we are. The arts need to grow.'",
        "'speaker_6': 'And, you know, great arts make cities greater. And so, you know, there is a lot of benefit to having, you know, wonderful arts communities in Long Beach and and to do even more, although right now we do not have any fiscal resources, really, for growing that commitment.'",
        "'speaker_6': 'Do you want to take some time to talk about the convention center? The convention center is a wonderful asset in Long Beach. It brings a lot of business. It brings a lot of people in. But it also is an aging facility built in the sixties and seventies.'",
        "'speaker_6': 'It needs to be modernized to really support the range of arts that are possible in our in our artistic climate, as well as the other things that really bring in revenue to the city. We want to become we are a preferred destination for many organizations, but really they keep coming because we provide that first level, first class'",
        "'speaker_6': 'level experience and we want to continue that. So we recently done some study out of the convention center. We have been maintaining it and putting in dollars, but it is below what we need to be doing to bring it up to a level that, you know, that is sufficient.'",
        "'speaker_6': 'We have today over $50 million in critical needs at the facility. And that's really just the bare bones, not even the things that that bring in additional business. So there is clearly a need there. And what you're being asked to look at tonight is also what's called a fiscal emergency declaration.'",
        "'speaker_6': 'This is very similar to what we did under a measure. And these numbers you've seen before. This is to really point out that the city does not have additional resources to invest in this area or even to invest in our basic infrastructure or other basic services.'",
        "'speaker_6': 'We are looking at shortfalls over the next coming years and do not expect that there is going to be room for enhancements. And so Proposition 218 requires that new and increased taxes and extensions voted on at a regular general election of the city unless the council adopts a finding of emergency by unanimous vote.'",
        "'speaker_6': 'And so that is what is before you tonight is to have that declaration of a fiscal emergency or at least give direction to the council or to the attorney to come back with that next week so that this can be considered in March 2020.'",
        "'speaker_6': 'Staff supports that. So the sooner these are in front of the voters, the sooner you're going to have clarity of whether the voters want to do this. And that helps us prepare for our and prepare for the next budget.'",
        "'speaker_6': 'And so next steps, if you give us direction tonight, we would be returning to the council on November 19th. There'll be a supplemental item to be able to get this in front of you next meeting because there is an upcoming deadline.'",
        "'speaker_6': 'The county's deadline is December six, 2019, where all of the documents and everything has to be together. And so we think it's prudent to bring it back on the 19th to make sure we don't miss any deadlines. And then if it's the emergency declared, it would be on the March 3rd ballot.'",
        "'speaker_6': 'And again, I want to reiterate that the council doesn't make decisions about whether or not the total gets increased or not. You would just be putting that on the ballot and it would be voters that are deciding whether or not to increase the tax.'",
        "'speaker_6': 'And with that, we are available to answer questions.'",
        "'speaker_2': 'Thank you, Mr. Monaco. Great presentation. I want to just, you know, highlight the points I think are really are really critical. The first is that what we're talking about is essentially a increase that is not paid for by Long Beach residents and is actually not even paid for by the hotel itself.'",
        "'speaker_2': 'It is an added fee that get passed essentially to the person purchasing the night stay at the hotel across the city. In addition to that, we are on average already, even with this increase, $100 less than the average hotel room in the city of Los Angeles.'",
        "'speaker_2': 'And even with the total increase, we would be still 1% less than who we consider our nearest competitor, which is the city of Anaheim. So we are not in any way going beyond where our our our competitive level.'",
        "'speaker_2': 'Is it also as as is as we plan for the future, we know that we have approximately 600 hotel rooms that will be coming online in the next few years. And so the generation from this total will increase for our arts organizations.'",
        "'speaker_2': 'And I want to share also that at some point in the future, this Council will have an opportunity to actually have a discussion around how we structure the top. And as far as the funding mechanism. So that is not a discussion per se for tonight, but we will have that opportunity if the voters choose to implement this'",
        "'speaker_2': '. But I want to just give you an idea of the impact. I know that Karen, for example, is here from A.C.T., which is an incredible professional theater company we have here in Long Beach. Just as an example, I'm at at her very best year, at her very best year, the city of Long Beach, I think it was'",
        "'speaker_2': 'one year was able to give her because of some redevelopment money and other funds, I believe it was a $100,000 master grant. And that was maybe 15 years ago or so that that happened. A proposal like this would have the capacity for Karen to receive that amount of money annually.'",
        "'speaker_2': 'That is transformational for an organization like ICG. If you're an organization like the museum, to be able to count on this type of stable funding, to bring in the type of shows and and support the kind of youth programs that it wants to do is also transformational.'",
        "'speaker_2': 'And I would add that goes on and on. I see friends here from musical theater West and Paul and I know you talk to me about the impact that this would have on your on your youth programs and so many others.'",
        "'speaker_2': 'And in addition to that, I want to, before I turn this over, is really commend the CVB and the leaders in the hotel industry that stepped up and said and could have said, we would like you to increase the 1% and it all go back into the convention center.'",
        "'speaker_2': 'But we we but we know how important the arts and culture is. And so we would like half of those funds to go directly back into the arts groups because of the work they do, in turn will end up enriching the city and therefore benefiting all of us in the end.'",
        "'speaker_2': 'And so I just want to thank to Steve and Imran and the board. Just thank you for for that leadership and and that ability to be inclusive within our arts community. And so with that. Before I cut someone fresh, join me do public comment versus do you want to go first.'",
        "'speaker_2': 'Why don't we do public comment? And then I'm gonna turn this over to Councilman Price. So I'm going to begin. And when I call your name, there's we're going to go in this order. We're going to start with Ron Nelson, then Madison Mooney, then Mujahid Kim, and then Imran Ahmet will be the first four.'",
        "'speaker_2': 'So, Mr. Nelson, you're up first. And if the other speakers could line up behind please, Madison, Mooney and Nguyen Kim and Imran on that.'",
        "'speaker_4': 'Thank you, Mayor. Thank you, city council members. This is a transformational moment for the city, for the arts and the arts in the city continue to grow, but they're growing at a rate that is very exciting, but they're also growing at a rate that they really can't afford to keep up with, with all of our the nonprofit'",
        "'speaker_4': 'management throughout the city and that run most of our arts organizations, it's always challenging. And for us at the museum, it brings in it enables us to go in larger, greater exhibitions, number one. But number two, I also sit on the board of the California Veterans or the CVB, and knowing what the cultural tourism is and the'",
        "'speaker_4': 'impact it has on the city is rewarding to see it happen, but also an affirmation that it's happening and it's there and we just need to be able to support that and support that for all of the organizations that are here tonight and how many are here tonight, if everybody could stand from the arts.'",
        "'speaker_4': 'And this happens. Throughout throughout the throughout the year and throughout the day. What we bring back to the economy is big. What this brings to Long Beach, I think is even more significant. So I think in advance, this is definitely thinking ahead and it is forward in thought.'",
        "'speaker_4': 'And and quite frankly, we're all very grateful for this to go through. Thank you.'",
        "'speaker_2': 'Thank you very much, Mr. Nelson. Madison money.'",
        "'speaker_1': 'Good evening, everyone. My name is Madison Mooney. I'm the executive director at the Long Beach Playhouse. Your local community theater over in the fourth District. And we are in the midst of our 90th anniversary year. As an arts enthusiast, administrator, performer and patron, I am in full support of adding this measure onto the ballot of Long Beach'",
        "'speaker_1': 'residents. Dedicated funding for the arts and the Convention Center will do so much for the population that we serve in Long Beach and those visiting us from outside our city limits. With funding from this dot increase, the Playhouse wants to expand our youth arts education efforts from only having a summer camp to year round classes and workshops'",
        "'speaker_1': 'for children and teens of all levels. And just like the Convention Center, the Playhouse, the building itself needs a little bit of TLC. And with this funding, we would update and better our facilities to make our community members visit with us much more a much more enjoyable experience and providing a space for the arts across town on'",
        "'speaker_1': 'the east side of Long Beach. And as a long art standing, long standing arts organization, we know that attendance and donations can ebb and flow depending on so many different factors. So having dedicated funding can make everything run so much smoother.'",
        "'speaker_1': 'I, along with my staff and board of directors, hope this measure can be passed tonight and take the next step in securing a brighter future for Long Beach Arts. Thank you.'",
        "'speaker_2': 'Thank you so much. We thank you.'",
        "'speaker_4': 'Between Garcia and council members. My name is Nguyen Kim, a general manager of the Long Beach Airport. It is my privilege and pleasure to be here tonight and make a public comment. I support 1% tax increase in transit and occupancy tax for a couple of reasons.'",
        "'speaker_4': 'The first, it is for the infrastructure need at the Convention Center. We really need to keep our convention center to staying competitive so that it can bring more tourism and convention business to the city. For the second reason, it is to support arts groups in the city so that more members of the community could have access to'",
        "'speaker_4': 'everything they offer. It will eventually improve the quality of life of the people within our city. A hotel doing business in the city of Long Beach. As a corporate citizen, I strongly believe it is our responsibility to return for a cause greater than just the hotel ourselves.'",
        "'speaker_4': 'I'm not saying it does not have any impacts on the hotels. It may have, but I know for sure it is a something we can afford for a great cause for the community and the members of community. Thank you.'",
        "'speaker_4': 'Thank you very much. Good evening, honorary mayor and the council member, Michael.'",
        "'speaker_6': 'Good evening.'",
        "'speaker_4': 'My name is Imran Ahmed. I'm the general manager of.'",
        "'speaker_6': 'The Long Beach Marriott and I also chaired the Long Beach Conventions and.'",
        "'speaker_4': 'Visitors Bureau. And with this 1% increase, we are 100% less fortunate because as we all have said.'",
        "'speaker_6': 'And, you know, I may sound like.'",
        "'speaker_4': 'A broken record, but it is very important for any city to grow, and especially our city, because we we take pride on our conventions and the business that we bring in. And we all the hotels benefit out of it.'",
        "'speaker_4': 'In addition. All major cities in the in the world, as you have said, honorable mayor that are known for their arts and and their culture. When we talk about London, when we talk about New York or we talk about other cities, our cities, our city has that.'",
        "'speaker_6': 'We just have to support it. And we appreciate your support. Thank you.'",
        "'speaker_2': 'And that speakers are time limits Karen Desai, Chin Patel and Daniel Luna. In that order, please talk of limits can decide. Chin Patel and Daniel Luna.'",
        "'speaker_4': 'Afternoon, Mayor. Members of the council. I'm Todd. I am a member of the board of Directors of the Convention Visitors Bureau, as well as one of the owners of the Breakers Hotel. And the Breakers.'",
        "'speaker_6': 'Will be the only hotel in Long Beach. Will have a live jazz club when we open.'",
        "'speaker_4': 'I'm the resident musician for our company.'",
        "'speaker_6': 'And I have been asked by my partners to come.'",
        "'speaker_4': 'Give our full throated support to this measure. The Convention and Visitors Bureau to the Convention Center really could use the money and visual arts. Theater and music are an absolutely necessary and indispensable part of our society. I'm also the parent of three local Long Beach musicians.'",
        "'speaker_6': 'Do it poorly when.'",
        "'speaker_4': 'It ROGERS And we can't support this enough. And we're we're thrilled to give our support. Thank you.'",
        "'speaker_2': 'Very much. Karen Desai.'",
        "'speaker_1': 'Good evening, honorable mayor and city council members. I'm Karen Deci, artistic director and producer of International City Theater, a dollar 80. A dollar 80 seems pretty inconsequential when you look at the return on investment and the impact you have upon the chance to make on the arts and on this community.'",
        "'speaker_1': 'And I can tell you from. Personal experience because I want to share some quotes with you because we produce five main stage productions annually. It gives us a chance to bring our diverse community together under one roof to better understand our shared humanity.'",
        "'speaker_1': 'We do six education programs that reach every district and every demographic. From age 4 to 104. We had a young man, 15 years old, view a production through our students two stage program. And he wrote on the survey.'",
        "'speaker_1': 'I found something inside myself that I didn't know existed. What a poignant, insightful discovery that young man made. One of our seniors for the low income senior program that we do that provides tickets and transportation to get them out of their homes, to keep them mentally and socially engaged.'",
        "'speaker_1': 'She wrote such a poignant comment about what the program did for her. She said. Forget problems, feel alive. You have an opportunity to continue that impact and grow it. Thank you so very much.'",
        "'speaker_2': 'Thank you so much. Can you tell?'",
        "'speaker_4': 'Hmm. You're gonna see our Long Beach City Council members, senior representative and give. First of all, I want to thank you for giving me the opportunity to address you. I want to be brief. I'm here today to speak about the organizational on which they had to transform the lives of many low income students, particularly on the migrant'",
        "'speaker_4': 'education program of Long Beach United School District, where I'm a parent representative, which Angelica has been very kind, generous to, invited many of the families in our program to attend several beautiful concerts during the last three years. This is a very cross my heart, because many years ago I was walking with them, my son in the ocean'",
        "'speaker_4': '. He asked me that What is that place? The Long Beach Committee said that, I told him, is a theater where they have chosen music. He asked me, Can you go there? And I say, no. I'm sure that tickets are expensive and you can afford it many years later.'",
        "'speaker_4': 'Part of the Mega Kitchen Program. What is your own invitation to go to a music Angelika concert for free? I couldn't believe it. The concert was incredible. It finally attended an event inside the convention center with my family.'",
        "'speaker_4': 'Many of us cannot even dream of attending this type of concert because of food. Because food and shelter take priority in our lives. But music and just comics makes possible. Our children love to put their best outfits and attend this special concert concert.'",
        "'speaker_4': 'I want to recognize missing Angelica to their generosity and inspiring my students to themselves as visions. If I was a family of four children in our program, who decided to become musicians in a sense of thank you very much.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_2': 'Thank you very much. Next three speaker Daniel Luna, Dr. Felton Williams and Kelly Lucero. And then we have one more speaker after that. Two more after that. So next up is Daniel Luna. Dr. Felton Williams. Dr. Williams. Come on up.'",
        "'speaker_4': 'Good evening. Honorable Mayor Robert Garcia, members of the city council staff. I'm Felton Williams here as a committee member for the African-American Cultural Center of Long Beach. We are in favor of the tax as a beginning organization in the city of Long Beach.'",
        "'speaker_4': 'And just a little bit about the African-American cultural center, the city.'",
        "'speaker_6': 'The is to create opportunities for open dialog regarding issues of race and culture that will translate into.'",
        "'speaker_4': 'Building a more cohesive and enduring city and nation.'",
        "'speaker_6': 'As I stated, we are developing organization. We are we are in need of financial support as a developing organization. And again, we do support the tax. And I have my colleague here, Tasha, that's going to also say a few words.'",
        "'speaker_1': 'Thank you for bringing this forward. And we do support this and we just ask that there is an equitable process when the time comes and inclusionary process. Thank you.'",
        "'speaker_2': 'Absolutely. Thank you very much. Kelly Europe.'",
        "'speaker_1': 'Good evening, everyone. I'm Kelly Lucero. I'm president of the Long Beach Symphony and a proud 32 year resident of the city of Long Beach. I know you all understand the importance of great arts in our great city, but I'm not sure you understand how precarious our funding is.'",
        "'speaker_1': 'I run one of the largest arts organizations with a budget of $3.2 million. Two thirds of our budget it funds people union musicians, vendors, staff, yes, artists. And about 10% of our budget funds, free programs in the community.'",
        "'speaker_1': 'We're proud of that. Until economic uncertainty hits like it did last spring, which jeopardizes our ability to make payroll, we had to scramble and end in the black with a $9,000 surplus. $9,000 and a $3.2 million budget is a very tight margin.'",
        "'speaker_1': 'And actually, thanks to the 1% of the arts, we were able to do it. I want to thank the CVB, the CVB board and Steve Goodling for presenting a creative solution. The funding would be transformative for all of us.'",
        "'speaker_1': 'Instead of panicking on a day to day basis about making payroll, we would be able to take that time and energy and resources and further invest it into this great community by providing more free programs for all demographics in our in our community.'",
        "'speaker_1': 'In our community. Funding would be reinvested into our venues, which is critical and will ensure that diversity and culture inclusion plans for our Native American populations and every other population gets a free, wonderful quality of life experience. Thank you so much for considering.'",
        "'speaker_2': 'Thank you so much. And then if I can have a last three speakers come up. That's Gary Sheldon and Cantrell and Larry Goodhue. Please come forward. Miss Cantrell, since you're right here, you can come forward. Not very good here so just can't control.'",
        "'speaker_2': 'And Gary Shilton.'",
        "'speaker_1': 'Good evening and Cantrell. And I am certainly in favor of this hotel tax being put on the ballot. I'm wondering if there are going to be restrictions on this money. All it says in your item on in the agenda is that the money will be remitted to the city of Long Beach.'",
        "'speaker_1': 'And I'm wondering if when you put this on the ballot, it's going to be restricted to the arts, culture, the convention center. If that's the case, then I would be totally for it. I'm not surprised that one of the partners from The Breakers is in favor of this, since you have allowed the Breakers to keep 80% of'",
        "'speaker_1': 'their. Jyoti, I believe it was for eight years. And if this is raised, they'll be able to keep a lot of this money that should have gone to the city. Thank you.'",
        "'speaker_2': 'Thank you very much. Next speaker, is.'",
        "'speaker_4': 'There something we can point?'",
        "'speaker_6': 'Good evening, Mayor. Council and staff. Well, I'm kind of settling in. If you can turn to the second page of the the mayor's document, the agenda item document, and look at the 2.8 million here in the last paragraph.'",
        "'speaker_6': 'Maybe circle that or something. That's that's where I'm going with my thoughts. There's nothing I would like to vote for any more than this next March. It's an exciting opportunity for the arts in Long Beach. But the reason I wanted to point out that $2.8 million was I understand that that's what this 1% generate in additional I'",
        "'speaker_6': 'guess, additional revenue. It says additional revenue. That would cause me to think that the other 12% that that amount of money is what rendered this $2.8 million figure. If I do the math correctly on this, that would suggest to me that the current total is running at about $35 million a year.'",
        "'speaker_6': 'And the last I checked, I don't remember it being quite that high. So I wondered if in your questioning, in your or your or your speaking with the staff on this, you might double check that. But then even more surprising to me was the staff report from the interim city manager suggested that that's all that 2.8 is'",
        "'speaker_6': 'all going to the CVB side, which would suggest that the current total is generating about $75 million a year. So just my way of looking at the idea of the disconnect there in the numbers and before I go to vote for it, I'd like to.'",
        "'speaker_4': 'Know a little more precisely what I'm voting on.'",
        "'speaker_2': 'Thank you so much. Thank you. You bet. That concludes public comment on the item. So appreciate everyone's public comment. Let me turn this back over to the city council and Councilwoman Price. There's a motion and a second, Councilman Price.'",
        "'speaker_9': 'Thank you, Mr. Mayor, and thank you very much for bringing this forward, and thank you to all of the supporters of this item who are here. I'm going to be wholeheartedly in support of putting that on the ballot.'",
        "'speaker_9': 'But also, once we move forward, I will be very actively supporting it and urging my community to do so as well. And the reason for that is as follows. As as a mother of two children who have been through the Long Beach Unified School District's arts programing.'",
        "'speaker_9': 'I am very well aware of that. But for the organizations that we have in the city that provide arts, outreach and education, many students would never have exposure to arts and education. Certainly they would not have exposure to the wide variety of arts and education that they get exposure to now.'",
        "'speaker_9': 'They visit so many different sites and get to see different forms of art, whether it's through museums, including our ranchos that they get exposure to, to, to just visual arts and music, arts and theater arts and all the different arts that they get exposed to.'",
        "'speaker_9': 'They would many of these students would never have the opportunity to be exposed to the arts, but for these outreach and education programs. So that's the key reason that I'm going to be supporting this item not just tonight, but for as long as I can and have the opportunity to do so.'",
        "'speaker_9': 'A lot of these organizations have been sustained year after year through the work of volunteers serving on nonprofit boards. And as someone who has been involved, you know, in behind the back stage, trying to raise money for these programs to continue to thrive.'",
        "'speaker_9': 'I can tell you it is incredibly challenging, especially with competing interests, hard economic times and just the vast number of operational, administrative things that are required for volunteers to be able to help raise funds for school, public education and arts programing.'",
        "'speaker_9': 'Many of the the individuals who serve on these nonprofit arts boards, obviously, they're residents throughout the city and within the region. But in looking at the lists, as I've been doing over the past few weeks, I noted that several of them, you know, live in my district.'",
        "'speaker_9': 'And there are people that I see day in and day out, and they serve on multiple boards as volunteers. And their only mission is to try to help find a way to bring art education into schools. The work that they do is just unbelievable.'",
        "'speaker_9': 'And in my opinion, it cannot be sustained in a city of our size with the demand and the growth that we're seeing in arts and and diversity in our city. They cannot be sustained with nonprofit support of fundraising.'",
        "'speaker_9': 'We need to have some city dollars that help support and sustain our arts organizations. The other area that I want to touch upon is our our conventions and visitors bureau. And I know, Steve, we've we've talked about it.'",
        "'speaker_9': 'His name comes up a lot. Steve Goodling is really a visionary and has taken us to another level in terms of our ability to recruit and attract visitors and conventions to the city of Long Beach. Enough cannot be said in words to highlight and underscore the work that he does.'",
        "'speaker_9': 'And I know that I've had several conversations with him over the last year, year and a half, about the fact that the convention center, in order to continue to be marketable and of interest to all those who are looking at competing facilities, has to maintain a certain look and it has to maintain a certain condition.'",
        "'speaker_9': 'And unfortunately, the city is no longer in a place where it can keep up with the demands of the convention center, especially not through our very limited Tidelands Fund. And that's a conflict that we've had for years now, where the resources that are needed for us to maintain operations and infrastructure in the Tidelands area continue to increase'",
        "'speaker_9': 'while our general fund dollars for those areas continues to decrease. And so we're not able to support the convention center in the way that we have in the past or the way that it should be supported. So this is a very creative solution.'",
        "'speaker_9': 'And I thank Steve Goodling and I thank our mayor for being creative and thinking outside the box. And again, I wholeheartedly support this. It's something that we frankly need to do. And it is not fair to expect. Art enthusiasts who sign up to volunteer to help promote the arts have to produce the type of budget that it'",
        "'speaker_9': 'requires to touch every Long Beach Unified School District student, which are in the thousands. They need help and we can help them. So thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilmember Pierce.'",
        "'speaker_5': 'Thank you. I wholeheartedly also support the step to put this on the ballot. The second district, obviously, we have the convention center. We have our small park, it park, our arts park. We have artists that live in unique housing.'",
        "'speaker_5': 'And so obviously for me, the second district is a place that will benefit greatly from having some dedicated funds for the arts. I know through the years we've talked a lot about investment in our downtown, we've talked about investment in the convention center and echoed the same comments that Councilwoman Pryce said.'",
        "'speaker_5': 'It often comes down to that budget season where, you know, is it is it pipes and infrastructure that we can't see that none of us think is exciting to fund? Or is it that exciting concession stand? And so I want to applaud you guys for coming forward with some ideas.'",
        "'speaker_5': 'I applaud the mayor for bringing this forward so quickly. I know it's been an idea for a long time. There are a couple comments that I wanted to make just about the the depth of our art community. Earlier, we we recognized someone that's been doing a lot of work with Art Selby, which is a very small grassroots'",
        "'speaker_5': 'organization that that has done a mental health work in the second District. We've got our Arts Council, which funds individual artists. Maybe it's our very first time ever receiving a dollar to do art. And we've got the Symphony and Long Beach Opera that really can talk about global issues, whether it's racism, whether it's classism, whether it's it's'",
        "'speaker_5': 'just sharing grief stories. And so it's a really great city to have arts, and I totally look forward to funding this. I want to say that I hope when it comes time that we are talking about equity. And the city came out with our equity toolkit very recently, a couple weeks ago.'",
        "'speaker_5': 'And so when that time comes, I hope that we can have a genuine discussion around how we ensure that the funds have that lens as we have that discussion. I have a couple facts that I just wanted to share.'",
        "'speaker_5': 'I know everybody's kind of already mentioned it, but our arts and culture organizations, they drive our tourism, they retain local dollars, they attract new dollars not only to our main streets, but to our downtowns and to our schools.'",
        "'speaker_5': 'As a mother of a seven year old, I'm constantly trying to think about how she can exceed expectations in the classroom and when she's playing with her friends. I looked up some interesting statistics today. Youth who consistently participate in arts programs are four times more likely to receive academic achievement, three times more likely to be elected to'",
        "'speaker_5': 'a class office, four times more likely to participate in math and science in three times more likely to be and to receive an award for school attendance. And so when we talk about funding, while we're talking about these big organizations, we've seen the programs that they bring to our to our youth and to our kids.'",
        "'speaker_5': 'And I think that's so important in making sure, again, that we have that discussion in an equitable way, that everybody's at the table is going to make sure that we hit this. I don't normally use, you know, sports analogies, but it's a homerun.'",
        "'speaker_5': 'And so thank you again for the leadership, everybody. I look forward to voting on this and having the discussion down the road.'",
        "'speaker_2': 'Thank you. Thank you. Councilmember Pierce, Vice Mayor Andrews.'",
        "'speaker_3': 'Thank you, ma'am. Thank you. I think a lot of this, when we speak about tax, everyone gets a little nervous. But I'm sure I think Steve got in his group for coming up with an innovative idea to really be able to help our African-American culture tune.'",
        "'speaker_3': 'Because the fact that this would be a jump start for the culture that we have such a small amount of, you know, economic. Money is coming back into it because this year this 1% will mean so much, because the fact that you guys and everything, everyone realize that, you know, when you talk about art and culture, it'",
        "'speaker_3': 'makes the whole thing work. And Steve, you and your group makes it so wonderful to think, you know, out of the box and let them know that everyone would be able to share. And with this. And Dr. Felten, I want to thank you so much for coming forward and letting us know that we do have an African-American'",
        "'speaker_3': 'culture group that are really looking forward to this 1% tax kick back. So thank you very much.'",
        "'speaker_2': 'Thank you. Councilman Austin.'",
        "'speaker_7': 'Thank you. I think everything is mostly been said by our public commenters, but I want to voice my enthusiastic support for this item that will result in greater investment in our Convention Center, Convention and Visitors Bureau. But it also market our city in equally important.'",
        "'speaker_7': 'It will be an investment in boom for arts and culture in the city. The arts really do define our city. There's been no issue like arts and culture that I've seen that bring people together, that galvanize our community and excite the people in our city like the arts.'",
        "'speaker_7': 'And so this is a no brainer for me. I'm very much in support of it. And I believe when this is approved by voters, obviously it will have limited and very minimal impact on the residents of Long Beach.'",
        "'speaker_7': 'This is this is going to be great. And I just want to commend the mayor for his courage for bringing this forward. And Steve Goodling, who is a creative leader and himself a marketing genius. And I'm confident that this additional revenue for the CVB and arts will be a force multiplier for our city.'",
        "'speaker_7': 'So I'm happy to support it.'",
        "'speaker_2': 'Thank you, Councilmember. We're going to go ahead and go to a vote. Members, please go ahead. And Castro votes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Great. Thank you very much. And I want to. I want to just I want to say I want to say first thank you to all the arts supporters are here. I want to echo something that Councilman Pryce said is, I see all of you work so hard all the time, all year at events, fundraisers at school events'",
        "'speaker_2': ', programs for Long Beach Unified. And I know many of you, I don't normally come down also down to city hall downtown. And I want to thank you for coming here tonight and for being such an advocate for the arts and to keep keeping this important part of our city in the fabric of who we are constantly alive'"
    ],
    "Funding Transfer to Support CDA Cares Long Beach Event. ": [
        "'speaker_2': '. And so thank you. And much work ahead of us. But thank you very much for all of you for being here. I want to I want to briefly do item number 12, which I know is also related to the convention center.'",
        "'speaker_2': 'Please please read the item.'",
        "'speaker_0': 'Communication from Council Member Super or Not recommendation to increase appropriations in the General Fund Group in the City Manager Department by $23,156.50 to provide funds to the California Dental Association who will host Cares Long Beach in July 2020.'",
        "'speaker_2': 'So we're superannuation to do public comment first or.'",
        "'speaker_8': 'Actually I would like to ask Steve Goodling not to leave. I don't think he got enough praise on the last item. So we'd like you to stay here for for this one. I'll go ahead and make my comments first.'",
        "'speaker_8': 'And that is I'm asking for my council colleagues support to allow our office to spend $23,158.50 to bring the Cedar Cares event to the Long Beach Convention Center. Kate Carer's Allowance Volunteer. Dennis With the assistance of other health professionals and community volunteers to provide dental services at no charge to an estimated 2000 people at the event from'",
        "'speaker_8': 'July 17 through 18th, 2020. We have a couple of guests here tonight. Dr. Gary Glass Band is here and along with Steve Goodling, Dr. Glass Band brought this idea to me a couple of years ago. So what you're seeing tonight is the fruition of a project that has been very long in the making.'",
        "'speaker_8': 'And so, Dr. Glassman, if you would like to come up and say a few words about this, it it looks like Gary Glassman is ready to go to work right now. So thank you for being here.'",
        "'speaker_7': 'Thank you very much. Not very professional clearing my throat.'",
        "'speaker_2': 'No, actually, I know. I know. I know that some excited folks in the back as well. If we can kind of just exit quietly and speak in the in the foyer, that would be great.'",
        "'speaker_7': 'Going to my Harbor Dental Society hat for just a moment. First of all, I want to thank the the city council, the honorable mayor, the vice mayor and Mr. Goodling, who we've actually never met, but we know each other.'",
        "'speaker_2': 'And speaking to the mike, please.'",
        "'speaker_7': 'Thank you. Briefly speaking. What I'm representing is the chair of the California Dental Association Foundation. In just from a housekeeping standpoint, if in your agenda item, the funds are not going to the California Dental Association, they're going to the California Dental Association Foundation.'",
        "'speaker_7': 'CDA CARES is a two day charitable event where we will treat approximately 2000 patients. There's no means testing, no questions asked. Anybody that shows up can receive care. We will provide $1.5 million in two days, 800 to 850 volunteers.'",
        "'speaker_7': 'Professionals such as myself, physicians, nurses, dental assistants, lab technicians will all volunteer their time. No one is being paid for this event. 1200 volunteers from the community will show up and volunteer their time as translators, providing food, doing maintenance on the line, anything that needs to be done, it's a it's a great coming together of the community'",
        "'speaker_7': '. I've participated in this particular event all over California for the last seven years. We've provided over $26 million worth of dental care for free for anybody that shows up. And I have a slide deck at some point I'd like to share with the full council, but a city of the gravitas of Long Beach, of the presentation of'",
        "'speaker_7': 'Long Beach. Unfortunately, like any other city anywhere in the United States, it's said you can walk ten blocks in one direction from any major city and see what's going on with the rest of the community. And this is a community that we want to help serve.'",
        "'speaker_7': 'It's the homeless, it's the working poor, it's the uninsured families, it's the uninsured mothers, it's the uninsured children. They'll all receive treatment at this event. And to Long Beach is a unique venue in that it has a convention center where we could hold an event.'",
        "'speaker_7': 'We need 100,000 square feet to put an event like this on. And there's there's suitors all over the state of California that are interested in this. And because of our limited budget of the California Dental Association Foundation, there's only going to be one event next year.'",
        "'speaker_7': 'It's the first time in seven years that we've gone from two events to one, and the city of Long Beach was vetted and it's the appropriate venue. And because of your largesse, we've secured the convention center for July 17th and 18th, but this free dental clinic costs $500,000 to put on.'",
        "'speaker_7': 'We have to rent dental equipment to be here. It comes from the American Dental Cares Foundation. It's brought in on larger. 18 wheelers. We have to provide food, set up, tear down. We have to provide security, insurance. All the things, plus the dental supplies, all of this.'",
        "'speaker_7': 'And so I, as the chair of the Local Arrangements Committee, is tasked with raising $300,000 of this money, which is something that's new to me. We've had a quite a generous support from our supervisor. Janice Hahn has announced a couple of weeks ago that she was going to put $100,000 into this event.'",
        "'speaker_7': 'And she is our flagship sponsor at this point. And to date, we've raised over 153. Three. And we probably have commitments for another $80,000 from various dental entities. Anyways, I come before you to thank you and to clarify something.'",
        "'speaker_7': 'Why I'm here tonight. So. In addition to the money that needs to be raised for this event on, I appointed someone to chair what's called an in-kind donations, things like food, and we feed all the people in line.'",
        "'speaker_7': 'The 1200 or so patients. We feed all our volunteers. And so this person was in charge of bringing together in-kind donations. And I was told by the foundation in Sacramento that Councilman Super and I had managed to commit or wanted to commit $23,000 that goes towards the labor at the Convention Center as an in-kind donation.'",
        "'speaker_7': 'And I was just floored. So I called him up to thank him and he says, well, come down and speak to this a little bit. There may be other people on the council that are interested in supporting this cause to some extent.'",
        "'speaker_7': 'So I'm halfway there. I guarantee you will be there in force. We'll have everybody. I'll have all the the workforce will be in place. But right now, it's the rolling up the sleeves and raising the money time. So like I tell people, I want your time and I want your treasure, but right now, I want your treasure'",
        "'speaker_7': '. So that's why I'm here.'",
        "'speaker_2': 'Thank you very much. Councilor. Mr. Brown.'",
        "'speaker_8': 'Thank you, Dr. Glass Ban. And thank you for your perseverance and staying after me for so long. And I just wanted to say that that the services go citywide. The fourth district is supporting this, but the participants will come citywide.'",
        "'speaker_8': 'And I also have to mention Steve Goodling. I had no idea how he would react to this idea when I brought it to him and he did not bat an eye. He was he was into it from the very beginning.'",
        "'speaker_8': 'So. Well, thank you for that. And also acting city manager Tom Modica, you helped us do an and it was just a pleasant surprise to see how everyone was on board from the get go. So thank you.'",
        "'speaker_2': 'Thank you, Councilmember. Councilmember Austin. Okay. Before I go to counseling customer Pierce.'",
        "'speaker_5': 'Yeah, I just wanted to say thank you to Councilmember Supernova. I know you and I had a conversation about this. My aunt is a pediatric dentist, so I spent six years working in her office. She very much tried to get me to buy to be a hygienist.'",
        "'speaker_5': 'Your work is very difficult, and I recognize what a labor of love it is that dentists come out and really do great service. So I'm not sure what our budget has right now, but I'm going to have Carla come out and speak with you and we definitely want to support and thank you, Steve.'",
        "'speaker_5': 'You always really do step up for organizations like this. So thank you.'",
        "'speaker_2': 'Thank you. And I have two members of the public that want to speak and control and learn. Goodhew Knope and control? Nope. Okay. There's motion in a second. Please cast your votes.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Ordinance to Amend and Restate the Long Beach Building Standards Code.": [
        "'speaker_2': 'Thank you. We have three hearings to do and then we're going to do we have a time certain 630 and then we have public comment as well and we have a very long agenda after that. So let me begin with here, and we're going to we're going to go a little backwards.'",
        "'speaker_2': 'When to go hearing hearing item number nine please.'",
        "'speaker_0': 'Report from Development Services and Fire recommendation received supporting documentation into the record, conclude the public hearing and declare ordinance amending and restating Title 18 at a Long Beach Municipal Code in its entirety, an ordinance amending various sections two titles three, eight, nine, 14, 18 and 21 of the Long Beach Municipal Code read for the first time and'",
        "'speaker_0': 'laid over to the next regular meeting of City Council for Final Reading. Adopt a resolution making express findings and determinations relating to the adoption of more restrictive code provisions where appropriate. And adopt a resolution to submit the ordinance amendments to the California Coastal Commission citywide.'",
        "'speaker_2': 'Okay. Emotion in a second, Mr. Modica.'",
        "'speaker_1': 'David Cram, superintendent. A building and safety will be presenting.'",
        "'speaker_4': 'Good evening, honorable mayor and members of the city council. I'm David Cram. I'm superintendent of building and safety for City of Long Beach Building and Safety Department. And I have a privilege tonight to present to you the 2020 Long Beach Municipal Code update, which staff worked on it, and it's in front of you tonight.'",
        "'speaker_4': 'I have a short presentation to make. Every three years, the state of California adopts the. Latest edition of the California Building Standards Code and Uniform Housing Code to establish a uniform standards for the construction and maintenance of the building.'",
        "'speaker_4': 'Electrical Systems. Plumbing System. Mechanical System. Fire and Life Safety Systems. A 2019 edition of the California Building Standards Codes, was adopted by the California Building Standard Commission and published in July of July 1st of 2019. Multiple development services bureaus and other city departments, including building and safety, fire prevention, code enforcement planning, public works and other.'",
        "'speaker_4': 'And the Office of Sustainability have reviewed the codes and recommended the proposed local amendments. State law requires that the codes become effective at the local level. On Jan first of 2020. The 2020 Long Beach Municipal Code update involves some technical provisions of the codes.'",
        "'speaker_4': 'It involved some administrative provisions of the code codes and also some general cleanup of the language. When you update the codes in one section, obviously it has an effect in other sections. So to this rigorous process, staff has been able to update and upgrade our codes throughout, which impacted Title three of Language Municipal Code, the Revenue and'",
        "'speaker_4': 'Finance System Title impacted Title eight Language Health and Safety Code. It also impacted Title nine. Long Beach. Public Peace. Morale and Welfare. Title and also Title 14. Long Beach. Municipal Code. Streets and Sidewalks. Majority of the changes that were involved were entirely 18 alien courts, which as a result impacted other codes and other provisions.'",
        "'speaker_4': 'Some more notable items under the Building Codes era would be the sort of which will take permitting the expedited process that we are implementing and also upgrade and changes to the flood prevention and flood. Review of the projects that are in flood district.'",
        "'speaker_4': 'It also involved fire code, involved some other elements of the code enforcement. Tyler, 21 of the longest municipal code zoning, was also impacted or changed when it comes to the harbor permits and reference to the structural design requirements of the roof.'",
        "'speaker_4': 'Support for the photovoltaics systems. Final 18 covers, basically building and safety and health, but also includes the sustainability sustainability provisions of the code, such as electrical vehicle charging policy that we are coming up with, and also the solar photovoltaic systems.'",
        "'speaker_4': 'In order to put a staff to put this common issues in front of you. Several boards and several committees and commissions were consulted with, including Board of Examiners and Appeals and Condemnation. There were several meetings that staff presented the code updates to them Sustainable City Commission, Planning Commission and also Industry Partners for archery in order for his'",
        "'speaker_4': 'staff to produce recommendations together. The recommendations in front of you tonight are basically. What is putting that in his staff report. And rather than me going through the detailed discussion on the recommendations, uh, the trial code update changes are recommended for approval tonight.'",
        "'speaker_4': 'Uh, these code updates makes us. Design and construct per the latest and greatest standards that are available in California. And the is basically conclude my presentation for tonight and I'm available for any questions or answers that you may have for us.'",
        "'speaker_2': 'Thank you. There's a there's a motion in the second Mr. Goodhew wrest control. You speaking on this item? No. Members, please go ahead and pass as the votes. Cast your vote.'",
        "'speaker_0': 'Ocean carries.'"
    ],
    "Resolution to Vacate Portion of Maple Way Alley. ": [
        "'speaker_2': 'Okay. CHEERING, Please. We're going to do a hearing here in ten.'",
        "'speaker_0': 'Or from public works recommendation or supporting documentation into the record. Conclude the public hearing and adopt a resolution ordering the vacation of the portion of Maple Way between Long Beach Boulevard and Alamo Court District to.'",
        "'speaker_2': 'Mr. Walker.'",
        "'speaker_1': 'Craig back and Josh, Joshua Heckman will be presenting.'",
        "'speaker_2': 'Thank you, Mayor, and members of city council. We're here this evening to talk about a vacation of Right of Way in support of a development project. And I would like project manager Joshua Hickman to go through some of the details.'",
        "'speaker_4': 'Joshua. Hey. Good evening. My name is Joshua Heckman and the Public Works Department. And here to give you a real brief overview of why we're here tonight, the project is vacating an alley as the staff report notes. And the alley is to or the vacation is to accommodate a development project in the area.'",
        "'speaker_4': 'The project has been through the Planning Commission where a general plan conformity finding was approved and the item was heard on October 1st. The the alley was intention to vacate was was approved back on October 1st. And we are now here to move forward with the vacation.'",
        "'speaker_2': 'There's a motion, and a second is Mr. Goodhew. Control. Okay. See no other. I don't believe any any other folks are applicants for speaking on this item. Is that right, Mr. Monica?'",
        "'speaker_6': 'Ready to go.'",
        "'speaker_2': 'Please cast your votes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'A hearing. Item eight is a longer hearing. So we're going to move on to the next item on the agenda. It's not 630 yet, which will be general public comment. And so I want to go ahead and call it the first few speakers.'"
    ],
    "Urgency Ordinance to Temporarily Prohibit No-Fault Notices and Evictions for Older Residential Properties. (Citywide)": [
        "'speaker_2': 'With item the the the ordinance with the time certain believe it's 20. The 20.'",
        "'speaker_0': '22, 22. Communication from city attorney recommendation declare ordinance amending the Long Beach Municipal Code to temporarily prohibit no fault notices and evictions through December 31st, 2019, declaring the urgency thereof and declaring that this ordinance shall take effect immediately citywide.'",
        "'speaker_2': 'Okay. Thank you very much. We have a motion and a second. Councilman Pierce.'",
        "'speaker_5': 'I don't have any additional comments. I fully support what's in front of us and urge my council colleagues to do the same. Thank you.'",
        "'speaker_2': 'Vice Mayor Andrews.'",
        "'speaker_3': 'I'm told you supported him. We can move on with it.'",
        "'speaker_2': 'Councilman Austin.'",
        "'speaker_7': 'I support. Ready to vote.'",
        "'speaker_2': 'Thank you. Before we go to a vote, we we have extensive speakers lists. As you know, the council voted on this unanimously the last time. And so I think folks would like to vote. But if you'd like to speak.'",
        "'speaker_2': 'Open it up for public comment. I would just let people know what the process is on these emergency declarations and ordinances. The council will vote as soon as the council votes. Per the occurrence conversation with the city attorney, then of course, I will sign the ordinance.'",
        "'speaker_2': 'I'll take a quick break. I will sign the ordinance quickly. Of course, I'm not going to veto the ordinance. And then it will go into effect immediately. So that's the plan right now. And so I want to make sure that we the quicker we do this, the quicker I'm going to sign it just right outside.'",
        "'speaker_2': 'All right. So if you have if you want to speak to this item that passed unanimously, you're welcome to do so. I'm going to call you up every one minute, Larry Goodhue. Kenneth West. MC Women. Alicia Flores. Gary Shelton.'",
        "'speaker_2': 'Please come forward if you want to speak. Janet Foster and control anyone from that group. No. Okay. Moving on. Cafe item. Ross, please. Please.'",
        "'speaker_4': 'First. Thank you for having me, Mayor. Council Member of Staff. My name is Kenneth West McCrimmon. I live in District three. I mean, I was an active duty soldier. I have been in the reserve component since 2014. I go to Cal State University, Long Beach on vocational rehabilitation.'",
        "'speaker_4': 'Due to my disability in 2016, someone hit me with their vehicle when I was on my motorcycle. I have a broken body. That's the short explanation. I also have a traumatic brain injury, a broken neck, and my injuries from active duty were exacerbated.'",
        "'speaker_4': 'A year ago, my family and I notified our landlord about the need for a service dog with a doctor's note from my provider. Just recently, the owner of our building actually saw the dog and verbally informed us that we could not have a dog.'",
        "'speaker_4': 'I informed him that he was a service dog and that the management company was aware of the dog living in our address. A couple of days later we were issued a 60 day notice with no reason why. After speaking.'",
        "'speaker_2': 'I'm going to let you finish up.'",
        "'speaker_4': 'At this location. Time's up. After speaking to the management company, they said it was because of the demeanor of the dog. Our 60 day notice is December 31st. And to expect any family, especially a disabled family with 214 year old teenage girls and one year of son and a wife who is also disabled, that's unreasonable.'",
        "'speaker_2': 'I think you should thank you for your service. Thank you very much.'",
        "'speaker_4': 'I was only supposed to speak.'",
        "'speaker_2': 'With the U.S. forward because Gary Shelton can speak. He is? Nope. Okay. So if I'm going to speak, please come forward. Is Janet Foster speaking or in control? No, please. Alicia.'",
        "'speaker_1': 'Good afternoon, everyone. Mr. Van Dam. Nice to see you again, Mr. De. Thank you for everything you've done, Robert. See you again. My name is Alicia Flores. And the reason I'm here is because the advocate in me and I stand today here before you, just like many hundreds, if not thousands of people who have been a victim'",
        "'speaker_1': 'and affected by the city ordinance that came into effect on August 1st of this year, 2019, where a lot of people were evicted of their homes. And we were told that our rent was going to be skyrocketed from $650 to 1500 dollars.'",
        "'speaker_1': 'And if we didn't like it, tough move. There are so many homeless. There are several agencies fighting against homelessness, but yet landlords are creating more homelessness. And there are two buildings that. Had the same landlord. Those people we are curious and would like to know what's going to be done about it.'",
        "'speaker_1': 'People sleeping on the streets.'",
        "'speaker_2': 'Thank you very much for sauce.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'It's a fun exhibition. You're okay. Please come for you. Janet Right.'",
        "'speaker_1': 'Kathy.'",
        "'speaker_2': 'Kathy. Got you. Great.'",
        "'speaker_1': 'Hi. God bless you. My name is Kathy ETIM. And again, I've spoken a few times here. Everyone knows me. I'm a street minister here. I'm an advocate for those who are elderly, disabled and homeless. And I thank you so much for already passing this.'",
        "'speaker_1': 'And I know you're going to sign it, and I thank God for that. It is an answer to prayer. I would just want to make a few points is that even after we do this, what happens next? What's going to happen to the people?'",
        "'speaker_1': 'The rent is still going to be hard for them to pay. They're in limited incomes. They're homeless, they're elderly. They have like I said, minimum income, rent control is definitely needed in this town. I can remember that I lived in Lancaster.'",
        "'speaker_1': 'My rent for mobile home park was $250. My rent here now is 600 for a studio apartment and my rent has not been rent raised in seven years. I thank God for people like my manager and owner. God bless you.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_6': 'Stephen Moore, since you're a Democratic Socialists of America, Long Beach Branch resident of the Second District, a city is made of people and people who need safe homes in order to live. This ordinance is necessary to preserve the basic standard of living for the majority of the people in the city who are renters.'",
        "'speaker_6': 'Please vote for this moratorium to support your constituents and their families and to demonstrate that you believe that housing is a human right. Additionally, send a message to the corporate donor class of this city and their lapdog, Mike Murchison, that their day of gouging, days of gouging people for rent in the city, for substandard housing are over'",
        "'speaker_2': '. Our next speakers are Rosalba and Myra. Vilma or Jennifer going to speak? Anybody from that group? No one person to be seen forward. Is Antonio Zavala going to speak? It's okay. His way is way more. Can I speak?'",
        "'speaker_2': 'Yeah. Brando. Velasquez, please come forward, everyone. Just as a reminder, it's the second vote of of a unanimous vote last time. So I think council is ready to vote so that I understand if folks want to speak, come forward.'",
        "'speaker_2': 'Please come forward. Who's speaking.'",
        "'speaker_1': 'In.'",
        "'speaker_11': 'My office? Okay.'",
        "'speaker_2': 'Please come forward.'",
        "'speaker_1': 'Mirror my nursing when I'm noticed.'",
        "'speaker_11': 'Good evening and welcome to La La Nina.'",
        "'speaker_1': 'And here to ask you that, I will let you know that I'm hoping that this will pass.'",
        "'speaker_11': 'And is here. Then, in the problem of Ontario's Ontario, Canada, said, look, I mean, I'm actually a multilateral and that is Canadian.'",
        "'speaker_1': 'I'm still having problems with my landlord and they're still trying to evict me just because of the issues that I told you that I had.'",
        "'speaker_11': 'Imogen Solomon think you've broken with her hand.'",
        "'speaker_1': 'And all I have left is 14 days before I.'",
        "'speaker_11': 'Come under the entertainment. That thing only her condition says, is capacity. That is.'",
        "'speaker_1': 'As I told you before, I have a son who has six different disabilities.'",
        "'speaker_11': 'He will this year. China's Vivien Leigh.'",
        "'speaker_1': 'And I lived in this place for 18 years.'",
        "'speaker_11': 'Naomi Barasa, who still considers Hinduism. Solomon You know, in this year, Chinese, I don't know.'",
        "'speaker_1': 'Neither I don't feel is fair that they're doing this specially because they haven't fixed the unit in 18 years.'",
        "'speaker_11': 'You've been there L.A. you percent.'",
        "'speaker_1': 'I painted last year.'",
        "'speaker_11': 'Yeah, really? To me. Apartamento.'",
        "'speaker_1': 'I fixed my whole apartment problem.'",
        "'speaker_11': 'I think I'm.'",
        "'speaker_1': 'Still having the issue with rats and not just.'",
        "'speaker_11': 'LA in the LA.'",
        "'speaker_1': 'I'm asking you for help. You think he has.'",
        "'speaker_2': 'Is resolved here? Stephen Lester. No, no, it will. We're going to speak. No. Okay. Vilma Silva. No. Jennifer Milan. Are you speaking for Jennifer? Is Antonia. Please come for Antonio. You'll be next.'",
        "'speaker_1': 'Oh. Fishing with the sea.'",
        "'speaker_2': 'Go ahead, Antonio. Your next.'",
        "'speaker_11': 'But.'",
        "'speaker_2': 'And you want to transmit very fluid. It doesn't.'",
        "'speaker_11': 'And this is. When I started this. Good afternoon. My name is Antonia Ibn Ghafoor. Yet. And more in one more oratorio that is on a horse, Yanis, which I am Historia. So then Apartamento lady, sit on my way, you know, get me number to say going to go study homeless.'",
        "'speaker_11': 'The nicest person for you about a month and I know sinners so bad is one of those years festivals pharmacy going up again going to see dentist.'",
        "'speaker_1': 'Which is going to yes I'm here to in support of moratorium for. For the for this item. And I know you've already heard my. Sorry, I just leave it up. I live in District nine, and I don't want to become one more homeless person.'",
        "'speaker_1': 'Thank you for helping us in keeping our homes around this upcoming holidays. Thank you for your help and assistance.'",
        "'speaker_2': 'Jennifer.'",
        "'speaker_1': 'Hi. My name is Jennifer. Me and I live in Salem is with my family and I'm here to ask for your support to pass any eviction moratorium. We've lived in our building for ten years and I received eviction notices.'",
        "'speaker_1': 'I have been evicted before with my family in 2010 and it was a difficult time. The families and I are very distressed for having to look for a new home, especially during this time. We shouldn't be looking for a new home, especially during the holidays are no time of the year.'",
        "'speaker_1': 'I ask for your support on this moratorium. Thank you. Thank you.'",
        "'speaker_4': 'Thank you for doing this. Is when actually when.'",
        "'speaker_2': 'Your next.'",
        "'speaker_1': 'Move.'",
        "'speaker_2': 'Is. Brenda. Brenda. Perfect. And then the next speaker is Alman. Selah here? Let's not speak. Is Dora? No. Go here. The Speaker of the House for Dora Maryville. Yes. No. Joshua Smith speaking. Joshua, come on. A swing, please.'",
        "'speaker_7': 'Hi. Yeah. Wayne from Second District. And it sounds like you guys are kind of on board with it. It's a good thing that you're doing because it's not the good landlords that are going to be doing this. It's the the the investors and the speculators who don't care.'",
        "'speaker_7': 'And they're going to make homeless people. The city is going to have to deal with. So hopefully we'll have a unanimous vote in favor of this. Thank you. Thank you very much for the.'",
        "'speaker_1': 'Good evening, council members and Mayor. My name is Brenda. I'm a resident of the First District and I live in 10th Street and Alimentos. I've been there for 39 years. I feel very emotional because this moratorium will protect me and my two girls.'",
        "'speaker_1': 'Milagros four and Genesis five. Housing has been hard for me and I hope that, yes, as you have acted on this emergency temporarily to protect families, we need to we need long term solutions, more tenants protection. Thank you.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_11': 'We're not. Not just concealing numbers, Dorothy. No. So you're not leader of the. I could be one, not the Long Beach implicit as Helen Mirren waving. So Lady got up again, though I familiarize some yourself out of this the moratorium your leader the lacking many than scintilla responsibility ourselves Sabra Costello's difficulties problems then with the hint the'",
        "'speaker_11': 'person as Wayne asked Trevor honey Lucienne Parakeet Damian why don't you the landlords compromise Tito's marathon rispetto mucho they use our references and who hadn't? Is it your kind of country with a military base that your state is on the style compromise?'",
        "'speaker_11': 'So come on, Mr. Representante, please. Let's be on record. The most familiar is noise Prozac euthanasia is a specialist battery, surveillance, theo sequels, etc. It was that. Yeah. Values correlated to the guard. Don't they reveal ascendant or miss terrorists?'",
        "'speaker_11': 'No. Vamos. I can be another necesitamos citizen commentary la mort instead of Ethiopia. No, they promise that they campagna see no connection is whose death was illusory from the rage of fundamental para la vida. The devido to that personas could be be more sinister to that many symbols, then it would mean that opportunities that was going to'",
        "'speaker_11': 'give me that equal. Respeto is also said part of this to calm you down. They don't say Ms. youneedto congregation is no same with community leaders aimlessly chocolates. You only say you must presume Nando but unless it completely to spit out of the richest woman was done with that most solo so Muslim Pueblo near the.'",
        "'speaker_1': 'Good evening council members my name is Dorothy no go and I'm a leader of I call I live in Long Beach in District nine. I'm here in support of my friends and family and in favor of this item.'",
        "'speaker_1': 'As a leader of the community, I feel a responsibility to let you know the painful difficulties and problems that our people face. They are good people who have worked hard to be good citizens. Many of those who are facing evictions are not elderly, who have contributed to this, contributed to this city for many years.'",
        "'speaker_1': 'As council members, you have the responsibility to support those who need you. We ask you to think about our families, those with special needs parents, grandparents, uncles and children. We don't want them to feel uncertain as to whether they will have a place to call home.'",
        "'speaker_1': 'Stop making changes, but changes by making mistakes. We need to grow and fellow feeling and grow in love with actions. Our home is a fundamental need right for all, and we all deserve better places to live. I'm proud to be part of this change.'",
        "'speaker_1': 'We're not alone. We are a united people.'",
        "'speaker_2': 'And. Somebody tell me how long it's been. Joshua Right. And then after Joshua is is Marie Lopez going to speak? Now Jordan is Jordan going to speak? Jordan confirmed in last month that the battle is not about the Lopez speaking.'",
        "'speaker_2': 'No. Oh, yes. Yes. And Laura and Laura munoz. Yes or no? Okay. Just. And those are the last speaker. So please line up in that order and continue. Go ahead and bring up one.'",
        "'speaker_1': 'I'm not Gonzalez.'",
        "'speaker_11': 'I'm going to this kooky, same person. I told you you are so looking over the atlas can also look at Key in all of this and get them in and protect Hong Kong and control the rain. Tacoma in.'",
        "'speaker_1': 'Los Angeles. Good evening, council members. I want to thank you for passing this moratorium and I ask it for it not to stop here, but also to keep going and game control and rent control in the.'",
        "'speaker_11': 'Meantime, which has graciously as bedrock.'",
        "'speaker_1': 'Is steaming. And once again, thank you very much. And I hope you're well.'",
        "'speaker_2': 'Because I think you, Dr. Smith.'",
        "'speaker_4': 'Hi, my name is Joshua Smith and the communications director with Housing is a human right, the Housing Advocacy Division of the AIDS Health Care Foundation. I'm also the communications director with the Rental Affordability Act campaign, which you'll be hearing more about in the coming year.'",
        "'speaker_4': 'I want to applaud you on behalf of HIV and HHR counsel in advance of voting unanimously to pass the eviction moratorium. I'm kind of just taking this opportunity to let everyone in the room know and also counsel know that due to the state of emergency currently under effect from the attorney general and Governor Newsom.'",
        "'speaker_6': 'The entire state of.'",
        "'speaker_4': 'California currently has vacancy control on every single rental unit, so it is illegal to charge more than 10% in between units currently throughout the entire state of California. So if you are looking for an apartment right now, you should make sure that it's not 10% more than the one that than the folks who were just paying for'",
        "'speaker_4': 'it. That's that's currently true. Now, more evictions that are no fault are currently illegal. Now, tell the whole state thanks.'",
        "'speaker_2': 'Thank you very much, Jordan.'",
        "'speaker_6': 'Hi there. Jordan Winn, second district resident member of the S.O.S. Board of Long Beach and the Everyone in Campaign. I know you all are about to pass us, and I'm very grateful for that. I just wanted to speak a little bit about what happens next.'",
        "'speaker_6': 'Actions speak louder than words, and as 1482 does come into effect, it is going to be up to the cities to enforce that state policy. We don't want to see the courts backlogged with people who don't know their rights, who are facing more than 10% rent increases by landlords who think they can sneak in by.'",
        "'speaker_6': 'So we need to make sure that we're able to enforce those laws. And secondly, pushing this further from protecting tenants is a great first step. But now we can move into helping get more affordable housing into the city, get more supportive housing into the city, and help both our people who are facing homelessness and people who are'",
        "'speaker_6': 'currently experiencing it by adding a funding mechanism of some sort to the city. So thank you so much.'",
        "'speaker_4': 'Please pass this unanimously and I thank you for your time.'",
        "'speaker_2': 'Thank you, Novato.'",
        "'speaker_4': 'Hello. Council and mayor. My name is not Roberta Lopez. I'm the new project.'",
        "'speaker_2': 'Director at Libra.'",
        "'speaker_4': 'And happy to be here. And, you know, thank you so much for your support. Council members who I've talked to. I appreciate you for.'",
        "'speaker_2': 'Standing strong with tenants here in the city. And I appreciate your leadership right, as we.'",
        "'speaker_4': 'Keep people home for the holidays. But what's next? Right. Next year is a new year. And as 1482 comes into play, we're going to need.'",
        "'speaker_6': 'A strong.'",
        "'speaker_4': 'Mechanism that will enforce this new law. And thank you for your support and continue supporting tenants here in the city of Long Beach. Thank you.'",
        "'speaker_2': 'Last week was warming up.'",
        "'speaker_1': 'When I'm not just in your room.'",
        "'speaker_11': 'Garcia Good evening, Mr. Roberto. You know this whole stuff.'",
        "'speaker_1': 'It's not fair game. You know.'",
        "'speaker_11': 'Ryan, I said, look, I lost families.'",
        "'speaker_1': 'That the families really nosotros.'",
        "'speaker_11': 'Because it's really not Jose cos.'",
        "'speaker_1': 'Those, those houses belong to our.'",
        "'speaker_11': 'Product losses. Those families focused on this aloha loyal.'",
        "'speaker_1': 'We end up with girl evicted and.'",
        "'speaker_11': 'Palermo's seniors are miserable. They know when they're going.'",
        "'speaker_1': 'To go to sleep underneath the freeway overpasses with our children.'",
        "'speaker_11': 'I went up a wrote and thought, well, I'm.'",
        "'speaker_1': 'Very.'",
        "'speaker_11': 'Poor. Those who are.'",
        "'speaker_1': 'In this for the kids and the young.'",
        "'speaker_11': 'Fatherless, but principalmente the parallel meuhedet.'",
        "'speaker_1': 'And mainly for the women.'",
        "'speaker_11': 'Yourself. And those worked.'",
        "'speaker_1': 'For in the man in the.'",
        "'speaker_11': 'Morning la tuna sandwich and minimal rent that.'",
        "'speaker_1': 'You make a minimum wage to be able to pay the rent.'",
        "'speaker_11': 'In those schools that is inevitably.'",
        "'speaker_1': 'Evicted during the holidays.'",
        "'speaker_11': 'Well, let's do this. And then I see in those promotional pierogi what they must do.'",
        "'speaker_1': 'When you listen to vote, we all vote for you.'",
        "'speaker_11': 'You know who's talking. And if not in so house.'",
        "'speaker_1': 'That we be evicted.'",
        "'speaker_11': 'Let's be located talking to and.'",
        "'speaker_1': 'Asking you to use your heart.'",
        "'speaker_11': 'As destiny. Nikos Tambien.'",
        "'speaker_1': 'You have children also.'",
        "'speaker_11': 'Being sent in a transit house as a commuter commuters is dumping something too.'",
        "'speaker_1': 'But I just like you think about your children during the holidays.'",
        "'speaker_11': 'Because your Lisbon did not.'",
        "'speaker_1': 'Bless each one of you.'",
        "'speaker_2': 'At the back of the courtroom.'",
        "'speaker_1': 'It evening, mayor and council. My name is Maria. And in a time when everyone's living in fear, I say I'm undocumented, unafraid and unapologetic. On the day DOCA has gone to the Supreme Court. 25 years in Long Beach.'",
        "'speaker_1': 'And now I'm the director of Community Organizing for Housing, Long Beach and the Long Beach Tenants Union. This is a no brainer. Like you've all said it. But more or less, it's intended for us to continue talking. Right?'",
        "'speaker_1': 'Continue talking about the real impacts of displacement. Continue talking about what tenant protections really look like. And how we can support communities. Self-determination to really create vibrant communities. I want to finish off again to remind you all that housing is a human right.'",
        "'speaker_1': 'The net debt. Better than net. That's. Then head on that.'",
        "'speaker_2': 'Thank you so much for your. Thank you very much. Okay. We have we have a motion in a second on the floor. Please go ahead, members, and cast your votes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. We're going to.'",
        "'speaker_1': 'We need it.'",
        "'speaker_2': 'I like I said before, I know normally we would do this within ten days. I'm going to just very quickly, we take a one minute recess and it has to be very fast. One where we need the votes.'",
        "'speaker_4': 'We need the emergency vote, which just occurred now. We need to vote.'",
        "'speaker_2': 'On the substance. And okay, let's do that to the second vote. Then when I would public comment was all conclusive in one once. We're not doing that. So please motion in a second, please.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_2': 'Okay. Thank you. We're good. Thank you. We're going to be working this very fast. I'm going to just go right outside of the lobby, sign the ordinance, and we're going to come back. We're going to recess for literally one minute.'",
        "'speaker_2': 'We have a very long agenda. Okay. We're going to call the council meeting back to order in just, just a minute. So if I can have everyone that's going to remain here for the council. We're going to come back to order in just a minute.'",
        "'speaker_2': 'Okay. I'm going to have we're going to go back into the council meeting. Madam Clerk, can I get the roll call, please?'"
    ],
    "Appeal, Environmental Review and Site Plan Review for 131 West 3rd Street Project.": [
        "'speaker_0': 'Councilmember Pearce. Councilwoman Price Councilmember. Councilwoman Mongo. Vice Mayor. Andrew's Councilmember. Urunga. Councilman. Your Compton member Richardson. Mayor Garcia.'",
        "'speaker_2': 'Thank you. We are going we have a third hearing, so we're going to do the third hearing, which is hearing number eight.'",
        "'speaker_0': 'Orphan Development Services recommendation received supporting documentation into the record. Conclude the public hearing and consider an appeal by supporters. Alliance for Environmental Responsibility. Adopt a resolution approving an addendum to the EIA related to the project at 131 West Third Street.'",
        "'speaker_0': 'Making certain secure findings and determinations. Adopting a mitigation, monitoring and reporting program and approve a site plan review. Find that the proposed vacation of a segment of.'",
        "'speaker_1': 'Roadway way.'",
        "'speaker_0': 'A vacation of portions of Pacific Avenue are in conformance with the general plan. District one.'",
        "'speaker_2': 'Thank you. And we know this is a this is a de novo appeal. So the applicant itself has the burden of proof. We're going to begin with the staff report.'",
        "'speaker_0': 'There is an oh. So if anybody who will be testifying can stand and raise your right hand. Do you and each of you solemnly state that the testimony you may give in the courts now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Christopher Coons, planning bureau manager, will be presenting the staff report.'",
        "'speaker_6': 'And I'm going to introduce Marianne Cronin, who was the planner on this particular project.'",
        "'speaker_1': 'Thank you. Thank you. Good and good evening, honorable mayor and members of the City Council. Before you this evening is a request to receive supporting documentation to the record, conclude the public hearing and consider an appeal for a project consisting of the approval of a mixed use project located at 131 West Third Street in the Downtown Plan'",
        "'speaker_1': 'PD 38 Incentive Area. The project was approved on September 19th by Planning Commission and a subsequent appeal was filed on September 27th. The site is located on the east side of Pacific Avenue, between West Third Street on the south and West Fourth Street to the north.'",
        "'speaker_1': 'And Solana core an alley to the east in the downtown plan zoning district. The site encompasses six parcels and a portion of an east west alley away that is proposed to be vacant as part of the project for a total project area of 1.22 acres.'",
        "'speaker_1': 'The project site is currently developed as a paved at grade parking lot with parking spaces. Adjacent uses are typical of the downtown setting, including the historic Walker building to the north and hotel restaurant and multi-family residential uses nearby.'",
        "'speaker_1': 'The site is well-served by public transit and is in proximity to the I-70 ten freeway to the West. The proposed project consists of a new mixed use residential development. The project will replace the surface parking lot with two mixed use buildings, including one tower with 23 stories in height and one mid-rise building eight storeys in height with'",
        "'speaker_1': 'parking structures above ground and at subterranean levels in each building. The project includes a total of 345 market rate dwelling units and would range in sizes from studios to three bedrooms. There is no city requirement for the project to incorporate affordable units at this time, and the project includes approximately 14,481 square feet of retail spaces, over 500'",
        "'speaker_1': 'parking, 563 parking spaces and 128 bicycle parking spaces. The applicant has indicated the project will be constructed in phases, which is worth noting for the provision of the open space for sale between the two buildings. During the first phase of the project, the mid-rise building would be constructed as well as the four Paseo alley improvements and adjacent'",
        "'speaker_1': 'improvements within the right of way. During phase two, the construction of the South Tower will commence. A tentative track map combines the existing lots and vacated portion of the alley into a single ground lot and create six vertical airspace lots between the two buildings.'",
        "'speaker_1': 'The site is within the height incentive area of the PD 30 plan area, a sub area that does allow building heights up to 500 feet when certain development criteria are met. The proposed development bonuses are subject to three criteria that have been established for this project and are included in the project description, which includes LEED Silver certified'",
        "'speaker_1': 'or equivalent green roof or eco roof with an option to for 31 to 60% of the building footprint to be for green roof standards as well as public open space option one, which is equivalent to 10% of the site, which would be satisfied by the open space paseo between the two buildings.'",
        "'speaker_1': 'The overall floor area ratio for the project would be 9.48, where a floor area ratio of 11 is maximum permitted with the incentives. The total height of the South Tower is proposed to be 269 feet above grade, and the North Mid-rise building would be built at 85 feet in height, which is within the base height limit for'",
        "'speaker_1': 'the area. As aforementioned, the proposed pedestrian paseo provides a mid-block pedestrian crossing and amenity space that satisfies the PD 30 criteria for a floor area ratio. The Planning Commission found that the project is compatible in design, character and scale with its surroundings, which include the adjacent mid-rise residential uses on the north side of West Fourth Street.'",
        "'speaker_1': 'The 23 storey tower would be substantially taller than the nearby mid-rise buildings, but the incorporation of offsetting building faces, balcony patio areas as well as other architectural features, would break up the massing of the building to soften the presence of the tower structure in the downtown setting.'",
        "'speaker_1': 'The project's form and massing have been designed to be respectful of nearby buildings while making a positive contribution to the streetscape and downtown skyline. Additionally, Planning Commission considered and accepted the addendum that was prepared for the project. The required findings can be made in the affirmative.'",
        "'speaker_2': 'Okay. We're going to have the applicant presentation and the appellant. We're going to put a maximum time of 10 minutes if that's appropriate for both sides, unless there's an objection to that of the applicant. Mr. MODICA Did you want to have the applicant?'",
        "'speaker_6': 'I think we have a couple more points that we have to make for the record.'",
        "'speaker_2': 'Okay, sure.'",
        "'speaker_1': 'Thank you. As noted on this slide. Pursuant to Secure the California Environmental Quality Act and the guidelines that were established, an ER addendum was prepared consistent with the program air for the downtown plan. And the EIA addendum determined that the project would not result in any new impacts that exceed those that were analyzed in the Downtown Plan'",
        "'speaker_1': 'Program air with mitigation measures incorporated. The appeal that's before you today asserts that the project introduces new environmental impacts that were not considered and that a tiered air must be prepared. Staff has prepared supplemental responses and subsequent to the filing of the Application for Appeal, which are included in your packets, that note that the use of a'",
        "'speaker_1': 'secure air addendum was determined to be appropriate for the proposed project. Its application was duly noted pursuant to the Long Beach Municipal Code. Five comments were received and are included in your packets before you staff finds that positive findings can be made in support of this application, and staff recommends the City Council adopt a resolution approving the'",
        "'speaker_1': 'ER addendum and upholding the Planning Commission decision to approve the project subject to conditions. The applicant is present and available for any questions you may have.'",
        "'speaker_2': 'Thank you. Does the applicant want to make a presentation? In addition to that, please come forward.'",
        "'speaker_6': 'Dale Goldsmith representing the applicant. I think it might be a better use of your time if I was to provide rebuttal of the appeal, given that the Planning Commission approved the project. Staff prepared a very comprehensive presentation and the appellant may raise some new issues.'",
        "'speaker_2': 'And you'll have an opportunity to do that as well, if you like. So that's okay. We can we can keep going forward in the hearing. You'll still have an opportunity to do a rebuttal.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_2': 'The appellant.'",
        "'speaker_4': 'Good evening, Mr. Mayor, honorable.'",
        "'speaker_7': 'Members of the Council. My name is Brian Flynn here on behalf of the Supporters Alliance for Environmental Responsibility. Here to urge the council to not approve the addendum for this project. Instead, send it back to planning staff for any to prepare an air.'",
        "'speaker_7': 'I'd like to use my time to quickly discuss two of the issues with which highlight why this.'",
        "'speaker_6': 'Addendum is not appropriate for.'",
        "'speaker_7': 'This project. First off, the city is improperly relying on an addendum.'",
        "'speaker_6': 'Addendums are intended for minor.'",
        "'speaker_7': 'Minor modifications made to existing projects. The plain language of the school guidelines on which the city relies do not allow for an addendum in the scenario and rather relevant case law in the school statute itself require the city to.'",
        "'speaker_6': 'Prepare any air. And second, there is.'",
        "'speaker_7': 'Substantial evidence that this project will have significant impacts that were not analyzed in the.'",
        "'speaker_6': 'Downtown plan air and not analyzed in this addendum document.'",
        "'speaker_7': 'So as to my first point, the improper reliance on the addendum section 15162 of the school guidelines explains the criteria for when an air has been certified or a negative declaration adopted for a project, and then whether a subsequent EMR must be prepared for quote, that project.'",
        "'speaker_6': 'Here in air was developed.'",
        "'speaker_7': 'For the downtown plan, not for this project. An addendum may be proper if the city were making changes to the downtown plan, but that's not what's happening here. You're analyzing a specific project within an area for which an air has been prepared.'",
        "'speaker_7': 'So no air has been prepared for this project. And by the plain language of the guidelines.'",
        "'speaker_6': 'An addendum is not appropriate. Instead, when there is an overarching.'",
        "'speaker_7': 'Programmatic air like the downtown plan, the first consideration is whether the new proposed project is covered by the programmatic air. The second consideration is whether the later activity, meaning this.'",
        "'speaker_6': 'Project, would have effects that were not.'",
        "'speaker_7': 'Analyzed in the downtown plan. Air Program.'",
        "'speaker_6': 'Air may only serve to the extent that it.'",
        "'speaker_7': 'Contemplates and adequately analyzes the potential environmental impacts of the project.'",
        "'speaker_6': 'If a programmatic air.'",
        "'speaker_7': 'Does not evaluate the environmental impacts of a project, a tiered EIA must be completed before the project is approved. And for these inquiries, the fair argument test standard applies. So in this situation, CPA requires the city.'",
        "'speaker_6': 'To prepare an initial study to determine if the.'",
        "'speaker_7': 'Project may cause significant environmental effects not.'",
        "'speaker_6': 'Examined in the downtown plan program air.'",
        "'speaker_7': 'And there is substantial evidence supporting the argument that this project may result in significant environmental impacts that were not previously analyzed in the downtown plan.'",
        "'speaker_6': 'Air. So there is.'",
        "'speaker_7': 'Substantial evidence in the record, some of it in that lengthy comment that you just received.'",
        "'speaker_4': 'That the project will have significant.'",
        "'speaker_6': 'Indoor air quality impacts, significant health impacts from emissions during construction.'",
        "'speaker_7': 'And operation of the project and greenhouse gas impacts. We had a certified industrial hygienist, Francis Offerman. He looked at the addendum and concluded it's likely that the project will.'",
        "'speaker_6': 'Expose future residents to significant impacts related to indoor.'",
        "'speaker_7': 'Air quality, in particular emissions from the cancer causing chemical formaldehyde materials commonly used in residential buildings for flooring, cabinetry.'",
        "'speaker_6': 'Baseboards, window shades, interior doors.'",
        "'speaker_7': 'Window trim, door trim all contain an off gas formaldehyde. Mr. Offerman calculated that the future residents of the project will be exposed to a cancer risk from formaldehyde of approximately a 125 per million. The full time employees in the commercial spaces may be exposed to a cancer risk of 18.4 per million.'",
        "'speaker_7': 'And these calculations.'",
        "'speaker_6': 'Are, even if the materials meet the most recent.'",
        "'speaker_7': 'Standards from the California Air Resources Board. And these calculations both exceed the South.'",
        "'speaker_6': 'Coast Air District's threshold of ten in 1 million.'",
        "'speaker_7': 'Now this impact can be mitigated. It's pretty simple. It's done in other projects. You just require them to use no formaldehyde added materials that can reduce.'",
        "'speaker_6': 'The impact of formaldehyde emissions.'",
        "'speaker_7': 'To less than significant levels. In addition, there are significant impacts related to.'",
        "'speaker_6': 'Construction and operational air quality.'",
        "'speaker_7': 'The addendum determined that the project would result in a less than significant health risk from diesel particulate matter emissions.'",
        "'speaker_6': 'However, this conclusion is not supported by.'",
        "'speaker_7': 'Substantial evidence because a quantitative health risk assessment was never prepared for the project. The expert environmental consulting firm Sweep did a health risk assessment based on the data provided in the addendum, and they.'",
        "'speaker_6': 'Concluded that the excess cancer risk to adults.'",
        "'speaker_7': 'Would be 31 in a million.'",
        "'speaker_6': 'To children.'",
        "'speaker_7': '280 in a million and to infants, 240 in a million. Again, the threshold.'",
        "'speaker_4': 'From the South Coast Air District.'",
        "'speaker_7': 'Is ten in 1 million. And even if you use the less conservative, you know, those previous numbers all deal with that age sensitivity factors. Even if you use a more conservative.'",
        "'speaker_6': 'Health risk assessment.'",
        "'speaker_7': 'That the risk.'",
        "'speaker_6': 'To adults is 31 in a million children, 93 in a million.'",
        "'speaker_7': 'In infants, 24 in a million. So these greatly exceed the South Coast thresholds and the addendum never attempted to quantify this impact and now must do so in light of expert evidence.'",
        "'speaker_6': 'In the record demonstrating.'",
        "'speaker_7': 'The significant impact to human.'",
        "'speaker_6': 'Health. Also issues with the greenhouse gas calculations. The analysis is deficient because it.'",
        "'speaker_4': 'Relies on South Coast 2020.'",
        "'speaker_6': 'Service.'",
        "'speaker_7': 'Population.'",
        "'speaker_6': 'Thresholds. It's improper because the project's construction and development continue beyond 2020.'",
        "'speaker_7': 'It's not even become operational until 2021. As a result, the greenhouse gas analysis should have compared the emissions from this project to the South Coast 2035 efficiency.'",
        "'speaker_6': 'Standard.'",
        "'speaker_7': 'In order to evaluate the project's emissions from 2021 and beyond. When that threshold is used, the project's 2021.'",
        "'speaker_6': 'Exceeds these exceeds the 2035 thresholds. And again, this constitutes substantial evidence that the project will have significant.'",
        "'speaker_7': 'Greenhouse gas impacts that must be analyzed in.'",
        "'speaker_6': 'An air.'",
        "'speaker_7': 'So little time left. Really, the city should not approve this addendum at this time. Instead, the city should prepare a yes to proceed under sequence hearing provisions and prepare an air as required by law. Importantly, we're not saying that this project should never be built.'",
        "'speaker_7': 'It's just that when we do these sort of things, let's go through the proper environmental review to ensure the health and safety of the neighborhoods and the future residents. Thank you.'",
        "'speaker_2': 'Thank you. And now we're going to hear the appellant, please. Rebuttal. I'm sorry. The applicant.'",
        "'speaker_6': 'Please go ahead. Good evening again, honorable council members once again, for the record, Dale Goldsmith. I'm a lawyer with the law firm of Archbishop Goldsmith, the Dail back representing the applicant. I'd like to refer to two letters that were submitted today.'",
        "'speaker_6': 'I apologize for them being late, but we only got the safer letter. Late yesterday afternoon we worked late into the night to respond to it. And those letters, both from our firm and from the expert air quality firm of ramble, thoroughly refute the the late comment letter that was submitted yesterday.'",
        "'speaker_6': 'I'll briefly touch upon some of the issues in those letters regarding the claim that an ER is required or a tour de air. The city determined in its discretion as lead agency that the addendum was the appropriate level of seek review.'",
        "'speaker_6': 'It tiered off the downtown plan which analyzed the full impact of build out under that plan, including build out of the project site. So contrary to the comment, the the project was covered by the air and the city prepared the addendum to determine that and to investigate whether there was any project specific impacts that would be greater'",
        "'speaker_6': 'than or new beyond those set forth in the program. Air. The addendum and its expert studies provide substantial evidence that no such impacts exist, and therefore the addendum was the appropriate level of seek review. The appellants interpretation of the law is just wrong.'",
        "'speaker_6': 'There's a case called Monti Brothers versus City of Los Angeles with completely refutes his contention earlier. Happy to discuss that case further. In addition, as set forth in the program, this er was intended to streamline, seek review and avoid redundancy of the secret process.'",
        "'speaker_6': 'The program the EIR provides that projects that are consistent with the develop ment intensity. Intensity the plan shall not be subject to additional review except to the extent that they may result in project specific, new or substantially greater impacts.'",
        "'speaker_6': 'The project is fully consistent with the downtown plan. The addendum confirms that there are no such project specific impacts, so therefore under secure guidelines, section 15183 no further seek review is required regarding the assertion of indoor air quality impacts as set forth in the expert letter from Ramble, Safer uses a number of flawed assumptions in calculating these'",
        "'speaker_6': 'really scary numbers of cancer deaths. Indeed, unbelievably scary numbers. The flaws include a failure to include the voluminous regulations that have been adopted both on the state and local level, to address indoor air quality, including ones that limit the amount of formaldehyde in building materials.'",
        "'speaker_6': 'In addition, formaldehyde emissions decrease over time. The analysis didn't take that into account. It also assumed that workers would remain in the same job in that building for 45 years and that residents would remain there for a 70 year lifetime.'",
        "'speaker_6': 'Those assumptions are just overly conservative and quite frankly, not realistic. The Ramble letter confirms that the project will not have any significant air quality impacts regarding the health risk assessment. The appellant asserts that the city should have prepared a quantitative health risk assessment for the project's construction and operational emissions.'",
        "'speaker_6': 'Neither the city nor the South Coast Air Quality Management District requires health risk assessments or areas for short term construction activities due to the limited duration of exposure of emissions from those activities. According to the air district's methodology, health effects from air contaminants are assessed based on a lifetime that's 70 years.'",
        "'speaker_6': 'In this case, the construction would be 20 months, a fraction of those 70 years. Therefore, under the applicable methodology of the Air District in the city, no quantitative health risk assessment is required. In addition, the current SC HQ, M.D., HRA guidance recommends recommends an operational source HRA only if a project will generate a substantial amount of diesel'",
        "'speaker_6': 'particulate matter from diesel vehicles. So therefore they would call for such an assessment, for heavy fruit, for for projects with lots of heavy duty trucks, including truck stops, warehouse distribution centers, transit centers, ship hoteling IT ports and train idling.'",
        "'speaker_6': 'None of those uses are part of this project as projects in urban infill project consisting of residential and retail that will not generate a substantial number of diesel truck trips and therefore no quantitative HRA is required. Moreover, as set forth in the Ramble letter we submitted today, the crude screening level health risk assessment submitted by the appellant'",
        "'speaker_6': 'in their last minute letter yesterday is based on a number of flawed assumptions, including substantially overstating both the operational and the construction emissions and is simply not credible regarding greenhouse gas emissions, the appellant asserts. The Dentons GHG analysis should have used a decade old draft numeric threshold that was never adopted by the academy or the city, and'",
        "'speaker_6': 'indeed there is no applicable threshold. And therefore sequel allows the city's lead agency to come up with its own threshold. In this case, the threshold selected consistent with both the school guidelines and school case law, was consistency with applicable greenhouse reduction plans.'",
        "'speaker_6': 'The addendum concluded that the project was so consistent and therefore properly concluded that impacts were less insignificant. And keep in mind, this is an infill project that's well-served by transit. It's going to have a green roof and achieve LEED certification.'",
        "'speaker_6': 'This is the sort of project that represents smart growth and that will reduce greenhouse gases, vehicle miles traveled and impacts on the climate. Lastly, I just want to reiterate that the project will have a lot of important public benefits.'",
        "'speaker_6': 'It's going to increase the city's housing stock without displacing any existing homes. Elad Housing within walking distance of transit jobs, retail entertainment uses downtown. That will reduce help reduce dependance on automobiles, which will in turn reduce vehicle miles traveled and associated air emissions, pollutant emissions, as well as greenhouse gas emissions.'",
        "'speaker_6': 'It will provide public open space in the form of a pedestrian paseo, and it will promote sustained sustainability in water and energy conservation by including a green roof and achieving LEED silver certification or equivalence. In addition, it will implement and is fully consistent with the downtown plan.'",
        "'speaker_6': 'Therefore, we respectfully request that you deny the appeal and uphold the Planning Commission's well-reasoned approval of the project. I'm available for any questions you may have. Thank you.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_2': 'And with that, that concludes the rebuttal. We're going to go ahead to any concluding remarks by staff. Are there any.'",
        "'speaker_4': 'Preferable, only four questions. Okay.'",
        "'speaker_2': 'We're going to go and go to public comment. Those are two here to speak on the hearing. So let me go to you here. No, I mean, is Brian Flynn, Leona Noble, Christine Boss and Lillian Chen, those first four speakers, please come forward.'",
        "'speaker_2': 'Brian Flynn. O'BRIEN okay. Liana, Christine, Lillian and Sam. Then those will be the first four.'",
        "'speaker_1': 'My name is Lana Noble. I'm here tonight on behalf of the North Pine Neighborhood Alliance. I live in the Walker Building, which is right adjacent to this project. But I'm speaking on behalf of our neighborhood group. And we are not here around the environmental issues that have been raised by the appellant.'",
        "'speaker_1': 'But we're seizing this opportunity to tell you as our counsel, that having worked with staff and we appreciate the accessibility and the patience of the staff and working with us as a neighborhood group. But we have been consistently saying to anybody that we communicate with what our neighborhood needs is not market rate housing.'",
        "'speaker_1': 'We need affordable and low cost rental housing. And nothing in this project addresses that for us. Our other concerns about being next to a 23 storey tower are that you are going to have a major impact on commuter and daily traffic trash delivery and pick up, which is a horrendous problem.'",
        "'speaker_1': 'It's cowboy Wild West in our neighborhood because of all the private haulers that all of these day to day issues that are very real to us as residents downtown are going to be.'",
        "'speaker_9': 'Exacerbated.'",
        "'speaker_1': 'By this density. We support density. That's why a lot of us live in downtown. But this project does not serve the residents of our neighborhood.'",
        "'speaker_2': 'Thank you so much. Kristine Boslough, Ian Chen, Sam for Zena for if I mispronounce some of these names.'",
        "'speaker_1': 'Right. Good evening, Mayor Garcia. Council members and staff. My name is Christine Voss. I serve as the government affairs manager for the Long Beach Area Chamber of Commerce. I'm here tonight on behalf of our 800 members, leadership and community stakeholders to express our support for the approval of the Third Pacific Project.'",
        "'speaker_1': 'The Chamber has a long standing position of supporting projects in a similar scope. Currently, a main public policy goal of our organization is to support more housing development in Long Beach, especially housing that's located near public transit. In addition to the increase in housing, the project will also offer commercial and retail space, which in turn will create'",
        "'speaker_1': 'more local jobs in the downtown area, complementing our goal to support and encourage economic development in Long Beach. We support the project to Third Pacific because it will make the most of its location offering housing located near transit while simultaneously increasing jobs and walkability in the downtown area.'",
        "'speaker_1': 'We appreciate your time and thoughtfulness on these considerations. Thank you.'",
        "'speaker_2': 'Thank you. Lillian Chen, please.'",
        "'speaker_1': 'Good evening, everyone, and thank you so much for your time. And then I am Lillian Chen.'",
        "'speaker_2': 'And 1/2. I'm sorry. Is Sam next? Yes, Sam, please come forward. I want people just to line up behind Sam present. John Connally is and. Oh, no, no, no, no. You're going to continue. I just need to call my folks up.'",
        "'speaker_2': 'Lillian Sam. And then is. Is John Connelly here? Okay. Is Ken controlling to speak to this? Please come forward in behind John and then call this rally right behind and control. Thank you.'",
        "'speaker_1': 'I am the second district resident and my story of moving to Long Beach about a year ago has motivated me to stand here and tell you my story. One thing that I like the most about downtown Long Beach is that it's an incredibly walkable and transit friendly city.'",
        "'speaker_1': 'I have been living in Long Beach for more than a year and working in downtown, and I don't have a car. I take the bus, I take the metro to L.A., I take the bike, and I sometimes scooter with my friends.'",
        "'speaker_1': 'And I think it's a big part of my enjoyment in living in downtown Long Beach, which is why I believe that a project like this in the high density area in downtown Long Beach would encourage people to start using their car less and taking the transit more often.'",
        "'speaker_1': 'In addition, I really like the idea that more developments are coming to market as the streets start feeling safer and I start seeing more people on the street and it makes the city feel more lively and more pleasant to live in.'",
        "'speaker_1': 'So I fully support this project and thank you so much for your time.'",
        "'speaker_2': 'Thank you so much.'",
        "'speaker_4': 'Next week, please. Good evening, mayor, vice mayor and council members. My name is Sam Zina. I'm a resident of the second district. I also serve on the board of the DLP and I am an employee of Long Beach based on some real estate investments.'",
        "'speaker_4': 'I just wanted to vocalize my support for the project. I believe it's a tremendous contribution to the Renaissance. It's already well underway in Long Beach. As Long Beach begins to.'",
        "'speaker_6': 'Transform into more of a Class.'",
        "'speaker_4': 'A, you know, walkable, urban waterfront that people want to live, work and visit, I think it does fantastic things in terms of enhancing the pedestrian experience and creating new connectivity between area Pacific right now that's underutilized and pine, creating this great new pedestrian sale and activating the streets with new retail.'",
        "'speaker_4': 'In addition to that.'",
        "'speaker_6': 'With the 345 units.'",
        "'speaker_4': 'Going in in the 500 plus new residents that this will surely bring about. That's 500 new people that are activating our streets, contributing to our community and supporting local businesses. So, again, it's here today to support the project.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_2': 'Thank you very much. Next speaker, please. John. After carelessly Austin is going to come up and after ostensibly be Joannie Cunningham and then during.'",
        "'speaker_6': 'Good evening, Mayor Garcia and council members. I'm here to talk about an issue that hasn't really been brought up other than the fact that 563 parking.'",
        "'speaker_7': 'Spaces are supposed.'",
        "'speaker_6': 'To be produced in this building. For any of you who live in the First District, as I do, you already know that on street parking is a nightmare and there's totally inadequate.'",
        "'speaker_2': 'Preparation on behalf of the existing buildings.'",
        "'speaker_6': 'To accommodate.'",
        "'speaker_7': 'The people who.'",
        "'speaker_2': 'Don't have assigned parking. It is a critical situation.'",
        "'speaker_6': 'To watch people.'",
        "'speaker_4': 'In the evening driving around looking.'",
        "'speaker_6': 'For a parking space for a half hour, an hour.'",
        "'speaker_1': 'Or more.'",
        "'speaker_6': 'In the previous letter to our departed first District Representative, somebody was complaining that he was going to run against her simply because he couldn't find a parking space at night. This was in our local run, your newspaper. What we need is.'",
        "'speaker_2': 'To establish a parking.'",
        "'speaker_6': 'Program that meets the needs of the upcoming population that we now have.'",
        "'speaker_2': 'As it grows in this area. Thank you. That's my statement. Thank you, sir. Next speaker, please.'",
        "'speaker_1': 'Good evening. And Cantrell and I first learned about this project at the Planning Commission hearing, and I was astounded to find out that the city owned this property. Two parking lots. And now there's going to be a 269 foot building built.'",
        "'speaker_1': 'When there is no parking available. Well. There's going to be parking for 128 bicycle riders. I'm surprised that you can find. That many people riding bikes, living in this area. When there is not one affordable unit planned. For this building, you could have used the city owned property to build affordable and low cost housing, which is desperately'",
        "'speaker_1': 'needed. It's also not going to be a gold LEED. It's going to be silver, which means it's not going to have solar. Unless it's going to be sold or ready. But they are not having solar on the roofs.'",
        "'speaker_1': 'Those. If you're going to allow this to be built, I urge you to require some affordable units and premium.'",
        "'speaker_2': 'Thank you so much and lead. Thank you very much. I closely.'",
        "'speaker_1': 'Carelessly. I'm here in support of the appeal. I was really surprised to find out that there was going to be 23 stories built and another one with eight stories at market rate. We hear over and over again from the city how we need additional low income housing and affordable housing.'",
        "'speaker_1': 'And this is an opportunity where you could have made that happen. Additionally, there's the town looking looking at the Internet. I checked out the word gentrification and Long Beach and all of downtown is colorized to show that it's been gentrified.'",
        "'speaker_1': 'So that basically tells you the data is in and the intent is there to move low income people out. There's going to be increased traffic problems, potentially between 507 hundred more cars rolling out the driveway. I don't see how that cannot be an air issue.'",
        "'speaker_1': 'And if you look at the parking, there's 563 parking spaces, which I think should probably really be about 700. So you're going to have 150 people looking for parking out on that street. This seems like it's a bad experiment.'",
        "'speaker_1': 'I, I met a man named Jack Broten, who was a colonel in the Air Force, who was in the foremost air base close to Hanoi back in the days when I worked for Rockwell.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_6': 'Mostly.'",
        "'speaker_1': 'I'll tell you that story another time.'",
        "'speaker_2': 'I said.'",
        "'speaker_7': 'It's on him. Perfect.'",
        "'speaker_4': 'All right. Good evening, Honorable Mayor and City Council. My name is Oscar Montoya. I am with the downtown Long Beach Alliance, and I'm here to speak in favor of the 13 Pacific Project. Some of you may know the downtown Long Beach Alliance is a nonprofit organization that manages the two business improvement districts in downtown.'",
        "'speaker_4': 'And our stakeholders are comprised of business owners, commercial property owners, as well as residents. And through that community based process, the deal, they came to support this project, particularly through our Economic Development Committee, which is comprised of business owners along in North Pine, as well as on Pacific residents in the North Pine area, as well as property'",
        "'speaker_4': 'owners. And they all unanimously, unanimously chose to support this project. We believe that the project aligns with the downtown plan. The downhill mine has served as a guiding document for encouraging impactful, community oriented and mixed use development. And Third and Pacific Project aligns with those goals.'",
        "'speaker_4': 'And moreover, we agree with the city's assessment that this project itself aligns with the development standards and the program air prepared in the downtown plan. One final piece to note is that we believe that the project will be able to connect both Pine Avenue, North Pine and Pacific Avenue.'",
        "'speaker_4': 'Supporting a lot of our new investment are new businesses along Pine Avenue and helping them.'",
        "'speaker_7': 'To create foot traffic for.'",
        "'speaker_4': 'People to experience what is happening in downtown. So I appreciate your time and the opportunity to share our support tonight, and we encourage the city council to vote in favor of this project. Thank you.'",
        "'speaker_2': 'Johanna Cunningham and then Jordan Wynn, and we'll go back to the council.'",
        "'speaker_1': 'Good evening, Honorable Mayor and City Council. My name is Johanna Cunningham, founder and CEO for National Short Term Rentals, and I'm here to express my support for the Third and Pacific Project. As a downtown business owner on Fourth Street, I'm excited to see the ongoing revival and investment in this downtown area.'",
        "'speaker_1': 'Particularly, I'm happy to see the site along Pacific Avenue between third and fourth Street being developed. The nearly 345 residential units will help bring increased resident traffic to North Pine and Pacific Avenue. The third and final project plan of 345 residential units assists in that goal by creating a consistent flow of pedestrian foot traffic by potential customers'",
        "'speaker_1': 'throughout this downtown corridor. I thank you for your time and I encourage you to support the project.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Jordan. Hi there, Jordan Wynn, recent second district resident. I actually just moved downtown and I have two concerns about this project. One is similar to the appellate. I do see that there are some significant environmental impacts that I do believe require an area that is more than just, you know, an addendum.'",
        "'speaker_6': 'I think that, you know, moving into this new neighborhood has me a bit concerned about the environmental impacts that the development will have on me as a new resident. And the second concern that I have is, of course, about affordable housing.'",
        "'speaker_6': 'One stat that's not really talked about very much is the vacancy rate in our city, and that is the number of units that are sitting vacant. It's very low, it's below 3%, which is considered not healthy for a cityscape.'",
        "'speaker_6': 'Many of that vacancy currently sits in our downtown area as certain units that are gentrifying. People out of the first and second districts are pricing up the market in sitting vacant. Unfortunately, I don't want that to be the case here.'",
        "'speaker_6': 'I do think it's a bit of a shame that there aren't affordable units in this development. I do support density and I do think that density is an important part of building an efficient and effective city of the future.'",
        "'speaker_6': 'But I also believe in affordable housing for all, and that housing is a human right. And so I urge you to consider those two things. Thank you.'",
        "'speaker_2': 'Thank you. We're going to close the public hearing and go back to the to the council. I'm. The vote itself, of course, is to deny the appeal. That's correct. Mr.. Mr.. Mr. Mays. Correct.'",
        "'speaker_4': 'That's not the recommended action.'",
        "'speaker_2': 'Okay. And there's a motion and a second. Councilmember Pearce.'",
        "'speaker_5': 'Yes, I had a few questions. One is on timing. Obviously, we don't have a councilmember in the first district. And so just wanted to be clear that this was a vote that we needed to, in fact, take today.'",
        "'speaker_4': 'Yes. Councilmember under the municipal code, it's 2120 1504b.'",
        "'speaker_6': 'This action has to be taken within 60 days. We're hitting that 60 days. If you were to fail to take an action tonight that the appeal would be deemed denied. So there is no opportunity to extend or delay this.'",
        "'speaker_6': 'We need to take an action tonight.'",
        "'speaker_5': 'Okay. Thank you for that. Just a little bit of context before I make the motion. Obviously, with the downtown plan that happened in 2010, there was overall E.R. that was done as part of that. There was a process that said how many residential units we would have, how many hotels we would have as a community member on'",
        "'speaker_5': 'the outside of of city hall at that time, we advocated to include some affordable housing, some set aside, and we were not able to get those things at that time. And so it's my understanding that this item in front of us is in alignment with the downtown plan.'",
        "'speaker_6': 'That's correct. This item meets all of the provisions of the downtown plan. And what's in front of you is just an appeal of a planning commission consistency finding. So we're not determining whether the project is good or bad or making a policy analysis.'",
        "'speaker_6': 'We are looking at the more narrow issue of whether it complies with the downtown plan as adopted.'",
        "'speaker_5': 'Right. And I wanted to lift that up because we do have opportunities coming up, whether it's in PD six, whether we're talking about the land use element, where community members should be advocating for affordable housing as a general policy of the city versus project by project.'",
        "'speaker_5': 'If I felt like there was a way to have a discussion around including affordable housing in this project that is not in my district, then I most certainly would. But that is not what is before us today. And so, again, I applaud the affordable housing advocates that have worked hard on other issues and want to make sure'",
        "'speaker_5': 'that you don't mess up other opportunities to advocate for inclusionary housing. It is, you know, after reviewing everything and talking to several folks, I would like to deny the appeal and move forward with this vote today. So thank you.'",
        "'speaker_2': 'Thank you. That's the motion that's in front of us today. There's Rosemarie Andrews and any comment on the second? Then the motions on the floor as recommended by staff. And it's to conclude the public hearing to consider an appeal.'",
        "'speaker_2': 'Right. And deny the appeal. That's correct, Mayor. Thank you.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Feasibility Report on App Program for Street Sweeping Parking Management.": [
        "'speaker_2': 'Thank you. That's the last hearing on the agenda. We're going to move on to the other items on the agenda, beginning with item 13, please.'",
        "'speaker_0': 'Communication from Councilwoman Price, Councilmember Pearce, Vice Mayor Andrews, Councilman Austin, recommendation to request city manager to report back within 180 days on the feasibility and possible implementation strategies for an Internet based app program to help manage parking impacts during weekly scheduled street sweeping.'",
        "'speaker_3': 'If I see a person in second then only public coming. It's quite.'",
        "'speaker_9': 'Thank you. Thank you, Vice Mayor. I want to begin by thanking our public works department and especially Dikko for his amazing work related to street sweepers over the past few years and implementing the technology that's available. Obviously, we all know that street sweeping is not one of the most interesting topics that our city works on, but it's'",
        "'speaker_9': 'absolutely essential and it's so relied upon by residents to keep our streets clean and well-maintained. The Public Works team has committed to finding ways of improving the service by changing all of the street sweeping hours citywide to make it easier on residents.'",
        "'speaker_9': 'And that was a huge endeavor that resulted in very positive quality of life impacts for our residents. Our public works team has worked hard to upgrade our street sweeper fleets to ensure that they're using up to date technology and modern equipment.'",
        "'speaker_9': 'And so with this progress, we're now at a point where we have the potential to take another big step to improve resident experience during suite, sweep street, sweeping hours, and to use technology that can help manage the impacts on parking in our parking impacted areas during Sweet Street Sweeping.'",
        "'speaker_9': 'Parking is very difficult in many parts of the city, and allowing this item to move forward to create street sweeping app technology that allows us to be smarter and letting residents know when street sweepers have left the particular street or area is very important and promising.'",
        "'speaker_9': 'Our residents deserve this council to look outside the box and find ways of making their quality of life and user experience more positive and hopefully helping them reduce tickets and parking impacts in their communities. I ask my colleagues support and in this item and moving it forward so that we can explore what the options are for us'",
        "'speaker_9': 'and using our current technologies to enhance the user experience for our residents by making it possible that we can alert our residents when the street sweeper has passed their street so that they can be free to park in the area, especially if there's still an hour and a half or an hour left in the blocked out periods'",
        "'speaker_9': 'of time. Thank you so much.'",
        "'speaker_3': 'Thank you, Mrs. Spears.'",
        "'speaker_5': 'Yeah, I support this item. I guess I would ask. I'm. I'm curious. I know we have a lot of apps, parking apps for our meters and everything else. I'm curious if we can get some data on the usage of those apps, because I feel like a lot of my constituents, every time I bring it up a community'",
        "'speaker_5': 'meetings that we have these apps, they're not aware. So in bringing this item back, if we could just include kind of where we're at on some of those parking apps already. That would be.'",
        "'speaker_1': 'Helpful. Thank you.'",
        "'speaker_3': 'Thank you. Announcements open all.'",
        "'speaker_8': 'Thank you. I support this item and I don't know if this rises to the level of a friendly amendment, but what I'd like to explore, what I've been asked about is will the app enable us to or enable residents to see the street sweeper coming?'",
        "'speaker_8': 'And is will they be able to see it 10 minutes, 5 minutes ahead of time to move a car as it approaches? So if that's not decided yet, I'd like to include that in the item.'",
        "'speaker_9': 'Well, so if I can just speak to that. I was trying to tread lightly with this item because I realize that it could impact budgets and the like. So where I thought we could start is with whether we can get residents can get similar to a like an alert Long Beach where they can get a notification if'",
        "'speaker_9': 'they're signed up for the service after the street sweeper has left so they can go and park there if that technology is available, then of course, the next inquiry would be whether or not they can get an alert that the street sweeper is coming.'",
        "'speaker_9': 'So but that that is another phase. And I'm hoping to tread lightly on this as we move it forward. But I think if the technology is available for one, it should be available for the other. But I was hoping that this item could be limited to the Post.'",
        "'speaker_1': 'Street Sweeper Alert.'",
        "'speaker_8': 'Thank you. Asked and answered.'",
        "'speaker_3': 'All right. Now I'm going to go back to the public because I didn't call the names out as Mr. Larry got here. Okay. Mrs.. Mr. Shelton. Okay. And Cantrell. Fine Cinnamon, because would you please cast your vote in?'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Report on Retail Commerce Trends and Strategies for Long Beach.": [
        "'speaker_3': 'Line Item 14, please.'",
        "'speaker_0': 'Communication from Councilwoman Price Council Member Pierce, Councilman Austin. Recommendation to direct City Manager to prepare a report on the status of retail commerce regionally and in Long Beach with a focus on brick and mortar establishments and provide an update to the city council.'",
        "'speaker_0': 'And 120 days?'",
        "'speaker_3': 'Yes. Do you have any county council comments on this? Very good hill. Mr. Encontraram. Are you going to work on this? Right. Okay.'",
        "'speaker_9': 'Surprise you. I asked my colleagues to support this item. As we have all seen, the Internet has changed just about every aspect of all of our lives, and there's no exception to that reality when we think about retail establishments and retail health in general, as we know almost daily now, there are articles and newspapers around the country'",
        "'speaker_9': 'talking about the end of retail malls closing nationwide as a result of Internet commerce and access to goods through the Internet. This has had a tremendous impact, if not already. I expect it will on many of our business corridors.'",
        "'speaker_9': 'We're not alone in this. The city of Beverly Hills has seen unprecedented vacancies on little Santa monica Boulevard. State Street in Santa Barbara has seen unprecedented vacancies just in the last two years on State Street, upper and lower.'",
        "'speaker_9': 'And we're starting to see that throughout the state of California in different business corridors. I'm hoping that our economic development department can really take a deep dove on this issue and figure out what is happening with retail and how can retail change so that it is more integrated with online commerce that we're seeing?'",
        "'speaker_9': 'I'll give you an example of a store that just opened in the third district at Second and PCH. It's called Nike Live. There are two Nike Live stores in the world. There's one in Tokyo and one in Long Beach, which is pretty exciting.'",
        "'speaker_9': 'And what Nike Live does is that they monitor online sales within the region based on zip code so that they know what people in the area are purchasing online and they stock the store with items that people are purchasing online to create a sense of community trends, community style connection.'",
        "'speaker_9': 'And that's just one way that they're trying to integrate online shopping with the brick and mortar experience. What are ways that our retailers, our current retailers can continue to stay competitive with an online presence of competing stores? So I'm hoping that our economic development team can come back with some ways that we can help modify the way'",
        "'speaker_9': 'we're doing things, some education that we can provide to our small businesses and especially our retailers. And some ways that we might be able to change as a city to allow businesses to continue to thrive. Whether that means changing regulations that we've held on to in the past in terms of parking, development, building, etc., to allow for'",
        "'speaker_9': 'companies to establish here in the city and to continue to help our business improvement districts thrive with both services, restaurants, with all services, restaurants and retail thriving alongside one another. So thank you in advance for your support, colleagues.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_7': 'Yes, I'm happy to second this item. When this was presented, I thought it was very thoughtful and hopefully so give our economic development department something else to do in terms of making us smarter as a city, in terms of how we we look at, you know, how we help businesses.'",
        "'speaker_7': 'I know I brought forward an item a few months back to study vacancies and vacant properties, and I think this is somewhat in line with that as well. And I think it would also be good and helpful to understand the the impacts of e-commerce on on sales tax revenue or potential lost sales tax revenue here in the'",
        "'speaker_7': 'city. Because that, to me, I think, is one area that that we need to look at as well. But I'm happy to support this. And perhaps we can we can have that conversation further in another time. Thank you.'",
        "'speaker_2': 'Thank you. Our next step is Councilman Pearce.'",
        "'speaker_5': 'I guess I was happy to sign on to this item. I think it's a great start to a bigger conversation. I am happy to say that I've met with John with economic development this morning and had some conversations similar.'",
        "'speaker_5': 'Just this week we had another two businesses on Fore Street. The AIDS food store and a barber shop have their rent increase over three over three times. So I went from $3,000 a month to $9,000 a month in rent.'",
        "'speaker_5': 'And so I know that while there's online challenges, there's also the rental market challenges as well. Additionally, I know that majority of our retail stores on Fore Street also sell online. And so what is the capacity of our local mom and pop businesses to get access to resources and support, to be able to understand how to go'",
        "'speaker_5': 'out and get new clients, new returning clients as well. And so I look forward to our many conversations to come. Thank you.'",
        "'speaker_2': 'Thank you. Mr. Good here in control. Want to speak to this item at Sink. Seeing nonmembers, please. Gordon, cast your vote.'"
    ],
    "Resolution and Lease Agreement for Winter Shelter Operation.": [
        "'speaker_4': 'Ocean carries item.'",
        "'speaker_2': '15.'",
        "'speaker_7': 'A report from Economic.'",
        "'speaker_4': 'Development, Health and Human Services. Recommendation to adopt a resolution declaring a shelter crisis and authorize the operation of one winter seltzer for the period of December 1st through March 31st, 2021.'",
        "'speaker_2': 'Thank you. There's a motion to second. Is there any public comment on this item? Mr. Goodhew. Gary Shelton, want to speak to this. See here, Miss Cantrell of Jordan. Are you speaking to this? And while you're coming up, let me actually get a short staff presentation.'",
        "'speaker_2': 'I know this is an annual important move that we make, and I think it's critical, especially as we move towards building a more permanent shelter and municipal shelter as well.'",
        "'speaker_6': 'Mr. MODICA Thank you, Mr. Mayor. Absolutely. This is one of the more important things that we do every winter. So with that, Sergio Ramirez, our deputy director of economic development, will give the report. Thank you, Tom. Mr. Mayor and council members.'",
        "'speaker_6': 'I'll try to be as brief as possible.'",
        "'speaker_4': 'We've identified.'",
        "'speaker_6': 'A location for this year's 2019 winter shelter at 1718.'",
        "'speaker_4': 'Through 1722 Hays.'",
        "'speaker_6': 'Avenue in Council District one. The the property was actually purchased earlier this year using homeless emergency aid program funding. The premises of the property or the premises is approximately 54,000 I'm sorry, 5400 square feet. This year, the terms of the lease will be between December 1st, 2019.'",
        "'speaker_4': 'To March 31st, 2020, in order to.'",
        "'speaker_6': 'Open at the.'",
        "'speaker_4': 'Homeless shelter.'",
        "'speaker_6': 'By by our target date, the site requires the adoption of a resolution declaring a shelter crisis, allowing provisions of local law to be suspended so that the shelter can open in a timely manner.'",
        "'speaker_4': 'Staff recommends adoption of the resolution declaring a shelter. Crisis spending apple-google provisions of local law.'",
        "'speaker_6': 'Authorizing the operation of a winter shelter program for a period of December 1st, 2019, through March 31st, 2020.'",
        "'speaker_4': 'And authorize the city.'",
        "'speaker_6': 'Manager designee.'",
        "'speaker_4': 'To execute the lease agreement, including all necessary.'",
        "'speaker_6': 'Documents. Amendments with United States Veterans.'",
        "'speaker_4': 'Initiative for the property at 1718 three 1722 Hayes Avenue as a winter shelter. That concludes our.'",
        "'speaker_6': 'Report. Be happy to answer any questions.'",
        "'speaker_2': 'Jordan, please go ahead.'",
        "'speaker_6': 'Jordan wins second district president. I'm glad that you guys are opening up the winter shelter once again. Glad that this could come together. I do want you to take a quick look at what the property looks like and think about also the meaning of what a shelter crisis is, the fact that we have so many people that'",
        "'speaker_6': 'are living on our streets right now that need immediate housing assistance that we need to open this up. I hope and pray for David one day when Long Beach will no longer need the winter shelter. In order to do that, we are going to need steady and sufficient resources to help our homeless population in Long Beach.'",
        "'speaker_6': 'This includes investment into long term, supportive and affordable and bridge housing programs, along with jobs, training programs and other important, consistent services that our city needs to fund. We have our own continuum of care, and I happen to sit on the board of that continuum of care for Long Beach.'",
        "'speaker_6': 'This means that we administrate our own homeless services division, and it means that we receive our own separate federal funding for this. Federal funding is very inflexible. It goes towards very few resources, as I'm sure most of you know.'",
        "'speaker_6': 'And so I just want to once again voice my support, of course, for this winter ordinance and winter shelter. But I also want to stress the importance of creating supportive, affordable and bridge housing and having a consistent source of funding locally so that we can create these things and once and for all, end homelessness in Long Beach'",
        "'speaker_6': '. Thank you. Thank you.'",
        "'speaker_2': 'There's a motion in a second. Unless you have any comments concerned. Nope. Please cast your votes.'"
    ],
    "Contract Amendment and Appropriation Increase for Civic Center Technology Services.": [
        "'speaker_2': 'Thank you. Item. 19.'",
        "'speaker_4': 'Report from Public Works, Technology and innovation. Recommendation to execute an agreement to contract with Arab increase in the contract amount by $700,000 for services related to the Civic Center citywide.'",
        "'speaker_2': 'Thank you. There's a motion in a second. Ms.. Control. Miss carelessly, please come forward if you want to speak.'",
        "'speaker_7': 'Mayor. Your staff report.'",
        "'speaker_2': 'Mr. Modica, you want to give a quick staff report on this?'",
        "'speaker_6': 'Yes, Craig. Back where? We have the staff report.'",
        "'speaker_2': 'Think you may remember City Council. The item.'",
        "'speaker_6': 'Before you this evening.'",
        "'speaker_2': 'Is an extension of an ongoing contract that we have.'",
        "'speaker_6': 'With Eric.'",
        "'speaker_2': 'Eric has been the city's consultant through the development of the Civic Center project. We are close to closing out a few items and we seek their expertize in ensuring that the close out process goes smoothly. On the public works side, that includes finalizing all of the change order documentation.'",
        "'speaker_6': 'The warranty.'",
        "'speaker_2': 'Elements and the as built.'",
        "'speaker_6': 'Plans. And on the technology side.'",
        "'speaker_2': 'That includes finalizing some of the technology components, including how we move forward with.'",
        "'speaker_4': 'The.'",
        "'speaker_2': 'Finalization of the civic chambers. I'm available to answer.'",
        "'speaker_6': 'Questions and it is as.'",
        "'speaker_4': 'Well if you have technology.'",
        "'speaker_2': 'Questions. Thank you. It's. Or. I'm sorry, Miss Cantrell.'",
        "'speaker_1': 'Yes. And control and. I really am horrified by the fact that you're having to spend $700,000 more. For the technology at the Civic Center. This has become a. Dead whole that were throwing money down. And that's not to exceed $11 million.'",
        "'speaker_1': 'I'm puzzled as to where these funds are coming from. It says that 480,000 will come from funds available from the General Service says Fund in the Technology and Innovation Department. Is this something that's in the budget? Or I'm I'm really concerned about where we got.'",
        "'speaker_1': '$700,000 more. And 224,000 are coming from the public works department. Does that mean that. The infrastructure. Our city streets and sidewalks will not be repaired because the civic center needs. More money. To close out your contracts. I would appreciate if somebody could answer where these funds are coming from.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Nick. Speaker, please mislead.'",
        "'speaker_1': 'I've been musing over this extension of measure, and I started looking into it and finding the charts that showed what we're spending that money on. And there was something called structural. And then a friend of mine who's in finance said, Oh, that means structural deficit.'",
        "'speaker_1': 'And I looked up the definition of a structural deficit. And that means you're spending more than you earn or you have revenue for, and that it is a consistent problem when it's structural. So that means we have money problems already and we're not going to be able to live up to the promise of sunsetting measure.'",
        "'speaker_1': 'And then we look at this money pit that we're in right now. This building, according to the kafir, will cost $1,000,000,000 by the time we're done paying for it. So it seems like there's a lot of unnecessary spending going on when in fact we should be tightening our belts.'",
        "'speaker_1': 'And I'm really disappointed in this council in terms of I don't know that we have anyone with a business background in this group. That is being careful with our money. Anyway. I'm appalled.'",
        "'speaker_2': 'Thank you. There's a there's a motion in a second. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Next up is item number 20.'",
        "'speaker_0': 'Communication from City Attorney Recommendation Declare ordinance amending the Long Beach Municipal Code prohibiting the sale of flavored tobacco products. Read the first time and lead over to the next regular meeting of City Council for Final Reading Citywide.'",
        "'speaker_2': 'If there's a motion or a second, is there any public comment on this item? There is. Let me.'",
        "'speaker_9': 'And I make a few may talk before public comment.'",
        "'speaker_2': 'Yes. Let me let me just do this really quick. I just need you to organize public comment to give me what I didn't realize it was so lengthy. I'm going to come back to the stadium in just one minute.'"
    ],
    "Ordinance to Ban Flavored Tobacco Sales in Long Beach.": [
        "'speaker_2': 'Thank you. We're going to go ahead and go to the the last item, which is this which is the ordinance. And we do have significant public comment on this. And so let me. I think we have over 20.'",
        "'speaker_2': 'And so I want to make sure that we first go back and start with Councilwoman Price and then we'll go from there. And then I want to make sure I'll so I'm going to I'm going to we're also going to reduce public public comment, obviously, because of the length.'",
        "'speaker_2': 'But Councilman.'",
        "'speaker_1': 'Price. Sure.'",
        "'speaker_9': 'And the reason I wanted to speak first is because there are a number of changes that I'm going to be requesting that be made and maybe that will eliminate the need for some of the public comment. But if not, that's fine, too.'",
        "'speaker_9': 'So first of all, I want to thank the city attorney for coming back to us with this ordinance so quickly. And I want to thank our health department for the great research that they did and the very informative, too, from Ford Memo that they produced for council members that is available to the public.'",
        "'speaker_9': 'If anyone is interested, you can reach out to our office. We brought this item as an urgency item on the supplemental agenda because we wanted to get the conversation started. And I'm glad that we're here now having this conversation.'",
        "'speaker_9': 'And of course, we all know that there's a lot of uncertainty out there right now in terms of what the public health epidemic is, what's causing it, and where we're headed as a country in regards to some of the regulations.'",
        "'speaker_9': 'I want to focus tonight's item really on vaping products in particular, because that that appears to be the area where there is significant uncertainty about what's leading to injuries and death cited in our own health department report, where CDC conclusions and statements explaining that flavorings in particular have been shown to cause serious lung injuries when inhaled.'",
        "'speaker_9': 'Additionally, there are serious concerns that chemical flavor flavorings, when heated, can be causing respiratory damage when inhaled. The goal of proposing this measure for me was literally to mitigate the amount of youth consumption that we see and potentially to save lives and prevent any additional lung injuries to residents of this city.'",
        "'speaker_9': 'Youth addiction, as we know, is a huge, huge concern as nicotine addiction in youth has been growing in recent years after decades of falling addiction numbers. A temporary ban works to make it harder for youth to get highly addictive products that are targeted to them with sweet candy flavors.'",
        "'speaker_9': 'A temporary ban also helps us gather more information on this health concern and monitor what the federal government and others are doing to research the current public health epidemic that we are seeing. Finally, a temporary ban is meant to be an accommodation to our local businesses.'",
        "'speaker_9': 'To say that we are looking to put a pause on this until federal legislation is more defined and we have finalized data on what this health emergency really is about. Many cities, in fact, almost all cities that have enacted a ban have enacted a permanent ban.'",
        "'speaker_9': 'But here in Long Beach, I want to be thoughtful and not reactionary. And I want to make sure that we have a temporary ban in place, but that we can continue to work with our health department and our businesses to figure out how we shape a policy moving forward that allows our businesses to stay in existence in'",
        "'speaker_9': 'a manner that is safe and protects the public from addiction and the harmful effects of vaping products. With that, the following changes are the changes that I'm requesting be implemented as part of the ordinance, which will have to come back for first reading because of these substantive changes.'",
        "'speaker_9': 'First, the intent of this ordinance is to ban flavored vapor products. Second, I'd like us to remove the tobacco products from the ban, including cigars, little cigars, chewing tobacco, hookah, tobacco, pipe, tobacco and snuff. I'd like us to exclude cigar lounges and hookah bars from the ban.'",
        "'speaker_9': 'I'd like to include language in the recitals to express that to the extent that this ordinance applies to minors, diversion and education are preferred alternatives to the imposition of criminal penalties. I'd like to expressly prohibit employees of a tobacco retailer from selling, offering for sale, or distributing any tobacco products containing a flavor.'",
        "'speaker_9': 'I'd like to increase the minimum civil penalty in a civil action from $250 to $500. And I'd like to request that the city attorney make the proposed changes and return the revised ordinance to the City Council for further consideration and a first reading.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_7': 'Okay. Before I go behind the rail, I want to do a public comment because we have a significant amount of public speakers. Like the first caller, Mr. Larry Good. Hugh James Nino. Travis Anthony. Here. H. Sanjeev Kumar. Those are the first five.'",
        "'speaker_7': 'And we're going to do one minute public comment without objection from the council hearing on one minute. All right. Nice to see everybody again. Thanks for having me. Talk and hopefully we can continue this education.'",
        "'speaker_4': 'And we've done a really good job so far. I know a lot of you met with us, more or less.'",
        "'speaker_7': 'Everybody on this side. And we try to meet with you guys. And I know Councilmember Durango, we have a meeting on Thursday. A lot of new information came out on Friday and they said 29 out of 29 cases for the lung that they actually tested the lungs was vitamin E acetate.'",
        "'speaker_7': 'Nothing to do with our industry. Everything we sell is registered with the FDA. So if anything happens like this before they can pull it, we need to get a policy. If you can do this either.'",
        "'speaker_4': 'Locally or state that there's a punishment to a child or a 14 year old that has a vape. Right now, there is no punishment at all. Zero.'",
        "'speaker_7': 'So either them or their parents, someone should have some kind of a punishment. And I appreciate Councilmember Price meeting with us and talking with us and we can continue working together. And that takes a lot.'",
        "'speaker_4': 'Council. Jasmine. Jade, I work for 7-Eleven. I'm the market manager for stores between SEAL Beach and El Segundo. I support my local franchisees and small business owners, including 27 elevens in the Long Beach area. 7-Eleven is a responsible retailer and as a former market manager in the Bay Area and also dealing with Santa Cruz, I've seen where'",
        "'speaker_4': 'some of these bands have failed, and I appreciate that you guys are looking at it in terms of the focus on Vape because as a father of a daughter who was in high school when she started to vape, I see where that's coming from.'",
        "'speaker_4': 'A 7-Eleven, a responsible retailer, just want to really quickly highlight some of the things that we do that maybe you should ask all retailers to do. We have employee training for all age restricted products we make available to our franchisees.'",
        "'speaker_4': 'We have a limited and restricted tobacco space. We have ID scanning on every single day product. You cannot buy vape without an ID in a 7-Eleven without the associate scanning it, and we actually participate in third party voluntary mystery shops.'",
        "'speaker_4': 'If everyone did this, maybe the product would be out of kid's hands.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_12': 'Hello. My name is Anti-Venom. Me? I live here. I'm a 7-Eleven franchisee in the city of Long Beach. You know. Thank you, Councilman, for, you know, bringing up the whole issues. I just want to clarify one thing, which you probably when you said having, um.'",
        "'speaker_12': 'The changes you're making, are we changing the rules on cigarets to those menthol cigarets. Because that should be included in there, you know, be examined because they have been there for 100 years and. When you mention that, I think you overlook, you know, mentioning those that because we should be focusing on developing, we don't want the kids'",
        "'speaker_12': 'to be, you know. Doing that. Okay. Okay. Thank you.'",
        "'speaker_7': 'Thanks. Next up, Stacy Brock. He meets Jaime Rojas, Shane Patel, Madeline Baron and Emily Baron.'",
        "'speaker_1': 'Hi. Good. Good evening. I have been in business here for almost 20 years. I'm proud to be in Long Beach. I have generated a lot of tax dollars for Long Beach and I've created a lot of cities, a lot of jobs for the citizens in Long Beach.'",
        "'speaker_1': 'Most of all, I built a rapport with my customers, the residents of Long Beach and many travelers that came through Long Beach each year. I have many customers that live in Long Beach for most of their lives and have been smoking flavored cigars and cigarets.'",
        "'speaker_1': 'They came to my shop out of convenience and they loved to shop the local stores and support our local businesses. I've always complied with the laws ensuring that the products are not sold to minors. I understand that Long Beach is also in 100 compliant year to date for not selling to minors also.'",
        "'speaker_1': 'Now you're asking your citizens to go to an unfamiliar city, give them their tax dollars, and then come back home to Long Beach and be able to smoke in front of my shop. I'm not sure how that benefits Long Beach.'",
        "'speaker_1': 'I'm asking you not to them asking you not to be on the sales of traditional flavored cigars and cigarets, such as menthol, wintergreen and chewing tobacco. Thank you.'",
        "'speaker_4': 'Good evening, council members. My name is Hamish Robertson.'",
        "'speaker_6': 'With the National Association of Tobacco Outlets. We represent tobacco retailers who are past the quarter century.'",
        "'speaker_4': 'As well here in the city of Long Beach. Councilman Price, I commend you for adding those changes. We also want to include.'",
        "'speaker_6': 'In there menthol men and Wintergreen Cigarets, which have been around for over a hundred years. I stated earlier. We also want to ask in.'",
        "'speaker_4': 'The process, this is the first major city that has not included a workshop with.'",
        "'speaker_6': 'Retailers to get their input in the process. So we want to include that as well.'",
        "'speaker_4': 'We're in full.'",
        "'speaker_6': 'Support of what the councilwoman has mentioned and adding them in making those changes. And we hope to keep focus.'",
        "'speaker_4': 'On what the issue is. It's THC, illegal, THC and illegal bootleg vaping.'",
        "'speaker_6': 'The FDA in the past.'",
        "'speaker_4': 'Three years here in the city of Long Beach have shown that code enforcement.'",
        "'speaker_6': '97% success rate of retailers in the city of Long Beach. The issue has, according to the state, the FDA and local is not the retailers but online sales and adult and parents who buy and purchase for their kids.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'Thank you. Do we have Madeleine Baron? Chin Patel. Emily Baron. Brian Lee. Eva carbonara carbonara. Victor Sandoval.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Okay. Good evening. I would first like to commend everyone here that is involved with this proposal and personally thank you for showing interest in the subject and showing dedication in the use of language. I work with languages, youth leaders for tobacco control, a group of high schoolers who are invested and dedicated in tobacco education and restrictions surrounding'",
        "'speaker_1': 'the rise of vaping products among youth. Personally, this subject is very important to me, as it not only affects my life directly, but also the lives of my peers. I may not know all the statistics surrounding tobacco and vaping among youth, but I do know that I should not have to avoid my school's restrooms and fear of'",
        "'speaker_1': 'inhaling e-cigarette aerosols. I should not be able to purchase jewels or other flavored nicotine products as a minor, whether that be through schools or tobacco retailers. I should not have to watch my friends and peers grow dependent on toxic chemicals in my school because of the horrible withdrawal symptoms.'",
        "'speaker_7': 'Thank you. And please state your name.'",
        "'speaker_4': 'Good evening, city council members. My name is Brian Lee and I'm the advocacy manager at the American Lung Association of California. I'm also a resident of Long Beach District one. Our mission is to save lives by improving lung health and preventing lung disease.'",
        "'speaker_4': 'And our organization supports strong local regulations that protect the public from harmful effects of tobacco and secondhand smoke as well. There are two different e-cigarette crises occurring right now. The first is the ongoing high prevalence of youth use of e-cigarettes.'",
        "'speaker_4': 'The second is the outbreak of pulmonary illnesses. I also want to mention what the recommendations and changes. We want to permanently restrict the sale of tobacco without any exemptions. This we urge that this does not exempt hookah cigar lounges or menthol products.'",
        "'speaker_4': 'And we want to also clarify that there should be that the penalties are restricted only to retail sellers, not minors. Thank you for your time. It's tough work. Salutations. My name is Victor Sandoval, live in District nine and I go to Jordan Davis star Jordan High School.'",
        "'speaker_4': 'And I would just like to explicate my position.'",
        "'speaker_7': 'I want to talk about how what happens.'",
        "'speaker_4': 'When students smoke from vaping products. What happens is it at the brain stops developing at 25? Thus when they take these supplements into their body, when into happening, is that their their focus, their learning and their recollection faculties are impeded thus to generating.'",
        "'speaker_7': 'Thirst, perpetuating it to generate behavior that will destroy them. I prefer this baby pass for them. Thank you. In the midst of the long. Mohammed Abdullah, Ahmed, Ishmael and Cantrell and Primo Castro. Very. All right. Moving on. Dr. Gina.'",
        "'speaker_7': 'Okay. Johnny. William. Aldinga and Amanda Staples. That those will be our final speakers.'",
        "'speaker_1': 'Good evening. As a doctor of public health, I rely on the.'",
        "'speaker_12': 'CDC.'",
        "'speaker_1': 'And they have said that vaping is hazardous. I want you to imagine that the CDC determined that a toy being sold in Long Beach is a choking hazard for babies. Do you side with the store owners who want to sell the toy or do you protect the babies?'",
        "'speaker_1': 'The answer's easy. We side with consumer safety over profits. We don't wait for babies to die. We don't claim that something else is causing the choking. This is the same situation with vaping products. The CDC has determined that they pose a risk of acute and potentially potentially chronic lung injury.'",
        "'speaker_1': 'Let's get them off the shelves. Just like that potentially hazardous toy. It's simple to see the motivation of this vape shop owners and seeking a carve out of this ban for flavored products. They want to protect their own right to sell a hazardous product while restricting the sale by others.'",
        "'speaker_7': 'Thank you so much.'",
        "'speaker_2': 'Evening, members of the City Council. My name is Primo Castro with the American Cancer.'",
        "'speaker_4': 'Society Cancer Action Network. Looking forward, Councilmember. Thank you very much for your amendments.'",
        "'speaker_7': 'Looking forward to, you know, to see and read the new revised.'",
        "'speaker_6': 'Edition of the ordinance. Thank you. Good evening. William Baldinger Coalition for Smoke Free Long Beach. I know there's been a lot of speakers I haven't been able to come. That's because we brought many high school students, those who are directly affected by them, by this ordinance, who need to be heard.'",
        "'speaker_6': 'So I applaud that. You have listened to the vape shop industry. Now I'd like you to talk to high school principals and pediatric pulmonologists and the people who see the effects of this epidemic on a daily basis. Those are the people who are affected by this this ordinance and who need to also be heard.'",
        "'speaker_6': 'Some arguments that we've heard in the past is that vaping is a way to end tobacco addiction. Vaping is tobacco addiction and that buyers will go elsewhere for their product. That's great. Let them go elsewhere. The incidence of.'",
        "'speaker_4': 'Of of vaping among high school students.'",
        "'speaker_6': 'Will go down as we push these products out of Long Beach, which is the only way we can protect our youth.'",
        "'speaker_7': 'Thank you, sir.'",
        "'speaker_1': 'Good evening, Amanda Staples with the American Heart Association. We are encouraged by this council's leadership, especially on this urgent and public health crisis regarding our youth tobacco epidemic. We're excited about some of the changes that the council has proposed, specifically around penalties that could be interpreted penalizing youth, specifically youth of color.'",
        "'speaker_1': 'I wanted to share that. We just hosted the Long Beach Stroke and Heart Walk just last month at El Dorado Regional Park. We had almost 4000 walkers. An overwhelmingly majority wanted to see a flavored tobacco ordinance here in Long Beach.'",
        "'speaker_1': 'A comprehensive ordinance that address all flavors and all tobacco products. And these are for Mercer. These are survivors. These are folks that prioritize health here in Long Beach, in their city. And so I just want to encourage you all that you do have a strong support here in Long Beach that wants to prioritize public health and address'",
        "'speaker_1': 'this youth tobacco epidemic. Thank you.'",
        "'speaker_2': 'It's a man staples here that wasn't made of Staples. Councilman Price.'",
        "'speaker_9': 'And I want to thank all the speakers that came out just just as a reminder. I brought this item as an urgency item to get the discussion going. And we have been listening to everyone. I've met with anyone who's reached out.'",
        "'speaker_9': 'I will continue to meet with everyone. The goal of this item was to act immediately to stop any additional incentive or access for.'",
        "'speaker_1': 'Youth.'",
        "'speaker_9': 'To vaping products. There are a number of issues associated with this topic and last time we had a discussion on this topic, it started to go in many different directions. I want to make sure that the purpose of this agenda item and why it was a supplemental item is clear.'",
        "'speaker_9': 'And that is as a result of the increase in incidents that we have seen related specifically to flavored vaping products and the mechanism of vaping. We brought this item to put forth as quickly as possible a temporary ban on the sale of those products in the city of Long Beach.'",
        "'speaker_9': 'As it's written, it will last for one year. Retailers will have 180 days to remove the items from the shelves. Just like many other cities have done, that seems to be the standard. They should not be buying additional product because they'll have 180 days to get rid of the product that they have.'",
        "'speaker_9': 'But this specific item is not about all tobacco products. It's about vaping products. We can have a discussion about all tobacco products. On another item, I'm happy to have that discussion and probably support it. This item, though, is an urgency item related to vape products specifically.'",
        "'speaker_9': 'There are a lot of uncertainties regarding the vape products and what which of the flavors or what aspect of the mixes is or the mechanism is causing the pulmonary injuries. There is actively research taking place and studies that are taking place that hopefully over the course of the next year will reveal to us whether it's the vaping'",
        "'speaker_9': 'mechanism as a whole, whether it's the additives to the flavors, whether it's the specific flavors, what it is that's causing the pulmonary injuries. And we'll have that period of time to be able to put forth a policy that will be inclusive of all of those factors.'",
        "'speaker_9': 'At this juncture, however, I think it's important for the city to act and to act.'",
        "'speaker_1': 'Quickly to put.'",
        "'speaker_9': 'Forth a ban that limits flavored vaping products. I do want to ask our health department director one question because it keeps coming up. Flavored cigarets. Cigaret flavors are have were banned I think in 2009. Is that.'",
        "'speaker_4': 'Correct? As flavored cigarets were banned. Menthol is still there and the original motion was to include menthol tobacco as it is a way that youth are engaging in tobacco and nicotine addiction.'",
        "'speaker_9': 'Okay. So and I know that that was an item that was an amendment that Councilman Austin made when we were last here. And it was in regards to menthol tobacco products. So I don't know if we want to include that in this and expand it beyond just the vaping products.'",
        "'speaker_9': 'But I think. What I'd like to do is limit this ban to vaping products at this time and give us some opportunity to evaluate. But I'm open to hearing the discussion of my colleagues and, you know, to the comments that were made in regards to, you know, listening to the vape shops.'",
        "'speaker_9': 'We're listening to everyone. And yes, we're going to take a measured approach as a city, but we're going to have an immediate ban once this council votes on it. And we'll have some time to study what the what the permanent ban is going to look like.'",
        "'speaker_9': 'And I think that's fair. And I think that's prudent. And I think it accomplishes the mission, which is to mitigate access of youth to these products. So thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_7': 'Thank you. And I was happy to second this motion. Obviously, the health of our youth and discouraging them from picking up on that habits is really, I think, laudable. And I want to appreciate our councilmember, Susie Price, for for her leadership and her vigilance on this particular issue.'",
        "'speaker_7': 'I want to, I guess, ask the city attorney, how did we get flavored tobacco in the the original intent of what we put forth two weeks ago when we brought this matter forward, since it was sounds like the intent was specifically to vape items and we we somehow ended up with flavored tobacco.'",
        "'speaker_7': 'Can you can you help us recollect?'",
        "'speaker_6': 'Yes, Councilmember, when this item was brought last week, there were, as I recall, two friendlies, one by Councilmember Richardson, that added tobacco flavored products. And then your motion to make sure that that also included menthol tobacco cigarets so that they were both accepted as friendlies to the original motion of vape products.'",
        "'speaker_6': 'And with that, it greatly expanded to include all of those tobacco products. That maybe wasn't the intent of the council last week.'",
        "'speaker_7': 'I hear that. But also, with all due respect, they were accepted as friendlies two weeks ago. Are they not friendly now?'",
        "'speaker_9': 'What I want to do is limit it to vaping products. I specifically want to exclude hookah lounges and cigar lounges at this point. Well, while we're doing the temporary ban.'",
        "'speaker_7': 'I'm going to going to hold to two menthol cigarets. Again, I think it is a challenge. It's also you've heard from our health department director. Is is. I a Andre and you know, it entices you to get involved in smoking.'",
        "'speaker_7': 'And so I want to hold that. If somebody wants to amend emotion to to do something else, then the council is free to do that.'",
        "'speaker_9': 'No, I'm okay accepting that as a friendly.'",
        "'speaker_6': 'That currently as as I understand the amended motion direction menthol cigarets are included included not exclude. So we would need a motion to tell us or direct me to exclude it right now.'",
        "'speaker_9': 'No, no. We want to keep it as as.'",
        "'speaker_7': 'And so I encourage you support the counsel.'",
        "'speaker_2': 'The motion in a second as presented. Let me go to Councilwoman Mongo.'",
        "'speaker_1': 'So I just I missed a smidge of the conversation when I was trying to prepare and pumping in the back, but just. Is there any? So in my understanding there are other kinds of non flavored vape that are currently sold with THC that are not flavored, that are not covered in this ban.'",
        "'speaker_6': 'THC and cannabis are not included in this current direction to prepare this ordinance. That is correct.'",
        "'speaker_1': 'If our health director could tell me in the press releases that I read, those were specifically noted as potentially causing. The pulmonary issues, the lung issues.'",
        "'speaker_4': 'The data around the vaping disease indicates that much of it comes from cannabis. There's also a percentage that come from nicotine. Yes.'",
        "'speaker_1': 'And so I guess is there. Do we not think that the THC ones are getting in the hands of youth or. Why are we limiting it or is that open to an addition?'",
        "'speaker_9': 'Certainly open to discussion. That's not something I've done any my I myself have not done any outreach on it. My goal was to ban flavored vapes, which is the national trend that's going on to address youth use. But I will say that the CDC recently stated that although THC was connected with some of those deaths, they still'",
        "'speaker_9': 'do not know whether it's the mechanism, the heating source, the extracts, what it is that's causing it. So I'm not comfortable going down. Of broadening this particular statute. Proposed statute, as it's worded, until we've done additional research and gotten more data on that, that's just not an area that I mean, if someone here has some data that'",
        "'speaker_9': 'the definitive data that they want to share and make up amended motion, that's fine. But that's not part of my motion right now.'",
        "'speaker_1': 'So I don't hear support from the whole council on this. But I will say that in what I've read, what's been provided to me and when I lived in Europe. Back. More than ten years ago, vaping was around and flavored vaping was around and there weren't these injuries.'",
        "'speaker_1': 'And a lot of the things that I've read have not stated that flavored vape is the issue, but it's more the jewel and all these other things. And I don't know that we're targeting those devices as well as I would hope we would.'",
        "'speaker_1': 'Because when I go to a gas station to get gas and I see these products there. That scares me. I also had a. It's actually a Lakewood resident who was at a Long Beach location discussing with me that they because of the discussion we had here at the dais and how dangerous vaping is and how they're currently'",
        "'speaker_1': 'a smoker. They picked up an e-cigarette. And so I said, Well, there's a whole nother set of criteria and concerns related with e-cigarettes and. Especially an unregulated non FDA approved. All of these other things and so I have a serious concern about.'",
        "'speaker_1': 'The ban, as it says today, because of what I have read, it doesn't sound like the council has the desire to limit. All vape. Products except for those that are sold in vape specific stores, which and again the vape store in my district when they came into the district, I was nervous.'",
        "'speaker_1': 'I thought they were too close to a high school. I had all of these concerns, but they've never created an environment for our teens where they were welcome. They've never invited them into the store. We've not had any impact of that.'",
        "'speaker_1': 'So my research is different, but I'm hesitant to make an amendment at this time because it doesn't sound like the council was supportive of that last time. And so. I'll just again state my opinion and hope for a day when a bigger picture is available.'",
        "'speaker_7': 'Councilmember Pearce.'",
        "'speaker_5': 'Thank you. I want to applaud Councilmember Price for kind of focusing in on the areas that she originally intended. I support keeping menthol in there and not to make it more complicated, but as a 12 year old, I recall clove cigarets were the thing.'",
        "'speaker_5': 'Are those things legal still? Clove cigarets. Would you be opposed to including clove cigarets? I know it. Just as I remember all of us. 12 and 14 year old smoking cloves before we smoked cigarets.'",
        "'speaker_7': 'They were called betis days.'",
        "'speaker_1': 'So hip. I wasn't that hip.'",
        "'speaker_9': 'I'm not opposed to that. I just I defer to the city attorney whether.'",
        "'speaker_6': 'If the direction is to ban clove cigarets, we could add that language. I'm I'm not familiar with clove cigarets. So we're quite just talking to the health department about it.'",
        "'speaker_5': 'They are definitely a flavor. Very intense flavor. If Councilmember Price's okay with that. Sure. Thank you. And I don't mean to piecemeal this. I think that we I applaud doing this in an urgency way. I think I would still like to down the road hear a full presentation from the health department.'",
        "'speaker_5': 'The cannabis industry has not been included, I think, in these discussions, and I do know that I've seen some of the numbers around THC and vape products, but I don't feel the urgency to do that today. So I support the item as is and hope that we can have a full council presentation from the Health Department and'",
        "'speaker_5': 'possibly include cannabis industry in that conversation when that time is here. So. Thank you.'",
        "'speaker_2': 'Mr. City. Attorney, do you have anything else to add?'",
        "'speaker_6': 'No, the. Just to clarify, it's the motion made by councilmember price adding clove cigarets. And this will include the ban of menthol cigarets.'",
        "'speaker_9': 'That sounds good. And then if I could, just one more question. I know we touched upon it. The health department did do a really thorough tff on this. I wonder I don't know if they're prepared to do a report on it.'",
        "'speaker_9': 'Are you okay if the health department's if you could do a brief report? I think that would be fantastic, because I think it's much of the items that were listed in the health department report are actually incomplete contradiction to some of the statements that were made by some of my colleagues in regards to flavored products.'",
        "'speaker_9': 'So I want to make sure that we talk about that so that at any time, any council member who wants to bring an item back to add THC, we could start they could certainly do that. But I think it's important for the health department to report back on what you found regarding flavored vape products, not including THC'",
        "'speaker_9': ', just flavored products. No, we didn't have a presentation yet.'",
        "'speaker_2': 'There is a motion in a second.'",
        "'speaker_9': 'And a request for a.'",
        "'speaker_1': 'Presentation.'",
        "'speaker_2': 'And the presentation request.'",
        "'speaker_1': 'Yeah, I'm ready. I can.'",
        "'speaker_4': 'We can speak to the to the items. So. So first.'",
        "'speaker_1': 'Of all, e-cigarettes and other vape devices provide nicotine levels.'",
        "'speaker_4': 'Ranging from zero mg to over 50 milligrams per milliliter in a cartridge or a pod standard CIGARETS average 8 to 10 milligrams of nicotine and the strength is reduced when burned. So many of the bait products offer much higher levels of nicotine than you would find in a regular cigaret.'",
        "'speaker_4': 'According to the Centers for Disease Control, e-cigarettes are considered highly.'",
        "'speaker_1': 'Efficient, efficient.'",
        "'speaker_4': 'Delivery systems for.'",
        "'speaker_1': 'Nicotine and for.'",
        "'speaker_4': 'Cannabis. Pod methods, which are utilized by Joule and other companies, utilize nicotine salts that offer a much higher level of.'",
        "'speaker_1': 'Nicotine.'",
        "'speaker_4': 'To be consumed. These high.'",
        "'speaker_1': 'Levels are leading to increased levels of.'",
        "'speaker_4': 'Dependency.'",
        "'speaker_1': 'More frequent use.'",
        "'speaker_4': 'And addiction among youth and adults.'",
        "'speaker_1': 'Ages 18 to 24.'",
        "'speaker_4': 'There's a lot of focus on youth under the age of 21, 18, up to.'",
        "'speaker_1': 'Age 30 really are the areas where you're seeing.'",
        "'speaker_4': 'Really increased youth and Nationwide's e-cigarette utilization has increased nearly 20 fold in less than ten years, and currently 29% of youth are utilizing e-cigarettes. Both the FDA and U.S. Surgeon General have declared youth e-cigarettes as an epidemic. Flavored tobacco products are driving the current.'",
        "'speaker_4': 'The current youth vaping epidemic. Over 70% of vapers are using the flavored e-cigarettes.'",
        "'speaker_1': 'Flavors match the.'",
        "'speaker_4': 'Taste of tobacco in both vape and all to end all flavored tobacco.'",
        "'speaker_1': 'Products and make it easier for new users.'",
        "'speaker_4': 'To initiate tobacco use. As of.'",
        "'speaker_1': '2017, there are more than 15,500 different e-cigarette flavors available online, including cotton candy, gummy bears.'",
        "'speaker_4': 'Juice boxes and many others.'",
        "'speaker_1': 'Flavors that appeal.'",
        "'speaker_4': 'To youth. And there actually federal law prohibits conventional cigarets.'",
        "'speaker_1': 'The 2016 Surgeon General's report on e-cigarettes concluded that flavors are among the most commonly cited reasons.'",
        "'speaker_4': 'That using e-cigarettes among youth and young adults, the draw is very concerning. As a levels of nicotine damage have damaging effects on the developing brain.'",
        "'speaker_1': 'Brain development continues until at least the age of 25 or older.'",
        "'speaker_4': 'Nicotine changes, brain cell activity and parts of the brain responsible for attention, learning memory and can interfere with emotion and impulse control. The younger a.'",
        "'speaker_1': 'Person is when they start using nicotine, the more likely they are to become addicted.'",
        "'speaker_4': 'And the more difficult it is for them to quit. Flavorings in e-cigarettes can pose your health risk for adults as well. E-cigarettes expose the lung to a variety.'",
        "'speaker_1': 'Of chemicals over 40. And at least.'",
        "'speaker_4': 'Ten of these around the California's Proposition 65 list of.'",
        "'speaker_1': 'Carcinogens and.'",
        "'speaker_4': 'Reproductive toxin toxins. While much is still unknown about the long term health effects of e-cigarette, aerosol studies show short term use of e-cigarettes increases. Respiratory resistance.'",
        "'speaker_1': 'Impairs, impairs, lend function.'",
        "'speaker_4': 'And daily use that.'",
        "'speaker_1': 'Have double the risk of heart attack.'",
        "'speaker_4': 'E-cigarettes are not regulated by the FDA. None of them are regulated by the FDA and they are not subject to any manufacturing standards. There's a lot of variability in the types of products and mislabeling. In 2018, studies found that 91% of e-liquids marketed as.'",
        "'speaker_1': 'Nicotine free contain various levels of nicotine.'",
        "'speaker_4': 'Overall, nicotine levels in e-cigarettes are highly variable and with many of them exceeding the levels of combustible cigarets. Many see vaping as a smoking cessation tool.'",
        "'speaker_1': 'However, what we're finding is.'",
        "'speaker_4': 'That they don't reduce nicotine consumption. And in fact, 80% of those who utilize e-cigarette.'",
        "'speaker_1': 'Devices as the cessation techniques continue to.'",
        "'speaker_4': 'Utilize e-cigarettes.'",
        "'speaker_1': 'For continued nicotine addiction. No e-cigarette product.'",
        "'speaker_4': 'Has been FDA approved for smoking cessation, though there are a number of others FDA approved on the market.'",
        "'speaker_1': 'Currently there are licensed. There are 13 licensed vape.'",
        "'speaker_4': 'Only shops in Long Beach and 490 outlets licensed to sell tobacco and other nicotine products. This includes duals and other things that we're talking about here that fit within this ban.'",
        "'speaker_1': 'The Environmental Health Division currently administers the retail the tobacco retail enforcement program.'",
        "'speaker_4': 'Which would which would fall under this work would fall under the program.'",
        "'speaker_1': 'The Health Department's tobacco education program is leading vape education across the city, partnering closely with the school district to provide information to principals, school nurses, parents and student groups and conducting community presentations. In addition, it.'",
        "'speaker_4': 'Facilitates a seven week long summer program for.'",
        "'speaker_1': 'Youth. 23 graduated. You heard from one or two.'",
        "'speaker_4': 'Of them tonight and they are developing messages to work in them in their communities. As of October 9th.'",
        "'speaker_1': 'There were 44 local flavor bans ordinances in California. In terms of the in terms of cannabis, the baby has essentially found that we've had three cases here. Nearly 80% of those.'",
        "'speaker_4': 'Cases were under the age of 35. The median age is 24. What they're really finding is a highly suspected link to the most pressing.'",
        "'speaker_1': 'Concerns include cannabis.'",
        "'speaker_4': 'Include the attractiveness of the use and method for young people. So basically the vaping of cannabis is highly attractive to young people.'",
        "'speaker_1': 'The same study found that 22 in 2016 found that participants top reason for vaping cannabis was convenience, and to screen it.'",
        "'speaker_4': 'For use in public places or for young people to screen is for use in homes.'",
        "'speaker_1': 'And in schools. So they've done a lot of different research.'",
        "'speaker_4': 'They don't know what it is that is causing.'",
        "'speaker_1': 'The Vitamin.'",
        "'speaker_4': 'E is one of those aspects, but it has.'",
        "'speaker_1': 'Not been clarified.'",
        "'speaker_4': 'Both for the vaping disease, but also the long term understanding.'",
        "'speaker_1': 'And research behind what we find.'",
        "'speaker_4': 'Being sold in any shop in vaping also has not been determined to understand the long term impacts. With that I open for for comment.'",
        "'speaker_9': 'Thank you very much for that report. If I can just make a clarification of an amendment. So Clove Cigarets were actually banned in 2009, but the new version of of that trend is the cigarillos or the little cigaret, little cigars or cigarillos sig a r i elo.'",
        "'speaker_9': 'So I'd like to include those in addition to the menthol cigarets as the bans. Received quite the education this evening myself.'",
        "'speaker_7': 'Okay. So, Harry, no further comment. Are we clear, Mr. City Attorney, on the ordinance and the amendments?'",
        "'speaker_6': 'Yes, we are.'",
        "'speaker_7': 'See no other comments from the Council. Let's take a vote.'"
    ]
}