{
    "Contracts for Community Connector and Legal Services under the Long Beach Justice Fund.": [
        "'speaker_1': 'Thank you. I think we pulled item with it. Three councilwoman in the house, remember? So it's good to hear a update on that from staff, please.'",
        "'speaker_3': 'We'll have Theresa Chandler, the deputy city manager, provide a brief staff report for this item.'",
        "'speaker_2': 'Thank you. I can't even get a good evening, everybody. So last year's budget process, city council allocated an additional $300,000 in structural funding towards the Long Beach Justice Fund. The item before you item number three is to approve contracts for the legal services provider and community connectors to support the continued operation of the Long Beach.'",
        "'speaker_2': 'Just fine. So we're going to continue to utilize immigrant defenders, also known as MDA as our legal services provider. They're responsible for providing direct representation for individuals who live and work in Long Beach and are facing removal or deportation.'",
        "'speaker_2': 'The legal services provider provider will adhere to the universal representation model by which representation is offered to as many clients as funding will be allowed without qualifying based on the merits of the case. In response to the challenges posed by COVID 19 for fiscal year 21, the Long Beach Justice Fund Oversight Committee recommended adding a community connection'",
        "'speaker_2': 'services component to the Justice Fund. Furthermore, the city manager will allocate funding to three organizations Long Beach Immigrant Rights Coalition, St Mary Medical Center and Central Park to serve as community connectors. The Community Community Connectors will be responsible for connecting community members to the Justice Fund, legal service provider to MTF, to provide outreach and education, to provide'",
        "'speaker_2': 'referrals to community services, and to serve as liaisons with clients and their families. These four organizations will work, collaborate, collaborate collaboratively. Use me to affect how we implement the justice plan going forward. And that concludes my report, and I'm available for questions.'",
        "'speaker_1': 'Thank you. Can I get a motion in a second, please? Motion by councilman's and day house and a second move, Ashley Richardson. Is there any public comment?'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or dial star nine. They should clear. Your time starts now.'",
        "'speaker_1': 'Sorry. I forgot. Lower, man.'",
        "'speaker_3': 'See no other. That concludes public comment.'",
        "'speaker_1': 'Roll call vote please.'",
        "'speaker_0': 'Council women's today has. Casual Women's Day has.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Price. Hi, Councilman Sabina. Hi, Councilwoman Mango.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilmember Oranga, I. Councilman Alston.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson. Hi. The motion is carried.'",
        "'speaker_1': 'You bet. Concludes the consent calendar. We will now do. Or to charter or to commission items. So let's go and do item number eight, please.'"
    ],
    "Charter Commission Appointments Approval.": [
        "'speaker_1': 'Thank you. Our next step is our next item, which is charter commission appointments, which is 26.'",
        "'speaker_0': 'Item 26 is a communication from Councilman Spinner, chair of the government.'",
        "'speaker_1': 'To be charter general.'",
        "'speaker_2': 'Mr. Mayor, your microphone.'",
        "'speaker_1': 'Yep. Thank you.'",
        "'speaker_0': 'Item 26 is communication from councilman super nature of the Government Personnel and Election Oversight Committee. Recommendation to receive Charter Commission appointments approved by the Government Personnel and Election Oversight Committee.'",
        "'speaker_1': 'Got some more super now. Thank you. As the clerk said, these appointments were approved by our committee and there are five individuals to fill spots on four different commissions. So we ask for your approval. Thank you. Thank you, Councilmember.'",
        "'speaker_1': 'And let me go ahead. I do have a motion and a second by County Councilwoman Allen. I'll give me additional comments before I read the commission names and.'",
        "'speaker_2': 'No, no Mayor, just congratulations to everyone.'",
        "'speaker_1': 'Okay. Let me. Thank you. Councilman Super. Now I want to go ahead and go through each of these commissioners. There's a handful of them into the Citizens Police Complaint Commission. I do want to congratulate David and Joel. David Ochoa currently works as a field representative for the Office of State Senator Tom Byrd and his previous experience as'",
        "'speaker_1': 'a congressional staff member in the office of Congresswoman Annette Barragan. David holds a bachelor's degree from California State University, Long Beach in political science and history, and is currently working on a master's degree in political science. For those who know David, he's also incredibly involved across the community and will be a great addition to the commission.'",
        "'speaker_1': 'Also to the PCC is Kenneth Kenneth Asher Kawamoto. Kenneth is a Council District two resident, and he works as an appraiser, specialist and field trainer for the L.A. County Assessor's Office. Kenneth holds a master's of public administration, public sector management and leadership from Cal State, Long Beach, Northridge Degree, a Bachelor of Arts in Political Science from the'",
        "'speaker_1': 'University of California, Irvine. And congratulations to Kenneth as well. The next next appointment is Eric Bowers. Eric Bowers is a council District One resident, and he currently works as a director of Public Affairs and Marketing for Coast Community College and served as Executive Director for the Coast Community College District Foundation.'",
        "'speaker_1': 'Mr. Bowers is a member of the California Community College's LGBTQ Plus Caucus and Public Relations Society of America. Eric holds a master's degree from Public Administration from California State University, Long Beach, and is currently working towards a doctorate in education leadership.'",
        "'speaker_1': 'I want to congratulate Eric as well on his appointment. And next up is for the Ethics Commission, Mary Ellen Mitchell. Mary Ellen is a council district four resident, and Mary served as executive director of Women's Shelter of Long Beach from 2015 to 2021.'",
        "'speaker_1': 'She previously served on the Human Relations Commission and on everyone's home, Long Beach Task Force. A Maryellen has been a member of the Finance Committee for the African-American Cultural Center of Long Beach and also served as a board member for the United Cambodian Community, UCC.'",
        "'speaker_1': 'Also on the Water Commission is Gina maguire. Gina is a Council District five resident. She's a 1967 graduate of Saint Anthony High School and became a transformative figure at the educational and educational institution. Gina recently retired to serving as City Anthonys president and CEO for 20 years and was awarded the keys to the city for her leadership'",
        "'speaker_1': 'and community development. She's really involved, of course, across the community, and she was one of the founders of leadership, which for those that may or may not know. She also was president of the Omega Junior League and has had a positive impact on many lives across this community.'",
        "'speaker_1': 'She has a B.A. in California from California State University, Long Beach. We want to congratulate Gina in excellent condition. I also want I think I may have missed that when I gave Eric Bally's bio, I didn't say that he was actually also rejoining the Civil Service Commission.'",
        "'speaker_1': 'So I just want to be clear that Eric Fallis is being appointed to the Civil Service Commission and that includes all of the commissioners. A huge congratulations to all of them. Any other any other council comments? Seeing none.'",
        "'speaker_1': 'Then if we could have, Madam go to any public comment or then go to the rock office.'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or dial store nine. They basically. Your time starts now.'",
        "'speaker_1': 'Good evening. My name is Steve. Q I'm a resident of the third district. I often speak on city council items of late. And I'd just like to say, just as a general public comment, as an American, as someone who not only believes in freedom of speech, but has.'",
        "'speaker_1': 'Often defended it. Please understand that I just as a matter of operational prudence, it's my policy and one within my rights as an American. To just say two things hopefully make use of the time, make it worthwhile listening to, let alone putting on the public record.'",
        "'speaker_1': 'And in my own personal case, while that may seem chaotic and at times. Uh. Highly specific or greatly meandering. I'm kind of always making the same argument. And it's kind of for a moment like this. We're at a stage in human history and specifically a stage in American history.'",
        "'speaker_1': 'Who? I'm going to steal a line from the Long Beach artist Rudy Dion. It's a very tender epic, but that one, it's a very tender time. And when I see, I know I won't say who, but when I see, you know, old men, businessmen, uh, I getting excited about the prospects of the war.'",
        "'speaker_1': 'Be good for business. So rubbing their hands, I mean, you know, it's usually kind of inversely proportional to the likelihood of that person actually manning a post on the border of Ukraine or in the case one of my friends who was in Armenia last December.'",
        "'speaker_1': 'Um, actually seeing a church that you would. You married one of your friends and been taken overtaken by by the various with Russian help. It's a very kind of tender moment. I'm somebody who shortly after September 11th, I did something really kind of creative.'",
        "'speaker_1': 'I went to my advisor in college and I told him, Hey, you know, whatever you need, I'll do. I was young and I, you know. I just wanted to help. Uh. I'd like to suggest there's more than one way.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'I think that was likely for general public comment. So we'll take that a general public comment for that section. But let's go ahead and do the. Roll call. Vote for this item, please.'",
        "'speaker_0': 'Councilwoman Sandy has.'",
        "'speaker_2': 'A.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Price. Councilman Sabina.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Sara, I. Council member oranga i. Councilman Alston.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'The motion is carried eight zero.'",
        "'speaker_1': 'Thank you. Is there any additional general public comment?'"
    ],
    "Amend LBMC Chapters 5.53 and 5.55 to Make Recall and Retention Ordinances Permanent and to Update Their Purpose Statements.": [
        "'speaker_0': 'I'm sorry, Mr. Mayor. What item are nine? Item nine excommunication from Vice Mayor Richardson. Councilwoman Cindy has an Councilwoman Allen recommendation to direct city attorney to amend Long Beach Municipal Code chapters 5.53 and 5.55 to remove their sunset clauses, thereby making chapters 5.53 and 5.55 permanent.'",
        "'speaker_1': 'Thank you. Turn this over to Vice Mayor Richardson. Thank you, Mr. Mayor. This action tonight will take some of the important actions that we instituted at the onset of the pandemic, when we didn't truly understand our economic situation and our health situation.'",
        "'speaker_1': 'And now that we have a better understanding, we know that the pandemic, the economic recovery will take some time. The action tonight will take two of the three initial ordinances, particularly related to recall and retention, and make those two ordinances permanent until such a date.'",
        "'speaker_1': 'The City Council will remove Saturday to remove those ordinances, so this action would make them effectively permanent. No, it doesn't apply to the sick leave policy. We were one of the first adopters on adding local sick leave protections, but since then the state has now adopted safely protections.'",
        "'speaker_1': 'So we have no need to extend the sick leave protection because now it's state law. When we initially took this out as a city council, we did so out of recognition that, you know, COVID was shipping everything that we know about our daily lives.'",
        "'speaker_1': 'And as a city, our role was expanding. Our role is changing. And we know that we're a city that has made significant investments into tourism within our city and that we depend on services. The services provided in our city are directly connected to tourism.'",
        "'speaker_1': 'But we also saw that that saw that that was the very first industry to be hit. So the city council, you know, rightfully so, stepped forward and thought about a comprehensive package of protections both for industry and for workers.'",
        "'speaker_1': 'We were among the first to do that. We actually led the nation on a number of the things we did during COVID 19 around testing, worker protections, sick leave. So we've been a real leader, one of the first cities in the nation to guarantee three weeks of sick leave.'",
        "'speaker_1': 'And so that was incredibly important. But now it's shifting from, again, corporate relief to economic recovery. This makes a lot of sense. Number one, it's a proactive effort. So taking a step to make recall and retention policies permanent.'",
        "'speaker_1': 'What it does is it ensures that, you know, we know that, you know, we're going to deal with additional spikes and different additional variants. It's not as if we know by now that it's a win. And so what it does is this locks in protections to make sure that we're ready to meet whatever, you know, whatever impacts'",
        "'speaker_1': 'there are to our workforce. And so that's the added protection. We also know that we're probably, you know, the pandemic will be here for four or five years and the economic fallout will take significant time to recover. And since we do that, we have a responsibility as a local city to use our power to extend those protections'",
        "'speaker_1': 'through that pandemic recovery. These you know, these are not you know, there was significant discussion initially about what actions to take as a city. And I think, you know, we arrived at a really good place. I think today this action, I think, is a real commitment to our workers that, you know, as we recover from the pandemic'",
        "'speaker_1': ', no no community, no worker is going to be left behind. We have a case recovery where we know people who have made, you know, white collar jobs and make a significant amount of money, for the most part will bounce back.'",
        "'speaker_1': 'But low wage workers here in Southern California and in Long Beach, based on our quarterly, quarterly economic report, they're the most vulnerable. And so these workers, we know, are the ones that are persistently dealing with unemployment and they're the ones.'",
        "'speaker_1': '11 Responses. So actions like this help to secure the floor and ensure that people aren't slipping out of the workforce and into homelessness. And as the recovery comes back, they know that our city council and our city council has their back.'",
        "'speaker_1': 'So I want to just take a moment and just acknowledge I just want to take them all. Acknowledge. Congresswoman Annette Barragan, CFA, California Faculty Association, Long Beach Clergy. Laity United, Latinos and Action for Migrants and Action National Council of Jewish Women of Greater Long Beach and West Orange County.'",
        "'speaker_1': 'Long Beach Immigrant Immigrant Rights, Coalition and Filipino Right of Migrant Center. The L.A. Confederation of Labor for sending their letters of support also acknowledge there were letters letters that indicated there wasn't a fiscal review done. I just want to state for folks that we updated the item on a supplemental to Atlas support and to add financial management's'",
        "'speaker_1': 'fiscal impact statement. So if folks have concerns, they feel free to defer to financial management on that. But again, what we're doing is pretty straightforward here. We are sort of we're simply removing the sunset and redefining the opening sentence.'",
        "'speaker_1': 'It is more broad is not about the initial just COVID reaction of COVID, but this is you know, now we're we're thinking more long term about the economic recovery of our city. That's why it's important to make these protections permanent for low wage workers within our city.'",
        "'speaker_1': 'Thanks a lot. And I'm happy to make the motion as written. Thank you. There's a motion. And then the second I have Councilman Allen.'",
        "'speaker_2': 'I thank you, Mayor, and and also thank you, Vice-Premier Richardson, for your leadership on this item. It's just flat out common sense policy. And I'm proud to see you. And I'm proud to see the city of Long Beach leading on this issue.'",
        "'speaker_2': 'This is a simple change. It removes the sunset and it protects workers and the industry against future economic crises. As the workers in our hospitality industry just deserve that respect the dignity and opportunity that accompany a stable job.'",
        "'speaker_2': 'And this policy will indeed stabilize jobs. I also want to mention that the workers, mostly women and workers of color, are the ones who made these industries into middle class jobs through decades of activism. So let's make sure that we preserve these gains by making right to record retention into permanent policies.'",
        "'speaker_2': 'What this is also good for business is just hard to rehire workers, especially qualified ones. You have to train a workforce and these workers can come back and hit the ground running. They already know the job. And there is a cost.'",
        "'speaker_2': 'And it. Don't quote me exactly, but it's in the thousands of dollars to train a new employee. The making the right of recall or retention of permanent policy will provide a more stable environment for both the workers and hotel owners.'",
        "'speaker_2': 'I also like that the workers that will be hired back will be hired back in the order of seniority. And I think that that's really smart. I've also heard from dozens of residents and workers about the need for this change.'",
        "'speaker_2': 'So I strongly support this recommendation. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Next up is Councilwoman Mongo.'",
        "'speaker_2': 'Thank you. I'm going to be supporting that item today. I do have a couple of questions and or requests of vice mayor and just a better understanding. So, vice mayor, I know you and I and Councilman Allen all serve on the economic development.'",
        "'speaker_2': 'Committee together, and I would have loved to see this come to the committee first. It seems that there's a bit of urgency because it's coming directly to the Council on a supplemental. Are you open to also getting some feedback from our economic development director and or our web executive director on the financial impact and potential opportunities that'",
        "'speaker_2': 'the city has to improve and or build upon and or modify and discuss. Options. I appreciate that this is for one particular industry, but lots of industries were hit, and I think that there's some value in having a broader discussion of what that looks like.'",
        "'speaker_1': 'But just just to be clear, this is a follow up to an item in December, right? In December. So we received two from four memo from the city manager. These protections were going to lapse at the end of the year and we were going into holidays and our concerns.'",
        "'speaker_1': 'So we we postponed this and said, give us some time to get past the Comic-Con surge and get past the end of the year to come back with a recommendation. And so I think the committee can at any time take up and do the evaluation, and I will support that as the committee.'",
        "'speaker_1': 'What I don't want to do is change the timing on the item today. So if you're saying if you want on a parallel track how to do for the research by other industries, I'm happy to work with you on that.'",
        "'speaker_2': 'Absolutely. So I've received some feedback from hotels in the fifth District specifically, and they're having they've made multiple offers to individuals to come back and they're getting no response. And so their challenge is, of course, that they need to then fill those positions.'",
        "'speaker_2': 'And so I don't know what that cascading scale looks like in my understanding of what the limits and timelines are and how we incentivize the workforce to come back. Because there there's a demand, there's, what, 1.5 jobs for every one employed person.'",
        "'speaker_2': 'And we we have to come up with an incentive structure that both values the workforce and their skills and their commitment and dedication while balancing help and an understanding of each person's personal risk and then also understanding what implications our policies have.'",
        "'speaker_2': 'We also recognize that the country is experiencing the highest level of inflation, and there's a lot of theories out there on what caused those and what types of policies. And we want to make sure that we don't create a worse off situation.'",
        "'speaker_2': 'We might make a policy one day that raises wages 3% or 4%, but then inflation 7%. And so the net out-of-pocket on a person might be bad. So I just think that there's some value in that. And I would appreciate if you'd take the lead on working with our economic development director on that agenda item for our'",
        "'speaker_2': 'next meeting. Because I see a lot of value in in having a really broad discussion and inviting business leaders and workers to that discussion. So I appreciate.'",
        "'speaker_1': 'That's.'",
        "'speaker_2': 'Great. I'll support that item today and I appreciate we're at very, very unusual times, but hopefully we will be past them soon. Thank you.'",
        "'speaker_1': 'Absolutely. Thank you. Thank you. Have a few more speakers. But our city attorney also wanted to make some clarification remarks.'",
        "'speaker_5': 'Thank you, Mayor. Yes. As mentioned by the vice mayor at the December 7th Council meeting, the vice mayor's item directed the city manager to not sunset the Long Beach Municipal Code chapters 5.53, 5.55 and 8.110. And they were to sunset no sooner than February 28th of 2022.'",
        "'speaker_5': 'This item, as the vice mayor identified, addresses two of the three ordinances and if approved tonight, will make those sections permanent. But we do not address and is not addressed is section 8.110 as a result of this item tonight, without further action by the council item 8.110 will sunset effective February 28th 22, as the Council's awareness the'",
        "'speaker_5': 'vice mayor mentioned earlier, the state has addressed through legislation the additional covered sick time. So we are available to answer any questions. But we just wanted to point out that this item tonight and wanted to clarify that the other the third item that was extended by the vice mayor's motion in December will expire on February 28th.'",
        "'speaker_5': 'And the final point is this items that this come back within seven days as the council's aware that there is no meeting next week. So this item would come back on March 1st. But there will be no sunset of the item and this item will be heard on March 1st.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman's in Dallas.'",
        "'speaker_2': 'Thank you, Mayor. Thank you. My vice mayor Richardson, for bringing this item forward. I'm honored to be a co-sponsor on these efforts. Making right recall and retention into permanent policy is common sense. It's a common sense policy that strengthens Long Beach's economic development strategy and economic recovery, as we hopefully are exiting this pandemic.'",
        "'speaker_2': 'As we all know, this pandemic brought to life the incredible value as well as the high vulnerability of workers in industries such as those of hotels and janitorial workers. The pandemic has no mercy on anyone, anyone. And we do know that it has affected all of us across all industries.'",
        "'speaker_2': 'But workers in these industries were hit the hardest when 90% of the hospitality industry shut down during the pandemic, leaving workers without their livelihood, those without the ability to feed and care for their families. Here in Long Beach, we acted in a in response to this concern by establishing these worker protections back in 2020.'",
        "'speaker_2': 'However, because of the pandemic has continued for much longer than we all expected, in the sense that based on these policies have added to the uncertainty and fear of many of our workers, many of whom have experienced hardships here from my district, workers that work in the nearest hotels and years, places around here in the downtown area'",
        "'speaker_2': '. These policies are specifically designed to ensure the rehiring of employees in the event of another temporary shutdown or contraction. And since this pandemic is, it seems to have been longer than anybody perceived. I think it is very fitting and timely for us to step up and try to make this a permanent ordinance.'",
        "'speaker_2': 'Again, I think you, vice mayor, for inviting me onto this item and I strongly support this item and I hope that my colleagues and I can all be in solidarity of this item. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Al Austin. Thank you, Mr. Mayor, and I appreciate the item coming forward. I want to signal my strong support for this item as well. And I want to just everybody wait. We're waiting in public comment.'",
        "'speaker_1': 'That's five votes already. I want to say that obviously COVID 19 devastated our our hospitality industry was a huge setback. But the impacts there were not just financial and on business. They were impactful for residents, for our residents, for people, for workers, for the employees.'",
        "'speaker_1': 'And if anybody has never experienced mass layoffs, I'll just tell you, it's a it's a hard thing to deal with. As a former aerospace worker here in Long Beach. I've experienced that. Coming from Detroit. I've seen that over and over again throughout my life.'",
        "'speaker_1': 'And I can tell you that for four workers in a in an industry to mass layoffs, it's impactful for not only the workers, but it's impactful for the business as well. So I think it makes a lot of sense to be able to to retain a quality workforce that understands our hospitality industry, that understands our city, that'",
        "'speaker_1': 'they don't need to to to start from scratch. But have it have been invested into their roles as hospitality workers? These are low wage jobs. We know that there's no guarantee that everybody goes back to the roles that they were in two years ago.'",
        "'speaker_1': 'But I think it's only the moral thing to do to to extend that opportunity for these workers as our economy hopefully rebounds, as our tourism industry, our hospitality entertainment industry here in Long Beach rebounds. And so I'm to my soul for support for this item.'",
        "'speaker_1': 'It was a no brainer when it came forth originally. And it's it's it's a no brainer today. Thank you. And I do think we need to enlisted advise better pay across all sectors for all workers. I think that is the incentive council to go to work to retain a great workforce.'",
        "'speaker_1': 'Thank you, Cousin Ringo. Thank you, Mary. And I want to lend my support to this item. As I said many times, when other ideas are come forward this way that regarding auto workers and public service essential workers, I will always mention the fact that I have family who work in the auto industry and they were very much'",
        "'speaker_1': 'affected by this pandemic as well. And I and I can straightforwardly say that not everybody gets hired back and want to be hired back. So I think that the sign up here protects workers and it guarantees them an opportunity, if not get a job back, at least getting giving them an opportunity to get back and reach and'",
        "'speaker_1': 'restart and continue their careers as they want to. It's a it's a labor of love for a lot of these people. They love their work. They love working with the public. They love working hotels and they love providing service.'",
        "'speaker_1': 'So I think that when it comes to it, at the end of the day, individuals who work in this industry love their jobs and would love to come back. So I fully support this idea of hearing thank you to all the sponsors of this item.'",
        "'speaker_1': 'And you have my vote. Thank you. Thank you, Councilwoman Sara.'",
        "'speaker_2': 'Thank you, Mayor. I just want to express my strong support for this item and thank Vice Mayor Richardson as well as Councilwoman Allen. And they have for bringing this item for.'",
        "'speaker_1': 'Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I, too, want to express my support for the item, but I also want to thank the group of hotel workers that I had the opportunity to meet with and acknowledge that I appreciate the changes that were made to the ordinance, as we discussed, to kind of fill the gap in that and the Nexus'",
        "'speaker_2': 'connection that I felt was necessary in approving the item tonight. I think that change was made, at least it was made to my satisfaction in terms of the nexus. And I want to thank you for listening.'",
        "'speaker_1': 'Thank you, Councilwoman. I'm going to make a few comments and then we'll go to two public comment. Well, let me just say that I, of course, agree with with all that's been said. And I just want to remind folks that when the first right right of return recall legislation came forward, these worker protections, and when Long Beach'",
        "'speaker_1': 'actually made the decision to put these protections in place and to ensure that folks had a job to come back to and that they would be protected at work. This was actually really a bold move that Long Beach took, and it was at the height of the pandemic.'",
        "'speaker_1': 'We were first in a line of jurisdictions that were doing this work. And Long Beach, Chuck, with what I think many of us believe to be a historic and important step for workers across our city and and the region.'",
        "'speaker_1': 'And the truth is, is that the work that was done by this council impacted other laws and other efforts that were done across the state. So I do want to thank the entire Long Beach Council that was supportive of this measure when it was first in front of us.'",
        "'speaker_1': 'I also want to thank just the incredible support in talking to so many of our work organizations and union leadership and business owners, community members that were all engaged in this process because we know that workers were facing a really difficult time and continue to face a really difficult time at our workplaces and in this economy.'",
        "'speaker_1': 'And just want to thank you. And finally, I do want to thank the staff. I think our team at Economic Development and our team at the city attorney's office and so many others worked very hard on this. And we had a lot of conversations in the first round of of legislation that passed, and we continue to in'",
        "'speaker_1': 'this next round. So a huge thank you to Vice Mayor Richardson, Councilman Allen, Councilman and D.A. for bringing this back to us. But I also want to honor the work that everyone did leading up to this. It's really been a monumental effort.'",
        "'speaker_1': 'And so I'm really proud that Long Beach continues to stand by and support our workers. And with that, Madam Clerk, if we can do any public comment.'",
        "'speaker_3': 'And there are any members of the public that would like to speak on this item, use the raise hand feature or dial start nine. Charlie, your 90 seconds start now.'",
        "'speaker_1': 'Hello. Council members and mayor, this is Charlie Cano with Unite Here Local 11. Can you hear me?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Okay, great. Thank you. Thank you very much for your support for. For hospitality and janitorial workers and ensuring that the folks have a chance and a right to come back to work as we come out of this crisis.'",
        "'speaker_1': 'It's very well appreciated. The special thanks, of course, to those who ensured introduced this motion today for standing with workers. This as this point, as was pointed out, both host hotel and janitorial workers who are having a much longer time than expected in going back to the office, are really in a crisis very similar to that that'",
        "'speaker_1': 'hit the aerospace industry in the early 1990s. We don't know how long it's going to last, but with making this permanent, we make sure that that folks have a chance to get back to work and that we're ready for whatever comes, whether it's this pandemic or a future economic crisis.'",
        "'speaker_1': 'This is something that does not cost employers anything. In fact, they can even send letters to us. They can send letters to many workers and then hire, offering them a right to come back and then or and then hire in order and then hire an order back in order of seniority.'",
        "'speaker_1': 'So there's no downtime between when they send the letter and a need to sort of send consist can send other letters and it and it also protects workers in case of sale no worker should have ever lost their jobs.'",
        "'speaker_3': 'Thank you, Raquel. Your 92nd began now.'",
        "'speaker_2': 'We when I started this actually summer, I can't remember. Please hold while we get.'",
        "'speaker_3': 'The interpreter on the line. 1/2, please. The next speaker is Maria Parola.'",
        "'speaker_2': 'All. You heard me. Yes. Okay. My name is Robert. And all in. I'm a hope to work. I'm a union member, but I believe that we need a permanent right to be called to work and keep this law.'",
        "'speaker_2': 'This law is helping a lot of workers to go back to work. So I believe we need to keep this little sample of the higher Lombard, the many workers that try to go back to work. But that restaurant is still closed.'",
        "'speaker_2': 'And I hear that they said they've been calling people they refuse to call or they don't answer. But what I hear is happening in this hotel that management is hiding your people. When they how many people are home waiting for, they go back to work.'",
        "'speaker_2': 'And these people are willing to try it in all positions. But. This company tried to hire new people and. I really believe that we need to keep this low to make sure that people go back to work and keep jobs around the country, that many of them being told.'",
        "'speaker_2': 'So I do believe that people have don't have to leave the job because the job is false. So I believe we need to involve people to make sure all these people. Thank you. Thank you.'",
        "'speaker_3': 'Raquel.'",
        "'speaker_2': 'We went to service. What about Simon and Candy in Brazil? Let's assume we have a fever.'",
        "'speaker_1': 'Am I right? I am. Raquel Estrada. Members of the council. I am very thankful. Raquel.'",
        "'speaker_2': 'Raquel is the aggressive youth development of our house here.'",
        "'speaker_1': 'Thanks to this law, I had the opportunity to go back to my job.'",
        "'speaker_2': 'For the European position in Ireland.'",
        "'speaker_1': 'Because I was one of the first one to be fired from the hotel and my position was not opened yet.'",
        "'speaker_2': 'It looks as if the late member of the hierarchy there may muscatel a couple of the young Bulgarian without him.'",
        "'speaker_1': 'And this law was the one that protected me for the hotel to find a position to place me back into a job.'",
        "'speaker_2': 'Back then, my goal is to try my 15 tobacco.'",
        "'speaker_1': 'I have more than 18 months without a job.'",
        "'speaker_2': 'If they go through, let them tomorrow. Let me smoke. Or Simi Valley. Well, whatever it is that.'",
        "'speaker_1': 'And I have other coworkers, friends of mine that they didn't have the opportunity to go back to work yet.'",
        "'speaker_2': 'And I think this is going to happen.'",
        "'speaker_1': 'And that is why I am very thankful for all your support. Thank you very much.'",
        "'speaker_3': 'Next speaker is Christian Castro. Your time begins now.'",
        "'speaker_1': 'Obamacare. Yes, sir. Okay, great. Good evening, councilmembers. My name is Cristian Castro and I'm a resident of Long Beach. During the beginning of the pandemic, as workers across the country were being forced to go into work without protections.'",
        "'speaker_1': 'Millions were laid out and many more, millions more related. It was Long Beach. I led the nation and protections for these workers to combat COVID 19, and I commend the commission and the council for leading the way. The devastation of the pandemic has hit us all, but especially our black and brown workers who are disproportionately impacted by'",
        "'speaker_1': 'COVID 19 infection and by unemployment. While things may be looking up, we know that we are nowhere near the end of this. This item is personal to me. My mother is an immigrant and spent years working in the hospitality industry.'",
        "'speaker_1': 'It's painstaking work, but work she was proud of and it's work that anyone can be proud of. To me, it's simple. Our janitorial and hospitality workers have been on the front lines since the beginning and deserve to be protected.'",
        "'speaker_1': 'Let's protect our low wage workers and our communities of color by voting on this item. Thank you.'",
        "'speaker_3': 'Gary trick. Your time begins now.'",
        "'speaker_1': 'Good evening, mayor and city council members. My name is Gary. A trick. I reside in the fourth district. I'm speaking tonight as president of the Long Beach chapter of the California Faculty Association. CFA at Long Beach represents over 2900 faculty, coaches, librarians and counselors.'",
        "'speaker_1': 'At issue, I'll be on behalf of our members. I urge you to make right to recall and retention. Permanent CFA Long Beach believes that equity and justice are only possible if we put people at the center of our public policy.'",
        "'speaker_1': 'These policies are examples of that and will help shape a recovery that includes everyone. I really want to thank Mayor Vice Mayor Richardson for leading on this issue for everyone else who is who has really got us to this point.'",
        "'speaker_1': 'And again, CFA at Long Beach urges a yes on this particular ordinance. Thank you.'",
        "'speaker_3': 'Next speaker is Garcia Lopez Reyes. Your time begins now.'",
        "'speaker_2': 'Thank you. Good evening, Mayor. Members of the council. My name is Grisha Lopez Reyes, director of Language Coalition for Good Jobs. Our priority as a coalition has always been advocating for progressive policies that address the growing inequality that we see in our city by promoting living wages and strong worker protections.'",
        "'speaker_2': 'For this reason, we strongly support making Long Beach right a recall and retention permanent policy in the city. We need to ensure that there is equitable recovery for all. And as has already been mentioned, it is the labor of these incredible women and workers of color who have transformed the industry and who are key in our ongoing'",
        "'speaker_2': 'economic recovery. Making these protections permanent policy in Long Beach is critical for businesses and workers. Having these protections in place is an economic development tool. Long Beach has invested millions of dollars in its downtown hospitality industry with the promise of a return of good jobs for Long Beach residents.'",
        "'speaker_2': 'Locking in permanent right to recall and retention ordinance for these two industries help to protect the promise of a return of good jobs in Long Beach. It also protects the wages and benefits that have been fought for decades and preserve the quality of work within these jobs.'",
        "'speaker_2': 'We urge you to make these permanent policies in our city. Thank you.'",
        "'speaker_3': 'Next speaker is James Swallow.'",
        "'speaker_1': 'Good evening, Honorable Mayor Garcia and members of the Long Beach City Council. My name is James Swallow and I am a third district resident. And speaking tonight on behalf of Long Beach Forward. Long Beach Forward strongly supports a need to make the city of Long Beach is right.'",
        "'speaker_1': 'A recall and retention ordinance is permanent, and we thank you for your support. Despite our collaborative effort to help residents protect their health, this pandemic continues to linger and has disproportionate impacts. And those are on the social and economic margins of our city.'",
        "'speaker_1': 'As was pointed out, these policies have been critical to protecting the lives and livelihoods of Long Beach workers who are overwhelmingly Latins, black and Cambodian and Filipino. We're really thankful that our city's leaders support the permanent adoption of these policies to prevent a deeper social and economic crisis where race and class defined, who does well and who'",
        "'speaker_1': 'does not. As community members, we know that it is our shared responsibility to help keep ourselves and each other safe and healthy. And we must prioritize the people most impacted. We know this is not a new approach. It's called equity.'",
        "'speaker_1': 'Racial and economic equity is the way forward yesterday, today and tomorrow. So thank you for your support to make the right of recall and retention ordinances permanent.'",
        "'speaker_3': 'Next speaker is Ann Burdette.'",
        "'speaker_2': 'Good evening. My name is and Brigette. I'm an organizer with Long Beach. Clergy and Laity United for Economic Justice, otherwise known as Clue. You know, I really want to thank the Council for initiating the threat to retention policy at the outset of the pandemic.'",
        "'speaker_2': 'And I want to thank both Mr. Mayor Richardson and council members that they have been, Alan, for bringing this item forward to make it permanent. You know, it's entirely possible. To argue for worker retention from the hotel industry standpoint.'",
        "'speaker_2': 'I mean, why would you hire inexperienced people when you can rehire dedicated, trained and team oriented staff who've already been integral to making Long Beach hotels economically successful? But that's kind of beside the point, because right now we have Long Beach families who have been through the worst economic crisis this country has faced in generations, and they're'",
        "'speaker_2': 'ready and extremely able to return to the work that feeds their children, pays their rent and their taxes. We do say it is immoral to deny these folks their livelihood, to say, oh, I know you've suffered enormous deprivation and loss and now go out and spend your time looking for work.'",
        "'speaker_2': 'This right to recall. And retention policy needs to be a permanent ordinance in Long Beach because as we all know, recovery means everyone. Thank you.'",
        "'speaker_3': 'Next speaker is Robert Northop.'",
        "'speaker_1': 'Good evening, Mayor Garcia, Vice Mayor Richardson and members of the council. My name is Rob Lowe, top policy director at the Los Angeles County Federation of Labor. And I'm here tonight to speak in favor of item nine. First, it's our belief that workers in these industries honestly should have had these rights all along.'",
        "'speaker_1': 'Proud, brave workers, some of whom we've heard from, the majority of whom are women of color, transformed these industries over the last few decades in the middle class, jobs that can sustain a family. And we call them retention, preserves that proud legacy and helps the city maintain good jobs and what are traditionally low wage industries.'",
        "'speaker_1': 'Second, once the pandemic is finally over, the economic devastation that's left in its wake will take years to sort out. So any form of sunset is misguided. As we currently speak, we're seeing the role of private equity take hold as speculators are purchasing hotels, janitorial firms and other businesses, resulting in a change of ownership.'",
        "'speaker_1': 'And workers should not be punished with suppressed wages, benefits or termination when this happens. The retention ordinance specifically protects workers in such a scenario. And third, while we're cautiously optimistic that we're close to the end of this pandemic, the reality is a new variant or some other economic calamity will eventually hit, whether that be in the near'",
        "'speaker_1': 'or distant future. Making these policies permanent helps Long Beach proactively get ahead of such a scenario and have a forward thinking economic strategy for these two industries. And finally, one which led by being the first city to move right of recall and retention for hospitality and janitorial workers.'",
        "'speaker_1': 'And we have an opportunity to once again prove the Long Beach continues to lead by voting yes tonight. Thank you for your time.'",
        "'speaker_3': 'Lee. Charlie, your time begins now.'",
        "'speaker_1': 'Thank you, Mayor and Honorable City Council people. I totally support the right of recall attention, but I as a fellow fellow hospitality worker on Shoreline Village for numerous years, I had a lot of friends during the pandemic that actually were making more money not working than actually working.'",
        "'speaker_1': 'A lot of people want to go back to work but have fears because we also need to work on bringing more tourism and more people going downtown, shopping downtown, maybe even doing staycations because as you know, as a hotel occupancy, it has to be at a certain level to have a certain amount of staffing.'",
        "'speaker_1': 'So I would ask our city council to please also work on bringing more tourism on our business, getting more people to dine downtown, so therefore that workers will feel comfortable going back to work and making money. And number four is if you go on any and did or Google right now, my friends, I have like five brands'",
        "'speaker_1': 'looking for jobs as servers, front desk clerks and they're not hiring because the sales aren't there. So can we please work on bringing more business? And I really appreciate it. Thank you.'",
        "'speaker_3': 'Next speaker is Veronica. Your time begins now.'",
        "'speaker_2': 'When?'",
        "'speaker_3': 'Not just 1/2, please. 1/2 for interpreter.'",
        "'speaker_1': 'One so we'll know when. Any sensible embassy interpreter. Soil interpreter. Command.'",
        "'speaker_2': 'Support for the entire US Army.'",
        "'speaker_1': 'Good evening. My name is Veronica Laguna and I am a member of the C. So you continue.'",
        "'speaker_2': 'Our good and then I went up 3 minutes ranking 93rd of Premier has ordered an industry that I.'",
        "'speaker_1': 'Him at the beginning of the pandemic. The city of Long Beach was the first city to make sure that all the workers in the cleaning industry, in the hotel industry, continue to.'",
        "'speaker_2': 'Be in the rest of the world where the largest river vessel that gets it, I don't believe.'",
        "'speaker_1': 'They were able to come back to their positions after the closing of the hotels and buildings.'",
        "'speaker_2': 'Xavier Martin insisted I was 17 and he said, yes, there was a water.'",
        "'speaker_1': 'We knew that our work were safe and guaranteed and that our security was also kept.'",
        "'speaker_2': 'And yet so I met M.A. Neto, Gary Payton from Seattle.'",
        "'speaker_1': 'And Long Beach sent a very clear message the respect our job as essential workers.'",
        "'speaker_2': 'I want it but the aluminum Brazil I mean they are necessary and using I said it's a labor of money.'",
        "'speaker_1': 'And now we're asking the city council, the city of Long Beach and also the city mayor to help us make this provision, this law, permanent.'",
        "'speaker_2': 'But I could put my face in our hands and the government representatives.'",
        "'speaker_1': 'So we can keep on working without being worried that we're going to lose our jobs.'",
        "'speaker_2': 'If telecom, which is, as you know, this is something we are watching.'",
        "'speaker_1': 'And I hear that many of you are already in favor and support this and we are really thankful for that.'",
        "'speaker_2': 'Which I connected with him.'",
        "'speaker_1': 'Thank you very much. Have a good evening.'",
        "'speaker_3': 'Our last speaker is. Anabella. Your time begins now.'",
        "'speaker_2': 'All our not just you and I, we love it. I mean, so. Yeah. Mr. de Sindicato, SEIU, you know.'",
        "'speaker_1': 'Available be in general hello. My name is Anabella and I am a housekeeper. I'm also a member of the SEIU. Continue it.'",
        "'speaker_2': 'He narrowly gave up on them yet in the lap of Balaclava. Yeah, but as I say, most Indian delivery, I'm a bit more micro.'",
        "'speaker_1': 'So it is obvious that these are clear that this pandemic is not over. We have these new variant Omicron.'",
        "'speaker_2': 'Continuing ESL and also Miami totally not putting one up. Young Madeline Carter in four came forward to protect our whole system of a beleaguered automobile.'",
        "'speaker_1': 'And janitors and housekeepers in that position. We're in a more risky situation. It's kind of delicate. And so it is hard for us to continue.'",
        "'speaker_2': 'As we come up in remote work that is so useful to get it.'",
        "'speaker_3': 'All from.'",
        "'speaker_2': 'The palace. An unplanned and at the moment offline aggravates commuter from a janitor from a Colorado failing.'",
        "'speaker_1': 'And I heard many of the council members tonight are supporting this move, this motion. And so for that, I.'",
        "'speaker_6': 'Really thank you.'",
        "'speaker_1': 'Very much for that opportunity. Continue to.'",
        "'speaker_2': 'Forget me. No one wants us to reconstruct. I would say you want my opinion on my first area in answer, given the man with remarkable.'",
        "'speaker_3': 'I won't take alphatauri.'",
        "'speaker_2': 'To or dry or drought. But yeah, my Roseanne.'",
        "'speaker_1': 'And not only because we are going to be rehired, but the fact that we're going to keep our seniority, that gives us certainty that we're going to have a good job when we come back. And also, it gives us hope.'",
        "'speaker_1': 'Hope because we going to keep on working and be ready for the future if there is another pandemic in the future.'",
        "'speaker_3': 'Muchas gracias for the love.'",
        "'speaker_2': 'For your.'",
        "'speaker_3': 'Fans. Amanda Nothing went back or.'",
        "'speaker_2': 'Mocking our coverage. This Italian aid hospitality and hotel features commerciale.'",
        "'speaker_1': 'So thank you all for taking us into account as essential workers, janitors, housekeepers, workers in hotels and in all these commercial buildings. Thank you very much.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'Thank you. And with that, we will go ahead and do a roll call vote, please.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilman Allen.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilman Sabina.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mango. Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Council member oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'The motion is Kerry nine zero.'"
    ],
    "Approval of the 2022 Federal Legislative Agenda.": [
        "'speaker_1': 'Thank you to the council. Next, we're moving on to item ten.'",
        "'speaker_0': 'Adam tense communication from Vice Mayor Richardson, Chair of the Federal Legislation Committee. Recommendation to require City Council approval of the 2022 federal legislative agenda as recommended by the Federal Legislation Committee.'",
        "'speaker_1': 'Thank you. Vice Mayor Richardson, are we also going to get a staff report on this? Absolutely.'",
        "'speaker_3': 'We'll have Dr. Tyler Curley provide a brief overview of this item.'",
        "'speaker_1': 'Thank you so much, Mayor, both mayor and council. Just very briefly, did want to provide an overview of some of the changes that we're recommending in the legislative agenda this coming year. First is that we are trying to restructure the agenda a little bit to make it more user friendly.'",
        "'speaker_1': 'Specifically, we're trying to streamline some of the categories and make it clearer how some of the existing directives in the agenda align with some of our priorities. So we've added sections like environment, housing, technology, transportation, some of the key issues that were already in the agenda.'",
        "'speaker_1': 'But it was a little bit difficult to find where some of those items were located. And we're also trying to think about the agenda more as a strategic advocacy plan. So in addition to sort of the, you know, ongoing directives that we have in both the federal and the state legislative agenda, we are trying to prioritize and'",
        "'speaker_1': 'emphasize at the beginning of the agenda what our core values are underlying each of the different issue areas. So in that we've tried to highlight in this year's agenda some of the core values of preserving local control, which of course was its own section in the former agenda.'",
        "'speaker_1': 'Second would be around advancing equity and inclusion. And third would be to ensure the city's long term resilience and adaptability. So those are core themes that we think kind of align throughout each of the directives and policy areas that we were hoping to highlight earlier in the agenda, as well as calling out some of our focus statements'",
        "'speaker_1': 'for 2022. So those would be themes or subjects that we can really target and focus our attention on in this coming year. And from staff recommendations and our communications with departments. Two themes really stood out. Those would be around infrastructure and long term recovery.'",
        "'speaker_1': 'And essentially for infrastructure. As you know, there are a lot of investment opportunities from the federal and the state government around infrastructure, but there are likely to be a number of projects that we prioritize locally that may not have direct funding opportunities and that we wanted to call out and make sure that we're continuing to advocate for'",
        "'speaker_1': 'those infrastructure priorities beyond the existing legislation. The other piece, as mentioned, was, is recovery. And we know, of course, we've had a very successful, you know, year and a half or so with the CARES Act programs and then rollout of the recovery plan.'",
        "'speaker_1': 'But a lot of that is one time sort of pilot program funding. And so we want to make sure that we're advocating for long term resources to keep some of those programs going. And in addition to those, we have recommended a number of specific policy directives and changes in addition to what was outlined by the committee's report'",
        "'speaker_1': '. So I'm happy to answer any questions or follow up from that, and I'll turn it back over to you. Thank you. Thank you personally. RICHARDSON Thank you, Mr. Mayor. Just like my comments, here's chair. First of all, thank you to the fabulous committee for taking the time to work through this agenda.'",
        "'speaker_1': 'We attempted to the committee attempted to make sure that we infused a lot of what we heard at council as priorities. And, you know, our relationship with the federal government, state government, county government is incredibly important, particularly given if it weren't for additional support from Fed and state government, we wouldn't be where we are today as it'",
        "'speaker_1': 'relates to our ability to respond and recover from this pandemic. So a few things I want to highlight that the committee left it up and included. It's important as infrastructure dollars come that we may have some pain, some level of local flexibility.'",
        "'speaker_1': 'If all of the funds are, you know, driven through state programs, it's hard for us to prior verified locally what we may say our infrastructure needs. It could be streets and sidewalks. It could be bridges. So we we wanted to maintain as much local control over infrastructure funding as possible.'",
        "'speaker_1': 'I think we lifted up funding to advance the supports. Zero emission transition is incredibly important and there is significant need. I tell you as chair report today can be enforceable from an interest infrastructure trust standpoint. There is significant need.'",
        "'speaker_1': 'So we lifted that up. We also there are a number of incredible bills that didn't make it through, but there's still one in the works and that's to protect the right to organize act. So we lifted that up as it has a priority in this committee agenda.'",
        "'speaker_1': 'You know, there's been significant emphasis across the entire city about funding to acquire additional land to close the park equity gap. So we re-emphasized that here as a part of the committee motion, we added language to support the preservation of the Queen Mary.'",
        "'speaker_1': 'That's been a priority for a number of the council members here. We lifted up Project Homekey and our need for additional funding moving forward on hotel conversions, tiny homes, housing choice vouchers and administrative funding for the city. We lifted up the need for additional funding for local capacity around mental and behavioral health.'",
        "'speaker_1': 'We added that the committee added some some details to requests around the sexual assault response team. And it's overall, we think this is a good comprehensive agenda that we have and we look forward to continuing to engage with our federal leaders.'",
        "'speaker_1': 'We want to thank Congressman Lyfebulb and Congresswoman Barragan for being a good partners with us, and we look forward to continuing to advocate on behalf of the city that you have, as with most. Thank you. Vice Mayor. Councilwoman Sara.'",
        "'speaker_2': 'Just seconding it. Supporting that item by my second.'",
        "'speaker_1': 'We're thinking. I do want to think the work of the Committee on the Federal Budget gender. And just a quick question also to the staff. I know that the team is working on some kind of materials that would kind of put all our Fed pledge kind of needs, as I imagine we'll do on the state legislative as'",
        "'speaker_1': 'well, into some some type of brochure or materials that we're able to take when we are advocating for projects. And I know that that's something that's really important that lawmakers like. And as is easy for staff, is that something with the progress of things?'",
        "'speaker_1': 'Yes, absolutely, Mayor. So we do have, of course, a focus on projects that will be related directly to the infrastructure legislation from late last year. So there's an effort to try to identify those most competitive projects for the existing infrastructure grant opportunities that will become available even starting now and throughout this year and moving forward.'",
        "'speaker_1': 'And then in addition to those, we will be also trying to identify other projects for potential state surplus or potential congressional earmarks this coming year as well. And we would love to be able to showcase those projects and make sure that through advocacy, we're getting all of the city's priorities in front of our delegation.'",
        "'speaker_1': 'So we will continue working on those. Great. Thank you. Dr. CROWLEY. To make sure that I know that the Fed led committee is working on putting together an annual legislative lobbying visit, which is always important. And just to make sure that when by the time that that happens, I don't know that it's been set yet.'",
        "'speaker_1': 'Whenever that happens, I imagine will be soon. It's in the spring that all those materials and pamphlets and stuff are ready for that. Okay. Absolutely. Thank you. If we can have any public comment, madam, quick hit there.'",
        "'speaker_3': 'Any members of the public that would like to speak on this item, please use the raise hand feature or dial star nine. CNN. That concludes public comment.'",
        "'speaker_1': 'And we'll do a roll call piece.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Sabina.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Otunga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'The motion is carried nine zero.'"
    ],
    "Report and Direction on Citizen Police Complaint Commission Evaluation and Recommendations.": [
        "'speaker_1': 'Thank you. Next up is item 11 six.'",
        "'speaker_0': 'Item 11 is report from city manager. Recommendation to receive and file a report on the evaluation of Long Beach Citizen's Police Complaint Commission.'",
        "'speaker_1': 'Thank you. I know we have a a lengthy report, one that I know I know staff has put a lot of work into. And I also know that this is a presentation that, uh, the council, many of the community are looking forward to seeing.'",
        "'speaker_1': 'And so this will be for many of us, the first time we get a chance to see this final report and we look forward to the presentation. So I'll turn it over to Mr. Murphy.'",
        "'speaker_3': 'Thank you, Mayor and Council. This project was a significant priority for the council, and you funded a study for the staff to work with a consultant to do an independent deep dove on the PCC. And this ten month effort by the consultant is going to present to you tonight the results of that study.'",
        "'speaker_3': 'And they have a significant amount of recommendations, primarily around restructuring the the PCC, but also a number of recommendations for enhancing the overall operations of the PCC. So with that introduction, I'd like to turn it over to Patrick Leathers, our PCC manager, and he will kick off the presentation and introduce our consultant for this project.'",
        "'speaker_3': 'Patrick.'",
        "'speaker_5': 'Thank you and good evening, honorable mayor. Members of the city council. So over the past nine months, an extensive independent evaluation of the Citizen Police Complaint Commission was conducted. And in tonight's presentation, the poll's change integration team. And I will go over how this evaluation came about.'",
        "'speaker_5': 'The steps that were taken during the evaluation process. The final report of the evaluation and next steps. So on August 11th of 2020, the City Council approved the Racial Equity and Reconciliation and Initiative initial report and directed city staff to engage an outside expert to evaluate the operations of the CPC stated and the Russell and the Racial'",
        "'speaker_5': 'Equity and Reconciliation Report as a short term action under Goal three. What is the redesign to police approach to community safety and strategy to to redesign police oversight and accountability through improved complaint and discipline practices? And so as a result of this $150,000 allocated in the fiscal year 2021 budget to support the evaluation.'",
        "'speaker_5': 'On January 27th of 2021, the city initiated a request for proposals, and so proposals were received from six firms nationwide by the March 21st, 2021 deadline. And so myself, the City Manager Team and Office of Equity evaluated the proposals and conducted follow up interviews on March 31st of 2021.'",
        "'speaker_5': 'On April 15th of 2021, the Notice of Intent to Award a contract. The Pulse Solutions, Inc. of Seattle, Washington. Partnering with Change Integration Consulting was posted. So this evaluation had consisted of four plan objectives, the first being to identify ways to improve the existing CBC operations.'",
        "'speaker_5': 'The second to identify options for redesign of the CBC. The third, to identify any related legislative priorities. And the fourth, to produce an implementation roadmap. So just going over briefly a few things that took place during the process of the evaluation.'",
        "'speaker_5': 'So between May 2021 and January of 2022, the poll's change integration team conducted a benchmark study of over of other oversight models. They did examination of the CPC case management system. They did an analysis of the CPC open and closed session meetings for the June 2021 through January 2022 CPC meetings.'",
        "'speaker_5': 'They reviewed 74 CBC case investigation files that were presented at the June 2021 through January 2022 CPC meetings. They observed that Long Beach Police Department case review meeting. They conducted interviews with internal and external stakeholders. They facilitated two community public listening sessions.'",
        "'speaker_5': 'An online survey was developed where they assessed public feedback and they conducted three public meetings to present preliminary findings. So just to get a little dense, a little bit more detail on the community participation in this evaluation. The Post Change Integration Team, they conducted a 30 interviews with internal and external stakeholders.'",
        "'speaker_5': '31 responses were received from the CBC's The Evaluation Online Survey that was posted on the CPC website to gather input. And lastly, two community listening sessions took place to gather input on CBC's reform. The first being a virtual listening session that took place on September 16th of 2021, and the second being an in-person listening session that took'",
        "'speaker_5': 'place on September 20, 20, 23rd of 2021. And so overall, the Pulse change integration team met with over 100 members of the community by way of either external stakeholder interviews or through through listening sessions. So just a few things that we repeatedly heard from the community during the evaluation process.'",
        "'speaker_5': 'For that, there's a need for independent oversight body. The community needs more transparency during the IPCC process. There is a need for oversight of internal affairs, rules and regulations. The community has waited 30 years for a good commission and the community needs to be more educated about the PCC.'",
        "'speaker_5': 'And so in December of 2021, the pull changing integration team conducted public presentations to gather input from the community speakers, commissioners and public safety the from the Community Speaker, the Commissioner of the Public Safety Committee on their preliminary findings from the evaluation.'",
        "'speaker_5': 'The input was gathered from the public for the Committee other December 3rd, 2021, Public Safety Committee meeting. Input was gathered from the community during a virtual community presentation on December 14th of 2021. And lastly, input was gathered from the CBC's commissioners on December 15th of 2021 and December 21st of 2021.'",
        "'speaker_5': 'There were also items for public comment at the Public Safety Committee meeting and both the IPCC meetings as well. And so I'll now hand it over to Kathryn Olsen and underneath Rodriguez of the Polo Change Integration Team to conduct a presentation on the CPC evaluation final report.'",
        "'speaker_4': 'There we go. Thank you. My name is Catherine Olsen, and I am one of the members of the policy change integration team. If we can go to the next slide. Patrick. I have been working on matters of civil rights and police reform basically my entire career with a real focus on police reform starting in oh six.'",
        "'speaker_4': 'I was a civilian that was appointed. Excuse me, I'm.'",
        "'speaker_5': 'Sorry to interrupt the presentation, but we've lost a quorum of the council. We need to have five council members. Thank you. We can continue.'",
        "'speaker_4': 'So I was appointed to go inside the Seattle Police Department as a civilian to head up internal affairs, overseeing a group of sworn officers. And did that work for a number of years? And after leaving the Seattle Police Department, had I been doing consulting on a variety of police reform matters, including how departments handle police misconduct investigations'",
        "'speaker_4': '? I also coauthored a book on the handling of police misconduct and own investigate allegations. And also served two terms as Nicole president. That's the National Association for Civilian Oversight of Law Enforcement and as a result was particularly interested in appreciated at the opportunity to work on this project, which involves both a focus on investigations and on civilian'",
        "'speaker_4': 'oversight. MARGARET You want to introduce yourself? Maybe if there's difficulties, Denise could pick up.'",
        "'speaker_2': 'Thanks, Catherine, and good evening. My name is Denise Rodriguez and I'm a my background in research. And in addition to working with police and a number of police reform projects, I'm also the chief deputy monitor on the Puerto Rico consent decree.'",
        "'speaker_2': 'And I've spent the last 13 years working with police agencies across the country, reformed their organization. Thank you.'",
        "'speaker_4': 'So if Margaret's not able to speak up, maybe. Denise, if you want to, just continue.'",
        "'speaker_2': 'Sure, we'll do. All right. Next slide. All right. So before we start, just a quick overview of the different city departments involved in complaint investigations. These include the PCC, which investigates Complaints Commission, recommends findings and has access to some of the case analysis produced by Internal Affairs.'",
        "'speaker_2': 'You also have the Long Beach Police Department Internal Affairs that also investigates complaints. The city manager's office that receives the recommendations from both the PCC and Internal Affairs. And issues of final determination. Then you also have the Civil Service Commission to which officers can appeal discipline to.'",
        "'speaker_2': 'Next slide. So before I pass it to Catherine to review the oversight models and our recommendations to the city. I do want to point out two important underlying assumptions. The first is that civilian oversight of police is just one piece to the puzzle.'",
        "'speaker_2': 'That is police reform. It is not a panacea and will not address all issues related to misconduct or all of the organizational and operational changes that must occur to effect cultural change. Things like policy training and most importantly, internal accountability mechanisms also play a role.'",
        "'speaker_2': 'The second is that there's no perfect civilian oversight model. There is limited research on the different oversight models, and no single approach has been shown to answer all community concerns or to be a good fit for all cities.'",
        "'speaker_2': 'Further, these models must also evolve with the needs of the city and the community over time. Next slide, and I'll pass it to Catherine.'",
        "'speaker_4': 'Thanks, Denise. There's very, very little research that's been conducted on civilian oversight with the fact of how what's required to be successful. But practitioners in the field generally agree that the attributes that are noted here are important to effective oversight.'",
        "'speaker_4': 'That includes independence, the access to information and personnel, transparency, community engagement, regular agency evaluations. And and as we conducted our evaluation in Long Beach of the PCC, we consider these attributes in terms of how how they were demonstrated by the work of CPP CC and where they were lacking.'",
        "'speaker_4': 'Next slide, please. Often people think of civilian oversight means complaint investigations. But actually, there are a number of agencies that perform a wide variety of functions beyond or instead of complaint investigations. There are three primary models a review model, the auditor monitor model and the investigative model.'",
        "'speaker_4': 'Though, in reality, most agencies these days in the United States are a hybrid of these three primary functions. Next slide.'",
        "'speaker_1': 'Please.'",
        "'speaker_4': 'The most popular or most common not popular, but the most common model is the review focused model. The investigation focused model is what the City of Long Beach has had by way of PCC. With the focus on conducting investigations.'",
        "'speaker_4': 'The Auditor Monitor model IS has become much more prominent over the last 5 to 10 years and is now the second most common model of oversight. Again, it's important to remember that most agencies combine these different functions, but the auditor monitor model is has the potential to be more effective than the other two models, because it is'",
        "'speaker_4': 'aimed at systemic change in a police department. It's aimed at looking at the broader kinds of issues that the department might have challenges with or the community feels requires some change as opposed to individual investigation or review models, which tend to focus just on individual acts by individual officers.'",
        "'speaker_4': 'It's important to note that a commission can be involved in any of these three models or any hybrid. Many agencies, however, don't have commissions. And what I want to emphasize here, too, what we heard from the community in our many listening sessions and interviews, a lot of frustration with KPCC and but also a lot of concern, concerns'",
        "'speaker_4': 'that are not easily addressed by an individual misconduct complaint, concerns that are much, much broader that I think we think will be appropriately addressed through an auditor approach. Next slide, please. We also did a benchmarking study as noted and were asked initially.'",
        "'speaker_4': 'We looked at all California agencies and then were asked to focus on those that are of similar size to Long Beach. And as you can see, they find that we're similar size. Four out of the five include an auditor monitor function within that within the agency.'",
        "'speaker_4': 'Three out of the five have commission. Next slide, please. So we looked at what works well with the current CP CC model. It is important to acknowledge that Long Beach was an early, early adopter adopter of oversight and should be commended for that.'",
        "'speaker_4': 'The commissioners and the staff that we encountered and worked with and heard from and observed are all very committed to the mission of CP, CC and take their take their jobs very seriously. And that's important to bear in mind.'",
        "'speaker_4': 'However, we found inherent limitations with the CPC model, including quite a bit of redundancy, a lack of community engagement, a lack of provision for access to information that is necessary to strive for thorough investigations. And we also I mean, just we're providing examples right now, but we also found that the way the Commission functions, how the PCC'",
        "'speaker_4': 'and I.A. interact and how the PCC fits within the larger structure is has a number of limitations also in the current model. Next slide.'",
        "'speaker_1': 'Please.'",
        "'speaker_4': 'So the limitations inherent with the model undermine accountability and transparency. Two important goals of civilian oversight. The way that the Commission arrived at its own recommendations and how it interfaces with IAEA and with the city manager's office, raised concerns about the potential for conflict and as I mentioned earlier, redundancy.'",
        "'speaker_4': 'And we found that a community trust in the department has suffered and CPC sees legitimacy as an independent investigative body is in doubt by many of the community members. Many members of the public and many internal to the city also were concerned about the legitimacy of the current model.'",
        "'speaker_4': 'Thus we're recommending a new oversight model, and it is excuse me, a combination of the police auditor model that also includes aspects of the review and investigation functions. So it's a hybrid model being recommended. We recommend that the Police Oversight Commission also be part of this hybrid model, though, repurposed as we'll be discussing.'",
        "'speaker_4': 'Next slide.'",
        "'speaker_1': 'Please.'",
        "'speaker_4': 'The just for the sake of time. We can't go through all of the detail. But if you look at the current model that Long Beach has and the role of the commission and some of the attributes we mentioned, you're going to see that under the new hybrid model that we're recommending, there's definitely increased authority and increased ability'",
        "'speaker_4': 'to impact through systemic reviews. There's still a role for looking at investigations, but the focus is much more again on auditing and broader impacts. The commission's role shifts to one of being engaged with the community and bringing community concerns back to the auditor to help set priorities with the auditor in a very collaborative fashion so that the'",
        "'speaker_4': 'community concerns are there's response to the community concerns. There's also critical incident briefings that would happen with the commission that do not happen right now, along with a role in hiring the auditor monitor. Again, the so many of the concerns that we heard from the community.'",
        "'speaker_4': 'Many concerns about the process processing that Denise will speak to. But so many concerns about policing in Long Beach that you just can't trust that any of those issues would really ever be addressed through the complaint investigations system.'",
        "'speaker_4': 'All of the attributes, independent access to information and personnel, transparency, community engagement, all of the attributes will be strengthened in the model that we're recommending. Next slide.'",
        "'speaker_1': 'Please.'",
        "'speaker_4': 'So again, the police auditor monitors role is one of addressing systemic issues through recommendations for improvement with a set procedure for a response from the police department on recommendations that are made and explanations of recommendations not adopted. Having the auditor involved in all major uses of force, the whole issue of Long Beach Police Department use of force'",
        "'speaker_4': 'is one that we heard about in in each every listening session and kind of figuring out ways to address some of those community concerns will happen both through systemic reviews and also reviews of major uses of force. There is still, as you can see, a role that the auditor monitor will play and can play when it comes'",
        "'speaker_4': 'to individual investigations, but they just won't be involved in a day to day capacity. The way the PCC is currently. Next slide, please. It is vital that for the auditor monitor to be successful that the person had broad, direct access to departmental information, databases and personnel.'",
        "'speaker_4': 'We have found and in fact, we heard from a current commissioner who is works with the Los Angeles officer inspector general, that over time, as trust is built between the auditor and the police department, that there is usually always very high levels of cooperation and collaboration that happen.'",
        "'speaker_4': 'And we don't have some of the issues that come up now that impact how thorough investigations can be. We want to see that the auditor monitor is hired by city council in a very transparent process that's going to include collaboration with the Oversight Commission.'",
        "'speaker_4': 'Next slide.'",
        "'speaker_1': 'Please.'",
        "'speaker_4': 'Also, I meant to say that the auditor monitor in cities that use this model is someone who's got, you know, deep, broad experience in policing matters. Someone who has experience doing that good communication skills is a professional to be brought into this role.'",
        "'speaker_4': 'The Police Oversight Commission role is one again to work collaboratively with the auditor monitor, bringing the interests of the community into the process. So very much playing a role of liaison, if you will, between the auditor monitor and the Long Beach community.'",
        "'speaker_4': 'The commissioners can also provide education of the community about policing matters or the role of the auditor will hold regular meetings to make sure that community input is heard and considered. And the bottom line is that the commission is going to fill that community engagement function that has been missing for 30 years.'",
        "'speaker_4': 'And we we found that people were so eager to talk about their experiences and were so eager to share. And it's been because there hasn't been a mechanism set up for regular input from the community. And this this model that we are recommending would provide that kind of input.'",
        "'speaker_4': 'We're confident that the new model that that combines an auditor with expertize, along with a commission that is going to be folding in the community's perspective on issues that are outdated is going to create much more accountability, transparency and legitimacy than Long Beach's currently seen in its current model.'",
        "'speaker_4': 'Thank you. I'll turn it over to Denise.'",
        "'speaker_2': 'Thanks, Catherine. So we know that the process of establishing the new oversight model is going to take some time. So we also identified some interim changes that we recommend the city undertake in the meantime. These recommendations are also grounded in some of the attributes of Catherine reviewed at the beginning of the presentation.'",
        "'speaker_2': 'And in terms of improving transparency, we've recommended increased transparency with complainants and the community around the complaint process itself. The role of the PCC and the recommendations made by the SEC. As you see further, we also recommend that the PCC activate its Community Engagement Committee and the committee should actively engage with the community by attending city sponsored'",
        "'speaker_2': 'events, neighborhood association meetings and the like to share with the community more information about the CBC, how to file a complaint or commendation in relation to training. We're also recommending additional training for both PCC staff and commissioners, specifically for for the commissioners.'",
        "'speaker_2': 'We'd like to see additional training on police policies and operations and a review of case examples as part of an in more in-depth orientation. Next find. So as far as improve functioning, we're recommending recommending, establishing a written agreement between Internal Affairs and the CBC.'",
        "'speaker_2': 'The written agreement should formalize the data sharing procedures, access to information, role of the internal affairs at the PCC meetings, among other items. We're also recommending that the PCC develop a standard operating procedures for the office. This will institutionalize and clarify the roles of the staff as well as their procedures.'",
        "'speaker_2': 'Next find. So I realize we're only touching on a few of these today, few of our recommendations. I encourage you all to review our entire report. We are recommending addressing timeliness issues in the process. As you all know, in most instances, it can take over a year for complaints to hear back about the outcome of their complaint'",
        "'speaker_2': '. We have found that these issues have had a ripple effect on transparency and legitimacy in the process and timeliness. In terms of the complaint investigation process, the review by the city manager's office and the sharing of information back to the complaint and the community impacts external procedural justice and creates opportunities for questions about the efficacy of the'",
        "'speaker_2': 'CPC oversight of police complaint investigations. Next slide. So a couple of our other findings related to interim changes and improved functions deal with the issues in the findings categories and the ambiguity of the other such training findings. Refining these categories and creating a policy training category to allow the commissioners to make recommendations that address more systemic issues'",
        "'speaker_2': 'is also recommended. Next slide. Another concern that we heard in our interviews with committee members and our review of documents were those related to perceived or actual conflicts of interest. A couple of ways we recommend to address the issues are citing the IPCC, its own city attorney, which is a change that was recently made, as well as'",
        "'speaker_2': 'improving the city manager's process for conducting final reviews and no longer conducting these reviews in Silo, but in a more collaborative and transparent manner. Next slide. Okay. I think I just touched on that one. Sorry. Next line. All right.'",
        "'speaker_2': 'So finally, we've made some recommendations around how commissioners are chosen and encourage the city to be more open and transparent with the process of identifying and selecting commissioners. And we're also recommending the city consider developing an alternative dispute resolution program.'",
        "'speaker_2': 'This would mean collaboration between the CBC, Internal Affairs and the city manager's office and another avenue for the community members to seek resolution on their complaints or issues with the Long Beach Police Department. Again, these are just a brief overview of the 26 interim changes we've recommended to the city to implement.'",
        "'speaker_2': 'These are changes that can be made now as I'll begin to work on a process to institute a new model. Further, these changes will also reflect to the community the city's commitment to change and improvement of the CBC.'",
        "'speaker_2': 'Before I do preface by Patrick, I do want to acknowledge our colleague on this project, Margaret Warner. She was not able to unmute herself, but she's a program manager with police. And in addition to working alongside Catherine and I on this project, she has also worked in a number of local and federal initiatives involving police and community'",
        "'speaker_2': 'engagement. Thank you. And I'll pass it back to Patrick.'",
        "'speaker_5': 'All right. Thank you, Katherine. Underneath for moving on the next steps. So here you see a breakdown of the current CBC budget compared to what the budget would be, what the recommended changes that polar change integration is recommending.'",
        "'speaker_5': 'So if you look at table number one, you will see that currently in the current CBC budget, it consists of two and a half full time employees or FTE, with the total amount for the budget being $533,497. And so with the recommended model that Paul of Change integration is recommending, there would be seven FTE, which would drastically'",
        "'speaker_5': 'increase the budget for the PCC totaling an amount of near of around $1.4 million. Looking at table number three, you'll see the comparison side by side comparison of the current CBC budget and the proposed budget with what the proposed recommendation that polar change integration is recommending.'",
        "'speaker_5': 'And so you'll see under the net impact amount that that would be an increase of $901,439. All right. So after tonight, there will be several steps that will need to be taken before a charter amendment for the CBC can go on a November 2022 ballot.'",
        "'speaker_5': 'The schedule outlines a feasible schedule to complete the process in time for a charter amendment until November and November of 2022. Fourth of the City Council provide the recommendation regarding the Charter amendment tonight. The City Attorney's Office will begin preparation of the charter amendment and so per state law.'",
        "'speaker_5': 'Discussions with relevant employee labor organizations will begin this month as well. The exact duration of the meeting for a process is unknown and will depend upon the complexity of issues discussed with employee organizations at the table. And it's important to note that actual implementation of the charter amendment may be may vary based on the requirements of meet'",
        "'speaker_5': 'and confer and state law. If an agreement is not reached. And so moving down the timeline here. So on May 24th of this year will be the deadline for the city clerk to post notice of the first public hearing for a CBC ballot item in the newspaper and three public places.'",
        "'speaker_5': 'Then there will be the required the three required public hearings for a proposed charter amendment ballot measure, which will be on June 14th, July 19th and August 9th. Then on August 19th would be the last day to submit the arguments in impartial analysis.'",
        "'speaker_5': 'On August 30th would be the last day to submit rebuttal to the city clerk. And sample ballots will be mailed out on September 29th. And then finally, Election Day would be on November 8th. So based on everything president tonight, the recommendations for this item would be to receive and file the IPCC evaluation report and provide city staff'",
        "'speaker_5': 'direction on the recommendation and begin the process for a charter amendment and initiate the meeting for a process with relevant employee labor organizations. And so this would effectively trigger the next steps in the timeline, which were in the previous slide.'",
        "'speaker_5': 'And that concludes this presentation and we are available for any questions or comments. Thank you.'",
        "'speaker_3': 'So I just wanted to conclude the staff presentation and acknowledge that we heard a lot of the findings that came out of this report. We have a lot of data and a lot of recommendations. And what we heard loud and clear from all of the stakeholders and all of the public meetings is that there is a desire'",
        "'speaker_3': 'for change, and the recommendations speak to options that the city has to implement those changes. So what that what we are looking for from the council tonight is a number one, a received file on the report. And number two, we'd like council direction as to whether the recommended action is the direction we'd like to go or if'",
        "'speaker_3': 'you would, if you're interested in a different direction, if you could provide that direction to staff so that we can initiate the those next steps. Thank you.'",
        "'speaker_1': 'Okay. Thank you. I have, of course, our folks queued up to speak. Councilman Austin is is first and I have a series of questions I think are important. Also, did councilman did I also want to hear. Do we should we hear from the public first or do you want to go to the council comment first and then'",
        "'speaker_1': 'come back? I'm okay with going with the public purse. Okay. I hear all the public's input on the presentation and then we'll come back and that might inform your questions. I certainly have a I have a series of them as well.'",
        "'speaker_1': 'So why don't we go ahead and hear from the public and then we'll come back and have a have a discussion.'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or dial star nine. Tai do. Your time begins now.'",
        "'speaker_1': 'I'm sorry. I just now got the news, so please bear with me. I'm just district one, and I really appreciate your conflict of interest analysis as well as hiring a special attorney. My experience with the police and I will give you three instances began in February, March of 2019, when I lived at Third and Magnolia.'",
        "'speaker_1': 'I reported a breaking and entering where I had reported someone entering my apartment. The police did not even want to take the USB drive into evidence and there were cameras in the hallway that would have clearly shown that somebody entered my apartment and literally turned on the gas at the back stove that abutted a wall that I'",
        "'speaker_1': 'could never turn down by myself. When I approached the property manager, he said the video wouldn't rewind. There is no such electronic video that would do that. When I reported this to two officers, they said, What do you want us to do?'",
        "'speaker_1': 'I can imagine that they'd go over there and review the video and they chose not to ignore it. In February of 21, I asked about accessibility, where I basically was being targeted by property management and by storing items in the hall and the like, obstructing my path and using a scooter and the like.'",
        "'speaker_1': 'When the police officer came out here instead of listening to me, he had the audacity to tell me that the cameras that I have in my home to protect myself pointing at the parking lot are illegal and to remove them, I told them absolutely not.'",
        "'speaker_1': 'I would not remove them. He told me that it's a business and they can do whatever they want. I need you to further please analyze how protected classes are met with disdain. I specifically pleaded with Sergeant Solo Llano forgive the pronunciation that I was disabled as well as gay, and had been thrown epitaphs at both Asian as'",
        "'speaker_1': 'well as gay, and he refused to send another officer. I just the final item was another tenant that party services witness saying that he was going to knock me out. Initially a female officer was dispatched and when I was playing her, the video showing that suddenly she was re dispatched somewhere else and then two male officers showed'",
        "'speaker_1': 'up who refused to tell it. They specifically told me that there was no such thing as misdemeanor assault, and absolutely there is. And they refused to take a report and they should have under a hate crime as well as misdemeanor report.'",
        "'speaker_1': 'Uh, I am not somebody that is insane. I came out of the closet when I was 40. I used to be an attorney. I was a full time faculty member at George Mason University. When I was 26 years old.'",
        "'speaker_1': 'I interned at the Oklahoma Attorney General's office when I was in high school. These are the things that are happening to me on a daily basis. I urge you to consider the seriousness of this and immediately approve this.'",
        "'speaker_1': 'The items.'",
        "'speaker_3': 'Tiffany Davey. Your time begins now.'",
        "'speaker_1': 'Good evening. Can I keep this rather brief? If I want to. First of all, just lend support to. I do really appreciate you speaking up and advocating for yourself and the instances that you've endured recently in the city.'",
        "'speaker_1': 'And I wish you all the best of luck. I know how hard it.'",
        "'speaker_2': 'May be to navigate.'",
        "'speaker_1': 'Certain waters.'",
        "'speaker_2': 'Is it possible that we can just.'",
        "'speaker_1': 'I mean. Honestly, Mick stops to. How do I say? Implement some of these suggestions made by the community without necessarily having to wait till November? I know there's a lot at stake, but the community spent quite a lot of time.'",
        "'speaker_1': 'I know years voicing concerns. So what can we do to expedite this process? I really want to thank police polis. Pardon. And you know, everyone who does their work and tries to change a system that is not really the product being one individual.'",
        "'speaker_1': 'But again, thank you all for the presentation. I'm strongly in support of the amendments to the CBC.CA as well as new positions created. Thank you.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'Thank you. Let me go ahead and start with some questions. I won't go through all of them unless I'm sure I have a long list of folks queued up. But I do have some I think some basic questions you want to get answered.'",
        "'speaker_1': 'I want to just start by thanking staff and the the team that worked on the presentation. I think it's a lot of information. First of all, I think for us, but I think it's important first for the council to understand it.'",
        "'speaker_1': 'This is a major conversation that we don't also all have to have tonight. I think a lot of us want to absorb what we just what we just read and get some questions answered and also hear from our from the community.'",
        "'speaker_1': 'But I do want to thank the the staff and the consultant team for putting together a robust presentation and for going out and getting feedback, particularly from our community members, but also from the PCC themselves. And oftentimes I think what we have to remind folks that the commissioners and those that have served have been serving under a'",
        "'speaker_1': 'model created by the people of Long Beach many years ago. And so they are many are they are also trying their best to work within the confines of that commission. And they also recognize and have a lot of ideas as to as to how to make changes to the PCC as well.'",
        "'speaker_1': 'And so I just want to thank them again here for their for their, their service. I had some questions that I hoped to maybe get answered by staff. So to to my my first question I think is important, and we don't need to answer them all.'",
        "'speaker_1': 'Now, if you want to get back a memo to us on this as soon as possible and a lot of the changes that were proposed, obviously, obviously the city attorney question are need to be made at the charter or at the ballot box.'",
        "'speaker_1': 'I mean, maybe there's other additional recommendations that are not presented that would also need to be made a bit at the ballot box. Is there a recommendation as to what actually ends up being a charter amendment versus what actually becomes changes to the municipal code?'",
        "'speaker_1': 'And the reason I ask that is because in reviewing other. Police commissions across the country. And I've just in just a little research I've done and they vary also not just in approach but in what, what, what, how it's actually codified into law.'",
        "'speaker_1': 'And so I'm wondering if there's been a thought as to what should actually go into the charter and then what should go into the municipal code, knowing full well that it might take off, of course, the initial change in the charter to create the commission, but then a lot of the other functions can be put in the'",
        "'speaker_1': 'municipal and I use the. The Ethics Commission and the British Commission is an example where we created a framework for a commission, but then we were adding Unicode. It will be adding Unicode changes to that as well. And so the attorney or or staff can we address that can be really interesting.'",
        "'speaker_1': 'I think that's an important piece of it also.'",
        "'speaker_5': 'Mayor, this is City Attorney Park. And the the answer to your question is because we have the existing KPCC in the charter, we would need to amend the charter to change the structure and the jurisdiction or authority of the new commission or changed commission.'",
        "'speaker_5': 'Your question as to could we model the charter amendment similar to the redistricting commission or other commissions recently adopted would be, yes. I think that that discussion and that decision obviously would not have to be made tonight, but it would be it would come during your public meetings and direction, during your decision or discussions on whether you'",
        "'speaker_5': 'want to put this on the ballot or not.'",
        "'speaker_1': 'Okay. And by the way, to be clear, I'm not advocating that that's the model we go with. But I do think it's important that the council understand that. And for us to understand what should be in the charter versus in the Munich or should we put it all into the charter?'",
        "'speaker_1': 'Knowing that that, of course, can only be changed by a vote of the people or should be. There should be there shouldn't be that should there be certain items in the charter and another proposal of meaningful changes. So I don't know what the best approach is, to be honest.'",
        "'speaker_1': 'I think you want to have a, you know, as much in the charter amendment as possible. But I but I know a lot of these commissions exist in ordinances or muni codes. And that's just something I didn't hear tonight.'",
        "'speaker_1': 'And I think I think the council should hear more from. I certainly would like some recommendations on that. And I don't know, I'm interested if you remember, you have some in the future, but that would be, I think, important.'",
        "'speaker_1': 'My other my other question was. Who is the auditor monitor?'",
        "'speaker_3': 'Mayor, could you repeat the question, please?'",
        "'speaker_1': 'Who and who actually is the auditor monitor in this scenario that you recommended?'",
        "'speaker_4': 'Mr. Miller, this is Katherine Wilson. If I understand your question correctly, the auditor monitor would be a person who is hired from outside the current city structure, city government structure. So this person will not have any affiliation with the city of Long Beach's auditor's office.'",
        "'speaker_4': 'It would be a person who would be independent of any current office or or representation group within the city right now.'",
        "'speaker_1': 'The mayor.'",
        "'speaker_5': 'The successor to the park. And I think the mayor I think if I understand the proposal correctly, that individual who was selected would be hired. If I read this right in the by the charter, the authority to hire that person would be the city council.'",
        "'speaker_5': 'So there would be three people that the city council would hire the city manager, the city clerk and this auditor inspector.'",
        "'speaker_1': 'Okay. And that's what I want to just to clarify. So. So the the because I think it said on here reports the city council and city manager. I think it said maybe I missed it. I was just curious as to who the auditor monitor actually who who hired this position.'",
        "'speaker_1': 'So in the proposal, is it just the city council? Is it basically the city council by majority vote hires this auditor monitor position?'",
        "'speaker_4': 'That's what's anticipated, Mr. Mayor, and that we but we appreciate it that the city manager still has an important function with regards to personnel matters. And so the you know, there are certain aspects of the hiring process that the city manager would be involved in.'",
        "'speaker_4': 'But in order for it to be a very transparent process, we think that the city council needs to be in charge of that process.'",
        "'speaker_5': 'And that could be determined during the charge as part of your charter alignment language in meetings on what you want to include in the charter.'",
        "'speaker_1': 'It's just not clear to me. I'm just trying to understand. It's just not clear to me. If this person is hired by the council and then reports of the council, or if they're hired by the council and then they report to the city manager or both, which would be something that currently doesn't exist.'",
        "'speaker_1': 'So I just think, you know, be good to have some clarity on what that actually would look like, what that model would look like. And because right now the council has direct hiring authority over the city manager and the city clerk, and those are direct appointments.'",
        "'speaker_1': 'And so it sounds like what you're proposing is that this would be a third direct hire, which would be this auditor monitor position. And the staff of the auditor monitor would report to this auditor position, not the city manager.'",
        "'speaker_1': 'Is that correct? Correct. Yes. Okay. And my next question is as far as the role. I'm glad that there remains important role for the commission and that you've kind of changed that a bit to be more community involvement in that.'",
        "'speaker_1': 'What what I'm hoping is that we don't diminish the role of the public and the community and the commission's role. And so. I could be reading this wrong, but it sounds like some of the function it currently is is as you propose it.'",
        "'speaker_1': 'That currently being proposed by the I'm sorry, that's currently being done by the commission. That function would then move to the auditor monitor, particularly as it relates to investigations. Is that correct?'",
        "'speaker_4': 'Weird. Weird. But the model that we are proposing takes both the auditor and the commission out of the job of looking at every citizen complaint or community member complaint that gets investigated. Right now, they're very much focused on just looking at individual complaints.'",
        "'speaker_4': 'What we're suggesting is that they, as an oversight body are going to be more effective if they, in fact, move back and not focus on the day to day aspect of complaints, but rather look at, you know, samples of complaints and quality and timeliness and that kind of thing, helping the internal affairs do a better job of'",
        "'speaker_4': 'what they're doing already, since right now both IAEA and CP CC investigate. So rather than have that redundancy, have the oversight function being one of helping to monitor and ensure quality control across the system, the commission is. Again, I started out my early in my presentation saying that many people think of civilian oversight as being the same'",
        "'speaker_4': 'thing as misconduct investigations. And I think it takes a bit of shifting perspective to appreciate that the commission will still have a very important role here, a very important role, even if they're not making recommendations on cases that have been investigated by PCC.'",
        "'speaker_4': 'Keeping in mind that they haven't even had access to all of the information that's necessary for a thorough investigation. So they've been making investigations based on on sometimes limited information. So this is just, you know, taking the issue of investigations away from the commission.'",
        "'speaker_4': 'But at the same time, giving the commission what we think is more authority in terms of a vital role, bringing community input to the oversight function and to the Long Beach Police Department.'",
        "'speaker_1': 'Thank you. And I don't have my own timer, so I could be over time. I have no idea. I don't know. The court's doing the time or during the time. But just really briefly, if you just let me know on the time.'",
        "'speaker_1': 'So just to be clear, it wasn't very clear, the investigation piece, the individual case investigation piece in your proposal. Is not now done by the commission itself. Or the auditor monitor. But by who? By the actual department.'",
        "'speaker_4': 'By the department, as it does now is the department does the investigations now. And the commission also was doing investigations. So that's where the redundancy was.'",
        "'speaker_1': 'So they were doing the same. So. So. Okay. Because I thought that there was. If it. I thought that if. I guess it was hard. It's hard. It's hard for me to tell. If a citizen puts in or if there's a a complaint made, then right now, that complaint in certain cases goes to the commission.'",
        "'speaker_1': 'What you're saying is that if they make a complaint, it would go to. The Auditor monitor and the department's already a process, not necessarily the commission itself, but the commission will be looking at broader issues.'",
        "'speaker_4': 'The Auditor and the commission will be looking at broader issues. There are certain circumstances in which the auditor might be involved in doing an investigation, for example. Right now, there's no clear policy on what happens if there is a complaint filed against the chief or a member of the command staff.'",
        "'speaker_4': 'Though we got assurance that that would be handled by someone independent. That's an example of the kind of case that the auditor could investigate. But the auditor would not be doing the day to day investigations, the hundreds of cases that get filed every year.'",
        "'speaker_4': 'Instead, that would be that job would be handled by internal affairs with oversight from the auditor's office.'",
        "'speaker_1': 'And lastly, and I'll let I'll pass with a lot of other questions with the role of the Civil Service Commission in the proposal. I didn't. That wasn't clear to me at the end. It that we have a role still.'",
        "'speaker_4': 'Yes. And I'm sorry, I didn't mean to cut you off. They they the their role right now in this system is to accept and consider appeals from misconduct findings. And so their role doesn't change under this scenario.'",
        "'speaker_1': 'Okay. Thank you. I'm going to pass it on to the rest of the council. Let me go back to Austin. Well, thank you, Mr. Mayor, and I appreciate those clarifying questions. I had some questions as well. I this system which you of we don't know who's first or what.'",
        "'speaker_1': 'So but I did want to just just acknowledge that. I brought this item forward back in 2020. Originally, it requested that we do a review of the. And get recommendations on how we can improve the efficacy of our our commission, our civilian oversight.'",
        "'speaker_1': 'This was also included in the framework for reconciliations a few weeks later that was also adopted by the City Council. And so I'm really pleased that we are at this point that this is robust. The high level review of our commission has been done.'",
        "'speaker_1': 'I do want to hold off on my comments and defer to the protocol to the chair of the Public Safety Committee, because that's that's the protocol. But I do want to just acknowledge that this process started over two years ago.'",
        "'speaker_1': 'So I'll defer my my original motion and I'll be the second or whatever. But I want to defer to councilmember on. Thank you, Councilmember Sora.'",
        "'speaker_2': 'Thank you, Councilmember Austin. I appreciate that. I would like to motion to receive and file the report and to move forward with the recommendation that staff has provided the interim as well as the recommendation for the charter change.'",
        "'speaker_2': 'But I do have some comments in question after making this motion. And first, want to make sure that two things star Patrick Weathers and Paula solution for all their hard work as well as other staff involved in getting us to this point.'",
        "'speaker_2': 'It is in addressing all three of the framework for reconciliation. And we had a report back on this, back on February 1st when we had Theresa Chandler as well as Alana Grant do a report back one year. And so it's timely that we come back with this PCC recommendation, which is to address all three, which is the'",
        "'speaker_2': 'redesign police approach to community safety. And I also want to just add to I really appreciate a message that was sent from the police department saying that they believe in community engagement, transparency and accountability because it does align in terms of the direction that I think this recommendation sets forward, which was what Ms..'",
        "'speaker_2': 'Tatum said was to address the concern that had come up not only recently from the community engagement that policy solution has brought forward, you know, have engaged with, but also prior during the listening session. And I think that that is what the recommendation is, making sure it does to address that.'",
        "'speaker_2': 'And as somebody who, in addition to Councilmember Austin and myself, who I believe are the only council member that serve on the CPC commission can share that, I think maybe more of a little bit insight. And I think what what makes this a little bit unique is I agree that some of the concern that's been raised has'",
        "'speaker_2': 'been that there are silos. You know, there's three review process actually of a complaint which not makes certainly redundant the commissioner's review, the thing complaint with certain kind of information, internal affairs of the police department reviews it and then both finding goes to the city manager.'",
        "'speaker_2': 'And I think where as commissioner it's been unclear is how decisions ultimately get made. So I do appreciate the the approach where it's more collaborative, it's breaking down the silo. But my question comes up as far as well, where does the decision I think eventually get made?'",
        "'speaker_2': 'Because before a lot of decisions were about each case. And I do appreciate it's about addressing systemic issue patterns that showed up about, you know, use of example or use of force. So but can you kind of share a little bit more of what's the process and how decision is made and what kinds of decision gets made'",
        "'speaker_2': 'through the auditor commission auditor monitor commission relationship.'",
        "'speaker_4': 'Thank you, Councilmember. So the under the recommended hybrid model. Individual decisions on an individual case of a complaint of police misconduct. Those individual decisions would still go to the city manager's office. But under the model that we're proposing, you would not have the auditor or the commission involved at all in the average complaint.'",
        "'speaker_4': 'It's not going to be there. So it would just it would be just like the current system, except for you would not have the redundancy of the CPP CC involvement. When it comes to recommendations by the auditor for broader sorts of changes.'",
        "'speaker_4': 'What our recommendations include is a timeline for the department to respond to any recommendations. And if the timeline is, you know, it can't be met or if more time is necessary, that that would get worked out between the auditor and the department.'",
        "'speaker_4': 'But ultimately, if the department did not agree with the recommendation and the auditor still felt strongly they didn't accept that rationale, then then that decision would go to the city manager. Given that the city manager has oversight of the police department, that's that's what we're proposing in the model.'",
        "'speaker_2': 'Okay. Thank you. I appreciate a little more of the clarification for the decision still. And the ultimate decision is still gets made by the city manager, but at least there's more of a process than a discussion that takes place across the entities then.'",
        "'speaker_4': 'Exactly. And a transparent process, because the what we're asking, the model that we've built would be provide for, you know, explanations from the department as to why they wouldn't adopt something or, you know, maybe it's going to be a modification of whatever the recommendation is.'",
        "'speaker_4': 'And ultimately the auditor will be reporting to the council also. And so the city council will have a flavor of what sort of recommendations have been made and how responsive the department has been.'",
        "'speaker_2': 'And I appreciate that because I think one of the challenges I've always had was why were decisions made and how are decisions made? And I hope that this is a part of the process that builds the transparency and hopefully that leads to increasing public trust.'",
        "'speaker_2': 'Because I think that one other other area that I hope I see that this can improve is increasing, you know, engagement with the communities. It always felt like the CBC was always working in secret when really it was just all of these a process set up that limits the interaction that occur.'",
        "'speaker_2': 'So lastly, I will just end on saying that.'",
        "'speaker_0': 'Councilmember Councilmember, your time is up.'",
        "'speaker_2': 'Okay. All right. Well, up here again. Thank you.'",
        "'speaker_1': 'Yes, you can go ahead and count on me. Just finish up.'",
        "'speaker_2': 'Okay. I just want to say that I appreciate the interim changes to CBC C as far as all those listed and particularly changing the word citizen to civilian, because I think citizens can be misleading in that it only reference that this is only for some people versus that it's really to make sure that's accountable to all people'",
        "'speaker_2': '. Thank you.'",
        "'speaker_1': 'Thank you. Vice May Richardson. I think Councilman Austin wanted to queue up and say So I can defer if you want me to. Thomas now. He made his comments or let me start. I did it. Okay, great. Thank you.'",
        "'speaker_1': 'Appreciate it. I just want to also just salute and commend the consultants, city staff for getting this this report done. This was exactly what we requested in terms of. And it was clear that that that stakeholder involvement, community input, really.'",
        "'speaker_1': 'Really guided a lot of the recommendations. Good findings. I think that's the findings. Many of the findings here also support many of the frustrations that many as council member, so many commissioners have had over the years, because there was always this something's missing here, right?'",
        "'speaker_1': 'There's there's something missing here. We're here doing a great job. We're working hard. But I think this this report kind of illuminated that. And so to the extent we we want greater transparency and greater accountability, we want to inspire greater public confidence in our our city and our law enforcement and oversight.'",
        "'speaker_1': 'I think the recommendations here certainly will help achieve that. I think there's some details that need to be worked out. I fully support the recommendations for the interim fixes to the current civic model. I think we have to move forward with that and with the structure or give them a stronger urging to the city manager to implement'",
        "'speaker_1': 'those. And I think the point about engagement, community engagement of the commission is is priceless. We've been doing this the last 30 years. There have been better community engagement. We would not have been so many people saying that they didn't know about this could be efficient in what it did and that it even existed.'",
        "'speaker_1': 'Right. And so increasing community engagement for for this model, existing model, but also new models moving forward, I think is going to be extremely important. And in training for commissioners, the recommendation there can't be understated. Right. It is critically important to have training.'",
        "'speaker_1': 'The current model allows us to appoint a commissioner. The commissioner gives a brief orientation. They get a few hours of orientation by staff and then they're off, right. And then they're making decisions on cases that may require knowledge about how a police officer is actually true.'",
        "'speaker_1': 'The policies that they may or may not be violating rights related to use of force, officer involved shootings or or however they're trained. And so these policies are very important. It is important for the commissioners to understand those policies.'",
        "'speaker_1': 'I've got a feeling I'm going to have to queue up a lot of notes here. This is this is a very important conversation. And I think ultimately, no matter what model we settle on here, the city council is ultimately the responsible party.'",
        "'speaker_1': 'And Bill Pearl passed away. You know, in the spirit of Bill Pro, he would say it's always the council's fault. Right. For 30 years, we've had five plus years. We've had this model now. Right. And I can tell you today that is not funded staff to the level it was when we first went into place.'",
        "'speaker_1': 'Right. And that was a oversight or potential failure on behalf of the council and management over over the years to get it to a point where there's a lack of confidence in the commission, in our civilian oversight process.'",
        "'speaker_1': 'And so we can improve upon that. We have the ability of the council to today. The. And I do think that it's important that you have a move away from the investigative model of auditor monitor and also review model.'",
        "'speaker_1': 'And and I think having a letter of. Email you with between the commission and the PD makes a lot of sense. We recently approved a similar agreement with the Lewis registry USC animal you between our City PD and the Lewis registry to share information.'",
        "'speaker_1': 'So I think that's that's something that that makes sense for for for civil civilian oversight here for the city. And that can be done immediately. The challenge I have is with the budget, and I want to I want to get back to that.'",
        "'speaker_1': 'And I'm not prepared to necessarily say we need to move forward with a ballot initiative tonight. I think the mayor raised some great points related to how we do this. There's a ballot initiative moving forward. If you restructure the way the PCC is is developed when it comes to in order to monitor and, you know, kind of'",
        "'speaker_1': 'locking in the staffing and whatnot, I think those are recommendations that we need to take in. But also we can we can massage if we go to that slide. You know, I'm looking at the salaries that are that are proposed there, the structure that's proposed.'",
        "'speaker_1': 'They're they're they're they're variables that we can we can look at, too. I think. Put forth a very, very effective body of oversight, obviously taking into consideration existing staff as well, but also responsibilities. I think that model says that there's this auditor monitor who's paid over $300,000 a year and then there's two managers.'",
        "'speaker_1': 'And my question, I guess, to the consultant is, do you see the role as the of the auditor monitor as a manager, or is that somebody just completely independent of everything? Know, that's a question for the consultant, I guess.'",
        "'speaker_4': 'Thank you. Council member Austin. I think we've we've seen the auditor monitor as being the, you know, the director of the office, you know, and I realize that might not fit in with the skiing in Long Beach. But I'm really more of a directing function with with managers who have, you know, responsibility for some of the subtasks'",
        "'speaker_4': 'that fall under under the auditors overall responsibility. I also wanted to add, in response to an issue the mayor brought up, the city of San Jose might be a model to look towards. They re not recently some time i think a year or two ago, maybe two years ago, adopted a charter amendment that allowed for a change'",
        "'speaker_4': 'in authority with their independent police auditor in San Jose. But they did not get into all the specifics. It was rather, you know, authority to make this change if, you know, if it was decided that that's the right change to make.'",
        "'speaker_4': 'And so I think there is an example there in terms of creating a structure that perhaps addresses the goals of oversight and, you know, the the basic structure without getting into some of the details that created, quite honestly, those were the inherent limitations that we started out with, you know, created some problems, completely unintended consequences, but created'",
        "'speaker_4': 'some issues that that could be avoided.'",
        "'speaker_1': 'Thank you. I know I probably adjusted my time IQ up later thinking. The question. Thank you, Councilmember. Mixed up is customary, Ringo. Vice Mayor Richardson. Oh, you're right. There are going back. Leslie Richardson and Kathryn. Thank you, Mr. Mayor.'",
        "'speaker_1': 'First, thanks to everyone who's been involved in this process. I want to applaud first all the people who served on that commission for decades. Everyone has done exactly what the city is asked to do. When this commission started and I think it was highlighted in the presentation.'",
        "'speaker_1': 'We were one of the first to do this. And and although there have been over time, there were concerns about the commission's role being outdated. I think it's important to acknowledge that at one point this was cutting edge and it was leading, I think was being presented in front of us.'",
        "'speaker_1': 'There's certainly been some things to tweak, tweak, but I think it's important to note that this is a big step forward. And I actually like the idea of adding another factor with the auditor monitor that's focused on big picture structural, systemic changes.'",
        "'speaker_1': 'I think that's good. Those are upstream. Those are big picture. If you get that right, it becomes a more functional police department, a more functional government. The big picture is people want to have trust in their local government and they want to have the trust in their police department.'",
        "'speaker_1': 'And that is, you know, that requires a high standard. And I think having someone whose only function is to look at policies and data and making sure that, you know, iron ore, sharpening iron as it relates to our police department is a very good thing that builds public trust and confidence.'",
        "'speaker_1': 'I sort of like I sort of like the idea of maintaining some engagement with our civil service commission in our charter, civil services, already independent of the city, that there have been concerns about the process of, you know, when a recommendation the commission makes a make recommendation.'",
        "'speaker_1': 'The city manager doesn't necessarily report back some of you know the details of why upheld or didn't hold some of the concerns. But I think if there's a function or a connection, perhaps oversight of the audit to monitor or see PCC, there's some alignment with civil service that's already independent city manager.'",
        "'speaker_1': 'I think that's a strength we can play to. I think we need to, you know, as we advance toward a ballot measure, really refine what the role of civil service could be because there could be we could lean on that strength of independence here.'",
        "'speaker_1': 'I think I also want to just state that, again, it is not it is not something that happens overnight. It requires when you see patterns of disparity for generations, when you see issues that build over time, those are not incidents, specific incidents.'",
        "'speaker_1': 'Those are those that mean that that means they're systemic. And having an auditor monitor and looking at our charter and all of those things are systemic solutions to a systemic problem. And so when we think about building public trust or accountability or transparency, you know, just putting together a program may not cut.'",
        "'speaker_1': 'It was changing the actual structure of how things work and putting some accountability checks and balances in place and with, you know, with a mission of accountability and transparency, I think that's the way to move forward. You know, I do have a question about the process.'",
        "'speaker_1': 'I know that this will these changes will have an impact on city employees, whether it's civil service employees who are representing or police officers that are represented. I know that we're going to need to work through a process, probably a meet and confer process.'",
        "'speaker_1': 'I would like to know what that a little bit more details on what that looks like and how we can make sure that these changes are back in front of our city council in time to actually meet the deadline for the ballot this November.'",
        "'speaker_1': 'I know. I know it was touched on, but I'd like to just hear a little bit more from staff about what that process looks like as we move forward. That incredibly important for us to understand how urgent it is for city council to take action and make a final recommendation.'",
        "'speaker_3': 'So the assuming that we get direction from council tonight on the the either the recommended model or some version of that. The next step would be for us to start the meet and confer process. And what you heard reported earlier was a really high level of that schedule.'",
        "'speaker_3': 'And we've roughed out a schedule that assuming that we start the the process of bringing the language for the ballot initiative in May based upon the city clerk's schedule, we feel that the the several months between now and May would give us time to establish and work through the meet and confer process.'",
        "'speaker_3': 'Obviously, if we started that in May, based upon the city clerk's schedule for an amendment or a charter amendment for the November ballot, we could make that. But I think, you know that the issue regarding meet and confer would be around the any change to the duties of either a either the the staff of the PCC or'",
        "'speaker_3': 'the the current police department staff. So any change in duties requires that meet and confer process. And the idea would be to work through those and come to some consensus so that we could move the the ballot amendment forward by the May 24th date.'",
        "'speaker_1': 'Okay. Just final thought that, you know, publicly, you know, the community demanded that this is what the community demanded well before the reconciliation or motion of that council happens, I think it's important that we we all made multiple commitments.'",
        "'speaker_1': 'Councilman also mentioned earlier we made multiple commitments to the public to get this done. And so all parties are going to need to come to some sense of agreement in order to meet this deadline. That's just the reality.'",
        "'speaker_1': 'So we made a commitment, you know, through you know, we talked about redesigning police oversight and accountability to improve complaint and discipline practices. That's something we voted on unanimously. And I think from what we have so far, from what I'm hearing from folks generally, we have a direction to go, but we need to get through those details'",
        "'speaker_1': ', engage with our partners and make sure we have some degree of consensus in order to meet this deadline. Thank you. Thank you. Next up is a council member, Ringo. Thank you, Mary, and thanks to my colleagues for all their comments.'",
        "'speaker_1': 'But I think that one of the reasons the public was concerned about the CBC is communicate lack of communication, lack of transparency. And we've talked about that. But at the same time is that the lack of communication with the community?'",
        "'speaker_1': 'A lot of it. And when I heard about complaints that were coming through and that the community was being heard, if there was a language access problem as well, Spanish speaking people weren't being understood. No, no. Bilingual staff at the complaints that were being filed were not very clear because they didn't know how.'",
        "'speaker_1': 'So it was it was it was a lot of confusion there. A lot of actually a lot of frustration that was taking place about how do you file? Where does it where does a complaint go? And then, of course, the usual take it, take a year, two years to have any kind of resolution on any complaints.'",
        "'speaker_1': 'That's where that that's where all of this comes from. And what we're talking about right now is a big a big change, essentially. Well, we're going to put it in a ballot is approve creation of a new department because we're asking the CBC not only to be a commission, but also to have its executive director would be'",
        "'speaker_1': 'a monitor auditor to report directly to the city council. And so we were talking about now that city council would have three people to hire. Sinbad, you're see. Clark And now this is the honor monitor, which is at, at the departmental level, where we would have to have the reports out, because I would want reports on a'",
        "'speaker_1': 'consistent basis as to what this guy, this guy, this individual is doing in terms of their job, because they're going to be at the council or city council reporting level. I won't at all what they're doing. Also, we're increasing the budget of about two and a half times from what it currently is, 500 to 1.4 million.'",
        "'speaker_1': 'And that's that's a significant increase of a budget, especially for what that's going to be at the departmental level. The other thing is I haven't heard anything about the the the staffing that's going to be there. I hear about the auditor monitor, but who's actually doing the investigations?'",
        "'speaker_1': 'I saw a staff of seven. I saw a stack of seven with the other monitor. So are the other five or six investigators. Somebody has got to go out there, talk to these police officers. Somebody has got to talk to the community, to the to the complainants and to get their their complaints resolved or at least addressed'",
        "'speaker_1': '. So I haven't heard anything about that, as well as the need to deal with our language access problems. We need to have people there who can actually communicate with the complainants, and I didn't hear anything about that at all.'",
        "'speaker_1': 'And then, of course, there was a discussion about training and I totally supportive of that. The more training our commissioners receive and our staff, all the better. Which brings up the other issue where we're going to be basically restructuring a security into a civilian oversight commission.'",
        "'speaker_1': 'What's going to be the makeup of that commission? What are we looking at? How many members are we looking at? Other commissions? Most of our commissions have five members that we're looking at at the same structure as five or seven or nine.'",
        "'speaker_1': 'What are we looking at in terms of that structure when it comes down to a ballot measure? What are what are the people going to be voting for? Well, in that regard, because there's going to be a lot of interest out there in regards to policing in general.'",
        "'speaker_1': 'I mean, we know that that we're on the line for everything that's happened with the last two years in public safety and the reviews that are out there and and the responsibilities of our police department and modern policing in general.'",
        "'speaker_1': 'And we're the ones in the city council being held accountable for that. It's it's our duty to ensure that our residents are receiving the best quality services possible, and we do that by hiring. It's on us to make sure that we hire the best and the brightest that we get there.'",
        "'speaker_1': 'And we do it with the city manager. We do it with our city clerk. We do it with now this new guy. Here I go again with this individual, new individual who who might be taking this this position of auditor monitor.'",
        "'speaker_1': 'And that person is going to have to do the the hiring of his or her staff when it comes right down to it. So I'm very unclear about a lot of these issues. This is the first time I see this report and reading it.'",
        "'speaker_1': 'So I'm going to have to have a little bit more of a deeper dove into the specifics of the report. And, of course, this this is an overview that we received today, which is that it's just an overview in order for us to really dove into what we want to include in a ballot measure to create this'",
        "'speaker_1': 'a new commission. So the jury's still out for me in regards to what I'm receiving today. I want to probably get at it again with Commissioner Commissioner, Councilmember Sorrell when we meet at our public safety committee, a committee in the next.'",
        "'speaker_1': 'Couple of weeks or few times, we could probably pick up deeper and deeper analytic view as to what is being proposed here. So kudos to staff. Great report. Kudos to everybody who worked on it. Very thorough. But again, it's it's my first shot at it.'",
        "'speaker_1': 'And now when I have an opportunity to critique it a little for me. Thank you. Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'Thank you. I want to thank the staff for their work on this project. And I want to thank the consultants. I wish we could have gotten a preview. I think items like this, I really feel more comfortable when I have more time to digest it.'",
        "'speaker_2': 'And I imagine that the public feels the same way. Also, I would add that. A lot of complex things, a lot of big changes. I'd love to dove into the details more clearly, and I'd love to see some input and feedback from people who are.'",
        "'speaker_1': 'Really.'",
        "'speaker_2': 'Aware of the issues that are already working within the city structure. So I heard earlier this is named X or Y, but in the city of Long Beach it might be named something else. I think there's some value in finding out what that language is so that it's more palatable to our city staff, who mostly live in'",
        "'speaker_2': 'Long Beach and will be voting on this this this initiative. And we at the Council have really worked hard at ensuring that we have that community input before we put items on the ballot so that we have a lot of support for those things.'",
        "'speaker_2': 'And I think that there's a lot of. Opportunity for that in the next few weeks. I know we have some strict deadlines, but I'd really like to see some additional feedback, including but not limited to I worked for under the Obama administration Grant.'",
        "'speaker_2': 'I did a lot of work with police department reform, and I think it's really critical that we acknowledge that some of the people who want the reform the most are those within the department. I remember one of my first shifts as a deputy.'",
        "'speaker_2': 'I was paired with someone who was not the most admirable individual to work with, and it put me in a really compromising position and as a newbie and a rookie and I didn't want to be put in those positions and I dealt with them in the appropriate manner.'",
        "'speaker_2': 'But there's a lot of pressure in those positions, and I know that a lot of individuals who are in law enforcement want to have opportunities to bring light on the bad apples because 99% of the people are are doing the right thing all the time.'",
        "'speaker_2': 'And the bad apples are the ones that are bringing bringing forward this opportunity. So I'd like to know, what have we got? Going back to my work with the Obama administration Grant, one of the things that we felt was critical to the instruction that came out of the research out of University of Chicago was that when implementing'",
        "'speaker_2': 'policies that impact.'",
        "'speaker_1': 'The.'",
        "'speaker_2': 'Police department, they're most effective when they've actually received input from individuals in that department. Have we done that? Have we also had input from individuals in internal affairs on how they can be better at their job in supporting the Citizens Police Complaints Commission?'",
        "'speaker_2': 'And then I know I've spoke with Dana and others that serve on the commission and they had a lot of ideas as well. And Mr. Mayor brought that up that, you know, they're really limited in some of the things they can do because of the way the charter is written.'",
        "'speaker_2': 'And it seems as though you've gained some of their input already, but I don't know that I understand the extent of it. And so I think I'll ask for a private presentation where I can dove into a lot of those details in the next week or so.'",
        "'speaker_2': 'And then also, if I could hear from the community, community or committee and I don't know, I know maybe we can either sui from the.'",
        "'speaker_1': 'Public safety.'",
        "'speaker_2': 'Committee and or the consultant and what outreach was done to our own. Officers that want to fix our department.'",
        "'speaker_1': 'The question. Also, the staff want to answer that. I think there's a couple of questions there.'",
        "'speaker_5': 'Hi, this is Tom. This is city manager. So we one thing we try to really accomplish here is to make this a fully independent report. So that's why we brought on this outside group. We really wanted them to come up with best practices and look throughout the nation what others did.'",
        "'speaker_5': 'They did help hold a couple of community meetings. We did not have this report kind of go through the police department. We did not have our police management weigh in on this. Frankly, the city manager's office didn't weigh in on it very much either.'",
        "'speaker_5': 'We really wanted their recommendations to come directly to you because it's supposed to be a report about the oversight of both the police department and then the city manager's office who oversees that. So we did not engage officers at that level.'",
        "'speaker_5': 'We do expect more as we move into the meeting confer. We're going to get a lot of feedback. I can't guarantee you that we're going to stay on the schedule that we put out there. We do think we have a schedule that we could make a November deadline if that's the goal of the council.'",
        "'speaker_5': 'But some of that discussion might take some additional time. So we do have our work cut out for us over the next couple of months to engage through the employee organizations and get that direct feedback.'",
        "'speaker_2': 'Well, I appreciate the meeting confer process.'",
        "'speaker_1': 'I think it's bigger than just.'",
        "'speaker_2': 'Meeting with quote unquote union representation. I think union representation is important. But I think even before that, surveys from the community, even retired individuals in different forms of public administration and police service, and then also some of our current law enforcement really should get an opportunity to weigh in and all.'",
        "'speaker_2': 'There's so many examples of how it makes the policy that much stronger in the end. So I hope that those organizations and people in internal affairs, people who've worked in internal affairs, hopefully people who are retired and have no ties, would also have the opportunity to weigh in and voice their grievances and opportunities for how to make'",
        "'speaker_2': 'the system better because they've all worked in it and the restrictions. So with that, I'm going to do some more homework and circle back with everyone for some additional work. But a lot of information, a lot of work was done and we appreciate the consultant and the staff for the work and time, they said, bringing us back'",
        "'speaker_2': 'to work. It's really important work and we got to get it right because as far as we can see from the current, see the current citizens, the commission, what we put in through a ballot initiative is there for a very long time.'",
        "'speaker_2': 'So we need to do it correctly and put the investment and time in. And I know that this is a beginning step and there's great work ahead. Thank you.'",
        "'speaker_1': 'Thank you. Next, I have Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. So I appreciate all the comments of my colleagues and Councilwoman Mongeau. I had a lot of the same thoughts and I agree with a lot of your your recommendations and comments that you made. I do have a couple of questions about the role of the auditor monitor.'",
        "'speaker_2': 'I'm going to call that role a gal just to bounce off with the council member, Rhonda, when I call her the gal. But that position, when you look at the responsibilities and the recommendations that are laid out. Is it envisioned that these possible duties would be independently carried out by this position, or is that in combination with'",
        "'speaker_2': 'the commissioners or part of the commissioners?'",
        "'speaker_4': 'Thank you for your question. This is Katherine North. And I what we envision is that the auditor monitor, the GAO, will be working collaboratively with the commission in setting priorities and in developing recommendations. So, you know, they'll work together.'",
        "'speaker_4': 'But it's sort of recognizing that the auditor has the expertize to be sorting through data and in developing recommendations and the, you know, the background in best practices and what have you. But that is not you know, they're not going to act on their expertize in isolation.'",
        "'speaker_4': 'They're going to work with the commission in terms of getting input from the community on particular areas of concern and then how the community feels about the recommendations that are being made.'",
        "'speaker_2': 'Okay. So just because I know I'm on a I'm on a literally on a clock with my comment. So some of the recommendations like review, all major uses of force, visit the scene of critical incidents. Is it a vision that this individual would go out and do their own independent investigation?'",
        "'speaker_4': 'No. The what what's envisioned is that by being able to go to the scene of a critical incident, for example, they can they can kind of monitor in terms of how the criminal investigation is is happening in case there's any concerns there.'",
        "'speaker_4': 'But they're not going to be interfering with or actively involved in any way if they do. You know, it's not if, but down the line, when there is a review of, for example, a use of force in a critical incident, they're going to have the benefit of actually having been there on scene and and bring that experience'",
        "'speaker_4': 'with them as they help critique the review that occurred.'",
        "'speaker_2': 'Okay. Well, and that's why I think it's important for us to bring in the department as well, as well as the district attorney's office, because as someone who's responded to many things in the middle of the night, I know that the the role of the parties that are out on the scene is very important in terms of'",
        "'speaker_2': 'preserving the investigation and making sure you're not getting in people's way. So I think, you know, for me, there are a few red flags like what would this person's position be? Would they kind of be, you know, just flying off in the space of the investigation and kind of hovering or would they be hands on?'",
        "'speaker_2': 'Have we envisioned what the relationship would be of of this particular position with the DA's office, where there is use of force or officer involved, shooting analysis, investigations going on, where the DA's office investigators are involved.'",
        "'speaker_4': 'We did not get down to that level of granular detail. Unfortunately, I knew just the scope didn't allow for it. But we do say in a number of different instances, spelling out those details is really important. And, you know, we're not going to pretend that we would know exactly how that should work in Long Beach versus in'",
        "'speaker_4': 'Anaheim or, you know, L.A.. But I can assure you that it is the norm for a person such as an auditor monitored to be going to critical incidents. And and, in fact, in some investigation offices, that's also the norm.'",
        "'speaker_4': 'So that those kinds of details can be worked through. And I also wanted to say that the couple of comments that have been made about the importance of involving the police department as as the charter amendment gets worked through as the any any legislation gets worked through.'",
        "'speaker_4': 'I we wholeheartedly agree with that. And in fact, we did engage with the some members of the department command staff with Internal Affairs on the front end and then also sharing some of our preliminary findings. You know, we did not have the opportunity to engage with the with the entire membership.'",
        "'speaker_4': 'And and but we do we have talked about how important it is to have that kind of communication strategy as the city moves forward with this, to have advocates for, you know, the vision. And so that that kind of engagement is happening with the department, with other members of the city government, with the community, all stakeholders involved'",
        "'speaker_4': '100% agree that should be happening.'",
        "'speaker_2': 'Okay. That's great. You know, I'm grateful for our commissioners. I know a few of them, the ones from the third district. I know they're heavily engaged in this. And our newest commissioner that's been serving, Michael Soto, I know has hands on experience with this type of work in terms of how it's done in L.A. And I'm I'm'",
        "'speaker_2': 'grateful that they're part of this conversation. I think that's important. They should be active parts of the conversation. My time is probably up, so just in case I get cut off, I did have a question about the role of the commission and the Auditor Monitor on the issue of training recommendations for the police department.'",
        "'speaker_2': 'There's a lot of great white papers coming out right now regarding police reform and restructuring and some best practices that are being implemented by by universities and trainers throughout the country. I'm wondering, what would what do you envision the role of this commission or this auditor monitor being in terms of top down training, culture changing training for'",
        "'speaker_2': 'the department?'",
        "'speaker_4': 'Again, I think we're in an area where we all will benefit from each other's thinking on this. So to the extent that the auditor, for example, based on just their expertize and the experience they would bring to the office, might have access to an information about training that a an average commissioner who might be a layperson from'",
        "'speaker_4': 'the community doesn't have that grounding and the training. But they can learn about it. And as they learn about it, learn about what the issues are, what the challenges are, what the options are, and and then also share that kind of information with the community and bring some of the community's thoughts about the process back there.'",
        "'speaker_4': 'You know, whether it's policing or it's oversight, it is a very much of an evolving field. And, you know, we we look for promising practices, but, you know, there aren't a lot of I mean, there are best practices.'",
        "'speaker_4': 'But right now, there's so much change that's happening, thinking about promising practices and where it makes sense to, you know, perhaps try a new approach, whether that's, you know, whatever that is. It can be, you know, diversion options for arrestees that can be involving mental health professionals on the front line.'",
        "'speaker_4': 'You know, those are typical kinds of issues that are coming up the same way that body camera, you know, having body camera was the thing five or ten years ago. So I think the community, you know, as long as as Long Beach and the department is, you know, forward leaning and and everyone is working more from a'",
        "'speaker_4': 'place of collaboration than than an adversarial place. I think there's a lot that can be done here.'",
        "'speaker_2': 'Okay. And just because no one has cut me off and I feel like I've won the lottery with my time, I'm just going to give you one more comment. I think our timekeeper might be asleep at the wheel, so I'm going to take advantage with this one.'",
        "'speaker_0': 'Your time is up, Councilmember.'",
        "'speaker_2': 'Oh, okay. I can reach you. Shoot. I'm the worst criminal. I read myself out. I'll recue.'",
        "'speaker_1': 'Gentlemen, if you have one more question, go ahead and do it.'",
        "'speaker_2': 'I do. It's more of a comment than it is a question. And that is, first of all, I think these changes are necessary. Look, taking a deep dove and looking at what needs to change is necessary because the commission has really turned into a monster.'",
        "'speaker_2': 'They don't have the transparency and the independence that they need, and there's not that collaboration that we envisioned. So the effectiveness is questionable. So I think there definitely is an opportunity for reform. But I will say the budget impacts, the recommended budget impacts are huge.'",
        "'speaker_2': 'And I agree with Councilman Aranda on that. We have major issues to address citywide. Increasing our police patrols is one. Addressing our homelessness issues is another. And I just I just cannot imagine a hit this big to our budget and where that would come from in terms of priorities.'",
        "'speaker_2': 'So a huge task ahead for the city manager because I'm not sure these changes are going to be wanted and recommended, but I'm not sure if there is a phased in process, if there is a way to whittle this down a bit to reprioritize some things.'",
        "'speaker_2': 'But the budget impact for me is the hugest thing that's glaring out at me as the potential issue here. But otherwise I thank the consultants for their work and the commission for working with them and Mr. Mayor, for letting me go a little over things.'",
        "'speaker_1': 'Ukrainian Councilwoman Ellen.'",
        "'speaker_2': 'Yes. Thank you, Mayor. And I also want to thank all the consultants.'",
        "'speaker_4': 'For the.'",
        "'speaker_2': 'Presentation. I see some major opportunities for improving oversight and community trust through this proposal, and I know that many community members wanted to reevaluate our CPC, see how it operates and the scope of authority. I appreciate that insight that the CPC would be more effective if it had more resources.'",
        "'speaker_2': 'So like Councilwoman Pryce, I am concerned about that and what that looks like. This is a major change overall and we would nearly triple our investment in staffing and oversight resources. I know that community members, especially people in my district, have asked for greater transparency and oversight, and this proposal would definitely do that.'",
        "'speaker_2': 'I agree with Vice Mayor Richardson on our fight. I had the same questions about the inmate transfer and me personally, I would have liked to to know what our labor organizations have to have to say about this. I know that our city manager, Nordica, talked about, you know, the process, but I still don't don't completely understand why'",
        "'speaker_2': 'they weren't why the police don't hire the police or the labor unions weren't involved in the process. But but nevertheless, at the end of the day, I agree with one of my colleagues. It's a sad I agree with what Councilwoman Mungo said, that we just have to to have to get this right.'",
        "'speaker_2': 'I definitely support more oversight, but I definitely would like to have a little bit more information as we're taking the next.'",
        "'speaker_4': 'Steps.'",
        "'speaker_2': 'In this. And so I do have a question. Do we will we get a chance to have another meeting on this after the meet and confer starts?'",
        "'speaker_3': 'The idea behind the meet and confer or let me back up a little bit. What we're looking for tonight is a direction from Council on the general framework or the structure that you would like the staff to pursue.'",
        "'speaker_3': 'That is what we would then take forward to the meet and confer process once the meeting confer process is completed. Then we would certainly come back to council because you would need to take action on the potential ballot language.'",
        "'speaker_3': 'At that point, it would be too late to to change and shift or go to a different direction. So the direction that you provide us, whether it's tonight or a subsequent meeting, that is the direction we would go into the meeting confer with and that is the direction that would ultimately be drive what we end up putting'",
        "'speaker_3': 'on the ballot. Does that answer your question?'",
        "'speaker_2': 'Yes. Thank you very much. I appreciate that.'",
        "'speaker_5': 'And this is Tom. This is all based on the assumption of trying to get on the November 2020 ballot. I heard a number of people say, we got to get this right. So we are shooting for that target.'",
        "'speaker_5': 'But the council will have the option to to say we need more time. So if what we could bring back from meeting confirmed doesn't meet the needs, then we can go through that process again. We can get amendments that will just elongate the time frame.'",
        "'speaker_5': 'We'll also certainly look at the concept of can you do something higher level in the charter and create that new authority and then do that through a further meeting confirmed, further detailed, either in the municipal code or through bylaws.'",
        "'speaker_5': 'We'll certainly look at that recommendation as well. So we are just trying to meet the the intent of the council to have something on the November 2020 ballot that was really kind of clear to us as we started this.'",
        "'speaker_5': 'But now that it's coming back to the council, it's really going to be in your hands on on what that timing looks like.'",
        "'speaker_1': 'Thank you, Tom. Counsel for Supernanny. Uh. Thank you. Um, I just have a couple of points that I wanted to make, and that is, I think the city manager has said that he heard several times we got to get this right.'",
        "'speaker_1': 'I heard the consultant say this is an evolving field. So I think we might be in the area of, um, making the perfect the enemy of the good here. If it's an evolving field, maybe we need a more flexible model so we can evolve with that field.'",
        "'speaker_1': 'And that's why I thought the consultant might come back to the that is saying it's an evolving field. Then what is the prescription for that? That's what I would like to see. The thing I keep hearing is this this price tag.'",
        "'speaker_1': 'And I would just say we had better not put something out about we can't afford it. Just that simple. I don't mean to simplify this, but that's what we're staring up at right here. And I just don't think we're ready tonight.'",
        "'speaker_1': 'To provide the data that's needed to move forward its effects. Thank you. Before I go back to Customer Austin. I do have some questions. Some of what's been mentioned and countless people I just spoke to this partly, but I actually think to go back to something I asked earlier, and I think this is the critical question, which'",
        "'speaker_1': 'is what actually goes into the charter and then what goes into the municipal code or bylaws after that? And Tom, wouldn't it be that doesn't that have a lot of impact on the meeting confer process. It could. So should we.'",
        "'speaker_1': 'The timing book?'",
        "'speaker_5': 'Yes. Both would have to be meeting confirmed no matter what. So. But it would be what had to happen before November and what has to happen afterwards. So we can certainly explore with the city attorney's office something is going to have to be in the charter change.'",
        "'speaker_5': 'So really reforming the powers of the PCC, at what level can that be done? And then we do confer on that. And then if you wanted to bifurcated, then you wouldn't be able to start a commission until you're done with the rest of the work, which is the granular detail.'",
        "'speaker_5': 'In the meantime, we would really still recommend that we move forward on those interim recommendations to the currency PCC. I think that's in the motion. We heard that from the Council. There will be some budget impact to that.'",
        "'speaker_5': 'I'll bring that forward to the budget process. But that would allow us to get started on on those interim changes as well.'",
        "'speaker_1': 'Okay. Well, that's great. And then Tom would have it just to also be clear, because it wasn't it wasn't super clear to me what beyond the staff recommendation and the motion that's on the floor. Do you need from the council to move forward in the process any anything else?'",
        "'speaker_1': 'Or do you feel you have enough to take the next step?'",
        "'speaker_5': 'I think we have enough, from what I'm hearing from the council tonight to take the next step. I'm hearing a couple of things. Is the desire to still move forward with a charter amendment and to bring that at least through the meeting, confer and bring it back to the council with what we come back with.'",
        "'speaker_5': 'We'll certainly look at a bifurcated approach as well. I did hear a loud and clear concern about cost. I have those concerns as well. And what does that actual model look like and how could we maybe trim some of the costs?'",
        "'speaker_5': 'Some support of the interim changes as well? What can we do now with communications, with improving the KPCC model that we currently have, and just try and do some better management, better training, potentially some staffing, get that into a a a better position.'",
        "'speaker_5': 'And and then we would go through this meeting, confer, get all the input from our labor partners as we lay forward the recommendations. Because what you got tonight was a high level recommendation, but there's a lot of detail in the actual report that's in front of you tonight, and then we'd come back to you with what that'",
        "'speaker_5': 'plan is in March or May and see if we're able to move forward with the ballot measure for November.'",
        "'speaker_1': 'Okay. And I would encourage us and I think I heard that earlier that Councilman Suarez I believe having some meetings as well and so that be a good opportunity for input and and discussion and you know very. What do you envision, Mr. Murphy, as far as next steps for the council?'",
        "'speaker_1': 'So you're going to you're getting what you need. You're going to go off and look. Begin being confirmed, begin the process. And then you'll come back to the council for, I imagine, a broader conversation. Is that how what do you see?'",
        "'speaker_1': 'As for the timeline?'",
        "'speaker_5': 'Yeah, I think so. So while we definitely want to make sure we get it right from the council, there are some timing concerns with the meeting confer. You need to have a proposal in front of your labor groups to say this is what we're going to try to accomplish.'",
        "'speaker_5': 'And then you let them interact with that, ask all the questions and get to a point where they feel like they have their questions answered. If we change it later, we can do that and then you have to restart the meeting confirmed.'",
        "'speaker_5': 'So tonight was really the goal to hit as many of the high level details from the Council as possible, knowing that we're not going to get into the granular let yet let us work that out at the bargaining table, you know, on the granular details, and then bring that back to you.'",
        "'speaker_5': 'And hopefully we'll have something that's been supported by through the meeting confer process but then also meets the council's goals. But we also heard loud and clear if we've got to get this right, if what we bring back in May isn't ready, then we do need to consider of getting this on the on the next charter amendment'",
        "'speaker_5': ', which isn't for another two years. So we really are trying to get this all done so that we can do it and once in one in one package if possible.'",
        "'speaker_1': 'And just to be to be clear, four charter amendments that they can only happen every every two years. It can't happen in a special election and it can't happen before that. Is that correct? That's correct. Which which again, I think Mr. Monaco, which is why I think the parallel track of the meeting confirm process with what's been'",
        "'speaker_1': 'presented. And a deep dove as to what a ballot measure would look like that would provide an overall kind of an overall overarching commission structure, but then allow the council to work on municipal code additions to it. I'm really look, I'm really hopeful that we see both those options.'",
        "'speaker_1': 'I'm not sure what the best option is, but that does provide, I think, some more more options. You know, I think the concern of some and the council and some what I've heard tonight is that, you know, whatever would come back, that we would miss our deadlines through the meeting for process.'",
        "'speaker_1': 'And then essentially you are three years away from this this getting back to any changes. And I think I think that everyone I think when I'm here from the councils, everyone is interested in moving forward and obviously make sure we get it right and we get the proper input from all the parties.'",
        "'speaker_1': 'But I think there is that interest too, and we're anxious to see what you bring back. So thank you for all of your work. Councilor Interesting. Thank you. I think you addressed most of my questions. I did want to follow up on Councilmember Supernovas point because I tried to make this similar point earlier.'",
        "'speaker_1': 'And I think Mr. Mayor, as well. I do like the idea of having some some flexibility to to, you know, maybe build this into our municipal code as opposed to going to a ballot initiative completely. And so I think we need to we talk about a hybrid approach.'",
        "'speaker_1': 'I think as we we we move forward with our changes to potential changes to our civilian oversight process that we have a a of some flexibility to try to manage personnel and direction, but also clarify the role of the commission as well with the voters.'",
        "'speaker_1': 'Because I think, you know, the current model kind of has hamstrung us a bit. But at the same time, the current model has has afforded there to be a lot of administrative oversight and control in terms of budgetary and staffing.'",
        "'speaker_1': 'So just keep that in mind as well. I would ask the city manager of think about ways in which we can still have the flexibility to govern, but at the same time provide that transparency, the accountability and and improve public confidence and trust in the police department in our city.'",
        "'speaker_1': 'Thanks. Thank you. I think that concludes all the comment from council. There is a motion in the second to receive and file the report and I will go ahead and ask for a roll call vote, please.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_5': 'Mayor, just to clarify that it's a roll call to receive and file and to direct. It's the beginning of the charter amendment process.'",
        "'speaker_1': 'Thank you. We table, please.'",
        "'speaker_0': 'Councilwoman Sandy has.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Allen. I can go home and praise.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'Councilmen soup. But now.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'Yeah, i.'",
        "'speaker_0': 'Councilman Alston. Vice Mayor Richardson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'The motion is Kerry nine zero.'"
    ],
    "First Amendment to Lease and Resolution for Community Hospital and Campus Use.": [
        "'speaker_1': 'Q And thank you for that for that presentation and discussion. And I guess there's been a lot of work going on there. Let's go continue with the agenda. Please do item number. 12.'",
        "'speaker_0': 'Item 12 is a report from economic development. Recommendation to authorize city manager to execute the First Amendment to amended and restated lease with M W NW Community Hospital LLC for modification to various provisions of such lease and Adobe resolution, finding that the community, hospital and surrounding campus remains necessary for the City of Long Beach use as a'",
        "'speaker_0': 'general health care campus. District three.'",
        "'speaker_1': 'Councilman Price motion.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Yes, I'll make the motion, but I would like a staff report on this, please.'",
        "'speaker_1': 'Mr. Modica?'",
        "'speaker_3': 'Yes. If we could have a staff presentation by economic development?'",
        "'speaker_6': 'Yes, certainly. Honorable Mayor and members of the City Council. Good evening. This is a lease amendment for community hospital that will address a number of issues that we are we're facing with regard to the termination of the lease and ultimately the plan for moving forward.'",
        "'speaker_6': 'So next slide, please. As a recap, at least 35, four, three, two. As we know, it was between the city and M.W. n four community hospital and it required an acute care hospital to be provided, including an emergency room and other health services, and that was actually restricted by the recorded deal with the county.'",
        "'speaker_6': 'But in that lease agreement, because it was a real challenging project for the operator as well, the tenant NWN had the right to terminate the lease if there was not an economic justification or if the project became infeasible because of requirements for construction, permitting, licensing or even just straight financial challenges.'",
        "'speaker_6': 'That the tenant was required under the lease to initiate seismic compliance construction by January 1st of 2022, just last month. And that is actually a part of state law. Next slide.'",
        "'speaker_1': 'The restaurant of the restaurant.'",
        "'speaker_6': 'So ultimately, the tenant abandoned the seismic compliance project in late 2021. A few months ago, when they received the final estimated construction cost, they exceeded $75 million, which was 50% higher than originally anticipated. About three years ago when we entered into this agreement, another reason was that the demand for acute care services never really materialized at levels'",
        "'speaker_6': 'that could sustain the operation. In fact, there there were maybe 1 to 2 patients per day admitted into the hospital for those those acute care services. So on September 27th of this past year, the Tenant NWN sent us a formal communication which we briefed you and the public on back in the fall, that they requested that the'",
        "'speaker_6': ', the, um requirements under the lease to modify the current deed restriction and remove the general acute care hospital requirement was requested, as well as an amendment to the belief to allow for negotiation of a transition plan so it would still be used as a health care campus.'",
        "'speaker_6': 'But for non-acute services and ultimately the tenant had to surrender their general acute care hospital license effective December 31st. And we, the city, received confirmation from the California Department of Public Health that acute care was no longer licensed at the property effective January 1st.'",
        "'speaker_6': 'And I wanted to give you a little bit of background on the next slide of why this happened. So under state law, save the compliance. There are two laws SB 1953 and SB 90 that required acute care hospitals to meet seismic regulations by June 30th of 2019.'",
        "'speaker_6': 'If they didn't meet those regulations, they were required then to wind down or cease acute care services. A subsequent law was passed called AB 2190, which allowed hospitals to apply for seismic compliance extension. And Long Beach was accepted in that group of hospitals.'",
        "'speaker_6': 'Ultimately HK, which is the Department of Health Care access that information they gave community hospital Long Beach and nwn the tenant up to January 1st of 2025 for that extension if certain conditions were met. But one of the conditions under AB 2190, this is in Section E required that the tenant would have to submit a construction schedule'",
        "'speaker_6': ', obtain their building permits from H Chi and start their construction no later than January 1st of 2022. So when the U.N. suspended its seismic compliance and notified formally the city and the state that they would no longer seek to do the construction because of the $75 million estimates that actually ruled out their compliance with their their their'",
        "'speaker_6': 'licensing and their seismic plan. Next slide. Another issue with regard to the hospital licensing. So as we know and when I was able to meet a number of very difficult standards to reopen the hospital, get licensed and ultimately continue to operate while they worked on their seismic plans.'",
        "'speaker_6': 'But when they notified both HQ, the state and the city that they would no longer pursue these plans, the city page, the California Department of Public Health Licensing and Certification Program, informed us that you're no longer able to provide acute care services.'",
        "'speaker_6': 'You need to find those services down. And the effective date for ending those services was made on January 1st of 2022. Next slide. So acute care is no longer allowed. That's the short of it. And we have a property with a deed restriction that says only acute care can be provided there.'",
        "'speaker_6': 'So this recommendation to City Council is to modify the deed restriction that would allow and to be within the current tenants for a future tenant, somebody else to be able to provide non-acute care at the site. As we discussed with with council throughout this process.'",
        "'speaker_6': 'We're still recommending that the deed restriction be for non-acute health care services that would benefit the community and that really address the community needs assessment for the service area. So behavioral health, recuperative care, social services, health care, educational services, government offices focused on on community health or public health housing of health care students or health care related'",
        "'speaker_6': 'housing, and then specialized services related to health care. So these would be the the new recorded restrictions for the property, all health care related. But we would have to remove the acute care restriction because it's no longer allowed at the site per state law.'",
        "'speaker_6': 'Next slide, there's a couple of other provisions that have to do with, um, the negotiations that are ongoing for the transition plan. So we would address those in these, this amendment, um, they would just accommodate the timeline for our ongoing negotiations.'",
        "'speaker_6': 'There could be a potential sale to the current tenant or another party that has not been decided or even is recommended at this time. But the amendments would include the extension of noticing provisions and deadlines that are also, um, required as a part of the, the agreement so that the tenant then is supplying the city right now'",
        "'speaker_6': 'with what are called net hospital capital costs. These are the reimbursable costs that they experienced for starting the hospital and reopening it. And then, um, we're both in the process of preparing appraisals for the city council and the public to consider.'",
        "'speaker_6': 'Those appraisals will establish hopefully the fair market value of the subject property or will end up, um, still going out to market. So ultimately we go through this process, but council will still have the ability to reimburse and the tenant and take this property out to fair market value as established by another buyer.'",
        "'speaker_6': 'So any proposed agreement, um, would have to come back to the city council and the public for final review. So I want to make sure that the council is clear that this, these amendments tonight don't change the fundamental process in the lease.'",
        "'speaker_6': 'Um, it really just focuses on giving us more time to complete that process and, uh, to modify the, the deed restriction language. Last lastly, please. So finally, just authorizing the city manager designee to execute the First Amendment to the amended and restated lease that will modify various provisions of the lease with regard to timeline doesn't change the'",
        "'speaker_6': 'overall process that we're going through comparing appraisals and, you know, reconciling or auditing net hospital capital costs. But also a resolution would be adopted. Um, finding that community, hospital and the surrounding campus remains necessary for the city as use for general health care, with community serving uses and authorizing, um, the record ation or the change of the'",
        "'speaker_6': 'amended covenants in the recorded deed restricting the property for those uses. So that's it. I'm happy to answer any questions, but please let me know if there's any, uh, follow up.'",
        "'speaker_2': 'Thank you, Mr. Kaiser. Just a couple of questions. First of all, I want to thank my my colleague, Councilman Supernova, who's really been the lead on our community hospital efforts and has done tremendous work in those efforts up to this point.'",
        "'speaker_2': 'He continues to be a partner, and I think we continue to to traverse this journey together. And so I'm thankful that that we're we're still working together on this and look forward to doing so. And I want to thank staff for the presentation.'",
        "'speaker_2': 'A couple of things. Once these latest amendments are accepted, if they were to be accepted by the Council. What is the next step? Could that could the new uses? New services launch automatically? Or would there have to be any sort of community outreach input, things of that nature?'",
        "'speaker_6': 'Yeah, absolutely. So I don't imagine that anything would launch automatically. We're still going through the process of negotiating the net hospital, capital cost recognition valuation and the appraisal process. And we will we'll be bringing those back to the city council in the public first before any other recommendations are made, new uses or an extension to the lease'",
        "'speaker_6': 'that would support those new uses. Those would have to be approved by the city council because ultimately the lease agreement itself has an expiration date. And once we finish the process that I just described, we'll be at a new decision point for the to for the public in the city council's consideration.'",
        "'speaker_2': 'Okay. But pending that, let's say tomorrow, they decide they're going to turn the current facility, the building, the structure that's there into a behavioral health center.'",
        "'speaker_6': 'I know that that wouldn't be something that they could be doing. You know, immediately they would start with community outreach. They would start with meeting with the city around the community needs assessment. And then those uses would would be proposed to to the council and the community before any action can be taken.'",
        "'speaker_6': 'Because remember, the lease the current lease agreement will be expiring with the conclusion of this process.'",
        "'speaker_2': 'Got it. Perfect. And that's exactly what I wanted to communicate. I want to make sure. First of all, let me ask you this. And I know the city attorney is probably online. Can we include a community outreach component in any future use as part of what we're doing tonight?'",
        "'speaker_6': 'So, you know, ultimately the recommendations for tonight, I would, I would expect that if, um, the Council would like to see a community outreach component included, it would be something that we could, we could discuss with the tenant and the operator and they could do willingly.'",
        "'speaker_6': 'But I don't think that the action tonight would compel them to do that. Um, we would probably bring something back, as you know, either an extension to the existing lease or a new agreement that would require that that would be something that I would envision is very much possible.'",
        "'speaker_2': 'Okay. And that's going to be very important, one that we do. And I've made a commitment to the community there that now falls in the third district that before any use is implemented at the location, which would include much needed.'",
        "'speaker_2': 'And I think we all agree and I've had the chance to meet with the operators, you know, health care in terms of substance abuse, mental health abuse, adolescent substance abuse and mental health abuse, medical detox. Those are things that we've talked about potentially this facility providing down the road.'",
        "'speaker_2': 'But we need to have robust community outreach and more importantly, make sure that that community outreach includes the hospital foundation. And so I want to make sure if whether we can include that tonight or not, I want to make sure that I'm on record that no no discussions should be had in terms of approvals by this council'",
        "'speaker_2': ', in terms of the use of that site without those the residential community, the broader city wide community, and of course, the Community Foundation, the Hospital Community Hospital Foundation. That needs to happen in terms of when we're talking about what the future use of can be, because it has been everyone's expectation that this is going to be an'",
        "'speaker_2': 'acute care facility. And if that use is going to change as it needs to change, then any future use needs to only happen if we've got appropriate outreach with the stakeholders. And so I just want to make sure that that's very clear.'",
        "'speaker_2': 'I know that's very important to me. I can't speak for Councilman Super now, but I know that that's important for him. In the past, it's been a major priority for him. And I just want to make sure the community hears us loud and clear.'",
        "'speaker_2': 'This is not something that we've taken action on outside of this public setting. We're talking about it in a public forum for the first time in terms of future use. And so I want to make sure that we are all on the same page with that.'",
        "'speaker_6': 'That's great. And I'm taking notes as well. For for the council denied to include any of these requests as part of our discussions, and they will be included in any recommendations we bring back to city council.'",
        "'speaker_2': 'Great. Thank you. Thank you, Mr. Ray.'",
        "'speaker_1': 'All right. Thank you, Mayor Duffy, for the evening. We're going to go to the hands up system. So if there are additional comments by the members of the council, just raise your hand. Okay. Thing nine is a public comment on this item.'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or dial star nine.'",
        "'speaker_0': 'Vice mayor, could we have the second?'",
        "'speaker_1': 'We don't have a second. Councilman Supernatural, you seconded this motion. Fantastic. Councilman Juvenile Seconded the motion.'",
        "'speaker_3': 'Thankfully. Baby, your time begins now.'",
        "'speaker_4': 'Good evening. Tiffany David.'",
        "'speaker_1': 'District four resident. I have a lot of questions, but I'd like.'",
        "'speaker_2': 'To first state my.'",
        "'speaker_1': 'Position.'",
        "'speaker_4': 'Generally.'",
        "'speaker_2': 'I'd like to see.'",
        "'speaker_1': 'The city examine possibilities.'",
        "'speaker_2': 'Of completing.'",
        "'speaker_1': 'The retrofit. Finding alternative sources for funding, and possibly at the announcement of the state surplus. State budget surplus for FY 22 to 23. Now, some of the questions, what.'",
        "'speaker_2': 'Are the legal.'",
        "'speaker_1': 'Ramifications of modifying the deed restriction being that the loan was granted for purposes specifically of an acute care hospital, being the property of the city of Long Beach for 111 years.'",
        "'speaker_2': 'Couldn't find any.'",
        "'speaker_1': 'You know.'",
        "'speaker_2': 'Proper reference for the instrument.'",
        "'speaker_1': 'Number as cited in the.'",
        "'speaker_2': 'Lease. Now, seismic is going to be an issue.'",
        "'speaker_1': 'For any operator, especially being that there are 13 buildings in the, you know, the parcel number specifically that is being addressed that was suppose to be an acute care center.'",
        "'speaker_2': 'Do we allow any operator.'",
        "'speaker_1': 'To walk away from such state requirements knowing the cost of an action to mitigate would only increase over time. Having not sought adequate emphasizing retrofits.'",
        "'speaker_2': 'For any necessary.'",
        "'speaker_1': 'Health care facilities, what other risk are there for the surrounding communities other than seismic?'",
        "'speaker_4': 'Again, we.'",
        "'speaker_1': 'Have a stark home up.'",
        "'speaker_4': 'Up in the air once.'",
        "'speaker_1': 'Again. It is one of nine search centers in Los Angeles County. When was the last operated? What are the conditions of the current sublease? And has a city sought use of.'",
        "'speaker_2': 'Another facility.'",
        "'speaker_1': 'As many.'",
        "'speaker_2': 'Unrelated.'",
        "'speaker_1': 'To the city websites still have? Community Hospital of Long Beach listed as a start center. How are we missing the opportunity to prepare for the next disaster, earthquake or any other hazard? Losing an acute care hospital.'",
        "'speaker_2': 'Center while we.'",
        "'speaker_1': 'Have. Less than I mean, we have less than five hospitals, right? I mean, let's think about it. If we need a trauma center. We should. I hope we be looking at operators who can.'",
        "'speaker_4': 'Scale up the needs.'",
        "'speaker_1': 'To to meet the needs of the community. Now.'",
        "'speaker_2': 'What has the burden been on.'",
        "'speaker_1': 'The other hospitals in the region since the trails were closed in 2018? Being that it was only open for one year, I'm sure we didn't really quite see.'",
        "'speaker_2': 'You know, a prevalent use.'",
        "'speaker_1': 'Or a specific spike in use. Right. Build it and they will come. Give them time.'",
        "'speaker_2': 'Right now, is the burden going to be shifted to underserved.'",
        "'speaker_1': 'Communities already face adverse health impacts on the West Side? If so, why? Previous estimate for seismic retrofit. You know, I see that there was a feasibility.'",
        "'speaker_4': 'Study done.'",
        "'speaker_1': 'Again. What is the ultimate cost of not.'",
        "'speaker_2': 'Completing seismic.'",
        "'speaker_1': 'On something that we're still hoping provides health care services? What are the potential costs for the city as.'",
        "'speaker_2': 'The landlord currently?'",
        "'speaker_1': 'Why just change the use.'",
        "'speaker_2': 'To meet.'",
        "'speaker_4': 'The.'",
        "'speaker_2': 'Needs of a lease.'",
        "'speaker_1': 'That I've never seen? A number a dollar a year.'",
        "'speaker_3': 'Thank you. That concludes public comment.'",
        "'speaker_1': 'Thank you. I'll just add my comments here. I'm happy to support this motion. And I think a lot of the things listed here from behavioral health, recuperative care, social services, housing, specialized services, they're all certainly things that are needed.'",
        "'speaker_1': 'And we just had a presentation about 50% of the chronic homelessness associated with non-economic issues, behavioral health, drug addiction. But I will say, you know, I agree with Councilman Price. Civic engagement, community support is incredibly important to the success of the project.'",
        "'speaker_1': 'Hmm. And so, you know, with the L.A. Bridge community, our city's first municipal shelter, the only reason it was successful was because of a deep engagement with those local neighbors. And so I think that's certainly important if we want to see that see this transition become successful.'",
        "'speaker_1': 'And so I'm happy to have my support here, but I certainly agree about successful community engagement. Councilman Rubinoff. You are muted, sir. There. Am I a little louder now? We can hear you now. Okay. So I just want to address a couple of points that that were brought up because the general public should know.'",
        "'speaker_1': 'And John Keiser, you can certainly jump in here to to correct me if I misstate this, but there's a different standard of a seismic retrofit for an acute care hospital versus the health center that's being proposed. We probably didn't make that clear, but that's you're avoiding whatever the price tag is now closer to $80 million for the'",
        "'speaker_1': 'retrofit versus 40 that we started off with. Also, I'm so happy to report that we've found a home for Smart and let's get that out there because I appreciate my colleagues on that bed load committee back me all the way there.'",
        "'speaker_1': 'This is something that I just thought was unconscionable, that this group lost their home twice. And so I'm glad it's still on the Fed led agenda because we should make sure this thing, they never lose their home again.'",
        "'speaker_1': 'But we were able to get them a home a couple of weeks ago, so we're all good there. So I just wanted to add how I know I was very vocal about that in the past and I didn't make that correction publicly, so I wanted to do that.'",
        "'speaker_1': 'And I think that said, I appreciate what Councilman Price said about the work I did, but I'm supporting her 100% now, and she's got the job, the outreach of the immediate community. But we're still doing that with the entire east side of the city.'",
        "'speaker_1': 'So thank you. Fantastic. Thank you. Members, let's go ahead. Have the roll call vote.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Sabrina.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Sarah. I'm Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin, Vice Mayor Richardson.'",
        "'speaker_1': 'I.'"
    ],
    "Contracts for Training and Employment Services to Residents with Various Providers.": [
        "'speaker_0': 'The motion is carry nine two.'",
        "'speaker_1': 'Thank you. Number 13, please.'",
        "'speaker_0': 'Item 13. Report from Economic Development. Recommendation to authorize City Manager to execute five separate contracts on behalf of the University. Extension of the University of California, Los Angeles to provide training and employment services to residents in a total aggregated amount not to exceed 1 million citywide.'",
        "'speaker_1': 'Thank you. Is there emotion here of looking for hand moved by move price? They're second seconds and they have. Thank you. Is there any public comment on this?'",
        "'speaker_3': 'Are there any members of the public that would like to speak on this item? Please use the raise hand feature or dial star nine. CNN. That concludes public comment.'",
        "'speaker_1': 'Thank you, Councilman Price. Any comments?'",
        "'speaker_2': 'No, thank you.'",
        "'speaker_1': 'Certainly. Seconder.'",
        "'speaker_2': 'It.'",
        "'speaker_1': 'All right. Thank you.'",
        "'speaker_0': 'Councilwoman Sundance.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Allen. I character woman price. I count. Spencer Brown.'",
        "'speaker_1': 'Eye.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Eye.'",
        "'speaker_0': 'Councilwoman Zara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'Yes.'"
    ],
    "Contract with Office Depot for Custodial Supplies through Omnia Partners.": [
        "'speaker_0': 'Most of these carry nine zero interest.'",
        "'speaker_1': 'Interesting 14 we've.'",
        "'speaker_0': 'Had in 14 report from financial management. Recommendation to adopt resolution authorizing city manager to execute a contract with Office Depot for furnishing and delivering custodial supplies in an annual amount not to exceed 2 million by.'",
        "'speaker_1': 'So I write a motion to Ranga so I can throw. Councilmember, you're going to want to speak to this. A good second to.'",
        "'speaker_2': 'Start making.'",
        "'speaker_1': 'The comment.'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or dial star nine. CNN. That concludes public comment.'",
        "'speaker_1': 'Fantastic. Let's have a roll call vote.'",
        "'speaker_0': 'Catwoman Sunday has. Catwoman. Alan.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Catwoman. Price. I councilman's it, but now I. Councilwoman Mango.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sara I. Councilmember Ranga I. Councilman Alston.'",
        "'speaker_1': 'Hi.'"
    ],
    "Contract with Helen Sanders Cat Protection and Welfare Society for Cat and Kitten Rehoming Services.": [
        "'speaker_0': 'Vice Mayor Richardson. On the motion is Cory nine zero.'",
        "'speaker_1': 'Thank you. 15, please.'",
        "'speaker_0': 'Item 15, a report from Parks, Recreation and Marine recommendation to authorize city manager to execute a contract with the Helen Sanders Cat Protection and Welfare Society to partner with Long Beach Animal Care Services to take cats and kitten into its care directly from Long Beach Animal Care Services for an annual contract amount not to exceed $50,000 citywide'",
        "'speaker_1': '. Looking for a most significant. I see. I see Superman hand up at the council on its arrow. So move. Superman sort of construe anything, Councilman. Yes, I'd like to make the motion, but I do have an amendment that I will read and that is approve cap pass agreement and direct staff to report back to council in 60'",
        "'speaker_1': 'days with a formal operational policy that supports all city's approved rescue partners to receive $100 for the mandated care sterilization. I think I read that sewn up, but the staff has that. So what I'm asking is that they come back in 60 days for a way that we can take care of our local rescue folks for the'",
        "'speaker_1': 'sterilization requirements. So this is a report coming back in 60 days. Okay. Tom, could you just quickly respond to the council, react to the the amendment?'",
        "'speaker_5': 'Yeah, we understand the motion. It's something that's been worked out with Parks Rec and Marine. We can certainly look into that and come back with a fiscal impact and how we could move something like that forward. So happy to come back in 60 days.'",
        "'speaker_1': 'Outstanding. Councilman Massaro, you accept that's your second.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'Right. I saw a bunch of hands go up and then come down. Is everyone good when you talk about it? All right. Is there any public comment.'",
        "'speaker_2': 'Up.'",
        "'speaker_1': 'Here I'd.'",
        "'speaker_2': 'Like to you.'",
        "'speaker_1': 'Okay, Councilman.'",
        "'speaker_2': 'Thank you. I want to appreciate Councilmember Cooper. And I know my staff is looking into understanding what our cost per cat was and how we can also reward the local nonprofits that are already doing this great work. I just want to make sure that no one is left out and that we have a comprehensive plan.'",
        "'speaker_2': 'It's great when there's one organization that wants to do it, but just because other organizations have been doing it for a long time at zero cost doesn't mean that. That's right. So I appreciate the amendment and I will support that.'",
        "'speaker_1': 'Ambassador. Thank you. Let's let's have a look now.'",
        "'speaker_0': 'Public common.'",
        "'speaker_1': 'How about we call it the government? Okay, so we've got the Commonwealth, right?'",
        "'speaker_3': 'If there's any members of the public that would like to speak on this item, please use the race hand feature or her name. CNN That concludes public comment.'",
        "'speaker_1': 'Fantastic roll call vote please.'",
        "'speaker_0': 'Councilwoman Sandy has I. Councilwoman Allen.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Sabina.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'"
    ],
    "Grant Funds and Appropriations for Capital Improvements at Four Parks.": [
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'The motion is carried nine zero.'",
        "'speaker_1': 'Thank you. 16, please.'",
        "'speaker_0': 'Adam, 16, is a report from Parks, Recreation, Marine and Public Works recommendation to authorize City Manager to accept grant funds from the California Department of Parks and Recreation in an amount not to exceed 12 million for capital improvements at Bixby, Eldorado, MacArthur and Ramona Parks, District two, five, six and nine.'",
        "'speaker_1': 'Great. Happy to make promotion. And there's. Okay. I see. Councilman Allen, any public comment on it?'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature dial starry night c none. That concludes public comment.'",
        "'speaker_1': 'Rate any move in any council. So it seems like everyone's good. Thank you. This is all good stuff. Okay. The council embraced. You are muted now.'",
        "'speaker_2': 'Sorry, that's not the way I want to say. This is so awesome. What a huge deal for the city. All this money going to parks. It's great stuff. Thanks.'",
        "'speaker_1': 'Absolutely, completely agree. Going to make a lot of young people happy. All right. Let's go ahead and have a call vote, please.'",
        "'speaker_0': 'Councilwoman Sandy has. Councilwoman. That is Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman the price.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman said. But.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'Well.'"
    ],
    "Contract with Conservation Corps of Long Beach for Public Service Conservation Work.": [
        "'speaker_0': 'The motion is carry nine zero.'",
        "'speaker_1': 'And that's the number 17.'",
        "'speaker_0': 'Item 17 report from Public Works recommendation to adopt a resolution authorizing city manager to execute a contract with the conservation corpse of Long Beach to public service conservation work for Youth on City of Long Beach property in a total annual amount not to exceed 4 million citywide.'",
        "'speaker_1': 'Company, Ranga. I want to push the motion forward. I think it's great job that a conservation does for. That's wonderful. Fantastic. Thank you, Councilman Saru.'",
        "'speaker_2': 'You just want to add to that? I think it's great that we continue to have a partnership with Conservation Corps with all the great work that they do for us throughout the city. Thank you.'",
        "'speaker_1': 'All right. I couldn't agree more. My my support for the Conservation Corps has been a tremendous partner along the Elk River. We're excited for the new headquarters to open this summer at the Environmental Education Center at the Forest Park and look forward to just deeper relationships and engagement in the years to come.'",
        "'speaker_1': 'Any other council comment notes? Any hands? Any public comment?'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the recent feature. They Chikhlia. Your time begins now.'",
        "'speaker_1': 'I'll give you a thank you. And let me first apologize to the charter commission appointed by both the general public comment period. But specifically this item, as I mentioned, when it was first proposed back in November. I would like to see this fit into the state's overall climate goals.'",
        "'speaker_1': 'I mean, I support the motion, obviously speak KING as the kid who would have been the guinea pig for AP Environmental Health Science for LAUSD in 1997, but chose to do physics and write poetry instead because, I mean, we were privatizing everything.'",
        "'speaker_1': 'Yeah, you know, you're either serious or not. Did you know that Aubrey Meyer solved at the theoretical level the problem of climate change globally in 1997? If that's something that we wanted to do, then it was capable without putting too fine a point on it.'",
        "'speaker_1': 'I have a hard time believing that the. Human activity and the outcomes thereof are somehow beyond the realm of even understanding. Thank you.'",
        "'speaker_3': 'Next speaker we have is Dan Knapp.'",
        "'speaker_1': 'Good evening, Vice Mayor and city council members is Dan Knapp, executive director of the Conservation Corps Long Beach. For over three decades, the Conservation Corps is part of with the city of Long Beach, bringing valuable resources to the communities we serve.'",
        "'speaker_1': 'Thousands of young people have come through our doors to garner critical job training, support services, all while serving our community and in the world we live in. Over the past five years, CCL has been able to match every dollar in the city with our contractual services, with the city at a rate of more than 10 to 1'",
        "'speaker_1': '. That means for every dollar of city contracted services such as park improvements, urban forestry, litter abatement, beautification, the permit, pandemic support that we provided and response to name a few. Cecil has contributed $10 to every dollar we contracted with the city via state funding and federal funding grants that we've been able to bring and incorporate into our'",
        "'speaker_1': 'our programing in the city. Again, our mission is to support young people in realizing the potential to work serious in conservation education. And we are extremely proud of our partnership with the City of Long Beach, and we are excited and look forward to doing even more together in the coming years.'",
        "'speaker_1': 'Thank you all.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'All right. Thank you for the speakers and thank you. Thank you as well there for I do in the city. Let's go ahead and have a roll call with.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman subpoena.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sarah.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Ranga. Hi, Councilman Austin.'",
        "'speaker_1': 'Hi.'"
    ],
    "Resolution to Submit Notice of Intent to Comply with SB 1383 Regulations.": [
        "'speaker_0': 'Vice Mayor Richardson. I the motion is carried nine zero.'",
        "'speaker_1': 'Thank you. Number 18, please.'",
        "'speaker_0': 'Adam, 18, is a report from Public Works recommendation to adopt resolution to authorize city manager to submit a notice of intent to comply with the regulation of Senate Bill 1383 for the Senate Bill 619 statue citywide.'",
        "'speaker_1': 'All right. Is there emotion here? Look at the motion for a second afternoon, councilman. Anything?'",
        "'speaker_2': 'No. No comment.'",
        "'speaker_1': 'Coulson often weeping and I second emotion we have to get this done this is regulatory and I'm glad we have an extension, but we have our work cut out for us. Absolutely concur is any public comment on the fact.'",
        "'speaker_3': 'That there are any members of the public that would like to speak on this item? Please use the racin feature or dial star nine. Shukla. Your time begins now.'",
        "'speaker_1': 'Hello again. Specific to our cap and the state's climate goals, specifically the diversion of waste and of the 1383. I would love to see a technical assessment of how Cerf works, how the ACARS of the RS sorry, south east regional recovery facility, the trash incinerator that we have instead of landfilling.'",
        "'speaker_1': 'How that works. Down to the 15 minute interval. On down to which great Southern California Edison New. I would also like to see things like green beans and soil creation. And I mean, we're going to have a, you know, civilian conservation corps in the city expanding a certainly, I hope, one in each council district or at least'",
        "'speaker_1': 'one in each historical core of each council district since the district lines. I mean, what did we show as a city to the rest of the state? You know, that we can try to draw the first two lines of it anyway.'",
        "'speaker_1': 'Yeah, I'd like to see the areas where it is. It's just made easier for people to pick up soil to drop things off. If you make it easy on people, you don't make it over. I mean, you know, the 34 years of privatization has meant, you know, people being, you know, not the best of.'",
        "'speaker_1': 'If you cut the fat out of the kind of in between, you know, so we could we could solve the problem, not be a problem for the rest of the world, you know? Thank you.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'Thank you. Let's play a roll call of.'",
        "'speaker_0': 'Councilman Sun has.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Pryce.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Supernanny.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Zahra.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Alston.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'The motion is carried nine zero.'",
        "'speaker_1': 'Fantastic. And before we do, audiences will do two fun transfers. We haven't done those right. 24 and 25. Madam Clerk?'",
        "'speaker_2': 'No.'"
    ],
    "Donation to the African American Heritage Society of Long Beach.": [
        "'speaker_1': 'Okay. Let's do fund transfers. I see a motion from council and ask them, is there a second? But. Okay. And we need to, we need to read the retrieval warrant. 25 And I recognize their ingrained emotion as I look at him.'",
        "'speaker_0': '24 is communication from Councilman Alston. Recommendation to increase appropriation in the General Fund group in the City Manager Department by 500 to provide a donation to the African American Heritage Society of Long Beach. Item 25 is a communication from Councilwoman Sarah.'",
        "'speaker_0': 'Recommendation to increase appropriation in the General Fund group in the City Manager Department by 400 to support the African American Heritage Society of Long Beach. Virtual Black History Month Program. Breaking Barriers Sport Edition.'",
        "'speaker_1': 'All right. Very public comment on these items.'",
        "'speaker_3': 'There's any member of the public that would like to speak on this item. Please use the raising feature or surname. CNN that concludes public comment.'",
        "'speaker_1': 'Lots of our roll call vote is.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'My.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Pryce.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sabina.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Zahra.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga. I counts him in Austin.'",
        "'speaker_1': 'Hi.'"
    ],
    "Ordinance on Inclusionary Housing Amendment.": [
        "'speaker_0': 'Vice Mayor Richardson. I the motion is carried 903.'",
        "'speaker_1': 'Thank you. Now we have five audiences. Start with number 19.'",
        "'speaker_0': 'Item 19 is a report from city attorney. Recommendation to declare ordinance amending the language municipal code relating to inclusionary housing. Read and adopt it as read city.'",
        "'speaker_1': 'I write the council now and move several seconds. Any public comment on this?'",
        "'speaker_3': 'There's any member of the public that would like to speak on this item. Please use the raise hand feature or dial tzaneen. I do. Your time begins now.'",
        "'speaker_1': 'I appreciate again the opportunity to speak with all of you, particularly at a slower pace pace that this does relate specifically to lower income housing. I address what the three housing has done in District one, and they also run the Cabrillo where veterans live.'",
        "'speaker_1': 'I need you to understand that I've lived here since May of 2019. I'm beyond asking for accessible accommodations. Instead of providing those accessible accommodations, they did. Things to aggravate me, for instance, has dictated that all of their properties be smoke free since 2017 when I demanded accessibility.'",
        "'speaker_1': 'What I won't even allow the property management company to do is to create a smoking area right below my window. In addition, HUD protocol specifically says any units that have two bedrooms in them. And here in my complex we have three.'",
        "'speaker_1': 'So I imagine the other complex of Beachwood, there's another three single one married couple and two single people live there. And the HUD manual specifically says even a married couple must justify why they need a two bedroom apartment.'",
        "'speaker_1': 'Beyond that, you should understand that normally in order to get into Section eight housing, you need to be on a three year waiting list, probably. I was placed in this housing complex without a single day of waiting period.'",
        "'speaker_1': 'You need to understand that if any future contracts come up, you need to scrutinize century housing very methodically. Thank you for your time.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'Thank you. Was there a roll call vote?'",
        "'speaker_0': 'Councilwoman Sandy has.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilman Allen.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'Councilwoman Pryce. I councilman's a bona.'",
        "'speaker_1': 'Fide.'",
        "'speaker_0': 'Councilwoman. Mongo.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilman. Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Council member Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Alston.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'Yes.'"
    ],
    "Ordinance on No Net Loss of Affordable Housing Units.": [
        "'speaker_0': 'The motion is carried. Nine zero.'",
        "'speaker_1': 'Thank you. 20, please.'",
        "'speaker_0': 'Adam 23. Report from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code relating to no net loss of affordable residential housing units in the city. Read and adapted as read city why.'",
        "'speaker_1': 'Thank you moved Alan's second can you ranga any public comment on this.'",
        "'speaker_3': 'There are any members of the public that would like to speak on this item. Please use the phrase raise hand feature or dial star nine. Nadia Tushnet. Your time begins now.'",
        "'speaker_1': 'Nader personally.'",
        "'speaker_2': 'I I'm speaking as chair of the Long Beach Senior Advisory Commission. We passed a motion at our last meeting about our concern about how the sails of Plymouth West and Providence Gardens will affect low income seniors. Consequently, we urge City Council to include senior housing.'",
        "'speaker_3': 'In the policy.'",
        "'speaker_2': 'Of no net loss of housing available to low income individuals, and work with owners and with HUD to enforce the policy. Thank you.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_1': 'Thank you. Let's have our roll call vote now.'",
        "'speaker_0': 'Councilwoman Cindy has. Councilwoman Allen.'",
        "'speaker_2': 'I think.'",
        "'speaker_0': 'Councilwoman Pryce. Hi, Councilman Sabina.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Zahra.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'On.'"
    ],
    "Ordinance on Just Cause for Termination of Tenancies.": [
        "'speaker_0': 'The motion is carried to nine zero.'",
        "'speaker_1': 'Thank you. 21, please.'",
        "'speaker_0': 'Adam 21 two Report from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code relating to just cause for termination of tenancies. Read and adopted as read city citywide.'",
        "'speaker_1': 'All right. Looking for a motion in the Councilman Allen's second furrow. Is any public comment on this?'",
        "'speaker_3': 'Are there any members of the public that would like to speak on this item? Please use the raise hand feature or dial star nine. See none. That concludes public comment.'",
        "'speaker_1': 'All right, let's have a roll call, please.'",
        "'speaker_0': 'Councilwoman Sun has.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Allen. Councilwoman Pryce.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman. So. But now.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman. Mango. Councilwoman. Councilwoman Sara. I Council member Oranga.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'"
    ],
    "Ordinance to End Prohibition on Termination of Certain Residential Tenancies.": [
        "'speaker_0': 'Vice Mayor Richardson. And the motion is carried nine zero.'",
        "'speaker_1': 'Fantastic. Number 22, please.'",
        "'speaker_0': 'Item 22 is a report from city attorney. Recommendation to declare ordinance amending the Long Beach Municipal Code to terminate the prohibition on termination of certain lawful residential tenancy effective as March 17, 2020. To read and adopt it as read City Y.'",
        "'speaker_1': 'Well most of the second. I see Alan and Sarah. Fantastic. Any public comment?'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or download our nine. See none that conclude the pebble come in.'",
        "'speaker_1': 'Fantastic work of.'",
        "'speaker_0': 'Councilman Sun has.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Pryce.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Spooner.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'"
    ],
    "Ordinance on Temporary Enforcement of COVID-19 Health Orders.": [
        "'speaker_1': 'I.'",
        "'speaker_0': 'The motion is carried nine zero.'",
        "'speaker_1': 'Thank you. 23.'",
        "'speaker_0': 'Item 22. I'm sorry. Item 23 report from City Attorney. This required two votes. Recommendation to declare ordinance amending the Long Beach Municipal Code relating to temporary enforcement of Long Beach health orders related to COVID 19. Declaring the urgency thereof and declaring that this ordinance shall take effect immediately read and adopted as read citywide.'",
        "'speaker_1': 'Brownian Motion the second. Sorrow and sun. Thank you. And do we need two motions in 30 seconds, or can this count for both?'",
        "'speaker_0': 'Do we need to move on the second one to correct it?'",
        "'speaker_1': 'Was that a roll call vote on the first?'",
        "'speaker_3': 'Well.'",
        "'speaker_0': 'We'll go to common.'",
        "'speaker_1': 'No public comment. That's right.'",
        "'speaker_3': 'If there are any members of the public that would like to speak on this item, please use the raise hand feature or dial name. See. Now, that concludes public comment.'",
        "'speaker_1': 'Right. All right. Roll call vote on the first vote.'",
        "'speaker_0': 'Councilwoman Sandy has.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Pryce.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman So. But now.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Mingo.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sarah.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Austin. Hi, Vice Mayor Richardson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'The motion is carried nine zero.'",
        "'speaker_1': 'All right. So back then, that's our business for the evening.'",
        "'speaker_0': 'Do we need another vote?'",
        "'speaker_1': 'That's right. Another vote. Late 5 hours in. We need a motion in effect. Okay. Emotions and they are back in sorrow. Do we need to public comment again or just.'",
        "'speaker_0': 'No?'",
        "'speaker_1': 'All right. Roll call.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Allen, I. Councilwoman Price, I. Councilman Sabino.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Mongo. County Councilwoman Sara. I Council member Oranga I Councilmen Alston.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'The motion is carried nine zero.'",
        "'speaker_1': 'Fantastic. Now, that's the last vote of the evening. So we have to we have closing public comment. Any member of the public would like to address the body. Raise your hand or press their name.'"
    ]
}