{
    "Resolution to Vacate May Avenue and Alley North of Pacific Coast Highway.": [
        "'speaker_0': 'Okay. Thank you. So I just a big message that we actually are given a time certain to the hearings. So I want to apologize and go to hearing number two. Well, and these are this one should be quick.'",
        "'speaker_0': 'So hearing number two staff. I know we read it already.'",
        "'speaker_6': 'The staff report will be conducted by our Malloy and our Director of Public Works.'",
        "'speaker_9': 'Honorable Mayor and Honorable Council Members. I have a very short staff report. This is basically the second hearing. This is a request for the city council to adopt their resolution ordering the vacation of May Avenue, north of Pacific Coast Highway.'",
        "'speaker_9': 'This you you had the intention to vacate this right away on June 23rd. And that concludes my report. If you have any questions, I'm here to answer them.'",
        "'speaker_0': 'Any public comment on the hearing on the on the vacation of the alley scene? None. I'm going to go back to any council. Deliberation council, Miranda.'",
        "'speaker_10': 'Yes. Thank you, Mayor. You, Lilongwe. City College has been a tremendous, you know, access to the sixth District, you know, as well as a great neighbor. And I agree, you know, with this item that is not is a no public use for this alley.'",
        "'speaker_10': 'And I am in favor of this vacation. So I want to thank you very much for this.'",
        "'speaker_0': 'Thank you. Councilman Austin, any comments?'",
        "'speaker_9': 'I support Councilmember Andrews on this.'",
        "'speaker_0': 'And Councilmember Gringa.'",
        "'speaker_6': 'Thank you, Mayor. As a former community college trustee, along with City College and part of the planning process for the master plan of what's taking place there, I'm totally supportive of this item. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion on the floor. Please cast your votes on the hearing.'",
        "'speaker_1': 'Councilman Andrews.'",
        "'speaker_10': 'I mean, yes.'",
        "'speaker_0': 'He's having an issue here with them with the log and so he's this.'",
        "'speaker_1': 'Motion passes nine zero.'",
        "'speaker_0': 'Thank you. Hearing hearing number one.'",
        "'speaker_10': 'Can I get me back and.'"
    ],
    "Resolution to Adopt the Fire First Responder Fee.": [
        "'speaker_1': 'Report from fire recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt a resolution amending the master fee and charges schedule by adopting the fire first responder fee citywide.'",
        "'speaker_0': 'Okay. Thank you. I'm going to turn this over to our city staff.'",
        "'speaker_6': 'Thank you, Mr. Mayor. Members of the council. The staff report will be given by Mike Terry, our fire chief.'",
        "'speaker_11': 'Good evening. Mayor Garcia, members of the City Council. At the last Public Safety Committee meeting, we were given direction to come up with some various cost recovery and efficiency solutions to offset budget deficits proposed for fiscal year 17 and beyond.'",
        "'speaker_11': 'At that time, I mentioned that the fire department would be considering or has been considering implementation of a first responder fee. That would soon be we would soon be proposing to the city council. Tonight, we are proposing implementation of the first responder fee.'",
        "'speaker_11': 'Over the years, fire agencies from throughout the state of California have implemented first responder fees to recover costs and minimize the impact of budget deficits. This fee would help bridge the gap between costs of providing emergency medical services, which are approximately $22.1 million per year, and the revenue received for ambulance transport services, which is approximately $11.3 million'",
        "'speaker_11': 'a year. Additionally, as you are aware, there are projected general fund deficits that will need to be addressed in fiscal year 17 and beyond. The first responder fee is a proposed $250 fee that would be assessed for patients who are medically evaluated by the fire department staff on a first responder unit such as ambulances or fire engine'",
        "'speaker_11': 'or fire truck. There are significant costs associated with an emergency medical response, which includes a fire engine and an ambulance, and the six fire staff members associated with that apparatus or those apparatus. A patient evaluation and assessment involves a medical history and the taking of vital signs such as blood pressure, pulse, breathing, body temperature, and often includes'",
        "'speaker_11': 'monitoring heart activity and measuring blood sugar. Patients are often treated on scene as well. For example, we often evaluate and treat all diabetic patients with the intravenous administration of glucose or dh50. The first responder fee would help us recover costs of first responding personnel, as well as the cost for the use of emergency apparatus, equipment and emergency'",
        "'speaker_11': 'medical supplies. Currently, ambulance bills, which would in the future include first responder fee, are typically sent to insurance companies such as Medicare, Medi-Cal and private insurance companies for payment. Only about 30% of the bills that we send out go to individuals, and the bulk of those are typically not collected, as you can see.'",
        "'speaker_11': 'Other California fire agencies have implemented first responder fees. And this is not a complete list. But at the time we put this together, this was a good example across the board of many other agencies that have have this in place.'",
        "'speaker_11': 'These fees range in this grouping from $143 on the low end to $433 on the high end with an average fee of approximately $305. Agencies, as you can see, include Sacramento Fire departments, Sacramento Metropolitan Fire, Alameda County, Folsom, Novato, Contra Costa County, and in our neck of the woods, the city of Anaheim.'",
        "'speaker_11': 'Since this is a new revenue, it is difficult to project annual revenue amounts. Our best estimate is that the first responder fee will generate approximately $1.8 million annually. This would be partially offset by about $200,000 in additional annual costs associated with the billing and collection of fees, including staff supplies, postage and software maintenance.'",
        "'speaker_11': 'The net annual revenue is estimated to be $1.6 million once the program is established. If the fee is approved, we would only budget enough funds in fiscal year 16 to cover the $200,000 in additional billing costs. A year from now, when building the fiscal year 17 budget.'",
        "'speaker_11': 'We will then be able to evaluate the revenue patterns and collection rates to determine how much to budget for fiscal 17. Future revenue opportunities may also become available as a result of this fee under the states. Ground Emergency Medical Transborder GMT program.'",
        "'speaker_11': 'Under this program, the city is reimbursed for a portion of the difference between the full cost of providing medical transportation services to individuals covered by Medi-Cal and the amount of Medi-Cal revenue received for those services. Future GMT legislation has been introduced, and there's other legislation that will be introduced that will allow us to claim reimbursement for the'",
        "'speaker_11': 'evaluation and treatment of Medi-Cal patients when there is not a transport. However, we would only be able to recover costs under this program if we are currently charging customers for the response. The implementation of the first responder fee would satisfy that requirement.'",
        "'speaker_11': 'In a nutshell on that. We can't basically we basically can't build the federal government for something that we don't bill everybody for. So with that, that concludes my presentation. Council members, Mr. Mayor and council members and I stand ready to answer your questions.'",
        "'speaker_0': 'Okay. Thank you. Councilor Richardson, did you chime in or is that from the last time? Okay. Councilor Richardson.'",
        "'speaker_7': 'So what happens if this doesn't get a second? If this motion doesn't get a second?'",
        "'speaker_2': 'What happens?'",
        "'speaker_0': 'Well, I don't think you made a motion, but there isn't a second. I don't think you had. Is that right?'",
        "'speaker_7': 'Yeah.'",
        "'speaker_0': 'So it's not working, so.'",
        "'speaker_7': 'Yeah, that's. That's. But can we debate it without a motion.'",
        "'speaker_0': 'People are trying to.'",
        "'speaker_5': 'Press to get.'",
        "'speaker_0': 'Hold on.'",
        "'speaker_7': 'Well, if somebody does voice motions a second I want to. Okay.'",
        "'speaker_0': 'There is a second by Councilmember Andrews.'",
        "'speaker_10': 'Okay.'",
        "'speaker_7': 'So. I have a number of questions about this. I want to begin by just thanking our fire fighters, our both rank and file, as well as management for really anticipating. What we all know is that as city management says, winter is coming and we know that there are a number of tough decisions that are going to need'",
        "'speaker_7': 'to be made by the city council in the years to come. I have some concerns about this, some deep concerns about how this might disproportionately impact disadvantaged communities that I think we should consider as we move forward. I also want to want to have a better understanding on what the next steps are as this progresses.'",
        "'speaker_7': 'So first, I understand that Medicare, Medi-Cal and Insurance, this is something that they commonly cover. Is that correct?'",
        "'speaker_11': 'Yes, sir.'",
        "'speaker_7': 'So folks on Medi-Cal and I'm not sure that there's 100% certainty there, but how do we know that they that they actually cover this public. You know, covered California just insurance companies. How do we know that we cover that.'",
        "'speaker_11': 'The councilmember the the research that we did included reaching out to a number of the agencies you saw listed on that sheet there and asked that very specific question specifically related to Medi-Cal at the time and the ACA Affordable Care Act.'",
        "'speaker_11': 'Whether or not this would be reimbursed, we know, in fact, looking at our own health insurance here in the city of Long Beach, Anthem offers reimbursement for first responder fee. But we were unsure about the Medi-Cal and apps, but we did confirm it by reaching out to people who already have it in place.'",
        "'speaker_7': 'Okay. So so as of today, there is a potential benefit on insurance that we're not taking advantage of. I think that a better way to to look at that well.'",
        "'speaker_11': 'Councilmember I think yeah yeah I think that that's a good way to look at it. It's it's something that the insurance companies will pay for, but we are currently not charging them for.'",
        "'speaker_7': 'Okay. So I guess for the uninsured residents, what what sort of benefit? Can we is there some way that we can put in place a program or a mechanism for low income residents that are not insured? Is that something we can legally do or wrap your mind around as a part of this?'",
        "'speaker_11': 'Councilwoman Ramona, I'm going to let our director of financial management, John Groce, talk to that piece.'",
        "'speaker_2': 'I'm happy to. Councilmember We have an ambulance billing program now and it has not been a a program to date that has created substantial issues in terms of collections and people claiming hardships. We do have a hardship program in the city, monitored and done through the city attorney, where people who have a hardship can file a claim'",
        "'speaker_2': '. We make the forms available. They are processed, reviewed by the city attorney. And then when when that is determined by the city attorney to qualify for hardship, we then follow up on that. So those that's probably our key mechanism.'",
        "'speaker_2': 'Again, history has not made it a huge problem because of Medicare, Medi-Cal and insurance. Most of our people who are unable to pay tend to be have had do not have a home address. We call them Jane and John Doe.'",
        "'speaker_2': 'Those people, as a matter of practice, it's not possible to collect from. And after a period of time, we write them off.'",
        "'speaker_7': 'Okay. So are you planning or preparing some a strategy to aggressively pursue those who can't pay? Are we going to put some guidelines in place that that provides some relief for those who have an economic hardship as a part of this?'",
        "'speaker_2': 'We have a program in place that already provides for that. We don't think that the situation will be significantly different, and we think our processes and procedures in place already provide for that and that we will be able to take care of those.'",
        "'speaker_7': 'Okay. So so if this were to move forward, I would I would like something more concrete. Then we have a program for this. I think it won't impact folks. I would love to see something more concrete that we can we can go out and educate our constituency on next.'",
        "'speaker_7': 'So I see that a number of city and county departments are utilizing first responder fees and they've seen some sort of a revenue increase. But I remember that the city council discussed the GM's funding, and we thought it was something that we could we could we could bank on.'",
        "'speaker_7': 'And and we thought we were going to be able to restore additional facilities and units into service. But but it didn't happen. So have we evaluated whether this is a stable revenue source that other cities have been able to depend on?'",
        "'speaker_7': 'And have they been able to restore services or maintain services as a result of implementing this first responder fee?'",
        "'speaker_11': 'Well, Councilmember, a couple of pieces there. So are our estimations on revenue generation with this program are very conservative. We are estimating the revenue at a 20% rate of return on our billing, which is a very conservative estimate.'",
        "'speaker_11': 'Traditionally, historically, we tend to do better than that with regard to our annual revenue in our billing. So the $1.8 million and if you take the $200,000 out to to offset the cost of additional people doing the billing, leaving 1.6 is a very conservative estimate based on based on what we know, it could very well materialize to'",
        "'speaker_11': 'a greater degree than what we're projecting. The as far as as far as the other agencies, when you talk about it being a stable fee source or a revenue generation. Yes. Our experience in talking with them or their experience has been that it's very stable.'",
        "'speaker_11': 'And I think the other point that I want to make clear is we're not necessarily talking about restoring anything when initially when we put this forward. We were very clear in saying that we don't want any of this revenue applied to our budget in fiscal year 16.'",
        "'speaker_11': 'Like I don't want to be in the same situation that we were in a few years ago with if recovery and some of the other programs where it didn't it didn't materialize like we thought it would, and then we were stuck with a negative hole in our budget.'",
        "'speaker_11': 'So what we want to do is we want to get one full year of experience. And so we know exactly what we're generating as far as revenue is concerned. And then have this discussion with the council again this time next year and say, here's a year of experience and this is what we would like to have applied'",
        "'speaker_11': 'to our budget, but it would be general fund revenue. So that would be a policy decision from the manager and the finance director and the budget manager and the council on how that gets applied. Certainly, we would like it applied to fire, though.'",
        "'speaker_7': 'Absolutely. And thank you for clarifying that you don't plan on actually spending these funds in the in the first year. You want to watch it and test it and see if this is something that we can bet our public safety on after a year of evaluation.'",
        "'speaker_7': 'And I think that that's smart, a smart thing to do if we move forward with this next. I know that there there's significant angst in the community in general and in certain communities about what the fiscal impact implications are when you dial 911.'",
        "'speaker_7': 'And there are some folks that. Might not press 911 because they're they're concerned about the cost of ambulance transportation fees. So I guess what can we or the fire department or just our city in general do to make sure there's an education component to a number of communities in court, including, you know, communities our diverse community that'",
        "'speaker_7': 'might not speak English? What can we do to educate and make sure that this there is an unintended consequence in terms of folks stop calling 911 because they're concerned about getting charged an additional fee. Have you done any thinking on that, Chief?'",
        "'speaker_11': 'Well, Councilmember, if if somebody needs to call 911, we encourage them to do that. I mean, I don't ever want anybody to not call 911. But the way this fee works is that if the firefighters, paramedics get on scene and we actually find a medical cause to do an assessment on somebody or find a cause to actually'",
        "'speaker_11': 'start to treat somebody with their consent, obviously then the fee would be applied. But for instance, one of the questions that we've had was, what if I what if, a, somebody is driving down the street and they see somebody down on the side of the street and they call 911 thinking, I think that person needs help.'",
        "'speaker_11': 'And we get there and the person says, I didn't call you. I don't want help. Would they have the fee applied to them? The answer is no. We will only if we provide the service. You know, I heard an analogy last week that I thought was pretty good.'",
        "'speaker_11': 'It's kind of like a toll road. You only pay for it if you use it. So I think that I think that's a fair enough analogy on on how this would work.'",
        "'speaker_2': 'I was joking.'",
        "'speaker_7': 'So so I guess the last thing I would say is so again, thank you for for doing the work and anticipating a solution to what we anticipate is some some challenging budget times. And personally, as a ninth District Council member, I've been able to watch and see the impacts when Rescue 12 was taken out of service and'",
        "'speaker_7': 'and sort of the feeling that you get when you know that this area of town has, you know, there's a perception that folks don't respond in a timely manner. When that when that happened. And, you know, I think is I think based on these these conversations, I'm comfortable with taking the next step in this direction.'",
        "'speaker_7': 'I definitely will watch those other things. But I hate I would hate to be in the position to cut to cut services in 1 to 2 years. That will that might impact the lives of our residents when we have an opportunity here today to make a meaningful step forward.'",
        "'speaker_7': 'And so that said, I guess my final question is, if this were to move forward tonight, what is the what are the next steps? Would this have to come back to city council at all?'",
        "'speaker_2': 'The end of that question.'",
        "'speaker_11': 'Is that question for me? Yeah, councilman.'",
        "'speaker_7': 'Or the city attorney or whoever can answer it?'",
        "'speaker_12': 'If this passes tonight, it would become effective immediately.'",
        "'speaker_7': 'Okay. I might want to think about it a little bit more, but but I think those are my questions that I have to make.'",
        "'speaker_0': 'Thank you. Councilwoman actually, Vice Mayor Lowenthal, to your second.'",
        "'speaker_3': 'I'll hold my comments for now.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_8': 'Thank you. I have a couple of questions. First of all, I want to thank the chief for. Bringing this item forward for the following reason. We did ask, anticipating that we're going to have some difficult budget years ahead.'",
        "'speaker_8': 'We did agendas in our public safety committee, a budgetary item requesting that police and fire come to the Public Safety Committee with some recommendations and suggestions regarding how they might increase revenues and cut costs in anticipation of the budget situation that we have coming before us, really starting in 2017 and at the time that we agenda as'",
        "'speaker_8': 'the item, we did not know what 2016 was going to look like. I think we have a better sense of that in light of what we expect the budget to look like. And although I think this is a good item and I'm going to have a few questions to ask about it in a moment to clarify some'",
        "'speaker_8': 'of the concerns that we've received in our office. I do want to say that I hope that this item doesn't end our discussion regarding innovative ways that we might be able to increase revenue and or think about the potential deficits and their impact to our public safety structure, because I think that the proposed cuts to both police'",
        "'speaker_8': 'and fire are not the type of cuts that we can withstand in the city of Long Beach at this time in our city's status. So we're going to have to talk real seriously about that. And that conversation is not over.'",
        "'speaker_8': 'So I look forward to hearing some of the other proposals and they may be proposals that you would be recommending against, but I really would like to play those out a little bit more in detail in public safety in regards to this item.'",
        "'speaker_8': 'So thank you for coming up with this. I think the idea that we would. Have $1.6 million in our general fund as a result of this successful program is exactly the kind of innovative thinking process that we want our department heads to have.'",
        "'speaker_8': 'Now, going back to that. Where would you anticipate that that a $1.6 million going, would it go back into restoration of fire services?'",
        "'speaker_11': 'Well, Councilmember, it could it could go a couple of different directions. Initially, given given the budget projection that we were given a few months back, looking at a potential budget deficit of about a four fire, our share of about $1.7 million potentially in fiscal 17.'",
        "'speaker_11': 'If this were to material materialize tonight and we realized the $1.6 million over the next year, then our hope would be that those dollars would be applied to our deficit, which means we'd be able to keep our apparatus.'",
        "'speaker_11': 'The way it is today. If for whatever reason, the general fund rebounded and and we didn't have that kind of deficit next year and we had $1.6 million over and above, then we would apply that those dollars, if it was given back to fire, we'd apply those dollars directly toward our stated priority list that we had sent'",
        "'speaker_11': 'to the Council a year ago, roughly as far as the apparatus that we would restore. So it would go one of those two places.'",
        "'speaker_8': 'Okay. Now, we have received a few emails and inquiries from third district residents that I want to ask you a little bit about tonight. And I appreciate the time that you spent explaining some of these to me prior to council, but I do want to bring a few of these questions and answers to light so that the'",
        "'speaker_8': 'residents all have the same information as we continue to discuss this in a public forums and days and weeks to come. Some have said that this appears to them to be a tax and is a service that should be covered through property taxes.'",
        "'speaker_8': 'In response to that, has fire considered that argument and what would be the response to that?'",
        "'speaker_11': 'Council Member Property taxes pay for the fire department, fire suppression vehicles fire like fire engines and fire trucks, the active firefighting hazardous materials taking cats out of the tree, that sort of thing. That's what your property taxes pay for.'",
        "'speaker_11': 'Emergency medical service created in 1972 in Long Beach, was a fee for service business in addition to the regular line of business in the fire in the fire service. So their property taxes, although the general fund is subsidizing emergency medical service, emergency medical services meant to be a fee for service business.'",
        "'speaker_11': 'So none of your property taxes. Nobody should nobody should think that their property taxes are paying for paramedic service.'",
        "'speaker_5': 'Okay.'",
        "'speaker_8': 'In the staff memo specifically. We pull it up here? I think it's the second paragraph. Under the discussion section, you talk about a deployment model and the percentage of the responses, the deployment model that's used on 85% of the responses.'",
        "'speaker_8': 'Can you elaborate a little bit about that deployment model and what that paragraph means?'",
        "'speaker_11': 'So. Councilmember. I'm sorry. You want me to you want me to talk to you about how we deploy our paramedic service now and, like, how we respond on calls? So we have a tiered dispatching system in Long Beach.'",
        "'speaker_11': 'Basically three tiers for really, but three tiers of service and emergency medical service. Now, I want to start off by saying this. Of the nearly 70,000 calls for service, we get a year in Long Beach fire, 84.5, almost 85% of them are emergency medical calls.'",
        "'speaker_11': 'It has become the cornerstone of what we do. And it's it's not just a Long Beach thing that's a nationwide fire service thing. It's the paradigm has completely shifted. The way we dispatch calls is this if it's a non-emergent noncritical call, we call that an alpha response where we may just send the closest fire engine or truck'",
        "'speaker_11': 'to assess the patient and determine whether or not they should be upgraded and they should go to the hospital at all. A basic life support call, for instance, like a traffic accident or a broken leg possibly, or, you know, somebody falls, falls down or hurts himself.'",
        "'speaker_11': 'But it doesn't appear to be life threatening. We call that a Bravo response, where they'll get the first engine company or first truck company closest to them and the closest ambulance will respond as well. A charley response is the highest level of care that we have, and that's the first engine company and the first rescue ambulance.'",
        "'speaker_11': 'And those are the the calls like chest pains and shortness of breath and seizures and those things that are considered emergent calls. So that's that's how we respond. Now, one of the concerns that I've heard from constituents or from people in the community is how come we send the fire engine on these calls?'",
        "'speaker_11': 'Why don't we just send the ambulance? And that's a fair enough question. But the reality is we only have we have more fire engines than we have ambulances. And under the new paramedic program, I have a paramedic on every one of those engines so I can get an engine to the scene faster than I can get an'",
        "'speaker_11': 'ambulance to the scene. Now, if you had a different deployment model where I had 20 ambulances and and ten fire engines, then that would be that would be a completely different discussion. But the way we are deployed to to meet all risks in the community, it's faster for me to send a fire engine or a truck to'",
        "'speaker_11': 'the scene first and have the ambulance marry up with them on the scene. So that's why we deploy that way. I will tell you this, that my command staff are very smart, creative people, and they're constantly thinking about ways to for especially for the non-emergent calls.'",
        "'speaker_11': 'They're thinking about ways to to do kind of just that, where maybe we don't need to send a fire engine on everything. Maybe. Maybe instead of rolling the big red fire engine on the street, we can just send the ambulance on some things.'",
        "'speaker_11': 'And we're in the process of having that discussion now. And I actually think that sometime within the next year, we will we will see some progress in that respect.'",
        "'speaker_8': 'Okay, that's good. I look forward to that update because I think that would serve to, in terms of efficiency, at least what people perceive just to hear what the data is on that are on the non-emergent calls. Are there situations where the fire engine will respond and then if there's no transport necessary, the fire engine will just'",
        "'speaker_8': 'treat the patient and no ambulance will arrive on scene.'",
        "'speaker_2': 'Yes.'",
        "'speaker_11': 'So a good example would be the call that we get for someone who has fallen out of bed at 2:00 in the morning and they're unable to get themselves back into bed. So they'll call us, we respond out there, assist them back into the bed.'",
        "'speaker_11': 'We will evaluate them medically to make sure that the reason they fell out of bed was not because of a medical problem, put them back in bed, and then they often decline transport to the hospital. So yeah, that happens quite frequently.'",
        "'speaker_8': 'Okay, so, so it would be factually incorrect to make a statement that fire sends a fire truck and an ambulance and engine and an ambulance to every single medical call. That's that's not true.'",
        "'speaker_11': 'That's correct. That is not a true statement.'",
        "'speaker_8': 'Thank you very much. Thank you, Mr. Mayor.'",
        "'speaker_0': 'Thank you. Got somebody, Ringo?'",
        "'speaker_6': 'Thank you, Mayor. I, too, have some concerns with the. With the. Given the emergency that we had last week, I'm pretty sure that the system was. Slightly overloaded, if not overloaded with the now one. One calls everybody needing a response of one type or another.'",
        "'speaker_6': 'So this feels a little bit untimely, I would say, at this point. But the only reason is that had we been able let me ask you first, I guess, is there a record of how many 911 calls we received within the LAT when we had our outage last week.'",
        "'speaker_6': 'In those three days that we were a councilmember?'",
        "'speaker_11': 'Yes, there is a there is a record of how many calls we received. I will tell you this, that fire on the fire side of things. We saw kind of a spike in calls and within the first 24 hours and a lot of those calls were related to people stuck in elevators and other things that would be'",
        "'speaker_11': 'considered non-emergent. Just kind of check the well type things from the first 24 hours on, a lot of the calls that we had there were kind of self-created, where we were out knocking and talking and trying to find out what people needed from us.'",
        "'speaker_11': 'But we didn't see we didn't see a tremendous spike in calls for service because of the of the power outage, if that's what you're asking.'",
        "'speaker_6': 'Well, related to that, it was I get my question wasn't clear in regards to calls that were that needed for an evaluation that states what that that would have triggered this feat.'",
        "'speaker_11': 'And I'm not sure. I'm not sure I understand the question, but.'",
        "'speaker_6': 'The numbers of calls that you receive and i11 that would have required a medical or a paramedic to evaluate a patient.'",
        "'speaker_11': 'So. And are you asking how this fee would apply to the people last week?'",
        "'speaker_6': 'First responder fee.'",
        "'speaker_11': 'The first responder fee. So if this is the way this this fee is structured, if somebody calls 911 and we respond out there to evaluate somebody, if that person that we're evaluating says, I'm good, I don't need I don't need to be evaluated.'",
        "'speaker_11': 'I don't want you here. I don't want to go to the hospital or whatever. There would be no fee assessed on them if if we went out for the stuck in the elevator example, if we went out and responded to somebody who was stuck in an elevator, opened the elevator, got the patient out and they said, Thank'",
        "'speaker_11': 'you very much, I'm fine. We are kind of checking there. Well, there's no first responder fee there. The only time we would ever apply the first responder fee is if we generated a medical report form on the patient and actually treated them or applied our medical training to their situation.'",
        "'speaker_11': 'So it wouldn't just be blanket application across the board to every patient that we see.'",
        "'speaker_6': 'My staff and I did a little bit of additional research on this and we found that there are some municipalities that have an opt in paramedic membership program that costs between 30 to $60 a year, and it's included in their utility bill, which equals out to maybe $3 to $6 a month.'",
        "'speaker_6': 'What was that consider or why is this an option here?'",
        "'speaker_11': 'A council member that was considered it's been considered a couple of times over the past ten or 12 years. And our last evaluations called the subscription fee. The closest example to us here in Long Beach that are doing that is the city of Huntington Beach.'",
        "'speaker_11': 'They do they attach an annual fee to their utility bills. And you literally in Huntington Beach at one time anyway, you had to go in and opt out. You were just automatically opted in. And if you wanted to opt out, you had to physically do that.'",
        "'speaker_11': 'The the when we looked at it here in Long Beach, our payer mix in Long Beach is different than in a lot of the other municipalities that have the subscription fee. And we felt that when we added it all together that we would end up it would end up costing us more money than we would generate on'",
        "'speaker_11': 'the subscription fee, because our payer mix is vastly different than Huntington Beach and many of the other places. So we didn't think it would be a feasible option to generate stable revenue.'",
        "'speaker_6': 'Well, and certainly that's that's the important issue here, because I know we're coming into a budget season and we are going to be evaluating budgets all across the city, all our departments. So I'm sure that this discussion is going to be coming up there.'",
        "'speaker_6': 'So I'm I'm a little concerned that that this is coming now right before we start actually crunching numbers for our departments. Also, my my district is very diverse. As you as you probably know, my district goes all the way from our Long Beach airport to the port of Long Beach.'",
        "'speaker_6': 'I have high income, low income, middle income, low income families there. I also have the highest number of senior citizens, senior citizen housing in my area. So those are real concerns of mine that would affect my my residents.'",
        "'speaker_6': 'So I'm hesitant right now on this and not too sure whether it would be something that we could implement immediately. I'd like to have it stated more often, more often, more thoroughly. I also really would want to see what kind of program we can have either to opt in or opt out any first responder fee.'",
        "'speaker_6': 'I think that would be I think that'd be more palatable in this situation. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_1': 'Thank you, Chief. I know we have to always look creatively for a different budget option, so I just wanted to and for the body for presenting that to you. I also have a question about the hardship waiver. I'm still not clear.'",
        "'speaker_1': 'And so there's a few things. So it would be great to get some sort, like some sort of criteria as to what would qualify for a hardship waiver. Would it be income? What what what would it be exactly as to who could qualify for this?'",
        "'speaker_2': 'The form which I looked at today asks for any and all information that would would make a person qualify. We leave that up to the applicant because the conditions may be such that you don't want to specify specific types of situations.'",
        "'speaker_2': 'So we ask for any information that an applicant feels they may be qualified for. And we may also do credit check background checks. But we we feel that leaving it flexible is actually in the best interests of the applicant.'",
        "'speaker_1': 'Okay. Well, that that definitely concerns me. And I know with our parking enforcement, for instance, you can correct me if I'm wrong, but when we have someone who isn't able to pay, I know we go through, I think, an administrative review process.'",
        "'speaker_1': 'So perhaps that could be enacted here, I'm not sure. But it's basically you don't have to pay until you go through this review or you go through this hardship waiver income or. Review, I guess you can say. Would that be something we would be able to do here?'",
        "'speaker_2': 'The administrative review for parking tickets is a little different in that that's a process to determine whether the amount is actually owed or not as opposed to hardship. The hardship situation we have is consistent throughout the city dealing with the city attorney.'",
        "'speaker_2': 'So it's it is an administrative review. It's just through the city attorney. So there is an administrative review process. Not not quite the same for as the parking citation, but for parking in particular. There's both the review is the ticket valid?'",
        "'speaker_2': 'And then there's a hardship review that would be done by the city attorney.'",
        "'speaker_1': 'And they would that would be so they wouldn't have to come up with the funds first. They would go through this review and then if it was determined, then they would come up with the funds if they had to.'",
        "'speaker_1': 'So is that what I'm hearing or.'",
        "'speaker_2': 'I'm sorry, would you repeat that again?'",
        "'speaker_1': 'They would have to pay the amount first, though, correct?'",
        "'speaker_2': 'I don't think that's the case. I don't think they would have to pay it first. In fact, I will say they would not have to pay it first. It's not it's not the same where you have a situation where we might tow the car or do something like that.'",
        "'speaker_2': 'So there's no there's no there's no requirement for them to pay first.'",
        "'speaker_1': 'Okay. And would fees still be enacted during emergency situations? So, you know, the power outage was a perfect example. And I was at Plymouth West with many of our seniors. And every hour, probably every half hour, there were fire engines and ambulance there for a variety of reasons.'",
        "'speaker_1': 'They could you know, they got stuck in the elevator. They couldn't walk down. They ran out of breath. So I get concerned in situations like this where, you know, now we have resources being sent over constantly. So how does that work out?'",
        "'speaker_11': 'Councilmember. The answer to that is no. They would not be assessed a first responder fee in situations like that. Plymouth West is a great example. Our folks were in and out of there over a 24 hour period last week assisting residents and checking on residents, knocking and talking, that sort of thing.'",
        "'speaker_11': 'They weren't doing medical reports on people. They weren't they weren't setting them up for transport to the hospital or any of that stuff there. They're just being firefighters. They're just doing good work, getting out, talking to people, making sure they're okay so the first responder fee wouldn't apply there.'",
        "'speaker_11': 'This will specifically apply to those situations where somebody calls 911 or the patient themselves calls 911 and says, I want I need the service. I need you to come take care of me. We get there. We work them up medically, work them up, do a medical report form on them and either transport them or not.'",
        "'speaker_11': 'That's when it would apply. But in the example that you use, no, it would not.'",
        "'speaker_1': 'But some of them were transported and did need medical and it was an emergency situation, you know, during the power outage. So that's what I'm concerned with. So we're still getting that treatment and it would fall under this and it was under the umbrella of emergency situation.'",
        "'speaker_11': 'So those patients that were transported have a bill would get a bill already for that transport. There's a there's a bill that goes along with ambulance transport, right. For both advanced life support and basic life support. So that wouldn't change.'",
        "'speaker_11': 'But as far as the first responder fee and just that kind of. Well checks on people. No, that's that's not what this is intended to do.'",
        "'speaker_6': 'And Marin County, if I may just add to that, we feel very comfortable that we do have a hardship provision already built into our system. What the chief was just mentioning is that we currently have a system where we are charging people who get transferred to the hospital a thousand, 1100, 1200 dollars, and this would be a'",
        "'speaker_6': 'fee in addition to that of 250. But we already are very comfortable that we don't have a problem where there are people that are needing hardship for the ambulance fee that we wouldn't be able to take care of.'",
        "'speaker_6': 'We have a process for that and we really don't see that that is going to be any different with this fee. We feel very comfortable that there is that process for them to apply for the hardship because we don't see on a daily basis us creating that hardship if there really is one out there that is justifiable'",
        "'speaker_1': '. Sure. I just don't see any clear plan as to what the hardship would be, you know, so that it's just concerning to me. And there was another concern brought up by some of our property owners. So if, for instance, a resident couldn't pay or they just didn't acknowledge the letter, would property owners be billed?'",
        "'speaker_11': 'No, no. We will know what this has meant. This is actually meant to be implied, applied toward insurance, toward health insurance, homeowner's insurance, auto insurance, Medi-Cal, Medicare, ACA. No, we would not apply it toward like anybody in the apartment association shouldn't worry that we're going to apply this fee or put a lean on their on their building'",
        "'speaker_11': 'if their one of their tenants doesn't pay their medical bill.'",
        "'speaker_1': 'Okay. And then what about residents versus nonresidents? How does that work out?'",
        "'speaker_11': 'That from a fire service delivery. Some cities actually do differentiate between resident nonresident on how they apply the fees. We do not hear on any of the fees that we assess for treatment, transport or anything else we do.'",
        "'speaker_11': 'So this would be consistent with not differentiating between resident nonresident.'",
        "'speaker_1': 'Where we don't have a nonresident responder fee, it would just be resident responder fee.'",
        "'speaker_11': 'We just have this would just be a first responder fee for everyone, whether you're resident or not.'",
        "'speaker_5': 'Okay.'",
        "'speaker_2': 'And maybe I can make Councilman one more comment on on why we do not think there's there's an issue in addition to what Mr. Modica said. We're also have a practice which I'm reviewing really over the last month where, where, when we determine that bills are uncollectible and for, for the reasons that people can't pay, we have'",
        "'speaker_2': 'a process where we're, we're writing these bills off at at 180 days so that we do not continue to hassle people. And I think that's one of the reasons we also just historically have not had a problem in this area.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Before I go, I. Before I go to counter prostitution, I just wanted to touch on something that councilman said. Think it's. It's been repeated. Something. It's an important point to city staff. And maybe it's something that Councilor Richardson can address in his motion.'",
        "'speaker_0': 'But I think what you're hearing very clearly is that there needs to be a very dedicated and deliberate process for there to be an opt out provision for those that are disadvantaged and for poor seniors that have needs when it comes to income.'",
        "'speaker_0': 'And so, I mean, I'm hearing obviously from from from from staff that that is part of this process. But I think what you're hearing from council is that it needs to be very clear. It needs to be a very progressive in a sense, of leaning first and giving the benefit of the doubt to the person that's that'",
        "'speaker_0': 'needs the medical attention and it needs to be those that are needed. The attention shouldn't have to pay upfront. So it needs to be where they're they're not required to pay. And if they have, they believe that they qualify as a as a low income or disadvantaged person, that they can make that case before they're ever charge'",
        "'speaker_0': 'or expected to pay that fee. So I actually want to make sure that if Mr. Richardson can actually clarify that issue.'",
        "'speaker_7': 'Sir, what I'm thinking is exactly along those lines, like maybe separately they can come back because all those elements you I heard that from Councilmember Ranga and Councilmember Gonzalez, but I want to make sure that that actually comes back to that element, can come back to the city council at some point.'",
        "'speaker_7': 'So we can talk about what that program, what that program looks like. Is that something we can do? Because I'd like to amend my motion include that.'",
        "'speaker_0': 'Could part of that motion be for this separately that's separate from the from the from the fee that this program would come back to council for for review and.'",
        "'speaker_7': 'Conversation within 30 days.'",
        "'speaker_0': 'Within 30 days. Mr. Modica.'",
        "'speaker_6': 'Yes. We can certainly come back and review that program.'",
        "'speaker_0': 'Part of that comes from your ranga would like. I would like to add as part of that program, a councilmember to also review his suggestion of the what did you call it, the opt in program. Could it be part of that as well?'",
        "'speaker_7': 'Absolutely.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_7': 'Vice mayor.'",
        "'speaker_0': 'Vice mayor. You okay with that? Okay. Thank you.'",
        "'speaker_6': 'Just for clarification purposes, the opt in program is that the paramedic subscription fee and evaluation of that?'",
        "'speaker_0': 'Yes. The council re ranking wants to see the evaluation of that as well.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Thank you, Councilmember Austin.'",
        "'speaker_9': 'Thank you. And I just had a few quick clarifying questions because I think a lot of the questions and concerns that I have have already been raised. But I heard a lot about there was much talk about Medi-Cal and Medicare and and and the need to establish just to be able to collect from Medi-Cal and Medicare first'",
        "'speaker_9': 'responder fees. But for those who have private insured or who are privately insured, if they if they are they are in need of a first responder, does their insurance pick up the first responder fee? For example, does Kaiser or a Blue Shield pick that up?'",
        "'speaker_11': 'Council Member Yes. The answer is yes. The insurance, you know that we have here in the city of Long Beach, Anthem pays a first responder fee if needed.'",
        "'speaker_9': 'Okay. And many public agencies have been suffering with budget issues over the last several years. You laid out a number of them who have instituted this this first responder fee, in your opinion. Why haven't other agencies felt the need to implement these first responder fees?'",
        "'speaker_9': 'Because it seems to be rather minimal.'",
        "'speaker_11': 'Councilmember, the that that is the list that we showed during the presentation is a fairly abbreviated list. Since we started putting this thing together, there have been a number of other municipalities in the state that are moving toward a first responder fee, and they're doing it primarily because it will help augment the amount of dollars that they'",
        "'speaker_11': 'receive under the EMT program. Should the state legislation be passed to allow for first responders? So there's a there's a lot of municipalities that are in the same process that we're in here today doing that.'",
        "'speaker_9': 'Okay. And I also want to echo Councilmember Price's comments to you, because to sit on the Public Safety Committee and we did ask you to come back with some creative new revenue ideas, and we certainly hope it doesn't stop here, like like to know that there's more more options out there.'",
        "'speaker_9': 'And and I guess for me, the options is really important. I'm hesitant to move forward tonight on this because, you know, I don't know that there may be something else, you know, a month from now or two weeks from now that that may be a better option in terms of, you know, fixing the fire budget and speaking'",
        "'speaker_9': 'to fire budget, if we are to collect 1.6 million, $1.8 million. I'm not sure that I was I'm not clear as to how that's going to be spent or where it would be dedicated. Is that going to be in the fire budget or is that going to go straight to the general fund?'",
        "'speaker_9': 'And just kind of before.'",
        "'speaker_2': 'Because this money was is part of the fee structure for the fire department, this revenue, from our view point would be fire department associated revenue just as just the way the chief described it.'",
        "'speaker_9': 'Okay. And I know also before this council, we we talked about and we do have the best, I think, fire department in in the state. And that's, to your credit, Chief, Terry, and to the men and women who work for the Long Beach Fire Department.'",
        "'speaker_9': 'We we want to maintain if we're going to add fees, I'd like to know that there's some guarantees that we're going to maintain the highest quality in terms of personnel that are responding to two calls. Is that something that you can guarantee for me tonight?'",
        "'speaker_9': 'Because what we have now, I mean, I know particularly for the blessed, there are there are paramedics and then there are EMT. And we changed that model recently. And we can talk about how that model is doing later on.'",
        "'speaker_9': 'But I'd like for for my resident residents to have some assurances that if we're going to be adding fees, that we're going to make sure that they have trained the highest trained paramedics responding to their needs because essentially we're asking them to do more.'",
        "'speaker_11': 'Yeah. Councilmember. Yes, fair enough. Every single. Every single. Patient that's evaluated in the city of Long Beach will be evaluated by the highest medical care possible under the in the California Fire Service. And we have no plans on changing that.'",
        "'speaker_9': 'Okay. We can revisit that. And and lastly, on the action here this evening. I just need some some clarity as to the timing and why tonight and not during our budget process.'",
        "'speaker_11': 'Well, Councilmember, thank you. But part of the reason we wanted to bring this up now is, as I mentioned earlier, we're not asking for any of these dollars, but for the $200,000 to go to financial management for billing purposes.'",
        "'speaker_11': 'We're not asking for any of these dollars to be applied to the fire department in fiscal year 16. What we want to do is we want to have it in place and have it work its way through an entire year so we can get some historical perspective on what we actually generate as far as revenue.'",
        "'speaker_11': 'And then this time next year, when we're sitting before you talking about the fiscal 17 budget, we can say it's generated this much revenue, it's stable and this is what we would ask be applied to fire. So we don't want to use any of it now.'",
        "'speaker_11': 'We just want to we in years past, we had asked for our budget to be reflective of a potential revenue generation idea, and then that revenue generation idea didn't materialize like we thought it would. We don't want to repeat that process.'",
        "'speaker_11': 'We want to take a more conservative approach. And secondarily, I do I do have I just want to remind you that the the numbers that we're putting forward to you are based on the 20% rate of return. It's a very conservative estimate on revenue generation.'",
        "'speaker_11': 'So we think that as we put it in place, as we go throughout the year, we'll have a better idea of what we're actually going to generate, which will give you the ability to discuss it and discuss how best to apply it this time next year.'",
        "'speaker_9': 'So it's a there's a possibility that the $200 responder fee, $250 for first responders could actually be less. If the projections are higher, we could come back and talk, have that conversation.'",
        "'speaker_2': 'It.'",
        "'speaker_11': 'I suppose. I suppose the answer to that is, is you could. We could.'",
        "'speaker_2': 'The other thing I might comment that you you mentioned is that one another reason for it not being received as revenue in 16 and only for 17 is that it also gives the city council an opportunity to see if the program works as well as the administration thinks it does in terms of being able to handle the'",
        "'speaker_2': 'hardship cases. So it's an opportunity to evaluate that. Again, we don't think there'll be a problem, but it's a perfect evaluation period.'",
        "'speaker_9': 'And I guess Mr. City Manager will discuss this if approved this evening. When will this go into effect? Is this something that goes into effect immediately?'",
        "'speaker_2': 'Katzmaier will be working with the city attorney's office to get this implemented, but it'll go into effect as soon as possible after we provide information to the public on how it's going to operate.'",
        "'speaker_9': 'And will it be reflected in the FBI 16 budget?'",
        "'speaker_2': 'No. So not just the $200,000.'",
        "'speaker_9': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Supernova.'",
        "'speaker_10': 'Thank you, Mayor, and thank you, Chief Dorey, for your presentation. I have two questions right off the bat from constituents, so I want to read them verbatim in case there any subtleties in it. One is, if a patient can't or won't pay, will the property owner?'",
        "'speaker_10': '20 to 40. Okay well the property owner of the location be build and or have a tax lien placed on their property. Can we be assured that will not happen?'",
        "'speaker_2': 'But that will not happen.'",
        "'speaker_10': 'Okay. The second question is, does research show that the fee will be an influence on a patient's decision to call 911?'",
        "'speaker_11': 'I will use the Sacramento Metro Metropolitan Fire Department as an example. I asked that very specific question whether or not their fee, which is higher, considerably higher than what we're proposing here, had any kind of effect on people, whether or not they were going to utilize 911 as their primary care providers in some cases.'",
        "'speaker_11': 'In some cases, they said that it did deter some people who were high propensity users of the system from continually using the system like they would find alternative methods to get to an urgent care to their doctor. But for the most part, they said that that the $250 first responder fee because there their first responder fee, because'",
        "'speaker_11': 'it's applied toward insurance, was not a deterrent for people to call 911 if they actually needed it.'",
        "'speaker_10': 'Okay. Thank you. The next question has to do with restoration of the cuts. And I think I heard maybe two answers. So I just want to have a lot of clarity here and I'll give you the background. And the reason why it's so important to the residents of Fourth District is we have four engine companies that are'",
        "'speaker_10': 'in mothballs. That's 1018, 17 and 18 and engine 121 is a secondary engine company to station one. The other three represent the three Eastern Council districts three, four and five. So to put that in perspective, Council District three has fire stations four, eight, 14, 22 and 21, and then 21 is a boat.'",
        "'speaker_10': 'So let's throw that out. 22 is on the border so we can throw that one out so we can count three fire stations in in in Council District three. Okay. And District five, we have station five, 16, 18 and 19, Station 16 to the airport.'",
        "'speaker_10': 'So that's not available for medical emergencies. Station 18 is without a fire engine. So if you those two districts, one third of their fire stations do not have a fire engine. The fourth district has one fire station and it is without a fire engine.'",
        "'speaker_10': 'So 100% of the fire stations in the fourth District are without a fire engine. Sorry for the long explanation, but the very first question I will be ask is do we get our engine company back in Station 17?'",
        "'speaker_10': 'And I think your answer is the definitive no.'",
        "'speaker_11': 'Councilmember We would go back and revisit the data that we use to put together our restoration list that we sent to the Council last year. But I will tell you, with regard to Engine 18, it's a definitive no, not not right now.'",
        "'speaker_11': 'I mean, if we were to have dollars to restore things today, we would follow our restoration list that we sent to council before and we would go right down the list. And Engine 18 doesn't come in until until we restore three additional engines or at least two additional engines ahead of it.'",
        "'speaker_10': 'Okay.'",
        "'speaker_11': 'And then for engine 17, I'm sorry, I said engine 18, Engine 17.'",
        "'speaker_10': 'Right. And Station 17 is central to the Fort Dix. Not only is it our only fire station is central to the fourth district. So it covers the maximum amount of area in the fourth council district. Okay. Thank you, Chief.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Councilwoman.'",
        "'speaker_0': 'Councilman, Mongo.'",
        "'speaker_5': 'Thank you. I want to thank the staff for putting this together. I know that this was requested back when I was a part of the Public Safety Committee. And I, too, want to thank everyone for the hard work put in, because none of us want to see any more cuts to our fire department.'",
        "'speaker_5': 'And most importantly, as our medical calls for service are growing in their percentages. And we really need to have police and fire on hand to be able to respond. And our fire department is critical to that. My colleagues did an excellent job in outlining some of the things.'",
        "'speaker_5': 'I totally disagree that we are probably the best fire department in the country, not just the state, but just a small part. And thank you for Daryl, for asking the question related to our property owners, because I know that that's a big concern.'",
        "'speaker_5': 'With regard to our visitors and our recovery process on costs, a lot of the visitors that come into the city are here for events and such. And should those visitors. Receipt or if the calls are made by our hotel staff.'",
        "'speaker_5': 'How would that work?'",
        "'speaker_11': 'Well, Councilmember, we would we would approach that the same way, would approach any medical call for service. We we would obviously go to the scene and ask the patient whether or not they needed our assistance. If the patient were to decline and say, no, I don't need any assistance from you, there would be no fee assessed there'",
        "'speaker_11': '. But if the patient did have a medical emergency, they were assessed. We did a medical report form part of that medical report form part of our our new system will be to collect insurance information. So that way we can assist financial management in getting the bill to the insurer.'",
        "'speaker_11': 'And so we would approach it the same way we would approach it. Every patient we respond on in the city gets approached will approach them the same way, whether they're resident visitor business.'",
        "'speaker_5': 'Whatever. And do you foresee any challenges with patients that are coming from other providers over state lines?'",
        "'speaker_11': 'Councilmember. I think that happens today where, you know, periodically we'll have conventioneers or somebody who's in town that has a medical emergency. They get transported to a hospital. I'm not familiar with any unique challenges associated with that. I mean, there may be that doesn't I'm just not familiar with any unique challenges there.'",
        "'speaker_11': 'We would still gather the same type of information to the best of our ability and and share that with financial management. And they would do their billing, I assume, the same way they always do.'",
        "'speaker_5': 'Well, thank you very much.'",
        "'speaker_0': 'Thank you. Councilmember Andrews.'",
        "'speaker_10': 'Yes, thank you, Mayor. You know, I really want to thank everyone on the diocese who really use some very thorough, you know, questions. And I want to thank you, cheap and also your staff, because the thing I really want to know about was the hardship program.'",
        "'speaker_10': 'And I think you explain that very, very well. So I really am in motion to agree with Mr. Ricks dealing with Rex. I will second that motion and go along with it, because I think you covered it very well.'",
        "'speaker_10': 'Thank you, sir.'",
        "'speaker_0': 'Thank you. And lastly, Vice Mayor Lowenthal thought will go to a vote with within public comment, obviously, as well.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I also wanted to thank staff for their work. I know it's very difficult to have this conversation about fee for service when we regard the service that we provide in the city of Long Beach to be all inclusive, especially emergency services.'",
        "'speaker_3': 'But I feel comfortable and confident that we have a compelling argument for not only protecting those that may not be able to pay, but also be sure that our our department can run and provide continue to provide the services that they do.'",
        "'speaker_3': 'Just a couple of brief questions. I know they may have been answered, at least in our conversations during our briefings, but when we talk about insurance coverage, I know Councilwoman Gonzalez had mentioned that there may be a limit on some people's insurance coverage.'",
        "'speaker_3': 'So I will lean into the mike. Is there a cap that you that you're aware of on the basic coverage that people have, not the premium coverage necessarily, but those that might be on Obamacare, for instance, or any other basic level of coverage?'",
        "'speaker_3': 'Is it one two per year that someone can have a reimbursable call for service?'",
        "'speaker_11': 'Council Member I'm not aware of any cap on calls for service. I mean, I think if, if you can as a patient, if you're transported to the hospital and you demonstrate a medical necessity, I believe the insurance pays the fee.'",
        "'speaker_3': 'But sometimes it can be an arduous battle, correct, between the insured and the insurer.'",
        "'speaker_11': 'I don't know the answer to that. Quite possibly, but I don't know the answer to that for sure.'",
        "'speaker_3': 'And I think we've heard from residents who do find that to be the case. But but still, I don't feel that your policy recommendation, or at least the recommendation for council to take action is is an onerous one.'",
        "'speaker_3': 'The hardship exemption. I, too, am interested in that. I know that our city would not would not place this kind of a burden on those in need. And so I have seen us do that in nearly the last ten years that I have been working with our city team.'",
        "'speaker_3': 'And so I think you'll find a way to ensure that those in need will continue to receive service. And I appreciate your comments earlier about this not being a barrier to service. I think that's that's what I take away from your description.'",
        "'speaker_3': 'It's not intended to be a barrier for those who need the service and have to call. And just as anyone rendering medical services, whether it's at the hospital or on the at the street level, you would not deny service.'",
        "'speaker_3': 'And that is not a a benchmark to reach prior to receiving service. And if I can feel assured that that is always the case here, then I'm in support of those. Thank you.'",
        "'speaker_0': 'Thank you. Any public comment on the item? Please come forward. Please come forward.'",
        "'speaker_2': 'Very good you, Kirk, as the address. I'm glad I heard you.'",
        "'speaker_0': 'Just. Just the three rights I'm going to suggest. The three come forward. Look, go ahead, Mr. Goodhue.'",
        "'speaker_2': 'I'm glad the council said that you're open to looking at options. I think one of the options we have to examine and seriously consider. In terms of reducing our overall budget. Yes, we go back to work. What works so well for so many years?'",
        "'speaker_2': 'And not have a paid full time mayor and the staff that goes with it, period. One of the most ridiculous things that I saw in this outage over the weekend or last week. If we had a mayor. Out in the street with a podium and his and the seal of the city with a flight.'",
        "'speaker_2': 'You know, obviously, he's got a staff to do that. That's absurd. And that's an embarrassment to this city, period. There is nothing you know, you don't need a podium. You don't need a doctor in front of your name.'",
        "'speaker_2': 'Or if you do, you're in trouble. So I would suggest let's since we're not going to be getting any money this year, hold off. We will have that seismic change in management structure, both electric and otherwise, by mid-November period.'",
        "'speaker_2': 'And at that time, you can make we can make the decision. And hopefully I think you'll make the right decision as going back to what worked so well for so long. And have a part time mayor. There is selected.'",
        "'speaker_2': 'If not by the people, by the council, instead of a political hack using it for to build a political career which is devastating to this city or any city. Thank you.'",
        "'speaker_0': 'Thank you, period. Please come forward and be speaker.'",
        "'speaker_2': 'Good evening. My name is Jack Smith. I live at 50 Elm Avenue. That's in the East Village in the second district. Attacks as attacks as attacks. You can call it a fee, if you like, about this insurance coverage.'",
        "'speaker_2': 'There's never been the mention tonight about the word deductible. Insurance will cover it, maybe. But you pay your deductible first and that's cash out of your pocket. So if your deductible happens to be if you're really, really got good coverage at 250 bucks, you pay that 250 bucks.'",
        "'speaker_2': 'If your deductible happens to be which one, a lot of people who have their own private insurance is as much as five $6,000. That fee comes out of your pocket. So it's not covered by insurance. It's covered by insurance after the deductible has been satisfied.'",
        "'speaker_2': 'The issue of does it delay call? Well, let me tell you about my own experience. I unfortunately had to avail myself of the services of our fire department and paramedics. And they did a great job and they cost a lot of money.'",
        "'speaker_2': 'When I had a serious injury here in the city a few years ago, I did not call the paramedics and refused for anybody else to call the paramedics because I knew it was going to cost me a lot of money out of my pocket because of my deductible.'",
        "'speaker_2': 'At that time, I heard 1100 dollars. I think the bill I got was about $600. Thank goodness. In that situation, I had a friend with me who was able to transport me to the hospital. The hardship process is cumbersome.'",
        "'speaker_2': 'I've been through that. It is a lot of paperwork. It is a lot of time. You reveal that stuff to yourself, to city staff that maybe you don't care to reveal. He says it's your choice, but there's a form there that gives you a list of everything you have to provide.'",
        "'speaker_2': 'And then it goes through the process. And my question would be, how much does that process cost? City attorneys involved. I would imagine it cost a significant amount. A question I would have with this, too, is does it if you don't pay, does it get turned over to collections?'",
        "'speaker_2': 'That has to come up tonight. Collection agencies are very nasty to deal with. Given all the questions and comments and suggestions that have come up tonight, my suggestion would be that you should table this for now, get those answers that you asked for earlier in this discussion and bring this back at a later time in the 30'",
        "'speaker_2': 'days, if that's the time frame and make your decision at that point. Thanks.'",
        "'speaker_0': 'Thank you. Next speaker, please. Final speaker.'",
        "'speaker_2': 'Good evening. Thank you to the fire chief for the proposal and the Council for your wonderful questions. I just had a suggestion you might consider. It seems like you're adding $1.6 million to the general fund. It seems like your comments were that over the years, the efficiency of the system has changed such that you're responding 85% to'",
        "'speaker_2': 'medical calls. And I would just suggest that you might consider using some of that generated revenue to move the force in a direction that's more ready to respond to its its needs and invested in more ambulances for the city.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. So with that, we're going to Vice Mayor Lowenthal and we're going to go to work.'",
        "'speaker_3': 'Since it's been such a long discussion, can we restate the motion as well as the the part that is apart from the motion for the information coming back to us?'",
        "'speaker_0': 'Absolutely, Mr. Mason.'",
        "'speaker_12': 'Mayor, members of the city council, as I understand the motion, it is to approve the resolution adopting the fee and also request that the city manager come back with a report within 30 days providing more detail in regard to the fee waiver and also provide information about a program that has been referred to as either an opt'",
        "'speaker_12': 'in or opt out fee program. Thank you. Subscription fee.'",
        "'speaker_0': 'Thank you. Members, please cast your votes.'",
        "'speaker_1': 'Motion carries eight one.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_2': 'No. But yes. Okay.'",
        "'speaker_0': 'Okay. Next up is we're gonna go back to public comment. And so we have Larry Goodhew, David Zink and Mr. Cromwell. Please come forward.'",
        "'speaker_2': 'Larry, could you if you can hold the cloud until we get a if I've got a transparency up there for the edification of the. Council members that have not seen it behind you or what you see here is the marine stadium to s which was nefariously raised about a year ago.'",
        "'speaker_2': 'This structure that you see is a repurposed structure, much needed, but was raised as a result of a criminal ruse that has the mayor's DNA all over it. And one of the things that has captured the attention of the Department of Justice.'",
        "'speaker_2': 'Is that the. Number of ring tones relative to this water fireside facility is remarkable, remarkably similar to a number of ringtones on a waterside facility 3000 miles to the east that sat on the Potomac. And which. In the year and 42 years ago.'",
        "'speaker_2': 'Engendered that 1011 word phrase by the late. Howard Baker. That forever changed the paradigm through which. Officers of the court and the Justice Department look at things. And I think you will find. That when they examine very closely.'",
        "'speaker_2': 'Their criminal roots and the DNA. Of Robert Garcia, who was then. Vice mayor. Coastal Commission member. You will find them looking and asking the same question that was posed by Howard Baker. The end result will be by November.'",
        "'speaker_2': 'Give or take a week or so, we will have that paradigm shift in management. Both on the 13th floor and the 14th floor. Thank you.'",
        "'speaker_3': 'Thank you, Mr. Goodhue. And I'm wondering if Mr. Zinke is here. David Zinke. Okay. If I might call Mr. Cromwell. Thank you.'",
        "'speaker_5': 'Thank you. For those of you who had your support that was self-initiated, that was not accompanied by the CFO conversation. So I would like to thank you for that support. First, I would like to know who will be held accountable.'",
        "'speaker_5': 'Amy Burdick wanted code enforcement in regards to the retaliatory illegal eviction. Want a code enforcement to kind of inspect our union? I did oblige her, and she said we'd take it from there. Code enforcement came out. They did discover 14 violations, many of which existed prior to my initial tenancy.'",
        "'speaker_5': 'Uh, that have yet to be remedied. Uh, they came out. Nothing has been done since. I have zero follow up from Amy Burdick. Since then, the landlord has locked us out of the unit, locked our cats and our turtle in the unit, boarded up the windows, shut the electricity off.'",
        "'speaker_5': 'The food in my fridge was probably spoiled. I don't know what the litter box is doing. It's disgusting. It's illegal. So where am I in mind you that in the retired formulation I just rendered to them 60 $500?'",
        "'speaker_5': 'I tried to put a bid on one of the Parsons parcels that you mentioned today. So my question again remains, why did Amy have code enforcement come out? I never called code enforcement to. I know the fines are minimal and I would call in years ago.'",
        "'speaker_5': 'I did it to oblige her and in return just had empty promises. Second, Mr. Mike Conway on. June 23rd assured me that the partnership with her strong Community Foundation Corp. the owners of the complex, they would contact the attorney and stop the eviction.'",
        "'speaker_5': 'Now, Mr. Mike Conway approached myself. In that room, in the hallway. Making these false promises and saying that he had a meeting to attend to the next day. And I have not heard anything from him since. Not once a little thing.'",
        "'speaker_5': 'June 2nd, City Council commented that they care about the tenants and retaliation and I would like them to prove it. There's no reason why we should not be placed back into our unit. We did absolutely nothing wrong. I should be able to go home tonight.'",
        "'speaker_5': 'Apologize to my cat. Apologize to the turtle. Clean the litter box. Clean the turtle cage and whatever else is going on inside of that unit. We did have food cooking as well. I was told it in regards to all of these events that it sounds bizarre.'",
        "'speaker_5': 'And that may be to some. However, Long Beach is no stranger to the misappropriation of funds at all. This is a fact. We did nothing wrong. Now the impact of the scope of this apartment complex owner.'",
        "'speaker_0': 'Thank you, ma'am.'",
        "'speaker_2': 'In Long Beach.'",
        "'speaker_0': 'Thank you. I have to wrap up. Time is up. Okay. Thank you very much. Do you have the rest of the speakers list, vice mayor?'",
        "'speaker_3': 'Yes, I do. Thank you, Robert Jackson. Lawrence Weathers. Georgie Rivera. I don't believe they're here, sir.'",
        "'speaker_0': 'Okay. Thank you. So we will move on now. Moving on from public comment, we do have I'm moving a couple items up because there's there's folks here. So I'm going to be moving at 1035 to the top of the regular agenda, which is going to be.'",
        "'speaker_0': 'Which is which is which is here. So 35 will get moved up if there's other requests of the council can come. Give it to me right now let's do consent calendar minus item four. Can you get a motion, please?'"
    ],
    "Moratorium and Review of Development Standards for the R-1-L Zone.": [
        "'speaker_1': 'Communication from Councilman Austin. Recommendation to adopt a minute order declaring a moratorium against the issuance of permits for the construction of new homes or additions. More than 1500 square feet and the r1l zone and request development services and the Planning Commission to review the development standards.'",
        "'speaker_0': 'He counsel for Austin.'",
        "'speaker_9': 'Yes. Thank you, Mr. Mayor. Several months ago, many residents of the Lower Cerritos neighborhood approached my office with concerns about the possibility of changes to the district character. Distinct character of the neighborhood. The Yellow Cerritos neighborhood north of Bixby Road is the only area in the city that has the r1l zoning designation because of the large lot'",
        "'speaker_9': 'sizes. Many of the homes in the neighborhood are marked by spacious yards and set backs of the homes away, away from the sidewalk and street. However, the development standards in place for this zone do not do enough to protect the character of the neighborhood.'",
        "'speaker_9': 'It is timely now because of the maturing of the neighborhood. We are seeing a transition in ownership and more homes for sale than in recent times. A community of neighbors. I actually did their homework researching the history of the building permits in the neighborhood and surveying what other cities and similar zoning have done to address this issue'",
        "'speaker_9': '. They work with my office in developing a recommendation that will place a moratorium and allow our development services staff to work with the neighborhood to develop new standards that would ensure the protections for this zone. The moratorium would not limit homeowners owners from doing any improvements on their property.'",
        "'speaker_9': 'It only applies to the construction of new homes or the addition of more than 1500 square feet to an existing house. When you think about it, 1500 square feet is about the average size of most homes in most neighborhoods in our city.'",
        "'speaker_9': 'Anything less than that? And a homeowner can still get permits under the existing standards. Other cities, including Arcadia, Pasadena and Los Angeles, have taken similar approaches, and the neighbors have worked hard to inform and involve the entire neighborhood affected by this recommended action.'",
        "'speaker_9': 'More than 250 residents have signed a petition in support of tonight's recommended action. I ask you, my colleagues, to support this motion. It only affects this one neighborhood in eighth District and allows the residents to work with our planning staff to review and improve the zoning standards in the very near future.'",
        "'speaker_9': 'So with that, I would ask for your support on this matter. And I know there are some residents here to speak on it.'",
        "'speaker_0': 'If there's a motion any second on that comes from Iran, could you have any comment on the government? Okay. So what's the public comment of vice mayor, which after a public comment, please come forward. I have three speakers on this item.'",
        "'speaker_0': 'There's four speakers on this item. Please come forward. If you're going to speak, please line up then when we have a long night. I'm trying to abbreviate and know how, but what's the length of each comment here? So please, please begin.'",
        "'speaker_5': 'Esteemed mayor and council members. My name is Stacey McDaniel. I live at 4110 Cedar Avenue in the low risk district. There is an urgent need to enact this temporary and limited moratorium to preserve the character and livability of our neighborhood caused by an unprecedented number of homes for sale in the neighborhood.'",
        "'speaker_5': 'The action only applies to about 600 homes in the R-1 L zoning area, all of which are completely within the eighth District. And over 300 of our neighbors have signed a petition supporting both this moratorium and more zoning restrictions.'",
        "'speaker_5': 'This request is not about any particular family or home or street. It's about preserving the character of our neighborhood. When we say preserve the character of our neighborhood, what are we really talking about? We want to preserve the spacious feel of the lost Tahrir Square.'",
        "'speaker_5': 'The homes are appropriately scaled to maximize yard areas, preserve heritage trees and provide adequate light and airspace surrounding homes on their lot. Our current zoning zoning restrictions do not do this. For example, under the limited restrictions we now have given the size of the lots in our zoning area, a 12,000 square foot home could be built on'",
        "'speaker_5': 'a 20,000 square foot lot. And if that lot was on a corner, one side of that home could be built to within six feet of the sidewalk. There are two homes in this area that are currently on the market that fall exactly within those parameters.'",
        "'speaker_5': 'In fact, one of those homes could legally be subdivided. Rather, the lot could be in two separate 7200 square foot homes could be built on those two lots. We carefully researched what other comparable Southland cities were doing, and our city does not have many of the protections other cities used to prevent mega mansions and preserve gracious neighborhoods'",
        "'speaker_5': '. In the last ten years, 75% of the remodeling requests in our area have been to only add between 501,000 square feet. This moratorium would only apply to additions greater than 1500 square feet. Please help us preserve the jewel that slow, storied us.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Good evening, Samir. Council members. Staff. My name is Freddy Carolus. I represent a resident of Los Rita's neighborhood. First off, my client is not opposed to the trend of stopping.'",
        "'speaker_2': 'The mega-mansion in.'",
        "'speaker_0': 'The mega-mansion development in this area. Is opposing.'",
        "'speaker_2': 'To how its it is.'",
        "'speaker_0': 'Suggested on imposing the moratorium or immediate moratorium on construction. It's in its current form. The suggested moratorium will negatively impact several aspects of the real estate. Development business and the construction industry. There are other measures that could be properly affected, properly imposed, such as the stopping of the mergers and verifying if the reduction of the FFR goes'",
        "'speaker_0': 'from 60% to 50%.'",
        "'speaker_2': 'The approval of the suggested immediate.'",
        "'speaker_0': 'Moratorium.'",
        "'speaker_2': 'Will.'",
        "'speaker_0': 'Affect the following items. Current projects that are in the planning.'",
        "'speaker_2': 'Development stage.'",
        "'speaker_0': 'That have been through the planning department for several months have been reviewed and approved.'",
        "'speaker_2': 'On phases and are close to acquiring.'",
        "'speaker_0': 'A permit for construction. My client has been in the planning department for almost three months, has been working very hard with the planning department. Officials met all the requirements.'",
        "'speaker_2': 'And is.'",
        "'speaker_0': 'Short of a future meeting of next Thursday for final review and approval and potential permit application. My client has been has invested.'",
        "'speaker_2': 'A large amount of money in.'",
        "'speaker_0': 'Acquiring the services of the professional architect.'",
        "'speaker_2': 'And this architect is specialized.'",
        "'speaker_0': 'In high end.'",
        "'speaker_2': 'Development to just make sure.'",
        "'speaker_0': 'That the character of his new business model is going to is going to be okay with the character of the neighborhood. Having said that.'",
        "'speaker_2': 'My client has never been properly notified of such a petition being in the works. Had he had been properly notified, he would have stopped this much investment in such a model.'",
        "'speaker_0': 'Thank you very much. Thank you. Next speaker, please.'",
        "'speaker_4': 'Hello.'",
        "'speaker_1': 'My name is Karen Miller.'",
        "'speaker_4': 'I have lived at.'",
        "'speaker_1': '3833 Pine Avenue since 1998.'",
        "'speaker_3': 'And have been selling real estate in the area for the last 11 years.'",
        "'speaker_1': 'My concern with the mansion ization is the lowering of.'",
        "'speaker_3': 'The property values.'",
        "'speaker_1': 'In our area. Please consider the homes that have been there for about.'",
        "'speaker_3': '80 years and a mansion is built next door. The current residents lose privacy in their backyards. They use loose natural light in their.'",
        "'speaker_1': 'Homes, in their.'",
        "'speaker_3': 'Backyards, and their views are obstructed.'",
        "'speaker_5': 'When these people.'",
        "'speaker_3': 'Go to sell their house as houses.'",
        "'speaker_1': 'Many of them have been there for about 80 years. Suddenly, next to the mansion, it's considered small and dark.'",
        "'speaker_3': 'And will sell for much lower property value than other comparable homes in the neighborhood. For these reasons, we say that.'",
        "'speaker_1': 'This mansion zation, along with lowering.'",
        "'speaker_3': 'Our property values, it's caused dissension among the residents.'",
        "'speaker_1': 'Which is why we're asking you tonight to.'",
        "'speaker_3': 'Please help us stop this.'",
        "'speaker_1': 'Happening in our neighborhood.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Look, I'm. I'm a little confused by the speaker mentioning that by raising the general neighborhood, you would thereby impact property values negatively. But let's just put all that aside. If I wanted to change something in my house, I would have to apply for a variance and then I would have to put a public notice.'",
        "'speaker_2': 'That's not the measure that's being put forward here tonight. You are now coming in and saying immediately, we must stop all new construction. I happen to live across from a home that is, quite frankly, an eyesore. It's probably 80 years old.'",
        "'speaker_2': 'I know that somebody purchased the house. They planned to knock it down and built something new, nice and esthetically pleasing. This moratorium would effectively quash that immediately. I also want to point out that I used to live at 4256 Country Drive, which is the house is well over eight years old and it's over 6000 feet.'",
        "'speaker_2': 'Its next door neighbor, also a relatively old house. Also over 6000 square feet. So I don't understand what exactly is being proposed here. And then on one final note that I would like to make is that a wise person once told me that there is no such no thing, so permanent as a temporary government action.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Mayors, City Council members.'",
        "'speaker_9': 'Kevin Case I've lived in the eighth and in Los Cerritos for over 25 years. I support what's in front of you. It's a.'",
        "'speaker_2': 'Temporary moratorium, but it really.'",
        "'speaker_9': 'Is an.'",
        "'speaker_2': 'Opportunity to give everyone a chance to take a breath.'",
        "'speaker_9': 'Step back and.'",
        "'speaker_2': 'Look at how we're going forward. A lot of the zoning standards don't really work well in our neighborhood.'",
        "'speaker_6': 'And we're asking for the opportunity to work with people on the standards.'",
        "'speaker_9': 'And try to get something better. And it's not all about big houses.'",
        "'speaker_2': 'A lot of the lots have been subdivided.'",
        "'speaker_9': 'They've gotten pretty tiny over the years and you can put a really huge house. And again, it gets into what some of the other people have said where.'",
        "'speaker_2': 'They're very close together, they're very tall.'",
        "'speaker_9': 'And it just.'",
        "'speaker_2': 'Disrupts the openness.'",
        "'speaker_6': 'And the look and feel of the.'",
        "'speaker_9': 'Neighborhood. So what all those people that have signed, I guess it isn't a petition, but they're noting that they are in favor of a second look or another look in more detail at some of these.'",
        "'speaker_2': 'Zoning standards.'",
        "'speaker_9': 'And trying to get something in place for our little pocket of homes.'",
        "'speaker_2': 'There. Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please. This is our last speaker. And we're going to we're going to vote.'",
        "'speaker_2': 'Thank you, Mr. Austin, and your staff, for the work that you've done in bringing this forward. The goal here is to give city staff a toolbox to use to develop and maintain the unique character of the law street as neighbors associate Las Vegas Neighborhood.'",
        "'speaker_2': 'In the past, there are 15 or 20 years. There have been a number of loopholes that have come up where it's it's changed the character. We have three streets coming in Bixby, San Antonio, Roosevelt and some people have changed the direction of their front yards and it's and allowed them to turn a different direction, which again, allows'",
        "'speaker_2': 'instead of a large setback, not only having a six foot step setback that can affect the ingress and egress out of the area, causing, you know, the character to change. And these setbacks are what what what make it unique and actually benefit the neighborhood for everybody.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you. Public comment has now closed. Vice Mayor Lowenthal.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And I don't know if the city manager has someone from planning to answer this question, but in the report it indicated that Council District eight may be the only district that has this circumstance or not circumstance, but the r1l zone.'",
        "'speaker_2': 'Angela Reynolds.'",
        "'speaker_3': 'Thank you, Angela.'",
        "'speaker_2': 'So sorry.'",
        "'speaker_12': 'City Attorney Vice Mayor Lowenthal. I checked with planning staff on that and they indicated to me that, in fact, the eighth district is the only place in the city that does have this unique r-1 one l zoning designation.'",
        "'speaker_3': 'And I see all the compelling reasons why we should definitely support this. And out of curiosity. Were there others with those designations and we had eliminated them or this was always the only one with this designation? I'm just curious how this comes about in one particular district.'",
        "'speaker_3': 'What is the nature of that district that compels a planning team and a policy body to do something like that?'",
        "'speaker_5': 'Councilwoman. The question was, is this was. Were there other one else zones in the city.'",
        "'speaker_3': 'That we had.'",
        "'speaker_5': 'To leave? So that's our one one house. L for large, for the larger lots.'",
        "'speaker_3': 'Any thoughts on how this policy came about?'",
        "'speaker_5': 'Yeah. Well, you know, the city and how how it developed over time. That area has much larger lots than most any other part of the city. So that's why they had their own specific zoning.'",
        "'speaker_3': 'Okay. And then I wanted to know from the maker of the motion, how long is the moratorium for? Typically when we do moratoriums, we have a time certain.'",
        "'speaker_9': 'You know, I kind of left that open ended because I recognize that that staff in talking to the staff and preparing this that it would take several months to to to be able to go through a process that would engage the community and development services staff.'",
        "'speaker_9': 'So I think that question might be best for Councilman Austin.'",
        "'speaker_12': 'Generally speaking, with the moratorium on land use, what we do is we craft into the ordinance itself because we will have to bring back a formal ordinance, three meetings from now. And that ordinance typically would have a one year moratorium period.'",
        "'speaker_12': 'But there is a provision in there that the moratorium goes away if the planning commission and the City Council adopts new regulations prior to that time. So there's an incentive for staff to bring it back, but it also gives them flexibility as to when it comes back.'",
        "'speaker_3': 'I appreciate that. And I'm very supportive of measures like this that support neighborhood character preservation. And my questions really just were from being personally stunned that this exists. I thought really it was the second district that had all of the bad planning measures that were implemented.'",
        "'speaker_3': 'So it was an equal opportunity. I mean, you know how we look with our parking status. So I'm disappointed, but I'm glad we're able to rectify it, hopefully rectify it going forward. So thank you.'",
        "'speaker_6': 'Canterbury Ranga Yeah, you actually one of my questions in regards to the length of the moratorium. So just to get the fair idea as to when it takes effect that we will vote on this tonight, will take effect tonight or will it take effect when it comes back to us as a as a as a ordinance.'",
        "'speaker_12': 'The way moratoriums work, you are actually adopting the minute order that was proposed by the councilman for the eighth District. So it does take effect this evening. It is formalized 3 minutes from now when we bring back an ordinance, one thing that we typically ask for clarification of and sometimes it's not easy to know the first night'",
        "'speaker_12': 'it comes is what happens to projects that may be in somewhere in a pipeline. In other words, someone mentioned that they had, or at least in the planning process, typically you are not vested to move forward with the project until you have an actual building permit in hand.'",
        "'speaker_12': 'In the past, sometimes council has chosen to exempt people that aren't quite that far but are somewhere in the process. But typically most councils that do that would want to know how many are somewhere in the pipeline, how many that would affect, what the nature of that particular construction or constructions were.'",
        "'speaker_12': 'So we can address that when we bring the ordinance back. But you may not be able to adopt the ordinance the first evening if you want to later exempt people that are somehow reasonably in the pipeline. Otherwise it would apply to anyone that does not have a permit in their hand as of this evening.'",
        "'speaker_6': 'And that's my concern. I know there's an investment that's been made by some people, although I support I support the ordinance, no question. However, I am concerned that people have already made an investment in going to planning and trying to get a permit.'",
        "'speaker_6': 'And I just want to make sure that it's fair to them that they get property noticed and know exactly what's happening. So. Do I need to make a friendly amendment to this to to maybe give it a 45 day extension before it takes effect in order to in order to address those issues for those applicants?'",
        "'speaker_12': 'Well, what what typically happens if you give it an additional 40 day, 45 days or any period of time, it does alert people and sometimes that generates folks to get in the pipeline and actually spurs the type of development that you're trying to put the brakes on while you formulate new regulations.'",
        "'speaker_12': 'When we've done pipeline type situations before, we have exempted folks that, for instance, have don't have a permit in hand, but prior to the night you adopt the moratorium, had submitted an application and the planning department has deemed that application complete.'",
        "'speaker_12': 'But they are still in the process, for instance, because they are still going through planned check and you know, back and forth between the architects and the planners and no actual building permit has been issued. So that's an option.'",
        "'speaker_12': 'I'm not suggesting that you do that, but that isn't an option.'",
        "'speaker_6': 'Yeah, well, I guess my concern is those that are already there as of today. Do we have a number of applicants? We have a number of advocates who are already there. That would be, I guess, exempt because they weren't properly notified of this possible moratorium.'",
        "'speaker_0': 'Mr.. Reynolds. I think the. From what I understand, there are none that have actually received the building permit per se, but there may be some that are in the process of trying to get to that place of the permit.'",
        "'speaker_0': 'I also, from what I understand and correct if I'm wrong, Councilman Austin, but this motion as presented is with no exceptions, is just to have the minute order begin tonight, regardless of where they are in the process, in that process.'",
        "'speaker_0': 'Isn't that correct?'",
        "'speaker_9': 'That is.'",
        "'speaker_0': 'Unless they have a building permit in hand. This would this would stop that process.'",
        "'speaker_9': 'Well, the building permit and what the city attorney. Correct. Is a little different.'",
        "'speaker_0': 'Yeah. Mr. Reynolds, can you can you can you add. Do we know if there's a group of folks who answered to answer? CUSTOMER Your Angus question and customer assistance question.'",
        "'speaker_5': 'Mayor, I'd have to actually get that information to at a different time. I don't know how many are in the planning process. I know it's very few, but I can't tell you exactly how many. Like maybe one or two.'",
        "'speaker_2': 'And I don't know.'",
        "'speaker_5': 'If they've gone to plan check yet or not.'",
        "'speaker_0': 'We don't know if the one or two either have their building permit or not because isn't isn't that the.'",
        "'speaker_5': 'That's.'",
        "'speaker_12': 'Well, if they do have a building permit, this would not apply but will.'",
        "'speaker_0': 'Not apply to them if they don't have the building permit. This would.'",
        "'speaker_2': 'Apply that this would apply in order.'",
        "'speaker_5': 'To get the building permit, you have to go through basically the whole planning process and the and the building plan check and it's at the end you get the building.'",
        "'speaker_2': 'Permit.'",
        "'speaker_0': 'So I think that's the clear indicator.'",
        "'speaker_9': 'Councilmember So, so I just want to get some clarification because I heard two different things I heard. I mean, and the mayor's kind of focused on permit. Mr. Mayes you you made reference to in the planning process, and that means they're in the planning process.'",
        "'speaker_9': 'There has been some sort of engagement with development services that. Correct.'",
        "'speaker_12': 'Typically what that means is that someone has submitted an application to start a project, but they are and the planning staff has deemed the application complete, but they have not yet been issued a permit because what usually happens is there's a back and forth with the larger house between an architect and the planning staff to make sure'",
        "'speaker_12': 'everything is being designed correctly. So Ms.. Reynolds indicated there may be one or two that are in the process somewhere in they've submitted an application. The application has been deemed complete, but they haven't actually got the permit in their hands.'",
        "'speaker_9': 'What I the intent of my my motion was obviously neighborhood preservation. And, you know, I don't want to to to hurt any of any of my residents who or anybody that that may be in the process as well.'",
        "'speaker_9': 'But I want I want this to start this evening. But if I could amend the intent of the motion to if to exempt anybody that has any any applications in the planning process so that nobody is losing their their investment, so to speak, and then we can move from this day forward.'",
        "'speaker_12': 'So if I can suggest an amendment to your motion that would be to adopt the minute order and direct the city attorney's office to bring back an ordinance that reflects the minute order, but exempts anyone who lives with in the r1l zone that has a completed application on file that has been deemed complete by the Planning Department'",
        "'speaker_12': 'as of July 21st, which is this evening.'",
        "'speaker_0': 'So moved that the motions are on the floor. Please cast your votes.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Thank you. Next up is Adam, 35.'"
    ],
    "City and LBUSD Collaboration on Parking and Traffic Issues.": [
        "'speaker_1': 'Communication from Councilwoman Mango Councilman Price and Council Member Super Nnuh recommendation to work with the Long Beach Unified School District to address ongoing parking and traffic issues at Long Beach schools impacting local residents and neighborhoods.'",
        "'speaker_0': 'Before we go there, too, I also I think there's there's folks here for item 34. I know we haven't had any requests to move that up yet, but I'm going to move that up after. We're going to do we're going to do 235, then we're going to do 21 and then we're going to do will move up'",
        "'speaker_0': '34 after 21. So next up is 35.'",
        "'speaker_5': 'Yes. I'm excited to bring forward an item tonight where we can strengthen strengthen the partnerships between our Long Beach Unified School District and our neighborhoods in addressing some of the traffic concerns that have come up through the years.'",
        "'speaker_5': 'Several of our schools have needed to make changes to adapt to the changing environment of our students. Some places where we used to have junior highs, we now have high schools, and some places where we used to have bussing.'",
        "'speaker_5': 'We now have neighborhood schools. And so there used to be a committee that would work on these types of things with our neighborhoods. And I feel that the time has come to work hard to put citizens back in touch with the school district through our our city process to ensure that we have a safe place for children'",
        "'speaker_5': 'to go to and from school and to get in and out of the cars and to ensure that when we get in and out of our cars were being safe and that we're not putting any of our children at risk.'",
        "'speaker_0': 'Okay. So you're making the motion as presented in this item, correct?'",
        "'speaker_5': 'Yes. I'm expecting some friendly amendment.'",
        "'speaker_0': 'Okay. Councilwoman Price making a second to that Councilman Price.'",
        "'speaker_8': 'Thank you. Is someone else going to make the friendly or should I go ahead. What did you want to make me?'",
        "'speaker_5': 'Go ahead.'",
        "'speaker_8': 'I'd like to make a friendly amendment that we reactivate the joint.'",
        "'speaker_3': 'Powers Task Force was the committee called. Joint Use.'",
        "'speaker_8': 'Joint Use. Joint Use Committee. I apologize. Sorry about that. I would make or recommend I would make a friendly that we reactivate that committee to allow the partnerships to continue.'",
        "'speaker_5': 'I think that would be great.'",
        "'speaker_8': 'Okay. In regards to this item, I want to thank Council Woman Mango for bringing it forward. I do want to say that our office works very closely with Long Beach Unified. We attempt to and they have been very receptive to our office in terms of working with us, coming up with solutions.'",
        "'speaker_8': 'And I say that knowing that there are some constituents in the audience here today who have not liked some of the recommendations that Long Beach Unified has made. And just within the last few days, some of the recommendations that we've made to support Long Beach Unified in terms of some of those recommendations.'",
        "'speaker_8': 'But I view our partnership with Long Beach Unified to be a very positive one in terms of our council office, and that's all I can speak for. And so my hope with this item is that we can continue to work in partnership as we have been through a more formalized setting, which is such as the Joint Use'",
        "'speaker_8': 'Committee. So I want to thank you for bringing this forward. And I think this is a conversation that it's appropriate to have. But again, I think that the partnerships are very well in place, and I hope that they continue to move in a positive direction.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_0': 'So just to be clear, the the motion on the floor is to bring these items forward to the already established Joint Use Committee. Is that is that right? Yes. Reactivate. Okay. And just as we're clear, the joint use committee members are appointed.'",
        "'speaker_0': 'The council members are appointed by the mayor, I believe, and the district then appoints district members to the Joint Use Committee as well. There's a make up of that already set to well, we'll go through that process. Council Member Austin.'",
        "'speaker_9': 'So I'd like to volunteer first to be on the Joint Use Committee, Mr. Mayor.'",
        "'speaker_0': 'We'll see about that.'",
        "'speaker_9': 'And and I'd just like to say, you know, parking and traffic issues around every school, I think in every neighborhood in the district is is a concern. We all certainly hear about them. I have been working very closely with our school board representative, Megan Kerr, who's been a great, excellent partner to to raise these concerns with and'",
        "'speaker_9': 'to, you know, kind of put our heads together and strategize on solutions in and around in the neighborhoods where we have school, school issues and traffic in our community. And so that's it. I'm looking forward to this issue, going to the Joint Use Committee and, and building that, that sound partnership or improving upon our partnership with the'",
        "'speaker_9': 'school district to address concerns and what we have. I'll just say this where we have active PTA is I can't go can't can't not commend the PTA that that are that are out there doing the valet parking situations and have great volunteers.'",
        "'speaker_9': 'We have active participation, parental peers of participation at our schools. These issues are much easier to to to address. So I just wanted to make those comments. Thank you.'",
        "'speaker_0': 'Councilor Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Thank you, Councilmember Mongo, for for beginning this conversation. I just want to chime in and say that, um, just over the last five years, I've been, you know, working here in the city of Long Beach.'",
        "'speaker_7': 'We've, we've worked hard at the relationship not only with the district, but with the schools. The ninth District obviously is home to Jordan High School. And there's no I guess the point I want to say is there's no way to legislate good relations.'",
        "'speaker_7': 'It takes hard work to go out, meet the principals when there's a new principal, meet that principal and have conversations about the community's concerns and local solutions to those concerns. I've seen how we've placed things on the city council agenda, and it's actually diminished some somehow some of our relationships that we might have.'",
        "'speaker_7': 'And what what I'd like to see and don't use is great, but I think I've seen better results when you can pick up the phone, call your principal or your school board member and work out a solution with your neighborhood association and maybe parent groups.'",
        "'speaker_7': 'So so I'm going to I'm going to support this tonight, but I would just encourage us to have a more informal, less legislative relationship and more informal personal relationship to work out some of these issues. And those are just my thoughts on this.'",
        "'speaker_0': 'Thank you. Councilman Ringwood.'",
        "'speaker_6': 'I want to echo Councilmember Richardson's comments. I think that it's a good thing that we reestablished. Just I want to thank Councilmember Price for making the First Amendment, because I think that's the appropriate way to to be able to deal with this.'",
        "'speaker_6': 'I want to also thank, um. Chairwoman. President. President Carter, I guess. I'm sorry, Adam.'",
        "'speaker_5': 'Diana Craighead. Diana. Diana.'",
        "'speaker_6': 'Right outside. I was just at your board meeting yesterday, and I was making comments here. But welcome to our two hour council meeting here. Sorry to keep you so late, but looking forward to having the grow that relationship because it's a relationship that needs to be established or reestablished and grown.'",
        "'speaker_6': 'So thank you very much for being here.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_1': 'I just want to say I'm glad that we had the friendly because I think that's certainly a more appropriate avenue for us to tackle these issues. And we, you know, in the First District, we have a variety of different schools with the same issues.'",
        "'speaker_1': 'And I know we've often contacted our principals directly to ensure that we're just engaging in a conversation about that. But I have a question for city staff. I know this is sort of related and I know Council member Austin brought this forward some time ago and I'm not sure when it will be back.'",
        "'speaker_1': 'Is the crossing guard item it was. When do we expect that back? Because this is some, you know, some somewhat related as well.'",
        "'speaker_2': 'Are a million will respond to that. He's running the peace committee.'",
        "'speaker_9': 'Honorable mayor, honorable council members. Councilmember Gonzalez, thank you for asking that question. We have finally reenacted the pedestrian safety committee. We have full membership now from all council districts. And unfortunately, our second meeting was supposed to happen on Thursday last week.'",
        "'speaker_9': 'And due to the blackout, we canceled and will postpone that meeting. But the meetings are moving forward and we will report back after we had our second meeting. The first meeting was just to establish rules and regulations, identify what needs to occur.'",
        "'speaker_9': 'And in this meeting, we're going to discuss specific intersections that need to be addressed. And we will reschedule it within the next couple of weeks. We have to find the most appropriate time for the participants because we had already notify them.'",
        "'speaker_9': 'We will have three meetings in this fiscal year. We buy by charter. We are supposed to have two. We will have three to make up what has happened in the past, but will definitely come back when we have the second meeting.'",
        "'speaker_1': 'Wonderful. And I want to thank you. And I think some of the concerns may be addressed through that committee. I see maybe some crossover in that. And then lastly, I just want to thank President Craighead and School by school board member Megan Kerr just for your continued work with the city.'",
        "'speaker_1': 'And I just saw you yesterday as well, so we're certainly there and we go back and forth with discussions. So thank you for being here.'",
        "'speaker_0': 'Thank you, Councilmember Super.'",
        "'speaker_10': 'Thank you. I also wanted to echo Councilmember Richardson's comments about just the neighborhood coalitions. A couple of years ago, we had tremendous impact set back from school and neighbors got together. And again, all mentioned board member Craighead. She showed up at one of those meetings, I think it was two years ago.'",
        "'speaker_10': 'I remember it was that triple digit day. That's that's the biggest part. I remember it's about 103 degrees in a elementary school cafeteria. But the school board and the school district came through and actually put a parking lot on the school grounds, which I thought was pretty amazing.'",
        "'speaker_10': 'Also, speaking of crossing guards, don't forget to use them for intel. We get our best intel. I'll mention Deborah Willard, who contacts her office and gives us a lot of good information about traffic concerns. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Andrews.'",
        "'speaker_10': 'You know. Yes, Mayor. You know, I really want to thank everyone for being a part of this, because being in the educational field, I think it's extremely important that we do strengthen our partnership with the language Unified School District, you know, to address this issue at the schools, this traffic issue.'",
        "'speaker_10': 'You know, my office has struggle with Lafayette School days for many years. And even after I've had to park inside, I had to change and a one way street added for certain hours. But hopefully this item will bring new insight to to the reoccurrence of issues that might that the neighbors have had faced in doing this year'",
        "'speaker_10': '. So I'm really hoping that this will bring some more help with our neighbors and with the school district so we can get this issue taken care of. And thank you again for being here.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_5': 'I just wanted to address some of the comments that were made. First and foremost, the quality of life for our residents and our citizens and our our students is of utmost importance. And the informal process is in place.'",
        "'speaker_5': 'There are lots of neighborhood associations that already have meetings and work with our neighborhood principals and work with our PTA presidents and sitting in this seat. There's an advantage to being able to see that there are certain things that work really well at certain schools that can be shared.'",
        "'speaker_5': 'And while it's great for our school board members and ourselves to make those those correlations for our community, it's also really a powerful thing to have that open forum and this more formalized committee for some of the issues, as Councilwoman Pryce mentioned, related to how sometimes the recommendations that we put forward aren't always the recommendations that the'",
        "'speaker_5': 'community feels are best for them. And so just having this additional process, I think, will strengthen the informal process that we've had in place for a very long time. Several times during my my leadership as the neighborhood association president, we invited our school board member to our community meetings.'",
        "'speaker_5': 'And Diana has already been to a community meeting in a neighborhood adjacent to a new school that's changing. And so these are great things, and there's always room for improvement. And I just look forward to this opportunity to have that more formalized process.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Any members of the public like to speak? Please come forward. As they come down, I want to thank both of our school board members that are here tonight. I think it shows your commitment to the city and vice versa.'",
        "'speaker_0': 'I think, you know, I love you both very much. And I want to thank you for being here and showing your interest. And if you're even really interested, you can be on the Joint Youth Committee. But thank you.'",
        "'speaker_0': 'I think you all know we have an all star school system. And I want to thank you for that. Our public speakers. Yes, sir.'",
        "'speaker_6': 'Hi, everybody. James Craig Bishop. I'm a Long Beach resident and the founder of the School Neighbors Association here in Long Beach, which you can see online at school neighbors dot com. It's established with the goal of reducing the traffic dangers here in Long Beach that we all live with to ensure the safety of our kids and their'",
        "'speaker_6': 'schools citywide here in Long Beach. The traffic and death injury rates on our streets are basically.'",
        "'speaker_2': 'Doubled around school zones. School traffic.'",
        "'speaker_6': 'Kills a person in Long Beach every two of three.'",
        "'speaker_2': 'Years above background levels.'",
        "'speaker_6': 'School traffic causes 72 injuries a year on our streets and 12 collisions with students or pedestrians anywhere in vehicles occur each year in our Long Beach school zones. There are two contributing factors and main reasons that I attribute to these high death and injury rates in our school zones.'",
        "'speaker_6': 'One, the map that was up just a moment ago showed the School of Choice traffic that's produced in the city. The school choice program produces about 40,000 vehicle trips per day, mostly in the neighborhoods that are designed for pedestrian.'",
        "'speaker_2': 'Traffic.'",
        "'speaker_6': 'As students are driven across town instead of walking to their local schools. East Side schools are hit most by this traffic, with production of over 1100 vehicle trips per day at schools and at some as many as 1400 per day.'",
        "'speaker_6': 'And that's just from the school choice program. That doesn't include background levels from from other events and basic local traffic for the school. The second main reason is the initial design capacity of many of the schools has been expanded and in the process the traffic worsened through bungalow additions because when the bungalows were added, Long Beach Unified'",
        "'speaker_6': 'did not comply with the requirements of the California Environmental Quality Act when they put the bungalows in which would have required them to take a look at traffic concerns from adding the bungalows increased demand they cause and to mitigate the issues that come up from that.'",
        "'speaker_6': 'Briefly, I want to mention an example from where I live at ten shore.'",
        "'speaker_2': 'Preparatory.'",
        "'speaker_6': 'School traffic comes in from the north, drops kids off and has a desire to turn around and go back and exit where they came from. In the process, they make U-turns in the street and turns into our front yards and across sidewalks, often while pedestrians, including my own kids, are present, it's a real danger.'",
        "'speaker_6': 'They immediately change direction to back up towards pedestrians in the street, toward kids on the sidewalk behind them, and very often don't see those in the way. It's a serious issue, not just at my house, but up and down our street that all of our neighbors are concerned about.'",
        "'speaker_6': 'The response we've received from Long Beach Unified has been a little bit different than what was described here tonight. The transit director, Paul Bailey, calls this issue a chronic citywide problem. The school principal has identified the safety issues as a big concern of hers, but nonetheless, neither of them has been willing to even discuss ways to fix'",
        "'speaker_6': 'it. And I'm about out of time here, so I just want to offer my support. I did a few changes I would suggest, but generally suggest the proposal of compelling some communication on this.'",
        "'speaker_0': 'Thank you. Thank you, sir. Next speaker, please.'",
        "'speaker_2': 'One meeting I just found. So, Professor.'",
        "'speaker_0': 'Dr. Stewart, Dr. Farber, I didn't recognize your.'",
        "'speaker_2': 'First 350 Monrovia. My wife and I have lived there for about 35 years. I am not coming here as Dean or as professor, but I'm coming here as chair of the Community Watch Program. If I might be permitted.'",
        "'speaker_2': 'I can save a lot of time if you let me pass this out. I have one for every person here. Good professors like to save time. Um. First of all, I'm very pleased to be here and pleased to see former good students and all-American athletes that once.'",
        "'speaker_2': 'Gracious to our halls at Cal State University, Long Beach, to his former student body presidents and one as an all-American halfback. And they're all sitting right here smiling.'",
        "'speaker_3': 'What about the adjunct professors? The adjunct professors?'",
        "'speaker_2': 'Oh, yes. Traffic congestion is a problem. Ed Rogers, let me paint a picture for you. Rogers Middle School and the elementary school borders right up to each other. Monrovia Avenue to the east and the ATO Avenue to the west.'",
        "'speaker_2': 'Broadway and Appian Way. It's a box. Oops. Get me there. It's a box. And the traffic problems that exist there are paramount. I've asked Mr. Reavis. I wanted to get an actual count of how many cars we're talking about going from north to south on Monrovia Avenue, which fronts Roger's middle school.'",
        "'speaker_2': 'My wife Trish and I live directly across the street from Rogers, so we're constant observers for the last 35 years of what's been going on there. Mr. Reavis, who is the engineer associate city of Long Beach, took a count on the traffic 815 to 9:15 a.m. on Monrovia Avenue, and the count was 1058 cars.'",
        "'speaker_2': '1058 cars in a period of. What time? Killed 58 vehicles. He said it ran about 18 vehicles per minute. 18 vehicles per minute coming down Monrovia Avenue. Either stopping at Rogers or continuing on to Lowell Elementary School. The congestion part of the congestion we have when we paint the picture for you.'",
        "'speaker_2': 'ROGERS And law schools do not provide parking space for their employees or their guests. Look that let that one sink in.'",
        "'speaker_0': 'So, Dr. Farber, I know a rep that I'm going to let you wrap up because times are ending here, but.'",
        "'speaker_2': 'Could do a little.'",
        "'speaker_0': 'Bit. Just real quick, think your.'",
        "'speaker_2': 'Parking space is the resident's parking. So when they take our space, we don't have it. And so that's part of the major problem we have there. We've tried to consider that one and get over that. Monrovia is a rather narrow one way street.'",
        "'speaker_2': 'And so when parents come in to drop their students off or other parents are parking their too long, it blocks the traffic. Then because the faculty and staff have taken their spots across the street at further blocks of traffic.'",
        "'speaker_0': 'Dr. Farber Yeah, and I hate to do this to you because you're my former faculty member. But I have to follow the time rules.'",
        "'speaker_2': 'So I request another couple of.'",
        "'speaker_0': 'Minutes. I actually am not able to do that because I have to do it for everyone. But I'll let you kind of wrap up what I did. You were able to. Were you able to pass out what you needed to pass out?'",
        "'speaker_2': 'Okay. They can see all that.'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_2': 'Let me get to the suggestions that I can't. We do that for a couple of minutes. Just just the suggestions we're.'",
        "'speaker_10': 'Actually prepared to give away.'",
        "'speaker_2': 'Well, we're pleased that we I think this needs to get out of here because we're talking about cooperation between schools.'",
        "'speaker_0': 'So. Dr. Farber. Yeah, I guess what I'm going to do is I can't actually extend the time, but it's 3 minutes and I have to be fair to everybody. So what I would like to do is I will add this item is still on the agenda.'",
        "'speaker_0': 'I will possibly ask a couple of questions and we'll we'll get some of that information from you in just a minute. Okay. So if you just just hang out right there, Dr. Farber and I will make sure that we're able to get some of those recommendations.'",
        "'speaker_0': 'Right. Okay.'",
        "'speaker_2': 'Okay. Okay.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_2': 'Good evening, Mr. Mayor and council members. I'm Ken Weiss and I live at 378 Q Avenue in and third District, right around the corner from Rogers Junior High School and Law. And the parking and traffic issues are basically gridlock.'",
        "'speaker_2': 'We have parents that are parking in the red zones in front of the fire hydrants, in the intersections to drop their kids off. There's a lot of potential accident waiting to happen. I live on the on the corner.'",
        "'speaker_2': 'So my my garage and the alleyway are the ramp for the garage to call. It is right on the beginning of the alley. They park and leave their cars and run from my garage door. And, um. As I said, one of the big things is parking in front of the fire hydrants, which is a safety issue.'",
        "'speaker_2': 'They're parking in all the red zones. When we call the law enforcement to come out, they send the meter readers and they say, well, the zones aren't red enough today, so we're not going to write tickets. And the school, both Rodgers and all Lowell has been better and trying to work with us.'",
        "'speaker_2': 'Rodgers has been horrible in terms of the traffic issue and the parking. And I, I really support this agenda item and I just hope that you're really going to for those of us in the third District in Belmont, you're really take a hard look at what's going on at Lowell and Rodgers because it's really pretty bad.'",
        "'speaker_2': 'That's it.'",
        "'speaker_0': 'Thank you, sir. I close the speakers list, but Vice Mayor Lowenthal. Or Councilman Price.'",
        "'speaker_8': 'Dr. Farber, I'm curious, do you have any recommendations for us in regards to the suggestions that you raised?'",
        "'speaker_2': 'Thank you. Yes, I do.'",
        "'speaker_5': 'Great. You're prepared.'",
        "'speaker_2': 'I'm not going to take a lot of time. You have it. You have some of it in front of you. We would like to encourage students. To bike and walk more as they already have begun. We would like to encourage more students to bike and walk.'",
        "'speaker_2': 'That would take some of the load off of the cars that are traveling up and down the street. Picture there's just the one street and the cars are going all the way up from Monrovia, all the way down to lower.'",
        "'speaker_2': 'Um. We would like some signage. We were like, Thank you. We would like some signage that that indicates loading and unloading 10 minutes from 7 a.m. to 4 p.m.. The current signage doesn't doesn't.'",
        "'speaker_10': 'Doesn't account for that.'",
        "'speaker_2': 'We would like Monrovia Avenue repaired, please. It's a major street. Currently, there's approximately a 30 yard length of street with a breakage offset of 1 to 5 inches. And this has caused many bikes. And I have personally assisted three major injuries that have cut off bikes, one just last week, and that street needs to be fixed.'",
        "'speaker_2': 'We've asked for that for quite some time. Rogers needs to provide adequate parking for the numerous, and they have a lot of programs there for the evening programs, PTA concerts, open house back to school night and other special programs.'",
        "'speaker_2': 'We suggest using the Gate School entrance off Appian Way that allows cars to come in and use the blacktop. On Sundays, we observe the Sound House Church, which is currently leasing land on Sunday for their church at Rogers.'",
        "'speaker_2': 'They use this entry and I've counted as many as 40 cars there. That would be more than enough for faculty, staff, students to be able to come in there in part and take them off of Monrovia Avenue. There's a need for a crossing guard.'",
        "'speaker_2': 'And I'm glad to hear the committee is back in operation. We need a crossing guard badly at the intersection of Vista and Monrovia Avenue. There's a pile up of cars that go through there, and we need a park guard to help the kids get across so they don't just have to dodge cars to make it across the'",
        "'speaker_2': 'street. So these are the kind of things that we're looking for. I'm glad to hear that there's increased cooperation anticipated between the schools. Personally, I have seen a little bit of a break in the last ten years between Long Beach Unified School District and and the board.'",
        "'speaker_2': 'And the city of citizens in the city. Along these things we try to get done. One is apt to point to us and say, I'm sorry, we can't do that. That's that's a matter for them. We go to them.'",
        "'speaker_2': 'We can't do. That's a matter for them. These two teams and I've heard Mayor Garcia talk about this and he's right on. They must work together. They can't just stand back and say, no, we can't do that. The Long Beach Unified and the council and the people at work must work together.'",
        "'speaker_2': 'Many of the problems we have as counting the price, those are the result of lack of working together. We've tried as parents, as faculty, people who who've run these board meetings and we're just, you know, being sold out.'",
        "'speaker_2': 'But I think I see a break and I with your help and your help, Dee, and your help, Susan. I think we can get some work done, so I look forward to it. There are some signs, Patricia and I've gone round to other schools.'",
        "'speaker_2': 'There are schools within Long Beach that do what we're talking about. They have signs up to talk about when you can park. This particular one came from another school, middle school, just down the road, not too far from where we are.'",
        "'speaker_2': 'There are signs limited parking in other areas. So I know it can be done.'",
        "'speaker_0': 'I think you have to find.'",
        "'speaker_2': 'A way to start. Thank you for your help. Whatever we can do.'",
        "'speaker_0': 'Thank you. And make sure you give Trish our love, particularly from Susie and I.'",
        "'speaker_2': 'So did you have another question?'",
        "'speaker_8': 'No, I think I'm good with the questions and thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_8': 'You never ask a lawyer that question. Your father.'",
        "'speaker_0': 'Thank you. Thank you. We have a motion on the floor and members. The motion is to reestablish, not reestablish, but begin a conversation of the Joint Use Committee. Please cast your votes.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_0': 'Thank you. Item now. I think it's.'"
    ],
    "Creation of a Citizen Redistricting Advisory Commission.": [
        "'speaker_1': '2121. Communication from Councilman Austin. Councilwoman Gonzalez. Recommendation to refer to the Election Oversight Committee to study the merits of developing an 11 member appointed Citizen Redistricting Advisory Commission. To research the possible mid-decade and future redistricting processes. And request the EOC to report back within 90 days.'",
        "'speaker_3': 'Thank you, Madam Clerk. There's been a motion. A second. Councilmember Austin. Did you want to speak to the motion?'",
        "'speaker_9': 'Yes, I did make the motion here and I brought this item forward. I want to thank Councilmember Gonzales for joining me on this. The redistricting process is obviously a very sensitive and political process that we undertake generally every ten years.'",
        "'speaker_9': 'And our charter affords us the ability to do it every five years. And I know there's been some conversation about moving forward with that process. But in the spirit of participatory government, and I think this council has done an excellent job under our mayor and just deliberate actions of various council members to engage community in the decision'",
        "'speaker_9': 'making process. You know, we're doing participatory budgeting in several districts where we're engaging residents in how to spend. But the budgeting our funds and their funds on the things that they want to see done. And in an effort to avoid the pitfalls that we experienced during the last we just district in process, particularly impacting many areas of'",
        "'speaker_9': 'the eighth district, the seventh District and other areas of the city where there were and still are a little still are hard feelings over the redistricting process and how that all went went down. I thought it would be behoove us to look at establishing a redistricting citizen redistricting process, considering that it has had obviously some success with'",
        "'speaker_9': 'the state on the state level and has been supported by by the Supreme Court recently. And so with that, I would just ask for your support on this item to move forward to the Elections Oversight Committee.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_1': 'Yes. Thank you, Councilmember Austin, for bringing this forward. This is just a recommendation, just an idea at this point. And I certainly know that, as the councilmember added, you know, as we're kind of getting into the idea of participatory budgeting, including much of our community members, into the political process, the democratic process, I think this is an'",
        "'speaker_1': 'idea worth exploring. And so I know that I when I'm as the chair of the Elections Oversight Committee, I certainly plan to review Congressman Lowenthal work and leadership on the on the issue as he is the one that was the lead in forming the state commission.'",
        "'speaker_1': 'And so I'm sure we'll be exploring that. I do want to, though, formally, I'm sure we will explore different options, but I do want to include a formal amendment just to allow the committee to explore other options that are feasible.'",
        "'speaker_1': 'So I would like to do that, and otherwise I hope to gain support on the council. Thank you.'",
        "'speaker_0': 'Vice Admiral Lowenthal.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I know we have a natural mid-decade process that's coming up. Is there someone that's available that can describe that process? I've been part of that twice.'",
        "'speaker_0': 'Absolutely. Mr.. Mr.. MODICA, why don't you kind of walk the council kind of where where I know you've done some very preliminary, I think probably thought about, but this process coming up and we can go over that and what the process look like the last time we went through that would be helpful.'",
        "'speaker_6': 'Yes. Thank you, Mr. Mayor. Members of the City Council, Madam Vice Mayor. The city is a little bit different from other cities. Most cities have in their charter that they do redistricting every ten years and they line it up with the census.'",
        "'speaker_6': 'So when the census comes out than a year after that, the redistricting process starts. Long Beach actually says that we do that every ten years, but we also have the option every five years to do it or actually sooner if the council wants to do that.'",
        "'speaker_6': 'But we're actually on an every five year cycle and this is actually the off year cycle where we are not lined up with the with the census. So we are planning to do a redistricting effort and at least start those steps.'",
        "'speaker_6': 'Part of what has to happen as a part of the charter is in April of 2016, we would start that process and we would go to the Planning Commission and the Planning Commission would make a recommendation to you about whether or not the the districts are within balance of each other, reasonably equal or approximately equal, I believe'",
        "'speaker_6': 'the code says, and then make a recommendation to the City Council on whether or not to begin a redistricting process there at times. The city has passed on the five year redistricting process and decided not to pursue it at the last at the last cycle, which was in line with the census, we did do a redistricting process'",
        "'speaker_6': 'and it resulted in the maps that you see today. So this is something that we are planning for. You know, what process we use and how we do it has not yet been determined. We would use the process we've used in the past, which is essentially creating some guidelines.'",
        "'speaker_6': 'The last time we did it, we had the Council create your own guidelines. It is there your guidelines for direction to staff on what types of changes should be included or not included. We get direction on those guidelines with public input and then come back to you with a series of maps that would meet those criteria.'",
        "'speaker_6': 'Then the Council chose an alternative to bring out to the community to do significant community input. And then the Council made a decision on redistricting. So that is the general process, but we'd be happy to answer other questions or if the EOC would like to discuss other options.'",
        "'speaker_6': 'We can certainly do that and what the staffing implications are those of those alternate options are.'",
        "'speaker_3': 'Okay. Thank you. And I just had a couple of more questions. Having seen the process before here on the council as well as on the school board, I'm I'm hard pressed to understand what may be lacking in the existing process.'",
        "'speaker_3': 'I do. I feel that it was very transparent. It has been in the two times that I have participated, I have felt that this council was very collaborative with each other. There have been circumstances where I think council members have advocated for one particular change or another in defense of particular district issues.'",
        "'speaker_3': 'But overall, there's been collaboration and certainly a good spiritedness about redistricting as it's best for the city. And the overarching purpose is I think part of the process is also a set of guiding principles that the city manager's office recommends and the council reviews.'",
        "'speaker_3': 'I'm I'm confident that that process was and is and continues to be engaging of the public many, many, many meetings. The members of the public did come out and their recommendations were considered. And each of us as council members taken those recommendations.'",
        "'speaker_3': 'And so I'm I'm not inclined to change that at this time. I don't find compelling evidence that we have gone astray in any way or have politicized the process the way that what we see in other layers of government.'",
        "'speaker_3': 'I don't find that to be the case here. And and I would not be inclined to support it unless I am convinced otherwise through this conversation.'",
        "'speaker_0': 'Thank you, Councilor, for your ranga.'",
        "'speaker_6': 'Gaze for clarification and make sure the motion this is to basically go to the Elections Oversight Committee and just discuss it in terms of it's something we want to do. Correct.'",
        "'speaker_9': 'That? That is correct. And I can argue more, but that is actually absolutely correct. I mean, we're going to have and.'",
        "'speaker_6': 'It's not a done deal.'",
        "'speaker_9': 'This is not a done deal.'",
        "'speaker_6': 'All right. Well, because obviously there were some issues that last time around about committee keeping communities of interest together, contiguous ness of the communities, those types of things or sets of issues that were presented. So in terms of guiding principles, I would hope that we continue with that as a member of the Oversight Committee as well.'",
        "'speaker_6': 'I look forward to working with Councilmember Gonzalez on this. I think it's something that we should look at before before we start talking about a mistake mid decade adjustment to to our redistricting create boundaries in our district. So I look forward for that to.'",
        "'speaker_0': 'Councilor Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. So at this time, I don't I don't think that I can support this in this current form for a number of reasons. Number one, I don't think I've been convinced of the context of this conversation that there's a need it seems like a solution to a problem that doesn't exist.'",
        "'speaker_7': 'I went through the redistricting process here in Long Beach the last time, and there was contention. But we had a fantastic time in North Palm Beach with our process. We had tremendous involvement, community sort of, you know, community spirits and such and community draw the line workshops and.'",
        "'speaker_7': 'And my concern is that if we sort of put this off to a to a resident citizen committee, I think we're sort of diminishing what could be in terms of involvement. I think it is fairly straightforward when the residents, they elect nine council people and they sort of engage in their own local processes.'",
        "'speaker_7': 'What happened at city council was sort of the beginning of it, and we sort of took that into our own respective communities and and engaged in these processes where hundreds, if not thousands of people participated. And by putting that into a commission structure, I would have to ask, are we limiting public participation to that process?'",
        "'speaker_7': 'For example, let's talk about medical marijuana. I don't know that the task force that we just sent folks to, I don't know that that expanded participation into the discussion. We'll find out soon, I suppose. But I don't particularly know that it did.'",
        "'speaker_7': 'So I'm concerned that I do agree with exploring processes to expand, I guess, to meet that end. But I don't think that this particular proposal does that. Additionally, I was involved in the statewide redistricting process, and that did have major it had major issues.'",
        "'speaker_7': 'People were concerned about it. I was particularly concerned about it. North Long Beach was gerrymanders a three separate assembly districts because we weren't considered a united sort of community of interest. So now we have three assembly people representing one zip code, which is, you know, shameful.'",
        "'speaker_7': 'That was a direct result of the Citizen Redistricting Commission. So so I do so I do understand where where folks want to go. The other part of it is I think it's untimely. Like, I don't think the council has made a decision about midterm redistricting.'",
        "'speaker_7': 'Like, I have significant, serious concerns, but I'll have the opportunity to talk about that when it comes up in the spring. I think that's when we would talk about or evaluate any processes that we might have. And I think we're sort of letting, you know, engage in this conversation a bit too soon.'",
        "'speaker_7': 'So those are just my concerns. So in this current form, I just can't support this tonight. And those are my remarks.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_5': 'Thank you. I appreciate that we are bringing the discussion forward because I think it's always important to involve citizens in the dialog. I think that's a really important part of the process. I tend to agree with my council member, Rex Richardson, in the innovative and creative ways that you were able to embrace what you did in the'",
        "'speaker_5': 'ninth District. But I don't necessarily think that that was probably the case in every district. And so perhaps Councilmember Austin would be open to a friendly that we refer to the Budget Oversight Committee to discuss it. I'm sorry, Elections Oversight Committee.'",
        "'speaker_5': 'The redistricting ideas to involve and enhance the community process, including some cost analysis on what a citizen commission has cost us versus the process that we've endured in the past, and what that looks like for the Elections Oversight Committee to refer back to this body.'",
        "'speaker_5': 'A reasonable solution that would work for everyone. Would you be open to that friendly?'",
        "'speaker_9': 'Let me give it some thought.'",
        "'speaker_5': 'Okay. Do we know what the costs of our citizen commission to date has been?'",
        "'speaker_6': 'So today we have not had a citizen commission. We essentially run the process using existing staff and we bring it to the planning commission and we bring it to the city council without knowing too much about the proposal.'",
        "'speaker_6': 'And then we would talk about that in an election oversight of this passes. Our sense is that a commission would require some level of dedicated staffing. The way we've done it in the past is to pull bodies off of assignments and have a kind of finite work product that we that we knew the council would want us'",
        "'speaker_6': 'to bring to them and then get some further direction. A commission is a little different. A lot of times commissions are. The meeting frequency is a lot more. There would need to be agendas and public agendas for each meeting that we would hold.'",
        "'speaker_6': 'There need to be translation. There would need to be some dedicated guys, staffers and some dedicated planning staff as well for the effort. So we would be certainly able to to cost some of that out if we were requested to do so.'",
        "'speaker_6': 'But redistricting is a big process. It does take a significant amount of staff time. And so in the past we've tried to manage that. But you do have other priorities that get shifted even with the normal staff redistricting process.'",
        "'speaker_5': 'So I appreciate you bringing that back up, because I do think that this is a little premature because we haven't yet given the planning commission, which has a role in this that opportunity. So I guess without the acceptance of a friendly, I'll make a substitute motion where we refer to the Elections Oversight Committee ideas to involve the'",
        "'speaker_5': 'community in the process of redistricting, so that when we do receive a referral from the Planning Commission, we as a council have had some dialog at the committee level that can be accentuated here at the council.'",
        "'speaker_3': 'I'll second that.'",
        "'speaker_0': 'Okay, there's a motion and a second. So the substantive motion on the floor is to ask elections oversight to begin to drive a conversation about ways to involve the community more in the redistricting process.'",
        "'speaker_9': 'Councilmember Austin You know, I'm not necessarily opposed to this substitute motion, but it's just a little curious as to why this council was so adverse to involving our citizens. From from a commission standpoint, I'm not convinced that it's going to be any extra cost associated with establishing a citizen commission.'",
        "'speaker_9': 'Mr. Modica, I do appreciate your comments, but you know, you're going to have to have this specialist, you're going to have to have extra staff, time staffing and informing this body in itself. The idea behind this item was to take away the politics from the process, engaged and involved the citizens, and inspire confidence in the process.'",
        "'speaker_9': 'And I tend to disagree with you. Councilmember Lowenthal, Vice Mayor Blunt, I know you were here during the last redistricting process. I watched it very closely. I saw people lined up to speak on this and in opposition to maps.'",
        "'speaker_9': 'And as I, I maybe maybe I'm living in a different part of the city and a different part of the world. But people are extremely still dissatisfied about the outcomes of that process and their lack of involvement in that process.'",
        "'speaker_9': 'And so we brought this forward as a as an idea to, again, help inspire confidence in this council, inspire confidence in the process of redistricting. It is a very political process, just like our budget process is a very political process.'",
        "'speaker_9': 'It lays out where we are and it shapes the future of the city in many ways in terms of representation. And so if the I would ask that that we vote against the substitute motion and vote on the motion that that that Councilmember Gonzalez and I put forward.'",
        "'speaker_0': 'Basically a lot of.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I. And I understand the place where Councilmember Austin Councilwoman Gonzalez so where you're coming from, you want to have greater participation from citizens or you find that there may have been a lack of participation.'",
        "'speaker_3': 'And that's that's where I'm not convinced. I don't this council is not adverse to involving its citizens. I think those of us that have witnessed the process from the side of the dais or from observing it. I think I certainly feel that we have a process that involves our citizens.'",
        "'speaker_3': 'We're not averse to it at all. So that would be I would be troubled by that characterization. Our not supporting this or mine, I'll speak for myself, my not supporting the motion. The original motion is not because I'm adverse to involving our citizens.'",
        "'speaker_3': 'I'm very much in support of that and I felt that that did take place. What does happen in a democratic process is that everyone doesn't get what they want. That doesn't mean we're adverse to public participation. This is a representative government, as Councilmember Richardson pointed out, and we all know and.'",
        "'speaker_3': 'In every circumstance, all our residents aren't going to get exactly what they want. That's just not possible. I don't see how that's ever possible. And so, yes, there may be times where there are winners and losers in certain situations, and that's not a conversation that we like to have.'",
        "'speaker_3': 'And those are not characteristics that that we are comfortable with. But it does exist. Whether it's the budget, but most everything that this council decides on will have some that get more than others. And so there will be dissatisfaction and we hope to avoid that to the extent possible.'",
        "'speaker_3': 'But that is not and that is not an aversion to involving our citizens. And I didn't feel that it was a political process. But from your district, I will I will acknowledge that there was it was very tense between the members that wanted one option versus another.'",
        "'speaker_3': 'But I don't think we can paint this entire body with that brush and that experience. And so if those residents came to you today, you are a trusted elected member of this council. And if your residents came to you, you would certainly assure that their requests are conveyed through you.'",
        "'speaker_3': 'That's the process. And I'm confident in that process that if you as a council member or I as a councilmember, am listening to the overwhelming majority, not the loudest vocal individual that the overwhelming majority of my constituents, then I it's my obligation to bring that to this body and make that compelling argument.'",
        "'speaker_3': 'And I trust that that is in place. And and I don't feel that that's broken or that's gone awry. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_1': 'So you just collect my thoughts here for a second because there's a lot that's been said. But I, I, I don't see really what the difference is in what we originally brought forward, which is again, just a recommendation.'",
        "'speaker_1': 'I think I added the caveat the amendment that we wanted to explore alternative options. So we're leaving it open at this point. And I really do feel that putting the Elections Oversight Committee to recommend a redistricting advisory commission is, you know, I believe it should be at the forefront because it does open up the process.'",
        "'speaker_1': 'We have different opinions on that, but we're certainly going to include and explore other options. And so city attorney Mike Mayes. If the substitute motion, which is to include more community or find ideas or ways to include more community, that doesn't exclude us.'",
        "'speaker_1': 'And that at the EOC level. But it's still taking this up to look at the redistricting committee, is that correct?'",
        "'speaker_12': 'The motion, as I understood it, the substitute motion is fairly involved. A broad excuse me. And it includes or it's limited to involving the community in the redistricting process. And I assume that that could include as a point of discussion whether or not it's appropriate to have a committee, a citizen committee.'",
        "'speaker_12': 'That's one of the things that's the way I read it. But maybe the maker of the substitute motion didn't mean it that way.'",
        "'speaker_1': 'Okay. Well, I just I will just make the point again. You know, again, this is a recommendation, I think whether we agree with having a committee or not or a commission or not, we're still looking looking to open this up and explore options.'",
        "'speaker_1': 'So I would just hope that we can stay with that same motion and we'll see where it goes. Thank you.'",
        "'speaker_0': 'Okay. I have two more speakers and we definitely want to get to the Republican vote. We still have a long agenda. Councilman Mongo.'",
        "'speaker_5': 'I think that the intention of my more broad action is to include more dialog along the lines of the types of citizen engagement that Councilmember Richardson discussed. I'm really excited about those kinds of options, and when I offer them as a friendly, they weren't accepted.'",
        "'speaker_5': 'So I made them as a substitute motion because I really think that those types of engagement tools really need to be explored because while I am going to be 100% supportive of the next item, which is 34, in allowing a citizen committee to finish their work, and I'm very in favor of citizen committees.'",
        "'speaker_5': 'I'm also really excited to explore all of the options and the citizen engagement numbers that are associated and the return on investment. Because I really want to interview my commissioners after the process, see how they feel about it and etc. to make sure that this is a balanced process for all.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_8': 'I'm going to support Councilman Austin and Councilman Gonzales on this only because I know they've worked worked hard on this. And I think their recommendation is asking us to just refer this for further consideration and study. I don't think it's committing us to one thing or over another.'",
        "'speaker_8': 'I will say, however, that if it's council's will to engage citizens by asking them to sacrifice their time and energy to serve on citizen advisory committees, that we should allow them the opportunity to have closure in those processes and not circumvent their efforts.'",
        "'speaker_8': 'So if we're going to start this process, we should allow them for completion, because otherwise there is nobody that is sane and remotely educated who will sign up to serve on a commission knowing that the council may just come in and circumvent the process because they don't like where it's going.'",
        "'speaker_8': 'So I'm in favor of this with the understanding and the legislative mindset and the legislative intent at this time, that if we're going to allow a commission to be formed, that we do it meaningfully and honestly and not as a as a for any other purpose than that.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_0': 'Thank you. Any public comment on the item? Seeing. Please.'",
        "'speaker_2': 'Hello, Jeff Abrams. I just would like to make sure that we remember that in addition to the arduous task of redistricting and it is difficult, we have to figure out a way to get people in Long Beach up and voting.'",
        "'speaker_2': 'That's the criteria that I'm looking at, not the redistricting effort, but the people that get them off their duff. How do we do that? Thank you.'",
        "'speaker_0': 'Thank you. So with that, we have a we have an original and a substitute motion just to review. The substitute motion, which was then submitted by Councilman Mongo, is to ask the EOC to look broadly at community involvement measures.'",
        "'speaker_0': 'The original motion by Councilmember Austin is to ask the EOC to explore the possibility of a redistricting commission. Mr. MAYES That sounds about right. So please go and cast your votes on the first motion, which is a substitute motion by Councilman Mongo.'",
        "'speaker_5': 'Councilwoman Pryce.'",
        "'speaker_1': 'Motion carries six three.'",
        "'speaker_0': 'Okay. Thank you. The motion as the substitute passed in that case. Moving on to the next item, I. I would move up item 30. For Madam Clerk.'",
        "'speaker_2': 'Oops.'"
    ],
    "Medical Cannabis Task Force Recommendations.": [
        "'speaker_1': 'She took communication from Councilmember Urunga, Vice Mayor Lowenthal, Councilman Andrews and Councilmember Richardson. A recommendation to receive and file a list of the recommendations compiled from the Medical Cannabis Task Force.'",
        "'speaker_0': 'Councilmember Wrangham.'",
        "'speaker_6': 'Thank you, Bear. Basically, I want to thank my former colleagues, council members, who with the Andrews and Rex Richardson for sending on to this. It has been a nice long process for the the task force has been working has done its job.'",
        "'speaker_6': 'It has it has a series of recommendations that are coming here to us. And I would hope that my council members would approve receive a file of this item.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_7': 'I don't have any comments at this point.'",
        "'speaker_0': 'Councilwoman Pryce.'",
        "'speaker_8': 'Thank you. I'm going to urge my colleagues to vote against this item. I appreciate Councilman Yanga bringing this forward, but I have a few points that I just want to share with my colleagues and ask you to please keep an open mind regarding the points that I want to make.'",
        "'speaker_8': 'First of all, I read the agenda item. And just as a point of clarification, Mr. Mays or the city clerk who I know has been at every one of these meetings, these task force meetings. Are these recommendations or are these just topic items that all the task force members were able to put on this list?'",
        "'speaker_12': 'Councilwoman Price I'll try to answer. And if I say anything incorrectly, if the city clerk could jump in the way and I have been to every meeting except for one, the way this has worked is initially the task force had engaged speakers to come down and talk about various subject.'",
        "'speaker_12': 'And as those subjects were discussed after maybe three or four meetings, I think we were into it. It was decided to more or less keep a running tab. They would vote on issues that later they would come back and then make formal recommendations.'",
        "'speaker_12': 'So basically it was a running list. I would characterize it as a running list of topics, but no actual recommendations other than defining the topics have been passed. The plan was the task force self committed to trying to end the process on July 29th.'",
        "'speaker_12': 'What would have happened last Wednesday night had we not had the emergency situation in the downtown area, is that we would have started going through the list of recommendations, the list of topics. There are approximately 45, some of our double topics, approximately 45.'",
        "'speaker_12': 'The plan was to go through them one by one, have a discussion on each item, and then hopefully get a motion and ultimately a clear, concise recommendation back to council on something. So from my perspective, none of those are actual recommendations, but just topics.'",
        "'speaker_8': 'Have the task force members voted on any single one of these recommendations or. I'm sorry, running list of topics.'",
        "'speaker_12': 'Not. Not that I can recall that they voted to formulate a recommendation and start compiling a list to send that back to council only. Topics.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'And the reason that I that I asked that question is so we all. Other than Councilman Supernova, who is not here but the rest of us actually selected members of the community. I believe most of them are residents of the city of Long Beach to serve voluntarily on this task force with the commitment that we made to'",
        "'speaker_8': 'them that their work was going to be meaningful and that we were going to consider their efforts, and that at some point they were going to get to vote or at the very least offer some sort of closing remarks to the people that they've been serving with since April.'",
        "'speaker_8': 'Is that when they started their service in April? Or that when they first met.'",
        "'speaker_12': 'If I recall, I think the first meeting was maybe the first week in April.'",
        "'speaker_5': 'Okay.'",
        "'speaker_8': 'So but it is am I correct to assume that the task force members believe that at some point they were going to get to either vote on recommendations that that that this process was designed for them to at some point get to vote on a recommendation?'",
        "'speaker_12': 'Exactly. There was so much material to cover, it was sort of impossible to keep your thoughts collected without keeping sort of a running tab of issues that became apparent as different speakers or written material was provided to the task force.'",
        "'speaker_8': 'And at the time that we created this task force in February of 2015, we had not yet received from the city staff data and information that came to council and through the task force in the form of two memorandum provided by various departments in the city.'",
        "'speaker_8': 'Is that correct?'",
        "'speaker_12': 'That's correct. And I think we did receive the task force did receive the second memorandum approximately June 4th.'",
        "'speaker_8': 'And so the task force, where they provided copies of the information that we were receiving in terms of fiscal impacts, regulatory impacts, those kinds of things. Were they updated with that information?'",
        "'speaker_12': 'Both of the memos that the city management prepared were provided to the task force as soon as, you know, at the next meeting after the document became public.'",
        "'speaker_8': 'Okay. My concern with this item and I think I, I understand where it's coming from and I appreciate the intent behind it, which is to to move the process along. And I completely get that. I understand it. I, I respect that position.'",
        "'speaker_8': 'Certainly nobody wants and I'm sure the members of the task force would be the first to say they don't want to serve an indeterminate term on this task force, that they're hoping that it comes to an end at some point.'",
        "'speaker_8': 'So I appreciate the intent behind it, but I believe that getting involved at this juncture, when the task force has one final meeting set that they're hoping, well, they had two meetings. One was canceled as a result of the power outage, but that they have a date certain on their calendars.'",
        "'speaker_8': 'These are citizens in our community who have active lives, who have families, who have things, who have these dates on their calendars. I know for a fact that at least one member of this task force has rearranged their family schedule, vacation schedule in order to be at this meeting that they had contemplated to be the last and'",
        "'speaker_8': 'final meeting. I think it sets a bad precedent for us to get involved and basically call a list of items that they've put together, recommendations and call it a day. I think it sets a bad precedent for our future engagement of the community in terms of citizen advisory commissions.'",
        "'speaker_8': 'I think Citizen Advisory Commissions can be a very helpful tool because these people serve their time to weed through the data and figure out exactly no pun intended there. Figure out exactly what it is that they think are best for their best recommendations for their cities as as residents of the city.'",
        "'speaker_8': 'And we rely on them. So, you know, this the the medical cannabis task force that we created has been working on this for months. I believe it's only fair that the process continue or at the very least, each task force member be provided an outlet where they can contribute their thoughts and a final meeting or a final'",
        "'speaker_8': 'to meetings. The recommendations provided have not been voted on. They are simply a list and the task force members do not feel that these tentative recommendations are representative of everyone's views. In fact, if you look at the list, there's a recommendation on there that the city's current ban continue and another one that says we should wait until'",
        "'speaker_8': '2016 to see where the initiative process goes. And then there are actual land use recommendations. So the the list isn't even consistent in terms of its theme or its direction to council. This is a very controversial topic and the task members varying recommendations are a testament to that.'",
        "'speaker_8': 'If we receive and file the recommendations today, we will be shutting down the task force without even giving them an opportunity to share some closing thoughts and viewpoints with one another. They are a committee that has been working collectively, hand in hand to the best extent to that, to the extent that they can to do service for'",
        "'speaker_8': 'us. And I think it would set a very bad tone if we were to end that service without at least giving them an opportunity to close the process in the way that they deem fit within their dynamics. So I think you guys, my my colleagues for listening and I urge you to vote against this in the spirit'",
        "'speaker_8': 'of the future commissions and task force that we're going to create and and request the assistance of our colleagues and our residents to help us move forward. So thank you.'",
        "'speaker_0': 'Thank you. Can I get one clarifying question? Because, I mean, I thought that I understood the need to start to consider your anger. The item in front of us wouldn't preclude the the committee from having another meeting that I think they're going to have still in July.'",
        "'speaker_0': 'Is that is that correct?'",
        "'speaker_12': 'The next meeting is presently scheduled for the 29th. There's nothing on the agenda item that would, if it were passed, would disband the committee directly. The the only I think the thing that needs to be avoided is doing something that causes confusion in the community, in the sense that if the community believes that these are recommendations, and'",
        "'speaker_12': 'I think clearly they are not at this point recommendations that would cause some confusion either now or later when this is ultimately addressed by council.'",
        "'speaker_0': 'And I would because I think I know and I understand having had a few conversations. I understand the the both the urgency and the need to allow the the committee to try to have an opportunity to come together and give either recommendations or some type of some type of ideas to the council.'",
        "'speaker_0': 'So I just wanted to ask Councilmember Turanga, was it your intention to have the committee have at least one other meeting but then still have the recommendations come the council soon after that? I understand that was your original intent.'",
        "'speaker_6': 'That is my intent. And in fact, they could have had a meeting because it was a meeting that was canceled. So if the task force had already identified a a date when they were going to conclude their work and that was the 29th, then fine.'",
        "'speaker_6': 'They can they can make up that meeting that they lost because of the outage. And so they can have another another meeting or two if they so wish to have it, and then bring it back as recommendations in August.'",
        "'speaker_0': 'So I think I think setting a time certain of having this come back to the council in August would give the flexibility to staff to schedule that in August. And that way we obviously have a variety of meetings in August, but we would be able to schedule that with the rest of the calendar so that at least'",
        "'speaker_0': 'both the community and the task force know that that their you know, if the maker wants to craft the motion this way, that their work is coming to the council in August for the council to actually deliberate. So I don't know if I want to make that motion, maybe a little if you're willing to accept that.'",
        "'speaker_6': 'I accept that as a motion.'",
        "'speaker_0': 'Okay. So the motion with the slight friendly is to receive and file these recommendations that would come to council in August. But there's still going to be conversations and other recommendations are going to come forward, I'm assuming, if this group meets again.'",
        "'speaker_0': 'So at least that's where it's at right now. And we'll see where where the council is on that. Councilwoman Mongo.'",
        "'speaker_5': 'Thank you. I, too, want to thank the city staff, specifically the city clerk's office and Mike Mayes for the work that they've done on this. And the commissioners are the committee members that we've each appointed. I have been thoroughly impressed with the depth and the breadth of knowledge that they have digested in such a short period of'",
        "'speaker_5': 'time and the types of discussions that they've had and the considerable thought that has gone into this. And I do not want to delay. I want the citizens who have volunteered their time to be appreciated and have closure.'",
        "'speaker_5': 'And I want to thank my task force members for having done an excellent job. I would, however, state that considering and I don't have a August vacation. And so I hope that people take this as a genuine desire for all of my colleagues to be present for the discussion.'",
        "'speaker_5': 'And I know that in August we have council members who are going to be absent from certain meetings. We actually have two August council meetings because through a motion from Councilmember Richardson, myself and Leanna, we are celebrating neighborhood night out in our communities for citizen engagement and we are dark the last Tuesday of the month.'",
        "'speaker_5': 'So I would only ask the council member to make a date certain of September 4th, the first meeting in September. The first meeting that we know all council members are present. And again, I mentioned this is not for myself.'",
        "'speaker_5': 'I am not. It's September 1st. Thank you. I am not taking a vacation. But I do feel it is important that every councilmember be here, you know? Right. September one. Wonderful. Thank you. I appreciate it.'",
        "'speaker_0': 'Just let's be very clear.'",
        "'speaker_6': 'So our last meeting in August.'",
        "'speaker_0': 'I think right now. Right now, the friendly ask from Councilman Bongo was to actually set a date, which was September 1st. First. And I think right now, as it stands, Councilmember Urunga has said by the end of August, which is different.'",
        "'speaker_0': 'And so I think it sounds like you're sticking with your initial last, which would be the last available meeting in August. Okay, so that's the motion on the floor. Councilmember, your Enga.'",
        "'speaker_6': 'It gives. I'm sticking to my motion the end of August, which is the same. If you go to September 1st, it gives another two weeks. So it gets extended even two weeks even further. So I can't I can't accept that that that amendment, because it just prolongs it even more.'",
        "'speaker_6': 'So let's let's get done with this task force.'",
        "'speaker_0': 'Okay. So the motion is, is for the end of August. Councilwoman Pryce, or did you just go or was that.'",
        "'speaker_5': 'No, I still have the floor.'",
        "'speaker_0': 'Sorry. Cleared out. Let me go back to Councilman Mongo.'",
        "'speaker_5': 'Thank you. I'd like to make a substitute motion that we have a date certain of September 1st so that all council colleagues can be a part of this very important decision impacting all residents of the city of Long Beach.'",
        "'speaker_0': 'So there is a substitute. I think it's a substitute. Substitute motion, right. Or is it just a substitute? Okay. That's just a substitute motion to have the date certain for September the first that it would come to the council.'",
        "'speaker_0': 'And I'm assuming and let me ask this question to Mr. Mays on the date that the recommendations will come to council. Would the council be able to make any policy decisions that date? Would it be agendas for policy decisions?'",
        "'speaker_12': 'Well, it depends on how it was agenda is actually but in theory you could we have a draft ordinance that was prepared at the direction of the planning commission. You could use that as a starting point and you could go through there the task force recommendations and vote to, for instance, include certain things in a draft ordinance'",
        "'speaker_12': '. But we would have to bring a draft ordinance ordinance, an amended draft ordinance back to you eventually anyway. That.'",
        "'speaker_0': 'But. But the council could give you policy direction at that meeting. Absolutely. We'd like you to do X, Y or Z. Okay. Yes. All right. Okay. So the subject of motion is September the fourth. It first. I'm sorry.'",
        "'speaker_0': 'September 1st. Councilwoman Price.'",
        "'speaker_8': 'Thank you. I want to thank my colleague, Councilwoman Mango, for requesting the September 1st date. First of all, we're going to be going through some pretty heavy budget discussions in all of August. And realistically, given the study sessions that we have and the PSC meetings that will be there, I think this is an item that I understand'",
        "'speaker_8': 'two weeks seems like an eternity, but I think that it's important that we give the the the subject, the weight and time that it deserves. I would be requesting first of all, I have an issue with the wording of item 34 because I believe that legally the term recommendation is inaccurate.'",
        "'speaker_8': 'And so I don't believe that item 34 is legally accurate as it's currently worded. So, Mr. Mays, do you have any concern with the use of the term recommendations?'",
        "'speaker_12': 'I'm not sure I could say it was legally inaccurate, but it is inaccurate as a reflection of where the task force is. So it is it is not an accurate reflection of the task force because they, in fact, have not made recommendations to this council.'",
        "'speaker_12': 'It is a list of topics to be voted on in the future.'",
        "'speaker_8': 'Okay. So, you know, I think that that we may want to correct the wording there if that's important to any of my colleagues. The second is point that I'd like to make is in February when we voted on this, I voted against it because we put forth a timeframe for this task force that was.'",
        "'speaker_5': 'Completely.'",
        "'speaker_8': 'Unrealistic. And that's why I was the sole vote against the the item, because the task force that we created, we had a very short turnaround for them. And yet we were asking city staff to come back with financial data, regulatory data, land use data, public safety data, and still expecting the task force to come back.'",
        "'speaker_8': 'And at a specific period of time, that was not realistic given what we had asked city staff to provide in terms of data. So I understand that we we believe that there are folks who are here in the audience who deserve a swift resolution of this issue.'",
        "'speaker_8': 'I get that. But I also want us to be cognizant of the fact that our burden in regards to this item grew, as did the work for staff and the workforce for the the workload for the Commission. So we have to be realistic of that.'",
        "'speaker_8': 'I understand we want to rush it along. I would request of my council colleagues and I cannot imagine a scenario where my colleagues wouldn't go along with this request, is that I'm going to be out of the country on August 18th.'",
        "'speaker_8': 'I've communicated that to my colleagues on the BSE and and for whatever reason, it seems important to at least one of my colleagues here to have the meeting on that night. This is an issue that's very important for our city.'",
        "'speaker_8': 'I was in Washington, DC testifying before the National Highway Traffic Administration last week as a subject matter expert on the issue of of medical marijuana and marijuana in general in regards to traffic safety. It's an issue that I've been very involved in.'",
        "'speaker_8': 'And if my council colleagues feel that it's important to have all of us here for issues that have affect our city, that applies to all of us equally. So I just I really don't even think that that's a subject of debate.'",
        "'speaker_8': 'I'm asking my colleagues for some consideration. So.'",
        "'speaker_0': 'Thank you. And I know I will say that I know one major on major issues that have come before the council, including this one in the past, there has there has been deference to ensuring that you do have a full body.'",
        "'speaker_0': 'And so just to make that note, Council Member Austin.'",
        "'speaker_9': 'Okay. It just seems to me that we're quarreling over a week or two and and if if it will generate consensus here to to to get us and get the ball rolling. I think it's not really worth the fight.'",
        "'speaker_9': 'I will support the motion in front of us right now to move this to the September 1st. That makes a lot of sense. I'd like to have some time to debrief with my my appointees on the task force.'",
        "'speaker_9': 'And a lot has been said about it has been brought up already. We are going into a budget season. Time is going to be very, very limited. And so with this issue, it is a complicated issue. Clearly, there isn't a lot of consensus even on the task force or agreement on the task force on much of these'",
        "'speaker_9': 'issues. There's no reason to believe that this council is going to get there either. But I'm willing to take that on in September. That's it. I thought you brought up Councilmember Price, brought up the timeline for the task force, and I was going to ask the question.'",
        "'speaker_9': 'But did we ever establish. I don't recall that. But was there a specified timeline for the task force to actually work?'",
        "'speaker_12': 'I think originally there was a timeline. I don't recall exactly what it was early on in the process. The task force asked that we send a two from four memo to the council indicating that because of the complexity of the issues and the number of speakers that they wanted to engage to inform themselves about the entire topic'",
        "'speaker_12': ', that it wouldn't be possible. That said, there were some weeks where they met, you know, every week, most often because of their schedules. There were so many on there. They met every other week. So they have been working hard.'",
        "'speaker_12': 'Each meeting was, I would say, at least 3 hours if not 4 hours long. So they have been putting a lot of time into it.'",
        "'speaker_9': 'Thank you. Well, I think we do need to figure out how to to recognize the efforts of these citizens who've been putting a lot of time in to to assist this council in our decision making. I also just want to go back to the word recommendation, because the item is a recommendation to receive and file a list'",
        "'speaker_9': 'of the recommendations compiled by the Medical Cannabis Task Force for the next council meeting. But when I go back to the agenda, I look at the agenda of the actual medical cannabis task force. There. One, two, three. Everything starts with the recommendation.'",
        "'speaker_9': 'And how do we. How do we. How do we separate that from. From. Mr. Mays, how do we separate that from not sending the wrong message?'",
        "'speaker_12': 'Maybe the correct motion would be to receive and file the list of topics contained in tonight's agenda item rather than refer to them as recommendations. And again, I if I could ask. I will ask the clerk who's been attending the meetings if I'm mischaracterizing it in any way.'",
        "'speaker_12': 'It was always my understanding that we were compiling a list of topics and that. Starting well last week that they were going to vote on those topics and formalize recommendations that would come back. Is that correct?'",
        "'speaker_1': 'That's correct.'",
        "'speaker_9': 'Okay. So. I guess the the for the the I guess the motion on the floor would it be in order to offer a friendly amendment amendment to to to characterize it as the city attorney has?'",
        "'speaker_5': 'I believe that is absolutely necessary. Thank you. Absolutely. All right. Thank you, Mr. Mayes. Thank you, Councilmember Alston.'",
        "'speaker_0': 'And I think I know. I'd like to add that I think that comes from your anger and I know this is an item that he brought forward, I think is amenable to just accepting the September 1st date as a as a friendly amendment just to bring consensus and move on here.'",
        "'speaker_0': 'So if I don't know if the if the maker of the substitute motion would be willing to essentially let the councilmember set the September 4th date with the change of the wording of the recommendation September 1st date, we're okay with that.'",
        "'speaker_0': 'It would be essentially the same. The same motion. Yeah. Okay. That way he has still his item that he's moving forward. So. Okay. So there's a motion on the floor which is contrary. Ringo's which is to September 1st have have the the issue come back.'",
        "'speaker_0': 'By then, the the committee obviously will have met before that. And we're changing the wording of the word recommendation. Let's you know, we have still a long agenda in front of us. I'm going to keep going through the speakers list by Samir Lowenthal.'",
        "'speaker_3': 'Thank you. Just quickly on the word change of the list of recommendations. What was the word that he changed it to Mr. Mays? Because all of.'",
        "'speaker_2': 'Mr. Mays.'",
        "'speaker_3': 'All of their minutes referred to them as tentative recommendations.'",
        "'speaker_12': 'A list of topics of topics.'",
        "'speaker_3': 'Okay.'",
        "'speaker_12': 'Is what I indicated. Maybe somebody has a better word, but that's really what it is.'",
        "'speaker_3': 'That's fine. That's fine. That's why I'm thinking. Mr. Mayor.'",
        "'speaker_0': 'Councilman, your income.'",
        "'speaker_6': 'Let's get some clarification here. What was sent to us. In its present form, says recommendations. Obviously it was mischaracterized because it should have been sent to me as topics. So my motion here was based on what I received.'",
        "'speaker_6': 'So that's a mischaracterization. Not my problem. I didn't do it.'",
        "'speaker_2': 'I didn't do it.'",
        "'speaker_6': 'So what's happening on September 1st then is still the same. I want recommendations on September 1st, not topics. So if there's a change that needs to take place here is to correct this, um, memo that says recommendations and revise it to say topics.'",
        "'speaker_6': 'But my recommendation to come back on September 1st is still to come back with recommendations. So that's the st that stays. Is that correct?'",
        "'speaker_0': 'Yeah, I think that's correct, Mr. MAIZES. Yes.'",
        "'speaker_2': 'Okay.'",
        "'speaker_6': 'That's correct.'",
        "'speaker_0': 'That's excellent. Counselor Richardson. And then we're going to hopefully vote.'",
        "'speaker_7': 'Yes to hopefully, hopefully vote. I just want to say how how pleased I am to see after all that discussion, we've landed on the same thing. And I just also want to say I also want to say that there's only two meetings in August, and the 18th is my birthday.'",
        "'speaker_7': 'So give me a break. Let me repeat.'",
        "'speaker_2': 'This, man.'",
        "'speaker_7': 'So, come on. I want to be here till midnight on the 18th.'",
        "'speaker_3': 'September 1st.'",
        "'speaker_2': 'I know. That's why. Okay.'",
        "'speaker_0': 'Here we go. So next up, a have public comment. Is there any public comment on the item? Please come forward and we're going to go to a vote.'",
        "'speaker_2': 'Good evening. I'm Jack Smith. I live at 50 Elm Avenue in the second District in the East Village. I was pleased to be appointed to Vice Mayor Cecil Lowenthal to the task force. We've been working on this a long time.'",
        "'speaker_2': 'A couple of quick answers. We always creating a list called tentative recommendations. And we were very, very, very careful every step of the way to make sure those were tentative recommendations with the idea that would be going through those tentative list, that tentative list, and then finalizing those.'",
        "'speaker_2': 'The document you're considering this evening is not a report. It is the agenda for the July 15th meeting at which we were going to be taking up a number. The full list of tentative recommendations. Now, at the July 1st meeting, there were three recommendations that were approved.'",
        "'speaker_2': 'They are not on this agenda because they're in the minutes of the July 1st meeting. So this list that you are looking at is not a complete list of all of the tentative recommendations because three of them were actually approved.'",
        "'speaker_2': 'Those three were to be approved. I mean, they were voted on and majority one to review unequal cultivation sites through long throughout Long Beach, you create equal sites in each district. The businesses cultivating and sales would be allowed in any location, not zoned as residential and not within specified buffers.'",
        "'speaker_2': 'And three, there be a maximum of three collectives per district. Now the minutes of July of the July meeting may have a slightly different wording for that, but that's what was that's essentially what it was. At this point, I guess it's possible that it's irrelevant whether they are finalized.'",
        "'speaker_2': 'I mean, what you're what the motion is asking to do is even file a document that is not finished. If you were to set a date certain for us to finish our work, that makes sense. But it makes no sense at all for you to get this list of tentative recommendations in any way thinking that this is'",
        "'speaker_2': 'what how the task force stands. Now, just because I'm here, I'll give you my list of tentative recommendations to eliminate print advertising, the amount of crime be considered in the areas where the business is applying to locate maintain 1000 foot buffers between the businesses and no two businesses can occupy the same site.'",
        "'speaker_2': 'All applicants pass a complete background check. May I see my clock, please? Applicant City residents of Long Beach for two years prior to the approval of the copy, the transfer of ownership not be permitted. Any change of ownership requires a copy testing be done by a third party qualified lab safety standards on the ordinance to be the'",
        "'speaker_2': 'minimum state's safety standards. At a discussion of the location of edible production and an annual regulatory fee assessment, be on it and specify an application fee. My I would expect there's about 850 applications that we'll expect to have to process for this.'",
        "'speaker_2': 'So. Because of my first comments. I don't get the race. But remember that what you're reading now is a list of items that each person on the task force put forth. Without discussion of the task force. They were tentative list anything item could be put on there.'",
        "'speaker_2': 'Only three were approved. I would suggest that you have got to even file. You just set the date certain. Thank you.'",
        "'speaker_0': 'Very much. Next week, please.'",
        "'speaker_2': 'My name's sophomores and so I'm a resident of the second district and I actually used to work for you guys. I'll be very brief because I know you all are very exhausted. This has gone one way too long.'",
        "'speaker_2': 'And I'll just say this. You've run out of time. You've had since 1996 to pass a workable ordinance, and you've had seven years since. It's been a primary issue within the city of Long Beach. Three of them, four of them, members of this body have been here through the entirety of their entire terms, dealing with this one'",
        "'speaker_2': 'specific issue. And what has changed? Nothing. The law is mostly the same on the state level. You guys have waited entirely too long to be able to pass on that to be workable for this entire community. You shifted the burden on to this task force, which has also come to the same conclusions, which is there's a lot'",
        "'speaker_2': 'of disagreement about this issue. Every time this has gone before, the people, the city of Long Beach in a ballot initiative, it has passed in dramatic numbers. And if you fail to do something that actually serves the community by either pushing this off or accepting the city manager's proposal, which is an unworkable, basically lawsuit bomb, then what'",
        "'speaker_2': 'you'll see is an either another ballot initiative or you're going to see every single piece of your work preempted by state or federal government. Once they actually manage to pass something. So please don't delay this any longer. Either set it, either follow a jack as recommended, set a date certain receive and file these with these preliminary findings'",
        "'speaker_2': 'that you have right now and do your job as legislators and pass something to benefit the community. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please look to the last speaker and then we'll go to the vote. Oh, we have another speaker play, please, with two more and then last two speakers. Please someone.'",
        "'speaker_2': 'Defer. Jeff Abrams I defer to Adam because Adam Hejazi has direct knowledge of being a member of the task force. But I would just like to ask you, council members, to consider the fact that I don't know that it's a topic continue the ban.'",
        "'speaker_2': 'I don't know. That's a topic per se. I think that's a recommendation, and that is something that you're going to see in this list, which talks about hours of operation and security concerns and ban it at the same time.'",
        "'speaker_2': 'That doesn't seem to be a qualified consensus from a task force. It seems like people saying yes and people saying no. Frankly, the conversations devolved into medical marijuana. Yes or no? In a lot of cases. And I found that pretty appalling, given that the science is very clear now.'",
        "'speaker_2': 'And we have to remove the mindset of 1915, 1916, 1917, 1980, 1990. Because every day you're looking at the same information. If you read newspapers and if you read magazines, you listen to the radio, watch TV. You're listening to the same stuff that I am.'",
        "'speaker_2': 'And that is the L.A. Times. About two weeks ago, the staggering suicide rate of veterans, the staggering 22 per day. Could they be helped by medical marijuana? Possibly. Who knows? But at this point in time, you certainly can't get it in Long Beach and certainly not in a in a manner that's what I call safe and dignified'",
        "'speaker_2': '. Our veterans who are struggling are already made to feel criminal in trying to secure the product, procure the product. I spoke to Chief Luna directly at a town hall meeting not too long ago because I did want to ask him about all of the negative interactions that vets will have with the Long Beach Police Department.'",
        "'speaker_2': 'And these are the same fellows and ladies. Six times more women are killing themselves than the national average. I just asked him, how are we going to mitigate all these negative interactions with vets? These a lot of these fellows are homeless.'",
        "'speaker_2': 'It's a sad situation in Long Beach. And I do believe that the veterans, aside from M.S. and ALS and IBS and Crohn's and a whole malady, a group of malady that are just horrifying. This is an un-American effort to deny veterans who are suffering with PTSD.'",
        "'speaker_2': 'A naturally occurring herbal medicine that has been used for thousands of years. When I tell you that Queen Victoria used this for PMS, I plead. I ask you to Google it. I learned many, many years ago, 40 years ago in Jamaica that this is a cure all for so many things.'",
        "'speaker_2': 'And the fact is true, Western medicine uses a pill. They prefer herbs. Thank you so much.'",
        "'speaker_0': 'Thank you. Next, our final speaker. We're going to vote.'",
        "'speaker_2': 'Good evening, Honorable Mayor. City Council. My name is Adam Hijazi and I'm a task force member. First off, I wanted to thank Vice Mayor Lowenthal for her appointments. Second of all, I wanted to thank all the council members for having this process and deliberating with a wide spectrum.'",
        "'speaker_6': 'Of individuals that have different concerns. And honestly, it's been a educational process.'",
        "'speaker_2': 'Being a previous legal.'",
        "'speaker_6': 'Operator and just learning a lot from different.'",
        "'speaker_2': 'Aspects that have come up. So also I wanted to thank the.'",
        "'speaker_6': 'City attorney's office.'",
        "'speaker_11': 'And the city clerk's.'",
        "'speaker_6': 'Office. It was another educational figuring out.'",
        "'speaker_2': 'Robert's Rules of Audit. And I also want to thank Jack Smith because he pointed a lot of that out to.'",
        "'speaker_6': 'During that process.'",
        "'speaker_2': 'Hopefully, we're we're happy to see some sort of date that come into.'",
        "'speaker_6': 'Place that September 1st will.'",
        "'speaker_2': 'Actually come in and.'",
        "'speaker_6': 'Recommendations. And we look forward as.'",
        "'speaker_2': 'A task force to provide those recommendations to you on that date. And, you know.'",
        "'speaker_6': 'Just one last thing.'",
        "'speaker_2': 'To consider is that the urgency.'",
        "'speaker_6': 'From among a lot of reasons.'",
        "'speaker_2': 'Is.'",
        "'speaker_6': 'To has it been safe access in Long Beach for the last three years. And hopefully we can bring back safe access to these patients.'",
        "'speaker_2': 'And a model that can actually work and will be a model for up and down the state.'",
        "'speaker_6': 'A lot of people are looking towards Long Beach, other cities, not just individuals. So I wanted to thank you guys very much for the opportunity.'",
        "'speaker_2': 'And have a good night.'",
        "'speaker_0': 'Thank you. I have I have one more final council comment, which is Councilman Price.'",
        "'speaker_8': 'Thank you. After hearing public comment, I'd like to make a substitute substitute motion. I am moved by the comments of resident Jack Smith. So I would like to recommend that simply this that the medical marijuana task force complete their service to the city of Long Beach by August 21st, 2015, in order to provide time for council to'",
        "'speaker_8': 'debrief with the members and have it on their September 1st council agenda. My recommend, my my substitute motion includes just the time certain for the completion of the task force. It does not include adopting or receiving and filing any topics, recommendations, suggestions, tentatives, anything like that.'",
        "'speaker_8': 'Because after hearing from Jack, it seems to me that there may be some recommendations that aren't even included in this list, and I don't want to receive and file and bring anything into our record that doesn't represent any official actions by the task force, because I really don't know what the benefit to the city would be of'",
        "'speaker_8': 'receiving and filing and bringing it into the record. So my substitute substitute is complete their service by August 21st, 2015, in time for it to come back to council on September 1st for policy action.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'There's a motion and a second, Vice Mayor Lowenthal.'",
        "'speaker_3': 'So, Mr. Mayor, I'm not quite certain how that is in the spirit of Councilmember your anger's motion different, or that had it been offered to him, he would not be amenable to that. I think we have a long history on this council with this issue and.'",
        "'speaker_3': 'Jack Smith, who is my appointee, has forwarded the remainder of the recommended the list of topics for consideration. I believe it's part of the record. And so I in the spirit of collegiality, I would urge the maker of the motion and the secondary of the motion to offer that to member your UNGA.'",
        "'speaker_3': 'Because I don't believe in the course of our conversation that I witnessed any disagreement there.'",
        "'speaker_0': 'Sure I.'",
        "'speaker_2': 'Shall. To impress?'",
        "'speaker_8': 'Absolutely. I'd offer a friendly to Councilman Urunga to agree to set the time, the date certain, but to not receive and file any documentation from the task force.'",
        "'speaker_6': 'September 1st is the date that I think I put forward, and that's the date that I would want to receive the recommendations if it is appropriate to direct the task force to finish its work on August. 21st, 21st, and that's fine with me.'",
        "'speaker_8': 'But are you amenable to the part about not receiving and filing this document that was mischaracterized? Apparently, I mean, clearly to you.'",
        "'speaker_6': 'So, yeah, it was mischaracterized. Yeah. But at the same time, it was also you know, I was also informed that it would be part of the part of that record anyway, so it could go either way.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'Would you be amenable then to not receiving and filing it in this body, knowing that it's a part of the official record for that body? Okay. Thank you.'",
        "'speaker_0': 'Okay. So the there is no substitute substitute on that. Councilman Andrews.'",
        "'speaker_10': 'Yes. I would like to ask one question. I'd like to know what the other. Well, we have another individual who's who's on the task force. What was his decision on that? We have two people on the task force.'",
        "'speaker_10': 'Then in the soup.'",
        "'speaker_2': 'So what would.'",
        "'speaker_10': 'I would like to get, you know, both.'",
        "'speaker_0': 'So I think they had.'",
        "'speaker_10': 'Because this is just we can't just take one person's word for it. We got two people on a task force.'",
        "'speaker_2': 'Yeah. Well.'",
        "'speaker_0': 'Yeah, they're going to come on. So I think we had public comment and you know, they weren't they didn't speak. So what we have right now is a motion on the floor. And and I actually think and I heard from Rank City attorney that, uh, Councilman Fresh's motion would have been a substitute motion.'",
        "'speaker_12': 'That is correct, because the.'",
        "'speaker_0': 'Okay, so there is there right now there is nothing but a main motion on the floor.'",
        "'speaker_2': 'Correct.'",
        "'speaker_0': 'Just Councilmember your rank is motion.'",
        "'speaker_2': 'Correct.'",
        "'speaker_0': 'So that is queued up right now. Please cast your votes. A councilmember during his motion is for this to come back on September the first for the committee to complete its work on August the 21st first. And that recommendations would come at that time to the Council for Policy decision upon.'",
        "'speaker_12': 'September.'",
        "'speaker_0': '1st. Okay. Thank you.'",
        "'speaker_3': 'And Mr. Mayor, we're not receiving and following the recommendations. I think there's little.'",
        "'speaker_0': 'That's correct. That is correct.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Councilwoman Pryce. Thank you. Motion carries nine zero.'",
        "'speaker_0': 'September 1st. It is moving on to the next item.'",
        "'speaker_2': 'You can. You can. Yeah. It s at me. I can. We just people.'",
        "'speaker_3': 'Right, Madam Clerk.'"
    ],
    "Fiscal Year 2015 Second Budget Appropriation Adjustments. (Citywide)": [
        "'speaker_1': 'Item number 22 Report for Financial Management Recommendation to approve the Fiscal Year 2015. Second Departmental and Fund Budget Appropriation Adjustment Citywide.'",
        "'speaker_3': 'There's been a motion by Councilmember Mongeau and a second yet. I got it. Okay. Councilwoman Mango, would you like to speak to your motion?'",
        "'speaker_5': 'Is there stuff?'",
        "'speaker_3': 'There is a staff report. Mr. West, the Ericsson.'",
        "'speaker_5': 'Good evening, Vice Mayor and City Council. This is the second department and Fund Budget Appropriation Adjustment Report for a fiscal year 15. This reflects changes in revenue or operating operating conditions that require appropriation adjustments. In many cases, this is the result of past City Council actions that require appropriations now or grant revenue that has been awarded to'",
        "'speaker_5': 'larger items. To mention in this report includes appropriating 18.7 million in order to fund the Highland Reprioritization of projects which city council already approved. Also, another large item is appropriating the 59.9 million for the Alimentos Bay Marina bond proceeds.'",
        "'speaker_5': 'There are also three items in the general fund. However, none impact the bottom line funds available as they are offset by reductions or transfers in other areas. This concludes the staff report and department representatives are available for any questions that you may have.'",
        "'speaker_3': 'Thank you, Miss Erickson. Councilmember Mongo.'",
        "'speaker_5': 'Thank you for bringing forward a balanced recommendation. I hope my colleagues will support the item that Lia has so eloquently presented.'",
        "'speaker_3': 'Councilman Andrews.'",
        "'speaker_2': 'No, I didn't.'",
        "'speaker_3': 'Oh, it says. Request to speak. Okay. No problem. Thank you. I want to know, is there any member of the public that wishes to address Council on item 22? Seeing None. Members Cast your vote.'"
    ],
    "Contracts for As-Needed Professional Compliance Monitoring Services.": [
        "'speaker_1': 'Motion carries nine zero. Item 23 Report from Financial Management Recommendation to award six contracts for as needed professional compliance monitoring services and an aggregate annual amount not to exceed 600,000 citywide.'",
        "'speaker_3': 'This motion and a second two staff report.'",
        "'speaker_2': 'Leah ERICKSEN.'",
        "'speaker_5': 'Um, good evening, Mayor and Vice Mayor and City Council. City Council approval is requested to enter into multiple contracts for as needed compliance monitoring services. We've selected six vendors to provide federal and state required Labor contract compliance monitoring for city projects.'",
        "'speaker_5': 'The contracts are on an as needed basis for approved projects, and costs will be included within those project budgets. This concludes my staff report and I'm available for any questions.'",
        "'speaker_3': 'Thank you. To the maker and seconder of the motion. Wish to speak to the item.'",
        "'speaker_2': 'No. Oh.'",
        "'speaker_3': 'Okay. Is there any member of the public that wishes to address Council on item 23? Seeing none. Members. Cast your vote.'",
        "'speaker_1': 'Your anger.'",
        "'speaker_3': 'Councilmember Young.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Item 24.'"
    ],
    "Equipment Lease-Purchase Agreement for Advanced Metering Infrastructure Project.": [
        "'speaker_1': 'Report from financial management in Long Beach. Gas and Oil. Recommendation to execute and equipment lease purchase agreement with Bank of America Public Capital Corporation for the financing of the Advanced Metering Infrastructure Project in an amount not to exceed 18,500,000 citywide.'",
        "'speaker_3': 'Submission. Second is a staff report.'",
        "'speaker_2': 'Chris Garner and Dave Nakamoto. Good evening.'",
        "'speaker_10': 'A year ago, the city council approved our going forward with a smart meter program for the gas utility. And so what's before you tonight is the financing mechanism for that effort. With this financing, it'll be the question is how will it be paid for?'",
        "'speaker_10': 'And it will be.'",
        "'speaker_9': 'Paid for.'",
        "'speaker_10': 'Using the annual cost savings that we will achieve by eliminating our manual.'",
        "'speaker_2': 'Manual gas meter.'",
        "'speaker_9': 'Reading.'",
        "'speaker_2': 'Contract.'",
        "'speaker_3': 'Thank you. Is there any public comment on the item? CNN members cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Hey.'"
    ],
    "Authorization to Execute Agreement with CDPH for Women, Infants and Children Nutrition Supplement Program.": [
        "'speaker_1': 'Item 25 Report from Health and Human Services. Recommendation to execute all necessary documents with the State of California Department of Public Health in the amount of $19,337,101 for Women, Infants and Children Nutrition Supplement Program Citywide.'",
        "'speaker_3': 'Thank you. Is the motion in a second. Is there a staff report?'",
        "'speaker_2': 'Dr. Mitch Kershner. This is a continuation of a grant since 1974 to provide nutrition services to women, infants and children. We serve approximately 25,000 clients a month. This is a continuation of our grant. It's a four year term.'",
        "'speaker_3': 'Thank you. So any public comment on the item? Seeing none. Members cast your vote. Dr. Farber, you may be the only member of the public left.'",
        "'speaker_1': 'Motion carries nine zero.'"
    ],
    "Agreement with State Department of Health Services for HIV/AIDS Preventive Health Services.": [
        "'speaker_3': 'Goodman Item 26.'",
        "'speaker_1': 'Report from Health and Human Services. Recommendation to execute agreement with the State Department of Health Services in the amount of 1,000,205. $205,944 for the provision of HIV prevention health services citywide.'",
        "'speaker_3': 'Thank you. There's a motion and second staff report.'",
        "'speaker_2': 'Our health officer, Dr. Mitch Kershner. Grant. I'm sorry. Now you can hear me. This is a continuation of our HIV prevention grant from the state since 1988. It's a two year term. It serves 5000 residents living in the city of Long Beach with HIV.'",
        "'speaker_2': 'It continues our testing and treatment of all residents with HIV.'",
        "'speaker_3': 'Thank you. Is there any public comment on the item? CNN members cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Item 27.'"
    ],
    "Authorization to Accept WIOA Funds and Execute Agreements for Harbor Gateway WorkSource Center.": [
        "'speaker_1': 'Report from Human Resources recommendation to execute all necessary documents with the City of Los Angeles to accept Workforce Innovation and Investment Act funds totaling 1,075,000. To continue operations of the Harbor Gateway Work Source Center citywide.'",
        "'speaker_3': 'There's a motion in a second staff report, please.'",
        "'speaker_11': 'Executive director of our Workforce.'",
        "'speaker_6': 'Investment Board, Nick Schulz.'",
        "'speaker_3': 'Microphone, please.'",
        "'speaker_2': 'Muted. It's late. I'm sorry. Madam Vice Mayor remembers the City Council.'",
        "'speaker_10': 'This is our fifth.'",
        "'speaker_2': 'Year in a contractual.'",
        "'speaker_6': 'Relationship with the City of Los.'",
        "'speaker_2': 'Angeles and its Workforce Investment Board to operate.'",
        "'speaker_6': 'Our San Pedro based Harbor Gateway work to our center on behalf of the L.A. community. We serve the surrounding L.A. Harbor area under contract to.'",
        "'speaker_2': 'The city of Los Angeles, which helps us to bridge regional employment opportunities in that harbor area and the Twin Ports.'",
        "'speaker_3': 'Thank you. And you haven't seen late yet, sir. There's a motion in a second. Is there any public comment? CNN members cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Wonderful item 28.'",
        "'speaker_1': 'Report from Long Beach Gas and Oil and Financial Management Recommendation to adopt resolutions authorizing the city manager to execute contracts for gas meters and other services and parts without advertising for bids in an aggregate amount not to exceed 350,000 per year citywide.'"
    ],
    "Agreements with Long Beach Unified School District for After School Education and Safety Program.": [
        "'speaker_1': 'Report from Parks, Recreation and Marine. Recommendation to execute agreements with the Long Beach Unified School District for the operation of the After School Education and Safety Program. Authorize the required 15% in-kind match of 270 207,929 and increase appropriations in the General Grants Fund in the Parks, Recreation and Marine Department by 1,000,100.'",
        "'speaker_1': '$1,102,544. District 124679.'",
        "'speaker_3': 'Thank you, Madam Clerk. There's been a motion by Councilmember Richardson and a second by me, Mr. West.'",
        "'speaker_2': 'Acting director Steve Scott and Gladys Kaiser, Vice Mayor, members of the City Council.'",
        "'speaker_6': 'The item before you tonight is to execute agreements with the Long Beach Unified School.'",
        "'speaker_2': 'District for the Department of Parks, Recreation and Marine to operate afterschool programing.'",
        "'speaker_6': 'Onsite at.'",
        "'speaker_2': 'Eight Long Beach schools. This is a.'",
        "'speaker_6': 'Program that's funded through the.'",
        "'speaker_2': 'State and administered by Long Beach Unified School District. The department is one of eight providers, contracted providers.'",
        "'speaker_6': 'Through the district.'",
        "'speaker_2': 'We provide services at eight sites. The remaining.'",
        "'speaker_6': 'Seven providers provide services at another 49 649.'",
        "'speaker_2': 'Sites. This is our eighth year providing the.'",
        "'speaker_6': 'Service and we expect to serve about 200,000 students this.'",
        "'speaker_2': 'Year. We're open for any questions.'",
        "'speaker_3': 'Thank you. Is there any public comment on the item? Seeing none. Members, cast your vote. I'm sorry, Councilman Andrews.'",
        "'speaker_10': 'It's late. It's late. No.'",
        "'speaker_3': 'It's. It's not late, Councilman.'",
        "'speaker_2': 'All right.'",
        "'speaker_10': 'Good. You know, as a teacher, I really see the hands of the importance. You know, the benefits of my school program. And I think that they are linked in the significant gains. You and standardized test scores and work habits, as well as reduction in behavior.'",
        "'speaker_10': 'You know, after school hours are always the peak time for juvenile crime and risky behavior. So I serve this, you know, and prevent this type of activity as well. So I'm definitely flavor in favor of continuing this program for our youth.'",
        "'speaker_10': 'And thank you for bringing this forth.'",
        "'speaker_3': 'Thank you, Councilman Andrews. Is there any public comment on the item? Seeing none. Members cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Thank you. Item 30. Yes. Yes.'"
    ],
    "Ordinance Amendment for the Board of Health and Human Services.": [
        "'speaker_3': 'Thank you, Madam Clerk. Item. 3131.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code relating to the Board of Health and Human Services. Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_3': 'This motion by Councilman Andrews and seconded by Councilmember Urunga is their staff report. I'm sorry. So any member of the public that wishes to address the council, please come forward.'",
        "'speaker_5': 'Good evening, city council members. My name is Christine Pettit. I live in the sixth district and I'm here tonight serving in my capacity as the newly elected chair of the Board of Health and Human Services. The board reviewed the proposed changes to this ordinance at our June meeting and we are supportive of them with regard to board'",
        "'speaker_5': 'composition. Although your voting to add these categories into the ordinance, we do currently have a mental health professional and an environmental health professional that are serving on the.'",
        "'speaker_1': 'Board.'",
        "'speaker_5': 'And we think that the youth perspectives are valuable and want them to continue moving forward. The board has the diverse membership and we take up a breadth of issues from the more traditional disease and prevention to broader public health issues like affordable housing, or actually the safety and health of our housing, as well as violence prevention.'",
        "'speaker_5': 'And the board really wants to be seen as a resource to you all. So I was also going to invite members of the public. I'm sure some are still watching. Right. But the board meets on the second Fridays of each month at 745 in the morning.'",
        "'speaker_5': 'Lucky us. At the Miller Family Health Education Center, 3820 Cherry Avenue. Our next meeting is on August 14th, and we're so passionate about our service that we actually voted to not have our hey this summer. So thank you all.'",
        "'speaker_3': 'Thank you. Councilman Andrews?'",
        "'speaker_10': 'Yes. I'd just like to say congratulations. And you wouldn't realize how many people are still watching this.'",
        "'speaker_3': 'There's the motion in a second. Members, cast your vote. Our family doesn't count.'",
        "'speaker_10': 'I was speaking of my wife.'",
        "'speaker_3': 'That's how.'",
        "'speaker_2': 'I feeling.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Item 32.'"
    ],
    "Ordinance Amendment on Meter Tests.": [
        "'speaker_1': 'Report from Long Beach Gas and Oil Recommendation to declare ordinance amending the Long Beach Municipal Code relating to meter tests read for the first time and lead over to the next regular meeting of the Council for Final Reading Citywide.'",
        "'speaker_3': 'So a staff report.'",
        "'speaker_6': 'Yes. Vice Mayor.'",
        "'speaker_2': 'I'd like to point out, though, that Chris Garner has been with the city well over 30 years, and I think this is the first time.'",
        "'speaker_6': 'He has ever had to make three staff reports in one night.'",
        "'speaker_2': 'Which may explain why the lack of audience but.'",
        "'speaker_10': 'Mayor, vice mayor and city council, currently we have 150,000 gas meters in service and the municipal code currently requires us. Any time we take a gas meter out of service, for whatever reason, we have to prove it and test it for accuracy.'",
        "'speaker_10': 'And that's okay during the normal course of business. But with the implementation of our Amy, instead of doing a couple hundred a year, we're going to be doing thousands over the next couple of years. So what we respectfully request is that we amend the municipal code that will allow us to, instead of doing every single meter which'",
        "'speaker_10': 'rarely ever finds any type of significant missed measurement, it will allow us to do sampling instead. Thank you.'",
        "'speaker_3': 'Thank you, Mr. Gardner. There's the motion by Councilman Mongo and a second by Councilmember Urunga members. Please cast your vote. Actually, is there any member of the public that wishes to make public comment? None. Please cast your vote.'",
        "'speaker_1': 'Motion carries nine zero. Hmm.'",
        "'speaker_3': 'Thank you. Item new business. 33.'"
    ],
    "Use of Sixth Council District Infrastructure Funds for Community Improvement and Engagement Activities.": [
        "'speaker_1': 'Communication from Councilman Diane Andrews recommendation to approve the use of six Council District Fiscal Year 2015 one time infrastructure funds in the amount of 56,000 to fund community improvement and community engagement activities and decrease appropriations in the Capital Projects Fund in the Public Works Department by 56,000 and increase appropriations in the General Fund in the Human Resources'",
        "'speaker_1': 'Department by 56,000. District six.'",
        "'speaker_5': 'It's.'",
        "'speaker_3': 'Mentioned by Councilman Andrews and a second by Councilman Austin. Councilmember Andrews.'",
        "'speaker_10': 'Yes. Thank you. You know, since I've been in office, we have seen, you know, a lot of positive changes within the district. You know, with all the tasks that we have completed, we still have a lot of needs.'",
        "'speaker_10': 'And I would like to engage the City Workforce Development Board, who has been instrumental in fixing a lot of the problems from reducing unemployment to removing blight and to assist with continuing this challenge. And I would hope that my colleagues will.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_3': 'Thank you. Thank you. Councilman Andrews, I wanted to thank you for taking this step. I think it's very important and appreciate that you're making this move. Is there any member of the public that wish to comment on this item?'",
        "'speaker_3': 'Seeing None members cast your vote.'",
        "'speaker_1': 'Motion carries nine zero.'",
        "'speaker_3': 'Okay. We have taken item 34 and 35. And. New business.'",
        "'speaker_2': 'What is this first thing? Let's try.'",
        "'speaker_3': 'Okay. This is the opportunity for any member of the public that wish to address Council on items, not agenda raised. Seeing new members of the audience wishing to speak. I will go to new business from Members Council Member Richardson.'"
    ]
}