{
    "Conform Residential Rental Code with State Law Changes.": [
        "'speaker_5': 'The report Civil Rights, Utilities, Economic Development and Arts Committee. Agenda Item one Capital 11958 4,000,000,002 residential rental properties conforming to Zell Miller code with changes in state law. The committee recommends the bill pass.'",
        "'speaker_1': 'Just remember Herbold.'",
        "'speaker_5': 'Fantastic. Thank you. So back in February of 2019, I sponsored Resolution 31861 that proposed certain legislative changes originating from recommendations from the Women's Commission in the Housing Justice Project Report Losing Home. The recommendations in the report identified specific harms in our eviction system, impacting tenants in marginalized communities, particularly women, the African-American community, seniors and transpeople.'",
        "'speaker_5': 'Following up on Resolution 31861, passed unanimously by the Council in the 2019 state legislative session, advocates at the state level and housing champions were in were successful in passing changes to the Residential Landlord Tenant Act Senate Bill 5600 was sponsored by Senators Patty Couteur and Mona Das and House Bill 1440, sponsored by Representatives Jordan Robertson and Nicole'",
        "'speaker_5': 'Macri. These bills have been in effect since the end of July and SDI, the Department of Construction Inspections, is already conducting outreach and education on the changes in this bill. They've been working to notify landlords who are currently registered with the rental registration and inspection database, about 19,000 landlords, and they've been incorporating into future landlord trainings and'",
        "'speaker_5': 'curriculum the new requirements under state law. This harmonization bill that is before us today makes consistent with our own unique city laws the new rights granted to tenants by state law. It passed unanimously out of the August 13th Civil Rights Utility's Economic Development and Arts Committee.'",
        "'speaker_5': 'What the legislation does is three primary things. First, it extends what was a mere three days that tenants had to pay rent or face eviction, for which they a reason for not paying the rent would not be accepted by a judge is only looks at whether or not the rent was paid within three days.'",
        "'speaker_5': 'The new law gives tenants 14 days for nonpayment of rent. This extends the amount of time a tenant has to access services, support or the next pay period in order to potentially get up, get caught up and avoid eviction proceedings.'",
        "'speaker_5': 'Secondly, the bill redefines rent as, quote, recurring and periodic charges identified in the rental agreement. The reason why this is so important is it allows a requirement that rent be applied past due, rent be applied before other costs like lease late payments damages, legal costs or other fees.'",
        "'speaker_5': 'And so that makes sure that when a tenant is behind in rent and also has other costs owing like late fees, that when the tenant pays the past due rent, it gets applied to the rent that is showing to be owed and ensures that the reinstatement of tenancy is based on on that rent and not the other'",
        "'speaker_5': 'costs. And then finally, the bill extends the minimum notice of all rent increases in the city of Seattle to 60 days. And under current law, most rent increases can only go into effect after 30 days notice. With the exception in Seattle for rent increases greater than 10%, they previously required a 60 day notice.'",
        "'speaker_5': 'Under this new law, all rent increases, regardless of their size, will only be effective with a full 60 days notice. And those are the main points of the bill. We're going to have another couple of pieces of legislation that we're going to be continuing to work through, through our committee.'",
        "'speaker_5': 'Also coming out of the Women's Commission Housing Justice Project, Losing Home Report. But we'll talk about that another time.'",
        "'speaker_1': 'Thank you, Councilmember Herbold. Any questions or comments on the legislation? Okay. Looks like we're good. So please call the role on the passage of the bill.'",
        "'speaker_2': 'Thanks. John Gonzalez. Purple. Hi, Suarez. Let's get to O'Brien Pacheco. So what? President Harrell.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'Nine in favor.'",
        "'speaker_1': 'Nine opposed the bill passed in show senate. Please read the report of the Sustainability and Transportation Committee.'"
    ],
    "Protected Bicycle Lanes Ordinance.": [
        "'speaker_1': 'Please read the agenda. Item number three.'",
        "'speaker_5': 'Agenda item three cancel 119601 relating to the construction of protected bicycle lanes requiring major paving projects to include protected bicycle lanes as identified in the City of Sails Bicycle Master Plan and adding a new Chapter 15.80 to the The Code.'",
        "'speaker_5': 'The Committee recommends the bill passes amended.'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_6': 'Thank you, colleagues. This this ordinance is really directed towards safety, specifically safety for bicyclists in our city. And the ordinance is really intended to ensure that we uphold the commitments we made to the motor plans, in this case, the bicycle master plan to build the facilities, the protected bicycle lanes that have been laid out in that project'",
        "'speaker_6': '. What the ordinance would do would require that in repaving projects, on arterials, major repaving projects, these are projects identified as being more than $1,000,000. If that arterial is slated in the bicycle master plan is having a protected bike lane that the the expectation is that when they do that project, they need to include that protected bicycling.'",
        "'speaker_6': 'A couple of things I want to speak to here. One is one is the safety issue. A lot of work goes into making and updating the motor plans and a lot of factors into how to building a network of of bike lanes in this case that allow people to safely get around the city.'",
        "'speaker_6': 'Not so much folks like myself who may have been bicycling most days for the last 20 years. But for the vast majority of people who are interested in cycling but don't feel safe today, we want to make sure there's a network for that.'",
        "'speaker_6': 'Heard Councilmember Gonzalez this morning speaks to her experience in Copenhagen, which is vastly different than ours and where, you know, depending on the day, a majority of people might be commuting via bicycle. And it's a place where from a climate perspective and human health perspective we'd like to get to, but it requires the commitment to making those'",
        "'speaker_6': 'safe points. If you're going to build the infrastructure, the most cost effective time to do that is when you're already tearing up the street and redoing it. And so by requiring that folks, when they're doing a repaving project requiring the department installs a facility at the point at which they're already doing the work, the marginal cost for'",
        "'speaker_6': 'that is minimal to make that happen. And so it's the most cost effective way to achieve the safety net where we're trying to achieve what I, I want to be clear, we're going to talk a little bit about community engagement, I imagine, in the discussion.'",
        "'speaker_6': 'And it's critically important that there is community engagement throughout this process. We've heard in public comment today the desire for that to be early and the expectation is that folks have those engagements. My intent with this legislation, this is a community engagement process to say, should we do this or not?'",
        "'speaker_6': 'Because the implementation plan, the bike master plan, has already decided that this is a place where we need this facility, but rather how do we do it? Does it make sense for the facility to on the east side of the street or the west side of the street?'",
        "'speaker_6': 'How do we deal with the intersections? You know, how do we make sure that in the case of business districts that they're proper loadout zones so they continue to have access. Those are there lots of very neighborhood specific questions that need to be addressed.'",
        "'speaker_6': 'And frankly, the city has a really great track record of doing that really well. There's a few exceptions, but in general really well. And this this the intent of this legislation is to just make sure we stick to that moving forward.'",
        "'speaker_6': 'So I'll pause there and I think there's some other discussions and potentially amendments.'",
        "'speaker_1': 'Okay. I know that Customer Herbold has mentioned and drafted an amendment. For Section one and gave us the language because for how long would you like to speak to that?'",
        "'speaker_5': 'I'm going to speak to that. I'm not going to move it because Councilmember O'Brien has a substitute. But I do want to speak to my intent. I in the amendment itself, I refer to the need for continued community engagement and input in the project development.'",
        "'speaker_5': 'And then I speak specifically, I speak generally first about community engagement, and then I speak specifically about the need for business district stakeholder engagement. The intent is not to suggest that one set of stakeholders is more important than any other.'",
        "'speaker_5': 'The intent is to to reflect a reality that that we see and that I have actually worked with business district stakeholders in in district one with bike lane and bus lane implementation and Avalon of how important it is to project completion, to have these stakeholders at the table because of what happens when you don't and you're at'",
        "'speaker_5': '90% design and the engagement has not been has not been deep about what those impacts are. I chair the Council Committee with Oversight on Economic Development Issues, the Office of Economic Development. I think feels really strongly as well that as it relates to Department of Transportation construction impacts, that they're the relationships that they develop in these business'",
        "'speaker_5': 'districts are really important to have, you know, when you're at 10%, 30%, 60% and 10% of the design phases. I mean, so that was my intent. It was if you want to get the project done. The reality is, is that if if folks who actually own property on the bike route and are doing business out of the'",
        "'speaker_5': 'property are on the bike route, aren't in engaged early on in throughout, it's going to inevitably delay and sometimes derail the project itself. All that said, if people feel more comfortable removing the reference to the business district, I'm okay with doing that.'",
        "'speaker_5': 'And you know, this this amendment is about accountability or our desire or the council's desire to have accountability as it relates to both those instances when a project when it decides that a project is not moving forward as well as those instances, and when it is moving forward and it's out of our desire, I think, to be'",
        "'speaker_5': 'good stewards of the council's intense in plans. And so I will if the will of the Council is to move forward with an amendment that doesn't call out business districts. I'm just going to have faith that community engagement writ large does include.'",
        "'speaker_4': 'Those business districts.'",
        "'speaker_1': 'Thank you, guys. Very well. Councilmember Suarez.'",
        "'speaker_4': 'I'm actually disappointed that Councilmember Herbold is pulling her amendment. I did not. I saw your intent. And those of us that have dealt with this bike lane issue understand that having the business district stakeholders in there doesn't mean that one group of stakeholders is more important or more hurt than the other.'",
        "'speaker_4': 'However, what we've learned and lessons learned in bike lanes and communities in what we've watched and I've learned since 2000, 2007 with the bike master plan that has gone through five iterations, that each time we have paused when we looked at safety, ridership, equity, infrastructure, race and social justice issues when we first passed the bike master plan'",
        "'speaker_4': '. Customer Brian, please correct me if I'm wrong. The first two ideals were in 2007 were safety and ridership, and from that five more important values became integrated. They became integrated because community came together and said, You passed a law.'",
        "'speaker_4': 'It's working now. There's some other ideas that need to be folded in. In this other council's agreed and passed it. One of the ones that was most important to me, besides safety and ridership, was the whole equity race and social justice issue and that we needed more bike lanes south, the ship canal in districts one in District'",
        "'speaker_4': 'two. So when I read Councilmember Herbold amendment, which I would have supported, it made complete sense to me that if you have and we cannot pretend that the business community is not impacted and Casper O'Brian, please correct me if I'm wrong again, but my understanding, too, is that bike lanes are also exempted from from the Environmental Impact'",
        "'speaker_4': 'Statement Review from ISS. And somebody made that decision somewhere. And that's not neither here nor there, good or bad. But my point is we make these decisions all the time, and that doesn't mean that one stakeholder group isn't more important, but it's recognizing that community is also includes and should have teed up the issues that business districts'",
        "'speaker_4': 'are concerned about in. A lot of them go beyond just parking. And I think we heard that loud and clear. So. So that's what I wanted to add.'",
        "'speaker_1': 'Thank you. Customer awareness. Any other comments? You think Council Member Brands can address some of the pending comments?'",
        "'speaker_4': 'Sarah One quick one. Bree, if you're still here, I want to say thank you and acknowledge what you had said about genuine community engagement early on. And that's something I know Cascade Bicycle Club has been advocating for, as have all of us up here.'",
        "'speaker_4': 'So I want to support this. I really believe that that real community input also will result in what we've heard from Copenhagen and what we know that the Bloomberg studies found in New York City is that getting community stakeholders involved and local businesses involved is that their businesses do do better when they're there giving a thumbs up'",
        "'speaker_4': '. They've got places where people can come and park their bikes. That just based upon what we have seen in New York City and Copenhagen alone, we know that economically this this work. So I'm going to be supportive of this.'",
        "'speaker_4': 'Frankly, if you want to keep the language in that identifies business districts, I'm fine with that. Councilmember O'Brien, if you prefer your amendment, I'm going to support it either way. So thank you for the good work. And and again, I just want to acknowledge what you're saying is that the community engagements got to be early, often and'",
        "'speaker_4': 'real.'",
        "'speaker_1': 'Thank you. Katherine Bagshaw. Before we proceed, if I to consider Councilmember O'Brien's amendment, we don't have any amendments on the table right now. We're going to have to suspend the rules because of the time deadline a little bit, because of the lateness of the amendments.'",
        "'speaker_1': 'So Lester's objection, I'm going to suspend the rules to be able to consider any potential amendments made by Councilmember O'Brien. So, Councilman Brian, you want to take it from there?'",
        "'speaker_6': 'Yeah. Thank you. Council president and colleagues, I I'll just send to the public. I want to just acknowledge we're back from two weeks in recess. And so I apologize that we're we're playing a little catch up here after our deadlines.'",
        "'speaker_6': 'And so I appreciate the flexibility. Councilmember Herbold, I appreciate your work on the language, and I agree with everything you said. I know that the intent is absolutely there to ensure that that we do a stakeholder process, including the business districts.'",
        "'speaker_6': 'One of the challenges I think we heard from folks in the community in public comment today is the language chose to single out business districts as an area to do it because those are critical areas. They said business districts, not businesses.'",
        "'speaker_6': 'So anyone that's along those lines would be included. And I also hear from community members that we want to make sure everyone's included, including folks that are historically left behind. And I think that's important. At some point, we start to get into a series of not to exclude, but including these types of folks.'",
        "'speaker_6': 'And the list gets really long. And so what I'm proposing here is kind of broader, higher level language that as Councilmember Herbold and Councilmember Wise said, it's absolutely critical that businesses in business districts are consulted along with other folks.'",
        "'speaker_6': 'And what the amendment would do is in under the requirements where it currently says under a whenever the Seattle Department of Transportation constructs a major paving project along a segment of the Protected Bicycle Lane Network, a protected bicycle lane with adequate directionality shall be installed along that segment.'",
        "'speaker_6': 'And the amendment would add, just extend that sentence to add with an expectation that the final scope and design of the project reflect continued community engagement and input in the project development on how to implement the protected bicycle lane.'",
        "'speaker_6': 'It doesn't specifically mention businesses, underrepresented communities, residents, but the intent is this. This inclusion and stakeholder engagement should be broad and inclusive. So I will propose that amendment. You have a copy in front of us. I think there's a few copies on the podium if folks want to see in the audience.'",
        "'speaker_6': 'Again, I apologize for making this up in response to real time. I know this is not the ideal way we do business in full council, but I appreciate your indulgence. Council President.'",
        "'speaker_1': 'Thank you, Castro and brian for what appears to be inclusive and expansive language to meet the needs of meaningful community engagement. Are there any comments? I'm going to need a second. A second on the amendments because of I will the second and any other comments or questions.'",
        "'speaker_1': 'Councilmember Gonzalez, you have the floor.'",
        "'speaker_5': 'Thank you. Council President. I appreciate the attempt to reconcile. What. Seems to be conflicting language, but not necessarily actually conflicting in the sense that I think the intent is the same here. But how will this is an ordinance, not a resolution?'",
        "'speaker_5': 'So this is actual law that the agency will presumably referred to in the course of its work in implementing the intent and the actual letter of the law. How will the intent that we've been discussing for the last few moments be articulated to Sudan in terms of the characterization from the dias that the intent here is to'",
        "'speaker_5': 'do community engagement in the broadest, most inclusive sense, which would include those business owners and residents within our business districts.'",
        "'speaker_6': 'So in in my recent conversations, I say conversations over the last six months with staff at Ascot on what community engagement should look like around implementation of the bike master plan. I would say that what I have heard is their intent is completely aligned with what we've all discussed here today, that they want to do engagement early'",
        "'speaker_6': '. They want to do it at a point where there's still opportunities to influence the actual design. They want to be broad and inclusive. That includes the obvious stakeholders that that may own businesses or live right along a corridor, but also folks from the broader community who may want to have access to that corridor, whether it's they want'",
        "'speaker_6': 'to access the businesses or other facilities along that corridor or they commute through that corridor, and that's the route they go to. So I, I feel very confident in the folks at Ascot that their intent is to implement this.'",
        "'speaker_6': 'And I think they have examples where they do this well. And like anything of the city, there's also examples where they're falling short. And so I'm not sure what other language to put in at this point. But I think what it will require is a conversation, probably multiple conversations to ensure that we understand what this looks like'",
        "'speaker_6': '. And the good news is that there are projects that meet this criteria that will be happening in the near future, that we can start working on this together and say, let's come back with a model of what your engagement will look like on a project, say like the Rapid Ride Corridor on Eastlake as an example.'",
        "'speaker_6': 'And how do you plan to engage stakeholders along that community on how to implement the bike master plan?'",
        "'speaker_5': 'I just I think that I appreciate that and I don't you know, I'd like to believe that all of the agency employees and leaders are watching us on the dais now and have a full, robust understanding of our legislative intent as we are having these debates.'",
        "'speaker_5': 'But I know that that is not necessarily a reality. I think there's an opportunity to potentially communicate in a more formal way to Ascot and the mayor's office about the intent around this community engagement piece. I do think it's an opportunity of improvement for how we implement many of our infrastructure projects, including bicycle infrastructure.'",
        "'speaker_5': 'And I think that's where we can lose the most in terms of credibility and trust in advocating for ongoing development of a bicycle network and infrastructure that works for everyone, primarily for those who are using them, of course.'",
        "'speaker_5': 'But I do worry that excluding excluding a call out of stakeholders in this area can be interpreted as us wanting to exclude engagement of those very individuals. And one of the things that was really impressive to me on my learning trip in Copenhagen is having a mentality and a culture around these infrastructure projects that really is centering'",
        "'speaker_5': 'the concept of going somewhere as opposed to passing through a place. And and that is really sort of essential to creating true public space and livability within our city. And so I want to challenge us all urbanists, to really think about how we are creating infrastructure, not just to pass through something safely, but to get to that'",
        "'speaker_5': 'place as well. And that, I think to me includes our main street businesses within our neighborhoods that are essential to the vibrancy of the city. So I, I accepted Councilmember Herbals language with that intent in mind and hope that we can find a way to effectively communicate that to the department and the mayor's office.'",
        "'speaker_5': 'My preference would be to leave it in the ordinance because it is an ordinance and not a resolution. But if that is not something that we can find agreement to at this moment, then I hope there will be an alternative way for us to make that communication and that intent clear to the agency.'",
        "'speaker_6': 'So, colleagues, I don't have I believe what we're discussing here, the distinction our intent distinction is is doesn't exist. I think we're trying to go the same way. And I'm flexible to go either route. I have my agenda before me.'",
        "'speaker_6': 'But if colleagues want to do something else, what I would suggest, because of your comments come from Gonzales, which I really appreciate, would be a committee sometime before the end of the year to, you know, work with the director of START and the team that's leading the outreach and have them come do have a discussion with us'",
        "'speaker_6': 'about what what their interpretation of this is, what our intent is in a public forum where we can actually talk through that and hear how they plan to do that.'",
        "'speaker_5': 'And include also economic development as well.'",
        "'speaker_6': 'To do that. That sounds great. So. And that probably won't happen before budget, but we can do it shortly after budget and be my guess on the timing on that that may my amendments out there and it has a second but if folks feel strongly about going in a different direction, I'm happy to consider that too.'",
        "'speaker_6': 'So I don't think we're actually arguing.'",
        "'speaker_1': 'What I'm hearing is we can proceed with the amendment. It has been seconded, but there is a need legislatively perhaps to clarify and strengthen the intent of our language. And we have some opportunities this year to still do that.'",
        "'speaker_1': 'So that's what I'm hearing at this point. I don't know where the votes will fall, but I don't think one excludes the other. So I think we could at least I could support the amendment knowing that we may take further action to legislatively articulate our our intent.'",
        "'speaker_1': 'So we haven't a live amendment on the table we're going to vote for. Is everyone ready to vote on the amendment? Okay. It's been moved in. Second it an amendment number one is proposed by councilmember and then the number two as proposed by Councilmember O'Brien.'",
        "'speaker_1': 'You have it in front of you. All those in favor of the amendment, please say I. I opposed. The ayes have it. So that amendment passes. They were ready to vote on the amended legislation. Is there any further need to talk about the Bass legislation as amended now?'",
        "'speaker_1': 'Councilman Brand, do you have any closing words you wanted to say? We're good. Okay. We're going to vote on the amended legislation.'",
        "'speaker_2': 'Make sure.'",
        "'speaker_4': 'I'm sorry.'",
        "'speaker_1': 'I'm sorry. Please call the role on the passage of the amended bill.'",
        "'speaker_2': 'Major Gonzalez Herbal, Juarez Mosquito. Hi. O'BRIEN All right. PACHECO So on President Herrell.'",
        "'speaker_3': 'High.'",
        "'speaker_2': 'Nine in favor not opposed.'"
    ],
    "Budget Proposal for On-Street Bike and E-Scooter Parking.": [
        "'speaker_1': 'The bill passed. And Cheryl, sign it. Please read the item. All right. Please read agenda item number four.'",
        "'speaker_5': 'Resolution 318 and 88 requesting that the State Department transportation develop a budget proposal for creating on street, bike and e-scooter parking. The committee recommends the resolution be adopted as amended.'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_6': 'Thank you. I'll just speak briefly to this and give a chance to my colleague, Councilmember Pacheco, to speak to it as he has done a lot of work on this. We heard in public comment today from a lot of folks, and I really appreciate everyone here finding public comment both to the need to have more mobility options'",
        "'speaker_6': 'for everyone and for the need to ensure that we provide the infrastructure and the enforcement to ensure that people using the various mobility options do it appropriately. This specific piece of legislation is a step in getting the infrastructure built so that there are places for folks to park their bicycle scooters or whatever comes along next in the'",
        "'speaker_6': 'mobility world. There's continued work to do enforcement, and I really appreciate the comments. Marci, your comments in particular you helped share with me over the over the last week in another jurisdiction where I believe one of the one of the E-Scooter share companies had created penalties for folks that are parking those that are their customers, who are'",
        "'speaker_6': 'parking the scooters inappropriately. And I think that is an enforcement step that we need to do. We don't have e-scooters, but we do have bikes. And I think we should step up our enforcement and work with the companies that are on our streets to hold their customers accountable and make sure that they have a place to do'",
        "'speaker_6': 'it. I also appreciate your comments, Marci, about making sure that we're simply not penalizing low income folks and making it so that they no longer can afford to have access to the type of mobility ability options that some communities may be in most need of happening.'",
        "'speaker_6': 'So it's complex. And the thing that gives me hope is there's an amazing group of advocates that represent a broad swath of our community that are thoughtfully engaged in finding solutions. And we will work through that complexity as a city if we're going to be successful.'",
        "'speaker_6': 'And having folks engaged is is an amazing thing. And so sorry I spoke too long, but I want to hand it over to Councilman Pacheco to speak specifically to this legislation.'",
        "'speaker_1': 'Councilman Pacheco.'",
        "'speaker_3': 'Well, first, I want to thank the community advocates with the mass coalition for doing so much work, as well as advocacy here today as well as prior in my council colleagues, Councilmember O'Brien and Mosquito, who have come with some recommendations and some amendments in committee.'",
        "'speaker_3': 'So the budget proposal, it's the resolutions is to start to come back to us with a budget proposal to double buy the number of bikeshare and scooter parking spaces by next year, as well as include provisions for financial penalties to enforce proper parking of the bike share and scooters.'",
        "'speaker_3': 'As we've heard today during public comment, the need for us to have better enforcement of these mobility options and so I'm excited to get to have post have voted this out of committee as well as hopefully be able to get this out of council today so that we can have our assignment before us before we get to'",
        "'speaker_3': 'the budget later this month.'",
        "'speaker_1': 'Thank you, Katherine Pacheco. Any more comments on the resolution? Councilmember Mesquita.'",
        "'speaker_7': 'Thank you very much, Mr. President. I want to take a quick second to thank council members Pacheco and Councilmember O'Brien for taking the first steps on this legislation to really help us get scooters into Seattle in a safe and responsible way.'",
        "'speaker_7': 'I think we've been able to hear from a number of transit advocates or multi-modal transit transportation advocates that there is a desire to help promote environmentally friendly transit options that create equity and also build healthy communities. And I really want to thank Mary and others who testified today about the need to make sure that as we roll'",
        "'speaker_7': 'out any program or pilot, that we're doing so in direct conversation with communities that could potentially benefit from the creation of scooters, for example, but also that we're taking into consideration all the unintended consequences. And I think creating corrals and making those available for bikes and for scooters in the future help us to proactively respond to the'",
        "'speaker_7': 'concerns that we've seen in other cities. We can do that in a way that learns from other cities and how they've been able to move those scooters off the sidewalk and out of the ramps that allow for people to have easy and safe access to our protected sidewalks.'",
        "'speaker_7': 'And I think that's a critically important for us to create these corrals now so that when we potentially roll out policy in the future, we have a place for these bikes and scooters to go in the future. The other two things that I think are really exciting about us having this conversation, as one Glen mentioned, which dovetails'",
        "'speaker_7': 'with, you know, we want there to be more access to bikes and scooters in the future, not to necessarily penalize people for not putting them in the right place by having us not have as much access to those scooters.'",
        "'speaker_7': 'But we have or sorry to those bikes, but we have to have a place to put those bikes. So creating the the corrals is incredibly important. And then the last thing I'll mention that I'm looking forward to is I think as we create more sound policies like this, it behooves us to take a look at what other'",
        "'speaker_7': 'cities have done, especially around labor protections. What we saw in the city of Chicago, for example, is that they do not use independent contractors there. They require the companies to have actual workers and employees. So that can help us create more accountability and responsibility in terms of how these companies are both interacting with the built environment and'",
        "'speaker_7': 'with the higher labor standards that we'd like to see in our city. So I'm excited about these higher standards that we're putting into place now. I think that it sets us up well to implement best practices from across the country.'",
        "'speaker_7': 'And I think overall really excited about making sure that we don't just have a point in time check in with key stakeholders, including from disability rights community, but also that we've built into future legislation how we're going to have the stakeholder engagement all along the process to make sure that these corrals and future legislation on transit options'",
        "'speaker_7': 'really do meet everybody's needs. So thank you so much for taking this up. And let's get scooting. I had to say something like that.'",
        "'speaker_1': 'Thank you very much, Skinner. Any further questions before we vote on the resolution? We're good. Okay. Those in favor of adopting the resolution. Please vote i i those opposed vote no. The motion carries the resolution. Adopt and show.'",
        "'speaker_1': 'Sign it. Please read the next agenda item.'"
    ],
    "Funding Request for Bicycle Master Plan Projects.": [
        "'speaker_5': 'Agenda item five Resolution 318 94 relating to the funding of priority projects in the 2019 three 2024 Bicycle Master Plan and Implementation Plan. Requesting that the Mayor commit to building out the bicycle masterplan, identifying funding for priority bicycle masterplan projects and the mayor's 2020 proposed Budget Committee recommends the resolution be adopted.'",
        "'speaker_1': 'Council Member O'Brien Thank you.'",
        "'speaker_6': 'One more. As we work through with these exciting issues, this go back a little brief history here back in March. Well, traditionally, about this time each year, the executive presents an implementation plan for all the motor plans, including the bike master plan.'",
        "'speaker_6': 'But this time last year, that was delayed because of some of the work around the Seattle levy and an ongoing interest to further engage with various stakeholders. And so we did not have an implementation plan until March of this year.'",
        "'speaker_6': 'At the time that information came out, there was a lot of concern among various community members that the implementation plan had missed the mark. And I really want to say I appreciate that both the mayor's office and the Department of Transportation heard those comments and took them to heart.'",
        "'speaker_6': 'And to me, they went out and very quickly turned around and did a I believe it had five community meetings to get stakeholder input on hearing those concerns and came back in June with a revised implementation plan that attempted to address the concerns they heard in those community meetings.'",
        "'speaker_6': 'And I thought they did a really good job. They were very responsive. But the reality was that even then at that point, the fiscal reality of some of the challenges around the Seattle levy was such that there are some projects that really need to be built in the next few years that are not currently in the implementation'",
        "'speaker_6': 'plan. But the fiscal reality being what it is and I'm looking at the chair of our budget process was about to start. Is that the only way to build those projects with the current budget would be to cancel other projects that are also important.'",
        "'speaker_6': 'So instead of fighting over a small pie, why don't we figure out how to make the pie a little bit bigger? And so what this resolution does is it really focuses on a couple of priority areas where we where there are currently some gaps in the network or in the region and asks that the mayor's office and'",
        "'speaker_6': 'the department find ways to prioritize and budget those projects. So specifically, the current implementation plan, one of its major shortcomings is that at the end of the Seattle levy, if all we built is what's in the plan right now, there will not be a connection from southeast Seattle to downtown.'",
        "'speaker_6': 'And if after this billion dollar levy is completed, we still are lacking a safe connection for residents who live in southeast Seattle to connect to downtown, that will have been a failure. So this calls on specifically names out some projects, three of them on Beacon Avenue South, a connection from Georgetown to downtown, connection on Martin Luther King'",
        "'speaker_6': 'Jr. Way that we want to find funding for and ask the mayor to find funding for. Now, the great thing is that the budget is to be presented to us in just over a couple of weeks. And so hopefully there's an opportunity to do that.'",
        "'speaker_6': 'And we're talking about some other revenue sources that may come up, including a sale of the Mercer mega block, which hopefully we'll be approving in the next few weeks, too. And of course, when the budget comes to the council, we'll have opportunities to find transportation dollars and dedicate those to them in addition to southeast Seattle.'",
        "'speaker_6': 'It also talks about a couple of pieces of infrastructure in downtown that are important pieces of the network to make sure we have a safe downtown to a to a bike lane on Fourth Avenue and also protected bike lane on Alaskan way between Virginia Street and the Elliott Bay Trail.'",
        "'speaker_6': 'With that, I believe my colleagues have a couple of amendments, have a couple projects that are very consistent with those two. This one of those was presented this morning. I believe one will require suspension of the rules because it came in a little after the deadline.'",
        "'speaker_1': 'So the customer back show that will take second will require a suspension of rules because remember, Herbold has a First Amendment and will address first comes from Herbold.'",
        "'speaker_5': 'Thank you so much. I move to amend resolution 31894 Section two by adding a new subsection H entitled Georgetown South Park Trail as presented on Amendment 1/2.'",
        "'speaker_1': 'Can been moved in second act to add a section H Georgetown South Park Trail. Any comments or questions on that comes from Herbert? When I speak to a little more.'",
        "'speaker_5': 'I would thank you. I just want to give a little bit of background on this particular project. Under Council President Harrell's leadership in the budget for 2018 and in response to community requests from both of our districts in Georgetown and South Park.'",
        "'speaker_5': 'The council added 600,000 to the budget in 2018. For the outreach, planning and early design of the Project Starts Project website notes that the final design and construction are currently under funded, and I met with the MAX Coalition a couple of weeks ago.'",
        "'speaker_5': 'I received some support for this being a priority project and just want to say that South Park is called out in the recitals of the bill. So I think it's important that we follow up with action as it relates to important projects to the South Park community.'",
        "'speaker_1': 'Thank you, Councilmember Herbold, and thanks for your work on this. Any other questions? We'll just take or vote on the amendment. All those in favor as have been seconded. Yes, all those in favor of the amendment as described by Councilmember her will please vote i.'",
        "'speaker_1': 'I opposed. The ayes have it. So that amendment passes. Thank you, Councilmember Herbold and leave to consider Councilman back shows amendment. We're going to have to suspend the rules because of the timing and if there's no objection will suspend the rules to understand council members back Charles amendment because we're back to the floor.'",
        "'speaker_4': 'Thank you very much. So do you want me to formally request that we suspend the rules now or have you just. I just. Okay, very good. So I would like to move to amend this resolution 31894 Section two by adding a new subsection, which will be I since Councilmember Herbert's amendment passed to add Vine Street and thence'",
        "'speaker_4': 'parenthetical Second Avenue to Thomas Street. And the reasoning behind this is similar to what we were speaking about, about making the connections we have in our proposed amendment in front of us on what is item F, a two way protected bike lane on Fourth Avenue and its main to Vine Street.'",
        "'speaker_4': 'And then it just ends. And as part of our nodal map, our north downtown mobility action plan, we had specified a connection up Vine Street and Taylor to connect with Thomas Street. And thanks to a number of people, I saw Gordon Philadelphia here earlier that we had a design charrette on Thomas earlier this summer that would connect'",
        "'speaker_4': 'Thomas Street, both on the east side, in the west side of Seattle Center. And what this proposal will do is to add about seven blocks and whether it's a greenway or whether it's a separated bike lane. But to make sure that bicycle riders coming down Fourth Avenue will have a safe and separated bike lane, but then can'",
        "'speaker_4': 'can continue on Vine and Taylor to Thomas. And it's just on one of these safe connections. And I want to acknowledge, I think Katie Wilson has left, but the point that she was raising about Fourth Avenue is really critical as somebody who rides her bike a lot going down Fourth Avenue when it just and it becomes a'",
        "'speaker_4': 'very unsafe situation, particularly with all the construction going on downtown. So my goal here is to be able to connect Fourth Avenue all the way to the east side of Seattle Center and by adding the subsection I, Vine Street, Second Avenue to Thomas Street, we can accomplish that.'",
        "'speaker_1': 'Thank you. Kasper Back to any questions or comments on Councilmember Bag Shaw's amendment. Okay, we'll call this amendment number two. Okay. It's been moved. Is amendment number two has been described and moved and seconded by Councilman Beck. So any further questions or comments, all those in favor of amendment number two say I, I opposed the ayes have'",
        "'speaker_1': 'it. So amendment number two is passed. Now we have an amended resolution 31894 it councilmember O'Brien was like standing closing remarks.'",
        "'speaker_6': 'Good to go.'",
        "'speaker_1': 'Okay. Any other remarks on the base? Legislation as amended? We're good. Okay. Those in favor of adopting the resolution as amended. Please vote i. I those opposed vote no. The motion carries the resolutions adopted, and the chair will sign it.'",
        "'speaker_1': 'All right. It's great. Thank you. Please read the report of the Housing, Health, Energy and Workers Rights Committee.'"
    ],
    "Large Solar Program for City Light Customers.": [
        "'speaker_5': 'Report on Housing, Health, Energy and Workers Rights Committee. Joint Item six Constable 11956 In relation to the satellite department authorizing a large solar program for customers with solar photovoltaic systems sized larger than 100 kilowatts and not greater than two megawatts, and adding a new section 21.40 9.0 83 to the September code.'",
        "'speaker_5': 'The committee recommends the bill passed as amended.'",
        "'speaker_1': 'Council Member Mosquito and take your time.'",
        "'speaker_7': 'Thank you very much, Mr. President. I will filibuster. So I am excited about the next two pieces of legislation, which I think are in line with the city's commitment to reducing our carbon footprint and to promoting green energy and a greener economy.'",
        "'speaker_7': 'The first piece of legislation that we have is related to the solar program for customers in larger buildings. This will help to expand the production of renewable energy and move away from fossil fuels. I want to underscore that this legislation in front of us is a new program at Seattle City Light for large scale producers of solar'",
        "'speaker_7': 'energy. So you can imagine some of our larger midsize and larger buildings that have flat roofs, that don't have the ability to currently engage in generating solar energy at this point. Now, they would be able to be part of a program that allows for them to be large producers of solar energy and would establish a large commercial'",
        "'speaker_7': 'solar export rate in Seattle Municipal Code. And this can be updated over time. I think this is an important first step, and I'll just reiterate the point that I made earlier. None of these policies, whether we're talking about the solar program today or in the second, we'll be talking about the new energy market.'",
        "'speaker_7': 'These are not the end all be all to creating a greener economy. These are policies that help us strive towards our commitment to creating more options for entering into a greener economy and creating more green options. So along with transportation, we know from the reports that have been generated right here in Seattle that building emissions is one'",
        "'speaker_7': 'of the largest sources of climate warming carbon emissions in Seattle. And as stated in our Green New Deal resolution that passed just last month in this city council chamber, thanks again to Councilmember O'Brien for your leadership on that.'",
        "'speaker_7': 'We know that energy for heating, cooling and powering buildings accounted for more than one third of Seattle's greenhouse gas emissions in 2016 alone. Currently, we have a handful of large scale commercial solar producers that contract individually with Seattle City Light.'",
        "'speaker_7': 'But we haven't had a program that creates standards, rates and rules on the books as of yet. That is what this legislation aims to do. The lack of predictability of benefits from installing solar installations on roofs can be a barrier right now for more buildings and more entities to enter into the current program that Seattle City Light'",
        "'speaker_7': 'has. So we need to create a project that creates true standards for onsite solar energy generation. This will create consistency, predictability and will help to make sure that onsite solar production is actually being encouraged and that this electricity that's being generated on site can not only be used for those businesses that are generating it, but any excess'",
        "'speaker_7': 'energy that's generated on site can also be conveyed into city lights system for use elsewhere and help set up export rates for customers to be credits. That excess energy is accounted for. So with that, I just want to also note that Aaron House for my office has done a ton of.'",
        "'speaker_5': 'Work.'",
        "'speaker_7': 'On this legislation before we brought it to full council and before we brought it to our committee to make sure that the labor advocates, affordable housing advocates, energy and environmental advocates were at the table to provide additional input before we brought the legislation forward.'",
        "'speaker_7': 'And that includes folks from IBEW, Emerald City's Northwest Energy Coalition and SPARC Northwest to make sure that as we move forward, we were encouraging higher labor standards, energy efficiency and including in affordable housing and to making sure that we were striving for high performing energy efficiency standards in all building.'",
        "'speaker_7': 'This is, I think, a good first step as we look at trying to expand solar production to new buildings of various sizes. And we'll continue to be meeting with affordable housing advocates. I also understand that Seattle City, LA, has been working with the affordable housing developers on creating a virtual net metering program that makes sure that the'",
        "'speaker_7': 'energy savings are passed along to the low income residents who are more likely to be renters in these buildings. And that's a critical element of this component as well. I think Councilmember Brown, we've talked about that before. When we look at green energy standards and buildings, we have to make sure that renters are beneficiaries of these policies'",
        "'speaker_7': 'as well. So thanks to everybody involved. Thanks to Aaron for your quick work with all of these stakeholders and to City Light for being willing to work with us on this legislation and the amendments. I think that with these amendments, the policy has really been strengthened and helps us strive towards that commitment of affordability, equity and climate'",
        "'speaker_7': 'priorities as we put forward this solar program. We do have a substitute bill. You all have it in your materials, so there's no need to pass out materials here. Thank you, Amelia, for including that in the council materials that were sent out on Friday.'",
        "'speaker_7': 'And this is a substitute bill that really includes some technical language. So I'll just run through those two components, which we really quickly included in the substitute bill is clarifying language on how the size of these systems are measured.'",
        "'speaker_7': 'So, for example, this amendment explicitly states that the practice of measuring will be in terms of alternating current or AC and also is clarifying the effective date for the export rate of the solar bill. This amendment makes it clear that regardless of when an interconnection agreement is signed.'",
        "'speaker_7': 'So, for example, if you signed up in 2019 and it's now 2020, you actually are receiving the 2020 rate. So all customers in the program are on the same updated export rate each year. And with that, Mr. President, if I may, I would like to move to a man council bill 119516 by substituting version six for version'",
        "'speaker_7': 'one A to include these technical amendments.'",
        "'speaker_1': 'Very good. Is there a second? So it's been moved in second and choose substitute version six for version one. I think Consumer said it described it very well. So any questions or comments after that description, can we're just going to vote on the amendment now?'",
        "'speaker_1': 'All those in favor of the amendment, please vote I. I opposed the ayes have it. The version is substituted. Consumers get reject. Say, Lamar, we're ready to vote. Okay. Any other questions or comments on the bill? If not, please call the role on the passage of the amended bill.'",
        "'speaker_2': 'Big John Gonzalez Herbold II. Suarez, Mashaba I O'Brien. Pacheco, so on. President Harrell Hi 9 a.m. Favorite Unopposed Bill passed.'",
        "'speaker_1': 'Cheryl Simon Please read Agenda Item Number seven.'"
    ],
    "City Light Department Participation in the Western Energy Imbalance Market.": [
        "'speaker_5': 'Agenda Item seven Council Bill 119 571 relating to the satellite department authorizing department to enter and participate in the Western Energy Imbalance Market, including the ability to execute additional agreements necessary or convenient to participating in the Western Energy Imbalance Market.'",
        "'speaker_5': 'The Committee recommends Bill Pass.'",
        "'speaker_1': 'Thank you, Casper Mosquito.'",
        "'speaker_7': 'Thank you, Mr. President. So this is the second of the green energy legislation that's before us related to Seattle City Light, allowing for us to participate in the Western energy imbalance market. Again, I'll reiterate the comment I just made that, you know, in order for us to truly address the climate change and global warming, we need some'",
        "'speaker_7': 'radical policy changes that will absolutely take on how we have business as normal. This is a component of a much larger conversation that we must be having around how we create greener energy options. This is not the end all, be all again policy solution to creating green energy.'",
        "'speaker_7': 'But I think it's an important step that many of you have been working on for a long time to make sure that we could get into the Western energy imbalance market. This creates this helps us, I should say, create more options for greener energy in the market as we look at many of the western many of the'",
        "'speaker_7': 'Western states, which create higher, I should say, more equitable access to green energy, meeting our environmental standards, our carbon reduction goals, and creates final financial benefits for our region as well. We are very excited that Seattle City Light is going to be leading as the first public entity to join the Western Energy Imbalance Market.'",
        "'speaker_7': 'The market increases the reliability of renewable power and provides access to renewable power during peak demand periods. And with the amendments that we have included in the legislation in front of you, we have been able to work with a number of folks to get support from the environmental advocacy community and organizations that have been strongly supportive of'",
        "'speaker_7': 'the participation in the IM as the first public power utility in the Northwest to join. I want to thank Renewables Northwest, which is an early and strong supporter of the I am participation by all Northwest utilities. I want to support I want to thank NRDC, who has supported the expansion of Western energy markets to facilitate the transition'",
        "'speaker_7': 'of the energy sector to a less carbon intensive portfolio and to Northwest Energy Coalition, of which Seattle City has also been a member for many years. Very support. They are very supportive of our efforts to try to enter into this market as well.'",
        "'speaker_7': 'This is an innovative regional partnership that supports our climate goals and will increase revenues for our utility and together with the solar bill that was just voted on. These policies represent, I think, a critical component in us adapting greener energy, more efficient energy systems, and help move us away from fossil fuels and towards renewable sources.'",
        "'speaker_7': 'As we work to address climate change with that, thanks again to Seattle City Light for working with us and to Aaron House, who's been working on this piece of legislation over the last few months as well.'",
        "'speaker_1': 'Thank you. Customer. Any other questions or comments on the bill? Councilmember O'Brien.'",
        "'speaker_6': 'Thank you. Councilman ROSQUETA, thanks for your ongoing work on this. I'm excited to be at this point in supporting this. I want to just comment that there is some risk to this. The and I think that it's absolutely the right thing for us to be doing right now.'",
        "'speaker_6': 'We've heard from a lot of community members, including some of the folks that work from an environmental perspective on the energy market and believe that being part of this energy market will give us opportunities to sell our 100% clean electricity to other markets beyond just Seattle and to also take advantage of the the potential market advantages we'",
        "'speaker_6': 'have in that in the western in the Western energy market. But with that also comes some risk. And I think it's going to require ongoing diligence from the city council in the years to come to both ensure that the market is performing as as we hope.'",
        "'speaker_6': 'Again, there will be days where we're winners in days and we're losers as as a market. But we want to ensure that overall it is working to our benefit and to ensure that the folks at City Light are participating in that market in appropriate ways.'",
        "'speaker_6': 'I don't say that to to denigrate anyone in City Light, just that this is a complex structure and it's going to require that they have the resources and the expertize to be participating in that market in a way that is beneficial.'",
        "'speaker_6': 'Special to the the ratepayers of Seattle City Light the and also hopefully to the broader environmental goals of the city of Seattle. I think that the council has expressed concerns in the past citywide has been very responsive to that in designing a system.'",
        "'speaker_6': 'And, you know, there's some questions about how it will play out. I, I have the faith that people are doing their best, and I feel optimistic that it'll work out. And I think we'll have to just continue to provide oversight going forward, too.'",
        "'speaker_1': 'Brian, any other comments or questions before we vote on the bill? If not, please call the role on the passage of the bill.'",
        "'speaker_2': 'Thanks John I Gonzalez purple whereas mosqueda O'Brien I Pacheco want president hero.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Eight and favorite unopposed.'",
        "'speaker_4': 'A.'",
        "'speaker_1': 'Of Senate. Please read the reports of the Finance and Neighborhoods Committee.'"
    ],
    "Pay Zone and Provision Changes for the Power Marketing Compensation Program.": [
        "'speaker_5': 'Agenda item nine Council Bill 119578 Relating to city employment, adjusting the pay zones for titles in the city's Power Marketing Compensation Program, establishing changes to provisions in the Power Marketing Compensation Program and ratify and confirming certain prior acts.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_1': 'This man back show.'",
        "'speaker_4': 'Thank you. This actually applies to only two individuals, but it's an ordinance that will allow the city's power marketing compensation program to cover two new individuals who had previously been out hourly and now will be salaried. The salary increases will be absorbed through the existing city light budget and the committee recommends that we adopt Council Bill 119578'",
        "'speaker_1': '. Questions or comments not please call the rule on the passage of the bill.'",
        "'speaker_2': 'John Gonzalez Herbal Juarez I together I O'Brien. Hi, Chico. So on. President Herrell all right Aden favor and unopposed.'"
    ],
    "Sale of Surplus Property to Snohomish County and Reservation of Easement for City Light Department.": [
        "'speaker_1': 'Will pass in show senate. Please read the short title for agenda item number ten.'",
        "'speaker_5': 'Agenda item ten. Constable 119 591 relating to the city light to parent satellite department declaring certain real property rights surplus to the needs of the city department. The committee recommends the bill pass.'",
        "'speaker_1': 'Just Mayor Mosquito.'",
        "'speaker_7': 'Thank you very much, Mr. President. Again, I want to thank Council Member Bagshaw for allowing five of the bills that we're considering today to be heard in her committee and for graciously hosting these discussions in the Finance and Neighborhood Committee.'",
        "'speaker_7': 'These bills as a whole that I'll speak to represent routine real estate transactions that are part of regular business at Seattle City Life. These are not large policy, programmatic or land disposition changes, but instead are routine business items that Seattle City Hall is required to gain authorization from from the Seattle City Council.'",
        "'speaker_7': 'So this first ordinance, item number ten, allows City Light to sell a small portion of property on each side of 35th Avenue Southeast into how much county but reserve an easement for electric transmission line purposes in order to allow the county for road to have road widening purposes.'",
        "'speaker_7': 'The sale would be fair market value of $41,000. And I want to reiterate, this is not big enough property to build housing on. So we are just it's a small sliver of land that we are talking about here.'",
        "'speaker_1': 'Thank you, Katherine Ross. Any questions or comments? Now please call the role on the passage of the bill.'",
        "'speaker_2': 'By John Gonzalez Herbal Juarez Macheda I O'Brien, Pacheco, so on. President Harrell. Hi 9 a.m. favorite unopposed.'",
        "'speaker_1': 'Bill passes and said please read agenda item number 12 the short title.'"
    ],
    "Surplus Property Transfer for Housing Development at Yakima Avenue South.": [
        "'speaker_5': 'I've seen that agenda item 11 Council Bill 119603 relating to the transfer of city real property for housing developments. Can we recommend the bill pass?'",
        "'speaker_1': 'Yes, ma'am.'",
        "'speaker_4': 'Picture it. Good. Thank you. This bill will authorize the disposition of a parcel of property on Yakama Avenue, South and South Irving Street, its property that will be developed for permanently affordable homeownership. The transfer of jurisdiction will be to be between our fast finance and administrative services to the Office of Housing and authorizes our Office of Housing'",
        "'speaker_4': 'Director to enter into a purchase and sale agreement with the developer. And there are two developers, our Homestead Community Land Trust and Edge Developers Inc where were 16, three bedroom, two bath townhomes, ten of which will be permanently affordable homes for homebuyers at or below 60 80% AMI and six market rate homes.'",
        "'speaker_4': 'And all of the net sales proceeds will subsidize the affordable homes. We recommend the Council bill 119673 pass as recommended.'",
        "'speaker_1': 'Thank you, Casper. And any other questions or comments? If not, please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzalez purple. Whereas Musgrave I O'Brien Pacheco Swan I President Harrell I nine in favor and unopposed.'"
    ],
    "Acceptance of Warranty Deeds for Project Habitat Lands in Pend Oreille County.": [
        "'speaker_1': 'Will pass into the Senate. Please read. Agenda item number 12 the short title.'",
        "'speaker_5': 'Agenda item 12 Cancel 119498. Relating to the City Department accepting statutory warranty orders to the Masonic and Eleven's Property Committee recommends the bill pass.'",
        "'speaker_1': 'Just wear a mosquito.'",
        "'speaker_7': 'Thank you, Mr. President. This item item number 12 is an ordinance that allows Seattle City life to accept the deeds for two separate properties in Ponderay County. Both properties were purchased in compliance with boundary license requirements to manage project habitat lands under the authority of ordinance 1250721 property is 24.7 acres and the other one is 40 acres'",
        "'speaker_7': '. The funding for this was already budgeted and does not require a new appropriation under.'",
        "'speaker_1': 'Very good. Thank you. Customers? Can any questions or comments? If not, please call the role on the passage of the bill.'",
        "'speaker_2': 'Bexar I. Gonzales Herbal. Juarez, I.'",
        "'speaker_7': 'Macheda I.'",
        "'speaker_2': 'O'Brien, Pacheco, i. So what President Harrell i. I am favoring unopposed.'",
        "'speaker_1': 'Bill passed in Cheryl Senate for and oral county high conferences. Okay, please read agenda item number 13.'"
    ],
    "Easements for Electrical Rights in King County.": [
        "'speaker_1': 'The bill passed in show senate. Please read the next agenda item.'",
        "'speaker_5': 'Agenda Item 14 Council Bill 119 534 relating to the City Life Department, excepting various easements for overhead and underground electrical rights in King County, Washington, the committee recommends the bill pass.'",
        "'speaker_1': 'Just remember, Skeeter.'",
        "'speaker_7': 'Thank you, Mr. President. Item number 14 is an ordinance that allows the acceptance of 112 easements for overhead and underground electrical rights in King County. Seattle City Light requires that the owner of a new or altered electric service provide the city of Seattle with a utility easement.'",
        "'speaker_7': 'Whenever city and contractors pass over under or through the property of another person, or when service equipment such as poles or vaults may be located on the property being served or the property of a third party. Seattle City Light periodically requests an ordinance be passed by City Council excepting the distribution of easements.'",
        "'speaker_7': 'And this is an example.'",
        "'speaker_1': 'Thank you, Kaspersky. Any questions or comments, please, on the role on the passage of the bill?'",
        "'speaker_2': 'Thanks. John Gonzalez. Herbal Juarez Macheda. I O'Brien. Pat Pacheco. So on I President Harrell. I line in favor and unopposed.'",
        "'speaker_1': 'Bill passed cheryl senate. Please read the next agenda item.'"
    ],
    "Real Property Acquisition for Boundary Hydroelectric Project Housing.": [
        "'speaker_5': 'Agenda item 15 cancel bill 119592 billing to the city department. The committee recommends the bill pass.'",
        "'speaker_1': 'Cast Member Skater.'",
        "'speaker_7': 'Thank you, Mr. President. This is the last of the five that Councilmember Bagshaw had graciously considered in her committee. This ordinance allows city late to negotiate for the purpose or lease up to two houses in Ponderay County in order to provide temporary housing for city light personnel and contractors working at Boundary Hydroelectric Project in Metal Line Falls'",
        "'speaker_7': ', Washington. One one house would be in support of numerous projects required by the licensing of hydro facility, and another would be in support of the overhaul of projects over of the project's large generators.'",
        "'speaker_1': 'Thank you very.'",
        "'speaker_3': 'Much.'",
        "'speaker_1': 'Okay. Any questions or comments?'",
        "'speaker_5': 'We just do things a little differently in Central one. I understand why you're struggling.'",
        "'speaker_7': 'I'm getting sweaty.'",
        "'speaker_5': 'Palms over here. Can we vote the French?'",
        "'speaker_1': 'Okay, here we go. There's no further comments, please. Got a roll on the passage of the Bill Bagshaw High.'",
        "'speaker_2': 'Gonzalez Purple. Whereas Muscatel High O'Brien High Pacheco. I somewhat like President Herald.'",
        "'speaker_1': 'High.'",
        "'speaker_2': '9 a.m. favorite unopposed.'",
        "'speaker_1': 'Bill passed and chair of Senate that will conclude our John is there any further business come for the council? Okay. If not, we stand adjourned and want to have a great rest of the day. Thank you for being here.'"
    ]
}