{
    "Commercial Rent Control and Repayment Plan for Small Businesses and Nonprofits.": [
        "'speaker_1': 'The Report of the City Council Agenda Item one Council Vote 119 766 relating to commercial tenancies temporarily restricting increases in commercial rents, authorizing repayment of late rent installments for small businesses and non-profits, declaring an emergency and establishing an immediate effective date all by a three fourths vote of the City Council.'",
        "'speaker_0': 'Thank you. I will move to pass council bill 119766. Is there a second?'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'It's been moved and seconded to pass the bill. Councilmember Herbold is the lead sponsor on this bill, so I will yield the floor to her to allow her an opportunity to address the bill first. I understand that there's also an amendment, but why don't we go in and address the underlying bill first and then we will consider'",
        "'speaker_0': 'the amendment?'",
        "'speaker_3': 'Fantastic. Thank you. So this legislation builds off of the rent moratorium for commercial tenants that Mayor Durkan proposed a number of weeks ago and is intended to address the sort of inherent tension between that moratorium and the fact that rent is still due for folks.'",
        "'speaker_3': 'It establishes a way for property owners to get paid and for small businesses and nonprofits to minimize their rent debt as it may accumulate over the period of this crisis. My office has heard from small businesses concerned about their ability to survive the public health emergency.'",
        "'speaker_3': 'I'm sure many other council members have heard those stories as well. Seattle Times writer Danny Wesley wrote a story recently that I think reflects a lot of what we see happening across the city. The difference between property owners who are being very generous and understanding in creating the time and space necessary for tenants to pay the rent'",
        "'speaker_3': 'and other responses that are much more stringent and not really appreciative of the crisis that that we're in right now. A number of months ago I'm sorry, a number of weeks ago, a coalition of small business owners led by Molly Municipal, reached out to council members early on to propose ways that the city could help more small'",
        "'speaker_3': 'businesses survive. This was one of those ideas contained in that in that letter requiring rent payments to be payable over longer periods of time. In developing the legislation, I consulted with other additional small business owners, including Joe Karger of to develop Pizza and Beetaloo Ventures, a nonprofit that supports entrepreneurs, as I say, with limited resources and unlimited'",
        "'speaker_3': 'potential. And they provided a lot of feedback and and good.'",
        "'speaker_0': 'Ideas that we worked to incorporate.'",
        "'speaker_3': 'I have a just a short closing statement that I would like to also say at the end, if that's okay. After we work on the on the amendment.'",
        "'speaker_0': 'That is fine. So why don't we go ahead and take up the amendment, which is Amendment One on the agenda? Why don't we go out and take that up and then we will consider the amendment and then we will have comments on the bill as amended at the after we we consider the amendment.'",
        "'speaker_0': 'How does that sound? Okay, great. So would you like to formally move your amendment?'",
        "'speaker_3': 'I move Amendment one.'",
        "'speaker_0': 'I will second it.'",
        "'speaker_3': 'Thank you. Said Amendment one.'",
        "'speaker_0': 'Let me go to the the Roberts rules word if I can. So it's been moved and seconded to amend the bill. Council member Herbold will now address Amendment One.'",
        "'speaker_3': 'So Amendment One came out of some work with Washington Commercial Real Estate Development Association. This amendment is intended to put some common sense limitations on the small businesses that are covered. Businesses will need to have experienced an economic hardship either because they were forced to stop doing business or because their revenue dropped by 30% or more as'",
        "'speaker_3': 'compared to the previous year. And the amendment also clarifies that local outposts of large change would not change, would not be eligible, even if they have 50% or fewer employees. But we've been careful to make sure that small franchisees would still be eligible, even if the franchisor is excluded from the definition.'",
        "'speaker_3': 'The goal is to ensure that when we talk about helping small businesses survive, we're really focusing on the businesses most likely to need help to do so and not opening the doors for businesses who don't really need the protection.'",
        "'speaker_3': 'And I, I appreciate the fact that an organization that is devoted to the interest of commercial real estate, it has has been willing to come forward and recognize the need for this legislation while making some some recommendations that I feel are reasonable.'",
        "'speaker_0': 'Thank you. Are there any questions or comments on Amendment one to counsel bill 119766. Looks like there are no questions or comments. So will the clerk please call the role on the adoption of Amendment One?'",
        "'speaker_1': 'Councilmember Morales.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember mosquito. I. Councilmember Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council Members on site Council Member Strauss Site Council Member Herbold i. Councilmember Suarez, I. Council member, Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor nine opposed.'",
        "'speaker_0': 'The motion carries in the amendment is adopted before Councilmember Herbold makes her final comments. Are there any other further comments from any of my other colleagues on the bill as amended? Councilmember Morales.'",
        "'speaker_2': 'I thank you. I do just want to make a quick comment. As Councilmember Herbold said, all of us, I'm sure, have been hearing from our small business constituents, and we know that commercial tenants really have almost no rights and our small businesses need protection, especially during this emergency, so that they have some kind of chance to come'",
        "'speaker_2': 'back once we are in recovery. So as Councilmember Herbold said, this isn't complete rent forgiveness, it's just a freeze on increases. And they have a year, but they can't pay the money back. So we know that small business already takes a big risk, regardless of what kind of business they're doing of our business.'",
        "'speaker_2': 'Work really hard to make our neighborhood commercial districts really so excited for this opportunity to offer some rent relief to support them.'",
        "'speaker_0': 'Thank you. Councilmember Morales, any other comments from my colleagues? Okay. Hearing non councilmember approval. I just want to say thank you so much for the introduction of this of this bill. I think it is a very fine compliment to some of the work that we're seeing in this landmark space as it relates to residential tenancies.'",
        "'speaker_0': 'And I will have a bill for consideration by the full council later this month that effectively does the same thing that this bill does. But in the in the residential category of tenancies as opposed to the commercial tenancies.'",
        "'speaker_0': 'So I think everything we can do to create as much stability as we can in this space is going to be absolutely critical to making sure that we allow people the best opportunity to see the light at the end of the tunnel once we hopefully and I believe we will get through this public health crisis.'",
        "'speaker_0': 'So I'm going to let you have the final, final word before we call this bill to a vote.'",
        "'speaker_3': 'Yeah. Just a personal note that, again, I know everybody who represents a district or or even our.'",
        "'speaker_0': 'At-Large.'",
        "'speaker_3': 'Council members share this this really personal feeling that our district and our city is so is so benefited by just an incredible way array of truly beloved small businesses. It's really our small businesses are really what gives our city vitality and make our neighborhoods such wonderful places to live.'",
        "'speaker_3': 'I really believe that we cannot let the coronavirus attack what makes our communities so special. And the hope is that this legislation will give these beloved small businesses and essential non-profits a fighting chance to survive. One of the things that folks have have reminded me is that we do that small businesses do have financial relief coming to'",
        "'speaker_3': 'them. Many folks have have applied. But again, although that financial relief is coming, we don't know how much of the the how much the relief will will mitigate as it relates to the financial impacts of this of this virus.'",
        "'speaker_3': 'Nor do we know necessarily the timing when people will receive receive funds. So this bill will allow people to buy some time and it allows them to enter into a time payment plan of six months after the end of the crisis and allows them a full year to pay off their rent.'",
        "'speaker_3': 'In addition to, as we mentioned before, freezing rent on the types of leases that don't have multiyear commitments for rent increases within them themselves. So thank you, everybody, for working with me on this bill. I think it's a really good example of the types of things that we could do to address the needs of our institutions that'",
        "'speaker_3': 'we care so deeply about.'",
        "'speaker_0': 'Well said, Councilmember Herbold. Let's go ahead and get this bill into law. So I will ask the court to call the roll on the passage of the bill as amended.'",
        "'speaker_1': 'Councilmember Morales.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Mishra i. Councilmember Peterson, i. Councilmember to what.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'See. Councilmember strauss.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Herbold, I. Councilmember suarez i. Council member lewis.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'I think Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Not in favor, not opposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the list to the legislation on my behalf? Let's move on to item two. Will the clerk please read item two into the record?'"
    ],
    "Emergency Childcare Services for Front-line Essential Workers Ordinance.": [
        "'speaker_1': 'Agenda Item two Council Bill 119771 relating to the 2018 Families, Education, Preschool and Promise Levy amending the Levy Implementation and Evaluation Plan adopted by Ordinance 125807 to provide for emergency child care services provided by and confirming the Mayor's Civil Emergency Order.'",
        "'speaker_1': 'Emergency Childcare Services for frontline essential workers, declaring an emergency and establishing an immediate effective date all by a three fourths vote of the City Council.'",
        "'speaker_0': 'Thank you. I will move to pass cancel bill 119771. Is there a second?'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'It's been moved on second. It did pass the bill and as the sponsor of the bill, I'll go ahead and address the substantive parts of the bill and then I will open it up for an amendment that is a friendly amendment from Council member Herbold.'",
        "'speaker_0': 'And then we'll go ahead and take your comments about the bill as amended so really quickly. In June 2018, the City Council approved Ordinance 12560 for submitting a proposition to voters to fund education services with a property tax levy that would generate approximately $619.6 million over a seven year period.'",
        "'speaker_0': 'The Families, Education, Preschool and Promise Levy or FAP lays out four investment areas for levy funding, preschool and early learning K through 12 school and community based grants K through 12 Health and Seattle Promise Section seven of the adopting ordinance, provided that levy proceeds may only be spent in accordance with an implementation and evaluation plan approved by'",
        "'speaker_0': 'the ordinance and by the City Council. That plan was approved by the Council in April 2019 originally, and this plan provides detailed information about Council's funding expectations in each of the four areas that I just previously outlined and March 27, the mayor issued an emergency order that would provide emergency child care services to essential workers, as defined'",
        "'speaker_0': 'by the Washington Office of the Superintendent of Public Instruction. These workers include health care workers, first responders, pharmacy workers, and Grocery Store Workers. Council Bill 119771 was originally transmitted to us by the Mayor's Office and the Department of Education and Early Learning.'",
        "'speaker_0': 'This legislation would amend the Families in Education, Preschool and Promise Levy Implementation and evaluation plan to include temporary emergency child care services for essential or frontline essential workers consistent with a mayor's emergency order that was issued on the 27th of March.'",
        "'speaker_0': 'These would be FAP Levy funded services in order to formally include these childcare services as an eligible expense for use of levy funds. The executive transmitted this proposed legislation to Council amending the Levy's implementation and evaluation plan and the total and total expenditures by the child care services is limited to the amount of funds that otherwise would'",
        "'speaker_0': 'have been used to fund the Seattle Preschool Program during the same period of time. Contracts. All contracts under this bill will be limited to an initial term of 30 days, and the Director of Deal may extend these contracts for up to two additional 30 day periods.'",
        "'speaker_0': 'This proposed bill would declare a finding of the council that child care services with developmentally appropriate activities provided on an emergency basis during school closures. Closures are consistent with a suite of education services defined in the enabling ordinance, and that this bill would also declare that there is an immediate need for essential workers to have access to'",
        "'speaker_0': 'child care services, and it would ratify and confirm the mayor's emergency order. The proposed bill attaches as attachment two to that is listed on this agenda an emergency addendum to the FAP Implementation and evaluation plan that effectively operationalize the Mayor's Emergency Order on child care services for essential workers.'",
        "'speaker_0': 'The agenda makes clear that child care services will be paid for by using funds that were allocated within the preschool and early learning investment area only. These dollars, under normal circumstances, as I previously mentioned, would have been used to support the delivery and operation of the Seattle Preschool Program and the Seattle Preschool Pathway Program.'",
        "'speaker_0': 'However, with the closure of schools and the governor's stay at home order, many of the SBP and STP pathway programs are not currently in operation. That means that FAP levy funds are available to be redirected to support these emergency child care services.'",
        "'speaker_0': 'Importantly, the executive cannot exceed an amount equivalent to the funds that would have been spent on these strategies during the emergency time period. This is an important provision to make sure that future years of SBP and the SBP pathway programs will continue to be fully funded as originally intended in the implementation and evaluation plan we adopted in'",
        "'speaker_0': 'the spring of 2019. And then lastly, I did receive written confirmation from Deal that the FEP Levy Oversight Committee was consulted as required by law, and the Oversight Committee agreed that the implementation of emergency child care services is.'",
        "'speaker_0': 'Inappropriate use of Beth Levy funds during the civil emergency. So colleagues, out of the abundance of caution, I wanted to make sure that we have this bill before us to make sure that we continue to have the accountability and oversight necessary for the expenditure of these important but limited taxpayer approved levy funds in the space of early'",
        "'speaker_0': 'learning. So that is the structure of the bill and what is before us and what this bill will do. Councilmember Herbold has an amendment that she'd like to make to the underlying bill that would require additional reporting requirements.'",
        "'speaker_0': 'So I'm going to hand it over to Councilmember Verbal to introduce formally introduced her amendment, and then we'll take up her amendment and then come back to the substantive bill as amended for comments. Councilmember Herbold and you are on mute, Councilmember.'",
        "'speaker_3': 'I certainly am. Thank you. So I am moving Amendment One to Council Bill 11 9771.'",
        "'speaker_0': 'Back in. So it's been moved and seconded. So why don't you go ahead and address the amendment?'",
        "'speaker_3': 'Sure. So this amendment just simply requires a monthly report from the executive on the emergency child care efforts. I've been hearing from people in my personal network that today, in the efforts of both SPS, Seattle Public Schools, as well as DIAL, that the demand for child care for the identified populations has not been what they initially expected'",
        "'speaker_3': '. And of course, we know that one thing that often happens is once it's provided, then the demand grows. And I just want to make sure that sites don't end up having excess capacity and that there be consideration to expanding child care, a child care provision to other groups of essential workers, for instance, transit workers, the folks who'",
        "'speaker_3': 'are putting their their selves in in harm's way to do the essential work of getting people around, as well as our homeless service providers that are on the front lines. Just want to make sure that if there is excess capacity within the system, that there is an ability to to serve more families.'",
        "'speaker_3': 'And so the required monthly reports from the executive includes the number of emergency child care sites currently open operating and their locations, the number of staff at each site, the number of students at each site, including this aggregation, but the type of essential worker that the parents of those students perform.'",
        "'speaker_3': 'The amount of funds spent on emergency child care services and the fiscal impacts to other families. Education, preschool and promise levy investments from redirecting resources to emergency child care services. This amendment was circulated on Friday to council offices by a central staffer.'",
        "'speaker_3': 'Brian Goodnight. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. Any questions or comments about the amendment? Hearing and seeing none. We will go ahead and take up the amendment. Will the clerk please call the roll on the adoption of Amendment One?'",
        "'speaker_1': 'Councilmember Morales. Councilmember Morales.'",
        "'speaker_2': 'Hi. Sorry about that.'",
        "'speaker_1': 'Councilmember Macheda.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council members want.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Strauss.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Herbold, I. Councilmember Suarez, I. Councilmember Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'President Gonzales.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Nine in favor, nine opposed.'",
        "'speaker_0': 'The motion carries and the amendment is adopted. Colleagues, are there any further comments on the bill as amended? Councilmember Herbold, the floor is yours.'",
        "'speaker_3': 'Thank you. This is more of a just a flagging of an issue. And. Council President Gonzales, you may you may know whether or not Jill is planning to to address this. But one of the issues I think that was in some ways raised in the letter from the advisory board relates specifically to a really important equity issue'",
        "'speaker_3': '. Given that child care providers provide care for the children of doctors and nurses who are on the front lines and exposed to coronavirus every day and through the children that they're caring for, child care workers are facing are facing the same exposures.'",
        "'speaker_3': 'And there's been a movement towards hazard pay for grocery workers, hazard pay for homeless service provider providers. And I'm just wondering if the department is considering whether or not to consider hazard pay for this this group of professionals that are doing essential work that is critical to the functions of our first responders.'",
        "'speaker_0': 'I do not know the answer to that question. I know that the question has been posed. I think it's an important question, and I know that there's been, at least as it relates to the contracts with childcare providers in in school public school buildings, there's been a lot of conversation about sanitation and how to make sure that'",
        "'speaker_0': 'the environment is is as safe as it can possibly be under the circumstances. But I think that it's a it's an important question to get a follow up information from from deal, and we'll make sure to do that and circulate it to you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'You're welcome. Are there any other questions or comments? Councilmember Mosquito, please.'",
        "'speaker_3': 'Thank you. Council President.'",
        "'speaker_0': 'I thank you for your work on this legislation.'",
        "'speaker_3': 'And thanks to the Mayor's office for sending it down. I agree with all of the comments that Councilmember Horrible just outlined as well in terms of.'",
        "'speaker_0': 'Who needs access to these critical child care services. So I appreciate.'",
        "'speaker_3': 'That friendly amendment. I also note that the Department of Early Learning director.'",
        "'speaker_0': 'Chappelle has received.'",
        "'speaker_3': 'A email from the folks at SEIU 925 who are contract workers who provide childcare to individuals throughout the city and SEIU. 925 represents family childcare providers throughout the city. I'm hoping that they will continue to be used as an.'",
        "'speaker_0': 'Important resource in this effort.'",
        "'speaker_3': 'To make sure that all of our essential.'",
        "'speaker_0': 'Workers have access to high quality childcare.'",
        "'speaker_3': 'As we current for the current population and for any.'",
        "'speaker_0': 'Expanded population.'",
        "'speaker_3': 'Just want to note from the email that they sent, they note that the city of Seattle is a strong has a strong.'",
        "'speaker_0': 'Labor history and that.'",
        "'speaker_3': 'SEIU wants to help provide.'",
        "'speaker_0': 'Workers across our region with access to high quality childcare and also make.'",
        "'speaker_3': 'Sure that they're accessing high quality childcare.'",
        "'speaker_0': 'For those who are organized and have a.'",
        "'speaker_3': 'Voice on their job, especially in this time.'",
        "'speaker_0': 'We know how important.'",
        "'speaker_3': 'It is for people to be able to raise their hand and speak up if they feel unsafe at their place of employment. And that's true for the grocery workers who we help protect by removing the five cent fee for bags last week and also.'",
        "'speaker_0': 'Includes childcare providers as we look to make sure that their services are available across the city.'",
        "'speaker_3': 'So just want to ping.'",
        "'speaker_0': 'That for our department as they're looking.'",
        "'speaker_3': 'To deploy not just our city dollars, but also the King County PTA money and look forward to their ongoing.'",
        "'speaker_0': 'Participation with our friends at SEIU United five. Thank you for those comments. Really appreciate the the note there. I will say that in my conversations with the executive, it's my understanding that there's they're looking at at every single opportunity they can to figure out how to meet the childcare needs for essential workers.'",
        "'speaker_0': 'And so that includes not just contractors in center based facilities, but, you know, sort of making sure that we're keeping an eye on how we can make sure that the system is being fully responsive. And I think that the amendment that was advanced by Councilmember Verbal that we've now adopted is going to help us fine tune exactly'",
        "'speaker_0': 'where the gaps are to the extent that there are gaps. And so I think that that that those data points will be absolutely critical to understanding how else we can modify the model in order to meet this critical need for these workers.'",
        "'speaker_0': 'Are there any other questions or comments from my colleagues? Okay. Hearing them. I just want to say that I'm I'm I'm really excited that we can advance this legislation. I'm also mindful of the impact that it can have on levy existing levy funds and programs and services that we fund through it.'",
        "'speaker_0': 'That's part of the reason why I wanted to make sure that out of the abundance of caution, we had a legislation to formalize this as opposed to just relying on an executive order. I think it's important for us to have that accountability and that transparency around how these dollars are going to be spent and having sort of'",
        "'speaker_0': 'additional details out in the public about our expectations around how the executive order was going to be operationalized in this space. I will say that that that doing this work just really highlights for me that we still have an absolute crisis around child care in our city.'",
        "'speaker_0': 'It's part of the reason why we are scrambling. And so it's not not just a crisis for these essential workers, but for everybody. And I think we're seeing that during a period of a public health crisis, in a pandemic like this, we are experiencing the gaps in our child care system and in an even deeper, more profound'",
        "'speaker_0': 'way. And that's part of the reason why I've been working with so many of you and former council colleagues on on really, really making sure that we're having a conversation about how to best meet the needs of working families who have children in our city.'",
        "'speaker_0': 'So I think this is a good step, good step forward for this small body of workers, but look forward to being on the other side of this coronavirus and continuing to have a conversation about how we meet that, how we close the gaps in the childcare space in the long term.'",
        "'speaker_0': 'So with that being said, I am going to ask the clerk to call the roll on the passage of the bill as amended.'",
        "'speaker_1': 'Councilmember Morales.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Mesquita.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilmember Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council members. So what.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Strauss.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Herschel. Council member Herbal. I. Councilmember Suarez. Right. Councilman Lewis, I. President Gonzales.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it will court please affix my signature to the legislation on my behalf. All right. Agenda item three. Will the clerk please read agenda item three into the record?'"
    ],
    "Ordinance to Temporarily Suspend and Supersede Hearing Examiner Deadlines.": [
        "'speaker_1': '119770 relating to the Office of the Hearing Examiner temporarily suspending deadlines imposed by the Seattle Municipal Code for the duties of the hearing examiner temporally standing several sections of the state on a separate but imposed deadlines on the actions of the hearing examiner and ratifying and confirming certain prior acts.'",
        "'speaker_0': 'Thank you. I will pass Council Bill 119770. Is there a second?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'And thank you. It's been moved and seconded to pass the bill. And as sponsor of the bill, I'll go ahead and address the bill first and then we can I will ask for comments. So as I mentioned this morning during council briefing, the hearing examiner has requested that the council consider passage of Council Bill 119770.'",
        "'speaker_0': 'This legislation will temporarily suspend deadlines required in the municipal code for the Office of the Hearing Examiner. Due to the COVID 19 emergency, in response to the governors and mayors orders during the Civil Emergency Hearing, Examiner Ryan Mansell published important emergency rules to provide guidance on the operating rules for the Office of a Hearing Examiner during the'",
        "'speaker_0': 'COVID 19 emergency. Those rules were to be in effect for 60 days and include closure of his office to the public, allowing remote hearings, allowing electronic filing of documents, suspending in-person payment of fees, and allowed people to pay their fees later if the office closure impeded, if the office closure prevented payment from being made timely.'",
        "'speaker_0': 'These are all important actions to comply with public health guidelines and to help prevent the further spread of the coronavirus to the public and to the hearing examiner staff. Of course, the Office of the Hearing Examiner is something that is created by statute, is an independent office, and they require this bill in order to have the flexibility'",
        "'speaker_0': 'needed to continue to comply with these public health orders. So Council Bill 119770 will temporarily suspend statutory deadlines. The suspension will automatically end with the termination of the civil emergency. It's important for us for me to note that this bill does not suspend deadlines applicable to city departments, appellants or other participants in cases that come before the'",
        "'speaker_0': 'hearing. Examiner And this bill only provides the hearing examiner relief from the stringent deadlines that would make it difficult for the Office of Hearing Examiner to comply with the governor's stay home state health order. So for those of you who took a look at Amy Goard, city council central staffer Amy Gore's memo, you will note that she'",
        "'speaker_0': 'made sure to highlight that there is that particular issue. If we as a council want to take up the issue at a future date to consider suspending deadlines for city departments or for the other litany of folks that I just mentioned.'",
        "'speaker_0': 'We could do that, but council central staff has identified that it would be appropriate to consider that that temporary policy relief or shift in the separate and newly introduced bill. So I will have conversations with the hearing examiner to see if that is something that makes sense from a policy perspective.'",
        "'speaker_0': 'And also happy to hear from any of you all at a future date as to whether or not that is a policy shift that would be of interest. So that is the essence of this bill and I'm happy to entertain any comments.'",
        "'speaker_0': 'Are there any comments on the bill? Hey. Hearing and seeing none. I will ask the clerk to please call the role on the passage of the bill.'",
        "'speaker_1': 'Councilmember Morales.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Mesquita I council member Peterson. I help the members a lot. I. Councilmember Strauss.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Herbold. I. Councilmember Suarez, I. Councilmember Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'President Gonzales.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor.'",
        "'speaker_0': 'Nine oppose the bill so those in the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? We will now move to other business. I have one item of other business, but before I go through that, is there any other further business to come before the council from any of my'"
    ]
}