{
    "Cable Communications Ordinance Update and Community Technology Advisory Board Revisions.": [
        "'speaker_0': 'Please read item two the first three clauses of that bill.'",
        "'speaker_4': 'The Report of the Public Safety, Civil Rights and Technology Committee. Gender number two Cancel 118 347 relating to the city's cable communications ordinance. Amending Chapter 21.60 of the State of Missouri Code to reflect advances in technology and changes in federal law to create a logical organization of the Chapter four ease of reference to promote competition in cable'",
        "'speaker_4': 'services, to enhance consumer protection, and to preserve the city's authority in a fluid regulatory environment. Updating the membership requirements and duties of the citizens telemarketing issue excuse me. Telecommunications Safety Technology Advisory Board renaming it the Community Technology Advisory Board and moving the requirements and duties of the board from Chapter 21.62 Chapter 3.20 to renaming Subtitle five of'",
        "'speaker_4': 'Title 21 and Chapter 21.60. The committee recommends the bill passed as amended.'",
        "'speaker_0': 'Thank you, Councilmember Harrell.'",
        "'speaker_5': 'Thank you very much, Council President. Before I get into the substance of the ordinance, I have two amendments. The First Amendment has two components of them, and then the second one is a technical amendment. So let me move.'",
        "'speaker_5': 'Let me read the amendments and let me get them in the record, and then I'll describe how these amendments fit into the context of the entire ordinance. So having said that, I move to amend Council Bill 118347 Section 21 by substituting subsection A3 of SME C 21.6 .170 with the following paragraph.'",
        "'speaker_5': 'Now, clerk, I'm going to have to, I have to read this literally in the record verbatim. Correct. Yes. I'll take that as a yes.'",
        "'speaker_0': 'Or you can have the clerk read it. Whichever.'",
        "'speaker_5': 'I'll read it. I like to hear myself read sometimes. Okay. Section number three All grantees to verify low income requirement grantee shall meet with and provide documentation to the Office of Cable Communications not less frequently than Semiannually to demonstrate that it has met the low income service provision requirement in subsection 21 desk 60-170.8.1.b for a new franchise'",
        "'speaker_5': 'if applicable at the time of a particular meeting or in subsection. 21.6 0.170.8.2 for a renewed franchise. Quarterly. The Office of Cable Communications shall provide to council a copy of the grant of grantees documentation demonstrating that Grantee has met its low income service provision requirement, along with the Office of Cable Communications Analysis of Grantees documentation.'",
        "'speaker_5': 'If Grantee does not demonstrate compliance. The Office of Cable Communication shall report the noncompliance to council in its quarterly report. The Office of Cable Communications shall provide these quarterly reports for the first five years of a new franchise and for the first two years of a renewed franchise and shall continue to provide these quarterly reports thereafter, if'",
        "'speaker_5': 'so requested by the Chair of the Council Committee with Oversight Responsibility for Cable Issues. The other part of the amendment is this. And by adding a new subsection four entitled The Office of Cable Communication shall develop procedures and metrics to implement this subsection 21.6 0.1708 to describe how compliance with the low income service provision requirement will be'",
        "'speaker_5': 'measured and what threshold of service will be deemed to constitute compliance. That is the First Amendment that I move.'",
        "'speaker_0': 'That it's moved in second, and the Councilmembers Herald Harrell's amendment be adopted. You want to make any comments or are there any questions?'",
        "'speaker_5': 'Did any of you understand that?'",
        "'speaker_0': 'Yes, we understand it. You did a good job in briefing this morning. All in favor of the amendment vote. I oppose vote no. The amendment is unanimously adopted.'",
        "'speaker_5': 'Okay. And in all seriousness, I will talk about what these amendments do does to the base legislation. The Second Amendment is a very simple one. I move to amend Council Bill 118347, section 32 to fill in two blanks with council bill number 118347.'",
        "'speaker_0': 'It's moved and seconded that Councilmember Harrell Second Amendment be adopted. Any questions all in favor of adopting the amendment vote. I oppose vote no. The amendment is unanimously adopted.'",
        "'speaker_5': 'Okay. Thank you very much. So the legislation as amended, we're basically revising the cable code. And for those sort of following this issue, our cable code basically was established about 40 years ago and governs how cable providers operate within our city.'",
        "'speaker_5': 'As you well know, we have a changing regulatory environment in terms of who who regulates phone service and who or what body regulates the Internet service. This is dealing with cable providers. So the cable code sort of demonstrates how we treat cable providers and how they treat consumers such as yourself or Comcast or CenturyLink could be an'",
        "'speaker_5': 'example. So the last time we've we've updated this cable code around 2002, so these updates that were really impressively done by our city departments and elected officials and members from the executive team and the council does a few things.'",
        "'speaker_5': 'Number one, it eliminates cable franchise district. And you may recall that prior to today we had five distinct districts and a cable provider would have one districts. And so by eliminating the districts, we're basically creating competition, allowing cable providers to basically build over one another such that you can have competition and competition and drive up quality, drive'",
        "'speaker_5': 'down costs, drive down price. And this is a good thing for the city. We've allowed or encouraged cable providers to build out, put their capital, put their plans into different communities where they are not operating now. And that's how we get the competition that we want.'",
        "'speaker_5': 'We've enhanced the call answering standards in reporting. So in other words, when you call in, many of you have gotten on to what's called an IVR, an interactive voice response unit. And we've looked at the customer response time and how long it takes you to get a live body and put in some very stringent requirements, such as'",
        "'speaker_5': 'a call wait time has to be limited to 3 minutes that a customer service representative has to be on the phone within 30 seconds. So these are some very aggressive, aggressive customer service requirements. That we're now posing. If a cable operator are to provide cable service in the city of Seattle, we've restricted long term exclusive contracts in'",
        "'speaker_5': 'multi-family dwellings or condominium units as an example, such that if you're a resident there and you can only have one service provider, we're making sure that that service provider can lock that customer into an exclusive contract, thereby giving the consumer choices.'",
        "'speaker_5': 'We've changed the name of one of our very important advisory boards, a Citizens Telecommunications and Technology Advisory Board Sea Tower, changing its name to the Community Technology Advisory Board, recognizing strongly that many of the people we provide service, many of the people here are not technical citizens in the literal or legal sense and could be undocumented persons'",
        "'speaker_5': '. And we certainly serve many communities and this is a advisory board representing the entire community. The the amendments that I read in earlier was some great work done by Councilmember Lakota and other community activists, making sure that as we stimulate competition, that we're not forgetting our underserved, not forgetting areas where there could be underrepresented communities.'",
        "'speaker_5': 'And we are encouraging and measuring and requiring that these cable providers provide service in underrepresented communities. I've said at another forum that I look at digital literacy and access to the Internet is almost a human right that without it people cannot get education, they cannot apply for jobs, and it becomes a critical, necessary service.'",
        "'speaker_5': 'And as we look at cable opportunities, we want to encourage this kind of innovation neighbors, such that they can get cable, they can get audio, they can get Internet, etc.. So this is these are good amendments, I think.'",
        "'speaker_5': 'And certainly I appreciate that Councilmember La Carte is leadership in this regard. So there you have it. Our updated advisory code, I rather our cable code and I want to thank Martha Lester for her outstanding work and central staff and the members of Do It, the director, Michael Matt Miller.'",
        "'speaker_5': 'Tony Perez. I don't know if people know that we do have representatives in our department that are nationally known for protecting the rights of consumers, nationally respected. And thank you for your work on this work. And I hope the Council supports this legislation.'",
        "'speaker_0': 'Thank you. Questions or comments? Councilmember Liccardo and Councilmember Swan.'",
        "'speaker_3': 'I want to thank Casper Herrell for taking on this big task. You re revising and updating our cable communications ordinance and the code. As he rightly pointed out, there are a number of outdated elements that needed to really catch up to our obligations and the technology available to us today the most.'",
        "'speaker_3': 'And I also want to thank him for working with me in updating the amendments so that we really focused in on what significant. Basically reaching a significant portion of low income neighborhoods would be by tightening it up and saying that we wanted actual metrics and that we wanted quarterly reports.'",
        "'speaker_3': 'We then can feel confident that we can introduce competition between the companies but at the same time not have them cherry pick the more well off neighborhoods and ignore the poor neighborhoods. That's what's critical to this legislation, I believe.'",
        "'speaker_3': 'And so by having the cable companies come to the city with quarterly reports, we can assure that our lowest income neighborhoods will not be ignored and will receive adequate cable coverage. So thank you very much. Customer Help you work on this?'",
        "'speaker_0': 'Councilmember So on.'",
        "'speaker_6': 'Thank you, President Burgess and I thank council members Harlan Legato for their comments. As we would all agree, price gouging by cable companies, as you know, has reached a legendary status. And anybody who doctor will tell you that it is a real issue, not just in Seattle, but in every jurisdiction around the country.'",
        "'speaker_6': 'And any move to reduce the monopoly powers of these companies and to reduce prices is a step in the right direction. However, I'm generally against deregulation of cable companies that are already engaging in this egregious gouging. And I don't think that by itself, removing the regulation on the so-called cable districts will be sufficient to inspire the sort'",
        "'speaker_6': 'of competition that we're talking about, that we need to end monopolies that plague our city. And in reality, to do that, we will need to directly build municipal broadband. And I don't think that bribing cable cable companies with sweetheart deals is a solution.'",
        "'speaker_6': 'Having said that, I think a very strong amendment was introduced, you know, by council members to go down hard and thanks to all the consumer rights activist and technology activists who pushed for that amendment. I think that while I don't think that this will by itself result in competitiveness that we want, it does the amendment does address'",
        "'speaker_6': 'the problem of cherry picking customers, and that exacerbates the digital divide. And I supported the amendment. And with that amendment, I support the bill. If that amendment hadn't been there, I would have voted no. There's some good consumer protection.'",
        "'speaker_6': 'Improvements have been introduced in the bill, for example, requiring a live person on the phone no more than three after no more than 3 minutes of automated response. I think everybody will agree that that is a good thing.'",
        "'speaker_6': 'It's very frustrating to have automated phone conversations where your problems are not being addressed, but I also think that a lot is being left to directors rules. I mean, what happens if a cable corporation does not meet its low income requirements?'",
        "'speaker_6': 'I think the job of future councils is to ensure that the Office of Cable Communications monitors compliance and imposes penalties on cable corporations that fail to comply with the requirements of the amendment that was introduced. Just to let everyone know the language of the amendment, says the Office of Cable Communications, may also impose penalties for grantees failure'",
        "'speaker_6': 'to comply with the additional requirements. So I think that language will have to be strengthened in the future if we see failure to comply. But I will support the bill given the amendment. Thank you.'",
        "'speaker_0': 'Are there questions or comments? Councilmember Harrell.'",
        "'speaker_5': 'I'll make some comments. I think that with support, I'm not sure. But in any event, it should be crystal clear. What we smartly did was we reserve the right for us, the Office of Cable Communications, to decide whether this these investors, these cable providers are investing in our communities.'",
        "'speaker_5': 'Another route could have been we didn't reserve that unilateral or unilateral right to make that determination. And again, we have national experts on making sure we protect the rights of the underrepresented. So I think that was outstanding negotiation and good legislation.'",
        "'speaker_5': 'We regulate cable television, not broadband, not fiber, not Internet in terms of Internet connectivity. So this is not dealing with, for example, the telephone service, which is regulated by the Washington Utilities and Transportation Commission. So this is something we have control over.'",
        "'speaker_5': 'And I think, again, the spirit of this legislation is to to do exactly to create competition, not to comply with monopolies. We don't want monopoly. And I sort of tried to give the context that the whole spirit of this are to have multiple entries.'",
        "'speaker_5': 'And I would agree with Councilmember Stewart. So we don't want a monopoly in any of these providers. And that's the intent and that's the clear language of this legislation. And so I do ask for your support.'",
        "'speaker_0': 'Thank you. Will the clerk please call the roll on council? Bill 118347 as amended.'",
        "'speaker_2': 'Clark I got in.'",
        "'speaker_5': 'Harrell, I.'",
        "'speaker_2': 'Licata, I. O'Brien Hi Rasmussen. I so want President Burgess High eight in favor. None opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read items three and four.'"
    ],
    "Development Agreement and Property Conveyance for Pike Place Market Project.": [
        "'speaker_0': 'Please read item number five.'",
        "'speaker_4': 'The part of the Committee on the Central Waterfront Seawall and Alaskan Way Viaduct Replacement Program Agenda Item number five Constable 118339 relating to the Pike Place Market Preservation and Development Authority authorizing the Director of the Office of the Waterfront to enter into a development agreement to distribute 34 million bond proceeds and to convey certain real property located'",
        "'speaker_4': 'at 1901 Western Avenue. South Seattle, Washington. To excuse me. SEATTLE, Washington. Two The authority for the development of a mixed use project with public parking, low income housing, public open space, retail and commercial space, authorizing the acceptance of an easement from the authority on that property and authorizing the Director of the Office of Waterfront and Housing Director'",
        "'speaker_4': 'to execute documents and to take other actions. In connection with this project, the committee recommends this bill passes amended.'",
        "'speaker_0': 'Thank you, Councilmember Gordon.'",
        "'speaker_1': 'P.S. one North is a city owned property and with the viaduct coming down, it is an opportunity to see the land developed by the public for the public. The Pike Place Market is the right partner in this public project.'",
        "'speaker_1': 'It has been 40 years since the market has seen an upgrade, but this project is about so much more than just an expanded market. Through this project, the city in the market will develop more short term parking and affordable housing to downtown, as well as create public plazas and a connection from the Pike Place Market to the'",
        "'speaker_1': 'Waterfront. This is an exciting step for Seattle and a momentous vote for the council today. And I thank you so very much to the members of the committee for their support for Council Bill 118339.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Clerk I got in. HARRELL Licata, I.'",
        "'speaker_3': 'O'Brien All right.'",
        "'speaker_2': 'RASMUSSEN So on. President Burgess eight in favor and unopposed.'"
    ],
    "Ordinance to Prohibit Evictions from Unregistered Rental Housing Units.": [
        "'speaker_0': 'The bill passes and the chair will sign it. The report of the Housing Affordability, Human Services and Economic Resiliency Committee. Please read item six.'",
        "'speaker_4': 'Three by the Committee on Housing Affordability, Human Services and Economic Resiliency Agenda. Item number six Council Bill 118 340 Amending certain Mr. Code Sections 2.206. 160 and 22.21 4.0 75. To prohibit evictions of residents residential tenants from rental housing units if the units are not registered with the Department of Planning and Development as required by SNC.'",
        "'speaker_4': '22.2 14.0 40. The committee recommends that the bill passed as amended.'",
        "'speaker_0': 'Thank you, Councilmember Clark.'",
        "'speaker_1': 'Thank you. This item relates to a bigger policy and program change that the city instituted a couple of years ago, which is the requirement that if you run a rental housing business of however many units that might be small or large, you have to be registered with the city.'",
        "'speaker_1': 'And it is part of attesting and proving that rental properties in the city of Seattle are actually safe and habitable for people to live in. One of the things that was unfortunately not addressed at the time has to do with evictions, and none of us really like to talk about evictions, but they happen, and both parties should'",
        "'speaker_1': 'be well aware of their rights within that. One thing that we didn't note was that really in order to pursue an eviction, one needs to be legally registered and operating under the law within the city of Seattle in order to have protection of the just cause ordinance.'",
        "'speaker_1': 'So this proposed legislation prohibits a rental property owner from evicting a tenant from a rental housing unit. If the rental unit is not registered as required, not properly registered under the city's rental registration and inspection ordinance. Under the city's ordinance, owners of rental properties must be registered by a certain date, depending on how many units are in'",
        "'speaker_1': 'the building. So properties with ten or more units, they needed to be registered by September 30th of 2014. Properties with 5 to 9 rental units must be registered by March 31st of 2015. That's very soon for anybody who's listening.'",
        "'speaker_1': 'Properties with between one and four rental housing units. And that's really the larger the larger mass of owners in the in the city must be registered between June 15th and December of 2016. So again, this makes clear that in order to pursue an eviction, if you're supposed to be signed up with the rental registration and inspection ordinance'",
        "'speaker_1': ', that you had to do that in order to be pursuing a just cause eviction in the city of Seattle. There we did have some helpful commentary from folks who unfortunately have experience with evictions, be it on the tenant side or the landlord side in court.'",
        "'speaker_1': 'And so we did work out an amendment that was forwarded by the Washington Multifamily Housing Association, and I appreciate their careful review of this. And there was the issue brought up that if really there's a health and safety issue coming up and if the if the property owner is pursuing a court level eviction and if it really'",
        "'speaker_1': 'is a health and safety issue, you don't want somebody to have to start over. You want to be able to help cure the problem quickly. So this amendment allows a rental owner who has filed an eviction lawsuit in court and who becomes aware that the rental unit is not registered under under REO to be able to pursue'",
        "'speaker_1': 'the eviction with just cause that they have time then to become registered and then to proceed with the lawsuit, they would not have to start over from square one again. It allows the owner to comply with you and then to proceed with the lawsuit without it being fully dismissed by the judge or the magistrate.'",
        "'speaker_1': 'The situation could arise in the early phases of implementation of the rental, registration and inspection ordinance. I think we have we have another report coming up soon, letting us giving us some idea of how many people we think are registered at this point.'",
        "'speaker_1': 'And so the numbers are climbing, but it is an education process. The committee recommends adoption of this change.'",
        "'speaker_0': 'Thank you. Questions or comments? Council members who want.'",
        "'speaker_6': 'I think this is a good step forward, and I'm happy to support this council bill to close the particular loophole as described by Councilmember Clark in the city, still in protections. And we all know this is happening rampantly throughout the city where there are more and more horror stories of tenants in Seattle losing their homes to the'",
        "'speaker_6': 'greed of developers. And just as an example of how much farther we need to go, my office I started organizing with a building full of tenants near Otello, and those tenants are being told that they will not have access to relocation assistance because of the kind of leases they sign.'",
        "'speaker_6': 'And they are being told by their landlord that they sign away their lives, their right to relocation assistance from the by the leases that were signed years ago. This particular law that we're voting on today is a good thing, but that's the the loophole that is allowing the landlord to exploit those tenants in Ontario will not be'",
        "'speaker_6': 'addressed. But this law and I raised this to point out that there are so many loopholes that are being used as use against tenants. And we need laws to close all of those loopholes and to protect tenants.'",
        "'speaker_0': 'Any other questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Clerk Darren Harrell. Licata O'Brien II Rasmussen. So while President Burgess. Ian Favre. None oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read items seven and eight.'"
    ]
}