{
    "Sale of City-owned Property in Latona Addition.": [
        "'speaker_1': 'Thank you and congratulations. I look forward to working with both of you. Okay. Let's go to agenda item number three and please read the short title.'",
        "'speaker_2': 'Engine item three, cancel 119 357 relating to the sale of lots one, two, three and four of block seven in the Latin edition to the City of Seattle Committee recommend civil pass.'",
        "'speaker_1': 'Jasper and Beck show.'",
        "'speaker_4': 'You this is a sale of property over on Burr Gilman next to Dun Dun Lumber. It is a 15,000 square foot property that is known as the Brickyard and it has a sales price of not less than $2.575 million.'",
        "'speaker_4': 'It is in an area that is zoned industrial. I see 45. The possibility of residential uses there have been eliminated simply because of the zoning. And I would just want to say council members want your legislative aide came to my office this afternoon and asked if there was a reason why the money could not go back into'",
        "'speaker_4': 'the housing fund. And the answer is, is that when the property was purchased, it was purchased with gas tax fund moneys that must go back into the Transportation Department. So I just want you to know that we did look into it.'",
        "'speaker_4': 'We did ask that question. And if this is approved and the transfer is completed today, the receipts that the city Department of Transportation receives will go back into as stock money and into their funds. So there has been great community support for this.'",
        "'speaker_4': 'I just want to acknowledge that at my meeting last week, we had members of the Neighborhood Cascade Bicycle Club, the pedestrian organization Feet First were there just to support this. And we really appreciate the visuals that we saw from Dunn Lumber with the idea that it will be part of the neighborhood.'",
        "'speaker_4': 'It will tie itself into Burke Gilman, that people will be invited to come in, use the facilities, and just it will be a real neighborhood asset. At the same time, it expands some space for that company that is very important to the Wallingford neighborhood.'",
        "'speaker_4': 'So we recommend that this purchase and sale proceed.'",
        "'speaker_1': 'Very good. Any questions or comments? Customer I'm a skater.'",
        "'speaker_2': 'Thank you, Mr. President. I just want to say thank you to Chair Bagshaw for her work on this and for her staff and central staff's willingness to answer the various questions that I had. One of the issues that you've heard us continually talk about this year is the ability to keep public land in public hands and build'",
        "'speaker_2': 'housing on it. This is the question that we look forward to asking for every parcel of land as soon as we're able to hopefully pass the disposition policy here soon. Here's a great example where our city departments did ask that question, and the answer was, we cannot build housing on this relatively small plot of land.'",
        "'speaker_2': 'It is not zoned for housing. It is not zoned for mixed use, and thus we cannot put housing above it. And given the size of this lot, it makes sense to continue to allow done lumber to expand their production there in this industrial area, to promote good living wage jobs in this area and make sure that we're'",
        "'speaker_2': 'connecting the community. I really appreciated that. Even though we don't have the ability to build housing here, the vision, the model that has been outlined for us includes, as Councilmember Bagshaw just mentioned, the use of a public space on the ground floor so that we're connecting the trail to community space there.'",
        "'speaker_2': 'And so I'm really looking forward to how we partner more with organizations that are interested in this trail oriented development, as they called it, so that we can get more individuals of all ages, ethnicities, languages, races, genders, abilities, using the Burke Gilman connecting our community to public assets like the ones that we already have down there on'",
        "'speaker_2': 'the north end of Lake Union and the ones that are soon coming. So I will be a yes in support of this legislation.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Coach Marion Johnson.'",
        "'speaker_0': 'I won't repeat the excellent points made by both of my previous colleagues, but just want to say thank you to the folks from the Department of Transportation Affairs and in particular the folks representing the Dunn family and the Dunn family themselves.'",
        "'speaker_0': 'First learned about this project about four years ago, and it's taken us a little while to get to this point. But we're glad to be here and excited to see a project that has such strong commitment from so many different diverse stakeholders move forward.'",
        "'speaker_1': 'Excellent customer.'",
        "'speaker_2': 'GONZALEZ Thank you. Just to join the chorus here, I also wanted to take a moment to recognize the good work done on the efforts here. I think this is a good example of what happens when we do have surplus land and we have a property owner excuse me, a a purchaser of the property who has really gone'",
        "'speaker_2': 'gone above and beyond to do the necessary community outreach to make sure that folks in the neighborhood understand why it's going to be repurposed for X, Y, Z purposes. And so I want to commend the folks over at Dunn Lumber for the good work you all did to do some of the hard work and lifting around making'",
        "'speaker_2': 'sure that the Wallingford community really understood what the project meant and what the scope would be. And so I just want to thank you all for for that and also for briefing me personally about, I think, a year ago already at this point to make sure that we understood in our office exactly what was going to be'",
        "'speaker_2': 'done on this parcel of land and also all the work that had already been done in terms of community outreach. So kudos to you all for having a very smooth process and really look forward to seeing the end result.'",
        "'speaker_2': 'I think it's going to be a huge contribution to this part of part of the city. So thank you.'",
        "'speaker_1': 'Thank you for those words. Okay. When anyone else like to comment or ready to vote, please call the roll on the passage of the Bill.'",
        "'speaker_6': 'Bagshaw.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Gonzalez Herbold High Johnson Macheda I O'Brien All right. So what President Harrell high eight in favor and.'",
        "'speaker_1': 'Unopposed the bill passes and the chair of the Senate please read the items four and five.'"
    ],
    "Human Rights Code Amendment for Domestic Workers and Hiring Entities.": [
        "'speaker_2': 'The reported Civil Rights, Utilities, Economic Development and Arts Commission that in six Kasapa 119 351 relate to the Human Rights Code, broadening coverage of unfair practices to include domestic workers in hiring entities, extending protections to domestic workers workers, and extending obligations to hiring entities.'",
        "'speaker_2': 'Amending Sections 14.0 4.0 20 and point zero 30 zero. Mr. Code and adding a new section 14.0 4.2 30 of the USMCA. The committee recommends the bill passed as amended.'",
        "'speaker_1': 'Councilmember Herbold, appreciate it.'",
        "'speaker_3': 'So I want to thank everybody who's joined us here again today to talk about the need for this bill. I was first approached about this legislation by Councilmember Mosquito during the Domestic Workers Bill of Rights deliberations. You've all shared with us your heartbreaking stories of sexual harassment and discrimination in the workplace.'",
        "'speaker_3': 'And I'm honored to play play this small part in addressing this horrible problem in your workplaces and in the workplaces of your coworkers. This legislation is designed to help protect domestic workers from the forms of abuse that we've heard about today and to ensure that when it does happen, that you are able to bring these claims to'",
        "'speaker_3': 'the Office of Civil Rights, the in particular, their legislation extends the recourse available to the Office of Civil Rights to include domestic workers who are identified as independent contractors. Domestic workers who are considered employees already have the protection.'",
        "'speaker_3': 'The legislation amends the Fair Employment Practices Section 14.04 of the Municipal Code to add a section reflecting that the chapter covers domestic services and amends the declaration of policy and the definition sections. The amendment to the Declaration of Policy section states that the chapter applies to hiring entities, domestic workers and employees.'",
        "'speaker_3': 'The definitions section adds in the definition of hiring entity and domestic worker and adds in those terms and domestic service to the existing definitions as applicable. Lastly, the Municipal Code also adds that if an individual or household contracts with a separate hiring entity, that hiring entity is solely liable for any violations of the chapter unless the individual'",
        "'speaker_3': 'or household interferes with any rights established. This provision ensures that the correct entity will be held liable if the chapter is violated. One amendment to the bill that I would like to to move forward. I moved to amend Council Bill 11 9351 by adding a new Section five entitled Sections one, two, three and four of the ordinance'",
        "'speaker_3': 'six shall take effect on July 1st, 2019. Second. Thank you. The the amendment to the bill accomplishes a couple of different things. The legislation that I referred to earlier to council councilmember Mosquitoes, Domestic Workers Bill of Rights legislation goes into effect on July 1st, 2019.'",
        "'speaker_3': 'This allows for a implementation that will be led by members of the workers board. It's going to be important to also include discussion around this element. In addition, the there are some there are some funding issues associated with this legislation.'",
        "'speaker_3': 'There's a fiscal note that the implementation of this legislation, education and outreach, is about $75,000. And that's something that I'm hoping that will take up in the budget. So there's both sort of a bureaucratic and technical reason for aligning the implementation date, but there's also an important fiscal reason for it.'",
        "'speaker_1': 'So we have first an amendment before we speak to the base. Legislation in council member Herbold amended the Section five, which is basically sections one, two, three and four. The ordinance today, the effective date. And I assume implicit in that is the re numbering and the remaining sections accordingly.'",
        "'speaker_1': 'Correct that amendment. So just on the amendment, any questions on the amendment? I'm just on the amendment. All those in favor of the amendment. Please vote I. I oppose. The ayes have it. So we have now base legislation.'",
        "'speaker_1': 'There's been a minute. Councilmember skater, would you like to speak to it?'",
        "'speaker_2': 'Thank you, Mr. President. I do want to start with a huge appreciation, a note of appreciation for Councilmember Horrible. She's taken this incredible component of the policy and made sure that it was expedited, that we had the full stakeholders at the table for conversations, that we work with the domestic workers and the hiring entities to make sure'",
        "'speaker_2': 'that this critical component was part of the Domestic Workers Bill of Rights. You called that a small part of the solution. But in essence, this is the backbone of the domestic worker protections that I think many domestic workers wanted to see.'",
        "'speaker_2': 'Every single story, yes. Included stories about wage theft, included stories about the need for rest breaks and meal breaks, protection from having documents withheld, the desire to have a table so there could be ongoing negotiation. But every single story included an element of harassment, intimidation and retaliation.'",
        "'speaker_2': 'And what you've been able to pass today really completes this puzzle. I just want to say thank you for your steadfast leadership, also for taking a critical look at what legislation or what words we needed to have in this component of the legislation so that we could align the implementation of midyear next year so that the domestic'",
        "'speaker_2': 'workers board can think through the outreach plan, which is going to be critical with Office of Labor Standards and the Office of Civil Rights to work directly with our community partners, many of whom are here today, so we can do the outreach needed so that we can avoid confusion and not knowing which policies apply at which time'",
        "'speaker_2': ', and also making sure that the department really thinks through rulemaking with the stakeholders at the table, as you heard, and the national vice president for the United Farm Workers, Eric Nicholson, say these policies, the reason that we need these policies today is because domestic workers and farm workers were intentionally left out of national, state and local labor'",
        "'speaker_2': 'protections, left out for racist and sexist reasons. I wish we could implement these yesterday. I wish we can implement them tomorrow. But I think through the legislation that you've created, the ability for us to make sure that stakeholders are at the table, we will implement these in 2019 with the thoughtful, proactive approach that the stakeholders have been'",
        "'speaker_2': 'able to bring to the table. So for me, this is a huge component that would not have been possible without your leadership. Council Member Herbold Thank you. And without the leadership of the direct lives experience from the lives that you've heard have been impacted without this legislation.'",
        "'speaker_2': 'So mill grass has been a level what is that, a kick or nosotros? Grass there's been a level versus a is eagerness to pursue courage. Communities encouraged by law to take DNA. And in this day in the moment though and so and so be a great supporter.'",
        "'speaker_2': 'Thank you so much for all of your courage that you showed today and every day of your life. This is possible because of your work and your words.'",
        "'speaker_1': 'Thank you. Kathryn Skeeter. Would anyone like to say some closing words? And then, if not, Councilmember Herbert would like to close the discussion.'",
        "'speaker_3': 'I just want to give some additional thanks. So just echoing councilman mosquitoes words about your lived experiences, you are truly the best advocates for your cause. And thank you so much again for the courage and humbling us all with sharing your stories.'",
        "'speaker_3': 'In addition to thanking Councilmember Skated for her, for her leadership and her giving me this opportunity to take to play a role in this policy. I also want to thank a couple other folks. I want to thank Lauren often from the Office of Civil Rights.'",
        "'speaker_3': 'I want to thank Asha, then cut to Ramon. I get that one of these days from council central staff, I want to thank Shannon Perez Darby from my office and Central Perk from Councilmember Muscat, his office and the many, many advocates that have been working on this legislation.'",
        "'speaker_1': 'Very good. Thank you very much. Okay. Please call the role on the passage of the amended bill.'",
        "'speaker_2': 'Badger Gonzalez be herbold i.'",
        "'speaker_5': 'Johnson Macheda.'",
        "'speaker_2': 'I. O'Brien Somewhat. President Harrell.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Eight in favor and.'",
        "'speaker_1': 'Unopposed bill passed in Cheryl Senate.'",
        "'speaker_6': 'Who?'",
        "'speaker_1': 'The three item seven through 11.'"
    ],
    "Conceptual Approval for Amtrak's Private Utility Lines Project.": [
        "'speaker_2': 'Sustainability in Transportation Committee Agenda Item 22 Resolution 318 35 Granting conceptual approval to construct, maintain, operate below grade five utility lines under and across South Holgate Street, east of Occidental Avenue, south and west of Third Avenue South as proposed by the National National Road Passenger Corporation, the committee recommends that the resolution be adopted.'",
        "'speaker_1': 'Member O'Brien.'",
        "'speaker_0': 'Q So Amtrak is working on a project that will help make the passenger rail system function better and better for our environment. They're upgrading the facilities to have electrical capacity for the diesel engines to turn off when they're parked there and be plugged in to essentially a version of shore power like we do with the ships.'",
        "'speaker_0': 'Also updates the systems for treating stormwater and emptying the bathrooms on the trains too. This is in part to accommodate the expansion of passenger rail, including the expansion of sounder rail, which is operated by Amtrak. So this is something that I think is a good thing to move forward.'",
        "'speaker_1': 'Excellent. Very good. Any questions or comments on this resolution? Okay. Those in favor of adopting the resolution, please vote. I, i. Those opposed vote no. The motion carries. The resolution is adopted in the chair. Will Simon please read items 23 through 25.'",
        "'speaker_2': 'Agenda items 23 through 25 appointments ten, 80, 21, 11 and six appointment of Lisa Picard as as member levy to Seattle Oversight Committee for term to December 31st, 2018. Appointment Hester Cerebrum as members levy to move Seattle up Oversight Committee for a term to December 31st, 2018 reappointment Betty's faith Carol as member levy to move Seattle Oversight'"
    ],
    "Resolution to Adopt and Revise the Comprehensive Emergency Management Plan.": [
        "'speaker_1': 'Very good. Any questions or comments on these appointments? Those in favor of confirming the appointments. Please vote i. I. Those opposed vote no. The motion carries. The appointments are confirmed. Please read the report of the Gender Equity Safe Communities, New Americans and Education Committee.'",
        "'speaker_2': 'Three per the Gender Equity Safe Communities, New Americans and Education Committee Agenda 28 Resolution 318 16 related to the City of Seattle's Comprehensive Emergency Management Plan. Adopting the simply introduction Emergency Operations Plan, Continuity, a government plan and Emergency Support Function Number 14 Transition to recovery including 2017 Revisions Committee Recommended Resolution be adopted.'",
        "'speaker_1': 'Very good. Casper and Gonzales.'",
        "'speaker_2': 'Thank you. Council President Approval of Resolution 31816 would update for elements of the City of Seattle's Comprehensive Emergency Management Plan. It includes an introduction to the Comprehensive Emergency Management Plan, the Emergency Operations Plan of the Continuity of Government Plan and Emergency Support Function Number 14 Covering Transition to Recovery.'",
        "'speaker_2': 'The Comprehensive Emergency Management Plan defines how the city will prevent, prepare for, respond to and recover from disasters. Barbara Graff, director of Seattle's Office of Emergency Management, reviewed the updates with the Gender Equity Safe Communities New Americans in Education Committee on September 12th.'",
        "'speaker_2': 'The updates reorganize the existing comprehensive plan to support more effective training but retain existing core information. Both the Mayor's Emergency Executive Executive Board and the city's Disaster Management Committee have reviewed and approved the updated documents. The Gender Equity Safe Communities New Americans in Education Committee unanimously recommends approval of Resolution 31816.'",
        "'speaker_1': 'Very good. Thank you, Councilman Gonzales. Any questions or. Comments on this resolution? No. So those in favor of adopting the resolution please vote. I. I. Those opposed vote no. The motion carries. The resolution is adopted and chair will sign it.'",
        "'speaker_1': 'Adoption of other resolutions. Please read it into the record.'"
    ],
    "Resolution in Support of Dairy Workers and their Fast for Reconciliation.": [
        "'speaker_2': 'Agenda Item 29 Resolution three 2838 reaffirming City Council's commitment to workers and supporting dairy workers and their fast for reconciliation. Councilmember Mesquita Thank you, Mr. President. As you heard from the testimony that was presented today from the United Farm Workers, folks wish that they weren't coming here after years of having conversations both at the state level and'",
        "'speaker_2': 'throughout Washington state. These workers are coming to us with their requests for assistance and solidarity. I've been working with the United Farm Workers and dairy workers for the last few years. And as you've heard from their personal stories, they've seen repeatedly situations where safety concerns have not been corrected, unfair working conditions continue, harassment and intimidation occur on'",
        "'speaker_2': 'a daily basis, and issues of sexual harassment occur for many of the women who work in the dairy industry, United Farm Workers has come to us and a call for solidarity. The city of Seattle stands in solidarity with United Farm Workers today.'",
        "'speaker_2': 'We stand in solidarity with unions from across Washington state, with faith groups, with businesses, with community organizations who've called for there to be reconciliation of the issues that they face on a daily basis and the call for a fast.'",
        "'speaker_2': 'Dairy workers around Washington state to provide the milk that is drink right here in Seattle. They provide the milk that is supplied to many of our businesses and the milk that many families rely on on a daily basis.'",
        "'speaker_2': 'But these dairy workers struggle to provide for their own families. While these dairy workers provide the food and the milk for families across Washington state, they struggle to put food and milk on their own tables. Today, we're standing up in solidarity with United Farm Workers, with the dairy workers, with the individuals who've called for action.'",
        "'speaker_2': 'Mr. President, if I may read from the resolution that's in front of us today for consideration, for the public's knowledge of what is included that would be appreciated.'",
        "'speaker_1': 'Please do. Comes from a mosquito.'",
        "'speaker_2': 'Just a few of the recitals and summary of what we are calling for. Whereas numerous dairy workers across Washington state have voiced concerns alleging hostile work environments, unsafe working conditions, wage and hour theft, sexual harassment, lack of clean drinking water, physical abuse and verbal abuse.'",
        "'speaker_2': 'And. Whereas, dairy workers plan to engage in a five day fast a fast for reconciliation supported by members of the faith, business and labor community. And. Whereas, Dairy Gold is headquartered in Seattle and holds its corporate offices in Seattle, the city of Seattle therefore resolves to stand in solidarity with dairy workers fighting for the right to work'",
        "'speaker_2': 'without fear of or intimidation, and calls on dairy, gold and other companies who purchase this product to work with dairy workers and their representatives at the United Farm Workers to ensure these protections are accomplished. Where the City of Seattle stands with dairy farm workers and dairy gold workers to provide Seattle residents with dairy products, the city of'",
        "'speaker_2': 'Seattle extends its full support for the upcoming Fast and Reconciliation to bring much needed attention to the issues impacting daily impacting Washington state dairy workers on a daily basis. Mr. President, these individuals have taken the courageous step to come forward and express the concerns that they see on a daily basis.'",
        "'speaker_2': 'And we know that here in the city of Seattle, we don't have many dairy farms, but we do have an obligation to continue to extend our commitment to the hardworking individuals who provide the milk and food for the families in Seattle.'",
        "'speaker_2': 'We here in Seattle have stood up courageously and asked for a higher minimum wage protections from wage theft, the ability to have a sick and safe day, the ability to be free from intimidation and harassment. These are the same protections that we expect from individuals, whether they're companies, whether they're subcontractors or whether their organizations are headquartered here'",
        "'speaker_2': 'in Seattle. Because our commitment to workers extends beyond our borders. And when we consume products within our city, we expect the full supply chain to be honored for the supply chain to have good labor protections at every single point along the way.'",
        "'speaker_2': 'I'm really honored to be able to bring this resolution forward. I was humbled by the amount of individuals who came forward and stood with us Councilmember Swan, Councilmember Gonzales. And I think every member of this body has shown support for workers in the past who have been in vulnerable situations.'",
        "'speaker_2': 'And today we stood with the farmworkers, with unions, with faith leaders, with individuals who've been calling for action over many years. And this last effort to try to elevate the issue, to make sure that farm workers, dairy workers, explicitly have the protections that we would expect for every worker here in Seattle.'",
        "'speaker_2': 'Mill Garcia's.'",
        "'speaker_5': 'Pursuit rabbit hole.'",
        "'speaker_2': 'Grasses persist when those two are Storia grass superstar kiko nosotros estamos kiko newstead grasses.'",
        "'speaker_1': 'Thank you. Caspian mosquito. Okay. We have a resolution. Very well. Describe a customer mosquito with any of my comments. Colleagues like to make any comments. Councilmember Bagshaw Thank.'",
        "'speaker_4': 'You. Councilmember Haskett I want to say thank you and a big thank you for bringing this forward. And I have been really honored working with you in the last year where your heart is to care for employees and families.'",
        "'speaker_4': 'And also today, as we're hearing from people in the audience about the fact that they haven't been paid, the fact that they have been harassed, that their working conditions are less than meritorious and in many cases just despicable, and that you brought it to the attention of the public.'",
        "'speaker_4': 'And I appreciate what you are calling for. And I just want to tell my colleagues, as we have just started this meeting today, I received an email from the legal counsel of Dairy Gould. And I'm wondering, would you like to hear what they have to say, or do you just want me to summarize that they're saying they're'",
        "'speaker_4': 'not part of this lawsuit. What would be useful? Councilmember Mosquito This is really your resolution. I want to be helpful because I'm going to support your resolution.'",
        "'speaker_2': 'Well, thank you so much. Thank you for your support. You can feel free to summarize, I think in the conversations that we've had over the years, we know that when it comes to contracting and subcontracting, many individuals will say this was not me as an employer directly responsible, and I can understand where their legal argument is probably'",
        "'speaker_2': 'coming from. Again, this is a resolution in support of the workers at every single level. So while there may not or may be a lawsuit or may not be a lawsuit that they are engaged in, what's important to know is that this issue has over many years been tried to be elevated.'",
        "'speaker_2': 'And I think this is a wonderful opportunity for us in Seattle to see that our same labor protections should apply throughout the supply chain, and especially when we know that there are so many individuals who do consume this product, we want those workers to be safe.'",
        "'speaker_2': 'So I've heard it, but I appreciate the way that they've reached out. And again, I think that this resolution is not actually commenting on that. It's commenting on the desire to make sure that every level along the supply chain we expect accountability and protection from wage theft, harassment and intimidation, and therefore, for there to be good faith'",
        "'speaker_2': 'negotiations so that workers voices can be elevated.'",
        "'speaker_1': 'But I heard her say if she could just summarize, well, maybe she does need I also heard her say she's heard it before.'",
        "'speaker_4': 'So I just I will just summarize this briefly. And it's only because it came to us today. And it's not that I have any knowledge, particularly of of Dairy Gould itself, but there is a lawsuit that is ongoing in eastern Washington that goes to trial soon.'",
        "'speaker_4': 'Gary Gould says that attempts to pull dairy gold into it, there's simply not a party to the litigation involving the farm workers and that the farm workers were not employees of Dairy Gould. So I'm not in a position where I can support this.'",
        "'speaker_4': 'I just want to acknowledge that it came in and I thought, in fairness, that I should at least mention that. And that said, the employees need to be cared for.'",
        "'speaker_1': 'Okay, I think we're prepared to vote. Councilwoman Gonzalez.'",
        "'speaker_2': 'I'm not quite yet. I just I just really want to thank Councilmember Mosca that for bringing this up. She's been working with farmworkers for quite some time in her prior life before she got elected to the Seattle City Council in a lot of different areas housing, health care, health care, labor rights, etc..'",
        "'speaker_2': 'And so I just really want to appreciate the work that you have done and carried into these chambers as a result of that prior advocacy work that you have done on behalf of farmworkers. A lot of folks up here know that I grew up as a migrant farm worker myself, and today at 3:00, my mom started her'",
        "'speaker_2': 'shift at a processing plant in Sunnyside, Washington. At the age of I won't tell you because she'll kill me. But, you know, she's she's older and she still continues to work in these processing plants. The one she works at is in Sunnyside, not that far away from Dairy Gold in Sunnyside as well.'",
        "'speaker_2': 'And I just I just really think that regardless of whether or not this corporation is part of this particular lawsuit or any particular lawsuit, the principle of taking a position on the dignity of work that is being done by the the dairy workers is a really important position for the city of Seattle to take as one of'",
        "'speaker_2': 'the primary consumer markets of this product. And it really does remind me of the inception of the United Farm Workers to begin with. You know, many some people up here are old enough to have been around when there when the grape boycott was in place, and there was a massive amount of protest.'",
        "'speaker_2': 'And boycotting right here in our city as it should have occurred and across the country. And I just see this as the next movement and the next phase for our farm workers. You know, we've heard atrocious stories of these farm workers, dairy workers being sexually assaulted and sexually abused and harassed for no other reason than showing up'",
        "'speaker_2': 'to work. And that is wrong. And earlier today, I shared with the workers in Spanish that I'll say it in English. Now, is that is that really, you know, a man doesn't sexually harass women. A man doesn't disrespect.'",
        "'speaker_3': 'Women, a.'",
        "'speaker_2': 'Man does not disrespect the a woman's effort to provide for herself and her family. And the behavior that is occurring at the dairies is absolutely dishonorable and disrespectful and disgusting. And I believe we have an obligation to continue to stand in solidarity with workers across the state as consumers of this product.'",
        "'speaker_2': 'It just really reminds me of all of the work I used to do in the fields as a young child to buy, to pick fruit that my own family couldn't afford to buy and eat. And so I think I think for me, this is very personal and and I really do, again, appreciate bringing this to light.'",
        "'speaker_2': 'And I hope that some of our home grown companies like Starbucks and others will stand up and will do the right thing and and be on the right side of history, just like all those grocers who refused to carry grapes during the boycott.'",
        "'speaker_2': 'I hope that they choose to also not carry this these products if workers aren't being treated well. And, of course, in the fight for workers in the grape boycott. We know that groceries, you can choose to not carry the products.'",
        "'speaker_2': 'We demanded it and we forced them to. And it was through building the movement of farm workers. And so I want to appreciate UFW for the work they did then, because I know that we know how to do it again and we stand here with you at the ready to continue to fight for you and for workers'",
        "'speaker_2': '. Thank you so much for being with us. Gracias.'",
        "'speaker_1': 'Good. I think that'd be a good note to close on. Thank you, Councilman Gonzalez. Okay. Those in favor of adopting the resolution. I'm sorry. I will move to adopt the resolution. 31838 second to move in second to the resolution be adopted.'",
        "'speaker_1': 'The reason I have to do that is because it was introduced today as well on the same day. Are there any further comments from those in favor of adopting the resolution? Please vote i. I. Those oppose vote no.'",
        "'speaker_1': 'The motion carries. The resolution is adopted and cha will sign it. Okay. I was along again as their journey for the business to come before the council.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_1': 'Former.'",
        "'speaker_2': 'Skater giving the upcoming tour that the AFL-CIO has invited me on. I would like to be excused on Monday, September 24th please.'",
        "'speaker_1': 'The moved in second and that comes from a skater be excused on September 24th. All those in favor say I. I opposed. The ayes have it. And the other business coming for the council. Okay, everyone, have a great rest of the day and we stand adjourned.'"
    ]
}