{
    "Amendment of Secondary Use Policies for Herbicide Application in Cedar River Watershed.": [
        "'speaker_0': 'Thank you. Thank you very much. Thank you. Customer Turbo. Please read the next agenda item.'",
        "'speaker_4': 'Agenda item to cancel 119502 relating to the Cedar River Municipal Watershed, amending the secondary use policies adopted by Ordinance 114 632 to provide for the limited application of the herbicide and as a power to treat invasive knotweed species.'",
        "'speaker_4': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Because consumer herbal.'",
        "'speaker_5': 'Thank you. So this is an ordinance related to the application of the herbicide superior to treat treat the invasive knotweed in the Cedar River watershed. This ordinance would allow for three additional years through 2021 of limited spraying of a massive pier with the goal of eradicating knotweed.'",
        "'speaker_5': 'The legislation would amend a 1989 ordinance that banned herbicide use in the Cedar River watershed and extended the authority described in ordinances from each 2010, 2013 and 2015. So each of those three years, we have amended the 1989 ordinance to extend the authority to allow very limited application of this herbicide, and has appeared in order specifically and'",
        "'speaker_5': 'only to treat knotweed. Knotweed poses the greatest risk of any invasive plant in the watershed. The plant takes over habitats near water, displacing native plant species, degrading habitat for salmon and other fish, and threatening water quality by destabilizing stream banks.'",
        "'speaker_5': 'Herbicide has declined. Herbicide use has declined every year since 2011, and the amount used to treat knotweed throughout the watershed reached a low of 2.4 ounces per acre treated in 2018. This is a 95% reduction in the use of of this of this herbicide.'",
        "'speaker_5': 'And it's also the Seattle Public Utilities has gone to great lengths to adjust its application practices, specifically to minimize potential impacts to pollinators.'",
        "'speaker_0': 'Thank you very much. Any questions or comments? Catherine and Brian.'",
        "'speaker_2': 'Just a quick comment. Thanks for your work on this council, Councilmember Herbold. I will be clear. I'm frustrated that we are still allowing this, but my frustration lies solely with the persistence of knotweed. I was part of the works under the original piece of legislation in 2010 to create this exemption.'",
        "'speaker_2': 'And I will say that I am convinced that Wspu has done some amazing work to continue to reduce the footprint and the amount of pesticides herbicides are using. And it's an amazingly invasive, pervasive, persistent beast to this knotweed.'",
        "'speaker_2': 'And it may be a number of years until we can say that they're confident that it is completely gone and will not come back. But I also want to say that this is part of an overall strategy all the way down to see the river, not just in the watershed, the scale of public utility where we get'",
        "'speaker_2': 'our water from, but all the way down to the lowlands. And King County and other partners have been working collaboratively to remove that along the bank because it does transfer by water, too. So I'm happy to support this, and I think Espey is doing a really great job in a really difficult situation.'",
        "'speaker_0': 'Thank you. Customer and brand. Customer.'",
        "'speaker_1': 'Bagshaw Councilmember Herbold, without asking for you to give me any numbers, do we know whether or not the acreage has been reduced greatly? And can you talk a little bit about, if you know, how much left that spew is focused on?'",
        "'speaker_5': 'So they are anticipating being able to move more into a maintenance stage. But the the amount of area that they have to cover has greatly reduced over the years that they've been doing this application. And as I mentioned before, they are very careful to not apply them as a peer on knotweed plans when they're flowering, specifically to'",
        "'speaker_5': 'address folks concerns about the impact on on pollinators. And when I say they're anticipating being able to move into sort of more of a a maintenance approach there, they although their goal is to eradicate knotweed, they are still anticipating that even in a maintenance approach, they are still going to have to go out and spray because and'",
        "'speaker_5': 'it will be spraying more to deal with the the buds that come out of the ground while they're still there are still routes. They've tried doing manual eradication of knotweed, but just because of how invasive it is and how it travels, the manual eradication doesn't isn't effective.'",
        "'speaker_5': 'But at some point they feel that the root system is going to degrade so much that that the the the threat of larger plants is going to be greatly reduced or continue to be greatly reduced.'",
        "'speaker_2': 'And my recollection from the presentation was it was about a 95% reduction also in the in the acres of where it is. So and I believe they haven't seen any any new places where it's popped up, sort of still dealing with the same areas that they have.'",
        "'speaker_2': 'And they're just going back there on a regular basis, checking it. And when little pieces pop up, they're going to treat them until they win the battle over the energy left in the root system injections. I don't know if that's true.'",
        "'speaker_2': 'They used to do injections where they would go break the plants. Here they're doing they're now switched to spray. And I forget I don't know if that's the reality of the maturity of the plants they're dealing with is much different.'",
        "'speaker_2': 'Or if it's a different technology or that's evolved.'",
        "'speaker_5': 'I'm not sure.'",
        "'speaker_0': 'Okay. Everything you need to know about knotweed. Here you go. Okay. If there's no further questions or comments, please call the role on the passage of the bill.'",
        "'speaker_1': 'So on I make sure Gonzalez Herbold, I macheda I.'",
        "'speaker_2': 'O'BRIEN All right. PACHECO Hi.'",
        "'speaker_1': 'President. Harrell Hi, Aiden.'",
        "'speaker_0': 'Favorite unopposed bill passed and chair of Senate. Please read the next agenda item.'"
    ],
    "First Quarter 2019 Employment Ordinance.": [
        "'speaker_4': 'Agenda items four and five appointments of Alice Kurihara Day as member of Pioneer Square Preservation Board for Term two March 1st, 2021. Excuse me, excuse me. The report of the Finance and Neighborhoods Committee Agenda Item three Cancel 119 493 relating to city employment, commonly referred to as the first quarter 2018 Employment Ordinance, designating positions as exempt from'",
        "'speaker_4': 'the Civil Service authorizing payment of the employee's 2019 premium share into the Washington State, paid Family and Medical Leave Insurance Program and ratifying, confirming certain prior acts all by two thirds vote of the city council. The committee recommends the bill passed as amended.'",
        "'speaker_0': 'It's from Beck.'",
        "'speaker_1': 'Show. Thank you very much. So we've got two subjects in this ordinance. And the first is designating three positions as exempt from the civil service system. Two in our information. Technology Department and the third in the Human Resources Department.'",
        "'speaker_1': 'And this is typical of the quarterly report. There's just these three that will be made exempt and there's no other changes. The second section in this ordinance authorizes payment completely separate from the first items, which is that the city will pay into the Washington State Family and Medical Leave Insurance Program, the employees premium share beginning January 1st'",
        "'speaker_1': 'of this year and up to December 31st, 2019. So those separate subjects are both incorporated in this ordinance and committee recommends do pass.'",
        "'speaker_0': 'Very good. Is there any questions or comments? If not, please call the rule on the passage of the bill.'",
        "'speaker_1': 'Saline i bagshaw high Gonzalez.'",
        "'speaker_4': 'High Herbold High.'",
        "'speaker_1': 'Mosquera I O'Brien.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'Pacheco High President Harrell High eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed Cheryl Senate District Items four and five.'",
        "'speaker_4': 'Agenda items four and five appointment at 1307 and 1308 Appointment of Elise Kurihara Day as member of Pioneer Square Preservation Board for Term two March 1st, 2021 and appointment Audrey Horton Morton Waite as member of Pioneer Square Preservation Board for term to March 1st, 2022, the committee recommends the appointment to be confirmed.'"
    ],
    "Land Use and Zoning Amendments for Electric Vehicle Charging Infrastructure.": [
        "'speaker_4': 'The report at the Sustainability in Transportation Committee Agenda Item 16 Council Bill 119 472 Relating to land use and zoning of many sections 23.2 2.0 62. 23.20 4.0 4520 3.40 9.0. 1920 3.50 4.0 30 and 23.84 8.0 ten of the same as for code adding a new requirement relating to electric vehicle charging infrastructure.'",
        "'speaker_4': 'The committee recommends the bill passes amended.'",
        "'speaker_0': 'Customer Brian.'",
        "'speaker_2': 'Thank you. Very excited about this. This is something that's been in the works for over a year to create this EV readiness ordinance. This legislation will require that all new construction in the city meet certain standards for making sure that any parking spaces that are already going to be provided in that building or even in a lot'",
        "'speaker_2': 'if it's not a structured parking, provide a certain level of readiness for adapting to electric vehicles. The main standard for residential is that in single family homes or in small multifamily developments like townhomes or real houses would require that each parking spot have a EV ready outlet, ready to go.'",
        "'speaker_2': 'And then as we get larger structures where you have structured parking that shared spaces eventually phases to about 20% of the are actually exactly 20% of the spaces need to be electric vehicle ready meaning that there is wire pulled there is panel capacity everything ready to go to hook up essentially an electric vehicle charging station relatively easily'",
        "'speaker_2': '. As I mentioned in this morning's meeting, the technology now exists so that as people put in charging stations, you put in a charging station per outlet. Charging stations are capable of balancing loads and charging up to five vehicles.'",
        "'speaker_2': 'Procession. So a policy that has 20% of those spaces EV ready could effectively through that technology be 100% of the spaces could be EVs charging simultaneously over the course of a night. It's really I think it's some of the best legislation in the country that builds on what other jurisdictions have done and takes the strongest parts of'",
        "'speaker_2': 'various cities and combines it in this. I'm sure that in the coming months and years, other jurisdictions will leapfrog us to the next level. But I'm proud to say that I think Seattle will be at the moment, at the leading edge of requirements for electric vehicle residents and new construction.'",
        "'speaker_0': 'Thank you. Comes from Brian. Any questions or comments? If not, please call the rule on the passage of the bill.'",
        "'speaker_1': 'Sergeant Bagshaw. Hi. Gonzalez Herbold. Hi, Sarah. O'Brien. Hi, Chico.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'President Herrell high seven in favor and unopposed.'",
        "'speaker_0': 'Thank you very much. Let's move to adoption of other resolutions. And can you read? Will you read? All three resolutions will vote on them separately, just into the record. They're all interrelated.'"
    ],
    "Committee Structure and Duties for 2018 and 2019.": [
        "'speaker_4': 'Adoption of other resolutions. Agenda item 17 through 19 Resolution 31883 relating to committee structure and membership meeting times and duties of the Standing Committees of the Seattle City Council for 2018 19 and superseding Resolution 31859 Resolution 3188 for designee the monthly pro president pro tem of the City Council of the City of Seattle for 2018 through 2019'",
        "'speaker_4': 'and superseding Resolution 31790 Resolution 31885 relating to the Seattle City Councilmember participation for 2018 and 2019 on King County Committees, Regional Committee, State Committees and City of Seattle Committees and Superseding Resolution 317 82.'",
        "'speaker_0': 'Very good. As I described to you this morning, these three resolutions basically revolve around the appointment of Councilmember Abel Pacheco to council position number four, the first resolution number 17. Basically, these are standing committee structure with Councilmember Pacheco's name in the place of former Councilmember Robert Rob Johnson.'",
        "'speaker_0': 'He's now chair of the Planning Land Use and Zoning Committee, Vice Chair of the Sustainability and Transportation Committee and a member of the Gender Equity Safe Communities New Americans in Education Committee and is also an alternate on the Civil Rights, Utilities, Economic Development and Arts Committee.'",
        "'speaker_0': 'Resolution Number eight. 18 Reestablishes the pro tem schedule, designating Councilmember Pacheco as president pro tem for the month of October and November 19. Resolution Number 19 updates the assignments to King County Committees and regional communities and state committees.'",
        "'speaker_0': 'I'll just name a few that Councilmember Pacheco replaces Councilmember Johnson on the Growth Management Planning Council of King County, the Growth Management Planning Council Executive Committee, as well as the Puget Sound Regional Council, Executive Board and other boards.'",
        "'speaker_0': 'I just want list them all. Councilmember Whereas I replaces, according to this resolution, former councilman Rob Johnson, the following committees, the Sound Transit Board and the Sound Transit Elected Leadership Group. So those are your three sort of transition resolutions describing the change.'",
        "'speaker_0': 'Are there any questions or comments? Customer in particular, you'd like to say a few words.'",
        "'speaker_2': 'I just want to take a brief moment and address my colleagues. I'm sure all of you remember how crazy the first few days on the council were, but I've been impressed by everyone in my first week here at City Hall.'",
        "'speaker_2': 'I'm inspired by the high level of civil service displayed by both my council colleagues and all those who worked behind the scenes to make sure the legislative body doesn't miss a beat. I want to give a big shout out to the central staffers, our clerk's office, and the different department directors I've had a chance to meet with'",
        "'speaker_2': 'so far. You've all been very generous with your time and imparting your knowledge as well with Bring Me Up to Speed so quickly during my onboarding. It's felt a bit like drinking from a fire hose at times, and I want to make sure I say thanks.'",
        "'speaker_2': 'I'm excited to serve the constituents of D4 and to work with all of you and the mayor's office and to identify areas of common ground to benefit this beautiful city we all love and go home. I look forward to working on the close.'",
        "'speaker_2': 'I look forward to working closely with all of you to identify places where we can make a meaningful impact. As I assume former Council Member Johnson's committee appointments, it's an honor to serve the Emerald City.'",
        "'speaker_0': 'Thank you. Councilman Pacheco. Any other comments or concerns or questions before we take a vote on the resolutions? Okay. So those in favor of adopting Resolution 31883. Please vote i. I those opposed vote no. The motion carries a resolution adopt and show a sign that those in favor of adopting resolution 31884.'",
        "'speaker_0': 'Please say I I those opposed vote no. The motion carries the resolutions adopt and show sign it. And those in favor of adopting resolution 31885. Please vote i i those opposed vote no. The motion carries. The resolution dropped.'",
        "'speaker_0': 'And, Cheryl, sign it. Just one moment. You. Okay. Other business. The City Council will now consider an administrative appeal to an exclusion issued to Avram. Avram. Alex Zimmerman on April 18th, 2019. The question is, shall the decision to exclude this individual from council meetings through May 14th, 2019 be sustained?'"
    ]
}