{
    "Premium Pay Ordinance for Gig Workers in Seattle.": [
        "'speaker_3': 'Agenda Item one Capital 119 789 related to gig workers in Seattle, establishing labor standards requirements for premium pay for gig workers working in Seattle and then U.S. 3.02. 125 and 6.208.020 of the settlements proposed declaring an emergency and establishing an immediate effective date all forced out of the city council.'",
        "'speaker_0': 'Thank you, Madam Clerk. I will move to pass Council Bill 119799. Is there a second? Thank you so much. It's been moved in second hand to pass the bill. Councilmember Lewis, as co-sponsor of this bill, you are recognized to address this item and I believe you have as a substitute version of the bill to move for our'",
        "'speaker_0': 'consideration before we take and comment on the underlying bill. So let's go through the procedural motion first and before we get to the substantive bill, which will be the substitute. So so I'll hand it over to you to put the substitute before us.'",
        "'speaker_2': 'Thank you so much, Madam President, for cueing that up. So I would ask then if item one from Council Bill 119799 can be read into the record.'",
        "'speaker_0': 'So item one has been read into the record and it starts earlier.'",
        "'speaker_2': 'I was like, I think we didn't just do that. Oh, yeah. Okay. Sorry. I moved past Council Bill 11 nine and you already did that. Sorry.'",
        "'speaker_0': 'You need to let me.'",
        "'speaker_2': 'Let me start a little further along for me. I'm sorry for.'",
        "'speaker_0': 'That's okay. You need to move to amend council 1119799 by substituting version for for version two.'",
        "'speaker_2': 'Yeah. Sorry. I'm down there now. I'm so. Yes. I moved to amend council bill 11 9799 by substituting Virgin for for version 2.8.'",
        "'speaker_0': 'In their second. Okay. It's been moved and seconded to substitute the bill. Councilmember Lewis, again, you are recognized in order to address the substitute version of the or the procedural fact of the substitute bill.'",
        "'speaker_2': 'Yes. So thank you so much for the opportunity here to address this. I know we've talked about this bill a couple of times over the last few weeks. The substitute version lowers the initial price that Councilmember Herbold and I had considered in terms of the premium pay number, which originally was $5 per delivery.'",
        "'speaker_2': 'Having consulted with our labor partners as well as the platforms in the space. We determined that a $2.50 per delivery still accomplished the goals of the premium pay in terms of compensating for time spent cleaning vehicles and acquiring PPE and sanitizer, as well as also making sure there was some consideration for the unique hazards that folks are'",
        "'speaker_2': 'facing during COVID. So for that reason, we made some of these changes. So there are substantive changes in the bill. There are also some technical changes that do not otherwise make considerable changes. A There's going to be other amendments addressing the fact that the substitute does not have a provision like some other versions of the bill have'",
        "'speaker_2': 'had, where the cost could potentially be partially passed through to consumers. So this substitute bill would allow folks to partially pass through some or all of the additional cost to consumers. And that's a discussion that we can have.'",
        "'speaker_2': 'I believe Casper Morales will be bringing forward an amendment to queue up that conversation, but otherwise those are the substantive changes. I don't know if Councilmember Herbold also has anything to add to that before we move forward on a vote to adopt the substitute.'",
        "'speaker_0': 'Councilmember Herbold, anything to add on the motion to consider the substitutes?'",
        "'speaker_1': 'No. I think Councilmember Lewis handled it well. I have nothing further that.'",
        "'speaker_0': 'Great. Thank you so much. Colleagues, any questions on the substitute version being proposed for consideration? Councilmember Salaam.'",
        "'speaker_4': 'Thank you. Needless to say that I support the legislation itself to require additional hazard pay to gig workers who sacrifice self-sacrifice. And labor is really one of the only things that has allowed many people to continue to have access to food and mobility during this COVID crisis.'",
        "'speaker_4': 'And these workers are doing so at great personal risk of infection, and often with very little common compensation from the multinational corporations that hire them, which have even been extremely stingy in giving them very basic protective equipment as well.'",
        "'speaker_4': 'However, what we are discussing now in this motion to place an amended version of the original bill is whether to substitute a new draft of the bill for the original and a strong. And I want you to say that I strongly prefer the original bill to this substitution, because the original bill is significantly stronger in many respects'",
        "'speaker_4': '. First, the original bill protects both food delivery gig workers and TNT drivers, like those who drive for Uber and Lyft. The substitute, however, only protects food delivery workers. And I will, of course, be opposing any amendment that excludes any workers from these protections.'",
        "'speaker_4': 'I understand that some council members are arguing that this change is reasonable because they believe that the mayor will draft legislation in the future to cover dirty drivers. But that reason is totally insufficient. This is emergency legislation that already only requires hazard pay during the legally declared emergency.'",
        "'speaker_4': 'That ends when the emergency ends. If the so again, you know, we're talking about the bare minimum. If the mayor does generate this legislation in time to go into effect on October 1st, which the Teamsters have told my office is the current schedule, it's very possible that these hazard pay restrictions would have expired by then anyway.'",
        "'speaker_4': 'So that would leave TNT drivers with having had no hazard pay protection. So the entire public health emergency, the official emergency, even if the official go with emergency, has not legally expired. This amendment would still leave TNT drivers without hazard pay for at least three and a half months.'",
        "'speaker_4': 'Additionally, I mean, that's based on the timeline we've heard. There's no guarantee that that even that timeline will be adhered to. Additionally, the substitute bill majorly reduces the hazard pay benefit available to gig workers. The original bill provided gig workers with $5 hazard pay per delivery plus $5 for each additional stop.'",
        "'speaker_4': 'This subsidy cuts that more than more than in half to $2.50 per delivery and only a dollar and $0.25 for additional stops. We should also remember that this legislation is in response to nationwide. The base legislation is in response to nationwide organizing of gig workers, including a courageous strike called by Instacart workers demanding $5 per delivery premium'",
        "'speaker_4': 'pay. Who opposes that? Who is demanding it to be reduced? I can only guess that the big delivery businesses have been putting pressure in the backrooms because we have not seen that in public comment. Gig workers are many of the essential workers that have made it possible for Seattleites to have food and be mobile during this public'",
        "'speaker_4': 'health crisis. And they have done so at great personal risk with extremely low wages while they are multinational bosses have raked in profits, indeed profiteer through the pandemic. I support the strongest possible hazard pay and do not support this amendment that would exclude taxi drivers and lower the pay.'",
        "'speaker_4': 'So I will be voting no on making the substitution, but I will of course be voting yes on the overall bill when we do that later.'",
        "'speaker_0': 'Okay. Thank you so much, Councilmember Swan. I see Councilmember Herbold has raise your hand, so I'm going to go ahead and recognize Councilmember Herbold.'",
        "'speaker_1': 'Thank you. I just want to note that as it relates to removing taxi drivers from from the bill in the in the substitute that Councilmember Lewis just spoke to, that was actually a request that we do that from the Teamsters.'",
        "'speaker_1': 'They they requested that we remove the the authorization of the hazard pay for their drivers. And then as it relates specifically to the different price point that was negotiated with working Washington, they recognize that there is a balance that is is necessary to strike and they do not want to see a reduction in use of the food'",
        "'speaker_1': 'delivery services in response to a price point that is too high. And so that is really the foundational thinking around, again, trying to trying to hit that hit that sweet spot between what the what the price point should be to compensate drivers for the time it takes to maintain the vehicles in a way that's consistent with public'",
        "'speaker_1': 'health standards, the and the the products necessary to do so. And, and also recognizing that this is working during this period of time is is indeed a hazard. So, again, I really appreciate having the opportunity to work with working Washington throughout this this process and leading up to the substitution.'",
        "'speaker_0': 'Thank you for that additional information. Councilmember Herbold, any other comments or questions on the substitute bill? Hearing and seeing none. I think we are ready to consider the substitute version unless. Councilmember Lewis, you have anything else to add?'",
        "'speaker_2': 'I do not, Madam President.'",
        "'speaker_0': 'Okay, great. Let's go ahead and I will have the clerk call the roll on the adoption of the substitute.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Don't.'",
        "'speaker_4': 'Know.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Her bold eye, Juarez.'",
        "'speaker_3': 'I. Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Morales.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Macheda my never Gonzalez. I did it in favor. One opposed.'",
        "'speaker_0': 'I thank you so much. The substitute is adopted in version four of the bill is now before the council. So I will go ahead and now open up the floor for additional debate and comments on the bill as amended.'",
        "'speaker_0': 'And our colleagues, are there any other amendments? I know that Councilmember Morales you have a particular amendment. So perhaps what we should do is consider your amendment first and then we can have a conversation on the bill as amended.'",
        "'speaker_0': 'How does that sound? Sure. Okay, great. So I will hand it over to you, because my role is to make your motion to put Amendment One before the council.'",
        "'speaker_5': 'So I move that we amend Council Bill 119799 as presented on Amendment one on the agenda.'",
        "'speaker_0': 'It's great. Is there a second?'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'It's been moved to amend the bill and I will hand it over to Councilmember Morales to describe Amendment One.'",
        "'speaker_5': 'Thank you. Council President Gonzalez. So this amendment would prohibit the hiring entity from passing on charges, increasing grocery charges to consumers. We all know that the economic impacts of COVID are having really drastic effects on our families. And food security in particular was a problem in the city already.'",
        "'speaker_5': 'And we know that food insecurity is increasing, especially during this crisis. So this is really an attempt to. Decrease the risk of having customers who are relying on grocery delivery from from having that charge passed on to them.'",
        "'speaker_5': 'We want to make sure that we are protecting our vulnerable neighbors, our seniors, especially families with children, and anybody who is really at risk of food insecurity, so that they are so that this assessment or this charge does not get passed on to them.'",
        "'speaker_5': 'And that's what we're doing here.'",
        "'speaker_0': 'Great. Thank you so much for that description, Councilmember Morales. Any questions or comments on Amendment One? Okay. Hearing none. We will go ahead and take a vote on Amendment One. So will the chief call the roll on the adoption of Amendment One?'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Do want. So I want. I thank you. Strauss. I traveled. I. Suarez.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Lewis. I. Morales. I must get. I. President Gonzalez I nine in favor. Nine opposed.'",
        "'speaker_0': 'Thank you. The motion carries, the amendment is adopted and the bill, as amended, is now before the council. Are there any further comments on the bill as amended? Councilmember mosquito, followed by Councilmember Lewis.'",
        "'speaker_1': 'Thank you so much, Madam President. And thanks to the sponsors of this legislation comes from Herbold and Councilmember Lewis. Really exciting day for gig workers and actually just for our entire economy. As we know, gig workers have been left out of the basic protections that we have been.'",
        "'speaker_0': 'So.'",
        "'speaker_1': 'Proud of here in Washington State and in the city of Seattle to offer to W-2 employees, but make it basic labor standards for those who are classified as independent contractors are hard to legislate, especially for gig workers as the sponsors and this entire council knows.'",
        "'speaker_1': 'So I'm really excited about the piece of legislation in front of us. I think that there's much more work to be done for sure. Conversations of issues of misclassification and long term solutions for gig workers continue. But I know that we have to act with urgency.'",
        "'speaker_1': 'Right now.'",
        "'speaker_0': 'This crisis of.'",
        "'speaker_1': 'COVID has been telling us that we need to step up in an immediate way to provide these protections for gig workers and looking forward to working with all of you on those next steps. I know also that we are well aware that gig workers need additional protections, especially because of COVID.'",
        "'speaker_1': 'We get our groceries delivered, we get food delivered. We are, I think, in a crisis where many of us are depending on this portion of the economy even more heavily now. So I really think it's important that we're stepping up in an essential way for these essential workers to make sure that they're treated with the basic protections'",
        "'speaker_1': 'like premium pay and making sure that they have safety equipment. Being told that the unemployment rate is as high.'",
        "'speaker_0': 'Oh, I'm sorry.'",
        "'speaker_1': 'Workers are being told that that given how high the unemployment rate is, that, you know, some people are being told if you don't like it, then you don't have a job and you know, you don't have any other recourse.'",
        "'speaker_1': 'That's absolutely unacceptable. We want to make sure that all workers have these basic and basic protections that we provided to other sectors of our communities. So as workers are putting their their selves, their life at risk, their family's lives at risk by coming to work, they serve our communities.'",
        "'speaker_1': 'We need to lift them up and to make sure that these workers with.'",
        "'speaker_0': 'The basic protections they need.'",
        "'speaker_1': 'Thank you again to all of the.'",
        "'speaker_0': 'Folks.'",
        "'speaker_1': 'Who worked on this legislation. And thanks to the gig workers who every day take a risk to go to work. Appreciate the time. And I'm grateful that through this legislation, we're again making labor history and passing this.'",
        "'speaker_0': 'Legislation into law. Great. Thank you so much, Councilmember Mosqueda, for those remarks. Councilmember Lewis.'",
        "'speaker_2': 'Thank you, Madam President. And I'll be I'll be really brief. And I think Councilmember Swan actually cued this up rather nicely. So I think I'm following on a theme that's already been introduced, but this truly does have to be a first step.'",
        "'speaker_2': 'And as Councilmember Maceda also alluded to as well, it is a temporary measure. You know, COVID someday will pass and this measure will pass. But we are still going to have massive inequities in this app based economy that has been mischaracterized as a gig economy, but really increasingly is the economy.'",
        "'speaker_2': 'This is increasingly a way that commerce and businesses transacted in our society. It's increasingly a space where workers are misclassified as independent contractors to justify justify paying them less and giving them fewer benefits. And it's going to be an area where we are going to definitely need to do more work.'",
        "'speaker_2': 'And I look forward to doing that under Councilmember Mosquito's leadership in the committee that covers workforce standards. And I know that a lot of our stakeholders in the community who I really had the pleasure of working with through this racial ladder at work in Washington and everyone over at work in Washington, Sage and the whole team there'",
        "'speaker_2': 'were great. I want to thank Camille Brown on my staff, who did an excellent job working with Councilmember Herbert's office to really shepherd this through over the course of a month with lots of back to back meetings and making sure we were reaching out to all the stakeholders.'",
        "'speaker_2': 'So just wanted to extend those. Thanks and we'll look forward to voting to get it over the finish line today. And thank you all for everything you did to make this a success.'",
        "'speaker_0': 'Thank you, Councilmember Lewis. Council members want.'",
        "'speaker_4': 'Thank you. As I mentioned before, I'm happy to vote yes on this bill requiring big business, big businesses to pay hazard pay to gig workers during the COVID crisis. And I agree with Councilmember Lewis that this is increasingly become the norm.'",
        "'speaker_4': 'It's not like we're talking about one small section of the economy. So many workers, and especially younger workers, are getting pushed into what's called the gig economy, those kinds of jobs where they are not recognized as employees. Gig workers deliver groceries, drive for Uber and Lyft, and do many other essential jobs to our society.'",
        "'speaker_4': 'These are jobs like any other, except they are marked with the legal fiction that they are a one person small business rather than a worker and a corporation. The result of this legal fiction is that workers are suddenly no longer protected by workers as gig workers, as workers, and by being classified as gig workers, in fact.'",
        "'speaker_4': 'Big business even avoid Seattle's minimum wage by classifying its workers at big workers, which is particularly important for the hazard pay bill we're voting on now. It is totally unjust, and it is a clear example of how, under capitalism, the working class must continually organize and struggle to avoid falling even further behind.'",
        "'speaker_4': 'As I mentioned two weeks ago, when council was voting on extending the paid sick and safe leave to gig workers 100 years ago, when workers could legally form no workers could legally form unions in this country, but courageously they did it anyway, often having to defend their picket lines against physical attack, in fact, by the police and'",
        "'speaker_4': 'by private forces. In the 1920s, the U.S. military was even deployed to bomb the picket lines of striking miners. It was through these courageous struggles that workers won the decent contracts that formed the so-called middle class for at least a section of American society.'",
        "'speaker_4': 'For two generations, they won labor law protections and they won the right to organize a union. Since then, however, for decades, big business has been attempting to claw back every gain workers had fought for and won. Wealth inequality has ballooned.'",
        "'speaker_4': 'An estimated one out of five workers in the U.S. is now classified as an independent contractor, e.g. gig worker. Ultimately gig workers will need to unionize with or without the legal permission to do so. Just like workers in the past, because we only have the power in the workplace when we get organized to fight for it, we'",
        "'speaker_4': 'will need to rebuild the fighting labor movement that overcame legal, physical and political obstacles in the last century to establish the union workers, the unions and workers can rely on today. Today's premium pay legislation is extremely temporary, but in approving it, the city council is making an important statement, and I'm happy to support the legislation to extend'",
        "'speaker_4': 'basic and save time to gig workers also. And finally, I want to raise the caution around enforcement that I had spoken to when this legislation was first discussed in a briefing council briefing, I think, a week ago. Seattle's Office of Labor Standards is empowered to enforce these workers rights.'",
        "'speaker_4': 'But because so many big businesses engage in wage theft, the Office of Labor Standards has a serious backlog. If your boss steals from you, it takes many months to even get the money you're owed. And we've seen how ruthless giant corporations like Uber can be in disregarding workers rights.'",
        "'speaker_4': 'The Office of Labor Standards is currently. Understand the mayor is instituted a hiring freeze, claiming that there is not the budget to adequately staff the department because of COVID related budget shortfalls. This is an example of austerity, but like any other austerity, these budget shortfalls are not automatic.'",
        "'speaker_4': 'If Mayor Durkan And if the political establishment were willing to tax big business, the city could raise the revenue to stop this austerity and create a public jobs program, not only to build social housing and on Green New Deal programs, but also to enhance the stuff that we would need to actually fully enforce labor law.'",
        "'speaker_4': 'Gig workers deserve to be protected with their rights, and that means this legislation is an important part of it. And we also need to end the austerity and the inadequate staffing at the Office of Labor Standards. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Swan, are there any other council members who wish to make comments on the bill? Councilmember Herbold, please.'",
        "'speaker_1': 'Thank you. I just want to flag that we have a process and a product keyed up for the taxi drivers for minimum compensation. I think it's really important that the conversation that we've had around hazard pay also lead to a conversation around minimum compensation for the the drivers who deliver groceries and meals from restaurants.'",
        "'speaker_1': 'I think there was a lot of a lot of interest in seeing whether or not the the worker advocates and workers could get to a place with the the apps where they had some agreement on what not only what those conversations might look like, but what the what the product might be.'",
        "'speaker_1': 'But unfortunately, we didn't get there. But I am confident that those conversations will continue and we'll do everything I can in my role as a as a council member to support those conversations, because it is critically important that that folks who are doing this work that we can see right now in this in the state of emergency'",
        "'speaker_1': ', how how critical it is. It's critically important that these folks receive some form of minimum compensation as well.'",
        "'speaker_0': 'Councilmember Herbold, are there any other questions or comments on the bill? Okay. Hearing, then I will ask that the curtain call on the passage of the bill as amended.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Want. I Strauss i verbal. I. Juarez. I do is i.'",
        "'speaker_5': 'Morales i.'",
        "'speaker_1': 'I. President Gonzalez i. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes as amended and the chair will sign it. And I'd ask that the clerk please affix my signature to the legislation on my behalf. Okay, colleagues, let's move into agenda item two. Will the clerk please read agenda item to into the record?'"
    ],
    "Ban on Chokeholds by Seattle Police Officers.": [
        "'speaker_3': 'Agenda Item two Capital 119804 relating to the Seattle Police Department prohibiting the use of chokeholds by officers amending Section 12 8.04.200 of.'",
        "'speaker_0': 'And adding.'",
        "'speaker_3': 'A new Section 3.28. 145 to get on a code.'",
        "'speaker_0': 'Thank you. I will move to pass Council Bill 119804. Is there a second?'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'It's been moved and seconded to pass the bill. Councilmember Swan As sponsor of the bill, you are recognized in order to address this item first.'",
        "'speaker_4': 'Thank you. Sorry, I was a little torn off because I thought there was a technical amendment that needed to be done before. Or maybe that's going to come after I speak.'",
        "'speaker_0': 'Yeah. So there's a that's a good, good flag. Why don't I just sort of give folks a preview here really quickly. So this is on the ordinance related to prohibiting use of chokeholds in the city. The chemical weapons bill is coming next.'",
        "'speaker_0': 'So this is just on the chokeholds. And there will be an amendment that will be moved by Councilmember Herbold that was published on the agenda is Amendment One. And then there will be a Second Amendment by Councilmember Herbold, which was published on the agenda as Amendment two.'",
        "'speaker_0': 'And then we will have a amended bill for consideration. That's just on agenda item two related to chokeholds. So I think the technical amendment that you're referring to, councilmembers a lot might be in the context of agenda item three.'",
        "'speaker_4': 'No. I was talking about the two amendments you mentioned, but yeah, I for a moment I forgot that it's going to come after.'",
        "'speaker_0': 'So why don't you go ahead? Absolutely. There's a lot going on this morning, so why don't you go ahead and address the underlying motion? First, I'm sorry. The underlying bill first. And then we will. And, you know, you'll probably, I imagine, want to have some substantive comments here.'",
        "'speaker_0': 'But but if if you want to just sort of introduce the bill initially just to give Council Member Herbold amendment some context, then we'll do the amendments. And of course, as customary, you as the primary sponsor will.'",
        "'speaker_2': 'Have the last word.'",
        "'speaker_0': 'On the bill as amended.'",
        "'speaker_4': 'Thank you. This bill bans chokehold in Seattle from Eric Garner to Emanuel alludes to George Floyd. We have all seen the devastating consequences of Joe Cole's use of chokehold by the police. As I mentioned last week and also this morning, similar restrictions have been put in place by other cities, most recently in Minneapolis, where George Floyd was'",
        "'speaker_4': 'murdered by the police using a chokehold. This legislation is absolutely the least that the Seattle City Council can do, and I hope that we can. That's it. And move on to the ban on crowd control weapons, also without loopholes and many of the other measures that we need to be put in to put in place in order'",
        "'speaker_4': 'to really even begin to have accountability on the police. I do want to reiterate a sobering word of caution. Passing this legislation is absolutely important, but it will not be enough by itself. Joe cause we are banned in New York City when Eric Garner was killed and that obviously was insufficient to save him.'",
        "'speaker_4': 'Legislation like this is critical because especially because it shows the power of a grassroots movement overcoming an entrenched establishment for so many decades. But it needs to be paired with more structural changes in society. And that is why.'",
        "'speaker_4': 'I will be my office will be pushing for the most of the other demands that we have from our movement. One most immediately is to release all protest arrestees and drop all charges against them to defund the police by 50% so that we can begin to fund restorative justice and really community organizing as opposed to policing funded'",
        "'speaker_4': ', organized by workers who are unionized and paid a living wage, especially to respond to non-criminal emergency calls, as has been called for by the Police Accountability Organization for the Bay Area Bay Area. But we also need urgently need an independently elected community oversight board.'",
        "'speaker_4': 'So I hope you will support this and I will say a few words more towards the end. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. So what I'm going to go ahead and hand it over to Councilmember Herbold, who has a couple of amendments. But let's start with your amendment number one, please.'",
        "'speaker_1': 'Thank you. I moved to amend Council Bill 11 9804 as presented on Amendment one on the agenda.'",
        "'speaker_0': 'Is there a second?'",
        "'speaker_2': 'Second.'",
        "'speaker_1': 'Fuck it.'",
        "'speaker_0': 'Thank you. It's been moved and seconded to amend the bill with Amendment one Councilmember Herbold as sponsor of the amendment. I will hand it over to you to address it.'",
        "'speaker_1': 'Thank you. So this amendment is responsive to concerns raised and shared with council members from the apartment. It addresses two separate issues in the Single Amendment. The first is to clarify that the private right of action applies to violations of the prohibition that occur after the ordinance takes effect.'",
        "'speaker_1': 'And the second requests that the notice of the the chokehold prohibition be given to the Department of Justice, the court and the Monitor in accordance with the consent decree. United States of America versus City of Seattle. This use of force is at the heart of the consent decree, and changes to city policies need to be submitted to'",
        "'speaker_1': 'the court. The city sent a draft version of the 2017 accountability legislation to the court in advance. And similarly, this amendment indicates that Council recognizes the role of the court.'",
        "'speaker_0': 'Thank you, Councilmember Herbold, for that description. Are there any comments on Amendment One? Okay. I'm not hearing any comments on Amendment One. And again, Councilmember Herbold, I appreciate you bringing forward this amendment. I would say that it sort of models the approach that we took with the 2017 Police Accountability Ordinance in which we legislated some of the'",
        "'speaker_0': 'policy issues. First, recognizing that those policy changes would be subject to review under the consent decree. And I think that your amendment in this base is consistent with what the Council has done in the past, sort of knowing that we're changing policies that fall under the purview of the consent decree and not abdicating the need to submit'",
        "'speaker_0': 'for review under the consent decree. So I appreciate your work on this amendment. So if there are no.'",
        "'speaker_1': 'Other questions or comments, we'll go ahead.'",
        "'speaker_0': 'And move along. P.S. Any hearing, ma'am, will the clerk please call the role on the adoption of Amendment One?'",
        "'speaker_2': 'Peterson All right.'",
        "'speaker_3': 'So what.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Strauss I.'",
        "'speaker_1': 'Grippal. I. Juarez.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Lois. Hi. Morales. I must get to. I. President Gonzalez. Nine in favor. Nine opposed.'",
        "'speaker_0': 'Excellent. Thank you so much. The motion carries, the amendment is adopted and the bill, as amended, is now before the Council. I understand that we have another amendment, Amendment two, so I would hand it back over to Councilmember Herbal to walk us through amendment to.'",
        "'speaker_1': 'Amendment two, simply expresses the Council's intent to engage with labor relations in the implementation of the chokehold prohibition.'",
        "'speaker_0': 'Thank you so much. Any little city council? Did you actually make your motion?'",
        "'speaker_1': 'Ooh. Good call. I'm sorry. I moved to amend Council Bill 11 9804 as presented on Amendment two on the agenda.'",
        "'speaker_0': 'Thank you so much. Is there a second?'",
        "'speaker_2': 'Second?'",
        "'speaker_0': 'It's been moved and seconded to amend the bill as described an amendment to amend Councilmember Herbold to give us a very specific description of what that was. Did you want to repeat that?'",
        "'speaker_1': 'Absolutely. So we have the context of the amendment itself before us, before I describe it. The amendment expresses the Council's intent to engage with our Labor Relations Department in the implementation of the choke, the chokehold ban or prohibition.'",
        "'speaker_0': 'Thank you so much. So we are now going to hear comments on Amendment two. Are there any comments on Councilmember Herbold amendment to. Hearing and seeing none. I will ask that the clerk please call the role on the adoption of Amendment two.'",
        "'speaker_0': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So what I.'",
        "'speaker_2': 'Strauss I.'",
        "'speaker_1': 'Herbold. I. Whereas.'",
        "'speaker_3': 'Only Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Morales.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Macheda. I. President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you. The motion carries. The amendment is adopted, and we now have a further amended bill before the Council. Are there any further comments on the bill as amended? Okay. I'm not seeing anybody raise your hand, but I will.'",
        "'speaker_0': 'As promised, council members want the last word on this bill as the primary sponsor customers on.'",
        "'speaker_4': 'Thank you. I think it's really important that this bill is being passed. It's also important that the bill that's coming up on the chemical weapons be passed without loopholes. But as members of the public have said, and I completely agree with them, this is the absolute bare minimum that the legislative board, the highest legislative body of this'",
        "'speaker_4': 'city, should be doing, especially after we have seen such unbelievable violence being targeted at peaceful protesters, but also in the wake of the fact that eight black and brown community members have been murdered by the police, Seattle police, under Mayor Durkin's reign and not a single police officer has been prosecuted.'",
        "'speaker_4': 'So the larger context is extremely important for us to remember that while these bills are critical and they will indeed be historic, actually, because it is in some ways quite absurd that we are having to do this, that we have a city that does not have already a law that bans chokeholds and chemical weapons.'",
        "'speaker_4': 'But it is important that we are doing this today. But we have to go much, much farther. The police officers who have committed such horrific crimes need to be brought to justice, and they will not happen as long as the establishment is overseeing it.'",
        "'speaker_4': 'Because we saw what happened under Mayor Durkan and what we what has happened in the past years. And so the city and the people of this city needs an independently elected civilian oversight board with full powers of the police, including hiring, firing and subpoena powers and the ability to bring the police officers justice and high prosecution.'",
        "'speaker_4': 'But we also need to urgently defund the police by at least 50% and make sure that the the establishment doesn't just take on the vocabulary of the movement, but actually responds to it with real action. And most immediately, we need to make sure that all the protest arrestees are released without charges.'",
        "'speaker_0': 'Thank you. Council members want for those final remarks. I'm going to go ahead and close out debate on this bill as amended. So I would ask that the clerk please call the roll on the passage of the bill as amended.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Know what.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Draw.'",
        "'speaker_1': 'I verbal. Whereas.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Lewis, i. Morales, I. Macheda i. President Gonzales. I. Nine in favor. None opposed.'",
        "'speaker_0': 'Thank you. The bill passes as amended and the chair will sign it. I'd ask that the clerk please affix my signature to the legislation. Okay. Agenda item three. I would ask that the clerk please read item three into the record.'"
    ],
    "Ban on Crowd Control Weapons for Seattle Police Department.": [
        "'speaker_3': 'Agenda Item three. Council 119805 relating to the Seattle Police Department banning the ownership, purchase, rent, storage and use of crowd control weapons and adding a new section 3.28. 146 of the Kalamazoo Code.'",
        "'speaker_0': 'Thank you, Amelia. So I am going to go ahead and put the bill before us. I'm going to move the past. Council Bill. 119805. Is there a second? It's been moved and seconded to pass the bill. Customer Silent You are the sponsor of the bill, so you are once again recognized to in order to address the underlying'",
        "'speaker_0': 'bill. And then we have several amendments to walk through as first one.'",
        "'speaker_4': 'Yes, I. I actually want to. I want to speak to the bill, but I also want to move to amend council bill 119805 as presented on Amendment three. So I want to know the order in which I should do that.'",
        "'speaker_4': 'Should I speak to the base amendment and then move the amendment?'",
        "'speaker_0': 'So I think we're going to take the amendments in the order that they were published. So that's two amendments from Council member Herbold. And I know that you circulated your office excuse me, your office circulated an amendment three after the noon deadline.'",
        "'speaker_0': 'So I would ask that we go through the amendments as they were published on the agenda and then and then consider Amendment three if it's needed. It's it's a little bit of a Jenga puzzle that we're going through here, because there are portions of your amendment, Councilmembers Amendment three, that would incorporate.'",
        "'speaker_1': 'Components.'",
        "'speaker_0': 'Of Councilmember Herbals and amendments as represented in both Amendment one and Amendment two. So depending on how Amendment One, an amendment to shake out, we may not need Amendment three or we may need all of Amendment three. If Councilmember Herbals amendments do not do not pass.'",
        "'speaker_0': 'So I think I think that we should do what we should do and fairness here, because it's very confusing and there's been a lot of back and forth and in email. And I want to make sure that all of our colleagues and the public have a full understanding of the suite of amendments before us.'",
        "'speaker_0': 'I think before calling anything to a vote, I think it would be prudent for us to have a conversation of all three amendments. And so that we can get an understanding of Amendment one amendment to an Amendment three that I will be planning on calling for a vote on the amendment in the order that they were presented'",
        "'speaker_0': 'on the agenda.'",
        "'speaker_4': 'I'm happy to have a conversation about all of them. But just in terms of the order, I just wanted to clarify. I don't agree with your description of the order in the sense that all the bills that came from my office has, as has been there long before her verbal brought out amendments.'",
        "'speaker_4': 'I just want to clarify to the members of the public that what my office published after noon incorporates components of Councilmember Herbert's amendment that I don't object to. So it's a hybrid bill, except for the amendment that I deeply object to.'",
        "'speaker_4': 'So it's not it's not accurate to say that my bill came after hers. And as a matter of fact, this bill does amend this amendment. That doesn't Herbold has, which will really be a real attack on the bill, was sent out by her at 11:12 a.m. this morning, giving the public about 2 hours and 45 minutes to'",
        "'speaker_4': 'see it. So I just wanted to clarify that. And I would I would say that the fair way to do it is to consider Amendment three, because it's basically my bill with the amendments on Councilmember Hubble that I don't have an objection to.'",
        "'speaker_4': 'And because my bill came before everything else, I think that should be considered for amendment, which should be considered in my view. But. And if you want to respond to that, I'll stop or I'll I'll continue with my description.'",
        "'speaker_0': 'Yeah, I think I think you've you've made your record. I don't think I said anything inconsistent. I didn't if I use the word bill, that was an inadvertent use of the word bill. What I'm saying is that your Amendment three and was not published on the agenda, at least on the version of the agenda that I had'",
        "'speaker_0': ', was not published on the agenda. Am I am I wrong that your Amendment three was published on the agenda?'",
        "'speaker_4': 'No, no, you're not wrong. All I'm trying to clarify is that that bill is it was just with the intention of simplifying the work by incorporating consumer herbals bills that we don't disagree with, so that the discussion was focused on the the Key Amendment, which I don't believe should be passed by the city council.'",
        "'speaker_0': 'And I hear you again. I do hear you. I just wanted to clarify that. I didn't mean to imply that that somehow I'm not trying to make any sort of I'm not trying to imply anything. I just want to make sure that we have the sequence of how we got the amendment.'",
        "'speaker_0': 'So there were two amendments that were published on Friday to the public and to Councilmembers Amendment three. I came to us at noon, and I understand that there is nothing necessarily new in there because you're incorporating portions of things that were already published.'",
        "'speaker_0': 'And I think that's maybe where we're getting our semantics crossed. And I'm following now. I'm following now. So thank you for thank you for for your for your patience and your your understanding on that. So so I think I think just so that we have a holistic conversation about it instead of I think it would be prudent'",
        "'speaker_0': 'for us to go through each of the motions. And but I'm not going to call for a vote on the motions. I want to sort of hear how conversation goes before we start calling for motions. But but why don't we go ahead and start at this point?'",
        "'speaker_0': 'Councilmember Silent, since you are the prime sponsor of the bill and and I and I need you to address the underlying bill, I will hand the floor over to you, too, as the prime sponsor of the bill to address the substantive bill.'",
        "'speaker_0': 'And in doing so, you are free to describe your amendment, your proposed Amendment three. Again, not asking you to make a formal motion yet. Just describe and talk to us about your proposed Amendment three. And then we will hear from Councilmember Herbold accordingly.'",
        "'speaker_0': 'So customers want the floor is yours.'",
        "'speaker_4': 'Thank you, President Gonzalez. Appreciate that. The bill that's under consideration now from our movement and from our office bans the city from owning and the police from using crowd control weapons like tear gas, mace, blast balls, flash flashbangs, plastic bullets and other weapons that are typically used indiscriminately on gatherings of protesters.'",
        "'speaker_4': 'Some of these weapons, like your gas, have been banned for decades from use in war by the Geneva Convention. And yet the mayor of Seattle, Jenny Durkan, and Seattle police under her control have repeatedly on a daily basis used them since the George Floyd protests began on May 30th against the people of Seattle.'",
        "'speaker_4': 'As we've discussed before, we believe many of us have witnessed the. Many of us have experienced it in the members of the public. And for days the Seattle Police Department used these weapons on the streets of Capitol Hill.'",
        "'speaker_4': 'They falsely claimed that the protesters were violent riders and that they had no alternative. That is absolutely untrue. I mean, it could not be more untrue. They have even attempted to maintain those lives in the face of video evidence showing us that the police were the source and the sole source of violence and that they were not'",
        "'speaker_4': ', quote unquote, responding to any situation, but that they were there with the intention of inflicting violence. We have evidence that the police were a source of the violence even further now, because after the mounting public outrage eventually forced Mayor Jenny Durkan to pull the police back from the streets of Capitol Hill, the violence has left with them'",
        "'speaker_4': '. There is nobody there with riot gear armed to the hilt, with all kinds of equipment and chemical weapons. There's no such thing. Only the police have them. Here in Seattle and around the country, demonstrators have been grievously injured by these weapons.'",
        "'speaker_4': 'And an open letter signed by over a thousand medical professionals has explained that weapons like tear gas and mace significantly increase the danger of COVID. We need to ban these weapons which have been misused against protesters for decades.'",
        "'speaker_4': 'The police and the political establishment simply cannot be trusted with them. Seattle police might argue that without tear gas, rubber bullets and blast walls, they will use even more lethal, even more lethal weapons against demonstrators. We have to completely reject this dangerous argument.'",
        "'speaker_4': 'The purpose of this legislation is to prevent the police from meeting protests with any violence whatsoever. If the Seattle police instead show up with more lethal weaponry, that would be absolutely devastating and disastrous. But that would only I and I hope that doesn't happen, but that would only prove the point that this Black Lives Matter movement is'",
        "'speaker_4': 'making, which is that it does not work for us to have a police state. We need our community to be organized, for us to keep ourselves safe and for public safety for all. If Seattle passes this legislation, it will be historic and it will be an inspiration for what movement around the country can win.'",
        "'speaker_4': 'But we also need to remember that this won't be enough. We will need to go much farther with all the steps that I was outlining earlier, which I will reiterate once again later before passage of this bill. Just wanted to quickly say that in terms of making sure that the public is on the same page as us'",
        "'speaker_4': 'in terms of understanding the process, at some point, Councilmember Herbert's amendment will be considered, which on the face of it claims that all it's doing is clarifying what is what it is, what is, what is crowd control, that it is simply intended to say that the legislation does not apply to non crowd control situations.'",
        "'speaker_4': 'But what it will actually do is create giant truck sized loopholes that will allow the use of these weapons in virtually any situation. The problem is that Seattle police will abuse those loopholes. Look at what happened at the mayor's much publicized 30 day O.C. ban.'",
        "'speaker_4': 'Seattle police, to quote one of the public comment, are simply do not have the track record that should lead us to believe that we can trust them to not use weapons on peaceful protest. We heard testimony from Bettina who said a woman took a flashbang grenade in the chest and almost died and had to be revived with'",
        "'speaker_4': 'multiple CPR routines. That's a really important example of why I in my view, it would be horrific to pass Councilmember Herbert's amendment, because it brings up the question of what kind of society do we want to be? We absolutely you know, it will be sending a message to the people of Seattle whether that amendment is based on'",
        "'speaker_4': 'which side the council is actually on. And whether the council is actually doing everything in its power to prevent such occurrences and to prevent such violence. I have more points on the amendment that Councilmember Herbold has, which I hope that she just withdraws.'",
        "'speaker_4': 'I honestly, I'm being very honest. I hope that Councilmember Herbold has taken to heart the incredibly powerful public testimony that we have heard, and that she puts that in front of us and and understands that we cannot you know, we cannot have politicians co-opt the language, the vocabulary of movement and say we are going to reimagine the'",
        "'speaker_4': 'police and we're going to dismantle the police and then refuse to do the bare minimum. I really hope Herbold withdraws our amendment and that we are able to, as a city council, unanimously pass this legislation.'",
        "'speaker_0': 'Sorry. Sorry for my delay. Thank you, Councilmember Solent. Can you specifically just before we open it up for more comment and consideration of the amendments? Because I want to be really clear as to what language in the amendments you see as being being a loophole B in large part because your Amendment three incorporates some of the language'",
        "'speaker_0': 'in Councilmember Herbals amendments, but does not incorporate other parts. So could you walk us through what portions of Councilmember Herbold, Amendment one and two you favor and what what specific language you believe is is problematic to the underlying intent of your council bill.'",
        "'speaker_4': 'Yes. To do. To do it. In a brief summary, I will say just to keep it short. I won't say that I, I don't I don't necessarily think the other amendments are that great, but I don't object to them.'",
        "'speaker_4': 'I'm glad that Gartenberg old has withdrawn her intention to delay the vote on the bill, so that's not no longer a question. What I am objecting to and what you heard, what we all heard public, powerful public testimony on is on page two of what is titled as amendment number two.'",
        "'speaker_4': 'That is and that show's got a sponsor council member Herbold. And that is section D in the in the in the in the amended version by on verbal, that section D is amendment is what I'm objecting to. And I just want to read that out and explain it a little bit.'",
        "'speaker_4': 'That amendment says a kinetic impact projectiles, chemical irritants, acoustic weapons, directed energy weapons, water cannons, disorientation devices, ultrasonic cannons, or any other device that is designed to be used on multiple individuals for crowd control and is designed to cause pain or discomfort is not a crowd control weapon for the purpose of owning, purchasing, renting or storing under'",
        "'speaker_4': 'the subsection if the device is used for a purpose other than crowd dispersal. The problem with this amendment is that it leaves up to the up to the police to decide what they were actually doing and claimed that it was not for crowd dispersal or for crowd control called crowd control.'",
        "'speaker_4': 'Because, you know, I mean, just to explain, this amendment would rebel would create an exception that says that any of these weapons, the number of weapons that I mentioned, including direct energy weapons and tear gas and flashbangs and ultrasonic cannons, can be used if and I quote, the device is used for a purpose other than crowd dispersal'",
        "'speaker_4': ', unquote. What this means is that the ban on owning all these weapons would be somewhat meaningless by itself because the police can say that they are owning them to use for other purposes. It wouldn't stop them from buying them.'",
        "'speaker_4': 'You also mean that they could be used anywhere if as long as the police claim that they are that they didn't. That specific incident of use of that weapon was not for crowd dispersal. For example, if the police.'",
        "'speaker_4': 'Say that there is a person in the middle of the protest and they just don't like that because the person is saying something or because they threw an empty water bottle at the police then. And if the police respond to that person by spraying the crowd, supposedly to stop that person from throwing a water bottle, then suddenly'",
        "'speaker_4': 'under this amendment, if this amendment passes, then this is this would be allowed under this bill, which is basically for the police to respond to somebody throwing a water bottle by spraying the entire crowd, including children with mace or pepper spray or tear gas.'",
        "'speaker_4': 'And I and I use this example because this is not a hypothetical situation. This is exactly what we saw again and again on the streets of Seattle with police officers using the fiction that they were somehow endangering. I've seen she's best making the same argument that somehow sometimes the police work hard.'",
        "'speaker_4': 'How is it possible that the police were hurt with water bottles? I mean, look, let me let me be clear, though. Let's let's let's contrast the water bottle with the police who have been they don't come just by themself as police officer.'",
        "'speaker_4': 'They come as riot police. They they come there to start a riot, which means that they are armed to the teeth with riot gear, protected with helmets, face shields, body shields, shoulder arm, car golf and badge batons. I mean, it's absolute gaslighting, too, for the police to even remotely claim that we need to allow them any leeway'",
        "'speaker_4': 'to use this these weapons. On Sunday, when the SBT, you know, Sunday a week and a half ago and the hospital used flashbang teargas and pepper spray on myself and other protesters, they at that point also, they claimed it was to get people to back up, not to disperse.'",
        "'speaker_4': 'And we were doing nothing. We were peacefully protesting. Those are our streets. We were demanding the right to walk on those streets. That's all we did as walk forward. So anytime we make a restriction on police brutality, depending on the purpose or the intent of the officers, that creates a loophole that can then encompass the whole world'",
        "'speaker_4': 'because then you can never prove intent. That was the whole point behind the whole campaign of not this time is to go after this whole this insidious idea that unless you can prove the police had malicious intent, you can't hold them responsible.'",
        "'speaker_4': 'This the situation is not the same, but it's analogous to that situation where it comes down to the police claiming that it was not for crowd dispersal. So I would really urge council members to reject this loophole. I mean, this whole protest movement, this whole uprising is against police violence and brutality.'",
        "'speaker_4': 'I mean, you cannot have politicians saying Black Lives Matter and that you stand with a protest movement and then turn around and then pass loopholes that hand the power back to the police. I second the person who said in public comment on the fact that they're even having to discuss this is repulsive.'",
        "'speaker_4': 'And I will say this, this if this amendment passes, it will be a continuation of the past pro-police policies of the Democratic politicians on the city council. And it will be nothing less. And I and I don't say this lightly, it will be nothing less than a racist amendment.'",
        "'speaker_4': 'And it would be a betrayal of the movement and of the black community. This is not a small thing. I really hope that this amendment does not pass. And better yet, I would urge Councilmember Herbold to withdraw this.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. So once all what I heard from you in particular, that in terms of the full breadth of Amendment two, you read directly from amendment to the language that you think creates the loophole in the way that you have described it.'",
        "'speaker_0': 'In other words, if the police department is allowed to continue to purchase chemical weapons that are used for crowd dispersal and not currently allowed to be used for crowd dispersal, but prohibited from being used to from crowd dispersal in the future, that sort of allowing them to continue to have possession of these types of weapons undermines the'",
        "'speaker_0': 'broader goal of of of being able to control how they use it. And sort of your argument I'm hearing is, is, you know, we should have a policy position of not allowing the police department to own these own these chemical weapons for free for any purpose, but in particular for crowd dispersal use.'",
        "'speaker_0': 'And it's too hard for us to figure out how to control the legitimacy of the position that might be taken by the police department, that they were using it for, quote, crowd dispersal, close quote. So I just because I really want to sort of zero in on the and the part of the amendment to that you find'",
        "'speaker_0': 'that most most problematic. And I'm hearing that that is the language and those are that in general a summary of the reasons why you think it is problematic.'",
        "'speaker_4': 'Generally, I agree, but I would of course, put it in very strong terms as I did before. But also just to clarify. Absolutely, it is about not allowing the police to have possession of these weapons, but that is related to the fact that we cannot trust them.'",
        "'speaker_4': 'And and if anything's been established about the police, without without any doubt is that they cannot be trusted because they have broken that trust every single time. And as I said, a concrete example, as I used, was something that I personally experienced and witnessed where the police did say this is not for crowd dispersal and the next'",
        "'speaker_4': 'thing you know, they were dispersing the crowd with teargas. They said it was not for crowd dispersal only because we were moving forward. That's my point. It's already happened. We have examples that show that if we pass this loophole, what happened on Sunday night, what happened on the night before will continue to happen even under that law'",
        "'speaker_4': '. That's why we have to reject that.'",
        "'speaker_0': 'Got it. Okay. That's very helpful. I think to me and to members of the public to hear a little bit more clearly about where the difference lies between Amendment three and some of the language of this amendment that you included there, but not this particular language.'",
        "'speaker_0': 'I do want to go ahead and provide Councilmember Herbold an opportunity to address both that specific language in amendment in amendment to that she has put forth in front of the council, as well as having her describe other parts of Amendment two and then also an amendment, Amendment one.'",
        "'speaker_0': 'So why don't we go ahead and shift over to Councilmember Herbold to respond to your concerns related to Amendment two and describe other aspects of Amendment two, and to also walk us through Amendment one.'",
        "'speaker_1': 'Thank you so much. So Amendment One does several things. It amends the recital clause as it relates specifically to the actions of SPG over the last few weeks around escalation of crowd violence. It adds a new recital reflecting the findings from the June 12th, 2020 Office of the Inspector General Report.'",
        "'speaker_1': 'Less Lethal Weapons in protests. It makes some changes to Section one. One is to exempt from the prohibition of crowd control weapons any device that meets the definition of the crowd control weapon but is not used for crowd dispersal purposes.'",
        "'speaker_1': 'And also in section one, there are some other technical and legal changes. It requests that the police accountability agencies provide by August 15th, 2020, a recommendation on the use of crowd control weapons for crowd dispersal to include suggested policy revisions to the speed manual identification of a crowd dispersal authorization process that requires the executive approval and reflects'",
        "'speaker_1': 'best practices in policing to minimize harm to protesters. And it is, of course, the statutory authority of the OPA, CPC and OIG to do this in the 2017 Accountability Ordinance that Council approved. And I really want to lift up their authority to, to consult with the council on in these areas.'",
        "'speaker_1': 'This in no way this request or for a report back in no way as we have heard from some folks in public testimony, I'm not sure where people are getting the information, but maybe it's just because it's the short turnaround.'",
        "'speaker_1': 'This request of the OPA, OIG and CPC to report back to council does not in any way delay implementation of this legislation. The bill amendments like the Bill before it requests that there be notice of the the prohibition against crowd control weapons to the Department of Justice, the Court and the Monitor in accordance with the consent decree'",
        "'speaker_1': '. Use of force is at the heart of the consent decree, and changes to city policies must be submitted to the court. And the amendment indicates that the Council recognizes the role of court there. And then also similarly to what we just did in the earlier bill, the amendment expresses the Council's intent to support Labor relations in the'",
        "'speaker_1': 'implementation of the of the prohibition against crowd control up in use. And then finally it adds as an attachment the less lethal weapons in protest report from the Office of the Inspector General for Public Safety, jointly issued with the OPA on June 12th, 2020.'",
        "'speaker_1': 'At this time I would like to offer or invite, I should say, amendment to my Amendment one as it relates specifically to the section where we exempt the prohibition of crowd control weapons. When a device that meets that definition is not used for crowd dispersal purposes, this has become, I think, a distraction around the intent of the'",
        "'speaker_1': 'amendment. And from my perspective, offering this was just merely consistent with the title of the bill itself, which talks about crowd control weapons and recognizes that there are some circumstances where the the police department has things to do besides crowd dispersal, where a less lethal tool like these might be useful.'",
        "'speaker_1': 'Again, I invite any council member to to amend council I'm sorry, Amendment one to remove the new language under section D, which says Kinetic Impact, projectiles, chemical irritants, weapons directed energy weapons, water cannons, disorientation devices, ultrasonic cannons, or any other device that is designed to be used on multiple individuals for crowd control and is designed to cause'",
        "'speaker_1': 'pain or discomfort is not a crowd control weapon for the purpose of owning, purchasing, renting or storing under subsection 3.28. 146a if the device is used for a purpose other than crowd dispersal. So again, an amendment to that would would remove that language as I just read and read the.'",
        "'speaker_1': 'Old Section D language.'",
        "'speaker_3': 'Madam. Madam President, may I make such motions, Councilmember Juarez, to strike this for said language of Councilmember Herbert regarding Amendment two that it be stricken.'",
        "'speaker_0': 'Okay. So let me confer. Let me confer with our Clerc, Emilio Sanchez, who is on the line. And there has been an expressed interest from Councilmember Juarez to strike subsection D from Amendment two, which is the Herbold amendment.'",
        "'speaker_0': 'Can you please advise the Council on the procedural rules related to such an amendment?'",
        "'speaker_3': 'Council members. This is Amelia Sanchez. At this point, this motion has not been made. It's also not before the council. This is just for discussion. So therefore, the sponsor and the can actually modify this amendment before they even present it or after she moves the amendment.'",
        "'speaker_3': 'So therefore, you have a couple of options. One, when the motion is made, we can consider a modified amendment, which would be with the exception of that section, subsection D, if that is the only amendment that we would sustain proposed to be removed at this point.'",
        "'speaker_3': 'So. Council President for clarification to Madam Clerk, do I withdraw my motion to strike and allow Councilmember Herbert to reintroduce her amended amendment? Councilmember suarez at this point, you are welcome to withdraw your amendment. At this point has not been seconded.'",
        "'speaker_3': 'And at that point, after Council member Herbals can then move her modified amendment without that section. See a section. Okay. All right. Thank you.'",
        "'speaker_0': 'So, Emily, if I understand you correctly, are you saying that the only member that is allowed to make a motion to strike subsection D is the prime sponsor, which in this case would be Councilmember Herbold.'",
        "'speaker_3': 'At this point because this amendment is still not before the city council has not been moved, nor has it been seconded.'",
        "'speaker_0': 'Got it. Okay.'",
        "'speaker_4': 'And I ask a question and hopefully that might also help.'",
        "'speaker_1': 'Sure. Sure. So I will take all the help I can get.'",
        "'speaker_4': 'And if it doesn't help, I'm. My apologies in advance. But I. Is. Is my understanding correct, Councilmember Herbold, that you are essentially withdrawing that subsection D, that D that I was objecting to, which in which case we could take Amendment three, which takes up which include incorporates all of Councilmember Herbert's amendment, except that one and all my'",
        "'speaker_4': 'technical amendments, which were on the advice of the city attorney. So is is is that essentially going to be agreeable for everyone?'",
        "'speaker_0': 'Councilmember Herbold.'",
        "'speaker_1': 'Thank you. Unfortunately, your substitute or your Amendment three does not include the language lifting up the role of the OPA, OIG and CDC. So I would I would prefer to move forward as as proposed where we move on Amendment one as as as I proposed to modify.'",
        "'speaker_0': 'Customers want.'",
        "'speaker_4': 'That's fine with me, but I. I have a million. You've got me if I'm wrong. But I have a feeling that will be a longer process. Wouldn't it be shorter if we take Amendment three? Put that on the table and then have constant verbal move, an amendment to include that language, which I'm not opposed to and.'",
        "'speaker_4': 'And then have a vote on that.'",
        "'speaker_0': 'I think the process is going to be about equal length because both require an amendment to an amendment. So I don't think that one is more expeditious than the other. But nice try. I appreciate it.'",
        "'speaker_4': 'I wasn't I wasn't going to be clever. I thought there would be more iterations to the other way because I thought my technical amendments are not incorporated in yours. Guns and herbals, am I right?'",
        "'speaker_1': 'I don't know if you have additional technical amendments beyond the technical amendments that I have in mind and that you have included yours. So. Okay.'",
        "'speaker_4': 'Okay. Thank you for clarifying.'",
        "'speaker_1': 'My. My understanding is that you you have incorporated the technical amendments that I that I proposed in my original amendment one in yours.'",
        "'speaker_4': 'Yes. I just wanted to I just clarified with my staff that the technical amendment of those suggested by the city attorney's office are also in that latest version from which they are.'",
        "'speaker_0': 'Great. Okay. So why don't we go ahead and take Amendment 1/1? I think we have sort of a landscape of what the different versions are. I appreciate the discussion and the debate here, and I appreciate that you all were flexible enough to hear about all three amendments as three potential rounds here and before we made formal motions'",
        "'speaker_0': '. And Councilmember Herbold, I do appreciate your willingness to invite striking subsection D from amendment. Amendment one. I, I think that that the ultimate goal here is to prevent the acquisition and the possession of these chemical weapons. And I think that we will have an opportunity to, you know, have the court weigh in on the appropriateness of the'",
        "'speaker_0': 'policy choice that the city council has made. I certainly continue to support this bill and its underlying intent as introduced by Councilmember Samant. And I do believe that you do as well. And and I think, again, I think we will.'",
        "'speaker_0': 'We will be better served as a city without the language in subsection D and really do sincerely appreciate your your willingness and your flexibility in considering making an amendment to your own amendment to strike that language so that we can move forward on this really important policy and so that we can follow through on the City's obligation'",
        "'speaker_0': 'to submit this Council bill to the Court for review by both Judge Roe Bar, the Federal Monitor and and the DOJ. So I think the sooner we get that clock started and get that review going and the better served we will all be.'",
        "'speaker_0': 'And hopefully they will agree with our strong and clear policy position that we just don't believe these weapons have a place in our department. So, Councilmember, I'm going to hand it back over to you to walk us through Amendment One.'",
        "'speaker_1': 'Thank you. So I I'm happy to walk us through it again. But I in in the short term, I'd just like to move to amend Council Bill 11 9805 as presented on Amendment one on the agenda, accepting the language in Amendment one related to new Section D and restoring the old Section D as in the proposed legislation'",
        "'speaker_0': '. Okay. Emilia, before I invite a second, I want to make sure that that motion was. Was properly. Raised.'",
        "'speaker_3': 'I understood it from parliamentary procedure. It would be to reinstate the stricken section, subsection B language and to completely remove the new section subsection B language as proposed by council in the referral.'",
        "'speaker_0': 'Okay. So the end result of that would be elimination of new proposed subsection D as reflected in Amendment two. Okay. So is there a second?'",
        "'speaker_3': 'Second?'",
        "'speaker_0': 'It's been moved and seconded to amend Amendment two, Amendment one, as described by Councilmember Herbold. Is there any further discussion? Okay. Hearing none with the clerk, please call the rule on the amendment to Amendment one.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So what.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Drew.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_0': 'I was.'",
        "'speaker_3': 'I. Lewis. I. Morales.'",
        "'speaker_1': 'I must get to. I. President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. So that amendment passes and the bill is amended as described in Amendment One. So we now have a Second Amendment to consider. And I will hand it back over to see. Amendment two is councilmember hurdle does that your amendment?'",
        "'speaker_0': 'Now. Okay. So Amendment two is council members wants amendment.'",
        "'speaker_4': 'I believe after the steps we've just taken, amendments two and three are not necessary to go through.'",
        "'speaker_0': 'Okay, great. Councilmember Herbold, do you have any other amendments to put forward? Nine. What? Excellent. Well, we have resolved a lot of issues in and just I think being able to have the conversation that we did was really helpful.'",
        "'speaker_0': 'So thank you again, colleagues, for that. That exhausts our amendments on this particular bill. So we now have an amended bill before us. And let's see here. Let me get back in line on my. Agenda here. And then, Madam Clerk, is there any formal language that needs to be done besides councilmembers silence language around withdrawing amendments two'",
        "'speaker_0': 'and three?'",
        "'speaker_3': 'I am double checking really quickly. So we just type and it looks like the actual subsections are numbered correctly. So we are good to go at this point if you want to consider the bill as amended.'",
        "'speaker_0': 'Excellent. Thank you so much. Music to my ears. So, colleagues, we are we now have an amended bill before us. Now is the time where we can take further comment on the underlying bill as the amended confers. What?'",
        "'speaker_0': 'You will have the last word as the prime sponsor of the bill. Are there any other council members who would like to address the substance of the bill as amended before us? Councilmember Peterson floor is yours.'",
        "'speaker_2': 'Thank you. Council President I just wanted to thank Councilmember Swan for introducing this bill. I was an early supporter of it and also wanted to thank our public safety chair, Lisa Herbold, for for reviewing it, carefully thinking it through from a from additional lenses so that we could have these additional amendments and thank council president and the'",
        "'speaker_2': 'city clerk for guiding us through all the amendments. I appreciate it. I hope the public can see that we're trying to be unified here and work together on these serious issues. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. Any other comments on the bill? Okay. I also want to signal my my thanks to Councilmember Blunt, who quickly introduced this bill, as well as the previous bill that we just looked at around chokeholds.'",
        "'speaker_0': 'I just really want to thank you, Councilmember Silent, for introducing this bill. Many of us had made public statements before the introduction of this bill about the need to ban the use of chemical weapons that were intended for for foreign wars and to address terrorism in the aftermath of 911.'",
        "'speaker_0': 'The fact that those types of weapons were being used domestically on our own residents is just abhorrent. And so I was an early supporter of trying to use the levers that were available to me as a council member in the background to use the power of persuasion to stop the use of those weapons and those tactics on'",
        "'speaker_0': 'our people who were peacefully protesting. And unfortunately, those those those calls for for action and for a pivot were were not answered. And when we had a moment, a small, brief moment of thinking that it was going to be answered, that the call was answered to stop using those chemical weapons, we saw that within within approximately 24'",
        "'speaker_0': 'hours, that same tear gas was being used once again on peaceful protesters and within one of the densest neighborhoods, not just in the city, but the densest neighborhood in the state, where we kept hearing reports from families and from other residents who weren't even protesting, who were just existing on Capitol Hill, who were suffering the consequences of'",
        "'speaker_0': 'this non discriminant use of tear gas. So I absolutely support this legislation. I look forward to submitting it to the court for further review. Again, following on our model that we used in 2017 when we consider the Police Accountability Ordinance and then submitted it to the court for review.'",
        "'speaker_0': 'We understand that we have an obligation to do that and know that that our city attorney's office will pursue that path. And hopefully we will get affirmation from the court as it relates to the policy choice that we've made here today.'",
        "'speaker_0': 'And again, really appreciate the commitment to bringing this forward, to doing it quickly, because we do have a sense of urgency around making sure that this is addressed quickly. Of course, we still have the issue of all of the chemical weapons that are currently owned by Seattle Police Department that are in the inventory.'",
        "'speaker_0': 'And the language of the bill does not necessarily require them to dispose of those that existing inventory. So we will have to have a conversation about how we effectuate the disposal of those items without the unintended consequence of having to send those weapons to other cities where they will be used in ways that will have negative impact'",
        "'speaker_0': 'and harm there as well. So looking forward to having that conversation. I did see Councilmember Mosqueda as I was talking, raise her hand. She's she's feeling inspired now, so we're excited about that. So I'm gonna go ahead and hand it over to councilmembers gave if any other councilmembers have comments to make please do raise your hand or'",
        "'speaker_0': 'shoot me a quick text message to let me know that you have comments to make. And again, Councilmember will have the last word on this bill as members get it.'",
        "'speaker_1': 'Thank you very much, Councilmember. It's a want for introducing this bill in council president. I think you did inspire me to want to chime in on a few more pieces. We talked a lot this morning and in the last week and a half about the type of situations that we've seen.'",
        "'speaker_1': 'And I want to give you a list of how I think that this piece of legislation will immediately help protect the health and safety and save lives of residents throughout the city. This is not just coming out of a desire to de-escalate the strategies police are using.'",
        "'speaker_1': 'This is actually coming from a direct result within the last two weeks of people calling us. Emailing us, grabbing us while we're in the street to tell us what they've seen from the inspector general. The list of of claims that we've heard are people who have experienced having a thumb amputated because of a flashbang device.'",
        "'speaker_1': 'A protester who is now partially blind due to rubber bullets being used. We heard stories of a woman who had to be resuscitated after getting hit in the chest with a flashbang device. We know the story repeatedly of a young boy, seven years old, getting sprayed in the face with pepper spray.'",
        "'speaker_1': 'And this is in addition to all of the other stories that we're hearing just about excessive force officers kneeling on the neck of two detainees in our area, officers punching a youth on the ground the Friday night before the main Saturday night protests.'",
        "'speaker_1': 'An officer punching a person on Saturday night. Failure to secure the rifles in their cars. These are the type of complaints that we're hearing from across the city. So at least taking away these weapons of war and to the good points that were made earlier today, the weapons that have been deemed illegal in actual course of war'",
        "'speaker_1': '. Getting those off of our streets and having those not used against our residents is critical. I thank you for putting forward this bill, and I just think it shows a strong show of solidarity across this entire council that every single person was wanting to act quickly last week and today to move forward with this legislation.'",
        "'speaker_1': 'It was probably past due before this week, and I appreciate the urgency in which it's been brought forward to respond to the calls for action from the community. Thanks. I'll. Hey.'",
        "'speaker_0': 'Councilmember Herbold, please.'",
        "'speaker_1': 'I just want to underscore how much I appreciate the fact that all council members voted for my Amendment one, particularly as it related to lifting up the the role and the importance of our accountability partners. Again, in 2017, under Council President Gonzales.'",
        "'speaker_1': 'Leadership, we voted for our accountability ordinance, which gives the OPA, the OIG and the CPC and a very, very important role in consulting with the Council as it relates specifically to policies like the ones that we are about to vote on and the amendment that councilmember.'",
        "'speaker_1': 'Councilmember Salant was proposing her version of Amendment three did not include that language. And I think it's really important that we as a council not do anything to undermine the role of those bodies as we as we continue to have these conversations around around the use of force and changes to police practices.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold, for those remarks. I also agree that we can take a strong position on on this particular policy issue, while also continuing to lift up the role, the importance of the role of the OPA, the IG and the CPC in in sort of as we continue to move forward, I think it is really important'",
        "'speaker_0': 'for us to continue to to do that. We have not, to my knowledge, received any recommendations from the Community Police Commission about needing to completely redo our three legged stool around accountability system. And and I think they have still, at least as far as I know, still support the model that was originally proposed in 2017 through our'",
        "'speaker_0': 'Police Accountability Ordinance. And I intend to continue to to support that model until we we receive different recommendations at the Community Police Commission. So thank you again for pointing that particular issue out. And I do think that we have found a nice balance now where we have are we going to be able to achieve the underlying goals'",
        "'speaker_0': 'that councilmembers originally had, while also still creating a clear pathway and signal for the three accountability organizations to still clearly, through a directive of the ordinance, have an opportunity to formulate recommendations without delaying the implementation of the underlying goals of the Council Council Bill.'",
        "'speaker_0': 'So with that being said, are there any other comments? Councilmember Strauss You have comments, please.'",
        "'speaker_2': 'Thank you. Council President I'll keep this short. I know that I've said many times that weapons of war have no place on our streets here in Seattle and used against the residents of our community. I realize that I've said that so many times.'",
        "'speaker_2': 'I do need to let the record reflect here in this moment as well. Hearing from the the veteran from North Seattle during public comment today was very important to me to hear about how weapons of war used on our that are not even allowed to be used on our enemies on foreign soil have been used on our'",
        "'speaker_2': 'residents here in Seattle. The residents of Seattle are not our enemy. They are the ones that we are here duty bound to protect, as well as your words Council President about using these these weapons in the densest neighborhood in the entire state.'",
        "'speaker_2': 'So thank you to the sponsor for bringing this bill forward is as quickly as possible. And thank you, everyone, for your diligent work. The council president.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. All right. I think we have exhausted folks who want to make comments. Looks like we are ready. So, Councilmember. So why don't you want to you want to take us home on this bill?'",
        "'speaker_0': 'Unless. Councilmember Whereas I see that you just lit up. Do you have comments you want to make?'",
        "'speaker_3': 'I was just saying going to do my famous line for the love of God, but go ahead. Well.'",
        "'speaker_0': 'Now you said it you for the record. Okay. Councilmember So you get the last word on this bill to take us home so we can take a vote on this and get the law on the books.'",
        "'speaker_4': 'Thank you, President Gonzales. I really must congratulate everybody who was fought for this. These are major victories. Undoubtedly, as many have said, we have a long way to go in terms of police accountability, let alone really eliminating police violence and brutality and addressing the longstanding racism and oppression in our society.'",
        "'speaker_4': 'But still, these are major victories. They're historic, and the movement must celebrate its victories. Both this bill and is about to be voted on and the bill that we just passed on banning chokeholds. I thank all councilmembers. I'm assuming this is going to be unanimous from all the comments that we've heard.'",
        "'speaker_4': 'And I really appreciate that we are going to have a unanimous vote on this on both these important bills. I congratulate everyone who spoke in public comment and who have been speaking up in the last two days, because it was through your intervention, through your getting organized, that this bill that's going to be passed is now going'",
        "'speaker_4': 'to be a strong bill with no loopholes, needless to say, and as we have said lots of times before, passing legislation is not going to be enough. But yet it is crucially important for the movement to hold its elected officials accountable to make sure that the strongest possible legislation is passed at all times.'",
        "'speaker_4': 'So I want to thank the movement. This this victory belongs to you if you faced. Joe. Chemical weapons and rubber bullets if you march rallied or organized, justified. If you weren't able to rally and organize. But you made a phone call to an elected official who held up a sign.'",
        "'speaker_4': 'You talk to a neighbor or if you did anything to stand up for the Black Lives Matter movement and the movement of all working people against police violence, then today's victories are your victories. I especially wanted to congratulate all the hundreds of young people who faced down just unbelievable, unspeakable violence right in our district, in district three'",
        "'speaker_4': 'on Capitol Hill, and whom it was my honor to meet and have lots of political conversations with. In fact, we were sprayed with mace and delirious when we were in the middle of a very exciting political conversation. So I wanted to thank many of them.'",
        "'speaker_4': 'I obviously won't be able to name everybody, but I specifically wanted to name a few. Sean Turner, who's been on the front lines of this struggle and who's also a member of Neighbors. 242 She's been a union member.'",
        "'speaker_4': 'I also wanted to thank Patti Page and Justin Spears, Jody Wiser, who's been documenting the struggle for days. And this victory belongs to everybody who was there on Capitol Hill. Everybody who has been marching and especially wanted to make a mention of all the families and friends who have lost their loved ones because of police murder, like'",
        "'speaker_4': 'the family of Charlie Lyles, the family of the family of John Dee Williams. And indeed, there are too many, because at least 30 black and brown people have been murdered by the Seattle police since 2011. And I've read their names before, but I won't be able to read them now.'",
        "'speaker_4': 'But this victory belongs to the families of all of those community members whose lives were lost at the hands of the police. I completely agree with the mayor. The council members have said that we we we don't we do have to discuss the disposal of the weapons that are in the hands of Seattle police right now.'",
        "'speaker_4': 'We absolutely do not want them to sell them to another jurisdiction, whether it's another city, another state or another country, because this is about international solidarity against police violence and racism. So absolutely, we will not let that happen.'",
        "'speaker_4': 'But we do need to figure out what what what happened to that. And I welcome input from scientists. If they know if there is any socially constructive use at all for those weapons, then we should directed theirs. I welcome your input to my office.'",
        "'speaker_4': 'And in terms of next steps, I think it's important that I just like we had a strong showing of the community today at the meeting for these two bills. Let's hope that we have a strong showing for the Budget Committee on Wednesday.'",
        "'speaker_4': 'There's going to be a public comment sign up. That opens at 8 a.m.. The committee meeting will start at 10 a.m.. As you know, you can easily find out how to sign up. Just Google Seattle City Council public comment and you'll find the online sheet, but you'll have to sign up at 8 a.m. on Wednesday, June 17'",
        "'speaker_4': '. As you know, there are important tasks ahead of us. We need to fight to defund Seattle police by at least 50% and make sure that this city is not controlled by police repression, but by community organizers and through social justice and restorative justice.'",
        "'speaker_4': 'And we are also discussing the tax Amazon legislation to tax big businesses in order to fund a major expansion of social housing, to address homelessness, to fund Green New Deal programs, and most importantly, to fund jobs that will be union jobs, union good paying union jobs and priority hire and free apprenticeship programs to address the inequities faced'",
        "'speaker_4': 'by our marginalized communities. Another next step I wanted to mention is on the same day Wednesday, June seven, 2017, at 4:30 p.m. Calendars and Park. I hope everybody who's fighting in the Black Lives Matter movement will join us because there is a rally being organized by the rank and file of Seattle's labor movement, and they will be'",
        "'speaker_4': 'demanding that the local labor movement leaders, the Labor Council, the King County Labor Council remove the Seattle Police Officers Guild out of Labor Council. And so this is the rally of Seattle police out of our labor council, because this is our labor movement and there is no room in our labor movement for police brutality because an injury'",
        "'speaker_4': 'to one is an injury to all. So please join us in the public comments. Sign up at 8 a.m. on Wednesday, June 17, and also join us on the same day Wednesday, June 17th, at Cal Anderson Park at 430 for a rally alongside the rank and file of the labor movement.'",
        "'speaker_4': 'And then last but not least, I'll say that all of this is extremely important and it's historic, but it's also minimal. So we need to go forward in making the real kind of change that we need to do to defund the police by 50%, to raise progressive revenues by taxing big business to fund housing.'",
        "'speaker_4': 'And most immediately, we need to make sure that those who have been arrested in the protest movement of the peaceful protest movement should be released and no charges filed against them. I hope all councilmembers will support these next steps.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilmember Salon. So I think I'm going to go ahead and close out debate so that we can go ahead and call the roll on this bill. So I am now going to ask that the clerk please call the roll on the passage of the bill as amended.'",
        "'speaker_0': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So why don't.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Strauss I.'",
        "'speaker_1': 'Verbal high. Whereas.'",
        "'speaker_3': 'Hi. Lewis.'",
        "'speaker_1': 'Morales. I mosquito I. President Gonzalez.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will gladly sign it and would ask that the clerk please to fix my signature to the legislation on my behalf. Congratulations, Councilmember Salon, and to all of the folks you mentioned specifically and in general, I think that both agenda item two and three and now for all are contributing to'",
        "'speaker_0': 'a better ecosystem here. And of course, we have a lot more to do, but this is a good, good place for us to start. So congratulations, everyone. Will the clear please read into the record agenda item for.'"
    ],
    "Ordinance on Mourning Band Policy for Uniformed Peace Officers.": [
        "'speaker_3': 'Agenda item for Council Goal 119803 requiring that certain uniformed peace officers do not cover with a mourning band the serial number that is engraved on their badge and section 3.28. 130. The code declaring an emergency and establishing an immediate effective date.'",
        "'speaker_3': 'All might be forced out of the city council.'",
        "'speaker_0': 'Thank you, Madam Clerk. I will move to pass Council Bill 119803. Is there a second?'",
        "'speaker_2': 'Thank.'",
        "'speaker_0': 'It's been moved and seconded to pass the bill. Councilmember Herbold, you are the prime sponsor of this bill, so I am going to recognize you in order to address this item.'",
        "'speaker_1': 'Thank you so much. So today we're voting on Council Bill 11 9803, which will require officers to display their badge numbers while allowing mourning bands to observe the death of officers on a different part of the badge. Many, many constituents have contacted the council, alarmed that batch numbers were not visible in the two weeks following the murder'",
        "'speaker_1': 'of George Floyd. After I announced that I was drafting legislation, Chief Bass issued a directive to all officers to display their badge numbers while wearing mourning bands. I, of course, appreciate that order, but believe that this policy must be adopted into state city law.'",
        "'speaker_1': 'The legislation amends Section 3.28130 of the Seattle Municipal Code, which was created after the 1999 WTO protests, when people noted at that time that they could not view the nametags of officers. So then former City Council member Peter Steinberg sponsored legislation to create a new section of the municipal code to require display of nametag.'",
        "'speaker_1': 'This legislation is emergency legislation. So it will go into effect immediately upon signature of the mayor within the next ten days. It would not have the additional 30 day waiting period for non-emergency legislation. The bill also requests that the Seattle Police Department work with all other law enforcement agencies whose police officers reasonably may be anticipated to enforce'",
        "'speaker_1': 'traffic or criminal laws in Seattle pursuant to Chapter ten point. Our CW to develop a policy that would require these peace officers when enforcing these laws to conform with requirements concerning badges, ID devices, departmental ID on uniforms and oral ID that is consistent with Seattle Municipal Code Section 3.28.130.'",
        "'speaker_1': 'The Seattle Police Department is required by Seattle City Council with a proposal for the policy by January 2021. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold, for that description and for introducing this important bill. Are there any comments or questions on this bill? Hey, I'm not hearing or seeing any. Again, I want to thank you, Councilmember Herbold. I think we have all discussed this bill quite a bit before today and do agree with the approach that you've described, which'",
        "'speaker_0': 'is which is about not just allowing this kind of policy to exist at the discretion of whomever might be the chief, but to actually make sure that this is made concrete and long lasting through through legislation. And, of course, a future council could disagree with their policy position and change that.'",
        "'speaker_0': 'But I think it's pretty clear that this council agrees very strongly that this should be the policy and that it should be codified in law and not just exist in a in a in a police manual or in a directive from from the chief.'",
        "'speaker_0': 'So appreciate the wisdom in nonetheless moving forward this legislation and appreciate you bringing this for our consideration. Because remember state I see that you raise your hand, please.'",
        "'speaker_1': 'Thank you very much. Council member Herbold, thank you for bringing forward this legislation. I just wanted to ask you a question, both as a sponsor of this legislation and as chair of public safety. We know that even after the chief issued that directive, we heard reports of individuals who are still recovering batch numbers.'",
        "'speaker_1': 'Can you remind folks what to do if they see that happen after this ordinance has passed and.'",
        "'speaker_0': 'What the process should be?'",
        "'speaker_1': 'It would be a violation of both MPD policy and city law. The Office of Professional Accountability has a a complaint process to investigate complaints of violation of city policy. And there's also the ability of an investigation, of the violation of city law to to go along the investigation of the violation of city city policy.'",
        "'speaker_1': 'I do want to note that batch numbers are in different places on different people's badges. Sometimes they're in the center and sometimes they're at the bottom. And I know that some of the examples of covered badge numbers that I saw after Chief Best's order had badges, had the had the tape through the middle, and there was actually'",
        "'speaker_1': 'a badge number at the bottom of the badge. And in some instances, I, of course, have not seen every example of every complaint. There are the this issue is is one of the sort of the the top ten issues that the Office of Professional Accountability is looking at as it relates specifically to the volume of complaints that'",
        "'speaker_1': 'they've received.'",
        "'speaker_0': 'Thank you. And either questions or comments. All right. Hearing that, I'm going to ask that the clerk please call the role on the passage of the bill.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Want.'",
        "'speaker_2': 'Strauss i.'",
        "'speaker_1': 'Herbold i.'",
        "'speaker_0': 'Whereas.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Lewis. Hi. We're Alice. I let's get a. Mosquito. I President Gonzalez. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it and I ask that the clerk please affix my signature to the legislation. Okay, folks, we are now in the other business category of city council. I know of our agenda.'"
    ]
}