{
    "Secure Scheduling Ordinance for Retail and Food Services Establishments.": [
        "'speaker_2': 'Bill pass and show sign it. Committee report. Please read the next report into the record, please.'",
        "'speaker_6': 'The report of the Civil Rights, Utilities, Economic Development and Arts Committee Agenda Item one Constable 118 765 relating to employment in Seattle. Adding a new Chapter 14.22 to set limits for code, establishing secure scheduling requirements for covered retail and food services establishments, prescribing remedies and enforcement procedures in many Section 14.20 point zero 25 Ceremonies for code to'",
        "'speaker_6': 'have good faith estimates of work schedules to notice of employment information amending Section 6.208.0 27 Code to Condition Business License Registration on compliance with secure scheduling requirements and amending Section 3.14 point 945 for CO two and Chapter 14.22 to the list of ordinances administered and enforced by the Office of Labor Standards Committee recommends the bill passed as'",
        "'speaker_6': 'amended.'",
        "'speaker_2': 'Thank you very much, Councilmember Herbold.'",
        "'speaker_4': 'Thank you. So I'd like to just give a little bit of background about how we got to this place. The process began shortly after I took office in February. Councilmembers Suarez, Gonzales and myself penned an op ed that I think really identified and highlighted what the issues were.'",
        "'speaker_4': 'We're often asked, what is the problem that you're trying to trying to solve and what are that? What are the struggles that workers are having to deal with that this policy would help address? Here are a few of the statistics that we quoted in that op ed at that time.'",
        "'speaker_4': 'In February, almost half of African-American and Latino workers, 49 and 46%, respectively, report a week or less of advance notice of their schedules. 41% of what they call early career workers. And those aren't teenagers. Those are folks who are between 26 and 32 years old working in hourly jobs.'",
        "'speaker_4': 'Of them, 47% work part time. And they report that they they will know when they need to work again one week or less in advance of the upcoming week. 70% of workers have on call responsibilities, with the majority of employees receiving less than 6 hours notice before they start work.'",
        "'speaker_4': 'And 83% of hourly part time workers report fluctuations in weekly work hours during the prior month. With the magnitude of fluctuations averaging a daunting 87%. So that means for folks who are working or who are hired to work approximately 30 hours a week, only about 20 of those hours would be would be stable work hours over the'",
        "'speaker_4': 'course of a month. These stats really highlight how work schedules disproportionately affect people of color and do not promote the health and well-being of Seattle's working families. Similarly, 40% of households are headed by women who are the primary wage earners in their families, and 63% of those are headed by single mothers.'",
        "'speaker_4': 'So these these policies not just disproportionately impact people of color in the city, but but specifically women of color. The first time we discussed this issue in the cities civil rights, utilities, Economic Development and Arts Committee was on March 8th, and we had a presentation from Professor Susan Lambert from the University of Chicago.'",
        "'speaker_4': 'And we learned that these just in time scheduling practices that employers are using more and more is a is a new manifestation of a of an effort on the part of employers to address their needs to control labor costs by staying within hours, doing due to tight labor budgets.'",
        "'speaker_4': 'All of this leads to greater unsettled scheduling, unpredictability and volatile to volatility, a higher head count of part time workers. Another emerging problem is the workforce is being taken up of more and more part time workers, and fewer hours on average worked.'",
        "'speaker_4': 'Since that March 8th meeting, the mayor's office has convened 17 stakeholder meetings of both workers and employers. And each one of those meetings was followed by a report out to to my committee. Additionally, I know myself as well as other Council members, have met with numerous individuals, including business owners, workers and worker advocates.'",
        "'speaker_4': 'The result of all those meetings, phone calls and emails is the legislation we have before us today. The main policy points are, first of all, businesses are only covered if they have 500 or more employees. And for full service restaurants, you also they also have to have 40 locations.'",
        "'speaker_4': 'Again, 500 employees and 40 locations for four full service restaurants. The way the reason why we focused on these larger employers is because larger businesses have the H.R., the human resources support capable of implementing this legislation. And we also know that the greatest number of hourly, low wage workers will benefit from the most by focusing on this'",
        "'speaker_4': 'particular population of workers. Another element of the bill is that it will require 14 days advance notice for schedules. It will require a written good faith effort of expected hours at the time of how to hire. It will require 10 hours, right, Tyrus?'",
        "'speaker_4': 'Between closing and opening shifts. Similarly to overtime, this can be voluntarily waived for time and a half wages for the difference between the start of the shift and the ten hour rest period. The legislation will also require predictability.'",
        "'speaker_4': 'Pay of one hour of wages. And only for non employee requested schedule additions for schedule changes that are employee initiated or the result of an employer requesting a schedule change and doing so by a mass communication. There will not be predictability pay incurred.'",
        "'speaker_4': 'Another element is that for folks who are working on working on call or who have there were their hours in voluntarily reduced, those folks will get half time pay. And then finally the the bill as proposed requires access to additional hours for existing employees before outside recruitment environment hiring and that will deal.'",
        "'speaker_4': 'In a in a large part to address the this move towards part time employment that I mentioned earlier, giving folks who are currently on the job at a workplace an opportunity to get more hours before doing outside recruitment.'",
        "'speaker_4': 'After the the bill was introduced, there are a number of of amendments made to the bill to further improve it. I want to highlight a couple of them. We have an evaluation of the ordinance that is intended to track its effectiveness over a two year period.'",
        "'speaker_4': 'And we also have an amendment thanks to Council President Harrell, that highlights the expectations that the Office of Labor Standards will provide technical assistance to business early and often to make sure that they know how to adhere to the law and that the recordkeeping requirements aren't burdensome.'",
        "'speaker_4': 'Much like paid sick and safe leave and the minimum wage, Seattle is again a national leader in workers rights. Other jurisdictions are also looking at similar policy jurisdictions like Albuquerque, New York City, Washington, Washington, D.C., and the states of California, Connecticut, Illinois, Indiana, Maine, Minnesota, New York State, Oregon and Rhode Island are considering similar types of policies'",
        "'speaker_4': '. In fact, just last week, Mayor de Blasio in New York City announced that he's supporting legislation that would prohibit fast food chains from changing employees schedules at the very last minute throughout this seven month process. Many people have worked hard to produce this legislation.'",
        "'speaker_4': 'I'd like to take a moment to thank folks who have been involved, all councilmembers and their staff, but especially Councilmember Gonzalez and her staff for Brianna Thomas for being so engaged and collaborative throughout this process. The mayor and the mayor's staff, specifically David Mendoza and Robert Feldstein, the Office of Labor Standards, including Bill and Or and Karina'",
        "'speaker_4': 'Boyle, the law department, specifically Molly Daley, Brendan Asleep. Carlton Sue and Paul Olson. Patricia Lee on our own council central staff and Alex Clardy of my staff. Susan Lambert from the University of Chicago and Lee Golden from Penn State for their academic research, the City of San Francisco and their Deputy Director of Office of Labor Standards, Seema'",
        "'speaker_4': 'Patel. Over 50 business stakeholders who participated in a very long stakeholder process. I appreciate their engagement and the worker advocates specifically working Washington who not only participated in the stakeholder process but have toiled far, but toiled long before the beginning of our deliberations to elevate the importance of the critical needs for secure scheduling practices and above all'",
        "'speaker_4': ', the workers themselves for sharing their stories with us. Thank you.'",
        "'speaker_2': 'Thank you. Comes from a herbold. You. My colleagues would like to speak to them. The legislation comes from Gonzales.'",
        "'speaker_6': 'Thank you. I am very excited to be a co-sponsor and a coconspirator, I guess in some ways on this piece of legislation that has taken many, many months to get here. And Councilmember Herbal did a very good job of laying out all of the critical components of this particular law.'",
        "'speaker_6': 'I want to spend a little bit of time sharing my perspective on it. So certainly after dozens of meetings and countless conversations with business owners, labor and workers today, city council will make the city of Seattle only the second city to respect the time of hourly workers through this secure scheduling law.'",
        "'speaker_6': 'And I want to thank working Washington. Many of you are here today, along with you of CW and other labor leaders, because you made sure that this city council and that the rest of the city heard that your time counts.'",
        "'speaker_6': 'Starting in January, Councilmember Herbold and I began the process of having conversations with so many of you and others in the community about why this issue is so important. We heard some of those stories even today, not being able to pay the rent or wondering whether you're one paycheck away from being homeless, shuffling at the last minute'",
        "'speaker_6': 'to find childcare and sleeping through college classes because of back to back shifts without time and opportunity to rest. These are all choices that should not have to be made by anyone but through our own study of Seattle's scheduling practices.'",
        "'speaker_6': 'We learned that Seattle is not immune from these burdensome scheduling practices. And what's worse, we confirmed that they fall disproportionately upon immigrants, non-English speakers and.'",
        "'speaker_4': 'Women.'",
        "'speaker_6': 'Particularly women of color. This today, this legislation, but more importantly, each of you sitting here. This is what economic security and the demand for economic security looks like. We are shifting the power to workers so that you as workers, can influence and shape your schedules.'",
        "'speaker_6': 'And that is a critical part of our promise of fulfilling the $15 minimum wage and combating income inequality in our city. It is meaningless, in my view, to have. The nation's highest minimum wage if you only get to work 5 hours next week.'",
        "'speaker_6': 'That is not income equality. It is hard to imagine how one can reasonably advance in their careers, manage family demands or graduate from college if at the same time you're planning your life one shift and one erratic paycheck in advance.'",
        "'speaker_6': 'I believe that this law strikes a balance between the desire for flexibility and the need for economic and life security for those working in the restaurant and retail service industries. I myself worked three different jobs in retail and restaurant and in the retail and restaurant service to pay for college.'",
        "'speaker_6': 'I understand what it means to struggle everyday and to make the tough decisions about whether today is going to be the day that you pay your light bill or whether today is the day that you are going to eat.'",
        "'speaker_6': 'Those are not choices that we should subject anyone in our city to. And I want to thank you all for reminding us of the importance that you play in our city and in this movement for income inequality, to make sure that we are held accountable to you in that regard.'",
        "'speaker_6': 'So I want to thank you all. This victory is your victory, and I'm going to be really excited to see this law passed today. Thank you.'",
        "'speaker_2': 'Council members want.'",
        "'speaker_1': 'Thank you, President Harrell. I also wanted to begin by thanking all the activists and organizers from working Washington, United Food and Commercial Workers, Local 21, the Martin Luther King County Labor Council, who have been the backbone of this movement for this legislation.'",
        "'speaker_1': 'Also thank councilmembers horrible and Juan Gonzalez and their staff for working on this. I wanted to especially thank Patricia Lee, who's standing there from central staff who has been working Saturdays and Sundays to make sure the legislation is up to date and actually available to the council to act on.'",
        "'speaker_1': 'And also, I thank the Office of Labor Standards and David Mendoza from the mayor's office for keeping an eagle eye out for loopholes. I particularly. I particularly thank all the courageous workers who have spoken out for basic rights.'",
        "'speaker_1': 'The labor movement in Seattle and across the country is growing and fighting back after what have been decades of retreat, defeat and decline. In the 1980s, when many people in this room were not even born, Ronald Reagan broke the air traffic controllers union, and he was only able to do that because at that time, the other major'",
        "'speaker_1': 'unions in this country could not find the courage to defy the Taft-Hartley Act and join in solidarity with their struggle. And for decades after that, the labor movement and consequently workers all across America have continued to lose. Workers wages have stagnated and declined.'",
        "'speaker_1': 'Workplace conditions have deteriorated dramatically, especially for women, people of color and immigrants. The wealth inequality has skyrocketed. Until we now have this absurd situation in the world that 62 richest people own as much as half of the world that is the poorest 3.5 billion combined.'",
        "'speaker_1': 'But now the labor movement and workers are building again, joining together in solidarity. And we are winning. We won 15 sick and save time and we are winning tenants rights as well. And we are going to win secure scheduling in Seattle today.'",
        "'speaker_1': 'And I agree with Sage Patrick that a worker in Washington who said that what happens in Seattle does not stay in Seattle. So we know that just like 15, this victory is going to be contagious in America. The full force of this movement also had the power to defeat every loophole that big business tried to sneak through'",
        "'speaker_1': 'at the last committee meeting. Each victory of the workers movement builds the confidence of workers in other cities and to fight for their rights. Activists in Mexico City are now fighting for 15. It is not an accident that workers have to build a movement and a political struggle for decent wages, decent schedules and humane workplace conditions.'",
        "'speaker_1': 'All these all this backlash against workers is intrinsic to the laws of capitalism. Under capitalism, money is power, and the private profits of multibillionaires are invested into buying out or undercutting their competitors. And whatever big business is the most exploitative to workers.'",
        "'speaker_1': 'And the environment is rewarded under capitalism with the greatest profit to leverage for greater power to do the same thing with even more intensity. But all this is possible only if workers we as workers let them do it, because without our brain and muscle, they cannot produce, transport, do or sell anything because workers do all the work'",
        "'speaker_1': '. We have all the power when we are organized in solidarity to stand up for our interests. When our workers came to council chambers not very long ago to speak out against incredibly abusive scheduling practices. They were joined by workers and representatives by from UFC W and Rosie and the Labor Council, and they have won increased wages and'",
        "'speaker_1': 'have been emboldened now to fight for real power in the workplace to defend their rights in the future. Thank you to all the activists and workers who are here today to fight for a better life for all people, all workers in Seattle.'",
        "'speaker_1': 'We also need everyone here to join in solidarity with the Black Lives Matter movement and the Housing Justice Movement to fight to redirect $160 million that the city says it can raise. Instead of using that money to build another police precinct, which many activists have correctly called a bunker.'",
        "'speaker_1': 'That money should be used to build a thousand units of affordable housing. I agree. I agree with all those activists today who have spoken on this issue and have said that while it is a significant victory, that we were able to push the mayor and many council members into this temporary block of the bunker, we need this'",
        "'speaker_1': 'block to be permanent. And what we need is for this money to be permanently allocated towards affordable housing and away from a new police precinct.'",
        "'speaker_0': 'I also. I also stand.'",
        "'speaker_1': 'In solidarity with the Black Lives Matter movement in opposing a new EU jail. Unfortunately for our movement, I was the I was the sole no vote on the EU jail when the issue came to the Council last year.'",
        "'speaker_1': 'We need to make sure that we hold all elected officials accountable on both the EU jail and the police precinct issue, because as we recall, the Department of Justice said there is a change of culture that is needed in the police department, not a change in building.'",
        "'speaker_1': 'So I urge you all to join me at the rally that I am organizing for this Thursday, September 22nd, at 6 p.m. at Washington Hall, which is on the corner of 14th and Gessler. Let's make sure we block the bunker permanently and allocate all that money for affordable housing from 15 to tenants.'",
        "'speaker_1': 'Right. To secure scheduling to block the bunker. Regular working people, especially young people in Seattle, are showing the power of movements and proving that when we have the courage to fight, we can win.'",
        "'speaker_2': 'Thank you. Thank you. Councilmember Swamp. Councilmember Johnson.'",
        "'speaker_5': 'Thank you. Council President. I just want to say a couple of quick things. As a former restaurant worker myself, I've spent a lot of time working with single moms, juggling work and childcare because of a lack of notice of scheduling.'",
        "'speaker_5': 'And throughout the legislative process, led by council members Herbold and Gonzales, I heard a lot from a lot of different folks. Brewster's waiting up until late on a Saturday night, not knowing whether or not they'd be working at 4:00 the next morning to open the coffee shop.'",
        "'speaker_5': 'Workers have been offered part time jobs with promises of hours, only to see more part time workers hired to compete for those same hours. And I've also heard a lot from workers who enjoy their flexibility, getting hours to allow them to go to school or have additional jobs, to be able to trade, shift their employees and pick'",
        "'speaker_5': 'up additional hours and earn additional tips as necessary. And I think through careful and thoughtful legislation and amendments, I believe that the Council's carefully navigated that balance of predictability and security and scheduling and the flexibility to earn the money that you need and work when you see fit.'",
        "'speaker_5': 'I also just generally want to say that the cities conversation around this topic is not divorced from our overall conversation about how the city is growing and changing. It's growing fast. We're one of the fastest growing cities in the country and the economy is changing along with it.'",
        "'speaker_5': 'And when we talk about growth and development and secure scheduling, we're also talking about housing affordability and reliable transit and income inequality and what it means to really work and live in the city. And so I'm proud to be able to vote in support of the secure scheduling legislation and look forward to further discussions about how we'",
        "'speaker_5': 'continue to make the city an affordable place for everybody. Thanks.'",
        "'speaker_2': 'Thank you, Councilman Johnson. Unless any of my other colleagues want to say any closing words. I think we heard some inspirational speeches among our colleagues. And so when we quit while our head and I asked the clerk to please call the roll on the passage of the bill Johnson II.'",
        "'speaker_6': 'Whereas I.'",
        "'speaker_3': 'O'Brien High Sergeant I Bagshaw Burgess.'",
        "'speaker_9': 'High.'",
        "'speaker_8': 'Gonzalez.'",
        "'speaker_6': 'I.'",
        "'speaker_8': 'Herbold Heck yeah.'",
        "'speaker_3': 'President Hero. High nine in favor and unopposed.'",
        "'speaker_2': 'I. Thank you. The bill passed. The chair will gladly sign it. Thank you again for celebrating with us. Please call the next agenda item into the record.'"
    ],
    "Net Wholesale Revenue Targets for City Light Department.": [
        "'speaker_6': 'The report of the Energy and Environment Committee Agenda Item to cancel 118801 relating to the satellite department and many subsection 21.40 9.0. 86.80 of this item is the code to create net wholesale revenue targets for 2017 and 2018, consistent with those assumed in the city like 2017 through 2022.'",
        "'speaker_6': 'Strategic Plan adopted by Resolution 31678. The committee recommends the bill pass.'",
        "'speaker_2': 'Thank you very much. Council members to watch.'",
        "'speaker_1': 'Thank you. Both know this is a routine ordinance that approved Seattle City Lights net wholesale revenue targets. Satellite produces more energy than its customer base uses and sells the excess on the open market. Does that target for the revenue produced in this way in order to plan for it in the budget and this ordinance in this ordinance'",
        "'speaker_1': ', Seattle City Lights set a target for a $60 million a year in net wholesale revenue for both 2017 and 2018, which happens to be the same as the target previously set for 2016. The Energy and Environment Committee recommended council passed this bill.'",
        "'speaker_2': 'Thank you, Councilmember Swan. Are there any comments or questions saying none? Please call the role on the passage of the Bill Johnson.'",
        "'speaker_3': 'Whereas I. O'Brien I saw what I. Bagshaw I just. Hi. Gonzales. Herbold. Hi. President. Hi. Nine in favor and unopposed.'"
    ],
    "Rezone Application for Brooklyn 50 LLC Project.": [
        "'speaker_2': 'Bill passed and chair was Senate. Please read the report of the planning land use and Zoning Committee.'",
        "'speaker_6': 'The Report of the Planning, Planning and Zoning Committee Agenda Item 3:00 File 314 324 Application of Brooklyn 50 LLC to rezone approximately 5000 square feet of land located at 50 zero one Brooklyn Avenue, north from low rise three multifamily residential to neighborhood commercial three with a 65 foot height limit for construction of a seven story building containing'",
        "'speaker_6': '60 residential units and 1500 square feet of retail space. At ground level, the committee recommends the application be granted as conditioned.'",
        "'speaker_2': 'Thank you very much, Councilmember Johnson.'",
        "'speaker_5': 'Thank you. Council President. This item in front of us relates to the clerk file, which would grant the petition of Brooklyn 50 LLC for a contract reason. As the clerk outlined the current zoning in this neighborhood as low rise three multifamily residential.'",
        "'speaker_5': 'This contract rezone would change it to a neighborhood commercial three with a 65 foot high limit to facilitate the development of. As our clerk said, 60 small efficiency residential units and 1500 square feet of ground floor retail space.'",
        "'speaker_5': 'As you can find in the record, the project was redesigned to preserve the existing exceptional tree located on the northeast portion of the property, and the committee recommends the petition be granted and this clerk file would approve the findings, conclusions and decision.'",
        "'speaker_5': 'I'd move adoption of court file 314324.'",
        "'speaker_2': 'Thank you very much, Councilwoman Johnson. Any comments or questions on this clerk file? CNN. Those in favor of granting the application as conditioned. Please vote I by those opposed, vote no. The motion carries the application is granted as conditions and the Chair will assign the findings, conclusions and the decision of the Council.'"
    ],
    "Rezone Property at 5001 Brooklyn Ave NE and Accept Property Use and Development Agreement.": [
        "'speaker_2': 'Please read the next agenda item into the record.'",
        "'speaker_6': 'Agenda item for accountable 118 784 Relating to lending since only amending Chapter 23.32 ceremonies occurred at Page 60 of the official land use map tourism property located at 50 zero one Brooklyn Avenue, northeast from low rise three to neighborhood commercial three, dash 65 and accepting property is in development agreement is conditioned of rezoning approval committee recommends the'",
        "'speaker_6': 'bill passed.'",
        "'speaker_2': 'Katherine Johnson.'",
        "'speaker_5': 'This directly relates to the agenda item preceding it. So this action would amend the official land use map and accept the property use and development agreement that requires the applicant to adhere to the conditions as stated by the hearings.'",
        "'speaker_5': 'Examiner The committee recommended passage and I would move countable 118784.'",
        "'speaker_2': 'Are there any questions or comments?'",
        "'speaker_6': 'Second.'",
        "'speaker_2': 'I'm sorry. We have a. We have a substitute.'",
        "'speaker_5': 'Oh, I apologize. I moved to amend the Council Bill 118784 excepted by substituting the executed properties and development agreement for the non executed version. I apologize for that to our clerk.'",
        "'speaker_2': 'Is there a second? It's been moved in seconds to substitute the version stated by Councilmember Johnson. All those in favor of the substitution say i, i, i. Those opposed. Guys have we have a substitute bill. And so now I'd like you to call a rule on the passage of the substituted Bill Johnson.'",
        "'speaker_3': 'All right. Whereas I. O'Brien. Sergeant Bagshaw. Burgess. Gonzalez. I Herbold. President Harrell. Nine in favor and unopposed.'",
        "'speaker_2': 'Thank you. The bill passed and Cheryl signed it. Please read the next agenda item into the record.'"
    ],
    "Rezone Application for 2220 E. Union St. by Jodi Patterson-OHare.": [
        "'speaker_6': 'Agenda item four Constable 118 784 Relating to land use and zoning in many. Chapter 23.32 items for code at page 60. Excuse me. Ten, ten, five. Clerk File 3143 12. Application of Jody Patterson O'Hare Theresa Land at 2220 East Union Street.'",
        "'speaker_6': 'From neighborhood commercial two with a 40 foot height limit to her neighborhood commercial two with a 65 foot height limit for future construction of a 144 unit apartment with ground floor retail and below grade parking committee recommends the application be granted as conditioned.'",
        "'speaker_2': 'Thank you very much, Councilmember Johnson.'",
        "'speaker_5': 'Again, another contract result in front of us. This clerk file changes the height limit from 40 foot high limits to a 65 foot high limit to construct 144 unit apartments with ground floor retail. The Design Commission recommended changes.'",
        "'speaker_5': 'I'm sorry, the design review board recommended changes that have been made to respond to the neighboring property, and the applicant would actually also make payments under a mandatory housing affordability commercial program for the retail floor area, as well as provide for units of affordable housing, which is going to be great.'",
        "'speaker_5': 'The committee recommended the petition be granted and recommended the approval of the findings, conclusions and Decisions document in front of us right now.'",
        "'speaker_2': 'Thank you very much. Concerned Johnson, are there any questions on this piece of legislation? So those in favor of granting the application as condition please vote i.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Those oppose vote no. The motion carries the application application is granted as condition and the chair will sign the findings, conclusions and the decision of the Council. Please read the next agenda item into the record.'",
        "'speaker_6': 'Agenda Item six Council Bill 118 785 Relating to land use and zoning in many Charter 23.32 Code Page 112 of the official land use map trees and property located at 2220 East Union Street for neighborhood commercial to dash 42 Neighborhood Commercial to dash 65 and from neighborhood commercial judiciary with the pedestrian designation to neighborhood commercial to dash'"
    ]
}