{
    "City Light Department Strategic Plan Update and Rate Path.": [
        "'speaker_2': 'A report of the Economic Development, Technology and City Write Committee Agenda Item one. Resolution 32056. A resolution related to the city write department adopting in 2023 through 2028 strategic plan update for the satellite department and endorsing the associated six year rate path.'",
        "'speaker_2': 'The committee recommends the council bill be passed.'",
        "'speaker_0': 'Thank you. Thank you, Madam Clerk. Councilmember Nelson, the floor is yours. COSAT Nelson.'",
        "'speaker_2': 'One moment.'",
        "'speaker_0': 'Please. Okay. Item number one.'",
        "'speaker_2': 'So if you can hear me first, I'd like to give some background. Resolution 32056 would adopt the City Lights 2023 to 2028 strategic plan and endorsed the associated rate path. But by background, I went to explain that the disruption of the pandemic in 2020 interrupted the expected update of City Lights Strategic Plan in rate path.'",
        "'speaker_2': 'In recognition of the economics due to the COVID 19 pandemic. The executive did not transmit and council did not take up rate setting legislation during 2020. In 2021, Council approved rates for 2021 and 2022, and they were effective in April of 2021.'",
        "'speaker_2': 'So in differing from regular practice, City Light proposed in council adopted a five year, not a six year strategic plan for 2022 to 2026. So now in 2022, City Light has proposed a 2023 to 2028 strategic plan starting there, the the normal two year cycle of planning and rate path determination and rate change adoption and because only'",
        "'speaker_2': 'one year has passed since the adoption of the previous plan. City Light characterizes the 2023 to 2028 plan as an update rather than a wholly new plan. So what we have before us has been approved by the review panel and unanimously passed out of committee last Wednesday.'",
        "'speaker_0': 'HSA and Wilson. Are there any comments or questions regarding this or Councilmember Nelson? Casper Peterson.'",
        "'speaker_1': 'Thank you. Council president. The resolution approved last year Resolution 32007. Scheduled electricity rates to increase by 3.8% in 2023 and by another 3.8% in 2024. But City Lights resolution before us today is asking the council to increase their rates by a higher amount, 4.5% in 2023 and another 4.5% in 2024.'",
        "'speaker_1': 'I appreciate all the hard work she does. I appreciate the thoughtful rationale for the utilities proposal, consistent with my comments on substantive changes and rate increases that I have communicated to my constituents. Though I'll be voting no on today's resolution.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Peterson, is there any other comments customers want? Thank you. Guns have proven worse as I've done previous years. I will be voting yes on this legislation approving Seattle City Life Strategic Plan. It accurately analyzes what resources city will need to continue its important work.'",
        "'speaker_0': 'However, as I've said in previous years, also, I would not agree that working people who are now facing punishing inflation should be asked to pay any rate increases. Instead, Seattle should be increasing the rates on big business. For that reason, while I'm voting yes on the strategic plan, I intend to vote no on rate increase legislation as'",
        "'speaker_0': 'long as it continues to put the burden of those rate increases on working people. Thank you. If your customers want this or any other comments or concerns. All right. I have some closing comments. I was just going to do that comes from Nelson.'",
        "'speaker_0': 'So why don't you go ahead and have a closing comments before we go to a vote?'",
        "'speaker_2': 'Well, I do want to acknowledge Councilmember Peterson's historic knowledge. I really appreciate that you have that perspective coming into this year's vote. It's true. We're talking about a 0.7% increase from what was anticipated to be the 2023 rate increase to what is actually proposed in this plan.'",
        "'speaker_2': 'And I just wanted to explain a little bit about what's behind that. So City Late developed the average rate for 2023 by including inflationary costs from 2021 in 2022 that were not included in city lights, operations and maintenance budget for those years.'",
        "'speaker_2': 'And in addition to that, the the inflationary adjustment from 2022 to 2023 is a significant driver. So, you know, right now, the the inflation is anticipated is the current projection is I believe it's C 7.8. And when that last plan was adopted, the projection was 5.1.'",
        "'speaker_2': 'So that is a significant driver. And also it's noted in the report and I want to make clear that the people watching this know that City Light makes plain that the annual increases of the proposed rate path fall short of anticipated inflation in cost going forward.'",
        "'speaker_2': 'So they are absorbing some of the the higher than usual inflationary costs. And in the past two years, just for an example, some of those cost increases when it comes to city lights cause steel, aluminum and copper increased 70 to 80%, conduit 33%.'",
        "'speaker_2': 'So that those are the sorts of things that they're grappling with. And two councilmembers once point many people lost their jobs and it is but city light didn't turn off people's did not close accounts in they are currently operating under $44.7 million in arrearages.'",
        "'speaker_2': 'So I acknowledge that I acknowledge Councilmember Peterson's concern, but I, I ask for my colleagues support of this plan. I think that what's most important is really what's going on in the pocketbooks of of Seattleites and actually the city late reports that actual rates in 2023 to 2024 will be slightly lower at 11.4 cents per kilowatt hour'",
        "'speaker_2': 'compared to the anticipated 11.4 $0.09 per kilowatt hours. So actually, it's lower than anticipated, and this is because of the lower than anticipated Bonneville Power Administration pass through cost. So that cost that we all that also factors into rates is lower.'",
        "'speaker_2': 'So anyway, like I say, I ask for consideration of these issues as we as we go forward for a vote today you.'",
        "'speaker_0': 'To me also I would apologize to quickly to Councilor Nelson for closing remarks. And then I saw Councilor Maceda and Councilmember Strauss had some comments. So, Councilmember Nelson, I'm going to allow Councilmember Strauss and Councilman Rosetta to respond.'",
        "'speaker_0': 'And if you want to respond again, I will give you that opportunity. Councilor Mosqueda.'",
        "'speaker_2': 'Thank you, council president. I want to underscore some of the things that are my colleagues have also said today, echoing what Councilmember Salinas said about a more progressive rate structure. That's something that I also worked on in 2018 and 2019 after taking the helm at City Life.'",
        "'speaker_2': 'I know Councilmember Peterson has raised concerns about the impact on some of the smallest rate payers as well. And he and I had worked on utility discount program and really trying to push and move towards a more automatic enrollment for utility discount programs over the last few years.'",
        "'speaker_2': 'Much appreciated that Seattle City Life is taking some steps on the utility discount program and moving towards what I hope will be more auto enrollment. But I just wanted to bring up the longstanding desire to see a more progressive rate structure here and underscore some of the points about needing to see that in the future.'",
        "'speaker_2': 'I also think that as we look to maybe codify some of the things that have made it easier for some of our community members who've been hardest hit by COVID, one of the things that we have done is, for example, waive the design review for affordable housing.'",
        "'speaker_2': 'But what affordable housing folks have really said to us is they also want to see the utility hookups cost be waived. So I will be voting yes for this strategic plan today. But as we think about, you know, how we strategically plan to address the hardship that has been worsened by COVID, a more progressive rate structure, auto'",
        "'speaker_2': 'enrollment and utility discount programs, and making sure that we're waiving utility hookups for affordable housing would be policies that I know that there would be shared interest for on this council. With that said, I will be voting yes for this and look forward to those future conversations.'",
        "'speaker_2': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Castro Mosquito. Councilor Strauss.'",
        "'speaker_1': 'Thank you, Council President. This is. Apologies. I didn't mean to take the last word. After Councilmember.'",
        "'speaker_0': 'Nelson speaking.'",
        "'speaker_1': 'It made me think of some questions. Councilmember Nelson, can you help me remember? We did not increase city the scale. City Light did not increase their rates in 2020 and 2021.'",
        "'speaker_2': 'That is correct.'",
        "'speaker_1': 'And so I just in the two hardest years that we've seen in many in a long time, city Light did not increase rates at a time that they could have. With that understanding, wouldn't it be true that these rates are less than we could have experienced much higher rate increases?'",
        "'speaker_1': 'And when we look at if these increases have been spread out over two years, it would be much less than what we're asked to vote on today. Is that correct?'",
        "'speaker_2': 'I think that is a logical observation. And I have to say that that is partly why I gave that background. And you're just cutting to the chase much better than I did.'",
        "'speaker_1': 'Thank you. Just wanting to highlight that point. Thank you, young president.'",
        "'speaker_0': 'Okay, sir. Anyone else? Before I let Councilmember Nelson say anything in closing, in response to the last two comments we had or anything else from you. Councilmember Nelson.'",
        "'speaker_2': 'Again, I appreciate my colleagues engagement. I want to make sure that the public is aware that we are not voting to increase rates right now. That conversation will begin on August 10th in my committee and continue to the following meeting.'",
        "'speaker_2': 'We will have a possible vote on September 14th, so there is time for my colleagues to ask city late questions or our central staff can he before that as well. So right now we are we are approving a rate path based on some of these factors that I've just that I've just outlined.'",
        "'speaker_2': 'And so bottom line is that if inflation is going up faster than we thought, that's driving cost increases. We're not. Those aren't necessarily reflected in the rates that we're endorsing in this rate had we have not increased rates in the under normal schedule.'",
        "'speaker_2': 'And in fact, the decrease in the amount that we paid Bonneville Power Administration does help reduce those costs. So thank you very much for those last words.'",
        "'speaker_0': 'Thank you, Councilor Nelson. And Customer Support. And Councilor Petersen, thank you. As I know, you were former chairs of Seattle City Light in which I sat on those committees and we should note that this did pass out of committee 420 with no opposition.'",
        "'speaker_0': 'So with that, Madam Clerk, can we please call the roll? Councilmember Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilmember Morales Yes. Councilmember Mosquera I. Councilmember Nelson.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Petersen.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'Council members want. Yes. Member Strouse.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilmember Herbold? Yes. Council President Waters? Yes. We didn't favor one opposed. Thank you. The resolution is adopted and the chair will sign it. Madam Clerk, can you please affix my signature to the recently passed legislation on my behalf?'",
        "'speaker_0': 'Moving on on the agenda, item number two. Well, Madam Clerk, will you please read item two into the record? And Councilmember Strauss, the floor. Yours.'"
    ],
    "Land Use and Zoning Ordinance for Residential Development at Major Institutions.": [
        "'speaker_2': 'The Report of the Land Use Committee Council Agenda Item two Council Bill 120313 An ordinance relating to land use and zoning defining the addition of a single development that includes residential uses at a community or technical college located within an urban center.'",
        "'speaker_2': 'The committee recommends the State Council pass the bill as amended.'",
        "'speaker_1': 'Because.'",
        "'speaker_0': 'Of stress.'",
        "'speaker_1': 'Thank you, Council President, Clerk Schwinn said. Great. We also had Lincoln Farris come to speak to us before for public comment. This has been a process that has been ongoing for more than five years to allow for housing at one of Seattle's colleges.'",
        "'speaker_1': 'This allows for the minor amendment rather than a major amendment to a major institution master plan. We did receive a technical amendment in committee, as well as an amendment from Councilmember Peterson. Both were accepted unanimously. I urge and I vote and I look forward to continuing this work.'",
        "'speaker_0': 'Thank you. Councilmember Strauss, are there any comments for Councilmember Strauss before I let him do closing comments? Sir, anything from my colleagues? Before we move forward. Kessler Strauss, thank you so much. And Councilmember Petersen, as you know, we have North Steel College in District five and we've worked very closely with former president Dr. Brown and now Dr.'",
        "'speaker_0': 'Crawford. We work closely with the Chief Seattle Club and looking at housing for students, low income students, indigenous students. We've had great success working with North College for the Community and Health Board in a clinic and also with all of our labor groups in our apprenticeship programs and also working with our colleges for the not only ready'",
        "'speaker_0': 'to start, but the Promise program. Those of you that have colleges in your district, those are great resources to leverage and this is just moving it forward on the housing piece. So thank you, Councilmember Strauss very much and Casper Peterson and your committee for moving this forward.'",
        "'speaker_0': 'With that council member. Strauss, you want to close this out before we go to a vote?'",
        "'speaker_1': 'Just to say that, see, our colleges provide a unique opportunity for students here in the city to receive an education with lower amounts of debt than the larger institution and by allowing them to provide housing near regional transit.'",
        "'speaker_1': 'We're hitting three of our goals with one with one bill here. So I urge a yes vote. Thank you.'",
        "'speaker_0': 'Light rail. Two words for you. All right. Will the clerk please call the role on the passage of the bill?'",
        "'speaker_2': 'Remember Lewis?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'I remember Alice. Yes, I remember Mosquera. I remember Nelson. I don't remember Peterson. I remember Sawant. Yes. Councilmember Strauss. Yes. Councilmember Herbold. Yes. Council president was high nine in favor and unopposed. Thank you. The bill passes. The chair will sign it.'",
        "'speaker_0': 'Madam Clerk, could you please affix my signature to the bill? We'll get on to item number three. Casimir Strauss, this is you again. Madam Clerk. Will you please read item number three into the record?'"
    ],
    "Climate Change and Resiliency in the One Seattle Comprehensive Plan Update.": [
        "'speaker_2': 'Agenda Item three Resolution 32059a resolution stating the City of Seattle's intent to address climate change and improve resiliency as part of the one Seattle update to the Comprehensive Plan. The committee recommends the resolution be adopted.'",
        "'speaker_1': 'Councilmember strauss he council president. We have the major update to the comprehensive plan coming next year. The one seattle plan and this was last legislative session. The legislature failed to act on passing a bill requiring major updates to address the climate crisis before us.'",
        "'speaker_1': 'Thankfully, when the legislature doesn't act, we have the ability to, and that's what we have before us. A resolution stating our intent to address the climate crisis through our major update to the comprehensive plan bank accounts.'",
        "'speaker_0': 'President I should add that Councilor Macheda is a co-sponsor.'",
        "'speaker_1': 'Kaspersky's regional sponsor.'",
        "'speaker_0': 'Missouri.'",
        "'speaker_1': 'She wrote.'",
        "'speaker_0': 'Sorry, I this councilor Mosqueda, please.'",
        "'speaker_2': 'Well, thank you very much, Madam President, and thank you very much to Councilmember Straus. I'm really excited that we are co-sponsoring this resolution. This resolution states the city's intent to address climate change and improve resilience as a part of that major comprehensive plan that Councilmember Strauss just noted.'",
        "'speaker_2': 'And we want to make sure that at the forefront, as we consider the plan, that we think about our environment and environmental justice as a cornerstone to our work over the next few years. I think Aaron House, this was really a product of her saying we can do this in Seattle.'",
        "'speaker_2': 'Other jurisdictions have done this, providing examples to our team in the apartment to show that there is a really great opportunity for us to weigh in and support the good work that our state legislator members have considered doing.'",
        "'speaker_2': 'Again, I want to thank Representative Doer for joining us in Councilmember Strauss's Committee on Land Use and for all the work that she and the legislative team have done in Olympia, including Representative Joel Fitzgibbon and so many others on the state and the House excuse me, on the House and the Senate side who are truly fighting and'",
        "'speaker_2': 'will continue to fight for a statewide approach to require all cities and counties to address climate change through their local planning. As noted, this resolution follows up on House Bill 1099 that Councilmember Strauss noted did not make it through the state legislature.'",
        "'speaker_2': 'This is Representative Dora's legislation that is going to continue to seek to make sure that climate change is incorporated as climate planning excuse me, as as climate plans continue in cities and counties, and make sure that everyone is taking an active role in committing to climate resilient communities while reducing contributions to the climate crisis.'",
        "'speaker_2': 'There were valiant efforts by Representative Doer and others in the state legislature this last year. There was a broad based, broad coalition, broad based support from advocates across the state. And while the piece of legislation did not make it through last session.'",
        "'speaker_2': 'It really underscored there is a gap. There is a gap that this legislation was trying to fix at the statewide level to make sure that more cities and counties are truly considering climate justice as part of their comprehensive planning process.'",
        "'speaker_2': 'As we talked about in committee, this is also about making sure that we're leading with a racial justice lens as well, recognizing that it's bipoc, brown, black, indigenous communities of color who are often in either front line or fenceline communities, meaning they're living in communities or working in industries that have higher rates of exposure to toxins and'",
        "'speaker_2': 'the effects of climate injustice, such as extreme heat, wildfire, floods, and the disproportionate impact on our health as well. So as we think about the climate conference excuse me, as we think about the comprehensive plan, we should think about this as our best tool to combat the inequities that are driving climate injustice and to help use the'",
        "'speaker_2': 'comprehensive plan to drive the creation of additional housing and fight displacement. So it's really using that intersectional lens. I'm excited that this legislation will be part of our effort to not only build housing, but also as we think about what rezoning looks like, how we make sure that more people can live near the places that we call'",
        "'speaker_2': 'high opportunity zones, places that make sure that you don't have to rely on a car so you can get to work childcare, community centers, senior centers without having to have a car. And this is our tool to help make sure that fewer people are being pushed an hour or two outside of the cities, contributing to Seattle being'",
        "'speaker_2': 'the third highest mega commuter city in the entire country. So again, thank you to all of you for your possible support for this two representative doer, for all of the work that she did in Olympia to our state legislative champions who have not finished their work on this.'",
        "'speaker_2': 'We'll be back next session. And colleagues. You can tell that this will be part of our legislative agenda next year. I want to make sure that folks know that we are part of a growing list of jurisdictions that are doing this as.'",
        "'speaker_2': 'Well, trying to codify the intent of 1099 House Bill 1099 in our city and local, local statutes. We're now joining King County, Pierce County, Whatcom County, Bothell, Kirkland and Redmond in our proactive commitment to address climate change. And I want to thank the King County Council, who recently adopted a climate planning framework in their plan.'",
        "'speaker_2': 'Scoping motion and aligning this effort here today with the counties will make sure that we are in compliance with the Growth Management Act and also in compliance with, I think, our core values, which is to address climate injustice.'",
        "'speaker_2': 'Again, thanks to Aaron Lish, Yolanda, the law department, Robin Briggs and the strong coalition of community organizations that have been fighting for House Bill 1099 and are supportive of this legislation, along with Obesity and Office of Sustainability and the Environment.'",
        "'speaker_2': 'Madam President, thank you as well. I will turn it back over to you and thank you for your partnership, Councilmember Strauss.'",
        "'speaker_0': 'Thank you, Councilor Mosqueda. So with that, is there any other comments before we move to a vote for either Councilmember Strauss or Casper Moscato? I don't see any. But what I want to add is I want to thank Councilor Mosqueda and Councilmember Strauss for doing this.'",
        "'speaker_0': 'But it did pass out of committee 5 to 0 with no opposition. I want to thank everybody because we've been working on this since the Green New Deal was passed. It was not passed or the House resolution was in Congress.'",
        "'speaker_0': 'But council members so want addressed this issue in her committee Friday as we were appointing Justin Farrell as the new O.C. director, and they had their discussion regarding the Green New Deal, climate justice and the false narrative that it has to be jobs versus in the environment, that there is a false narrative, and we don't need to'",
        "'speaker_0': 'follow that narrative any more. So again, Councilmember Mosqueda has been working on this since she got elected and Councilmember Strauss is now working on this and looks like we're all on board here. So with that, Councilmember Strauss, is there anything you want to add before we move to a vote?'",
        "'speaker_1': 'Well, council president, I couldn't say it any better than Councilmember Mosquito did. I urge you to vote.'",
        "'speaker_0': 'Nobody can. So with that, Madam Clerk, will you please call the roll on the passage of the bill? Council member, Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'No resolution. Councilmember Morales. Yes. Councilmember Machado, i. Councilmember Nelson.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Peterson.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilmember Salant Yes. Councilmember Strouse.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilmember Herbold.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Council President Was I not in favor and unopposed and I misspoke. It's a resolution, not a bill without the. Well, now it's a bill. The bill passes and the chair will sign it. And will the clerk please fix my signature to the legislation on my behalf?'",
        "'speaker_0': 'So moving on to item number four, we have something other than neighborhoods education, civil rights and Culture Committee. And this will be Councilwoman Morales, but first will have the clerk read item number four to the record.'"
    ],
    "Service Animal Definition Ordinance.": [
        "'speaker_2': 'They're part of the neighborhood education, Civil Rights and Culture Committee. Agenda Item for Council Bill 120335 An ordinance relating to service animals conforming the definition of service animal to federal and state law. Establishing a uniform definition for service animal by removing similar terms and including the definition in the parks code and making technical changes to the Seattle'",
        "'speaker_2': 'Municipal Code. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Casper Ruiz. Thank you. Thank you very much, Jody. You did not have to read all the different parts of the code as Devin did in committee. Apologies again to Devin and myself. So this is pretty straightforward, colleagues.'",
        "'speaker_0': 'It is a request, actually, from the Department of Justice that we update our definition of service animal in the human rights code and in several other codes, so that we are in compliance with ADA and with Washington state law.'",
        "'speaker_0': 'It now reads so that there are full protections for all service animals rather than just guide dogs and avoids any possible future exclusions for service animals and people with disability. And again, just aligns our definition with federal and state law.'",
        "'speaker_0': 'And as Jody mentioned, we have a recommendation from the committee unanimously that we pass the bill. Thank you. So any comments or questions for Councilman Morales before we move to a vote? Somewhere else. Is there anything else you would like to say before we move forward?'",
        "'speaker_0': 'Yeah. Okay. Good. Thank you. And will the clerk please call a role on the passage of the bill?'",
        "'speaker_2': 'Councilmember Lewis.'",
        "'speaker_1': 'Yes. Morales.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Mosqueda i.'",
        "'speaker_0': 'Councilmember Nelson.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Peterson.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilmember Sawant. Yes. Remember Strauss?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Council member Herbold.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Council president was high nine in favor and unopposed. Thank you. The bill passes. The chair will sign it. And then clerk, please fix my signature to the legislation. Moving on to item number five, which is also Councilmember Ellis again will please read item five and to the record.'"
    ],
    "Historic Preservation Controls for the Original Van Asselt School.": [
        "'speaker_2': 'Agenda Item five Council Bill 120360 An Ordinance relating to Historic Preservation Imposing controls from the original Ban Assault School. The committee recommends the bill pass as memorials.'",
        "'speaker_0': 'Thank you. We've got three bills coming up here, all related to landmarking of Seattle public schools. This bill is about a school which was built in 1909. It is South Beacon Hill School. And one of the original or the original building is architecturally significant.'",
        "'speaker_0': 'It is an old school that is been the Landmarks Board has agreed to allow for an expansion of the facility. But the original piece of it will be preserved and then the expansion of the school will happen around it.'",
        "'speaker_0': 'And the committee recommends that we pass the legislation. Thank you. Casimir, also there, any questions for Casper Morales? All right, Kasman. Ross, I'm guessing you don't have any closing remarks. You're good. Okay with that? Madam Clerk, will you please call the role on the passage of the bill?'",
        "'speaker_0': 'Councilmember Lewis. Yes.'",
        "'speaker_2': 'Morales.'",
        "'speaker_0': 'Yes. Councilmember Mosqueda. I don't remember, Nelson. I can't remember Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council members want. Yes. Councilmember Strauss. Yes. Councilmember Herbold.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Council president was high nine in favor and unopposed. Thank you, Madam Clerk. The bill passes. The chair will sign it. Madam Clerk, Lisa fixed my signature to the legislation on my behalf. Moving on to agenda item number six, will you please read item number six into the record?'"
    ],
    "Historic Preservation Controls for Loyal Heights Elementary School.": [
        "'speaker_2': 'Agenda item six Council Bill 120361 An Ordinance relating to Historic Preservation, imposing controls upon the Boyle Heights Elementary School. The committee recommends the bill pass.'",
        "'speaker_0': 'Accused Mr. Morales. Thank you. This elementary school was built in 1932. It's located in the Loyal Heights neighborhood, and the Preservation Board's Controls and Agreements Agreement would indicate that it applied to the site, to the building exterior and portions of the interior, but not to maintenance and repairs that are necessary of the designated features.'",
        "'speaker_0': 'And the committee recommends that we pass the bill. Thank you. Any comments or questions for Councilmember Alice and not seeing any customer? Also, I'm guessing you're okay with moving forward on the vote. I'm okay. All right with that.'",
        "'speaker_0': 'Madam Clerk, please call the roll on the passage of the bill.'",
        "'speaker_2': 'Councilmember Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilmember Morales. Yes. Councilmember Mosquera.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Nelson.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Salant Solent. Yes. Councilmember Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilmember Herbold. Yes. Council president was high. Ran unopposed. Thank you. The bill passes. The chair will sign it metaphorically. Sticks my signature to the legislation. And we are on item number seven, which is also Councilmember Ellis again. Go ahead, Madam Clerk.'"
    ],
    "Historic Preservation Controls for Ingraham High School.": [
        "'speaker_2': 'And Item seven Councilor Bill 120362 An Ordinance relating to Historic Preservation Imposing Controls upon Ingraham High School. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. Casseroles. Thank you. So Ingram High School was built in 1959. It's located in the lake. It is one of the one of actually several school buildings built by oh, shoot, A-plus. The name of the principal who became part of LBJ, a national, nationally recognized firm that controls an incentive agreement, applies to the exterior of the'",
        "'speaker_0': 'auditorium and to the gym structure, which preserves the sort of mid-century modern look. And the committee recommends.'",
        "'speaker_1': 'That the bill pass because.'",
        "'speaker_0': 'Or else they did not know the 1959 was mid-century. That was a good last century. In 1959 was a good year. So want to point that out. A lot of good things happened in 1959. I'm sure they did with that.'",
        "'speaker_0': 'Is there any comments or questions for Councilman Morales regarding item number seven? And I'm guessing we can move forward on the vote. Cast members. Yes, please. Thank you, Madam Clerk. We please call the roll. Let's remember.'",
        "'speaker_1': 'Lewis. Yes.'",
        "'speaker_0': 'Councilmember Morales. Yes. Councilmember Mosqueda.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Nelson.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Peterson. I remember Salinas. Yes. Councilmember Strouse.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilmember Herbold.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Council President. Was I nine in favor and unopposed. Thank you, Madam Clerk. The bill passes. The chair will sign it. And, madam, quick, please, to fix my signature to the bill. Onto item number eight. This will be Councilmember Herbert.'",
        "'speaker_0': 'But first, Madam Clerk, will you please read item number eight into the record?'"
    ],
    "Ordinance on Complaint Investigation Process for Chief of Police.": [
        "'speaker_2': 'A report of the Public Safety and Human Services Committee Agenda Item eight Council Bill 120337 An Ordinance relating to civilian and community oversight of the police. Establishing a process for investigating complaints. Naming the Chief of police and adding sections to the municipal code.'",
        "'speaker_2': 'The committee recommends the bill pass as amended.'",
        "'speaker_0': 'Thank you, Kasper Herbold.'",
        "'speaker_2': 'Thank you so much. This bill addresses a technical issue from the 2017 Accountability Ordinance, which didn't address how complaints that named the chief of police should be addressed. I became aware of this issue earlier this year and immediately reached out to the mayor's office, the Inspector General and the Office of Police Accountability to chart a path forward'",
        "'speaker_2': 'to address this issue. As noted in the recitals, there were three complaints against the former chief in 2020 that linger for some time until.'",
        "'speaker_0': 'Mayor Harrell's.'",
        "'speaker_2': 'Office forwarded the complaints to an external agency for investigation. Moving forward, it's important for public trust to have a clear process to resolve these types of complaints. The legislation establishes a process for the intake, evaluation, classification and investigation of complaints that name the chief, either by a city unit or by an independent investigative body that is external'",
        "'speaker_2': 'to the city. That process would involve the Office of the Inspector General, and the legislation also requires key stakeholders in the person or people who made the complaint to be notified at investigative milestones. I'd like to thank Inspector General, Judge and interim okay Director Perkins, as well as their staffs for their assistance and time in developing this'",
        "'speaker_2': 'legislation. Central staff in my office held a number of meetings with them, and I worked through a number of complicated issues. I'd also like to thank the Community Police Commission, the Mayor's Office, for their collaboration on this legislation, as well as my own staff.'",
        "'speaker_2': 'Aldrich The Public Safety and Human Services Committee made changes to the original draft in response to a letter from the Community Police Commission to state that both intake and any investigations conducted by okay shall be conducted exclusively by civilian personnel.'",
        "'speaker_2': 'There are four civilian personnel at the OPA. Now two civilian investigators into civilian supervisors. Any non. It also requires that any non city entity conducting an investigation of a non criminal violation will not be a law enforcement agency and that any investigation of a suspected violation of law would be investigated by a non law enforcement agency.'",
        "'speaker_2': 'The committee heard this bill four times before sending it to council. It moved forward with the unanimous vote and I urge my colleagues to vote for it today. Thank you.'",
        "'speaker_0': 'Thank you. Councilor Herbold, are there any questions or concerns for Councilor Wolf Herbert regarding item number eight? I am not. Oh, I see what customers want. Thank you. Guns have been worse. I will be voting no on this legislation.'",
        "'speaker_0': 'Establishing the investigation procedures for complaints against the chief of police. This legislation is largely technical establishing timelines and notification requirements for the investigations, while maintaining the current accountability system of the OPA, OIG and the political establishment. This is a system that is completely failed to hold the Seattle Police Department accountable for their militarized response to the Black'",
        "'speaker_0': 'Lives Matter movement of 2020, with the billowing clouds of tear gas, stun grenades and pepper spray. This is a system that is designed to condone when officers kill Charlene Lyles in her own home for small children because she made the mistake of calling the police.'",
        "'speaker_0': 'What we need is an elected community oversight board with full powers to investigate complaints against the police, including the police chief. Not further reliance on the OPA, OIG and other entities that we are going to be going to accountability structures for those reasons.'",
        "'speaker_0': 'I will be voting no. Thank you. If your customers want, are there any other comments and Councilmember Mr. Verbal, is there anything you'd like to add before we close out? You could. No, thank you. All right. Thank you.'",
        "'speaker_0': 'With that, Madam Clerk, will you please call the roll on the passage of the bill?'",
        "'speaker_1': 'Councilmember Lewis?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Alice.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember mosquito by.'",
        "'speaker_0': 'For Nelson.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Peterson.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Councilmember Sawant No. Councilmember Strouse.'",
        "'speaker_1': 'Yes. Councilmember Herbold?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'President was high eight in favor when opposed. Thank you. The bill passes and the chair will sign it. And, Madam Clerk, please fix my signature to the passage of the bill. That concludes the eight committee reports that were listed on the agenda.'",
        "'speaker_0': 'And with that, moving on to the agenda, we moved two items removed from the consent calendar. There were no items removed going to Section J of the agenda, adoption of other resolutions, not seeing any other resolutions for introduction and adoption today.'"
    ]
}