{
    "Renewed Cable Television Franchise Agreement with Comcast Cable Communications.": [
        "'speaker_1': 'The bill passes and the chair will sign it. Report to the full council. Please read item number one.'",
        "'speaker_2': 'The report at the full council agenda item number one Council 118 549 relating to cable television, authorizing the mayor or the mayor's designee to enter into a renewed cable television franchise agreement with Comcast Cable Communications Management LLC, and authorizing the Chief Technology Officer to enter into other agreements for the purpose of implementing or administering the renewed franchise'",
        "'speaker_2': 'held December seven, 2015.'",
        "'speaker_1': 'Thank you, Councilmember Harrell.'",
        "'speaker_3': 'Thank you very much. So by way of background, you may recall we held this legislation to have some more discussion. This is basically an ordinance which renews the ten year franchise agreement for Comcast. And I want to go into a little bit of detail about what we're able to get from Comcast for this franchise.'",
        "'speaker_3': 'And it's important to note that this is not an exclusive franchise. We have other franchises in the city with Wave and CenturyLink as well. I do want to say right at the beginning that I thank all of you for being here on even other issues.'",
        "'speaker_3': 'It's unfortunate that we don't have enough time for everyone to speak, but your presence here, we are honored by your presence and for you fighting for what you believe in. So do you apologize? We didn't have the opportunity to to hear from all of you.'",
        "'speaker_3': 'Anyway, let's get back to Comcast. So basically and again, I don't report that everyone sort of understands this. There are certain things the city can regulate and certain things they cannot. For example, the city cannot control Comcast prices.'",
        "'speaker_3': 'And that's something that always is people are concerned about. The city cannot control Internet service that's regulated by the federal government. And so in our franchise agreement, we're looking at one part of what they provide, which is the the cable piece in this particular agreement, what we were able to basically get in terms of our goal and'",
        "'speaker_3': 'you may recall that our goal is to improve competition, have strong customer service and consumer protections. So everything we do must be designed to protect the consumer. So we updated the cable code establishing new standards for all cable providers back in March.'",
        "'speaker_3': 'There you have discussions about our cable, our customer bill of Rights and response times and what a customer's rights are. If they're not being treated fairly by Comcast or others. In this particular agreement, we're able to make sure that Seattle joined Comcast's pilot program that they have for low income seniors.'",
        "'speaker_3': 'You're eligible for the Internet Essentials discounted Internet program. And so we're able to get that very recently because we observed and I should say we it's the executive of the Department of Information Technology and the City Council observed that similar traction was was occurred had occurred in Philadelphia.'",
        "'speaker_3': 'We're able to get that here. We're able to get the previously announced digital equity grant offer to Seattle from a one time $50000 to $100000 per year for five years. That's about $500,000 in additional benefits. We will partner with Comcast at the City of Seattle to help risk risk add youth, obtain devices such as laptop computers.'",
        "'speaker_3': 'We have $8 million in public educational and governmental access channel financial support for those those public services. We have a 30% discount on basic tier, low income subscribers, and we have 600 modems to nonprofit organizations that's valued at about $10 million.'",
        "'speaker_3': 'In short, we had our Department of Information Technology go toe to toe with Comcast to get as many community benefits and consumer protections as we could. I will sort of close by saying we've had lengthy discussions about Comcast role and obligation.'",
        "'speaker_3': 'Our community and the city takes those very, very seriously. We hear daily people complaining about Comcast wanting competition, wanting lower rates. And so we have done everything possible in the last several months trying to achieve that. Last, I will say that many of the benefits that we've gotten, because they were not directly cable related, came in this'",
        "'speaker_3': 'letter agreement that I think all of you now have either talked to legal counsel or have seen the letter. And so we do have opinions that this is about as binding as it can get, given the sort of the hand that we're dealt, the hand being some of these are non cable related through theories of the legal'",
        "'speaker_3': 'theories such as promissory estoppel or equal to stop and all these fancy terms that sort of describe what Comcast must do. We are comfortable that that letter, that December 7th letter's binding. So the committee recommends passage of this legislation.'",
        "'speaker_1': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Guarded.'",
        "'speaker_0': 'By.'",
        "'speaker_2': 'Gonzalez. Harrell I Licata. O'Brien Hi. Rasmussen. So on President Burgess eight in favor and unopposed.'"
    ],
    "Unit Lot Subdivision Proposal for Othello Partners at 4204 S. Trenton Street.": [
        "'speaker_1': 'The bill passes and the chair will sign it. Please read items two and three.'",
        "'speaker_2': 'Agenda items two and three. Click 43143364. Unit Lot Subdivision application of both our partners to subdivide ten parcels into 67 unit lots at 4204 South Trenton Street and Constable 118 591 approving and confirming the plot of Greenbelt Station and the portions of Southwest one fourth of Northeast, one fourth of Section 34, township 24, North Range four, East'",
        "'speaker_2': 'W and King County, Washington. Both items introduced December 7th, 2015.'",
        "'speaker_1': 'Thank you, Councilmember O'Brien.'",
        "'speaker_0': 'No, I get back later. Okay.'",
        "'speaker_7': 'Thank you. I'm trying to pull out my talking points on this one, so give me just 2 seconds. Council President Burgess.'",
        "'speaker_1': 'All right.'",
        "'speaker_7': 'I should have been caught off guard. I know.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Well, while your styling comes from Brian Katz from Rasmussen asked me where was I doing those? And I started scrambling my paper.'",
        "'speaker_0': 'So, yeah.'",
        "'speaker_1': 'You're off the hook.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_7': 'So much fun today. So.'",
        "'speaker_0': 'Uh.'",
        "'speaker_7': 'So today's agenda, the legislation is to take the final steps in the plat of property near the Rainier Beach Light Rail Station, because this is an administrative function that is required to take place within 30 days of the council receipt of legislation.'",
        "'speaker_7': 'That is why it has been referred directly to the full council. The plat approval is basically a two step process. First, the hearing examiner holds a hearing and makes a conditional recommendation on how the property should be subdivided.'",
        "'speaker_7': 'After those conditions are met, the council passes an ordinance to make it official. This subdivision was approved in 2010 and those are now complete in their attention. The hope is that sales can begin of them by the end of this year, which is why we're on this timeline.'",
        "'speaker_7': 'So the short version is this is something that is required to come through council, although we really do not have discretion by the time it reaches us. So support both of these moving forward.'",
        "'speaker_1': 'Thank you. Questions or comments i move that the application be granted.'",
        "'speaker_3': 'So again.'",
        "'speaker_1': 'Thank you. Those in favor of the application being granted vote I. Those opposed vote no. The motion carries and the application is granted. I now move to pass item three Council Bill 118591.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_1': 'Are there any comments? Well, the clerk please call the role on the passage of the bill.'",
        "'speaker_2': 'Got it. Gonzalez Harrell. Licata O'Brian. Rasmussen.'",
        "'speaker_0': 'All right.'",
        "'speaker_2': 'So on President Burgess.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Eight in favor and then opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. We'll now consider Resolution 31640 declaring support for the Seattle School District's levies, as provided for under the revised Code of Washington. 42.17 8.5 55. The City Council will now consider the adoption of Resolution 31640.'"
    ],
    "Ordinance on Driver Representation for Taxicab, TNC, and For-Hire Vehicle Drivers.": [
        "'speaker_1': 'The resolution is unanimously adopted and the chair will sign it. The report. Thank you. Report of the Finance and Culture Committee. Please read item five.'",
        "'speaker_2': 'The Report of the Finance and Culture Committee. Agenda number five Council 118 489 relating to taxicab transportation network company and for hire vehicle drivers in many section 6.3 10.1 ten of the seven. Mr. Code adding a new section 6.3 10.7 35 to the code and authorizing the election of driver representatives.'",
        "'speaker_2': 'The committee recommends the bill passes amended.'",
        "'speaker_1': 'Thank you, Councilmember. I'll turn.'",
        "'speaker_8': 'It over. Thank you. Um, this ordinance is, I'm sure you're all aware of, relates to a taxi cab transportation network company and for hire vehicle drivers. It's actually probably historical or a history setting in what we are attempting to do here to advance the rights of drivers.'",
        "'speaker_8': 'But I am not the main sponsor. Councilmember O'Brien is and I'm going with the council bridges presence agreement will turn the floor over to customer O'Brien, who will speak and to it and describe it in greater detail.'",
        "'speaker_1': 'Thank you. Yes, please, Councilmember O'Brien.'",
        "'speaker_0': 'Okay.'",
        "'speaker_7': 'Thank you. Excuse me. Some colleagues. I would I'll speak to this briefly. And then we have two sets of amendments that I'd like to propose we walk through. I haven't heard any questions or concerns about those in the last few days, so I don't know that there's any controversy around those.'",
        "'speaker_7': 'And then we can have the final package before us and have a discussion about that would be my proposal, unless someone would rather us go a different route. I'll just briefly say in my opening that the intent behind this legislation is consistent with a lot of the things we've been doing in a city, which is to try'",
        "'speaker_7': 'to make sure we set the landscape in our city, create an environment where workers in our community have a chance to be treated fairly and have a living wage. And we're seeing a lot of innovation and a lot of changes in the workplace in recent years for a whole variety of reasons.'",
        "'speaker_7': 'And in this particular industry, in the for hire taxi and taxi industry, which is regulated in Seattle, we're seeing a lot of changes that has been very disruptive. Some folks have benefited from that disruption. We hear from a lot of folks that appreciate the new technology and how that creates new opportunities for folks.'",
        "'speaker_7': 'The intent of this legislation is frankly to create a regulatory environment where innovation can continue to happen, but not at the expense of the workers continue to happen, but to the benefit of those workers so that the companies can be successful.'",
        "'speaker_7': 'So the customers have access to the services they want, but all done in a way so that the drivers, in this case the workers, have some say in the terms of their employment and can make sure that they will continue to have access to lift their families out of poverty into these middle class jobs.'",
        "'speaker_7': 'We passed this out of committee almost two months ago, and we take the unprecedented step of taking a significant amount of time to have some of our experts at the city do a very thorough review of this legislation.'",
        "'speaker_7': 'The first set of amendments that I want to speak to is what's being recommended by our law department. And so that would be to substitute version five for version four. That is a series of amendments that our law department believes supports the intent of the legislation as originally discussed in committee, but is a more robust approach to'",
        "'speaker_7': 'that. The second set of amendments that I'll speak to in a second has also been reviewed by the Law Department and Finance Administrative Services, the division of the city that administers this part of the taxi code. These are not legal in nature.'",
        "'speaker_7': 'They're more technical in nature, but they've been reviewed by folks on both sides. And I believe that they're kind of clean up in nature. So I will go ahead and move to substitute version five for version four. That's the document that's on on the website and on our devices that can.'",
        "'speaker_1': 'It's moved in second and that we substituted version five for version four. Are there any questions or comments? All in favor of the motion. Vote I. I oppose vote no. The motion is adopted. We have version five in front of us.'",
        "'speaker_7': 'And so now I would like to move to substitute version six for version five. So this builds on what the law department has the base of the legislation before us. And this is a series of amendments, as I mentioned, that are more technical in nature, not legal in nature, but address some of the concerns about how the'",
        "'speaker_7': 'city would actually administer this. So I would move that.'",
        "'speaker_1': 'It's moved and seconded that we substitute version six for version five. This is progress. Any questions or comments?'",
        "'speaker_0': 'Councilmember Gordon Well, I'm just very, very pleased to be able to support this ordinance as an active card carrying union member myself. I want to extend that opportunity to other workers that I have been able to enjoy, and I hope that this will enable them to negotiate with their employer for wages, for good working conditions and for'",
        "'speaker_0': 'benefits. Thank you for introducing this.'",
        "'speaker_1': 'Thank you. Thank you, Councilmember Gordon. Motion before us as to substitute version six for version five. All in favor of the motion vote. I oppose vote no. The motion carries unanimously. We have version six in front of us.'",
        "'speaker_7': 'So again, I'll keep my comments just brief. We've had a lot of discussion about this. I'm open to answer any questions or thoughts. I imagine they might have a little discussion here. And then council president would like to be able to just wrap up at the conclusion of that.'",
        "'speaker_7': 'Yes. Why don't I just leave my comments at that for now.'",
        "'speaker_1': 'All right. Questions or comments? Council member Swan.'",
        "'speaker_6': 'Rasmussen was before.'",
        "'speaker_1': 'Please go ahead.'",
        "'speaker_6': 'Sisters and brothers, thank you for being here. For what I think is the spouses will be a historic step towards offering collective bargaining rights for. Otherwise precarious workers. All of those stalled my comments by echoing the comment by my sister, Marcia Boxer, when she said Uber does not share and does not care.'",
        "'speaker_6': 'I think that is absolutely correct. The sharing economy. The so-called sharing economy is nothing new. It is not innovative. Ever since sharecropping, the sharing economy has meant sharing in one direction. That is, workers have the privilege of sharing what they produce with their bosses.'",
        "'speaker_6': 'And just like in the past, these workers have to take out loans to buy a car to use for work. And then they are trapped by debt, by the sharing economy into the sharing economy. As other speakers have said, Uber drivers can be deactivated, which is a fancy word for being fired for no reason with no legal'",
        "'speaker_6': 'protection. Last week, Uber drivers in Seattle were asked to sign a new contract, agreeing that they are private contractors and not workers and not eligible for worker rights. And just like for so many other precarious workers, such as adjunct professors and I used to be one of them, the free market, the so-called free market has given big'",
        "'speaker_6': 'business total dictatorial power to set the rates and conditions in the workplace. The important point here is that this situation is a reflection of the decimation of the union movement in the past many decades. Union density in the private sector has fallen to 6.6% in 2014, from a high of 33.9%.'",
        "'speaker_6': 'And as workers have lost that organized union movement to fight for our rights. Income inequality has skyrocketed. Median income has not kept up with inflation, and more and more workers have become precariously employed. Now, a full one third of US workers identify as freelance, and most of those are not six figure salary earning consultants for Microsoft.'",
        "'speaker_6': 'Most of those workers have precarious employment with virtually no rights in the workplace. All of this can start to be reversed by rebuilding the union movement. And by doing that, we can rebuild workers, pay benefits and conditions. This bill is passed, will be one step towards that process.'",
        "'speaker_6': 'And we should note that we do have power because without people to drive, Uber could not make a penny in profits. What the council is doing today. What the council is doing today is the easy part. Any council member who votes no on this will clearly be saying that they care more about the profits of a multibillion'",
        "'speaker_6': 'dollar company than the rights of Seattle workers. One argument.'",
        "'speaker_9': 'One argument I've.'",
        "'speaker_6': 'Heard is, isn't it just easier to legislate worker workers living in working conditions? Meaning, can we just have separate legislation on pay rates and so on? Why should we? Why should the council be voting on allowing workers to have collective bargaining rights?'",
        "'speaker_6': 'Well, first of all, no. Workers themselves should have a say in negotiating their conditions. And I would like to remind my colleagues that the same council members who might be saying that workers rights can be legislated might be the same council members who voted against workers right to paid parental leave a couple of weeks ago, at which'",
        "'speaker_6': 'time they said, well, unions need to negotiate this. Well, I think one way or another, these are ways. These are excuses to deny workers their rights. And I think it's a very easy task for the council today to vote yes on this because it's straightforward.'",
        "'speaker_6': 'There is nothing complicated about it in terms of what workers will gain. The next step for drivers is far more difficult. Drivers will have to put in the long hours to actually build a union. You will have to go around talking to your coworkers.'",
        "'speaker_6': 'You will have to answer the big lies and myths that big business will continue to use to disrupt your efforts. You will continue to be risking deactivation and other intimidation tactics. But when you win, you will win a decent life for yourselves and your families, and you will be doing a huge service for other workers.'",
        "'speaker_6': 'Councilmember O'Brien for his work on bringing the legislation forward. I thank the Teamsters and other unions and the labor movement for doggedly fighting for workers rights. And I have the deepest respect for all the workers who have joined this fight, particularly the 200 Uber drivers who organized your own strike last year despite being denied any legal protections'",
        "'speaker_6': '. You have shown all workers the courage you need to fight for a better world. And especially, I want to thank you for putting forward the idea of driver unity. Many of you have placards that say Driver Unity, taxi I based and for hire drivers have to unite.'",
        "'speaker_6': 'That is the only way forward. And the union member, myself, I'm proud to vote yes on this bill.'",
        "'speaker_9': 'Member of Rasmussen.'",
        "'speaker_4': 'Thank you very much. I am not a member of the committee and so I wasn't able to participate in the vote because I was attending another meeting away from City Hall. So I approached the legislation very carefully because of the controversy, weighing the pros and cons and the risk, because the legislation is, to the best of my'",
        "'speaker_4': 'knowledge, unprecedented. And everyone expects this ordinance to be challenged in the court. But to me, that's the cost of seeking innovative policies that address issues such as income inequality and working conditions. And Seattle is often led the way in innovative policies.'",
        "'speaker_4': 'If this city council or our previous ones were to be discouraged from enacting reform legislation because of the threats of lawsuits, we wouldn't have had our early open housing laws back in the sixties. Early laws protecting the LGBT community from discrimination.'",
        "'speaker_4': 'The $15 minimum wage ordinance, local hiring, the mandatory sick leave ordinance. So this legislation is comprehensive. It's a bold approach to try to address the problem that several councilmembers have spoken about that our new economy is creating with workers who have few worker rights, who are given unilateral contracts without benefits, worker protection or minimum wages.'",
        "'speaker_4': 'So I'm happy to support this legislation, and I look forward to a positive outcome in the courts.'",
        "'speaker_1': 'It's a number of guns on.'",
        "'speaker_2': 'As many of you council members, fellow colleagues know, I'm the daughter of immigrant Mexican immigrant migrant farmworker parents. I'm also was a migrant farm worker myself. And I understand through that experience the importance of having a voice as a low wage worker when you are dealing with massive corporations and big interest who seek to make their money'",
        "'speaker_2': 'off of literally your family's back. I have always and I will continue to believe that the voice of workers is stronger when it is united and collective. Many of you in this room have been fighting that fight and have been building this movement slowly and every day, cautiously and carefully and with care for the workers that we'",
        "'speaker_2': 'as elected county elected officials are vested with the responsibility and the obligation and the moral duty to continue protecting. And I stand with each of you in that fight and in continuing to build that movement. I believe that passage of this bill will benefit all of us in the city of Seattle, not just the drivers, but all'",
        "'speaker_2': 'of us, those of us who use it, those of us who want to use it. This is good policy for our city. And I ask all of us today to ask ask ourselves the question, do we want to use the law as a shield or do we want to use it as a sword?'",
        "'speaker_2': 'I say let's use it as a sword.'",
        "'speaker_0': 'Council member, Harris.'",
        "'speaker_3': 'Well, we have some gifted speakers up on this day, a story on all ends. You know, it's absolutely my pleasure to support it. And, you know, I'm looking at the vote count. You know, this this past seven and 7 to 0, no opposition out of committee.'",
        "'speaker_3': 'And then the two names that aren't on there already said they're supporting. And so I don't think it's a big mystery as to how this may what the outcome will be this afternoon. I do want to say a few things about moving forward.'",
        "'speaker_3': 'Many of you know my story and I've understood your story. I think we had about, what, 20, 23 meetings right here looking at this whole industry. And this has been an industry that was saved and supported and built, quite frankly, by people that didn't even want these jobs, black and brown people, people from the Immigrant Refugee Committee'",
        "'speaker_3': 'and whites and others. Don't get me wrong. But these were jobs and no one were like clamoring around to. And these are unsafe jobs. And we get from that point to a point we're really trying to not only make sure the conditions and the competitive conditions for our employees are great and safe, but using this sort of'",
        "'speaker_3': 'as a catalyst for what's happening in this country, which is the labor movement, the labor movement is critical in what's happening in this country, that we do have to shift the balance of power. And so I look at this in the bigger scheme of things, of what we're trying to do in this this, this country.'",
        "'speaker_3': 'Now, I got to tell you, the work cannot stop here. And we had opposition or I should say concerns by many of my friends in the in the industry about whether their voice was heard. We have concerns from the executive.'",
        "'speaker_3': 'Valid concerns as to whether we have the resources to enforce this. We have concerns from our law department, valid concerns about whether this will be legally challenged. My attitude about that is that's the work that we've chosen to do, that none of this kind of work is is easy.'",
        "'speaker_3': 'It's hard work. And we have to, from this point on, keep plowing ahead, keep working with community, keep talking to everyone in the industry. We still have other issues in the taxi or what I call the legacy taxi industry that are completely unresolved in terms of how we issue licenses, who we listen, license licenses to, how the'",
        "'speaker_3': 'regulated industry competes with what's sort of an unregulated, unregulated industry with the the TNC. This is the beginning of something, certainly not the end. So for those who do have concerns, I don't think anyone's here today, I don't know, maybe three or four folks that have concerns.'",
        "'speaker_3': 'I just want to make impress upon you that the work is beginning now, not ending. And it's absolutely my pleasure to not only support this legislation, but to come in my colleagues for pressing through thoughtfully and committed to workers, to drivers and to the consumers out there that will now have options.'",
        "'speaker_3': 'So thank you very much. It's my honor to support this.'",
        "'speaker_1': 'Councilmember Liccardo.'",
        "'speaker_8': 'Well, this is a great example of what happens when you have good organizers in the community, Don, and the other folks from Teamsters, but also grassroots folks who recognize the need to improve their own living condition in concerts, listening.'",
        "'speaker_8': 'And in particular, I want to thank Councilmember O'Brien for really digging down and doing a lot of the hard work. Thank you. And also, as Councilmember Harrell had mentioned, the work isn't over. It's my understanding, in fact, that somehow maybe chairing a taxi committee next year.'",
        "'speaker_8': 'And so he may end up being a point person on this. So you'll be seeing more of him. I think overall, one of the things that O'Brien mentioned is important to keep in mind is that technology will continue to evolve.'",
        "'speaker_8': 'It will continue to create new challenges, but also continue to create new opportunities. And that means we have to look at our working conditions differently each time that technology changes. We have to look at the laws in force, and we have to look at how we change those laws to take advantage of the new technology, to make'",
        "'speaker_8': 'sure that there's room available for working people to exercise their rights. And that's what makes this legislation so unique. It's taking advantage and recognizing that technology has changed. We're not going to just step aside. We're going to actually work with it to improve people's lives by changing rules to allow workers an opportunity to have their needs expressed'",
        "'speaker_8': '. Now, just this morning, the mayor did send a letter out and he made two very important points. One was that he's always supported the rights of workers to organize and to create a fair and just society. And the mayor has been very strong on that.'",
        "'speaker_8': 'And also that this would be the first jurisdiction in the nation to come up with this model. And that's a very important element we should keep in mind. And because the council here is so united in supporting this legislation, I believe the mayor's two concerns that he mentioned, which is cost, which is legitimate, and also the question'",
        "'speaker_8': 'of staffing, how we deal with the question of the duties that have been placed on the council. We can deal with those because I believe the council, given that we've studied this issue and now United moving forward, will work with the mayor and the various departments to make sure that this can be accomplished.'",
        "'speaker_8': 'And that's a very important road to go down. It's important point to keep in mind because we have to continue working together to make this success a success.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember O'Brien, you can close our discussion on this.'",
        "'speaker_7': 'Thank you. I want to start by just thinking of my colleagues for on our last day of full council business and this session it's learning. I know you're relatively new, but you get to wrap this up with us.'",
        "'speaker_7': 'It's been great to work with you all on this on this piece of legislation. I think it's an example of the type of good work that we do here in the city. I also want to acknowledge some of my friends who spoke today with concerns.'",
        "'speaker_7': 'I hope you continue to believe that my intent is to make sure that the people and the drivers and the workers in our community continue to have access to good wage jobs. And even if we disagree on this one, that we'll be back working together soon and have been all along.'",
        "'speaker_7': 'I want to thank so many folks. I'm not going to name my name, but in the law department who've done a lot of really hard work over the last few months to really do the research to help with the amended legislation that's before us today.'",
        "'speaker_7': 'I also want to thank folks in finance, administrative services, specifically the folks in the division that works on taxi industry to really help us think through this work. As others said, this isn't the end, but the beginning. There's more work to do there, but I really appreciate the collaborative process.'",
        "'speaker_7': 'Finally, I want to thank so many of you from the community. Whether you're drivers on various platforms today or whether you're just here in solidarity, in support of those for showing up today and over the past number of months to make sure that we in Seattle have a system that is fair for all the people in our'",
        "'speaker_7': 'honor society. So much about growing income inequality has been so devastating to communities around this country, and we're feeling it right here in Seattle. And I think this is an example of legislation that others have said allows our economy, our community, to continue to evolve and innovate, but ensures that as we do that, we do it in'",
        "'speaker_7': 'a way that's not a race to the bottom that benefits a few, but rather we do it in a way that sustains the whole community and lifts everyone up, especially those that are at the bottom who need access to opportunities.'",
        "'speaker_7': 'I firmly believe that this legislation is a great step in that direction. I'm thrilled to be able to vote yes on this in a few moments and look forward to working collaboratively with everyone as we move to implementation of this.'",
        "'speaker_1': 'Thank you. So in just a moment, we're going to call the roll on the passage of this bill. And then I'm confident that you will want to applaud and celebrate. But once that's over, we have about 45 other items to do.'",
        "'speaker_1': 'So as you leave, if you could take your conversations out to the foyer, that would really be helpful for us. Thank you very much. I would now ask the clerk to call the roll on council bill 118499. Version six.'",
        "'speaker_2': 'Gordon I. Gonzalez, I.'",
        "'speaker_0': 'Harrell Hi.'",
        "'speaker_2': 'Lakota.'",
        "'speaker_0': 'O'Brien Hi.'",
        "'speaker_2': 'Rasmussen All right, so.'",
        "'speaker_6': 'On.'",
        "'speaker_2': 'President Burgess High eight in favor and unopposed.'",
        "'speaker_0': 'The bill.'",
        "'speaker_1': 'Passes and the chair.'",
        "'speaker_9': 'Will sign. Very well. Well, thank you.'",
        "'speaker_1': 'Thank you very much for coming down. Well, now move to the report of the Education and Governance Committee. Please read item.'"
    ],
    "City Employment Ordinance for Fourth Quarter 2015.": [
        "'speaker_2': '634 of the Education and Governance Committee. Agenda number six Council 118 593 relating to city employment, commonly referred to as the fourth quarter 2015 Employment Ordinance establishing new salaries set implement 2016 increases required by ordinance 1244 Amending Ordinance 124 927 Increasing funds designated positions as exempt from civil service status and ratifying confirming certain perks all by 3/1'",
        "'speaker_2': 'vote of the City Council. The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you. This legislation is our fourth quarter employment ordinance. This clarifies salaries for approximately six positions in city government. It also removes 11 positions from the civil service and exempts them from civil service and it ratifies and confirms prior acts.'",
        "'speaker_1': 'This is fairly routine legislation that the committee recommended passage. Any questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gordon Gonzalez Ferrell. Licata O'Brien. Hi Rasmussen. So on President Burgess Aden favor and unopposed.'",
        "'speaker_1': 'Bill passes and the chair will sign it. Please read item seven.'"
    ],
    "Adoption of General Rules and Procedures of the Seattle City Council.": [
        "'speaker_2': 'Agenda item number seven, Resolution 316 39. Adopting General Rules and Procedures of the Seattle City Council. Superseding Resolution three 149 and 315 61. The committee recommends the resolution be adopted as amended.'",
        "'speaker_1': 'Thank you. Every two years, the Council reviews its rules and procedures, and this resolution in front of us today has modifications to our rules and procedures. Some are organizational. For example, the rules affecting committee meetings have been moved to one section so that you can read all the rules about meetings at one place and don't have to'",
        "'speaker_1': 'flip around. Among the rules, there's also some stylistic changes. We've changed some phrasing for clarity, and we have made the document general gender neutral throughout. There are also some substantive revisions which have been reviewed. We clarify the President's responsibilities in acting as the Presiding Officer.'",
        "'speaker_1': 'We add language related to the President pro tem and how that assignment is made. We remove.'",
        "'speaker_4': 'The.'",
        "'speaker_1': 'Authority of the President to grant emergency absences of council members. We add language to make the introduction, referral and referral process explicit within the rules for the first time. We add language requiring that resolutions be circulated at least 2 hours before a full council meeting.'",
        "'speaker_1': 'As is the current practice with bills and amendments. We clarify that bill and resolution amendments must be circulated via email to all council members and to the city clerk. We remove language that requires council members to stand when making comments in the Parliamentary Procedures section, we clarify two subsections related to laying a matter on the table or'",
        "'speaker_1': 'holding indefinitely that that motion requires a majority of council members present, not a majority of the entire city council. We remove a sentence related to other council members. Attending meetings shall not leave without notifying the committee chair, which by the way, is practice.'",
        "'speaker_1': 'We tend to come and go from committee meetings. We remove the requirement for divided reports and replace it with a requirement that committee clerks notify council members when a committee vote has not been unanimous. This section was recommended to us from central staff and divided reports are now optional, with the request being made by any council member'",
        "'speaker_1': 'that such a report be prepared by central staff. We add more detail explaining the Budget Committee process, including the suspension of regular committee meetings, quorum requirements, and how the Budget Chair presents a proposed balancing package to council members.'",
        "'speaker_1': 'We remove language around a specific town hall committee. We clarify that the President may amend or abolish select committees by memos, just as the President may create them by memo. We add language that states that the attorney client privilege communication with the Council can only be waived by a unanimous agreement by all nine council members in executive'",
        "'speaker_1': 'session. We add language about the central staff director or her designee to the list of attendees that are allowed at executive session, which is consistent with current practice. We add language that the Presiding Officer may suspend or modify the requirement to electronically record meetings to protect the safe and responsible functioning of the Council.'",
        "'speaker_1': 'This authority to suspend or modify in extraordinary circumstances already exists for other rules around public access. And we clarify the language around the use of the Council Chamber and referring directly to the separate council policy and procedure on use of the chamber.'",
        "'speaker_1': 'So I will move adoption of resolution 31639 and thank you and we'll take comments and there are some amendments as well. And so, Councilmember Licata, let's begin with your amendments.'",
        "'speaker_8': 'Great. Thank you. There is an order of three amendments that I have, but I know there is also a technical amendment that is out there as well. So we just move that.'",
        "'speaker_1': 'We're going to make that last.'",
        "'speaker_8': 'I'll make that last. Okay. So my First Amendment is and we should all have copies in front of you. It's an underlying read has to do with the Labor Committee. And I believe I may have mentioned it this morning at the briefing meeting the Labor.'",
        "'speaker_8': 'Committee is a select committee comprised of the president, the chair of the Budget Committee and three council members selected by the President. And secondly, the primary purpose of the Labor Committee is to serve on the Labor Relations Policy Committee and perform the functions established by Inadmissible Code Section 4.0412 Show.'",
        "'speaker_8': 'This language is in conformity with the description that was just made by the Council President Burgess. It just basically codifies it our rules to make sure that we understand what's going on.'",
        "'speaker_1': 'Thank you. And I would second this amendment. Number one, are there any questions or comments?'",
        "'speaker_3': 'Councilmember Harrell Just to clarify in question, um, when I was looking at this during and sort of earlier draft, I was sort of confusing the Labor Committee with the LRP. C, so. What's the difference there in terms of what we're trying to do?'",
        "'speaker_3': 'LRP c we have five members on the labor committee. We have how many members? I'm just looking.'",
        "'speaker_1': 'Positive. So the Labor Committee is the five council members that are then the members of the Labor Relations Committee, which also includes representatives from the executive side.'",
        "'speaker_3': 'So this, in effect, changes the PC as well.'",
        "'speaker_1': 'No, no, no.'",
        "'speaker_3': 'It has no effect. It's just correct. Okay.'",
        "'speaker_1': 'Our Labor Committee, all five members are members of the LR PC, which includes other members from the executive branch. Other questions or comments. Arena. You have this halo effect over your head.'",
        "'speaker_0': 'That.'",
        "'speaker_2': 'Happens when you're in the new vein.'",
        "'speaker_1': 'That's right. Yes. All right. Let's vote on Councilmember Lakatos First Amendment on the membership of the Labor Committee. And I will say that paragraph one of this amendment is essentially the practice that we have today. So this codifies that in our rules, all in favor of amendment number one vote.'",
        "'speaker_1': 'I oppose vote no. So amendment number one is unanimously adopted. Thank you. Amendment number two.'",
        "'speaker_8': 'Amendment number two. This one. Amend subsections one. See? Seven and six b5 to attach to attachment A in resolution 31639 to establish that the Council President cannot serve as Finance Committee Chair. And by extension, this would preclude the President from acting as the Budget Committee chair.'",
        "'speaker_8': 'The change in wording would be under C president. Point seven is provided in section six B of these rules. The President will not serve as a chair of the Finance Committee and then under membership is repeated. The person will not serve as the chair of the Finance Committee.'",
        "'speaker_8': 'This, again, like the First Amendment, is a practice that we have been following for many, many years. Again, it just basically codifies it and our rules.'",
        "'speaker_1': 'No Second Amendment questions or comments. All in favor of them. And amendment number two, vote I. I oppose vote no. The amendment is unanimously adopted.'",
        "'speaker_8': 'Amendment number three, Amendment three, amend subsection six, h five and 7g5 to attachment eight, resolution 31639. To provide the option for a council member participating in a non unanimous committee recommendation to request a written divided report. And the changes are shown and read.'",
        "'speaker_8': 'And there's a section that would now be called Optional Divided Report and it again in vernacular pretty much repeats what Council President Burgess just described in going over the council rules, except that this actually again puts it in writing.'",
        "'speaker_8': 'The first line probably summarizes the past, which says if a committee recommendation is not unanimous and if requested by a council member having voted and this is either I or no a recommendation the divide report contained a different recommendation shall be made available after the committee meeting for signing by council members who voted No were I and'",
        "'speaker_8': 'wish to subscribe to the report. This again follows procedures we've been following for years. It does clarify at least three days before the scheduled presentation of the recommendation to the full council. The same report shall be made available to all council members.'",
        "'speaker_8': 'I'm not sure we've followed that strictly, but I think again, it's good to put this in here to have as much scheduling as possible. So there are no surprises or mistake in a bad timing. And the third element is reporting recommendation to the full council.'",
        "'speaker_8': 'The position signed by the majority shall be considered first. And if there's no majority position, the position of the Chair shall be considered first. Again, this is alignment with what we've done the past.'",
        "'speaker_1': 'Is there a second?'",
        "'speaker_0': 'Second?'",
        "'speaker_1': 'Any questions or comments? Councilmember Harrell, I.'",
        "'speaker_3': 'Just wanna make sure I understand it. So. Right now, our current practice and maybe the proposal could just sort of explain it to me and I'm sorry I wasn't following some of this as closely as I could have.'",
        "'speaker_3': 'If there's a split vote at a committee level right now, it's mandatory to have a divided report. And you're suggesting that it be an option. As opposed to it being mandatory?'",
        "'speaker_8': 'Well, actually. As opposed to not having it at all. Well, the language in. I'd have to have the current rules in front of me. Do not require it. I believe the old language did require it. The intent of the current language, as was preserved and passed out of committee, is the expectation that it would be optional.'",
        "'speaker_8': 'So what this does is. Go. We basically caught a firework. But I believe the intent was they came out of committee.'",
        "'speaker_3': 'So if I could just follow up, I guess I'm not sure what problem we're fixing here and that quite. If I could be so bold as to say whatever seemed to be working with respect to divided reports was working for me, because whenever there was contentiousness at the committee level, I was actually looking forward to see the'",
        "'speaker_3': 'minority opinion and the majority opinion, and I was looking forward to having a week, an extra week to make some decisions and walk the floor and talk to constituents. And that system worked. And so by changing and that year end, I'm just not sure what we accomplish.'",
        "'speaker_3': 'And I probably need to know what's going on behind it. You're saying that we're codifying something that we're doing anyway, which would lead me to believe that we don't have to change it then if we're doing it anyway.'",
        "'speaker_3': 'So if we're codifying it and something's changing, I guess I need to know what the practical effects are. I actually like to divide a report, and I like a little additional time to see where we fall.'",
        "'speaker_8': 'Well, I am actually in agreement with you under percent. Problem is, that's no longer in the proposal before in front of us. It's not there.'",
        "'speaker_1': 'So let me give you the history of this. The current council rules require if there is a committee vote that is not unanimous. The rules require central staff to prepare a divided report, and the rules also require a delay in when the council will consider the matter for at least one full week unless the council president and'",
        "'speaker_1': 'the committee chair waive that requirement. So we're not changing the timing. There will still be a delay unless the council president and the committee chair waive that requirement. Central staff came to the committee that reviewed the rules and recommended that we eliminate the mandatory central staff prepared divided report which has existed for decades because and there are'",
        "'speaker_1': 'their argument was that technology has changed. Any council member can view committees that they weren't at. Any council member can still request that a presentation of their position be developed, which they can develop on their own, or they can ask central staff to help them.'",
        "'speaker_1': 'So basically what the committee that reviewed the rules is saying is, let's get rid of this mandatory obligation that central staff prepare a divided report and leave that to council members to argue and advance their own positions how they see fit.'",
        "'speaker_1': 'Now, this particular amendment from Council member Licata I oppose because it we might refer to it as the optional mandatory divided report because while it says it's optional, any council member who requests a divided report, it requires the council members who voted differently to then prepare the divided report.'",
        "'speaker_1': 'And I think what we should do is go with what the Rule Rules Committee recommended to us, which is keep the time delay on on non-unanimous committee votes, but rely on council members to advance their own positions however they see fit.'",
        "'speaker_1': 'Whether they want to work with their colleagues or work with outside constituents, that's totally up to them. Council members, as you all know, can still ask central staff for assistance in preparing materials. So I don't think that this particular amendment is necessary.'",
        "'speaker_1': 'Any other questions or comments? And the response was.'",
        "'speaker_8': 'Well, I want to quote it in response to this, because it may be continue. I, I do not read this in the same manner that you do. The first line says the committee recommendation is not unanimous, and if so, it's conditioned, if requested by a council member having voted I or no.'",
        "'speaker_8': 'And a recommendation, a divide report contain the different regions shall be made available. So you're reading this as if someone says no, they're requiring the ice side to do a report.'",
        "'speaker_1': 'Well, reading this very same paragraph that you just read from the bottom of page two, who's going to prepare that divided report?'",
        "'speaker_8': 'Well, is actually sign on that. It could be the council member or the staff. And I actually I had talked to the staff and don't want to drag them into this, but I did not get the impression that there was a strong will condition not to do that.'",
        "'speaker_8': 'I didn't see anything in writing my discussion. It was basically a comment that they didn't need to. But when when I discussed the central staff, they said they'd be glad to. So, you know, I don't want to cast aspersions on what.'",
        "'speaker_8': 'We're we're saying central staff is saying. But I just didn't get the same response that you did. And let me just say, my intent here is pretty much as Customer Harrell's, I think it's really important to have some sort of.'",
        "'speaker_8': 'Now codify that historic record of what the positions were on the council. And I would think actually that the council members might feel more comfortable having the central staff actually write something and then having the council members sign off on it.'",
        "'speaker_8': 'But this is silent net in that fashion.'",
        "'speaker_1': 'So Councilmember look kind of good points but there is a record of course of all the positions council member takes take all of our committee meetings are recorded.'",
        "'speaker_0': 'Both.'",
        "'speaker_1': 'Audio and visually. That's all available to anyone on demand. So I think what's at central staff appeared in front of the committee on at least two occasions and made this recommendation. They made this recommendation to the committee, the staff committee that formed these recommendations.'",
        "'speaker_1': 'I don't think this recommendation originated with any council member. This came from central staff to the council, and they testified that way in front of the committee. So I think if you look at your language at the bottom of page two, it says that any council member may request a divided report, and it's clear that that has'",
        "'speaker_1': 'to be prepared by somebody. Yeah. And that's going to be council members. In this in this whatever format they wish to take.'",
        "'speaker_8': 'And that and.'",
        "'speaker_1': 'And I don't know what that accomplishes. And I also don't think this is that big of a deal. And so we probably shouldn't be spending so much time on it. We're just following the recommendations of the Rules Committee that looked at these rules, trying to streamline a bit as one central staff said in front of the committee'",
        "'speaker_1': ', we're just trying to avoid a lot of unnecessary work.'",
        "'speaker_8': 'Let me just say that. Having it digitally recorded and having it in a written report, it just makes it so much easier doing research and look it up.'",
        "'speaker_1': 'And I'm sure that council members who feel strongly about their opinions are going to write things, say things, publish things, and try to influence all of us to share their view. And that's healthy and that's good. I don't think anyone is going to find that.'",
        "'speaker_1': 'We can't figure out how you or any other council member believes or what position they take. So let's vote on amendment number three from council member. Oh, excuse me. Councilmember O'Brien.'",
        "'speaker_7': 'Yeah. So my sense is that we're not really arguing over much. Council President Burgess If I could just ask some clarity. My understanding is that without Council Member Luke Hodges amendment as is proposed, that eliminates the requirement to do a divided report where there may be situations where folks are doing work that no one really is asked'",
        "'speaker_7': 'to do, but it doesn't prohibit folks from doing it from a timeframe or from folks submitting other types of reports. They could work with central staff to produce that or do it on their own. Is that.'",
        "'speaker_1': 'Accurate? That's correct. It does not change the time delay issue that stays intact. It just it places the burden on us as individual members. If we want to have help in preparing materials, we can either do that ourselves in our own offices, or we can ask central staff to help us.'",
        "'speaker_1': 'And that's all.'",
        "'speaker_0': 'Available. Okay.'",
        "'speaker_7': 'And so I haven't had I wasn't at the committee meetings to hear it. I think what you're saying and what I think Councilmember Carter's language is trying to suggest to the same thing, I'm comfortable with it as is if that's now we have this great legislative record of what we're talking about.'",
        "'speaker_7': 'So we're going to we.'",
        "'speaker_1': 'Certainly.'",
        "'speaker_7': 'Do look to the video. Do we want to do this report? Do it. And if it turns out it's not, we can amend that.'",
        "'speaker_1': 'COUNCILMEMBER So I want.'",
        "'speaker_6': 'I also have a clarifying question if. If the. Well, first thing, I just wanted to say that in terms of facilitating democracy, I think this is a good idea to have monetary divider reports, not mandatory, but, you know, divide report as part of the record because there's just tons and tons of video and audio.'",
        "'speaker_6': 'I don't think we can expect people to wade through stuff like that. So for important things, there will be there should be a record that is easily accessible. The question I had was if if we if without Gutenberg Lakatos amendment, what does it mean for the delay that we have now?'",
        "'speaker_6': 'So if there is a if there is a lot of a stand off in a committee, and then one of those sides decides to issue a report of their own, but the other guns are there. A council member or council members decide they don't want to, or for whatever reason, they don't do it.'",
        "'speaker_6': 'Does that still give the council member who issued that their own side of the report? It's not divided per se because there's no opposing report. Does that still allow that council member to then have a delay as long as the chair and the president don't agree?'",
        "'speaker_6': 'I mean, don't don't disagree.'",
        "'speaker_1': 'Yes, it does. We're not changing the time delay issue that that's staying exactly as it is today.'",
        "'speaker_6': 'So even if one of the sides issues a report in that divided about it.'",
        "'speaker_1': 'Well, actually, actually, there doesn't have to be a divided report. If there is a divided vote in a committee, then it's an automatic delay until at least a full week unless the council president and the committee chair rule otherwise, which is happens.'",
        "'speaker_1': 'But, you know, it's fairly rare that that happens.'",
        "'speaker_8': 'May I have a closing statement on this?'",
        "'speaker_1': 'Well, Councilmember Rasmussen, I'll.'",
        "'speaker_0': 'Just say something. But no.'",
        "'speaker_4': 'I'm not going to say anything. I think it's all been said. I like the idea of divided reports. I think our sort of staff does a great job. They help us create a good legislative history. It helps us focus our comments either for or against.'",
        "'speaker_4': 'So I find them really convenient.'",
        "'speaker_1': 'Great.'",
        "'speaker_8': 'Councilmember Licata Let me just say that if I do believe we don't adopt this amendment, what we're facing is you could have literally four or five different cast members writing different opinions. We might both vote against something, but I have a good reason you do.'",
        "'speaker_8': 'This basically allows for, quite honestly, more structured approach where you've got working with the central staff, coming up with something that people sign off with, it or not, I think it makes for a better record.'",
        "'speaker_1': 'That's all. Thank you. We'll now vote on amendment number three. Those in favor of vote i, i. Those oppose vote no. No. The amendment fails. Excuse me. The amendment passes. Yes. I'm sorry. Oh, the clerk wants a vote by hand, please.'",
        "'speaker_1': 'So those in favor, please raise your hand.'",
        "'speaker_3': 'I'm a little confused. Are we voting on Councilman? The colors of. Yes.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'His amendment number three on optional divided reports. Those in favor of amendment number three, raise your hand. Those opposed. Raise your hand. So it's 4 to 4. The amendment fails. We now have the rules in front of us, which is resolution 31639.'",
        "'speaker_1': 'Are there any other comments on the resolution?'",
        "'speaker_3': 'Who understood the last amendment and the difference between.'",
        "'speaker_1': 'And for the public? Welcome to our discussions. Was not that significant. But central staff is back there celebrating right now. So we appreciate the good work they do. We'll now vote on resolution 316. No, I'm going to make another amendment.'",
        "'speaker_1': 'Sorry, this is amendment attachment number one. And it is an amendment to the general rules and procedures. Each of you have this it was passed out this morning and these are non substantive amendments. It would fill in the appropriate resolution number on the cover page of attachment number one, which is resolution number 31639.'",
        "'speaker_1': 'And it would correct the header on page 25 by deleting the word regular to correctly identify the article title, I would move this amendment second. So any discussion? All in favor of the amendment vote. I oppose vote no.'",
        "'speaker_1': 'The amendment is adopted and now we will vote on resolution 31639 as amended. All in favor. Vote I. I oppose. Vote No. The resolution is unanimously adopted and I will sign it. Please read items eight, nine and ten.'"
    ],
    "Ordinance to Update Labor Standards Compliance, Remedies, and Enforcement.": [
        "'speaker_2': 'The Report of the Public Safety, Civil Rights and Technology Committee Agenda Item 14 Kalispell 118 585 Relating to employment in Seattle amending chapters 14.16 14 point 17.18, 14.19 and 14.20. The Speaker to prescribe additional remedies and enforcement procedures, harmonized ordinance language and add provisions to facilitate compliance.'",
        "'speaker_2': 'Amending Section 3.14 point 931 of Mr. Code to update duties of the Human Rights Commission and in many section 5.50 5.2 34 code to require labor standards, compliance for business license, text or certificates. The committee recommends the bill passed as amended.'",
        "'speaker_1': 'Thank you, Councilmember Harrell.'",
        "'speaker_3': 'Thank you very much. Well, this is an exciting piece of legislation basically designed to strengthen our labor laws, to protect our workers here, to penalize bad actors and to provide clarity to business, and to assist us in our efforts to clarify for businesses their rights and responsibilities by way of context.'",
        "'speaker_3': 'You may recall that this council, under the leadership of Councilmember Sawant, O'Brien and Rasmussen, sponsored a green sheet that requested the mayor's office to prepare legislation to increase the penalties levied on employers who violated our labor laws and to increase or clarify the remedies of workers.'",
        "'speaker_3': 'And so in the executive's response through their office in the Office of Labor Standards, they engaged with stakeholders on all sides of this issue in approximately 26 meetings, community meetings, business meetings, etc.. Three of these meetings, it's my understanding, involved large groups of more than 30 businesses and community stakeholders, and five meetings involve smaller groups of stakeholders'",
        "'speaker_3': 'with a more focused interest or focused approach. So this bill that I'm asking you to support is basically 175 page bill. So it's going to take me about an hour to get through. So bear with me. That was a joke.'",
        "'speaker_3': 'I'm just going to go through some of the highlights. Any me recall we've had several committee discussions on this and I just want to touch on some highlights. Probably one of the first and most important and significant parts of this legislation is that it provides a private right of action for paid, sick and safe time.'",
        "'speaker_3': 'The minimum wage ordinance and wage theft remedies. These are legal and provides an employee legal and equitable relief without limitation up to three times of unpaid wages or compensation. It provides penalties to an aggrieved party for retaliate retaliation up to $5,000 and provides for attorney's fees and costs.'",
        "'speaker_3': 'The effective date of that private right of action is April 1st, 2016, for businesses with 50 or more employees, and April 1st, 2017 for businesses with fewer than 50 employees. And the thought there is to give some of the smaller businesses the time to not only become educated, but to acclimate.'",
        "'speaker_3': 'And we want it. We've invested resources to make sure that there's a strong education component of what we're trying to do. We've increased remedies for all workers. An example would be on paid and sick and safe time and the minimum wage and wage theft ordinance.'",
        "'speaker_3': 'Minimum Wage Ordinance first violation is discretionary up to three times of unpaid wages or compensation plus interest and the job assistance or the ordinance or the ban. The box now known as Fair Chance Employment Ordinance, the first violations manager, up to 500 to each agree each party.'",
        "'speaker_3': 'And this is where an employer unlawfully inquires and makes judgments about a person's criminal background or history. Second violations manager up to 1000 to each aggrieved party and a third violations mandatory up to 5000 each aggrieved party. In addition to what I just described, we strengthen civil penalties for employer violations paid, paid, sick, and save time in'",
        "'speaker_3': 'the minimum wage ordinance. Wage theft or first violation is discretionary. Up to 500 per aggrieved party. All the way to a third violation is up to manager up to 5000 per aggrieved party. Again, I'm looking at sort of pages of descriptions of this, but I think many of you have been briefed on this.'",
        "'speaker_3': 'You're well versed in this area. So I want to. Sure. There's one part I do want to describe, and that is the purpose in or the methodology and the process that is described in this harmonization of of of of processes is encouraged to is designed to encourage investigation, education and resolution settlements, if possible.'",
        "'speaker_3': 'But in that vein, we're also prepared to enforce aggressively giving the Office of Labor Standards discretion on making sure that we are meaningfully protecting the rights of the workers. So in that vein, I do want to thank Dylan for the Division Director of the Office of Labor Standards, David Mendoza from the Mayor's Office, Carina Ball, the senior'",
        "'speaker_3': 'policy analyst from the Office of Labor Standards, and Patricia Lee doing an incredible job on this ordinance from central staff. Again, a lot of issues in this. As I said, we also have one amendment I made at the committee table, which is a check in in about six months to whatever councilmember are overseeing the Office of Labor'",
        "'speaker_3': 'Standards to check in to hear from workers, community activists, businesses, small and large to see how this scheme of remedies are working. So we look forward to that check in in six months. The committee asked for support of this ordinance.'",
        "'speaker_1': 'Thank you. Questions or comments? Councilmember Licata.'",
        "'speaker_8': 'I believe this is probably one of the most important pieces of legislation will pass today. It's the kind of legislation that, you know, we don't have a large crowd here for it, but many more people will be affected, I believe, by this legislation.'",
        "'speaker_8': 'Then probably everything else will pass today. It really allows us to put some teeth into the legislation of passing that we have passed regarding labor standards. And without any enforcement and without any effective enforcement and without a well thought out or organized structure for this city to move forward on.'",
        "'speaker_8': 'We could pass as many bills as we want to regarding labor standards. If they're not if there's no mechanism to enforce them, then they're not going to be worth very much, not even what they were basically been written on.'",
        "'speaker_8': 'So I want to thank the council members that were mentioned by customer hell as well as customer health for seniors through.'",
        "'speaker_1': 'Councilmember Swan.'",
        "'speaker_6': 'Thank you, President Burgess. Thank you, Councilmember Harrell, for bringing this forward in your committee. As has been stated, this legislation, if but when passed, it will be very important anecdotally. Unfortunately, we don't have huge statistics, but anecdotally the message is very, very clear.'",
        "'speaker_6': 'Wage theft is rampant in Seattle. My office gets contacted by constituents regularly. That report wage theft or other violations of their law, of the labor law, of their rights. The companies that commit this crime continue to get away with it because if they're caught, they face little more consequence right now than having to pay the wages they'",
        "'speaker_6': 'should have paid in the first place. And as Gordon Brown mentioned in last year's budget council passed a statement of legislative intended. My office drafted asking the mayor's office to provide an ordinance increasing the penalties and remedies for wage theft.'",
        "'speaker_6': 'And I think that this legislation will successfully do that. Workers become eligible for three times what is stolen from them. Which will help them, those workers who may have built up debts after being underpaid their wages. And it will help also as a deterrent for unscrupulous business who may have maybe repeat offenders.'",
        "'speaker_6': 'There will eventually be a private rate of action so workers are empowered to pursue remedies for wage theft if the Office of Labor Standards is not able to. And as Councilmember Legarda correctly said, many workers, a whole host of workers in Seattle will be impacted by this law.'",
        "'speaker_6': 'But do make effective use of this improved law. Workers will still need to keep getting organized and educate each other of their rights. And moreover, we need more workers organized into unions. So in as a matter of fact, the effectiveness of a law like this of a legislation like this is enhanced by increased unionization, like the bill'",
        "'speaker_6': 'that we just passed for our bass drivers. I wanted to thank the labor movement for participating in the task force that reviewed the various proposals and fighting to make sure that it had meaningful, meaningful remedies and penalties. I'm positive that without those efforts, we would not have had the quality ordinance that we have in front of us'",
        "'speaker_6': 'today. And also, thank you to potentially and the Office of Labor Standards. And I will be voting yes on this.'",
        "'speaker_1': 'Thank you. Other comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Godden High Gonzalez I Harrell Lakota O'Brian High Rasmussen so on president purchased eight in favor nine oppose.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Please read items 15 and 16.'",
        "'speaker_2': 'Agenda Item 1516. Appointment 20 and 247. Re-appointment of Tara Henriksen as member of Seattle Fire Advisory Board for Term of Confirmation August 31st, 2018 and reappointment of James B Moran as members of Fire Code Advisory Board four Term Confirmation to October 31st, 2018.'"
    ],
    "Acceptance of Funding from Non-City Sources for Various Departments.": [
        "'speaker_2': '3234 of the Finance and Culture Committee agenda item 32 Constable 118 582 Authorizing a 2015 acceptance of funding from non city sources authorizing the heads of the Executive Department, City Budget Office, Department of Neighborhoods, Department of Parks, Recreation.'",
        "'speaker_2': 'Human Services Department, Seattle Fire Department, Taylor Police Department, Department of Information Technology and Seattle Public Utilities to accept specified grants, private funding, donations and subsidized loans, and to execute, deliver and perform corresponding agreements and run off and confirm research and projects the committee recommends as bill passes amended.'",
        "'speaker_1': 'Thank you, Councilmember Lakota.'",
        "'speaker_8': 'This is the ordinance that authorizes the 2015 acceptance of funding from non city sources in authorizing the heads of various executive departments to accept specified grants, private funding, donations and subsidized loans, and to execute, deliver and perform corresponding agreements which accompany those funds.'",
        "'speaker_1': 'Two questions or comments. Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Gordon Gonzalez Harrell. Lakota O'Brian Rasmussen. So on President Burgess High eight in favor and unopposed.'"
    ],
    "Ordinance to Amend the 2015 Budget and CIP and Create Positions.": [
        "'speaker_1': 'The bill passes and the chair will sign it. Please read item 33.'",
        "'speaker_2': 'Agenda Item 33 Constable 118 581 relating to the 2015 budget amending ordinance 124 648 which adopted the 2015 budget, including the 2015 through 2020 Capital Improvement Program, changing appropriations to various departments and budget control levels and from various funds in the budget, revising project allocations for certain project and the 2015 through 2020 copy.'",
        "'speaker_2': 'Creating both exempting nonexempt positions and write off and confirming certain prior acts all by three fourths vote of the City Council. The committee recommends the bill passes amended.'",
        "'speaker_1': 'Thank you, Councilmember Lakota.'",
        "'speaker_8': 'This ordinance relates again to the 2015 budget. This amends the ordinance 12 4648, which adopted the 2015 budget, and this one includes the 2015 2020 Capital Improvement Program, also known as the CFP. And it changes appropriations to various departments and budget control levels and from various funds in the budget and revises prior project allocations for certain projects'",
        "'speaker_8': 'in the 2015 2020 CIP.'",
        "'speaker_1': 'Thank you. Questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_2': 'In Gonzalez Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Lakota O'Brian, Rasmussen Swan.'",
        "'speaker_0': 'President Burgess.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'And Gonzalez I 18 favor not oppose.'"
    ],
    "Creation of a Title 6 Business License and Related Amendments.": [
        "'speaker_1': 'Thank you. The bill passes and the chair will sign it. Please read item 34 through the first semicolon.'",
        "'speaker_2': 'Agenda item 34 accountable 118 596 relating to the creation of a Title six business license.'",
        "'speaker_1': 'Thank you, Councilmember Licata.'",
        "'speaker_8': 'This knowledge is great. This legislation creates a new Title six business license that nearly all businesses engaging in business in the city will be required to obtain. It will be issued currently concurrently with the business license tax certificate that businesses currently obtain under the settlement civil code.'",
        "'speaker_8': 'And there will be no separate fee for the Title six license. In addition, the legislation amends the code to remove the regulatory provisions in that chapter that are not related to the tax code and then pushes the regulatory provisions in the new newly created code, which is basically the permits Title six.'",
        "'speaker_8': 'So what we've done is we've separated the regulatory functions of providing a permit, which would be Title six, from just the acknowledging of doing business in the city. That should be the Title five. This will give the city some greater authority to address any problems that may arise from businesses that are in violation of our codes or'",
        "'speaker_8': 'various laws by, if necessary, suspending the Title six, which would then create the force. The business owner no longer be in business, but the Title five, if it remains in force, will allow us to collect taxes that are due.'",
        "'speaker_1': 'Thank you. Questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Garden II. Gonzalez Pedro Licata O'Brian High Rasmussen so on president Burgess Eaton favorite and oppose.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Please read item 35.'"
    ],
    "Historic Preservation Controls for Seattle Post-Intelligencer Globe.": [
        "'speaker_1': 'Great questions or comments. Those in favor of confirming Mr. Strong vote. I oppose vote no. The confirmation is confirmed. The report of the Public Utilities and Neighborhoods Committee. Please read item number 39.'",
        "'speaker_2': 'The report The Seattle Public Utilities and Neighborhoods Committee Agenda Item 39 Council Bill 118 584 Relating to Historic Preservation, imposing controls upon the Seattle Post-Intelligencer Globe, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the code, and adding it to the table of historical landmarks contained in Chapter 25.32.'",
        "'speaker_2': 'Mr.. The Committee recommends the bill pass.'",
        "'speaker_1': 'Thank you, Councilmember Harrell.'",
        "'speaker_3': 'Thank you very much. I am filling in for Councilmember Bagshaw on this. This is a historic designation for the Seattle Post-Intelligencer. Globe I think you've been in Seattle for any period of time. You've probably seen it at least once.'",
        "'speaker_3': 'A little background on it. It was actually built in 1948 and it was originally located on the pie building at Sixth Avenue and Wall Street. And then in 1947, the newspaper held a contest for it. Well before that, the newspaper had held a contest for an emblematic sign to mark their newly completed building in a University of'",
        "'speaker_3': 'Washington art student Jack Corsage concept was selected and that was over 350 entries. And of course, his idea is to create a curved map of the world to be located above the main entrance for the flashing lights. And that would connect Seattle to other world sites with important news.'",
        "'speaker_3': 'So the Globe remained in its original position until the P-I relocated to a new facility on Elliott Avenue West in 1985. And in January of 1986, the Globe was split, split at the equator into two hemispheres and strapped to flatbeds and carefully tucked to its present location, where it sits on the roof, facing, facing out to Elliott'",
        "'speaker_3': 'Bay. So that globe is about 30 feet in diameter. It's capped by an impressive 18.5 tall neon eagle. It's wrapped by a revolving neon sign that reads It's in the P-I. It's in its entirety. The structure is estimated to weigh about 18.5 tons.'",
        "'speaker_3': 'So this landmark was nominated by councilmembers Gordon and Burgess and former council member Clarke shortly after the Post-Intelligencer transitioned to an online news resource and vacated their building on Elliott Avenue. So this historic designation will control the entire globe, but doesn't include the structural steel base or the penthouse closure and the building upon which it sits.'",
        "'speaker_3': 'We want to thank those councilmembers for that idea, and with that, the committee recommends designation and the historical designation for the Globe.'",
        "'speaker_1': 'Thank you very much. The council members at the time, who were all former journalists, council member, Guardian Council member, Clark and myself thought it would be great to preserve this landmark in our city. And I want to recognize former P-I columnist, council member Gordon.'",
        "'speaker_0': 'So very, very pleased that we're finally able to conclude this historic designation. It's something that we've been working on ever since the epic lows, since we got that final print edition of the PI that said You meant the world to me and there was a picture of the globe on it.'",
        "'speaker_0': 'It is a symbol of competitive journalism. It is a symbol of our faith in having the news reporting to us fairly and accurately. And I am very, very pleased to take my last vote virtually on this council after 12 years on this particular item.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_1': 'You're welcome. Thank you. Councilmember Rasmussen.'",
        "'speaker_4': 'Just a technicality. And I don't want to take any longer than we took to discuss the council rules. But who owns this and is not required to be attached to the building where it is now? So how does this work?'",
        "'speaker_4': 'It is it just whoever happens to own it has to save it in perpetuity. Maybe. Councilmember Gordon, do you want it?'",
        "'speaker_1': 'Councilmember Gordon does not own it now. The Museum of History and Industry does. And I think there's still negotiations for where it will ultimately occupy, but it's being allowed to stay where it is for now. All right.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Other questions.'",
        "'speaker_3': 'But just. Thanks for saving me on that.'",
        "'speaker_1': 'Yeah, you're welcome. Always happy to help.'",
        "'speaker_0': 'But question number here.'",
        "'speaker_1': 'Item 39. Please call the role on the passage of council bill 118584.'",
        "'speaker_2': 'Garden.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Gonzalez Harrell, Licata O'Brien, Rasmussen on President Burgess ii8 in favor and unopposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Please read item 40.'"
    ],
    "Wheeling Agreement Amendments with North City Water District and Olympic View Water and Sewer District.": [
        "'speaker_2': 'Agenda item number 4010. Spill 118 565. Relating to Seattle Public Utilities authorizing the director of Seattle Public Utilities to execute amendments to Wheeling agreements between the City of Seattle Inner City Water District and between the City of Seattle and Olympic View Water and Sewer District.'",
        "'speaker_2': 'Can we recommend the bill pass?'",
        "'speaker_1': 'Thank you. Councilmember Harrell.'",
        "'speaker_3': 'Thank you very much. So this legislation basically amends the water wheeling agreement that we have with the North City Water District and the Olympic view water and Sewer District. So basically SBU, the utilities department sells water wholesale to 31 municipalities or water districts in our region.'",
        "'speaker_3': 'And this legislation amends our agreement with the North City Water District and Olympic view water and Sewer District and basically provides better rate predictability for these two very important wholesale customers for their constituents. The agreement basically uses the same rate formula.'",
        "'speaker_3': 'Unless there are major changes in some kind of assistance system assets or uses that are not contemplated in the agreement. And the two utilities will also be able to give input on system projects and with costs that could affect their wheeling rate.'",
        "'speaker_3': 'So the committee recommends approval of these agreements.'",
        "'speaker_1': 'Thank you. Questions or comments? Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Got him. Gonzalez. Harrell. Licata O'Brian. Rasmussen. I want President Burgess.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Eight and favorite unopposed.'",
        "'speaker_1': 'Bill passes and the chair will sign it. Please read item 41 through the first semicolon.'"
    ],
    "Joint Project Agreement with King County for the Ship Canal Water Quality Project.": [
        "'speaker_2': 'Agenda Item 41 Constable 118 588 relating to Seattle Public Utilities Committee recommends the bill passed as amended.'",
        "'speaker_3': 'Councilmember Herald Thank you very much. So this legislation basically approves a joint project between the City of Seattle and the King County for I think many of your following the ship Canal Water Quality Project. And so basically in this capacity, the the major provisions in this joint agreement identifies who has what responsibility, who has regulatory responsibilities, what'",
        "'speaker_3': 'the deliverables are, and establishes a project schedule and costs in cost sharing agreement and ensured the cost between the county and the city are shared. 65% Seattle and 35%. King County. And the you know, the relationship and the negotiations between the county and SPU have been positive and collaborative and very consistent with our water quality goals.'",
        "'speaker_3': 'Councilmember Bagshaw amended the legislation to include a requirement that SPP, you submit twice per year a written report on the status of this project to the Council. And again, by way of context to ship canal water, water quality project is part of our compliance with the consent degree requirements and will be fully, hopefully fully completed in the'",
        "'speaker_3': 'year 2024. The committee recommends approval of these agreements, this agreement.'",
        "'speaker_1': 'Thank you. And do you have an amendment? Councilmember Harrell.'",
        "'speaker_0': 'That. Oh, shoot.'",
        "'speaker_1': 'I have it here. I'll move the amendment to Council Bill 118588 which removes the word west from the project description in section two. So Section two will now read the director of Seattle Public Utilities will prepare and submit to the Seattle Public Utilities and Neighborhoods Committee or the Appropriate Council Committee, a semiannual written progress report focusing on'",
        "'speaker_1': 'the Ship Canal Water Quality Project. Removes the word west from before ship. Is there a second? Second? Questions. All in favor of the amendment. Photo I oppose vote no. The amendment is adopted. Are there any questions or comments on the ordinance as amended?'",
        "'speaker_1': 'Please call the role on the passage of Council Bill 118588.'",
        "'speaker_2': 'Gordon Gonzalez. Harrell. I look ata O'Brien. Rasmussen.'",
        "'speaker_6': 'So on.'",
        "'speaker_2': 'President Burgess.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Aden favor unopposed.'",
        "'speaker_1': 'A bill passes and the chair will sign it. Please read items 42 and 43.'"
    ],
    "Vacation of Alley in Block 21 by Acorn Development LLC.": [
        "'speaker_1': 'Thank you. Questions or comments? Those in favor of confirming the appointments listed in agenda items 48 and 49. Vote I. I oppose Vote No. The appointments are confirmed. The report of the Transportation Committee. Please read item 53.'",
        "'speaker_2': 'Of the Transportation Committee Agenda Item 50 Quirk File 314 27 Petition of ACORN Development LLC for the vacation of the Alien BLOCK 21 Sarah April 2nd Addition to the city of Seattle, bounded by Bell Street, Seventh Avenue, Blanchard Street and Eighth Avenue, the committee recommends that the full council grant the petition as a condition to with the'",
        "'speaker_2': 'divided report with councilmembers Rasmussen Gordon back Sean Burgess in favor and Councilmember Liccardo opposed.'",
        "'speaker_1': 'Thank you. Our rules require that the majority position go first, councilmember Rasmussen.'",
        "'speaker_4': 'Thank you. This petition is seeking the vacation of a daily in the Denny Triangle. It's the fourth vacation petition to enable Amazon to build out its campus. The three previous vacations were approved by the Council upon the condition that a variety of public benefits be provided and that Amazon pay all fees and of course pay for the'",
        "'speaker_4': 'full costs of the property that they would be acquiring. This alley runs north and south through the entire block is bordered on the north by Bell Street, on the south by Blanchard Street, and on the West by Seventh Avenue, in the East by Eighth Avenue.'",
        "'speaker_4': 'The vacation would allow for the development of two buildings on the site, a 23 storey tower where the street level read. Hell on the north and an eight storey office building with retail on the south portion of the block.'",
        "'speaker_4': 'The vacation allows more flexibility of floor plate configuration. Rotation of the towers for more light and air at the street level. And a greater ability to control solar heat exposure. Better circulation for the public, including pedestrians and bicyclists.'",
        "'speaker_4': 'A pedestrian through block connection. More efficient. Underground parking. Elimination of vehicle access across seventh Avenue, which is going to be a project to protect a bike lane. And Blanchard Street, which has a green street and then a reduction of vehicle access on Bell Street into the site, which is also a green street.'",
        "'speaker_4': 'A green street. There's been an extensive public review process since the petition was filed in February. The Seattle Design Commission held three meetings in March, May and June and finally recommended by an eight zero vote in June that the issues that had been of concern had been resolved.'",
        "'speaker_4': 'And also they approved the public benefit package.'",
        "'speaker_5': 'Pardon me.'",
        "'speaker_4': 'The Downtown Design Review Board on September eight considered the petition, and the petitioner received a40 vote of approval. The project has gone through a master use permit review by DPD and there have been community meetings, including with the Dennie Triangle, Neighborhood Association, Bell Town Community Council, Housing and Land Use Subcommittee and the South Lake Union Planning and'",
        "'speaker_4': 'Policy Committee. The City Council Transportation Committee has reviewed the petition twice, including a public hearing on November 24th and public comment at that meeting as well as on December eight during the Transportation Committee review. The committee learned the following that there had been extensive review by city departments, and that review was led and coordinated by the Seattle'",
        "'speaker_4': 'Department of Transportation. The Roadway Structures and Street Improvement Permitting section of our start recommended stated no concerns and recommended approval of the proposed vacation. The Parks Department stated it has no concerns given the proposed public benefits benefits that the city would gain.'",
        "'speaker_4': 'The utility's SPU stated it had no facilities in the alley and recommended the vacation be granted and City Light and CenturyLink said that they are working with the petitioner to relocate their facilities and they have no objection. The Department of Planning and Development made two significant comments the Disney Triangle Neighborhood Plan approved by the City Council and'",
        "'speaker_4': 'key strategy number one I state said the city should simplify and create a means to expedite the early vacation process to encourage residential and commercial development. Again, this is a recommendation for this neighborhood. Secondly, DPD stated that the proposed alley vacations are intended intended to accommodate a high density commercial development, which is consistent with the zoning and'",
        "'speaker_4': 'the vision for the area in the Disney Triangle Neighborhood Plan and the Downtown Urban Center Plan. Our review and approval of vacations is based upon our vacation policies that have been adopted by the City Council by resolution over many years.'",
        "'speaker_4': 'Those policies were developed to provide clear guidance to the petitioners and to the city staff, and also to inform the public as to how we review and how we make decisions with regard to vacation petitions. They're also developed to ensure that all applicants are treated equally, consistently, objectively with fairness and predictability, to ensure that the public interest'",
        "'speaker_4': 'is served. We also identify and define within our resolutions what we mean by public interest. It includes protection of the public trust, taking into consideration the effect on circulation, access, utilities, light air, open space views, protection from land use, adverse land use impacts, and the provision of long term public benefits.'",
        "'speaker_4': 'The Department of Transportation revealed that the transportation issues, including pedestrian and bicycle impacts and determined that the vacation will not have an adverse transportation impact and will not impair the function of the adjacent streets. The department also determined that the typical functions of an alley that will be provided will be provided on site if the alley is'",
        "'speaker_4': 'vacated, including an internal loading dock, three vehicle access points, two driveways on eighth Avenue, one exit, only driveway onto Bell Street. The Design Commission also worked by the petitioner to ensure that the driveway openings are as narrow as possible, but there will be no vehicle access.'",
        "'speaker_4': 'As I said earlier, from Blanchard or Seventh Avenue to minimize the impact on the green streets of Bell and Blanchard and to eliminate vehicles crossing Seventh Avenue, which will be a separated cycle track constructed at the petitioner's expense.'",
        "'speaker_4': 'The parking proposed for the project is compliant with our land use code and accommodate slightly more cars and bikes in the vacation than without the vacation. Also, Amazon, in order to reduce the amount of traffic coming to and from the site, provides all employees with an ARC keycard and has an aggressive transportation demand management plan to encourage'",
        "'speaker_4': 'employees to walk, bike or take transit to their site. With regard to the utilities, as I said earlier, there are fewer utilities on this site than in other downtown sites. There are no SPU facilities, Seattle Public Utility Facilities.'",
        "'speaker_4': 'And again, City Light and CenturyLink are working with the petitioner to relocate their facilities and they do not object with regard to light, air, open space and views. The block will have a total of 27,000 square feet of street level, open space, pedestrian amenities and a diagonal pedestrian through block connection.'",
        "'speaker_4': 'There will be significantly more open space for the public after the vacation than without their vacation and start fires. No issues here with regard to light, air office space and views in terms of the other standard that we apply protection from adverse land use impacts.'",
        "'speaker_4': 'The vacation review determines that if the post determines whether or not the post vacation development would be consistent with land use patterns in the area, and that view is guided by our city policies and codes that apply to the site.'",
        "'speaker_4': 'This block is zoned downtown mixed commercial that's called DMS 3340 slash to 90, Dash 400, and it allows for a maximum height of 340 feet for portions of the project containing nonresidential use. This block block 21 is in a different zone than block 20, which is just to the south and the council approve of vacation there.'",
        "'speaker_4': 'That block is the downtown office core to a dock to which allows nonresidential up to 400 feet. This block, block 21 is going to be a lower, more moderate scale site for office, retail and commercial use. This zone is to be a transition site between the more intensive Dakota area and the surrounding lower scale commercial mixed use'",
        "'speaker_4': 'or residential areas. This area is in one of the city's five urban centers, and our city staff have determined that the proposed amendment with the vacation is consistent with the zoning and our city policies as an urban center.'",
        "'speaker_4': 'Our policies provide that there should be a balance between what the public gives up and what the petition acquires through the vacation process. The benefits most benefit the general public and must be separate and above any other amenities provided to meet the code or the other requirements.'",
        "'speaker_4': 'The Council has approved Ali vacations earlier by Amazon on three other blocks 14, 19 and 20, and the public benefits provided in exchange for those vacations include the seventh Avenue Cycle track shared use street and has pedestrian facilities.'",
        "'speaker_4': 'West Lake Avenue Street Improvements. Blanchard's Street ten foot setback in has right away improvements artworks. Additional overhead weather protection, the purchase of a fourth streetcar. The public benefits proposed for this vacation art will complement and expand the benefits provided by the three previous vacations approved by the Council.'",
        "'speaker_4': 'The public benefits focus on the exterior of the block rather than inward focusing, and improvements to the neighborhood are set out in your materials. There's a very long list of those public benefits, and I won't repeat all those, but the public benefits will enhance the public experience, including pedestrians and bicyclists around the entire site.'",
        "'speaker_4': 'Following all of this review by our city departments, our Department of Transportation, which again has a lead for assembling the comments and review, found that the project is consistent with our adapted our adopted street vacation policies and that similar impacts between a vacation and a no vacation development alternative for the site would occur.'",
        "'speaker_4': 'The vacation alternative provides considerable flexibility to the developer and the use of the site both above and below grade, including allowing for a single garage for services and parking for the project. And finally, the flexibility on the site also allows for the provision of open space and other public benefits.'",
        "'speaker_4': 'Following the public hearing that we held the public comments and the reviews of the record. And over the course of two meetings, the committee determined that the vacation petition and the public benefit set aside city policies and in addition, are consistent with the previous benefits that have been required by the city from Amazon and which were previously'",
        "'speaker_4': 'approved by this Council. The Transportation Committee recommends approval upon the condition that the petitioner complies with the conditions that were set out in the November 3rd letter that November three, 2015 letter to the Transportation Committee from the director of the Seattle Department of Transportation.'",
        "'speaker_1': 'Thank you. Questions or comments? Councilmember Lakota.'",
        "'speaker_8': 'Right. When you said majority prayer, I thought you were going to ask for the minority report. Yes.'",
        "'speaker_1': 'Sorry. Minority Report of one.'",
        "'speaker_8': 'Will be the last time we get something official. I guess my opposition to the legislation brought before us was based on the my concern that we are having more and more with refer to is privately owned public spaces in our downtown area.'",
        "'speaker_8': 'Generally these are conveyed through transfer development rights. In this instance, issue is through an employee vacation. But the objectives, this is the same 28,000 square feet of open space to allow the public to enjoy. The concerns were raised on how much access was denied to this area for expression of public speech and looking at what was in'",
        "'speaker_8': 'the agreement with the revocation. I notice that we did not have language that we had required in those privately owned public spaces that we acquire through a transfer development rights. So my position was that we could amend the agreement to include language that would be similar to the open conditions governing open space under TDRS, which is long'",
        "'speaker_8': 'established. It is not 2024 seven open space. There is actually time limits on it and it's in the behavior there as well as is regulated as it would be anywhere else with FEMA speech. So that was defeated in committee.'",
        "'speaker_8': 'I think this is an important issue not just necessary for this property, but for setting a standard that I believe we should be looking at for any open space that's being created primarily, I mean, particularly in a downtown area where the density is increasing.'",
        "'speaker_8': 'We now had, I think, 50,000 people living downtown. So I would move actually that in this instance we need a fuller discussion on how we can accomplish this and we might as well begin with this property. So I would like to move to we refer this to the Transportation Committee second.'",
        "'speaker_1': 'It's moved in, seconded that item 53 referred to the Transportation Committee. Is there any discussion? Sure. Councilmember Rasmussen.'",
        "'speaker_4': 'I think the point that Councilmember McCotter brought up is an important one. One thing that is important to know is that the concerns that he has with regard to public access and the rules and regulations that govern the part of the property that was granted as part of the public benefit package really is included in our property'",
        "'speaker_4': 'and use and development agreement. Last at our last City Council meeting, we approved a property and use and development agreement. We call it a powder for short that says virtually what councilmember wanted to require and this conceptual approval.'",
        "'speaker_4': 'And so we have delegated this responsibility of ensuring that the public has, in this case, the one in South Lake Union by Vulcan. It was blocked 93 that all of you approved states that the except as otherwise provided in this agreement public access shall be allowed 24 hours a day every day of the year to the following'",
        "'speaker_4': 'public benefit elements on the property. And then there is a list of the properties that qualified as the public benefit elements, and they have to be open and accessible and it has to be signed that they are open and accessible to the public.'",
        "'speaker_4': 'There is one option that the owner has or right that the owner has, and it says that the owner may adopt reasonable rules and regulations regarding use of and access to such public benefit elements as are necessary to ensure the security of the users of their public benefit elements and the development.'",
        "'speaker_4': 'So that type of concern that is that we make sure that this space that has been granted as a public benefit, that it remain open to the public, is required in the Property Use and Development Agreement, which is adopted by ordinance by the City Council.'",
        "'speaker_4': 'It does grant the owner, though, to develop reasonable rules and regulations with regard to the safety of the users of the public space. The concern that I have with regard to councilmembers motion is that we're seeking to adopt a in this condition, a condition that we have adopted for transfer of development rights, and we haven't established this'",
        "'speaker_4': 'condition when we make these decisions with regard to the conceptual approval. So I do think that we should review all of our city vacation policies next year. Another issue that is came up last during the discussion, I think it was last year with regard to the Whole Foods sites related to employer employee relations or labor standards.'",
        "'speaker_4': 'And at that time, the Council agreed that that was not part of the criteria for determining whether or not it's in the public interest to vacate a site. And we agreed that we were going to review our policies that we've adopted carefully by resolution to ensure transparency and equity and openness, that we were going to review those'",
        "'speaker_4': 'this year, and it didn't happen. I think that we need to have a comprehensive review of those policies, make a determination if we want to include this kind of policy in the consideration or labor standards as well. And then any applicant moving forward would know exactly what the rules are.'",
        "'speaker_4': 'But I don't think that we should start enacting rules now that we haven't applied before.'",
        "'speaker_1': 'Thank you. Any other comments or questions?'",
        "'speaker_6': 'Councilmember one Councilmember Rasmussen is correct that. That discussion. On what? Exactly constitutes a public benefit and the question of the evolution of that definition, which is necessary and it is something that I argued for when we were voting on the Whole Foods early vacation bill.'",
        "'speaker_6': 'It's true that that that real discussion didn't happen, which is precisely why I think this should be referred to the Transportation Committee so that the discussion can happen. This is not an alley vacation for just any company. This is Amazon.'",
        "'speaker_6': 'This is a behemoth. And I think this should be done extremely thoughtfully. And as far as public spaces are concerned. I don't think the question is about whether the public has a right to walk around there. The question is about whether or not, though, for example, the workers or the contract workers, workers that are contracted by Amazon'",
        "'speaker_6': 'for security or other purposes have the right to express their own issues as workers on the Amazon campus or not. And I think these are these issues, not just about that, but broadly on public benefit are important enough that they should be thought about, oh, you in a in a much more deliberate manner than just rushing this'",
        "'speaker_6': 'through.'",
        "'speaker_1': 'Thank you. Any other comments? Councilmember O'Brien.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'As we talk through making an alley vacation or a street vacation, what we're talking about doing is taking something that is existing in the public right away and transferring that to private ownership. And part of this process, of course, is about compensating us and making offsetting investments to make us whole.'",
        "'speaker_7': 'The the issue around free speech, I think is a really important one because folks have a pretty clear understanding of what their free speech rights are in a public right away and what they are allowed to do. They don't need to go look up a public use and development agreement to understand what's going on.'",
        "'speaker_7': 'And because we're taking that away and this process and trying to put back something similar but some access to Civic Plaza, I think it's really important that we get the specifics right. I personally as a councilmember, have been at a public plaza and been approached by private security guards saying, you know, you need to move your sign'",
        "'speaker_7': 'that can't be here while you're eating and things like that. It's probably true that that in some puta that they didn't have the right to do that. But even as a councilmember, I didn't have the capacity to go find that and confront them.'",
        "'speaker_7': 'And so I think this is an important enough decision that I support Councilmember Carter's move to refer this back to committee. Let's examine what we can do around First Amendment, including possible things around training or maybe public notice.'",
        "'speaker_7': 'So folks see clearly what they're allowed and not to do in these these kind of quasi public open spaces.'",
        "'speaker_1': 'Thank you. Any other comments? Councilmember Gonzalez.'",
        "'speaker_2': 'I want to echo sort of the the need to to be judicious as we move forward with this particular issue. As a civil rights lawyer, as somebody who has studied the Constitution, I think that these issues are quite complicated and don't want us to hastily pass some sort of provision around free speech or First Amendment as it'",
        "'speaker_2': 'relates to these street alley vacations. I'm hopeful that if we take a little bit of time and I'm not sure if Councilmember Walcott is amenable to setting a date certain on his motion to refer back to the Transportation Committee.'",
        "'speaker_2': 'But I do think it is this is a very critically important issue that requires us to be very deliberate and thoughtful around. And I hope that we give ourselves the opportunity to do that.'",
        "'speaker_1': 'Thank you. Any other comments to Councilmember Liccardo?'",
        "'speaker_8': 'To answer to answer Cotner Gonzalez's question, I would recommend to the first meeting of the Transportation Committee of next year.'",
        "'speaker_1': 'Any other comments? I'm a rapper. Yeah. I'm going to oppose the motion to refer back because of some of the reasons that my colleagues have cited. This is about due process and it's about fairness. This L.A. vacation has gone through an extensive review process exactly as city procedures and rules require.'",
        "'speaker_1': 'And it has met all of the conditions that the City of Seattle sets for this kind of L.A. vacation. And to introduce a new topic now, and I might add, a topic that is already covered in the regulations that will apply to this open space, I think is very inappropriate at the last minute.'",
        "'speaker_1': 'This came up a couple of years ago with another property in West Seattle, and some members of the council asked for a review of these things and whether or not our policy should be amended. And then they chose not to pursue that.'",
        "'speaker_1': 'However, we just, in our budget actions here last month allocated some funds. And I know that Councilmember O'Brien in his committee, beginning in January, is going to consider the issue of revisiting the Street and Ali vacation rules and regulations.'",
        "'speaker_1': 'I think that's very appropriate. But to say to an applicant who has for an extended period of time gone through the city process that we said that now we're going to stop that process and change the rules, I think is very unfair and strikes at the core of how we govern our city and how we do due'",
        "'speaker_1': 'process. So I think it's not appropriate to refer this matter back to committee. The motion before us is Councilmember Lookat is motion to refer this matter back to the transportation committee. Those in favor vote I right. Please raise your hands.'",
        "'speaker_1': 'Those opposed, vote no and raise your hands. The vote is 4 to 4 and the motion fails.'",
        "'speaker_4': 'So thank you. Council members. I think it's a very good discussion. It I do agree with Councilmember Burgess and I said this at the committee meeting, too. When we say because we don't like a business or are opposed to a certain business, we're going to change the rules for that business alone, for city policies and procedures and'",
        "'speaker_4': 'decisions. I think that's a very dangerous and slippery slope. What what entity, what person, what business is next if they're not popular with a particular council member? I think it's really dangerous and we should have fair and objective policies.'",
        "'speaker_4': 'That is why we adopted those by resolution to ensure that we're not singling out any one petitioner large or small bakery or a large corporation. And I oppose that kind of arbitrary decision making that I have heard here.'",
        "'speaker_4': 'What I would offer, though, is if council members are not comfortable with the Department of Transportation and our Department of Planning and Development setting the public access rules through the property and use and development agreement, we could consider the language that Councilmember Liccardo proposed at the committee meeting.'",
        "'speaker_4': 'It's very similar to what is included in the property use and development agreement. So I would I have copies of what he distributed to the committee. It was what the Divided report was based upon and I would move that you consider this so that we can move along.'",
        "'speaker_4': 'One of the concerns I have about holding this over to next year, so we're going to have three new council members. They have not been been the beneficiaries of the public hearing. They're going to have to start again.'",
        "'speaker_4': 'And I think that that is going to, again, undermine our whole process, object of objectivity and clarity about how we define the public interest. So if I would like to move this language to add to the clerk, file the conditional approval, and I would be happy to distribute it to all of you and I would be happy'",
        "'speaker_4': 'to read it into the record, too.'",
        "'speaker_1': 'Why don't you read it into the record? We all have it. It's part of the Divided report.'",
        "'speaker_4': 'This is the language proposed by Councilmember Liccardo. Free speech activities such as handling, signature gathering and holding signs all without obstructing access to the space, the building or other adjacent amenity features, and without unreasonably interfering with the enjoyment of the space by others shall be allowed while engaged and allowing activities in allowed activities.'",
        "'speaker_4': 'Members of the public may not be asked to leave for any reason other than conduct that unreasonably interferes with the enjoyment of the space by others. So I think this addresses the points that were raised, including asking people to leave the site.'",
        "'speaker_4': 'And so I would move this amendment to the FERC file.'",
        "'speaker_1': 'And this would become one of the conditions that the council would impose on this alley vacation. Is there a second second? It's moved in second and that we had this language as a condition for the vacation. Is there any further discussion?'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_7': 'So just to for some clarity, is this do we need to suspend the rules to introduce an amendment to a bill that hasn't been provided this late in the game?'",
        "'speaker_1': 'This was part of the divided report that was presented to all of us.'",
        "'speaker_7': 'Sure, there was there wasn't an amendment prepared that I'm aware of.'",
        "'speaker_1': 'I said, I'm sorry. I'm sorry.'",
        "'speaker_7': 'And so so.'",
        "'speaker_1': 'I'm going to ask the clerk to advise us on that issue.'",
        "'speaker_2': 'This amendment was not provided in advance, nor before the 12 new deadline for today. So it's a rule to a motion to suspend the rules as necessary.'",
        "'speaker_1': 'Okay. Thank you. I would move to suspend the rules so that this amendment can be considered. And the spirit of that is that we all knew this language. We knew the issue. It was presented to us in writing.'",
        "'speaker_1': 'And so I would move to suspend the rules. So it's moved in second and that we suspend the rules. Any comments or questions about that? Council Member O'Brien.'",
        "'speaker_7': 'Yeah, so I didn't realize that this amendment was going to be presented. I would I'm going to vote against suspending the rules. And the reason is I would actually like to look at the language in that amendment and make further amendments to it.'",
        "'speaker_7': 'But because we're talking about free speech and our policies, I'm not comfortable making those decisions on the spot up here and would prefer to have time to have legal review.'",
        "'speaker_1': 'Thank you. Any other comments? Those in favor of suspending the rules in order to consider this amendment. I'm sorry. Oh, council member. So on.'",
        "'speaker_6': 'Thank you. I just wanted to say for the record that I concur with Council member O'Brien's point about this free speech is too important. We can't just rush to this amendment.'",
        "'speaker_1': 'Thank you. Any other comments? Those in favor of suspending the rules to consider this amendment vote. I opposed vote. No.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Okay. We're going to have to do that again. And those in favor, please vote I by raising your hand. Those opposed vote no. The motion is approved. We now have the amendment before us. Are there any further comments on the amendment?'",
        "'speaker_1': 'Councilmember Rasmus Thank.'",
        "'speaker_4': 'You. These this amendment will address the scenario that Councilmember O'Brien described. It's also consistent with the kind of requirements that are in the property and use and development agreement agreements that we have approved in the past. So I believe it addresses those concerns.'",
        "'speaker_4': 'However, again, I urge my colleagues in the forthcoming years to treat all people equally regardless of who the the petitioner is and who is before this council. And I that is, I think, critically important. I encourage you, if you want to adopt new policies related to vacation petitions, you do that in open public process and you do'",
        "'speaker_4': 'it through a public hearings and you adopt the use by resolution, not based upon case by case, depending upon whether you like that person, like that business or not. That is not, I think, due process by any stretch of stretch of the imagination.'",
        "'speaker_4': 'And I think that we have a very strong public benefit package. It will significantly improve the pedestrian experience in the Denny Triangle. It's consistent, as DPD said, with the visions and the plans for the Denny Triangle, not Amazon's plans, but the city's plans for the Denny Triangle.'",
        "'speaker_4': 'And so they are meeting all of our public benefit requirements. They're paying full market value for that property, and they're going to be contributing significantly to low income housing funds and other needs that we have in the city.'",
        "'speaker_1': 'Thank you. Any other comments? Councilmember O'Brien.'",
        "'speaker_7': 'So I'm going to need a little parliamentary help here. So I would like to amend the amendment, and I don't know if we need to suspend the rules again. No. To do that. Okay.'",
        "'speaker_1': 'But hopefully your amendment is going to be easily understood. And.'",
        "'speaker_7': 'Well, what I would like to do is require that there is. Signage on the site so that the public can be aware of what their First Amendment rights are in this space. And again, because this amendment wasn't presented as an amendment before, I haven't had time to work this up so I can kind of just make things'",
        "'speaker_7': 'up on the fly. And so maybe I'll let some other folks comment. We'll all work on some language to scribble down here.'",
        "'speaker_4': 'If I may. I say I think that's a friendly amendment that's consistent with what we include, that kind of language on our property and and development agreements. And the agreement that all of us approved just on November 30th says that that a summary of the rules is posted invisible locations in the development.'",
        "'speaker_4': 'So if that we have that language and if you want to state more specifically about the ability of the public to to use the site, ensure that the public can pass through or use a public benefit regardless of whether such use by the public is associated with the development.'",
        "'speaker_4': 'There's really great language in the property use and development agreement that we passed. We could. Crafted from that, cobble it from that. But I agree with you on the notice to the public. I have already gone to developers when I've seen that these public sites are not well signed, that don't look like they are open and welcoming'",
        "'speaker_4': 'to the public and ask them to change the signage so that everyone knows that they have the right to go through that site and use it even if it's on private property.'",
        "'speaker_1': 'So our resident expert is here. Mr. Barnett, I'm wondering if I could ask you if the signage requirement is covered in the terms and in the puta and proper posting. And you're answering. Yes, it is. Okay. Thank you.'",
        "'speaker_8': 'Can we ask her to come to the microphone?'",
        "'speaker_1': 'Could you step up to the microphone, please, and introduce yourself and tell the vast audience who you are?'",
        "'speaker_2': 'Yes. I'm Beverly Barnett with Seattle Department of Transportation and I will be administering this. We do require signage on all of the public spaces, and that would be one of the standard conditions. So whatever language the council imposes today, we would work out how to have that signed on.'",
        "'speaker_2': 'The public spaces related to the Amazon project.'",
        "'speaker_1': 'Thank you. So, Councilmember O'Brien, I think your concern is already addressed. And based on the testimony of Ms.. Barnett, do you still want to make your amendment?'",
        "'speaker_7': 'Yes, because I haven't a chance to review exactly what that signage is. I would like something that explicitly states that people would have the ability, the public has the ability to demonstrate protest, leaflet and other acts of expressions of their own First Amendment rights.'",
        "'speaker_7': 'I can look at this. One thing I'll just note Councilmember Rasmussen talked about fairly and treating everyone fairly, and I agree with treating folks fairly. We wouldn't be here if folks had allowed the full extra week from the Divided report last week.'",
        "'speaker_7': 'We would have had time to address this beforehand. And so I feel like we're making some exceptions for a specific person or entity as opposed to following our normal procedures when there's a divided report coming out of committee to allow us time to work on that.'",
        "'speaker_7': 'But if someone else wants to talk, I'll read what you just handed me. Councilman Rasmussen.'",
        "'speaker_4': 'We probably will have to cobble language from that, but I think it carries out your intent. The reason for moving this through now, consistent with council rules, is we're going into an hour long recess holidays and we're going to have a new council next year.'",
        "'speaker_4': 'That's very that's extraordinary that I think in this case warrants following this rule where we can bring it before the council at this time.'",
        "'speaker_1': 'President Burgess Council Member So on.'",
        "'speaker_6': 'I, I think that it's just simply not true and not honest to say that somehow it would be unfair to Amazon if we delayed this vote to re refer it to the transportation committee. I don't know, other than Amazon executives and major shareholders who are raking the profits in at the expense of so many workers and so'",
        "'speaker_6': 'many people all over, especially in this region. I don't know of anybody who thinks that somehow Amazon is as a corporation is the same as any other human being. These are the fact that this vote is being expedited without giving it the due two weeks for the debate.'",
        "'speaker_6': 'A report itself is an example of how big business changes the rules all the time. And the reason they're able to do that is because so many elected officials are in favor of corporate interests and are not looking out for workers.'",
        "'speaker_6': 'And I wanted to add to what Councilmember O'Brien had said. You know, last year I was at a demonstration of workers on the Amazon campus. These workers are security guards, security personnel who have been who are being denied their lawful, safe and sick time as required by Seattle's labor law.'",
        "'speaker_6': 'And when the workers asked to speak to someone in charge, the Amazon representative asked them to move away from the compound and on the sidewalk in the rain, and they were not allowed to talk to anybody inside the building.'",
        "'speaker_6': 'And he didn't, of course, know that there was an elected official with the workers at that time and wrote to make sure that we remember that the workers who are organizing there are demanding nothing more than that the employer follow that law.'",
        "'speaker_6': 'And I don't think that anybody who is being honest and who is truly concerned about the interests of workers would be under any illusion that the that the process, the political process at this moment is fair and objective towards workers.'",
        "'speaker_6': 'It is extremely biased towards corporations. And that is why when it's a question of free speech and the question of a, you know, a mega corporation like Amazon, we should not be rushing through. If we are trying to be responsible, we should be being thoughtful.'",
        "'speaker_1': 'Thank you. Any other comments? Councilmember Gonzalez.'",
        "'speaker_2': 'I just want to I just want to hail back to the comments I made in support of the motion to hold this over, to give us a little bit more time to work through the tricky nature of crafting some First Amendment protections.'",
        "'speaker_2': 'I think the fact that we're all scurrying up here trying to craft some language to get clarity around what we're talking about is a case in point as to why I think we needed to suspend this for a very short period of time to address what I think were reasonable concerns brought up around freedom of speech that'",
        "'speaker_2': 'were flagged by Councilmember Licata. You know, there are other questions that I have, for example, around, you know, what does it mean to unreasonably interfere with somebodies enjoyment of the space? I don't I don't know where that's defined.'",
        "'speaker_2': 'I don't know if that's defined in the PDA. I'd like to be able to sort of consider what that actually means. And so, again, this is just an example of of, I think, needing us to be thoughtful and judicious about how we move forward on this.'",
        "'speaker_2': 'I recognize that the public benefits piece around this is significant. I commend Amazon for the contributions that they have made in regards to that. But I think that this is a reasonable request. I've heard from Amazon that they are amenable to agreeing to and have agreed to freedom of speech requirements via the PDP.'",
        "'speaker_2': 'UDAS And I want to make sure that that we are again setting up a process where it's fair and collaborative in terms of defining exactly what the contours of those conditions would be.'",
        "'speaker_1': 'Thank you. The parliamentarian has informed me that our vote to suspend the rules did not achieve the two thirds required vote to suspend the rules. So this amendment will not be considered. I would move to hold this item and bring it back to full council on Monday, January four, excuse me, Monday, January 11.'",
        "'speaker_1': 'Is there a second?'",
        "'speaker_4': 'I thought people did want to hold it.'",
        "'speaker_1': 'Well, that motion failed for lack of a second.'",
        "'speaker_7': 'Is it.'",
        "'speaker_1': 'To reconsider? Want to advise you that it's very clear that if we continue voting on this, we're going to have a 4 to 4 split. So I think it would be best to.'",
        "'speaker_7': 'Is it out of order to reconsider Council Member Mercado's motion to read, to refer it to the Intelligence Committee?'",
        "'speaker_1': 'We could reconsider that. But there's a motion on the floor right now. I think it's. Go ahead, Councilman.'",
        "'speaker_3': 'Assuming your motion failed, I guess it could be perhaps made again. I was just trying to take I was taking pause to understand where we were when you explained that the motion to suspend the rules failed because of two.'",
        "'speaker_1': 'To requires a two thirds vote, and we did not have.'",
        "'speaker_3': 'That. I was wondering if we could revolt, that perhaps that vote would change and we can then suspend the rules. Is that a possibility? You don't want to go through that again. Oh, I like the we haven't spoke substantively on the issue yet because I was waiting for the right opening.'",
        "'speaker_3': 'I wanted to lay that out because I was hoping we could actually resolve this today. It was my preference that.'",
        "'speaker_1': 'That's my preference as well. But I think that's not likely.'",
        "'speaker_0': 'You know.'",
        "'speaker_1': 'So my motion to refer this to full council on January 11 fails for lack of a second. What is the wish of the body?'",
        "'speaker_8': 'I think I got.'",
        "'speaker_1': 'Council member Gordon.'",
        "'speaker_0': 'I was going to say that in reading the the section one B to page six makes it so perfectly clear that free speech activities such as handling, signature gathering and holding signs all without access to the space, the building or other adjacent amenity features, and without unreasonably interfering with the enjoyment of the space by others shall be'",
        "'speaker_0': 'allowed. And according to Miss Barnett, thank you very much for coming. That will be posted prominently and while engaged and allowed activities. Members of the public may not be asked to leave for any reason other than by conduct that unreasonably interferes with the enjoyment of the space by others.'",
        "'speaker_0': 'I mean, that seems to me perfectly clear and it's certainly consistent and it seems to me that we should go ahead with this. And as a matter of fact, we did take it up twice at the Carers Protection Committee, had a public hearing and did vote upon it.'",
        "'speaker_0': 'There was a last minute proposal by Council member Le Carter which failed. It is a divided report and I think we should go ahead with it. Are you moving it? Should I ask that we move it?'",
        "'speaker_4': 'Abrahams, Assistant of Music, I believe.'",
        "'speaker_6': 'I call for the question. President Burgess.'",
        "'speaker_1': 'Thank you for the question has been called for. But colleagues clearly were divided on this issue and.'",
        "'speaker_4': 'So Bruce keeps one because I right.'",
        "'speaker_3': 'Councilmember Harrell Because we are divided and I assume that if we proceeded with a vote it fails. We sort of go back to revisiting it anyway. So I'd like to actually renew your motion to hold it till January 11th.'",
        "'speaker_3': 'Electorate renew that.'",
        "'speaker_1': 'Motion. I'll second that motion. Are there any comments on that motion? Council Member So what?'",
        "'speaker_6': 'I just had my hand up earlier. I wanted to go back to guns from a Ryan's point about reconsidering the amount of guns umbrella cut as motion to refer it to the transportation committee. And I believe for reconsidering calling it for reconsideration requires the losing side.'",
        "'speaker_6': 'So one of us who voted yes on it has to make the motion and I'm willing to make the motion.'",
        "'speaker_1': 'Well, there's a motion on the floor now. So if this fails, then you can go to that reconsideration. So the motion is to send this to to hold this and bring it back to full council on Monday, January 11.'",
        "'speaker_1': 'Any further comments? Councilman Earle.'",
        "'speaker_3': 'Thanks for your patience there.'",
        "'speaker_1': 'Councilman Burgess. I told you this morning we'd be in to the dinner hour.'",
        "'speaker_3': 'I just wanted to assure. Council members want that in making the motion. My thinking is we have almost four weeks to figure this out because we'll be around. We'll have. I think we will because we'll be here next week.'",
        "'speaker_3': 'And even we don't have to take vacation. We'll be around and we have the week of the fourth. But I think perhaps you're thinking it goes back to committee for more discussion. And I don't. That wasn't the intent of my motion to have.'",
        "'speaker_3': 'That was just to resolve these issues and get it to the full council. So.'",
        "'speaker_6': 'Again, I respond to that.'",
        "'speaker_0': 'Yes, members.'",
        "'speaker_6': 'Thank you, guys. Remember how. Yes. In terms of just time, you're right that there is that ordinarily, I think that would be a good amount of time. But I have two specific concerns. One is that just realistically speaking, I don't think the council will be deliberating on this because it's holiday season and this is the last one'",
        "'speaker_6': 'council. Everybody has other commitments, family commitments. I think this is an important issue. And I think that to do justice to it and not not not make a commitment that I don't think we're going to be able to keep.'",
        "'speaker_6': 'But more importantly, I think there's a difference between referring it to the committee as opposed to bringing it back to full council. The reason we're advocating to bring it back to committee is because we there are issues that need to be discussed and full council is not.'",
        "'speaker_6': 'The forum that facilitates that discussion. It has to happen at the committee level. So that's what I would say.'",
        "'speaker_1': 'Thank you. The motion before us is to hold this item and bring it back to full council on Monday, January 11. All in favor. Vote I by raising your hand. I opposed. Vote no. The motion carries. This item is held until January 11.'",
        "'speaker_1': 'Please read item 51. It's.'"
    ],
    "Alley Vacation Petition by Fauntleroy Place LLC near Alaska Junction.": [
        "'speaker_2': 'Agenda Item 51 Constable 118 592 vacating the South 168 feet of the alley adjacent to Lot 17 through 24, lying between block 55 and BLOCK 56. Boston Company's plat of West Seattle near the Alaskan just excuse me. Junction, excuse me.'",
        "'speaker_2': 'Standing in the West Seattle neighborhood of Seattle on the Petitioner Fauntleroy Place, LLC, in ratifying confirming certain prior acts committee recommends the bill pass.'",
        "'speaker_1': 'Thank you, Councilmember Rasmussen.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'This petition has all the requirements of the City Council and the conditional approval have been met, including all of the public benefits. And the committee has reviewed that and the all of the departments have recommended approval and the committee recommends approval as well.'",
        "'speaker_1': 'Thank you. Any questions or comments? Sure. Please call the role on the passage of the Bill Garden.'",
        "'speaker_2': 'I. Gonzalez. Harrell, Licata, I. O'Brien Rasmussen. All right. So on President Burgess eight in favor. Nine opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Is there any other business to come before the council? So I would like to take this opportunity to express our appreciation for the service of Councilmember Licata. Councilmember Rasmussen and Councilmember Gordon.'",
        "'speaker_1': 'This is the last formal meeting of the City Council where these three members will be present, and we appreciate your dedicated public service to the people of Seattle. You've all served with distinction and with integrity, and that's important in our democratic society.'",
        "'speaker_1': 'Do any of my colleagues wish to share any comments?'",
        "'speaker_3': 'Councilmember Harrell Well, I had a lot of time in a speech lined up for each one of you a piece.'",
        "'speaker_1': 'Please go ahead.'",
        "'speaker_3': 'But it's 522 and I think Councilmember Gonzalez and I have a 6:00 appointment. So in all seriousness, I just want to say it's been my my honor serving with the three of you. I think he's just served with distinction and commitment to the people of Seattle.'",
        "'speaker_3': 'Never expected to agree with all of you when I got elected, because I haven't found that human being yet that I agree with all the time. But certainly my respect for the three of you is at an all time high and I don't think you're going anywhere.'",
        "'speaker_3': 'Hopefully so. We'll hopefully still be the beneficiary of your sage advice. But it's been my honor serving with the three of you. Thank you very much.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember O'Brien.'",
        "'speaker_7': 'Thanks. I. I've been on the council for six years, and I don't know what a council would look like without the three of you. So it's going to be a brave new world we're heading into. Perhaps more importantly, I don't know what it's going to look like with the three of you on the outside as advocates.'",
        "'speaker_7': 'And I look forward to continuing to hear your positions and opinions as we move forward. So thanks for your public service for so many years.'",
        "'speaker_1': 'Thank you. Councilmember someone.'",
        "'speaker_6': 'Thank you. Councilmembers Jean Gardner and Dan Rasmussen. I think we had some really great discussions and lively debates and we also had agreement on various things. I mean, one of the things that was of real consequence and it's evident today, which is through the wage theft enforcement ordinance, that one of the factors in that whole process coming'",
        "'speaker_6': 'that coming to fruition was the statement of legislative intent that I drafted, that Councilmember O'Brien and Councilmember Rasmussen supported, and the full council voted on that in the Budget Committee, which, you know that I'm grateful for those kinds of opportunities where we were able to do that.'",
        "'speaker_6': 'And Councilmember Legarda, of course, you know, we've had. I have. I mean, you've been on the council for a long time, but for my two years I've had a really wonderful time getting to know you and working with you on so many important issues.'",
        "'speaker_6': 'And even though you won't be here, you know, formally on this body, I have no doubt and I have every hope that you will be a part of building this historic movement that we have started to build, not only in Seattle, but nationwide.'",
        "'speaker_6': 'I think the whole nation should have the benefit of your experience and your true dedication to the interests of workers and those who are marginalized. Seattle has been really, really fortunate to have you, and I hope that we continue to get, you know, even more of a benefit of your of your activism.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. All right. Let's remember, Gordon.'",
        "'speaker_0': 'Well, I just want to say it's been such a pleasure to serve. I can't tell you. I really thought after a long newspaper career, this was the frosting on the cake. And it has been. There have been so many wonderful things that we've been able to do.'",
        "'speaker_0': 'And I'm so grateful to the voters for electing me. I'm so grateful for my fellow council members for putting up with me. And I would have been rather disappointed if we hadn't had at least one little controversy on this last, final council meeting very much.'",
        "'speaker_1': 'Council Member Lakota.'",
        "'speaker_8': 'I will make this mercifully short on time. It's been a pleasure working with all of you. I've really enjoyed your honesty and great open discussions and the last meeting to go to. Well, what a great, joyful struggle. And we accomplished a lot.'",
        "'speaker_1': 'Thank you. Thank you. And I can't wait until you're on the other side of that podium addressing you as a citizen. And we can stop you after your 2 minutes. Thank you. Councilmember Rasmussen.'",
        "'speaker_4': 'Thank you. As customer Gordon said, it's been an incredible privilege and a joy to be a member of the city council. The first time I was up here, I was so nervous I could not stand up to speak and I just hope that I wasn't breaking the council rule.'",
        "'speaker_4': 'So it took a while to become comfortable, to stand to speak here. Now I'm ready to leap to my feet, just as Councilmember Harrell often does. So I feel like I've grown in this job. And also I think Councilmember Swan made a very good point.'",
        "'speaker_4': 'While we have disagreements at times. I do think that we agree far, far more times and that sometimes our styles are different. But I think that our goals of having a just equitable society in this city and moving what we are able to do here out into the state and nationally and even internationally is is the same'",
        "'speaker_4': '. And so sometimes a lot is made out of a few disagreements. And it's interesting in that we've always been accused of being such a polite city council and and such a boring city council that when there is a disagreement, it's almost headlines.'",
        "'speaker_4': 'So I, I thought that the discussion this afternoon was, was productive and healthy. And I hope that we have more productive, healthy discussions in the future. And again, thank you. I've really welcomed working with all of you, including of all of our wonderful staff, our clerk's office, our central staff, my staff, which is now nearing, I think'",
        "'speaker_4': ', a dozen after about 12 years. So it's been great working with with all of you. Thank you so much. And Beverly Barnett, of course, all the staff to their wonderful.'",
        "'speaker_1': 'Thank you very much. Councilmember Gonzalez.'",
        "'speaker_2': 'So as the as the freshman the newest member on the city council, I wanted to express my gratitude to councilmembers Licata and Gordon and Rasmussen. In the short two and a half weeks that I've been a city council member, I have already learned so much from from you all and am incredibly appreciative of the hard work and'",
        "'speaker_2': 'effort that it takes to be to be in this role and to serve the people of Seattle. So thank you to all three of you. I think I think between the three of you, you have decades and decades of service and you've left a long a long you're leaving a long legacy of really great promising work for'",
        "'speaker_2': 'the city of Seattle. And thank you so much for your service.'",
        "'speaker_1': 'Thank you, Jean, Nick and Tom, thank you. You you've served well, so thank you very much. And we're adjourned.'"
    ]
}