{
    "Acceptance of Property Transfer from University of Washington for Affordable Housing and Other Uses.": [
        "'speaker_2': 'Agenda Item one Capital 119832 The relating to the Office of Housing of the Department of Finance Administrative Services authorizing the acceptance of a transfer of real property near the Mount Sacred White Rail Station from the University of Washington.'",
        "'speaker_2': 'For the purpose of development of affordable housing and other potential educational research and clinical uses by the university, including an early learning facility and for general municipal purposes. Pricing of property under the direction of the Office of the Housing, the Department Administrative Services to State Facilities management of the property, including leasing, collection of rent payments of expenses'",
        "'speaker_2': 'and other property management duties and. Ratifying confirming. Purchased direct.'",
        "'speaker_0': 'Thank you so much. I will move to pass. Council Bill 119802. Is there a second Bakken? It's been moved and seconded to pass the bill. Councilmember Mosqueda, you are the sponsor of this bill, so you are recognized in order to address this item.'",
        "'speaker_1': 'Thank you. Council President. Council colleagues.'",
        "'speaker_0': 'This legislation authorizes the city to accept at no cost the transfer of property at the University of Washington laundry site near the Mount Baker Light Rail Station from the University of Washington. For the purposes of developing affordable housing, along with other potential amenities, including educational services, research services, clinic clinical uses, including such things as an early learning'",
        "'speaker_0': 'facility as outlined in the state's capital budget. We heard from council central staff last week and the Office of Housing, in addition to FEMA, about the transfer at our council briefing and as we discussed in last week's meeting, this is a really exciting opportunity for transit oriented, affordable housing, co-located with early learning facilities and other important community'",
        "'speaker_0': 'amenities, such as services and opportunities for partnership with labor and community.'",
        "'speaker_1': 'I know that many of.'",
        "'speaker_0': 'Our colleagues have already expressed interest in seeing this property support.'",
        "'speaker_1': 'The community vision.'",
        "'speaker_0': 'Especially from Black and Brown led community organizers and organizations. The vision for creating a more walkable, livable environment, for creating more opportunities for community services.'",
        "'speaker_1': 'Amenities in this building space that directly impact the local community and.'",
        "'speaker_0': 'Are built in alignment.'",
        "'speaker_1': 'With what the community.'",
        "'speaker_0': 'Is asking for. And that we.'",
        "'speaker_1': 'Integrate the building and the vision.'",
        "'speaker_0': 'Into the broader neighborhood plan. And that.'",
        "'speaker_1': 'Means things like community.'",
        "'speaker_0': 'Homeownership, opportunities adjacent to sound transit opportunities. Looking really to looking forward, really to working with all of you in the community and with the leadership of Councilmember Morales, who spoke to this last week about making sure that when you do development, it's development done right.'",
        "'speaker_1': 'In the model that the community has.'",
        "'speaker_0': 'Put forward. So that'll be an exciting opportunity. As we heard from the Office of Housing.'",
        "'speaker_1': 'Community Engagement will commence.'",
        "'speaker_0': 'This year to develop the RFP for the site and we express a strong interest in having the Office of Housing come back to council with the draft RFP before issue, which director Alvarado from the Office of Housing expressed.'",
        "'speaker_0': 'That should be happy to do so. And our office will be working with all of you and the Office of Housing to schedule that time. The legislation introduced is a routine legislation that allows for us to accept the process property and comply with the state requirements for the transfer transfer to take place prior to June 30th.'",
        "'speaker_0': 'And with that context, I'll hand it back over to Council President. Thank you so much. Councilmember mosqueda, are there any other comments or questions from from colleagues? I don't know. We've had an opportunity to discuss this a few times already, both in council briefing and in full council.'",
        "'speaker_0': 'So are there any other questions or comments on the bill? Hey, thank you all so much. Really exciting opportunity here and looking forward to voting in favor of this bill once.'",
        "'speaker_2': 'The.'",
        "'speaker_0': 'Roll is called. So at this point, I will have the clerk call the roll. Yes. Councilmember Mosqueda, thank you very much. Just very briefly, before the roll is called, I want to say thank you to our council colleagues for engaging in this process relatively quickly.'",
        "'speaker_0': 'And also to Emily Alvarado, the director of Office of Housing, her team for moving swiftly.'",
        "'speaker_1': 'A quick thank.'",
        "'speaker_0': 'You to Representative Chop for pushing the transfer to utilize this land for affordable housing and to the university for engaging with us. I think it's a loss of.'",
        "'speaker_1': 'Good living.'",
        "'speaker_0': 'Waiting in jobs that I think if we're able to use this property to create more good living wage, union jobs and housing and other additional amenities into the future really does serve.'",
        "'speaker_1': 'That vision that.'",
        "'speaker_2': 'We've all talked about, about.'",
        "'speaker_0': 'Using public land for the best public purpose and prioritizing public services so that we don't create a situation where more people are displaced or that we lose an opportunity to create public amenities on public space. So thanks to Office of Housing and for their work to see this happen and quickly, thank you to Erin House for her'",
        "'speaker_0': 'fast work.'",
        "'speaker_1': 'For my office to get all the details together.'",
        "'speaker_0': 'And to do some stakeholder and final touches to the legislation. I appreciate her work on this. Thank you so much. Okay. If there are no other comments on the bill, we'll go ahead and move to a roll call.'",
        "'speaker_0': 'I would ask that the clerk please call the roll on the passage of the bill.'",
        "'speaker_1': 'The want i.'",
        "'speaker_3': 'Strauss II.'",
        "'speaker_1': 'Purple. Hi, Suarez.'",
        "'speaker_2': 'Hi.'",
        "'speaker_3': 'LEWIS Hi.'",
        "'speaker_1': 'Morales Hi. Mosquito, I.'",
        "'speaker_3': 'Peterson Hi.'",
        "'speaker_1': 'President. Gonzalez. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes and the chair will sign it. And I would ask that the clerk please affix my signatures to the legislation on my behalf. Okay. Item two I would ask that the clerk please read agenda item two into the record.'"
    ],
    "Ordinance to Remove Drug Traffic Loitering from the Criminal Code.": [
        "'speaker_2': 'Agenda Item two Capital 119807 related to the city's criminal code, removing the crime of drug traffic, loitering and associated references some elements of the code amending section 10.0 9.0 a kind of settlement for code repealing section 12 a point 20.0 50 of the Kalamazoo Code.'",
        "'speaker_0': 'Thank you so much, ben. I will move to pass. Council Bill 119807. Is there a second?'",
        "'speaker_3': 'Back in.'",
        "'speaker_0': 'Thank you so much. It has been moved and seconded to pass the bill. Council Member Lewis You are the prime sponsor of the bill, so you are recognized in order to address this item.'",
        "'speaker_3': 'Thank you, Madam President. I'm going to speak. My remarks will be broad enough to cover both ordinances. So that's including 119808.'",
        "'speaker_0': 'I can't remember. Council Member Lewis Would you like for both bills to be read into the record and then we can vote on them separately so that folks can comment on both bills as a package?'",
        "'speaker_3': 'Well, I'm going to leave the bulk of the comments on 119808 to Councilmember Peterson, who is a co-sponsor on that measure and has some remarks that he wants to give. So I actually I'm not I guess I would rather just go ahead procedurally and do them separately on the pre-arranged.'",
        "'speaker_3': 'But my comments will be broad enough to speak to both of them. And I'll let Councilmember Peterson speak more in depth on 119808. So, you know, in repealing these ordinances, this is something that's been on my to do list since taking office in January.'",
        "'speaker_3': 'As a former prosecutor in the city attorney's office, I believe in our social contract of being a community that is guided by a system of law. But I've always felt that these particular statutes criminalize conduct that is so innocuous and speculative that it makes a mockery of that entire system of justice.'",
        "'speaker_3': 'And keeping them on the books just continues to perpetuate that mockery. I know I can cite as a basis for moving these laws that the city attorney, Pete Harms as a standing policy to not charge these or these particular crimes.'",
        "'speaker_3': 'Or I could cite our own reentry report, which radically a couple of years ago in 2018 were recommended the repeal of these manifestly unjust ordinances. But in truth, you know, I think the real reason for repeal goes back even further and it goes back deeper.'",
        "'speaker_3': 'And it speaks to the fact that many people in our community, particularly communities of color, have been urging repeal of these ordinances for years. And indeed, it is not accurate for us to call these ordinances outdated. As I mentioned in briefing this morning, I firmly believe that I think to do so implies that these ordinances had their'",
        "'speaker_3': 'purpose and had their day and new realities had made them irrelevant. And, you know, fax machines are outdated. Like these laws were never appropriate. They were wrong when they were enacted. And they are wrong now. And I want to thank the many community organizations, many of whom who spoke up today, who have been organizing on both these'",
        "'speaker_3': 'ordinances and have long been educating the public on the need for these repeals. You know, we heard from Decriminalize Seattle, a coalition sex worker outreach project, Green Light project, and many more. And this is an important step. These repeals and I'm proud of prime sponsor both of these repeals.'",
        "'speaker_3': 'And I look forward to helping to to right these historic wrongs and and be an ally of the work the community has done on these. And I want to thank Kamala Brown in my office, who helped with these together and assured central staff for their hard work on getting this legislation, this timely legislation together and cuing it'",
        "'speaker_3': 'up now. And I urge passage of both of these bills. And now when we get to 11 9808, I know Councilman Peterson has remarks speaking to 1198 that I went through, which for him to speak for me on.'",
        "'speaker_0': 'Thank you so much. Councilmember Lewis, are there any other comments on the bill? Councilmember Herbal, please.'",
        "'speaker_1': 'Thank you. I just want to quote from a section in the October 2018 reentry report that is I found particularly moving in, producing and delivering the report. Many individuals and organizations provided support and expertize. And the report authors provide an acknowledgment that, again, I'd like to share.'",
        "'speaker_1': 'The acknowledgment is we also recognize those who have been supporting folks returning from incarceration and organizing for institutional change for a very long time. We know that much of that work has been done without compensation or acknowledgment that done with love and an unyielding commitment to family and community strength.'",
        "'speaker_1': 'We thank you for that work and hope these recommendations support you. We also acknowledge that the individuals most impacted by the recommendations in this report are unable to join us at the cities tables as they are still incarcerated.'",
        "'speaker_1': 'We did this work in Your Honor. And before I close my comments, I also want to just highlight that another one of the reentry report's recommendations was the expansion of the current pre file diversion program. And in the last few weeks we received a set of recommendations from from the city attorney's office as it relates specifically to'",
        "'speaker_1': 'the Council's prior interest. We, during the budget process, passed a statement of legislative intent asking for these recommendations from the city attorney. And they're looking at a model of of a of a program that will serve 25 and older and would base the program model on the successes of the young adult program through that is we all'",
        "'speaker_1': 'know is she's one she's 180. They identify the need for funding for racial equity tool kit in designing the expansion model and. Let us know that the the cost to complete the racial equity toolkit would be about $25,000 of one time money.'",
        "'speaker_1': 'So I just want to I want to mention this take this opportunity. So my colleagues on the Council know of my interest in implementing the recommendations of the city attorney to to begin the, the RET process, the racial equity toolkit process to develop an adult program and look forward to hopefully talking about the resources that the city'",
        "'speaker_1': 'attorney needs to do this right in our June rebalancing package. Thank you.'",
        "'speaker_0': 'Okay, colleagues, thank you so much. Any other comments on on this first bill? Customer service data, please. Council president. I want to.'",
        "'speaker_1': 'Thank the.'",
        "'speaker_0': 'Co-Sponsors of this legislation, and I know that Councilmember Lewis and customer Peterson are speaking. I want to thank Councilmember Morales as well. I believe that you're a co-sponsor of the legislation in front of us, too. And thank you all for bringing this forward and really lifting.'",
        "'speaker_1': 'Up.'",
        "'speaker_0': 'The voices that we've heard from today's public comment and so many of the folks that we had worked with this last last year's budget to provide additional dollars to sex workers as folks are trying to both have self-determination and respond to upcoming issues that they see on a daily basis and knowing that they're in the driver's seat'",
        "'speaker_0': 'to make those decisions. So we're really excited about the work that you've done and to give a huge thank you to the reentry work group who produced these policy recommendations. This is a really great step forward in undoing the racist policies that go all the way back to the war on drugs.'",
        "'speaker_0': 'And I'm excited that we as a council are taking these steps, especially during this this movement that is demanding action. The Black Lives Matter movement demanding accountability and action. And I look forward to voting enthusiastically.'",
        "'speaker_1': 'Yes. On this.'",
        "'speaker_0': 'Thank you so much. Councilman Mosqueda, any other comments on this first bill? Looks like there are no additional comments on this particular bill. So I will go ahead and ask the clerk to please call the roll on the passage of the bill.'",
        "'speaker_0': 'The want.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Strauss i.'",
        "'speaker_1': 'Purple. Herbold, I. Juarez.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Lewis. Hi, Morales. All right, let's get a. I. Petersen I President Gonzalez I nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. I had ask that the clerk please to fix my signature to the legislation on my behalf. Okay, folks, moving along. I would ask that the clerk please read agenda item three into the record.'"
    ],
    "Ordinance to Remove Prostitution Loitering Crime from the City's Criminal Code.": [
        "'speaker_2': 'Agenda Item three. Taxable 119808 release of the city's Criminal Code, removing the crime of prostitution, loitering.'",
        "'speaker_0': 'And.'",
        "'speaker_2': 'Associated recklessness and felonies. The code and many sections 8.. 70 and 12 point 10.100. A repealing section 10.3 would send a pat on the back.'",
        "'speaker_0': 'Thank you so much. I will move to pass. Council Bill 119808. Is there a second second? It's been been seconded to pass the bill. Councilmember Peterson, I understand you're going to take the first go at speaking about this bill.'",
        "'speaker_0': 'And then I understand Councilmember Morales would like to make some remarks. I'm after you also as a co-sponsor of of the bill. So, Councilmember Peterson, you are recognized to in order to address this item, please.'",
        "'speaker_3': 'Thank you. Council President So first, I want to thank everybody who took the time to email us, to email our offices and to call us and to call in today for public comment to support Council Bill 119808 to repeal the Prostitution Loitering Law.'",
        "'speaker_3': 'The brutal killing of George Floyd by Minneapolis police, which followed countless other wrong acts and centuries of racism, have refocused our nation's attention on the need to prevent disproportionate impacts of our law enforcement system on black, indigenous and other people of color, and repealing problematic laws on our books such as these loitering laws.'",
        "'speaker_3': 'That's a small but important step that the city council can take. Council Bill 119808, if adopted today, will repeal Seattle's Prostitution Loitering Law, which is currently Section 12.1 0.010 of our Seattle Municipal Code. I believe it's vital that we support the recommendation of the Seattle Reentry Work Group to repeal this law, to eliminate another potential source of'",
        "'speaker_3': 'disproportionate harm or jeopardy to communities of color from our policing and carceral system. Thank you to councilmembers Lewis and Morales for co-sponsoring this, and thank you to the city attorney and also Councilmember Herbold for her work on this issue.'",
        "'speaker_3': 'I want to thank Kara and my staff and also our show on our city council, central staff for their work and engagement on this legislation. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Peterson, for those remarks. Counselor Morales, please.'",
        "'speaker_4': 'Thank you. Council President Gonzalez. I do want to thank Councilmember Lewis for bringing forth this legislation. We know that loitering laws have a deep and harmful racist history. So these bills do offer an important first step, as many of our callers mentioned today.'",
        "'speaker_4': 'We do have a lot more work to do to protect our neighbors who are sex workers. And I just want to say, as many of our public I'm interested as well. I look forward to working with Cherie Lascelles with the Green Light Project and the Decriminalize Seattle Coalition to understand the best way to move forward with decriminalizing'",
        "'speaker_4': 'sex work so that they feel safe calling the police so they can access health care and banking. We know that we also this is a complex issue, so we need to make sure we're protecting sex workers by not conflating consensual sex work with those who are being trafficked.'",
        "'speaker_4': 'And we need to enforce and prosecute traffickers so that we can end that exploitation that's happening. This is just the beginning. And we've been in communication with with Cheri for a while and look forward to continuing a conversation to make sure that we continue this work and the steps that Jackie Brown outlined when she called in as'",
        "'speaker_4': 'well. So thank you to Councilmember Lewis and for your co-sponsorship as well, Councilmember Peterson. And we will continue to move this work forward.'",
        "'speaker_0': 'Thank you so much, Councilman Morales, because remember, Lewis, would you like to make some remarks about this bill as well? Yes. Thank you, Madam President.'",
        "'speaker_3': 'Just very briefly, I think Councilmember Peterson accounts for an excellent job of summarizing the critical nature of this repeal. And the only thing that I would say just sort of looking beyond this repeal to kind of the future of the task that's in front of us, I had the great privilege of being able to see a very'",
        "'speaker_3': 'moving presentation by the folks who do organizing at the for a Commons at the 36 District Democrats earlier this year, when there were still in-person meetings of that organization where a number of people with lived experience having been sex workers are working with sex workers in the Aurora corridor presented about the challenges that community is facing and'",
        "'speaker_3': 'really that the the lack of comprehensive city services to help folks get the resources they need through the programing of a were a commons to finally get out of the cycle that they're in. You know, these repeals are a really good start, but it does underscore the need for investment and standing up of tiny house villages, of'",
        "'speaker_3': 'permanent supportive housing, of wraparound services, of a lot of the ancillary resources that are critical for folks who are trying to break the cycle of being in cycles of trafficking, substance addiction and sex work in the city. And I look forward to working with everybody here to try to make those commitments.'",
        "'speaker_3': 'I think it's certainly part of our conversation around defunding and rightsizing of services in our conversation about the police department. And I look forward to continuing to work with all of the organizations that we've talked about here today and the great impact the work of our commons is doing in this area.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilmember Lewis, for those words and for that work. Are there any additional comments on the bill? Councilman Mosqueda and then Councilmember Strauss. Thank you. Council President And thanks again to the co-sponsors of this legislation.'",
        "'speaker_1': 'I would be.'",
        "'speaker_0': 'Remiss if I didn't also take a quick moment to recognize and thanks to Ray Lascelles for their longstanding work with the people of Color Sex Worker Outreach Project and the Green Light Project. I was really honored that my office, led by Aretha Basu.'",
        "'speaker_1': 'Worked with.'",
        "'speaker_0': 'The folks.'",
        "'speaker_1': 'There to include Park Slope in last.'",
        "'speaker_0': 'Last year's budget cycle to get funding for the critical.'",
        "'speaker_1': 'Harm reduction work that they do. And really.'",
        "'speaker_0': 'Really proud of this council. Excited to take this vote again today. Thank you, Councilmember Mosqueda. Okay. We're going to hand over now to Councilmember Strauss, please.'",
        "'speaker_3': 'Thank you. Council president. Thank you to the bill's sponsors. This is a good piece of legislation. As Councilmember Lewis stated earlier, this is not outdated because there was never a date that this was necessarily appropriate. It reminds me of using traffic stops to find to investigate other crimes that are not related to that traffic stop.'",
        "'speaker_3': 'So I just want to briefly say thank you to the councilmembers for bringing this forward, the sponsors and community for making this happen. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Strauss. Any other comments on the bill? He's seeing and hearing none. I would ask that the clerk please call the role on the passage of the bill.'",
        "'speaker_1': 'Want. Strauss.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Purple. Hi. Suarez, i. Luis, i. Morales, i. Let's get. I. Petersen.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'President Gonzalez i. Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. And I'd ask that the clerk please affix my signature to the legislation on my behalf. Okay, folks, we have reached other business on our agenda. Is there any other further business to come before the council?'",
        "'speaker_0': 'Councilmember Was that a place? Thank you. Council President. Just a quick update.'",
        "'speaker_1': 'On council.'",
        "'speaker_0': 'Briefing this morning. I described the process for.'",
        "'speaker_1': 'Wednesday's budget committee meeting. I noted that.'",
        "'speaker_0': 'There's two sessions as we have per usual.'",
        "'speaker_1': 'Wednesdays at 10 a.m. and a.'",
        "'speaker_0': '2 p.m.. Unfortunately, the technology is not going to work. For one, you are able to sign up.'",
        "'speaker_1': 'So we will still have an 8 a.m..'",
        "'speaker_0': 'Sign of opportunity and a noon sign up opportunity. For both of those hearings.'",
        "'speaker_1': 'We will be asking.'",
        "'speaker_0': 'Folks to just speak at one or the other. So instead of having folks sign up just at the 8 a.m. time frame, you do have a chance as well to sign up at.'",
        "'speaker_1': 'Noon, beginning at noon.'",
        "'speaker_0': 'For our 2 p.m. hearing. And we encourage as many people as possible.'",
        "'speaker_1': 'To get into the window again, one.'",
        "'speaker_0': 'Minute timeslots, because there's going to be a lot of people signed up. But I did want to correct the record.'",
        "'speaker_1': 'A 10.'",
        "'speaker_0': 'A.m. sign up starts at 8 a.m..'",
        "'speaker_1': 'And a 2 p.m..'",
        "'speaker_0': 'Public testimony starts at noon. Thank you, Councilmember Muscat, for that clarification. And just to remind folks, the ordinary rules around public comment do apply to those pre-registration sheets. I think that the interest of Budget Chair Mosqueda is to make sure that there aren't two bites of the apple, as they say, one in the morning and one in'",
        "'speaker_0': 'the afternoon, largely because we want to hear from as many different people as we can. So we will be following duplicate protocol here. And if in if folks have signed up both in 8:00 AM at the 8:00 hour and at the 10:00 hour, please be aware that you will only be allowed to provide public testimony once on'",
        "'speaker_0': 'Wednesday and not twice. And so our legislative I.T. department will work with the chair to make sure that those duplicates are called out appropriately. Have I stated that intent correctly? Sure. State. That's correct. Thank you so much. Absolutely.'",
        "'speaker_0': 'I just want to make sure that it's crystal clear for those folks who are looking to sign up and pre-register for public comment on Wednesday. Thank you. Is there any other further business to come before the council? He hearing?'",
        "'speaker_0': 'None. Colleagues, this concludes the items of business on today's agenda. Our next city council meeting is Monday, June 29th, 2020 at 2 p.m.. There will be another remote meeting. That is it for today. We are adjourned and I hope that you all have a wonderful afternoon.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you.'"
    ]
}