{
    "Second Quarter 2022 Employment Ordinance: Civil Service Changes.": [
        "'speaker_1': 'The report of the City Council Agenda Item one Council Bill 120347 An ordinance relating to city employment, commonly referred to as the second quarter 2022 employment ordinance.'",
        "'speaker_0': 'Thank you. I moved to pass Council Bill 120347. Is there a second that can. Thank you. It's been moved in second hand to pass the bill as sponsor of this item. I will address it and then open up the Florida comments brief.'",
        "'speaker_0': 'Bear with me for a minute. The council authorizes certain personnel actions through quarterly and employment ordinances. Today, we are considering the second quarter 2022 employment ordinance. This ordinance came straight to full council and was not referred to committee.'",
        "'speaker_0': 'Last week, Karina Boyle on our central staff provided a memo of analysis for your consideration. If passed Council Bill 120347 would authorize the Seattle Department of Human Services to, number one return seven positions to the civil service system, and number two, exempt one position from the civil service system.'",
        "'speaker_0': 'It also amend Seattle Municipal Code Section 4.13.010 to reflect the classification civil service changes to these three positions. There are no direct costs associated with these personnel decisions or actions today. Any comments on this bill? Not seeing or hearing any.'",
        "'speaker_0': 'Will the clerk please call the role on the passage of the bill?'",
        "'speaker_1': 'Councilmember Nelson II. Councilmember Peterson. Hi. Councilmember Sawant. Yes. Councilmember Lewis. Yes. Council member Morales. S Council president was high.'",
        "'speaker_0': 'Six in.'",
        "'speaker_1': 'Favor. Nine opposed.'",
        "'speaker_0': 'Thank you. The bill passes. The chair will sign it. And Madam Clerk, will you please affix my signature to the legislation? Moving on to item two. I understand that Caspar Harold is not here today. I understand. Customer Morales is a co-sponsor.'",
        "'speaker_0': 'Will be addressing this. Madam Clerk, can you please read item two into the record.'"
    ],
    "Amendment of Proviso for Seattle Municipal Court Appropriations.": [
        "'speaker_1': 'Agenda item to cancel the 120348 an ordinance relating to appropriations for the Seattle Municipal Court.'",
        "'speaker_0': 'Thank you. Caspar Morales So Resource Inc you colleagues. I did mention this bill at briefing last week, but to remind you, Councilmember Herbold and I are co-sponsors. The adopted budget includes a proviso on $88,000 in the settlement Seattle Municipal Courts budget that was intended to fund.'",
        "'speaker_1': 'Subsidies.'",
        "'speaker_0': 'For users eligible for electronic home monitoring. The proviso was intended to restrict spending until the court provided to the Public Safety and Human Services Committee baseline data from 2018 to 2021 to understand the current usage for misdemeanor defendants.'",
        "'speaker_0': 'The Court recently indicated that they do not have the data, nor does the electronic monitoring service provider, though they will begin to track it starting in 2022. So because the court has exhausted their existing funding for subsidies and cannot spend more without the proviso left, we are moving with that proviso left.'",
        "'speaker_0': 'Otherwise only those able to pay will be able to access this service. So we are moving this legislation forward. HQ Council member Alice. Are there any questions? I'm sorry. I got to move this first. Then I can ask.'",
        "'speaker_0': 'Or did I do that? No, I did not. I moved to pass Council Bill 120348. Is there a second? Second? Thank you. It's been moved and seconded to pass the bill. Calcium. Calcium already spoke to this, or is there any other comments from our colleagues?'",
        "'speaker_0': 'Councilmember else or anything else you want to add before I ask for the vote?'",
        "'speaker_1': 'No, I'm good. Okay.'",
        "'speaker_0': 'Will the clerk please call the role on the passage of the bill?'",
        "'speaker_1': 'Councilmember Nelson, I. Councilmember Peterson. Hi. Councilmember Salant. Yes. Councilmember Lewis. Yes. Councilman Morales? Yes. Council president was.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Six in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes. The chair will sign it. And, Madam Clerk, please affix my signature to the legislation on my behalf. Item number three is also Chester Morales. Madam Clerk, we will please read item number three into the record.'"
    ],
    "Historic Preservation Controls for the Cayton-Revels House.": [
        "'speaker_1': 'The Report of the Neighborhoods Education, Civil Rights and Culture Committee Agenda Item three Council Bill 120336 An Ordinance relating to Historic Preservation Imposing controls upon the key to Ravel's House. A landmark designation by the Landmark Preservation Board. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. Council member Alice. Thank you very much. Colleagues, we did hear in my committee about the Cape Rebels house. It was built in 1902. It's located in the Capitol Hill neighborhood and was home of the prominent Cape Rebels family, Horace Cayton and Suzy Rebels, who were the first owners and editors of the Seattle Republican, which was'",
        "'speaker_0': 'the city's first black owned newspaper. The home itself is associated with a significant chapter of Seattle and Washington black heritage. The family fought for civil rights and used their paper to advocate for racial equity in the city. And the Landmarks Designation Board has recommended that this House receive that designation.'",
        "'speaker_0': 'It was unanimously voted in my committee that it do pass. Q I'm trying to do three things at once, and that's probably not a good thing to do while you're trying to cheer me. So are there any other comments for Councilmember Ellis?'",
        "'speaker_0': 'Okay. Not seen any. Let's go ahead with the vote then. Madam Clerk, will you please call the roll?'",
        "'speaker_1': 'Councilmember Nelson. I remember Peterson. I don't remember a lot. Yes. Councilmember Lewis. Yes. Councilmember Morales. Yes. Council president.'",
        "'speaker_0': 'Was I six in favor and unopposed. Thank you. The bill passes. The chair will sign it. And then please affix my signature. Thank you. We'll move to item number four, which is also Casper Morales. Madam Clerk, will you please.'",
        "'speaker_0': 'Item forward to the record.'",
        "'speaker_1': 'Agenda item four Appointment 2 to 5 one. The reappointment of Matt and Pam Luther as member at Landmark's Preservation Board for a term two August 14, 2025. The Committee recommends the Council confirm the appointment.'"
    ],
    "Concession Agreement with Canteen for Vending Machine Service in City Parks.": [
        "'speaker_1': 'The Report of the Public Assets and Homelessness Committee Agenda Item five Council BR 120341 An ordinance relating to the Seattle Parks and Recreation authorizing the Superintendent of Parks and Recreation to execute for and on behalf of the city a concession agreement.'",
        "'speaker_1': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Lewis.'",
        "'speaker_5': 'Thank you, Madam President. This is a fairly straightforward ordinance. Per parks requirements. They need to come to the Seattle City Council for oversight and ratification of pending concession agreements that they reach. This particular contract is a concession contract for vending machines and park facilities.'",
        "'speaker_5': 'The vendor being selected is one of two final bids that were selected as part of a competitive RFP. The committee was satisfied and unanimously reported this legislation out for council ratification here today.'",
        "'speaker_0': 'Thank you, Councilmember Lewis, are there any comments or questions for cast member Lewis? Is there anything you want to add before we go to a vote? Caspar Release. That's a no.'",
        "'speaker_5': 'No, Madam President.'",
        "'speaker_0': 'You don't have to say, Madam President. But I didn't know if you had your speaker on or your volume one. All right. So with that, Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Councilmember Nelson. I know. Councilmember Peterson. Hi. Councilmember Sawant. Yes. Councilmember Lewis. Yes. Councilmember Morales. Yes. Council. President Suarez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Six in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes. The chair will sign it. And please affix my signature to the legislation. Moving on to item number six, which is also council member Lewis and Clark. Will you please read item number six into the record?'"
    ],
    "Agreement with Seattle Preparatory School to Replace Montlake Playfield.": [
        "'speaker_1': 'Agenda Item six Council Bill 120342 An ordinance authorizing Seattle Parks and Recreation.'",
        "'speaker_4': 'To enter into an.'",
        "'speaker_1': 'Agreement with Seattle Puppetry School to replace the Montlake playfield. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Lewis.'",
        "'speaker_5': 'Thank you. Madam President, this is an item that we had a fairly lengthy discussion on in committee regarding a deal to between Seattle Parks and Seattle Primary Academy to replace a turf field in the Montlake neighborhood of the city.'",
        "'speaker_5': 'This is an extension of an existing arrangement from the last time the turf field was replaced in collaboration with Seattle Prep. Under the terms of this agreement between Parks and Seattle Prep, as is outlined in a attachment to the legislation, the terms of agreements which in a matrix illustrates the different public benefits and the cost being assumed'",
        "'speaker_5': 'by Seattle Prep as part of this arrangement that Seattle Prep will assume the full cost of replacing this turf field in exchange for having priority access to the turf field from March 1st through June 15th annually during peak times for their sporting events and at other additional times as fits their schedule of athletic activities.'",
        "'speaker_5': 'In exchange further for that deal, and this is one of the more different terms from the previous decade of having this arrangement. Seattle Prep will provide a minimum of 50 public service annual public service hours per year, with the goal of helping to fill gaps in community offerings in the Montlake neighborhood and beyond, and facilitate, particularly programing'",
        "'speaker_5': 'to include the creation of lacrosse programs for middle school age children from lone families. Partnering with Montlake Community Center to provide tutoring services by Seattle Prep Students Assisting Northwest Child, a program dedicated to supporting people with disabilities and providing recreation opportunities for students.'",
        "'speaker_5': 'We had a fairly lengthy back and forth about the details of this of this deal and also the extent to which this is a more unique arrangement at this location and with this particular partner or whether it portends.'",
        "'speaker_5': 'Broader policy direction and decision by Seattle Parks and Recreation. I know Councilmember Morales has submitted some questions to Parks. I don't believe we've had a response for some of those inquiries yet, but I support getting a report back on those questions from the department as we go forward in pursuing these kinds of partnerships about the maintenance, replacement'",
        "'speaker_5': 'and activation of our public spaces. The Committee did ultimately report this bill out unanimously with an abstention from Councilmember Morales. Given that there there is no. Significant increase in concession from the city in this agreement relative to the previous shared use agreement.'",
        "'speaker_5': 'But there is an increased amount of benefit in Seattle providing 50 public service hours annually, which is the. From what I understand, from talking to parks and from the committee. The only new term relative to the last time the city entered into this agreement.'",
        "'speaker_5': 'So given that the committee does recommend passage of this and I don't have any other opening comments.'",
        "'speaker_0': 'Because we're lost. Can I ask you a question? When was the when was the other agreement? And I'm starting to remember this one. Was this after two states after 2016?'",
        "'speaker_5': 'I believe that the initial agreement council president was longer ago because this is at the time we are now replacing the turf field from its its 12 years of useful life. I think it was 2011.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So I believe yeah, but another turf field that we did one of these concession agreements and a good job getting the public benefits piece in there because that's something that we worked on.'",
        "'speaker_5': 'So yes, you may be thinking council president about, I believe, a similar arrangement in the South Park neighborhood. Yes. Was done in the past decade that that is similar but with different parties.'",
        "'speaker_0': 'Right. Thank you. Are there any other comments from my colleagues before I ask Casper relevant. If you a council president and I thank you for the report. Councilmember Lewis, as Councilmember Lewis indicated, I did send some questions. I had I had a lot of questions in committee and sent some follow up questions.'",
        "'speaker_0': 'My questions are really rooted in the concerns that I hear from my constituents about the lack of access to neighborhood parks and to play fields for neighborhood children and the exclusive nature of the use of these in exchange, the exclusive use.'",
        "'speaker_1': 'Sort of.'",
        "'speaker_0': 'You know, peak after school hours for for students. So I did send some follow up questions to the Parks Department regarding the public benefit for use of our parks by private institutions. I haven't received those responses yet, but I have asked similar questions and have been asking for the last two years about these agreements that we have'",
        "'speaker_0': 'with private entities. Candidly, with the with the budget shortfall, the upcoming parks funding deliberations. I think it's important that we put a real intentional equity lens on our funding priorities. And I just feel at this point, without sufficient information on how this benefits diverse and low income communities, this is not something that I can support right now'",
        "'speaker_0': '. So I will be voting.'",
        "'speaker_1': 'No today.'",
        "'speaker_0': 'If you customers want.'",
        "'speaker_6': 'Thank you, Dr. President. Whereas I will also be voting no on this contract in addition to the comments made by Councilmember Morales. I just wanted to add that our parks are a treasured public resource that should be available for all.'",
        "'speaker_6': 'This contract gives a private school exclusive use of the play field for a substantial part of the day, which unfortunately means that it will be unavailable during those hours for anyone else, such as students from Seattle Public Schools.'",
        "'speaker_6': 'New Astroturf on the play field is no doubt a real benefit. However, I do not think that outweighs losing public control of the space for so much of the day. So for that reason, and addition to the reasons already stated, I will.'",
        "'speaker_1': 'Be voting no. Thank you.'",
        "'speaker_0': 'Councilor Silent. Are there any other comments before I hand it off to Councilmember Lewis, too? Oh, yes, we're in Nelson. No. Okay. Councilmember Lewis, do you have any closing comments before we go to a vote?'",
        "'speaker_5': 'I'll stand by my initial remarks and cueing this up. Council president and we can move on to the vote.'",
        "'speaker_0': 'Okay. I'm going to support this as a former chair of parks and for six years in the MPD and talking to Councilmember Lewis. These these concession agreements are pretty straightforward. And we do require and I know for a fact, in the last six years, particularly the first six months that I chaired, that we bolstered up the huge'",
        "'speaker_0': 'public benefits piece. And, of course, the race, race and social justice initiative analysis is a big part of that. And there was some push back in the beginning, but eventually Parks and some of our other groups came to realize that.'",
        "'speaker_0': 'I think you saw this when we did the Woodland Park Zoo contract that we really needed to see what is the public benefit to allowing a private the private sector to use the public benefit? And even if it is a private school, these are still young folks in our city wanting to participate.'",
        "'speaker_0': 'And sometimes it's basically that's the only park that's there. So I'm going to go ahead and be supporting this because I understand the work that Councilmember Lewis had to do after doing it for six years to move these things forward.'",
        "'speaker_0': 'So with that, I'll be supporting that. But there any other comments before we move to a vote? All right. Not seeing any madam clip. You please call the role.'",
        "'speaker_1': 'Councilmember Nelson, I. Councilmember Peterson by Councilmember Salant No. Councilmember Lewis. Yes. Councilmember Morales No. Council President or us.'",
        "'speaker_0': 'I foreign favor to oppose you, Madam Clerk. The bill passes. The chair will sign it. And Madam Clinton's.'",
        "'speaker_1': 'Excuse me. Councilmember President. Council president was. I believe we may need five votes for a council bill. It's very possible that one did not pass at this particular point in time.'",
        "'speaker_0': 'Okay, so the. So what? Let's say we had two no's and.'",
        "'speaker_1': 'And some lessons and I have to check the charter. But I believe we need to find council members in favor of a council bill. And then I will also follow up with what to do after this.'",
        "'speaker_0': 'Okay. So what should we do? I'm concerned about putting it on the record that it failed. If we have to come back, if we're not sure on the actual rules. Can we? Is there a way that I can take this with Council Member Lewis's permission and move this over to next week till we have some confirmation on'",
        "'speaker_0': 'the particular procedural rules? I would rather do that than accept the vote as it is right now, because I did not know that. And I don't know if Council member Lewis did that. Can we do that?'",
        "'speaker_1': 'Yes. I mean, we can bring it back to the next council meeting without any further action.'",
        "'speaker_0': 'Councilor Lewis, is that okay with you? If we can move this over to June 28th?'",
        "'speaker_5': 'No objection from me. Councilmembers.'",
        "'speaker_0': 'Okay. So what we will do then is we will take item number six and till we get some clarification on the clerk's on how many votes we need to pass this or passes or fails, and we'll move this to June 28th, which is a Tuesday, and we'll bring it back then.'",
        "'speaker_0': 'And then, Madam Clerk, you can advise us and Mr. Casseroles can share with us any additional information about that.'",
        "'speaker_1': 'Yes. Thank you. Council President.'",
        "'speaker_0': 'Yes, thank you. All right. So after that, let's move on. On our agenda, items removed from the concert calendar. There were no items removed. The consent calendar, adoption of other resolutions. There are no other resolutions to be adopted under way.'",
        "'speaker_0': 'Other business. If there's no objection, Councilor referral is excused from today's council meeting. It's forward with that. And then right now we will go to let's see, I am not adjourning yet. We're going to go into executive session.'"
    ]
}