{
    "Emergency Budget Amendments for COVID-19 Response.": [
        "'speaker_1': 'Agenda Item one Capital 119 781 relating to the city's response to the 2020 COVID 19 crisis 26,000, which is the 2020 budget appropriations to various departments and budget control levels and from various funds in the budget. Declaring an emergency and establishing an effective date for the City Council.'",
        "'speaker_0': 'Thank you, Madam Park. I moved to pass Council Bill 119791. Is there a second? Second? It's been moved and seconded to pass the bill. Councilmember Mosqueda, you are the sponsor of the bill and we'll hand it over to you to address this particular bill.'",
        "'speaker_0': 'Thank you, Council President. Thank you. Council colleagues. As you have heard from me over the last week or so, we have worked to put some language together in Council Bill 119783 as a follow up to the legislation that we passed.'",
        "'speaker_0': 'I'm sorry. As a follow up to legislation. We passed on May 4th, which was Constable 119783. The bill in front of us counts about 119791. Make sure that we move forward on accepting and appropriating federal and state funding related to COVID 19 pandemic crisis in response, including CARES Act funding.'",
        "'speaker_0': 'This allows for us to allocate the remaining $1.4 million of CDBG funds through this substitute. This allows for us to make sure that the CDBG funds are being spent, ideally on policies that help with densification and redistribution of individuals who are currently in our shelter system.'",
        "'speaker_0': 'Among a number of other strategies to help make sure that people have appropriate housing and shelter to respond to the COVID crisis. We know that $1.4 million is not a ton of money. Our hope is that this is a down payment on the densification and redistribution efforts to initiate future policy discussions and funding to come from future'",
        "'speaker_0': 'conversations with the department and the mayor's office so that we can all work towards reducing even further congregate, shelter setting numbers. We know that the congregate shelters are not really considered a safe space, especially given the high risk of individuals in those shelters due to underlying health conditions and their age, which we know is critical for people'",
        "'speaker_0': 'to have the appropriate public health response. While the 1.4 that we're allocating today to date, that's vacation and redistribution doesn't specifically talk about individual rooms or hotels, I think that this will be a nice complement to future conversations and future investments that we hope to see over the next week or two when we look at additional federal'",
        "'speaker_0': 'dollars. Again, our hope is that this of 1.4 million, in combination with future dollars from the executive and the CBO that they're evaluating right now, will help us identify additional funds that can be used for frontline homeless service providers.'",
        "'speaker_0': 'We've talked a lot about mounting costs to support COVID related response, including the need for additional pay for staff, PPE, cleaning food services and other services as we try to serve this very vulnerable population. The good news is that in addition to the funding that we already approved in the last bill, we have learned that $130 million'",
        "'speaker_0': 'from the Corona Relief Fund can also be used for a comprehensive strategy to meet both the needs for densification and can be used for rental assistance. So it's really important for us to look at the holistic picture as these dollars come forward over the next week and make sure that we're doing both and both rental assistance to'",
        "'speaker_0': 'prevent folks from falling into homelessness and also to respond to the public health crisis and to move towards additional densification and redistribution strategies. To date, we are aware that there's conversations happening between homeless service providers and departments and the mayor and the mayor's office.'",
        "'speaker_0': 'So we appreciate that. We look forward to future conversations about the additional staff cleaning food services and housing options. And today, again, while this is not a ton of money, the $1.4 million, I think, does signal our interest in adding additional support to the densification redistribution.'",
        "'speaker_0': 'Even if we're not directing it towards individual rooms, we have, I think, a joint interest and expressed a shared a shared interest in moving forward on that public health strategy and hoping to have future conversations about this with the next round of funding.'",
        "'speaker_0': 'Very happy to have learned that the 130 million from the CRF walk run relief fund can also be used for rental assistance. So colleagues, I know that was a question earlier and we will have more opportunities to allocate additional funding as well as efforts around identification and redistribution in our future funds.'",
        "'speaker_0': 'Thank you all for hopefully your support as we get 1.4 million out the door to quickly deploys as much funding as we possibly can for this critical population. It's not a ton of money, as we talked about, but it will make an important downpayment and signal our interest in future conversations.'",
        "'speaker_0': 'Thank you so much. I thank you, Councilmember Mesquita, for those remarks. Are there any other comments on the bill? Councilmember Herbold, the floor is yours. You're right. I did. You recognize me? I did. I did recognize you. You broke up this time for me.'",
        "'speaker_0': 'Sorry. Sorry. I'm your friend. Well, I appreciate it. Thank you so much. I just want to, again, as I did this morning, flag my concern. I'm going to vote in favor of this legislation, although to be very honest, I'm not sure I understand it.'",
        "'speaker_0': 'We originally signaled by amending the previous bill and taking this money out of of the rent assistance, its use as a way to try to leverage some discussions with the mayor's office to ensure that they would embrace a different model of the intensification of shelters, a model that does not rely on a congregate care model, but instead'",
        "'speaker_0': 'moves to individual rooms. These are the safest settings for both staff and clients. This legislation does not make that distinction, and I understand why. It's because the executive hasn't embraced this as a priority to support for its specific dis intensification goals.'",
        "'speaker_0': 'Nevertheless, if without having accomplished that, I'm not sure why we are moving this money away from rental assistance to to address the increased cost of shelter providers for providing service and for their staffing needs. I recognize that there are those increased costs.'",
        "'speaker_0': 'We have future pieces of legislation that can help fund the increased costs associated with shelter, as well as the increased needs of of rent assistance. Though and I appreciate that Budget Director Noble has proposed a path forward where we can swap some funds in a future piece of legislation.'",
        "'speaker_0': 'But it just it seems very unnecessary to to do that, given the fact that we could have just. Voted to put the money where it was originally proposed to be put and then subsequently fund the needs associated with the intensification of of shelter and their increased costs.'",
        "'speaker_0': 'I want to recognize that just in general, I have concerns about putting off rental assistance relief. There were 9000 applications received by United Way of King County over a period of 48 hours, and only 2000 households received assistance.'",
        "'speaker_0': 'And it's really important.'",
        "'speaker_1': 'To note that at.'",
        "'speaker_0': 'United Way of King County is able to provide rental assistance regardless of documentation of immigration status. So it's a very rare source of support for this population. I do recognize that we are going to hopefully be able to make what were the proposed efforts to to fully fund the rental assistance needs in the previous legislation, that there'",
        "'speaker_0': 'is a commitment to make those whole in a subsequent piece of legislation. But just am puzzled as to why we why we are taking this action, given the fact that there is there is more flexible funds available in in the next week or two to address the shelter needs.'",
        "'speaker_0': 'So I'm going to provide a customer mosquito sponsor of the bill an opportunity to respond. So councilmember mosquito handed over to you. Thank you. Council President and I want to underscore I share Councilmember Herbold frustration that we have not received confirmation that densification will include individual rooms.'",
        "'speaker_0': 'Obviously, this is a policy difference of opinion that we have with the executive right now. I will say this, the reason that I think it's important that we are putting forward the legislation and held back the 1.4 is that some leverage has already been accomplished.'",
        "'speaker_0': 'We know that there has been conversations over the last week and a half that have led to us having some that have led to the executive and the departments having conversations directly with homeless service providers prior to when this bill was originally sent down.'",
        "'speaker_0': 'There were new conversations that have been reported to us. We had heard from a number of homeless service providers that they had serious concerns about the policies being advanced without sort of checking in to see what the lay of the land was on the ground.'",
        "'speaker_0': 'Those conversations have happened. You're correct that there is still a policy difference of opinion on individual realms, which I think you and I and the CDC would argue is a good public health strategy. However, I think that when we look at the language in front of us, it does not preclude individual rooms.'",
        "'speaker_0': 'It offers it as part of the solution. And we know that in conversations with the CBO and others, they are considering an array of ways to do that. I wish that it was all going into individual rooms, but here's I think the reality that we're faced with.'",
        "'speaker_0': 'We know that there's 130 million from the Corona Relief Fund that we have now identified can also be used for rental assistance, because that wasn't the case when the bill was introduced and there was a real fear that there wouldn't be those flexible dollars to be used for rental assistance in the future.'",
        "'speaker_0': 'We had a lot of pressure to get all the money out the door for rental assistance. We held back the $1.4 million, though, with the desire for a leverage, but B, to make sure that the folks who are currently in shelters do see some form of de densification or de intensification that could include hotel rooms, but it'",
        "'speaker_0': 'could also include a number of other strategies that they say that they're working on right now. We know there's about 500 people who are currently in congregate shelters who need densification strategies. I think by putting forward this piece of legislation and continuing to work to amplify our call for individual rooms, and I definitely want to underscore my'",
        "'speaker_0': 'support for that as a long time proponent of that strategy. Part of the reason that we had gone down this path is to try to urge the 1.4 million to be used for hotel rooms. That is still not a ton of money, but I think putting it forward does signal our interest in that policy discussion, and it'",
        "'speaker_0': 'also doesn't necessarily hold back the funds that could be used for helping the 500 people that are currently in shelters who need some level of identification. Also, I'll say about the rental assistance and small businesses piece were included in the initial policy that passed.'",
        "'speaker_0': 'So there was funding that went out. We understand that there's going to be additional funding from the dollars that do come from the executive office here soon. And we'll have the opportunity to ask whether or not that's enough rental assistance or whether it's enough assistance for folks to get out of congregate shelter services in the future.'",
        "'speaker_0': 'But I think the answer to the why now is we have 1.4 million. We also know that that's a drop in the bucket of what's needed for both rental assistance and for what is needed for the intensification. Since we already put money forward in this last bill for rental assistance and we know now that there's more money'",
        "'speaker_0': 'coming from the broader relief fund that we can use for rental assistance. My hope was to put the 1.4 million forward to allocate it for an array of D intensification services to really signal our interest to councils, interest in seeing those funds go into place now to help with whomever we can with the 500 individuals who need'",
        "'speaker_0': 'assistance immediately and that we complement those funds with future dollars. I don't think the you know, the leverage has obviously been a release. I think it's definitely initiated conversations that hadn't happened prior. And I appreciate, I think, our joint interest in both the intensification and rental assistance.'",
        "'speaker_0': 'This effort, I think, allows for both those policies to move forward in a complementary way. Add to that. Any other comments on the bill, colleagues? Okay. Seen no other comments on the bill. I'm going to go ahead and ask that the clerk please call the roll on the passage of the bill.'",
        "'speaker_0': 'Herbold, I.'",
        "'speaker_1': 'Juarez. I. Is I? Morale is high. Let's get her. I. Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So i. I.'",
        "'speaker_3': 'Drought high.'",
        "'speaker_1': 'President Gonzales.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Not in favor, not opposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it and I the to fix my signature to the legislation on my behalf. We're not going to move to agenda items two and three, and I'd ask that the clerk please read both items two and three into the record.'"
    ],
    "Unit Lot Subdivision of Pinehurst Land, LP, at 12522 15th Avenue Northeast.": [
        "'speaker_1': 'Agenda. Item two quick follow 314426 Full unit lot subdivision of Pinehurst Land LP two Subdivide one parcel 31 Unit lot at 25 two 2/15 Avenue Northeast. Item three Capital 119 790 Proving and confirming the Plaza North Line Townhomes and the portions of Southwest Quarter and Southwest quarter of Section 21, township 26, North Range four, East W.'",
        "'speaker_0': 'M and King.'",
        "'speaker_1': 'County, Washington.'",
        "'speaker_0': 'I think it's so much more stressful. If items two and three were read into the record. We will take separate votes on each item and before we move each item, would you like to address items?'",
        "'speaker_3': 'Yes. Thank you. Council President. The clerk file on Associated Counts Bill will grant a final approval for the Northpoint Townhomes plot one at 120 1252 215 tapping northeastern May Pinehurst neighborhood as described by the council clerk. The plat will divide one person to 31 units to facilitate the sale of these townhomes.'",
        "'speaker_3': 'Last year, the SDI director and hearing examiner recommended approval of the preliminary subdivision. Council's role now is to determine if the applicant has met all of the requirements for the final approval in Stsci. As the council's central staff have all confirmed to me that those requirements have been met and recommend approval to date.'",
        "'speaker_0': 'Thank you so much. And I want to make sure that you address both items.'",
        "'speaker_3': 'The I use those comments to address both items. The item three is the Associated Counsel bill for the North Line Townhomes, plot approval. And all of the information I've just presented is consistent with both files.'",
        "'speaker_0': 'Great. Thank you so much. I appreciate that. Are there any additional comments on items two or three? Okay. Hearing that I will move that quick file 314, four, two, six. Be placed on file. Is there a second can.'",
        "'speaker_0': 'It's been moved in second into place. The clerk file on file. Are there any additional comments on the quick file. Hearing on the court. Please call the roll on the placing of the clerk file on file.'",
        "'speaker_1': 'Personally, I. Whereas I. Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Morale is high. Let's get to.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson. So on, I.'",
        "'speaker_3': 'That's right.'",
        "'speaker_1': 'President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Vote in favor and then oppose.'",
        "'speaker_0': 'The motion carries in the court. File is placed on file. I will now move to pass counsel for 119790. Is there a second second? It's been moved and seconded to pass the bill. And are there any additional comments on the bill?'",
        "'speaker_0': 'He hearing none. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Herbal.'",
        "'speaker_0': 'Purple. I.'",
        "'speaker_1': 'Suarez. I. Lewis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Morales, I. Let's get to.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'The one. I. Strauss.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'President Gonzales.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor, none opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. And the clerk please affix my signature to the legislation on my behalf. We will now move to adoption of other resolutions. New item number four. Will the court please read item four into the record?'"
    ],
    "Request for Governor Inslee to create a \"Washington Worker Relief Fund\" for undocumented residents.": [
        "'speaker_1': 'Agenda item for Resolution 319 46 relating to the response to the COVID 19 public health emergency, requesting that Governor Inslee create a Washington worker relief fund to provide economic assistance to undocumented Washingtonians during the.'",
        "'speaker_0': 'COVID 19 pandemic. Am I moved to adopt resolution 31946? Second, it's been moved and seconded to adopt Resolution 31946 and colleagues as the lead sponsor of this legislation. I'll just make some quick Internet, hopefully some quick remarks about this particular bill.'",
        "'speaker_0': 'So COVID 19 relief granted by the federal government has not been accessible for many in the immigrant community. As we have often heard, unemployment insurance as currently run by our state also requires a Social Security number, which means many are left without the benefits they have paid into.'",
        "'speaker_0': 'We are hearing many households from many households who have been left without income or any resources for months now. Immigrant workers were among the first wave to be laid off when this pandemic hit. Immigrant leaders and communities from across the state have been organizing and are calling for quick action by state leadership.'",
        "'speaker_0': 'There are two calls to action. First, on this list, calls on Governor Inslee to create a Washington worker relief fund. Leaders are calling for $100 million to be allocated to community based organizations to deliver emergency assistance to undocumented Washingtonians.'",
        "'speaker_0': 'Second, our immigrant community is asking for Governor Inslee to work with the four corners of our state legislature to address the systemic failure of unemployment, to provide wage replacement for undocumented workers who again pay taxes and pay into a system they cannot benefit from when they need it most.'",
        "'speaker_0': 'These are important state interventions that will help many households not fall into abject poverty or have to make decisions that exponentially increase their exposure to infection of the coronavirus. We are seeing massive racial disparities of how this virus is impacting different communities.'",
        "'speaker_0': 'It is heartbreaking to read in the Seattle Times disproportionality of population to coronavirus infection and COVID 19 mortality rates. Earlier this month, the Seattle Times reported that Washington State's Black Latinxs and Pacific Islander Native Hawaiian communities have been hit at significantly higher rates in King County.'",
        "'speaker_0': 'Lennox Communities are seeing infection hospitalization rates at four times the rate of white people for COVID 19, even though they are only 10% of King County's population. The trend is bearing out as well in Illinois, Los Angeles, Philadelphia, the Bay Area, as well as New York City, where it is black and Latinx communities who have been hit'",
        "'speaker_0': 'the hardest. Native Hawaiian Pacific Islander communities have also been severely impacted. They are also seeing infection rates at four times that of white populations in King County. These infection rates are impacting the same communities and zip codes that have many barriers to economic opportunity and stability.'",
        "'speaker_0': 'This resolution today is one way to stand with immigrant communities. This call to action by community for a statewide Washington worker relief fund must be part of our state's COVID 19 response and recovery. Earlier this month, I transmitted a letter to Governor Inslee asking for consideration of this fund.'",
        "'speaker_0': 'In addition to a number of other strategies to meet the needs of our immigrant friends, family and neighbors, including those that are undocumented. There is perhaps no more important time colleagues than now to really step up on behalf of immigrants and refugees, but in particular of those who are undocumented.'",
        "'speaker_0': 'These folks have been deemed pretty much by every single declaration and proclamation as being essential workers, yet they don't seem to be essential enough to access basic benefits when needed. And and now is the time for us to make sure that we are giving voice to these needs.'",
        "'speaker_0': 'Voice to many individuals who cannot use their own voice for fear of retaliation as a result of their undocumented status. So I hope that you all will support me today. I know that you will and that you have in the past.'",
        "'speaker_0': 'And I want to give a special thank you to One America, the Northwest Immigrant Rights Project, Washington Immigrant Solidarity Network, the Latino Community Fund, and Ramos and so many others who are leading this work and have always led on this work by centering the voices of those who are undocumented in the struggle for ongoing relief for this'",
        "'speaker_0': 'community. So with that being said, I am happy to advance this resolution and look forward to your support on it as well and will end my comments there and see if anyone else has any comments on the resolution before we collect Councilman Mosquito.'",
        "'speaker_0': 'Thank you, Council President. Thank you for your leadership on this. We're pleased to partner with you to advance this. Really want to underscore the importance of how the crisis is disproportionately impacting communities of color, especially the refugee and immigrant community.'",
        "'speaker_0': 'We know the consequences of the immigrant refugee community and people of color being left out historically from a national policy and state policy. And often that's where the city of Seattle has stepped in to provide immediate relief. Given the crisis and the magnitude of the COVID public health crisis and the economic consequences it's created for immigrants and'",
        "'speaker_0': 'refugees. I think that this is a critically important fund that's been. Requested, and we join with you and the community in demanding that there be solutions for the population. And that's yet again been left out from these federal assistance dollars.'",
        "'speaker_0': 'You heard the public comment today largely focused on both the relief fund and the need for sick and safely, especially for populations that may be working in sort of the gray economy or the gig economy, which is no longer a segment of the economy.'",
        "'speaker_0': 'It's just the economy as we think about relief that needs to be provided. I think the same is true for the emergency fund. These are workers that are in every sector of our economy who've been historically left out and have yet again been left out of these essential funds as we not just respond, but try to survive'",
        "'speaker_0': 'the initial impact of the crisis. So I think I think the community for the work that they have done and really appreciate the work that you've done to bring forward this resolution to council to show that we are a welcoming state, we are a welcoming city.'",
        "'speaker_0': 'We advocate to fill the gaps that have been created from the state and the federal level and and really appreciate the community's courageous efforts to call attention to the need for this fund and all of their public testimony today.'",
        "'speaker_0': 'Thank you so much. Any other comments from my colleagues? Okay. Seeing and hearing. And then we will go ahead and vote on the resolution. So actually, I have an amendment first. So I will move to amend resolution 31946 as presented on Amendment one that was recently distributed.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Hey, it's been moved in, seconded to amend the resolution. Colleagues, Amendment one is very simple. It just adds the words state legislature to make sure that we acknowledge that, that this should be a collaborative effort among our state legislature and the governor in establishing a worker relief fund.'",
        "'speaker_0': 'So very simple resolution and excuse me, very simple amendment that I see is highly technical in a lot of in a lot of ways. So I'm happy to answer any questions on that particular moment, but it's pretty straightforward.'",
        "'speaker_0': 'So are there any comments on Amendment One? He's seen in here. And then I'd ask that the clerk call the roll on Amendment one.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'I. Suarez. All right. Lewis, I. Morale is high. Macheda.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So what I. Strauss.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'President Gonzalez, I. Nine in favoring unopposed.'",
        "'speaker_0': 'The motion carries and the amendment is adopted. Are there any further comments on the resolution as amended? Hearing on it. That's what the police call the role on the adoption of the resolution as amended.'",
        "'speaker_1': 'Herbal Juarez. I.'",
        "'speaker_2': 'Louis.'",
        "'speaker_1': 'I. Morales, I.'",
        "'speaker_0': 'Macheda I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So what I. Strauss.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'President Gonzales I nine in favor none opposed.'",
        "'speaker_0': 'The resolution is adopted as amended, and the chair will sign it and it ends with the clerk. Please affix my signature to the legislation. Thank you, everyone, for your support of that resolution. It will mean a lot to the immigrant refugee population who are so desperately seeking assistance in this space.'",
        "'speaker_0': 'I just want to thank you all for your unanimous support in that regard. Their business there is, I believe, two letters for consideration for signature this afternoon. The first one is from Councilmember Juarez, who described her letter regarding the South Dakota restrictions on tribal lands.'"
    ]
}