{
    "Support for a Truth and Healing Commission on Indian Boarding Schools.": [
        "'speaker_3': 'Agenda Item 39 Resolution 32018 Supporting the creation of the United States Truth and Healing Commission on Indian boarding schools and actions to address the Western harm of Indian boarding schools.'",
        "'speaker_0': 'Thank you so much. I move to adopt resolution 32018. Is there a second act? Excellent. It's been moved and seconded to adopt the resolution. It casmir was is the sponsor of this item. Some of the going to hand it over to her to address the item.'",
        "'speaker_3': 'Thank you. Council President again thank you so much for accommodating and by moving item 39 to item number one. I really appreciate it. Resolution 32018 Support Secretary Deb Hollins Truth and Healing Commission Regarding Indian Boarding Schools. This Commission would study and address ongoing impacts of the 1819 Civilization Fund Act.'",
        "'speaker_3': 'This federal policy passed by our Congress established Indian boarding schools for the sole purpose to forcibly remove American, Indian and Alaska Native children from their families to assimilate into white settlements. The Commission would lead investigative efforts of past, present and U.S. boarding schools, as well as identify services to respond to intergenerational trauma that families continue to face'",
        "'speaker_3': 'to this present day. The law states through education, therefore forced the removal, cultural genocide and emotional physical abuse of native children was protected under federal law. Back in 2019, then Congresswoman Haaland and Senator Warren introduced legislation to create a Truth and Healing Commission that addresses present day impacts of the 1819 Indian boarding school policy that forcibly removed'",
        "'speaker_3': 'Native American children from their families in order to assimilate them as what is now deemed a civilized society. Senator Warren and now Secretary, I'm sorry, Interior Secretary Deb Haaland continue to fight for this legislation as we all do.'",
        "'speaker_3': 'Research and advocacy on this topic is led by the Native American Boarding School Healing Coalition, and our office have been working closely with them, as well as local tribes there. These are national leaders, organizations, tribal governments and policy folks behind this federal legislation to support ongoing efforts at the federal level.'",
        "'speaker_3': 'I have with me today a resolution that outlines specific measures of the Truth and Healing Commission that the city must support. We hope that the city will support any knowledge. Today, the commission will investigate boarding schools across the country and address the intergenerational trauma that forced removal that the forced removal has had on indigenous balance to this'",
        "'speaker_3': 'day, as I shared with you all this morning as well, last week, the mayor's office informed us that their intent is to support this legislation and sign this resolution. Council President I respectfully ask and recommend that my colleagues in this Council adopt this resolution.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Guns were wars. Are there any additional comments on the resolution? Hearing none will a quick please kolawole on the adoption of the resolution.'",
        "'speaker_1': 'Scatter. I. Peterson.'",
        "'speaker_2': 'I. Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Suarez.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'And Council President Gonzalez high seven in favor nine opposed.'",
        "'speaker_0': 'The motion carries and the resolution is adopted. The chair will sign it will the piece of fix my signature to the legislation on my behalf? Leclerc, please read item one into the record.'"
    ],
    "Extension Request for Surveillance Technology Reports by City Auditor.": [
        "'speaker_3': 'Agenda Item one quick vote 314482. Office of City Auditor Request for an extension for filing a report relating to Serial Department of Transportation, surveillance technology usage and license plate reader technology. And the report on closed circuit television. Traffic Cameras.'",
        "'speaker_3': 'Technology.'",
        "'speaker_0': 'I moved to approve clerk file 314482 Is there a second second? It's been moved in to approve the clerk file and to hand it over to Councilmember Peterson, who is the sponsor of the quick file.'",
        "'speaker_2': 'As a council president. Our city's Transportation Utilities Committee has three clerk files on today's agenda, all related to technology. Clerk files 314 40 2483 and 484. These clerk files accept the updated schedules for our Seattle Information Technology Department and from our city auditor to give them the time needed to finish the review of various surveillance technologies.'",
        "'speaker_2': 'The theme here is the need to provide more time due to delays lingering from the COVID pandemic. A Seattle and our city auditor already provided advance notice to us about the need for these extensions. And these three clerk files were on the Introduction Calendar, published online August six.'",
        "'speaker_2': 'This first clerk filed 314 42 is the request from our city auditor for more time for just two technologies from our Seattle Department of Transportation, the license plate readers, and the closed circuit cameras that assist with traffic management.'",
        "'speaker_2': 'This is justified because our city auditor's office has been short staffed this past year, and they recently completed similar reports on the same two transportation technologies. I concur with our city auditor's extension request and ask my colleagues to approve it by accepting this third file.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember Peterson, are there any additional comments on the quick file? Hearing no additional comments. Please call a vote on the approval of the clerk file.'",
        "'speaker_1': 'Russ Heather, I. Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Suarez I.'",
        "'speaker_2': 'Lewis yes.'",
        "'speaker_1': 'And Council President Gonzalez.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Seven in favor and unopposed.'",
        "'speaker_0': 'The motion carries and the quick file is approved. Will the clerk please read item two into the record?'"
    ],
    "Extension Request for Group 4 Surveillance Impact Report.": [
        "'speaker_3': 'Agenda item two quick file 314483. Seattle Information and Technology Department request for a six month extension for the filing of the Surveillance Impact Report due on September 1st, 2021.'",
        "'speaker_0': 'Thank you so much. I move to approve Kirk file 314483. Is there a second?'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded to approve the quick file on the handing back over to Councilwoman Pierson.'",
        "'speaker_2': 'Thank you, council president. This is the second of the three files related to technology. This clerk file 314483 provides a brief extension to our Seattle Information Technology Department for finishing the thorough review of various surveillance technologies pursuant to our city's surveillance technology ordinance.'",
        "'speaker_2': 'Essentially, Seattle. It needs more time due to delays lingering from the COVID pandemic. The good news is that we've already made substantial progress during the past year reviewing, amending and approving two batches of technology reports what we called Group two and Group three, which covered 12 technologies.'",
        "'speaker_2': 'So this clerk file provides a few more months for the remaining batch. When we had approved a previous six month extension Seattle, it provided notice that they might need a few more months, but we decided to approve extensions only in six month increments, so this extension will give their thorough process a few more months.'",
        "'speaker_2': 'This is also related to the next clerk file, which will divide group four into two groups for a and four piece that are easier to review. One of the technologies that has attracted interest is the Traffic Management Tracking Card, a second term that's currently examining the possibility of discontinuing the use of a single car, but will still'",
        "'speaker_2': 'plan to have a stop. Provide a status update on that technology at our September 15 Transportation Utilities Committee. So again, this clerk file will be approving a few months extension for Seattle to finish the next batch.'",
        "'speaker_0': 'Thank you so much. PETERSON Are there any additional comments on the quick file? Sharing them with the. Please call the vote on the approval of the quick file.'",
        "'speaker_1': 'Ms.. Gather I. Pietersen.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Suarez. Lewis. Yes. And Council President Gonzalez. i7a favor and unopposed emotion carries.'",
        "'speaker_0': 'The court file is approved. Will the clerk please read item three into the record?'"
    ],
    "Ban on Less Lethal Weapons for Seattle Police Department.": [
        "'speaker_3': 'Report of the Public Safety and Human Services Committee Agenda Item six Council Bill 120105 relating to the Seattle Police Department banning the ownership, purchase, rent, storage or use of less lethal weapons and amended sections 3.20 8.1, four and six of the Seattle Municipal Code.'",
        "'speaker_3': 'The committee recommends the bill pass as amended.'",
        "'speaker_0': 'Thank you so much. Councilmember Herbold, you are the chair of the committee, so I'm going to hand it over to you to provide this report.'",
        "'speaker_4': 'Thank you so much. So much of what I'm going to say now is a repeat of this morning's comments. But for the public record and the viewing public, just want to go through the background and the the outcomes of this of our many months policy discussion around the ordinance that amendments to the ordinance that the Council passed'",
        "'speaker_4': 'back in June. So as context, there are currently no restrictions in the Seattle Municipal Code on the use of less lethal weapons. The Public Safety and Human Services Committee voted for one asset at our meeting on July 13th.'",
        "'speaker_4': 'At that time, I moved to hold it so that we would not hear it in full council until after the consent decree status conference that occurred last week. We wanted to make sure that in case the court weighed in at that status conference, that we would be informed by by the discussion happening at the status conference.'",
        "'speaker_4': 'The Court had no comment on the legislation in the status conference. And so I'm looking forward to our discussion and vote on it today. The legislation itself includes a full ban on acoustic weapons, directed energy weapons, blast balls, ultrasonic cannons and water cannons.'",
        "'speaker_4': 'The use of noise. Flash devices, otherwise known as flash bangs, are banned in demonstrations. The bill conditions, the use of pepper spray and pepper ball launchers on instances when the risk of serious bodily injury from violent actions outweighs the risk of harm to bystanders and separately from the conditions on pepper spray and pepper ball launchers.'",
        "'speaker_4': 'Tear gas is used allowed in even more narrow circumstances. The legislation does not regulate the use of non chemical launchers, for instance, beanbag rubber bullets, blue tip launchers. And so the there is there is no regulation in the code as relates to the use of those particular type of less lethal weapons.'",
        "'speaker_4': 'And that's important for folks who have raised questions about what less lethal weapons are available in instances where there is a threat of property damage. When we were in deliberations around this legislation, myself and Council President Gonzalez met with the consent decree monitor and the Department of Justice out of respect for the consent decree process and in'",
        "'speaker_4': 'with the objective of getting their feedback in advance of final cut council action. This was informal feedback to the formal consent decree process, which is yet to occur. The committee first did back in February after several months of discussion to recommend a draft bill that was used for those discussions.'",
        "'speaker_4': 'During the conversations about the draft bill, we heard from the Department of Justice concern that restricting the use of certain less lethal tools and of management circumstances could actually lead to officers using higher levels of force, putting both assault of protesters and the surrounding nonviolent protesters both at higher risk of harm.'",
        "'speaker_4': 'Judge Robert expressed similar concerns. The DOJ likewise inquired as to whether the draft bill allowed for relevant CPD officers to be trained in changes to policy again to avoid the unwanted impact of having untrained officers resort higher levels of force than necessary.'",
        "'speaker_4': 'This was an issue that Judge Robert also raised. So by submitting the draft legislation for this informal review. Receiving this kind of feedback. It allowed us to make further amendments to the legislation before the legislation itself was referred.'",
        "'speaker_4': 'And in order to help address those concerns, the Council, the legislation added a definition of a control and provided 60 days to allow for training. After the court approved the legislation. Another update after hearing back from the the the monitor and the Department of Justice was to make clear that in narrow circumstances as it relates to pepper'",
        "'speaker_4': 'ball launchers, that they they can't be used for the purpose of crowd control. But if there is a large group of people and the purpose isn't crowd control, but it's the risk of avoiding serious bodily injury from violent actions and that outweighs the risk of harm to bystanders.'",
        "'speaker_4': 'So again, the purpose isn't to move people, but is intended to to mitigate or limit the likelihood that somebody is seriously hurt in a crowd, that the pepper ball launchers are permitted. Again, it's not only is in response to feedback we've received through this informal review process, but it also recognizes that a district court ruling just very'",
        "'speaker_4': ', very recently specified that approved policies for the use of our pepper ball launchers. And Judge Roberts specifically authorized the use of pepper ball launches in late February as part of Speedy's Court manual mandated annual update to use of force policies.'",
        "'speaker_4': 'So given that just in February, Judge Robert approved the use of pepper ball launchers in this narrow, narrow circumstance, we can't very well. Ask him to review a new policy that revokes the allowance that he's just approved. Reminder that all started back in June of 2020, with the Council's unanimous adoption of legislation sponsored by Council member.'",
        "'speaker_4': 'The want and use of nearly all less lethal weapons and. The the response from the court was to almost immediately issue a restraining order on that bill in July of last year. And in its ruling, the court stated in the temporary restraining order that the legislation itself did not.'",
        "'speaker_4': 'Public safety. In August 2020, the CPC, the OIG and the EPA. A commented on the the legislation that the council passed. They sent us recommendations for how we might consider changing it. And we shared that feedback from our accountability partners in our committee that that feedback was also sent to Robert as well, because he also had requested'",
        "'speaker_4': 'that feedback. This bill has consumed much of the time and efforts of the Public Safety and Human Services Committee over the last year. We've discussed this policy, including roundtables with our accountability partners in seven separate Public Safety and Human Services Committee meetings since last September.'",
        "'speaker_4': 'While not perfect, my overall goal is to adopt the strongest legislation possible, building on the consensus recommendations of the three accountability bodies within the context of the consent decree. I just want to note that the CPC did write to the committee in support for the legislation, while noting their perspective that they believe more needs to be done'",
        "'speaker_4': '. They wrote to say. The Seattle Community Police Commission writes today to offer its Support Council Bill 12 0105. The Commission believes that the bill's inclusion of clear delineations of when less lethal weapons can and cannot be used and limitations on who can use them is a significant first step in ensuring the safety of community members when they'",
        "'speaker_4': 'engage in First Amendment protests. I've heard concerns in past committee meetings. Then we heard some of this today about the right of action contained in in the ordinance. And this is the right of action for members of the public to pursue what they perceive as violations of the ordinance.'",
        "'speaker_4': 'I want to be clear that the language in the ordinance allows the city to offer a firm, an affirmative defense that the violation did not occur. The language will not make anyone accused of a crime ineligible from using the right of action merely because they've been accused a crime.'",
        "'speaker_4': 'A person accused of a crime can file suit under the right of action. It is not accurate, as some have suggested, that if the affirmative defense was used, that the judgment of a reasonable person, a crime was committed, that the city, in order to prevail, would only have to prove that an officer said they thought a crime'",
        "'speaker_4': 'was committed. That is not the legal standard of the affirmative defense just closing out before calling for the vote. Just so folks understand what the the next steps are. If the legislation passes today, the Seattle Police Department will draft policy revisions that reflect the ordinance.'",
        "'speaker_4': 'They'll do so within 60 days provided by Section four of the bill. The DOJ and the Monitor would then review the policy revisions, and this is when their formal review under the consent decree takes place. Then the court would review the policy revision.'",
        "'speaker_4': 'And then finally, if the court approves the policy revision, the revised policies and substantive provisions of the bill will take effect as provided by Section five of the bill. So I really want to thank my colleagues on the Public Safety and Human Services Committee for sticking with this for many, many months and meetings and hours.'",
        "'speaker_4': 'Appreciate all of the engagement with our accountability partners throughout the process, as well as the feedback that we've received from the DOJ, the consent decree monitor and the general public who has come out to every single meeting where we've discussed this and given their feedback to the legislation.'",
        "'speaker_4': 'And I hope we can all count on your vote in favor of this legislation today. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Herbold. Are there any additional comments on the bill? Consumer redress, please.'",
        "'speaker_2': 'Thank you. Council president. Council member. Her. Well, I just have a couple of questions, mostly repeating back to you what I heard you just say to make sure that I got this clearly since I don't sit on your committee.'",
        "'speaker_2': 'This morning was my first real formal briefing from you on it, and just hearing that the court had no comment on these bills during last week's meeting, is that to be interpreted as they have no issues or is that to be interpreted as they may have issues, but they made no comment?'",
        "'speaker_4': 'The latter.'",
        "'speaker_2': 'That they may have issues.'",
        "'speaker_4': 'We held. We held the bill from being heard in full council. We delayed it because we thought that it might be a topic that the settlement conference was scheduled really without any information about what the topic was going to be.'",
        "'speaker_4': 'The OR we had some information about what the topics would be. We didn't know if it was going to include this. And so the settlement conference occurred. It was a quarterly settlement conference that the that the city regularly has.'",
        "'speaker_4': 'This did not come up as a topic.'",
        "'speaker_2': 'Okay. And I heard clearly that the city is in favor of this. Did the monitor or Judge Robert, have concerns that have not been addressed?'",
        "'speaker_4': 'So we'll find out whether or not there are concerns that have not been addressed when we go through the formal consent decree process. We have worked to address the concerns that were raised in the informal process.'",
        "'speaker_2': 'Thank you. And then the last question that I have is what I think I heard you say, just to put it very clearly focused, that after this has passed and before it goes into implementation, the DOJ and the Monitor will have time to review and decide what is implemented and what is not implemented.'",
        "'speaker_2': 'My question here is just ensuring that we're not at odds with the process and that we are in tandem. Is that a correct understanding?'",
        "'speaker_4': 'That is absolutely correct. Thank you, Councilmember Strauss.'",
        "'speaker_2': 'Thank you. Councilmember. Who will double them?'",
        "'speaker_0': 'Thank you, Councilmember Strauss, for those questions. And I do want to sort of emphasize, I've been participating with Councilmember Herbold in the background on many of these process related issues. And just want to emphasize my fervent belief that we have really done everything we can as a city council to protect the integrity of our legislative authority while'",
        "'speaker_0': 'also complying with what we think are legal obligations under the consent decree. And so don't think that I really do believe that moving forward on this legislation now is the next step in that process to allow us to enter the bill into the more formal review process.'",
        "'speaker_0': 'But I think we have done everything we can in the informal process to try to identify, suss out many of those issues that we think the court and the DOJ and the federal court monitor might have. And I think this is the next special step to allowing for perhaps a more official, fuller review of the bill.'",
        "'speaker_0': 'That doesn't mean that the bill that they won't identify additional concerns. But I think at this point, those concerns would be related to the policies as opposed to whether or not the council complied with the process. That's where most data.'",
        "'speaker_1': 'Thank you, Madam President. I just wanted to weigh in and say thank you to come from her role as chair of public safety or stewarding this conversation through. Also wanted to thank customers Salon who is not here today but I know has spoken to this issue many times.'",
        "'speaker_1': 'And I also heard Councilmember Herbold note their efforts, their leadership on this as well, who brought forward the legislation initially. I think all of us here today, by considering this legislation, are really showing that we think that this legislation in this amended form is an important component to making sure that we're moving our commitment to accountability forward'",
        "'speaker_1': 'and doing so in partnership with our accountability partners along the way. I think the importance of this legislation cannot be understated, especially as the memories of last year's response to the protests are still relatively fresh in many of our minds.'",
        "'speaker_1': 'We all remember the stories. We all remember the public testimony, the hours of calls that we received as people expressed their frustration and many times their surprise and shock about the response to the protests that were standing up in support of Black Lives.'",
        "'speaker_1': 'We also heard a number of reports, and this was covered in the press, as well as people calling our offices to note that members of the national press, legal observers, medics had been pepper sprayed or been hit by projectiles like glass balls and launchers.'",
        "'speaker_1': 'We saw video of a child being sprayed in our streets in downtown Seattle at short range in the face. And we heard the testimony of the father of a nine month old baby who was calling for an end to the days of the use of tear gas in our most dense neighborhood in Seattle on Capitol Hill.'",
        "'speaker_1': 'The father of a nine month old who had woken up to their baby foaming at the mouth, I think it's fair to say we believe that nobody deserves to be afraid of physical harm when doing their job, whether they're members of our officers, police officers or members of the press, medics, legal observers, everybody who was doing their'",
        "'speaker_1': 'job and also standing up to express their First Amendment right has a right to be safe. We also want to make sure that bystanders, like the many people who called in, are also free from harm and want to make sure that the tools that are used by our public officers are first prioritizing public safety.'",
        "'speaker_1': 'I think this legislation puts in force and put in place important side rails for how our police department interact with crowds and demonstrations. And I'm also hopeful that these policies can help de-escalate the response to make sure that it's not continuing to escalate when we see tools that are causing harm to folks.'",
        "'speaker_1': 'I look forward to voting yes on this legislation. And though it's been through a long process that was just summarized here today, I appreciate the hard work that's gone into this and the importance of this legislation today. Thank you for your work on it.'",
        "'speaker_0': 'Thank you so much. Service, get it? Are there any additional comments on the bill? So before I handed back over to because we were able to make final remarks, I also wanted to echo my gratitude to Councilmember Herbold as the chair of our Public Safety Committee.'",
        "'speaker_0': 'This has been a long and arduous process. I think it's been almost a year long process, if not just slightly, a little bit longer than that. And so I think I have a high level of confidence in the process that has been stewarded by Councilmember Herbold.'",
        "'speaker_0': 'And do you think that it is now time for us to coalesce behind this particular bill and to enter it into the formal process that is the review of the consent decree process, and to allow for there to be a final judgment of sorts on the policy choices that the City Council has determined are appropriate and that'",
        "'speaker_0': 'are reflected in this particular version of the Council bill, which is different than the first Council bill, which was subjected to a temporary restraining order and was in effect blocked from implementation. And so I think this is a good threading the needle and appreciate the good work of Councilmember Herbold.'",
        "'speaker_0': 'She managed to thank everyone else of the city. But but it's our responsibility to thank her for the good work that she's done on a very important issue with a lot of really tricky challenges and a lot of stakeholder engagement that needed to happen.'",
        "'speaker_0': 'So my thanks to you, Council, for all of your your good work. And I'll hand it back over to you for closing our debate so we can call this bill to a vote.'",
        "'speaker_4': 'Thank you very much. I did think a lot of the external stakeholders, but I would like also to close out with my appreciation for the many folks internal to the city who have been helping on this on this bill, including Lisa on council central staff, Noel in my office, Carol in the City Attorney's Office, as well as'",
        "'speaker_4': 'our own legal counsel that has been assisting us on this on this legislation as well. I know people have spent a lot of of hours, and really it's because I think we believe in the intent of the bill, which is to to create some travel restrictions where none currently exist, so that we can do everything that we'",
        "'speaker_4': 'can to ensure the safety of community members engaging in First Amendment protected protests. It's really important that we continue our work in this area protecting civil liberties during protests, but also recognizing that we are we are we are doing so within the context of the consent decree, as Council President Gonzales put it.'",
        "'speaker_4': 'It is it is a bit of a threading of the needle. But I do look forward to the next step in this process where we go into the formal policy review and having this legislation still, again, perhaps not as as broad as the legislation that we all voted in favor on in in June last year.'",
        "'speaker_4': 'But still, I think it's it is a historic effort for the city of Seattle to to to take this this this position, regulating these weapons in the goal of preserving civil liberties and the rights of folks to protest.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'All right. Thank you so much, Councilmember Herbold, for those closing remarks. Will Clark, please, for the role in the passage of the bill.'",
        "'speaker_1': 'Let's gather. I. Petersen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. S. Juarez. I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'In Council President Gonzalez. I. Seven a favor and and opposed.'",
        "'speaker_0': 'The bill passes material sign. It will fix my signature to the legislation on my behalf. Thank you so much. Everyone will please read item seven into the record.'"
    ],
    "Ordinance on Parking Enforcement and Position Transfers.": [
        "'speaker_3': 'Agenda Item seven Council Bill 120148 relating to parking enforcement and then the ordinance 126237, which adopted the 2021 budget, transferred positions of the Seattle Police Department in ratifying the ban for certain firearms. The committee recommends the bill as amended.'",
        "'speaker_0': 'Great. Thank you so much. Customer Burble. This one also comes from your committee. I'm going to hand it back over to you.'",
        "'speaker_4': 'Thank you so much. So just as a bit of background, last year during the budget process, the Council took budget actions and passed legislation expressing our intent of transferring both the parking enforcement officers in 911 dispatch out of the Seattle Police Department and into the new Community Safety and Communication Center.'",
        "'speaker_4': 'In May, we took the legislation up that would actually implement the the planned action from the the budget process the previous fall. At that time there was a divided workforce. The supervisors of the parking enforcement officers were interested in in moving to two star and they were are represented by protect and the parking enforcement officer rank and'",
        "'speaker_4': 'file was represented by IOG and they wanted to go to the Community Safety and Communication Center because there was this division among among workers and also among management. The the executive was also very interested in the pillows going to to store it, as were several council members.'",
        "'speaker_4': 'We amended that legislation and just transferred the nine or one dispatch to the Community Safety Communication Center. And we included a proviso extension to allow us to continue to have the conversation and make sure that the pillows were continuing to get paid while still at the Seattle Police Department.'",
        "'speaker_4': 'That proviso extension expires on September 1st. Unfortunately, this extra time did not really have an outcome of a different, different result. There is still a divided workforce. I know that the front line parking enforcement officers and protect who represents the officers are still in conversations with how to come to an agreement and improve relations.'",
        "'speaker_4': 'But I have heard that that the the positions haven't changed. But nevertheless, I'm being responsive to the the fact that a majority of councilmembers are interested in transferring the pillows to the Seattle Department of Transportation. And for that reason, the bill, as passed out of committee unanimously with an amendment that I introduced, does transfer a P.O. unit'",
        "'speaker_4': 'to start. The bill, includes a ratified and confirmed clause to ensure the unit is paid come September. Thank you.'",
        "'speaker_0': 'Thank you so much. Are there any additional comments on the bill? CHEERING then will the court please call the role in the passage of the bill?'",
        "'speaker_1': 'Let's get the. I.'",
        "'speaker_2': 'PETERSON All right. Strauss Yes.'",
        "'speaker_1': 'Herbert Juarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'And Council President Gonzalez I. Seven in favor.'",
        "'speaker_0': 'Nine opposed the bill passes and the chair will sign it. Will There is a fixed signature to the legislation on my behalf. Will the Court please read item eight into the record?'"
    ],
    "Interim Provisions for Street-Level Spaces Downtown During COVID-19 Emergency.": [
        "'speaker_3': 'The Court of the Land Use the Neighborhoods Committee Agenda Item eight Council Bill one 2121 relating to land use and zoning, adopting interim provisions by amended sections 23.70 6.004. 23.70 6.006 and 23.7 6.0 32 of and adding a new section 2340 2.0 41 to the municipal code to facilitate occupancy of street level spaces downtown during the COVID'",
        "'speaker_3': '19 Civil Emergency and adopting the committee recommends the bill pass as amended.'",
        "'speaker_0': 'Hank you so much. Okay. We're going to hand over to Councilmember Strauss, who is the chair of the committee to provide us the committee report.'",
        "'speaker_2': 'Thank you. Council President Gonzales. Colleagues, thank you again for your patience with us this morning as we added the new committee during the briefing. I want to say at the top that I'm just very appreciative of Councilmember Lewis bringing forward a revised version of Amendment three.'",
        "'speaker_2': 'It is it addressed the the issue, the policy issues, not philosophical, the policy issues that I had concerns with. And I really appreciate that. So this legislation overall provides greater flexibility for the types of uses that are allowed on the street level in downtown Seattle to address vacant storefronts.'",
        "'speaker_2': 'The land use code regulates street level uses to ensure that ground floor spaces are pedestrian friendly and to add to the connectivity and vibrancy of our downtown streetscape, for example. The land use code encourages pedestrian friendly street uses by allowing things like restaurants, shops and these types of businesses on the ground floor, which pedestrians interact with and'",
        "'speaker_2': 'create an interesting environment. It does not allow uses such as warehouses which create dead space along a downtown sidewalk. This is true, and this is also true of neighborhood commercial districts street level uses. Although the standards for downtown are even more narrow than throughout our city in response to downtown storefront vacancies.'",
        "'speaker_2': 'Mayor Durkan proposed Council Bill one 2121 to expand the list of use uses allowed on the street level in downtown so that these vacancies are able to be filled more quickly. The expanded list roughly mirrors the list of allowed street level uses in non downtown neighborhood commercial districts.'",
        "'speaker_2': 'So just again, more conservative downtown. These lists mirror the neighborhood commercial districts uses that are on the street level. So new allowed street level uses downtown would include art installations, community centers, medical offices, co-working spaces and gyms or other amenities associated with apartment building or hotel.'",
        "'speaker_2': 'The ordinance would be in effect for one year, after which new uses from the expanded list would not be allowed without further action. Uses from the expanded list are permitted within the one year window would be granted the ability to remain in perpetuity or until that use ends.'",
        "'speaker_2': 'It would not if if a uses in a space that use ends that that exempted use could not be reapplied if it's outside of the one year parameter and no further action was taken. The Land Use and Neighborhoods Committee adopted an amendment from Councilmember Lewis to expand this legislation to cover South Lake Union as well, which was'",
        "'speaker_2': 'in the initial study completed by the department. So before I turn it back over to Council President, I'd like to thank everyone who worked on this legislation in the Mayor's office. Obesity, SDI, Department of Neighborhoods. Councilmember Lewis and Daniella in his office.'",
        "'speaker_2': 'The downtown stakeholders who worked very hard to make this legislation work well. And Noah on the committee clerk in my office. Thank you, council president.'",
        "'speaker_0': 'So much, Casmir Straus for that and I appreciate the work during the in-between hours between council briefing and now to get us to what appears to be a consensus position. Really appreciate your efforts on that in that and also consider those efforts in that.'",
        "'speaker_0': 'I do know that consumer Lewis still has a couple of amendments you'd like to advance. So I'm going to hand it over to Councilmember Lewis to move those amendments before we have a opening of the floor for comments on the bill as a whole.'",
        "'speaker_0': 'So let's go ahead and consider the amendments and then we can take comments on the amended version of the bill before we take a final roll call. So because we're losing and handed over to you to move Amendment One.'",
        "'speaker_2': 'Thank you. Council President. I do need to at some point move to suspend the rules to substitute. Amendment three, version two C. And so do you want. Should we?'",
        "'speaker_0': 'Let's go. Let's go through them. Yeah, yeah. Let's go through the let's go through them in order. And when we get to the substitute version of Amendment three, we can do this suspension of the rules and whatnot. But these initial amendments don't require a suspension of the rule.'",
        "'speaker_0': 'So let's just take take them as they are.'",
        "'speaker_2': 'Thank you so much, Madam President. So I will move Amendment One to Council Bill 1 to 0, 1 to 1 is presented on the agenda. Second.'",
        "'speaker_0': 'Its been moved in second and the bill will be amended as presented. Amendment one has been were Lewis going to hand it back over to you to address the contents of Amendment One?'",
        "'speaker_2': 'Thank you. Madam President. So as we discussed this morning, Amendment one is the light manufacturing component of what historically was one combined amendment. My office did, based on feedback from the committee hearing, separate out the light manufacturing, which had a consensus from committee members and from city departments to be part of the ultimate bill.'",
        "'speaker_2': 'The more controversial discussion around street level office use was something that I thought the council would benefit from being able to have a separate vote on, given that there was consensus on the other half. So this bill, this amendment only addresses the light manufacturing of which there is harmony within the city and with stakeholders in support of'",
        "'speaker_2': 'as part of the considerations this morning of moving this along. The downtown Seattle Association, myself and Councilmember Strauss, agreed to no longer pursue the amendment for street level office use in the downtown neighborhoods, opting instead to leave that issue alone based on feedback from the departments and a lack of interest in stakeholders and further pursuing it given'",
        "'speaker_2': 'some of that feedback. So I will not be moving amendment to only Amendment one and a revised version of Amendment three based on that feedback. So I don't have anything else to add to that unless colleagues have questions that I can answer, but otherwise I will just be ready to vote whenever the council is satisfied.'",
        "'speaker_0': 'Great. Thanks so much, because we're lost. So right now we're just considering Amendment One. And I see the kids were stressed. You had your hand raised. Did you have a comment on Amendment one?'",
        "'speaker_2': 'Yes. Thank you. Council President. I just wanted to make it clear for the record. Councilman Lewis, you were more than welcome to bring Amendment two. I appreciate you being responsive to departments and working with stakeholders to make that motion to not bring it forward.'",
        "'speaker_2': 'My issues this morning, I just want to focus on we're regarding Amendment three. So just for the record, I appreciate all the work that you've done.'",
        "'speaker_0': 'All righty. So Amendment One is on the table. Are there any additional comments on Amendment One? Hearing none. Will the court please call the role on the adoption of Amendment One?'",
        "'speaker_1': 'Let's gather, guys.'",
        "'speaker_2': 'Peterson Hi. Strauss Yes.'",
        "'speaker_1': 'Curveballs. Yes. Suarez I.'",
        "'speaker_2': 'Lewis yes.'",
        "'speaker_1': 'And Council President Gonzalez. Yes. Seven in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. So we're going to go ahead and move past Amendment two. As I understand from Councilmember Lewis, he is withdrawing Amendment two. Is that correct?'",
        "'speaker_2': 'Yes, Madam President, I'm withdrawing Amendment two.'",
        "'speaker_0': 'All right. So we are moving to Amendment three, which Casmir Lewis has already indicated requires a suspension of the rules since there is a substitute. So if there is no objection, the council rule relating to circulation of amendments by 12 noon will be suspended to allow consideration of a new version of Amendment three.'",
        "'speaker_0': 'Hearing no objection. The council rule is suspended and Councilor Lewis mean you may now proceed with consideration of version to see of Amendment three.'",
        "'speaker_2': 'Thank you, Madam President. And this amendment was distributed before full council. It. It just does not have significant departures on the whole from the predecessor amendment. But there are a few. And so I'll I'll do my dual impression and try to address them authoritatively.'",
        "'speaker_2': 'I will say that the biggest difference.'",
        "'speaker_0': 'Was, first of all, I'm sorry. Councilor Lewis, I'm sorry to interrupt you. I need you to move.'",
        "'speaker_2': 'Oh, I'm sorry.'",
        "'speaker_0': 'I need you to move on.'",
        "'speaker_2': 'Yes. No, of course. I'm sorry, Madam President. Yes? I move to amend Council Bill 120121 is presented as Amendment three, version two C second.'",
        "'speaker_0': 'It's been moved. Thank you so much. I appreciate it. It's been moved and seconded of the bill be amended as presented on version two C of Amendment three. Now, I'm going to hand it back over, Councilor Lewis, to address the substance of this new version.'",
        "'speaker_2': 'Yes, the kettle goes on vacation and I just start messing up all the procedure here. So there you go. Now, so as I was as I was going to begin to address, it's the same as the prior amendment regarding the director of neighborhoods being able to make street level use decisions while these interim controls are in place'",
        "'speaker_2': '. So for the next 12 months in the Pioneer Square Preservation Special Review District, we are assessing a limit on the office space frontage in the Pioneer Square neighborhood to 30 feet of street level space. So this this is a control that was important to the Pioneer Square Business Improvement area.'",
        "'speaker_2': 'There is one notable carve out in the legislation, and that is for the area zoned piece 85 120 zone and that would be allowing up to 90 feet of street level usage. This change is supported, as was heard in public comments by the Alliance for Pioneer Square to address a unique condition in that area, in the neighborhood'",
        "'speaker_2': 'that is isolated, where the street level use recruitment has been particularly difficult and there is already a prospective tenant that this particular constituent has. So it is a was a priority for the Alliance for Pioneer Square to make that exception and one which I was happy to have for the consideration here of the council.'",
        "'speaker_2': 'We heard a number of folks call in urging passage of this amendment to our downtown stakeholders who are eager to start the long process of getting more folks into these storefronts and activating the storefronts. This is an important piece of legislation to or an of course, important amendment or this piece of legislation to realize its full potential'",
        "'speaker_2': 'with our downtown partners. And I do urge its passage today.'",
        "'speaker_0': 'Great. Thanks so much. Are there any additional comments or questions on version to see of Amendment three? Counselor Strauss, please.'",
        "'speaker_2': 'Just again, thank you, Councilmember Lewis, for tailoring this bill. This amendment is in a much better place than it was this morning. And just really appreciate you working so hard with two versions since council briefing this morning. Really appreciate it.'",
        "'speaker_2': 'Fully supportive.'",
        "'speaker_0': 'So much. Any additional questions or comments on version two? See of Amendment three. I'm not seeing any additional comments so well. Please call the role on the adoption of version to see of Amendment three.'",
        "'speaker_1': 'Oscar Peterson. High stress.'",
        "'speaker_3': 'Yes. Trouble.'",
        "'speaker_1': 'Yes. Suarez I.'",
        "'speaker_2': 'Lewis yes.'",
        "'speaker_1': 'And council president Gonzalez i7a favor and unopposed.'",
        "'speaker_0': 'The motion carries the amendment is adopted and the amended bill is before the council. Are there any further comments on the amended bill? Customer. Lewis, please.'",
        "'speaker_2': 'Thank you, Madam President. And it's now my turn to thank Councilmember Strauss for prioritizing moving this bill. Before we go off on council recess. As we heard in public comment today. There are a lot of very interested stakeholders in the downtown Piner Square in South Lake Union neighborhoods who are eager to use these new rules to inject'",
        "'speaker_2': 'new vibrancy and vitality into these neighborhoods that have experienced the brunt of the impact from COVID. It's really critical, too, to note that this could be the beginning of a big reinvention and increase dynamism in these neighborhoods, which historically have had very restrictive uses for these storefronts.'",
        "'speaker_2': 'And this is really an opportunity to rebound from COVID in a stronger position and experiment with some more flexibility in areas that traditionally have just been for restaurants and retail. And I think that we've seen the examples of a lot of other downtowns nationally and a lot of the business districts spread around the city of Seattle, where'",
        "'speaker_2': 'more innovative and flexible use of the space can create new dynamism that reflects the downtown of today, which is not just a commercial space, but a neighborhood of tens of thousands of residents, a neighborhood where people are raising families, a neighborhood where people play after they go to work.'",
        "'speaker_2': 'And I think that this is essential to really realize that full potential and continue to room to plan in downtown as a neighborhood, rather than just this regional space of congregate, work and live performance, but also a place where people do live, work and play all at the same time like a lot of our other neighborhoods in'",
        "'speaker_2': 'the city. So with that, I appreciate the process that we put into this. I appreciate the work of the departments that have this legislation up fairly quickly so we can get it out before recess and look forward to voting on it.'",
        "'speaker_0': 'Thanks for that camera, Lewis. Are there any additional comments on the bill? I'm not seeing any other hands raised because we're stressed. Would you like to have the last word on the bill before we close that debate?'",
        "'speaker_2': 'Yes, just very excited to have this bill passed before council recess. And this, along with bringing business home and street cafes throughout the city, are some of the ways that I personally in this council as a whole have supported the vibrancy of our downtown and throughout our community.'",
        "'speaker_2': 'And this is just another one of those good pieces of policy to make downtown more vibrant. Thank you. Council President. Thank you, Councilmember Members.'",
        "'speaker_0': 'It's so much consumer stress. And thanks to all of the members of the Land Use and Neighborhoods Committee, I'm excited about being able to support this particular version of the bill. So thanks to everyone for the hard work.'",
        "'speaker_0': 'That being said, the bees call the role on the passage of the amended bill.'",
        "'speaker_1': 'Together. I'm your son.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Strauss? Yes. Herbold. S. Suarez.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Lewis yes.'",
        "'speaker_1': 'And council president gonzalez i. Seven a favor and i opposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it, which is a fix my signature to the legislation on my behalf. Okay. Will the clerk please read item nine and ten into the record?'"
    ]
}