{
    "Extension of Moratorium on Land Use Changes for Mobile Home Parks.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Item number one Will the clerk please read item one into the record? Agenda Item one Council Bill 120080.'",
        "'speaker_0': 'An ordinance relating to land use and zoning extending for six months. A moratorium established by ordinance 125764 and extending an order by ordinances 126006126090 and 126241 on the filing, acceptance, processing and or approval of any application to establish a new principal or accessory use or change of principal or accessory use for any site currently used as a'",
        "'speaker_0': 'mobile home park, as defined in section 23.8 4a032 of the Seattle Municipal Code and ratifying and confirming certain.'",
        "'speaker_1': 'Acts of a.'",
        "'speaker_0': 'For a public hearing. Are folks just toggling between screens here? Okay. So as Presiding Officer, I am now opening the public hearing on Council Bill 120080 relating to land use and zoning extending for six months, a moratorium established by Ordinance one two.'",
        "'speaker_0': 'Five, 764 and extend by ordinances 126006126090 and 126241 on the filing, acceptance, processing and or approval of any application to establish a new principal or accessory use or change of principal or accessory use for any site currently used as a mobile home park, as defined in section 23.8 for 8.032 of the settlement of Civil Code in ratifying'",
        "'speaker_0': 'and confirming certain prior acts. The online registration to sign up to speak at this hearing opened at 12:00 noon today, and I'll call on speakers in the order of registration. The online registration will remain open until the conclusion of this public hearing.'",
        "'speaker_0': 'The rules apply to the public comment period also apply to this public hearing. If there are any speakers, each speaker will be provided 2 minutes and a 10/2 warning to wrap up comments. Speakers microphones will be needed at the end of the a lot of public comment time public comment relating to Council Bill 120080 is only being'",
        "'speaker_0': 'accepted at this public hearing. Speakers are asked to begin their comments by stating their name. And let me take a look here and see if anyone has signed up for public comment on this particular council bill. I do not see anyone signed up for public comment on this particular council bill.'",
        "'speaker_0': 'So at this time I do not have anyone remotely present to speak on Council Bill 120080. Will staff please confirm there is not a member of the public in the queue before I close this public hearing?'",
        "'speaker_2': 'For an outside.'",
        "'speaker_0': 'Council member or council president Gonzalez, this is Deputy Clerk Schwinn. We still would like to open the public hearing and closed. I did. Okay. Thank you. Yeah, I already went. I already went through the whole opening of it.'",
        "'speaker_0': 'So now I'm at the point of asking whether there is anyone remotely present to speak on Council Bill. Thank you. Will staff please confirmed that there is no one from the public available to speak during this open public hearing?'",
        "'speaker_2': 'Confirmed.'",
        "'speaker_0': 'Thank you so much. Again, being that there is not a member of the public remotely present for this public hearing on Council Bill 120080. This public hearing is now closed, so we will move to item two. Will the clerk please read item two into the recorder's?'"
    ],
    "Ordinance to Remove Interest Charge on Delinquent Utility Accounts.": [
        "'speaker_0': 'Madam quirky meeting you did. Thank you. Agenda Item two Council Bill 120089 An Ordinance Relating to the Sea, The City Light and Seattle Public Utilities Departments temporarily removing the charge of interest on delinquent utility consumption and utilize utilization accounts.'",
        "'speaker_0': 'That's the short title. I'm finished. Okay. Sorry. My script did not call for the short titles. I wanted to make sure I gave you the time in case there was a little technological hiccup. But thank you for reading the short title into the record.'",
        "'speaker_0': 'I moved past Council Bill 120089 as their second second. Thank you so much, President Petersen. You're the sponsor of this bill. So when I handed over to you to walk us through the legislation.'",
        "'speaker_2': 'Thank you. Council President colleagues, as I noted at our council briefing this morning, Council Bill 120089 would extend the temporary suspension of interest charges on delinquent utility account balances for Seattle Public Utilities and Seattle City Light customers during the COVID emergency.'",
        "'speaker_2': 'This will benefit customers who may be struggling with their bills from either of our city owned utilities. This bill is the third extension of this pandemic relief policy. It was on the introduction referral calendar May 24th. The three previous bills also went straight to the full council.'",
        "'speaker_2': 'We passed the previous ordinances in May and March 2020, September 2020 and December 2020. This relief bill would extend the suspension of interest charged through the end of this year. Thank.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Are there any other comments on the bill? Hearing no additional comments will part. Please call the role on the passage of the bill.'",
        "'speaker_1': 'Strauss. Yes. Herbold. Councilmember Herbold? Yes. Whereas. Councilmember, whereas. It's. Lewis. Yes. Where else? Yes. Well, Sarah, I. Peterson. All right. So what? Yes. Council President Gonzales. Hi. Nine in favor and unopposed.'"
    ],
    "Ordinance on Seattle Office for Civil Rights Budget Changes.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read the short title of item three? Agenda Item three Council Bill 120087 An Ordinance relating to Appropriations for the Seattle Office for Civil Rights amending Ordinance 126237, which adopted the 2021 Budget.'",
        "'speaker_0': 'Thank you, Madam Clerk. And the past Council Bill 120087. Is there a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'Is so much because of everyone else. You're the sponsor of this bill. I'm going to hand it over to you to walk us through this list.'",
        "'speaker_1': 'Thank you. Council President There is an amendment. Do I address that first or should I address the base bill?'",
        "'speaker_0': 'It would be helpful if you addressed the base bill first and then I'll take up the amendment. Okay.'",
        "'speaker_1': 'So thank you. So, colleagues, this bill lifts the proviso on some of the participatory budgeting funding and directs the Office of Civil Rights to begin engaging with community members to draft a request for proposal. That RFP will begin the search for an organization that will manage the actual participatory budgeting process.'",
        "'speaker_1': 'An RFP would allow for an open and transparent process, gives our organizations the opportunity to bid on the work and will lead to more equitable outcomes for our community members. I have to say I'm really excited to be getting this project started and to listen to our neighbors calls for a seat at the table about how our'",
        "'speaker_1': 'public dollars get spent. We did here in committee, my committee last week that OCR will be working with community members this year to find the right organization to launch participatory budgeting. Next year, community members will begin to brainstorm ideas for how investments should be made.'",
        "'speaker_1': 'In my committee meeting, we heard from two guests Councilmember Menchaca from New York City, who said about their experience in New York that people were really hungry to connect to their government, to share the ideas that they have, and that once people started seeing their ideas were being listened to, once they began to understand the cost of'",
        "'speaker_1': 'a program or project, they no longer felt outside of government, but really began to understand how the government works. And it also brought their neighborhoods together. People started teaching one another about how these processes work. That's the potential of participatory budgeting.'",
        "'speaker_1': 'It's about democratizing access to power and resources, and it's about increasing civic engagement. So our neighbors understand how these processes work and understand that their representatives are listening. We also heard from Sean Good, who we've heard from before.'",
        "'speaker_1': 'He's with Choose 180. And Sean, I think, said something really important, which is that the $28 million we're talking about here won't begin to make up for the economic inequality in some of our neighborhoods. It won't begin to address the injustices or gentrification that our communities of color have experienced.'",
        "'speaker_1': 'But what it will do is begin to blazed a trail that speaks to how we do this in the future and acknowledges that this is the right way to allocate taxpayer dollars so that those who have been pushed for this to the margins can begin to have access to power and resources.'",
        "'speaker_1': 'That's the path that we're working on today. That is the equitable way for us to address our role as elected officials. And with today's vote, that's what we begin to do. So I am excited to get this moving and look forward to my colleagues support.'",
        "'speaker_0': 'Rethink is so much consumer wireless. I'm going to go ahead and have you make your motion on the proposed amendment, describe the amendment, and then we can consider the amendment and then we'll open it up for general comments on the bill as amended.'",
        "'speaker_0': 'So maybe amendment passes.'",
        "'speaker_1': 'Okay, I move amendment one. I'll wait. Okay. I'm sorry. Okay. So Amendment One adds a sunset provision this week.'",
        "'speaker_0': 'Hold on, hold on, hold on. I'm so sorry. It has to be seconded before we can discuss it. So. So Councilman Wise has moved proposed amendment as presented on the agenda. Is there a second?'",
        "'speaker_2': 'Second?'",
        "'speaker_0': 'Great. It's been moved a second and to amend the bill is presented on the agenda. Now we can have that discussion, including a description of the proposed.'",
        "'speaker_1': 'My apologies. Thank you very much. So the base bill does create three new positions at the Office of Civil Rights to help manage the process, coordinate other departments within the city so that this work can get done. Well with the amendment does is provide a sunset provision so that it abrogates those three positions at the end of'",
        "'speaker_1': 'December 2023. At that point, Council will determine how to proceed with the participatory budget program and what the appropriate staffing level should be. So we are just trying to give ourselves latitude to make adjustments and course correct with this program as we move forward.'",
        "'speaker_0': 'Thank you so much, Councilman Morales. Are there any comments or questions on the proposed amendment as described by Councilmember Morales? I've not seen any hands raised. So will the clerk please call the role on the adoption of the proposed amendment?'",
        "'speaker_1': 'Strauss Yes. Herbold? Yes.'",
        "'speaker_0': 'Whereas I.'",
        "'speaker_1': 'LEWIS. Yes. Morales Yes.'",
        "'speaker_0': 'Mosquera I.'",
        "'speaker_2': 'PETERSON Yes.'",
        "'speaker_1': 'Swan Yes. Council President Gonzales.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor.'",
        "'speaker_0': 'Nine oppose the motion carries the amendment is adopted and the amended bill is now before the council. Are there any additional comments on the bill as amended? Councilmember Mesquita, please. Thank you very much, Councilor. President, I just wanted to take this moment to say congratulations to Councilmember Morales, to her team, and to the community at large who'",
        "'speaker_0': 'have been long advocating for this. We know that participatory budget is a cornerstone to how we are considering reimagining policing and reinvesting in community priorities that have been long put on the back burner. And I wanted to say thanks to Councilman Morales and the community who's been advocating for this.'",
        "'speaker_0': 'This is an exciting step forward as we begin the process to make sure that dollars are going directly into the communities that have been long, underinvested and underserved and look forward to the chance to follow the community's lead as we can receive feedback from the participatory budgeting process and really proud that our city has been a leader'",
        "'speaker_0': 'across the nation. Many other cities have called to us. Folks with the mobile progress have been looking at our participatory budgeting process and our model, and I'm looking forward to this process yielding additional information for directing investments into community based solutions.'",
        "'speaker_0': 'Obviously share the frustration from Councilmember Morales and team and the community that this hasn't been done sooner and appreciate the opportunity to vote on this today so that we can get these wheels into motion and get some feedback for our upcoming processes.'",
        "'speaker_0': 'Appreciate it and congratulations. Those comments confirm was gay. Are there any additional comments on the bill as amended? Councilmember Morales, do you have the last word? You can close out debate eight.'",
        "'speaker_1': 'Well, thanks so much, everybody. I do want to thank everyone who's worked so hard in the last year to get us to this point. And the organizing that's started last summer was critical to moving the city in this direction.'",
        "'speaker_1': 'And this is a direction of a more democratic way to allocate resources. So I want to thank the folks at Decriminalize Seattle King County Equity Now, Freedom Project, the Black Brilliance Research Project. I also want to thank my staff Leticia Farmer, Darcel Tuch, Alexis Perla, who all had a hand in keeping this moving over the last year'",
        "'speaker_1': '. And I want to thank central staff, immigration and trauma La, Switzerland for helping us with all the technical aspects of how to do this right so that we can serve community well. And finally, I want to thank Dana Robertson, Stephanie Guzman, and just for helping us really elevate the voices of our community members so that we can'",
        "'speaker_1': 'share the information about how this works. We are adding a page onto the council website so that folks have a place to go and can follow along in the process and can answer some of their basic questions about what it is we're trying to do here.'",
        "'speaker_1': 'So thanks to everyone who's worked so hard on this, and I'm eager to get us started.'",
        "'speaker_0': 'Thank you so much, Casimir, and one on us for those closing remarks. You wrapped it up very well. With that being said, I'm going to ask that the clerk please call the role on the passage of the amended bill.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'For both. Yes. Whereas I. LEWIS. Yes. Morales Yes. Mr.. I. Peterson, I so want. Yes. Council President Gonzales. I needed a favor and unopposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it. Will the Court please affix my signature to the legislation on my behalf? Congratulations. Members of the community, that's a unanimous vote in favor. Again, a unanimous vote in favor of a participatory budget bill.'",
        "'speaker_0': 'So I appreciate the work that's been done here. Well, the clerk please read item four into the agenda item for appointment 01915 The reappointment of Martha Lucas as a Member Community Involvement Commission for Term two May 31st, 2023.'"
    ],
    "Ordinance to Amend the 2021 Budget and CIP.": [
        "'speaker_0': 'Motion carries in the appointment is confirmed. Item seven Will the court please read the short title of item seven into the record?'",
        "'speaker_4': 'The Report of the Public.'",
        "'speaker_0': 'Safety and Human Services Committee. Agenda Item seven Council. Bill 119981 An Ordinance amending Ordinance 126237, which adopted the 2021 budget, including the 2021 through 2026 Capital Improvement Program, CIPA. The committee recommends that City Council does not pass as amended the Council bill with a divided report.'",
        "'speaker_0': 'With council members Gonzalez, Morales and Sawant in favor of the recommendation and councilmembers Herbold and Lewis opposed to the recommendation. All right, colleagues, thank you so much. I'm going to go ahead and move this bill so that it can be placed before us for consideration and discussion and a vote.'",
        "'speaker_0': 'So I will move to pass. Council Bill 119981. Is there a second second? Thank you so much. It's the second I'm going to hand it over to Councilmember Herbold, who is the chair of this committee, and she is going to address this item for us.'",
        "'speaker_4': 'Thank you, counselor. President Gonzales. Would you like me to just do what I hope can be a pretty quick overview of the bill before we start talking about amendments?'",
        "'speaker_0': 'Yes. So let's discuss that base bill as it came out of committee. And then it's a little confusing because they came out with a do not recommend. Do not recommend passage by the committee. But I still think you can have a conversation and chew up for the viewing public.'",
        "'speaker_0': 'The components of the base bill that received the do not recommend vote by the majority of the committee. And then we can consider amendments. After we consider amendments, we will have we will open it up for a discussion on the bill as amended.'",
        "'speaker_0': 'So hold on to your comments about the bill as a whole until we have gone through the exercise of the amendments, and that would be the the cleanest, most logical way to go through this particular piece of legislation.'",
        "'speaker_4': 'Sorry I understood your direction, and I'm trying to follow it. And then the last thing you said seemed to contradict it. I was going to speak to what the bill is. That's that is before us now. Is is that your understanding?'",
        "'speaker_0': 'Yes. Yes. You are different because you're the sponsor of the legislation. I'm the chair of the committee. So because you are the chair of the committee, you get to speak to the base of the bill. What I'm asking is other colleagues to hold on to their comments related to the entirety of the bill for when we have'",
        "'speaker_0': 'an amended bill before us to debate and vote on.'",
        "'speaker_4': 'Thank you very much. My apologies. So just want to first off clarify that this legislation is not about the police department budget for officer hiring. The budget for officer hiring was fully funded in the 2021 budget adopted in November.'",
        "'speaker_4': 'Nor is this bill about a particular number. This bill is about until school oversight. SBT Funding As Background. The City of Seattle is under a consent decree with the US Department of Justice. Any item covered by that consent decree require review and approval by the judge overseeing the country and the court appointed monitor developments in this legislation'",
        "'speaker_4': 'after it was originally introduced or driven by the consent decree process and specific statements from the Monitor in court about this bill. Back in August 2020, the Council adopted Resolution 31962 that the Council will not support any amendments, increase the speed needed to offset over time expenditures above both funds budgeted in 2020 or 2021.'",
        "'speaker_4': 'Nevertheless, an additional $5.4 million in spending request came from SPG in late 2020 and that not align with previous resolution because council voted to add 5.4 million in funds in late 2023 to our policy tonight. So Council stated our our intent to propose legislation for the 2021 as budget.'",
        "'speaker_4': 'After this bill was introduced. Judge Roberts oversees the council. I mean, so the consent decree had sharp criticism of the Council on Budget issues. The Monitor subsequently noted concerns have been raised about the possibility of various cuts to city's budget impacting City of Seattle's ability to comply with a range of requirements of the consent decree.'",
        "'speaker_4': 'In response to the judge and the Monitor's comments, I sponsored a revised version of the bill on March 23rd, including nearly $3 million in cuts to police budget, with 2 million going forward for Tory budgeting, 1 million in spending moved from MPD to other departments and releasing a $5 million budget proviso.'",
        "'speaker_4': 'A committee majority of three councilmembers didn't support it, saying this new version of the bill before the committee. It also allowed for funding for civilian positions and technology requests that speedy made at the March 9th meeting of the asked what those technology requests include, they include a new early intervention system and recognition that the system currently employed'",
        "'speaker_4': 'is inadequate. And that early intervention system is intended to predict and guide interventions for employees with signs that they need support as a way of of enhancing police oversight of police officers who may be displaying a bullying activity in the course.'",
        "'speaker_1': 'Of the work.'",
        "'speaker_4': 'It also included some analytics platform and capacity building tools that will allow, among other things, for the analysis that we are all doing together, the council and the mayor and community members and the public for analysis on 911 alternative responses, new bill also provided funding for public disclosure response positions, as recommended by the city auditor in his'",
        "'speaker_4': '2015 report and extensively reported on by the Seattle Times and called out by the Washington State Public Disclosure Commission director as problematic, left unaddressed and also put in storage as recommended by the Inspector General. Because PD has insufficient space for physical storage of evidence, the majority of committee members voted to substitute the introduced bill with this new'",
        "'speaker_4': 'version. Monitor, meanwhile, asked a series of questions of the police department and upon receiving the reply from the police department, wrote to the Council that even after the committee meeting supporting the smaller cut and lifting the $5 million proviso he wrote Caught in the Monitor are increasingly concerned about the reduction of funding the Seattle Police Department.'",
        "'speaker_4': 'In response, I proposed an amendment noting central staff now estimates up to 13 million in salary savings and releasing a $2.5 million spending proviso out of order layoffs. Based on sustained misconduct, it's not possible. It's time due to the intersection.'",
        "'speaker_4': 'Look at the civil service rules and state law that the legislation includes. Additional funds can be spent on all again as identified by the monitor. So that is the background and the description of the bill before us today.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Great. Thank you so much for the description of the of the base bill. Colleagues, again, you will have an opportunity to either ask questions about the base bill or make comments on the base bill. But I did want to get us to consider some of these proposed amendments before we open it up for a broader discussion and'",
        "'speaker_0': 'debate around the bill. I just think that the conversation will be. Richer and and more accurate if we have a final amended bill before us for for debate. So if that's okay, I'd like to go ahead and ask Councilmember Herbold to address her first proposal, the proposed Amendment one, if there's no objection with that.'",
        "'speaker_0': 'All right. Go ahead.'",
        "'speaker_4': 'Councilmember This one should be super easy. This is a technical amendment that was distributed via email to councilmembers this morning. It was inadvertently left off the agenda, and a little staff noted its technical amendment recommended by the city attorney's office.'",
        "'speaker_4': 'I move to amend Council Bill 11 9981 presented on Amendment One, which was included on the record of Council Bill 11 9981 and distributed via email to customers this morning.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Great has been moved and seconded to amend. The bill is presented on Amendment One. Are there any additional comments on the proposed Amendment one? Again, this is just an amendment with technical what has been described as technical modifications to the base bill.'",
        "'speaker_0': 'And so it's just a vote on the amendment itself. Councilmember Sala.'",
        "'speaker_3': 'Thank you, President Gonzalez. As was explained, this amendment is an entirely technical amendment, so I will be voting yes on the amendment. I just wanted to be clear to members of the public that I oppose the bill as a whole and will vote against it when it's time for the final vote in a moment.'",
        "'speaker_3': 'This is just a vote on the technical amendment. Now, I also wonder to just also add my comments, to make it clear for the record coming out of the committee, because of the way the minutes appear for the bills that have more no votes than yes votes out of committee is confusing, as council members have stated.'",
        "'speaker_3': 'I voted no on the bill in the committee because the majority of the committee voted no. The minutes show a do not pass recommendation and then list all the no votes as a yes do not pass, which is very confusing.'",
        "'speaker_3': 'But just to be clear to members of the public, I voted no on this bill in the committee and will do so again. Thank you.'",
        "'speaker_0': 'Thank you for that. Okay. Any additional comments on proposed Amendment one? Hearing none. Will the court please call a role on the adoption of amendment?'",
        "'speaker_1': 'Strauss. Yes. Revolt. Whereas I. Lewis. Yes. Morales Yes, was I? Petersen All right. Sloan Yes. Council President Gonzales. I remain in favor and unopposed.'",
        "'speaker_0': 'Motion carries, the amendment is adopted and the amended bill is now before the council. I understand that comes from Lewes, has a proposed amendment as well. So I'm going to hand it over to Councilmember Lewis to make his motion and see if there is a second.'",
        "'speaker_2': 'Thank you, Madam President. And I move amendment to.'",
        "'speaker_0': 'Is there a second that. Thank you. It's been moved and seconded to amend the bill as presented on Amendment two. I'm going to hand it back over to Councilmember Lewis to walk us through Amendment two. And then we will have discussion, debate and a vote on proposed.'",
        "'speaker_2': 'Oh, thank you, Madam President. I'm bringing amendment to as a as an option for the council to consider and potentially a new way for us to think about. A corresponding bifurcated strategy for how to consider our ongoing process of defunding the Seattle Police Department and reinvesting in alternative public safety investments.'",
        "'speaker_2': 'And I want to say at the top that, you know, the amendment in no way implies from me a lack of commitment to participatory budgeting. I do not think that the money that has been apportioned already, the $30 million apportioned for the participatory budgeting process should in any way be reallocated from that process.'",
        "'speaker_2': 'Since we know in the legislation passed earlier this meeting from Councilmember Morales that we will be setting up a very deliberative process with enough time to be supplemented by additional appropriations on top of the 30 million. I would be supportive of putting additional money into that participatory budgeting process.'",
        "'speaker_2': 'You know, I do bring this amendment for us to have a discussion and a conversation of ways that we might be able to. At the same time, we are building toward that participatory budgeting process, make some more short term investments in some other public safety programs that we know are working extremely well and could be responsive to'",
        "'speaker_2': 'the massive need that we see in the community. And that, I believe, has eroded confidence from some community members in our ability to be responsive to the public safety challenges the city is facing. And in a way that the police will not be, frankly, responsive under the investments that we're making here or under some of the staffing'",
        "'speaker_2': 'investments through the staffing plan that we funded. The big issue as I see it and I'm digressing a little bit and talking more generally about our public safety concerns based on the emails that all of our officers get, is that a lot of community members who are very compassionate are frustrated for a variety of different reasons, as'",
        "'speaker_2': 'well as some who are frankly not that compassionate but are frustrated for a lot of different reasons. With the state of unsanctioned encampments and chronic homelessness in the city of Seattle, and with the inability of us as a city to provide an appropriate level of shelter and care in a way that is culturally competent, that has resources'",
        "'speaker_2': 'for the actual issues people are facing, and that.'",
        "'speaker_1': 'Gives community members.'",
        "'speaker_2': 'A contact or someone that they can call that is not the police to intervene in these kinds of circumstances. The just care program, which we talked about last week in which I talked about at briefing this morning, is something that could be scaled to provide that level of response for every neighborhood instead of just the Chinatown International'",
        "'speaker_2': 'District and Pioneer Square, where it currently serves. There are plans to expand it under our American Recovery Act appropriations, but that still is not going to be to an extent where they can do the work they're doing on a city wide basis.'",
        "'speaker_2': 'So if you just wanted to talk just really briefly, a little bit more about just care, this amendment would move the $2 million instead of moving it into the participatory budgeting process, would move it into the procurement that we are pursuing with the county to protect and expand the trust care program.'",
        "'speaker_2': 'As we heard last week, the Just Care Program is composed of a consortium of providers, many of which are bipoc led. You know, obviously we heard from Dominic Davis, who was on our panel, who works with the consortium to provide culturally competent security at a number of the hotels that the consortium leases.'",
        "'speaker_2': 'Asian Counseling and Referral Service is a foundational partner. The Public Defender Association and the Chief Seattle Club have all been a part of this multi provider effort to really, really get into these areas that have been the subject of public discourse around the public safety discussion and resolve the underlying problem for all stakeholders involved to provide safety'",
        "'speaker_2': ', security and health care to the people that are currently living in encampments, who provide a resource that is an alternative to the police from business owners, to to intervene in some of these situations. And it has been directly responsive to the issues that we're facing.'",
        "'speaker_2': 'I have concerns as we're a year into and there's been a lot of retrospectives on the action that we are taking as a city to continue down this path of developing community based alternatives. That council efforts are losing momentum in a lot of respects.'",
        "'speaker_2': 'It's because of, as far as I can tell it, what my predecessor, Councilmember Bagshaw, called the sea test, the ability for people to see and understand what the alternatives are, how they're responsive to their needs, how it affects their daily life.'",
        "'speaker_2': 'I say this as someone who is uniquely positioned because I have constituents who have seen the sea test. I have people who have reached out to my office that are not necessarily historic proponents of housing first and harm reduction, but they've seen it work and they've seen it be responsive to their concerns.'",
        "'speaker_2': 'And they are they have the zeal of converts and they're leaning into it. This is the kind of momentum that will help to drive broader restructuring, to set a new national standard of centering harm reduction, housing first, and culturally competent care as a replacement for militarized policing.'",
        "'speaker_2': 'I'm worried that if we're not able to to quickly respond and give other neighborhoods that impression of some of these alternatives, I'm worried that it's that the inevitable inertia of things is going to lead ultimately to backsliding, be it backsliding that's ordered by a federal court who is impatient with the process or unconvinced of the of the'",
        "'speaker_2': 'merits of waiting for community investments that are taking a while to get off the ground, be it the backsliding of future mayors or councils. I am worried about losing the moment and just, you know, using this amendment more broadly to can be in this conversation that perhaps some of these community investments should be made out of order'",
        "'speaker_2': 'of the broader participatory budgeting process in order to build public will and in order to be directly responsive to to situations where, frankly, people in these encampments are suffering from diseases typically common in third world circumstances, being exposed to being victims of violent crime that we know recently culminated in a murder over the weekend of a neighbor'",
        "'speaker_2': 'who was unhoused. And we sit here with resources and money where we could continue to build on the work of standing up this alternative system that is city wide and that can be enjoyed by every neighborhood. You know, again, you know, I do want to conclude that, you know, I mean, this $2 million alone is not going'",
        "'speaker_2': 'to do that. But I do think we could start to set an expectation that as we expand and build out a just care citywide network of care, that that money should come from the Seattle Police Department. It is money going into what community members typically think and associate at the police department should be doing.'",
        "'speaker_2': 'I have lots of I have a whole email inbox, as I'm sure my colleagues do, of people.'",
        "'speaker_1': 'Saying we.'",
        "'speaker_2': 'Need police to show up to this encampment and then have a whole colloquy with that person being like, you can have 50 police show up at that encampment. They can't do anything. The police cannot provide mental health care.'",
        "'speaker_2': 'The police cannot provide a referral to a shelter space. The what the police will do is show up and say they cannot do anything and then drive on. Which is another thing that is common. And a lot of emails I have because they're telling the truth, they actually can't do anything when they show up to these encampments'",
        "'speaker_2': 'unless they can establish probable cause immediately for a crime happening right in front of them. And then if they do that and they put the person experiencing homelessness in jail, they're going to be back on the street in a few hours because the jail also cannot provide mental health care or treatment or the things that our homeless'",
        "'speaker_2': 'neighbors need to be successful. Adjust, care can't. And I think that we have an opportunity to have a conversation of putting this nexus in where in addition to funding the broader cornucopia of things we're going to invest in through through participatory budgeting, that we also carve some money out of it to intentionally, strategically build a city wide'",
        "'speaker_2': 'network that we do it at the expense of the police department since it is caseload that is being transferred. I think there's a nexus in that makes sense. And, you know, maybe it won't be.'",
        "'speaker_1': 'Through this amendment, maybe it'll be through a different conversation that we have.'",
        "'speaker_2': 'But we're accumulating salary savings for officers that are leaving the department under the proviso that we set in the fall. I think we can be strategic with those salary savings to treat a citywide just care response system the way the same way we do treat the police department on the fire department as a permanent and ongoing institutional'",
        "'speaker_2': 'pillar of our public safety system that has the resources dedicated in such a way that they can build capacity and scale up and depend on that appropriation on a rolling basis. And, you know, my amendment is a way to introduce that conversation into the discourse of.'",
        "'speaker_0': 'What we're doing here at the council.'",
        "'speaker_2': 'You know, I understand it probably won't necessarily be successful today. I am sensitive about the fact that it was previously earmarked for participatory budgeting and and this would be rerouting it. And I like I acknowledge that I have a cognitive dissonance about that.'",
        "'speaker_2': 'And I'm not necessarily thrilled about that. But I'm also just saying this out of very sincere frustration, not with my colleagues here and not with the provider community, but just generally that there are resources there as well to address these ongoing problems.'",
        "'speaker_2': 'And they seem solvable to me. And we had that whole hearing with just care, where it seems eminently solvable. If the people doing the work can get the resources and support from neighbors that they need.'",
        "'speaker_1': 'And, you know, maybe we don't do it here.'",
        "'speaker_2': 'And I did want to keep up the conversation, and I appreciate your consideration. And with that, I'll yield back to the floor for comments, questions, and I appreciate the time to talk about it.'",
        "'speaker_0': 'It comes from Lewis. I am going to ask if folks have any comments or questions on that amendment. If you could use your raise the hand feature in Zoom, that would be helpful to me. And keeping track of those who would like to make comments on Amendment two.'",
        "'speaker_0': 'First in the queue is Councilmember Herbold, followed by Councilmember Morales.'",
        "'speaker_4': 'Mostly as the sponsor of the underlying legislation, who with the proposal to allocate these funds originally to participatory budgeting. I just want to say I, I welcome this discussion and I welcome this amendment. I think a lot has changed since December of last year.'",
        "'speaker_4': 'Whereas with today's vote on comes from Morales's legislation, we are still strongly in support of that $30 million investment in participatory budgeting. But the idea of adding to a pot of funds that it is not likely that we will see those investments on the ground until 2022.'",
        "'speaker_4': 'At this point, really to me underscores the need to look at where we could be spending dollars on programs that are on the ground working and making a difference for for all of our communities that are communities of of neighbors who are unhoused as well as communities of of business people and and residents who who have homes'",
        "'speaker_4': '. So I really appreciate the creativity for Councilmember Lewis here and the sense of urgency, really. I was at the LAPD African-American Advisory Council meeting a couple weeks ago. I mentioned that in briefings a couple of weeks ago, and they were really distraught that they were not seeing investments in alternatives.'",
        "'speaker_4': 'And they were really concerned about an increase of violence in their in their communities. And, you know, just giving. Again, this is not this is not a criticism of of any city department or of our processes. But just to give another example, the $14 million in additional capacity building for public safety investments that the council voted on'",
        "'speaker_4': 'last November are not projected to be out the door until until August. And I think people are rightfully concerned about those investments and other investments within the context of our reductions to the police department being ones that can produce public safety outcomes.'",
        "'speaker_4': 'So again, thank you, Councilmember Lewis, for bringing this forward for discussion.'",
        "'speaker_0': 'Councilmember Herbold. Next up, as Councilmember Morales and then Councilmember someone.'",
        "'speaker_1': 'Thank you. So I want to thank Councilmember Lewis for bringing this forward. I will say that I don't intend to support the Bass bill here, but I do think that this is exactly what we mean. Supporting this sort of a deep investment in a program like Just Cares is exactly what we mean when we say that we'",
        "'speaker_1': 'should be shifting the SBT budget into critical services. Community safety means lots of different things and certainly supporting investments, a greater investment in our homeless services and community members and something as innovative and comprehensive as Just Cares meets that goal and meets that criteria.'",
        "'speaker_1': 'So I, I will be supporting this amendment. And whether we do this here or we do it with, you know, in a different way later this year, I think this is exactly the kind of direction we need to be going.'",
        "'speaker_1': 'And I want to thank Councilmember Lewis for bringing this forward.'",
        "'speaker_0': 'As you can see here, Morales comes from a slum.'",
        "'speaker_3': 'Thank you. I support increasing funding for just care and I also support the participatory budgeting funds. So I oppose this amendment which pits those two good programs against each other. Remember, this was a bill to cut $5.4 million from the police department's budget to make up for the $5.4 million that they stole from the city last year'",
        "'speaker_3': 'by spending more than they were authorized to in amendment after amendment. This bill to remove $5.4 million from the police department was then reduced to 3.3 million and then a 5 million SBT proviso was effectively lifted and then a 2.5 million proviso was effectively lifted.'",
        "'speaker_3': 'So now this bill increases the funds that the police department has access to by 4.5 million, rather than decreasing it by 5.4 million. It has become the opposite of what it was when it started. Why does the funding for just care have to be taken from the funding for participatory budgeting?'",
        "'speaker_3': 'It should come from the money allocated to the police department, as has been promised by the Council again and again. My office this morning consulted with a leader in the Decriminalize Seattle organization this morning, this morning about this amendment, which they said they had not previously seen.'",
        "'speaker_3': 'And they raised that this amendment obscures the fact that the police department's budget is not being cut and instead good programs are being paid against each other. I agree with the arguments that Councilmember Lewis made that just get is a much better use of funds than the police.'",
        "'speaker_3': 'Absolutely. But unfortunately, what this amendment does is take those funds from participatory budgeting, not from the police. I would be happy to support an amendment that increases funds for just care by taking the money from the police budget, not in the form of putting good programs against each other.'",
        "'speaker_3': 'And so I will be voting no on this amendment. Councilmember Lewis expressed this going forward with what he called the cognitive dissonance of using funds that was previously planned for participatory budgeting. But let's be clear that this is particularly problematic because this bill as a whole no longer cuts $5.4 million from the police department.'",
        "'speaker_3': 'That was not the case. Then this amendment might have been different. So I'll be voting no.'",
        "'speaker_0': 'Thank you for your service. Are there any other comments or questions on proposed amendment to. Okay. All right, colleagues, I just really quickly wanted to chime in on this particular amendment. I don't think that the intent of Councilmember Lewis is to hit two good programs against each other.'",
        "'speaker_0': 'I see the intent and the desire here is to have additional resources to support a program that many of us have been very supportive of historically and I think will continue to be supportive of programs that are modeled after the Just Care Pilot program.'",
        "'speaker_0': 'I think my concern with this particular amendment is, is is that I do worry that what it would do is effectively take money that we had designated for participatory budget processes. And ahead of the designated process in the provisos that I sponsored last fall.'",
        "'speaker_0': 'Begin, begin the process of re appropriating those dollars to a different use. So I'm concerned about about that cognitive dissonance that Councilmember Lewis described in his opening remarks. But I also worried that that we have not done the necessary work with some of the impacted stakeholders to ensure that they understand what the effect and the impact would'",
        "'speaker_0': 'be of adoption of this particular amendment in the context of the of the the Base Council bill. So for for those reasons, I'm not going to be able to support the amendment in its current process and form and presentation.'",
        "'speaker_0': 'That does not mean that I am not supportive of just care and models like just care. I think we've all taken really strong votes and have taken important, important steps to make sure that that model is continued to be supported.'",
        "'speaker_0': 'And we, in fact, have the Seattle rescue plan before us. That was on today's introduction referral calendar that allocates no less than $49 million to additional homelessness and housing needs throughout the city, and will continue to have those conversations not just as part of tranche one of those federal dollars, but as tranche two of federal dollars.'",
        "'speaker_0': 'And I just want to make sure that that the viewing public understands that that that. Will continue to be an opportunity to meet the needs described by Councilmember Lewis, which I absolutely believe 100% of this council is an agreement that we need to do, and we must do more and more urgently to to meet the needs of'",
        "'speaker_0': 'those. We're unhoused in the impacts that that that creates on the city as a whole. So for that reason, we're going to be able to. To support this particular amendment at this juncture. Any other comments or questions before Casimir Lewis gets the last word.'",
        "'speaker_0': 'I'm not seeing any other hands raised. So because we're loose, I'm going to ask you to make closing comments so we can close out debate here and call this amendment to a roll call.'",
        "'speaker_2': 'Go. I'll be brief, council president, because I know that there's probably going to be a lot of speeches on the underlying bill. So, you know, I appreciate the council's consideration and I do own that. This was sort of a spur of the moment amendment, so it wasn't really socialized with a lot of our partners.'",
        "'speaker_2': 'So, I mean, I'll own that. I do appreciate the discussion that it generated. I do think we should start to think of some of the salary savings that are being realized from police department attrition for projects like this, regardless of whether this amendment passes or fails.'",
        "'speaker_2': 'You know, I mean, another consideration that I'll just say here to you, I mean, for people who are advocates more about taking those savings and doubling down on. You know, increasing the resources for the police department. You know, the police department can only staff up so much in a given year.'",
        "'speaker_2': 'We funded their their hiring plan for the year already. This entire bill has absolutely no bearing on that. Our provider community can staff up faster to do some of the public safety work that a lot of people clamoring for for more police don't know it yet, but they're actually clamoring for people like just care to get hired'",
        "'speaker_2': '. And I think that it could be a way for us to have a conversation that connect. There's a traditional salary savings where it's like, you know, we could hire more cops, not going to be here for three or four years because of how long it takes to hire them.'",
        "'speaker_2': 'Or we could hire some of these things that happen quicker. And, you know, hopefully this amendment discussion queues up a discussion like that. And, you know, I'm ready to to vote on it and move on to the underlying bill.'",
        "'speaker_0': 'Okay. Great. That does conclude discussion on proposed Amendment two. So I'm going to go ahead and ask that the clerk please call a role on the adoption of amendment.'",
        "'speaker_1': 'To the House. Yes. Revolt? Yes. Whereas. Yes. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. No. What's that? I like Peterson. Oh. Salon? No. Council? President Gonzalez.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Five in favor, four oppose.'",
        "'speaker_0': 'The motion carries, the amendment is adopted and the amended bill is now before the Council. Are there. Now I'm going to open it up to comments on the bill as amended. So are there any further comments on the bill as amended?'",
        "'speaker_0': 'And Councilmember Herbold, you'll get the last word on the bill as we close out, as we close that debate. So, councilor slot, I see that your hand is raised. If anyone else wants to speak to the to the bill as amended, please do let me know by raising your hand because of this one, please.'",
        "'speaker_3': 'Thank you. This bill has become a farce. It has been amended and amended until it now does almost exactly the opposite of what it initially claimed to do. It is the bill that formally would have removed $5.4 million from the police department for socially beneficial purposes.'",
        "'speaker_3': 'And now, effectively, this bill increases the police department's budget by $4.5 million. As George Orwell said in 1984. Quote, The Ministry of Peace concerned itself with war. The Ministry of Truth concerned with lies, the Ministry of Love with torture, and the Ministry of plenty with starvation.'",
        "'speaker_3': 'These contradictions are not accidental, and nor do they result from ordinary hypocrisy. They are deliberate exercises in doublethink. And. This bill has become an important case study into how the political establishment, including the Democratic Party, shelters the police from accountability again and again.'",
        "'speaker_3': 'When the police murder of George Floyd inspired a mass movement for black lives across the country and around the world, thousands of Seattleites took to the streets, tens of thousands to the streets to protest police violence. Those overwhelmingly peaceful protesters were met with yet more police violence.'",
        "'speaker_3': 'Tens of millions of dollars in police overtime. Tear gas, pepper spray, blast balls, flashbang grenades. Airplanes with forward looking infrared. Real time video and mass arrests were used by the police to essentially wage urban warfare against the people of Seattle in the context of the largest street protest movement in U.S. history.'",
        "'speaker_3': 'The majority of the city council. Seven of the nine council members pledged to support the movement's demand to defund the police by at least 50%. City councils in other cities made similar promises when it came to the budget.'",
        "'speaker_3': 'However, on the Seattle City Council, I was the only elected representative to stand with the movement's demand. Not only did the majority of the council, all Democrats refuse to follow through on their pledge to defund the police by 50%.'",
        "'speaker_3': 'But also at the last council meeting of 2020, when the Council was told that the police had overspent their budget by $5.4 million to brutalize the Black Lives Matter movement. The majority of the council voted to retroactively give the police those $5.4 million extra.'",
        "'speaker_3': 'Again, I was the only council member to vote no. At the time, the majority of the council promised to take that $5.4 million from the city's 2021 budget to hold them accountable. And I warned at that time that that could not be trusted.'",
        "'speaker_3': 'And here we are. Do council members remember their promises to the Justice for George Floyd movement? Council members and members saying they support defunding the police by 50% last summer. Then do council members remember saying that they cannot defund the police by 50% in 2020 because reducing the number of police officers would take up to four months'",
        "'speaker_3': ', but that they promised to do so in 2021. Then do council members remember saying they cannot defund the police by 50% in 2021 because that would require reducing the number of officers in 2021? And before they do that, they will first need to research out of order layoffs.'",
        "'speaker_3': 'As a side note, doing police layoffs out of order was never a demand of the Black Lives Matter movement. Then do council members remember adding $5.4 million to the police budget in December of 2020, but promising to remove it again in 2021?'",
        "'speaker_3': 'Now going team members are saying that out of order layoffs of police are not possible. And please forget that they ever promised to reduce the size of the police force and forget about removing $5.4 million that the police extorted in 2020.'",
        "'speaker_3': 'No. Rather than a bill that has the police breaking even by cutting in 2021, what was added in 2020? This bill has been amended again and again until it actually add to the police's available budget. It cuts $3 million from the police budget with one hand and gives the police access to $7.5 million with the other hand'",
        "'speaker_3': 'by lifting two provisos. As Malcolm X famously said, If you stick a knife in my back nine inches and pull it out six inches, that's not progress. Essentially, the R consequence, the police department's consequence for going over budget last year is to get extra money this year.'",
        "'speaker_3': 'This is what police accountability looks like to the Democratic Party's establishment. Ultimately, this is about the power of mass movements on the streets. At the height of the movement, council members promised to defund the police by 50%. A couple of months later, that was reduced to just a couple percentage points and a promise not to add that'",
        "'speaker_3': 'funding back at the end of the year and a couple of months later. Here we are. The lesson for our movement is that we must depend on our own strength and not put our faith in the establishment. Finally, I would also like to respond to the excuse that has been circulated that the Council cannot defund the police'",
        "'speaker_3': 'without the agreement of the federal monitor. I want to be clear. Also, members vote on the budget, not the Federal Monitor and council members are responsible for their own votes. If council members agree with the Federal Monitor or any other part of the political establishment, that is their political decision.'",
        "'speaker_3': 'But it is not something that the federal monitor decides it down to. The city council is the city's highest legislative body. I do not agree with the Federal Monitor or any part of the political establishment. And my vote as my votes always and including this one, will reflect that.'",
        "'speaker_3': 'If council members were serious about defunding the police, they would pass the budget that defund the police. What would Judge Roberts to place an injunction on the city budget as a whole? That's not realistic. So instead, we get letters from the federal monitor expressing concern and council members fear mongering that those letters are legally binding court decisions'",
        "'speaker_3': ', which they are not. Of course, if council members were serious about defunding the police, they would certainly not be increasing the police budget, which is what this bill does now. Working people will both need to get organized and fight to win an elected community oversight board with full powers over the police, including hiring and firing subpoena powers'",
        "'speaker_3': 'and policies and procedures. My observation from having talked to hundreds of people in a politically broad spectrum is that even the working people who are not sure about defunding also strongly support an elected community oversight with full powers over the police.'",
        "'speaker_3': 'This bill is not accountability. It is the opposite. And if you track its progression over the last year, it shows the myriad of ways the political establishment protects the police from accountability. There are conservative politicians who openly advocate for police violence.'",
        "'speaker_3': 'There are liberal politicians who pretend to be horrified by police violence but always have an excuse for not following through on their promises. There are federal courts who throughout history have defended the power structures of the ruling class against movements and ordinary people to the point that the consent decree against police violence is used to prevent grassroots'",
        "'speaker_3': 'efforts to stop police violence. This is what it means when our movement says we need system change. This is why I am a socialist. I voted against the substitute bills in the committee that transformed a $5.4 million. Police got to a $4.5 million police ad because those substitute amendments have gone from this bill.'",
        "'speaker_3': 'I will now vote no on this final bill. Thank you.'",
        "'speaker_0': 'Thank you, Kels. Verizon. Are there any other comments on the bill as amended? Councilmember words, please.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'I'm going to vote to support. And I hope I say this right. Please correct me if I'm wrong. I want to support Councilmember Herbold, which means that she. So you'll figure that part out. But let me just say what I what I want to say, and I'm not going to.'",
        "'speaker_1': 'I always respect what Councilmember Stewart has to share with us. But in the real world, we don't always have the luxury to just talk about the political establishment or completely disagree all the time with a federal court judge or a court monitor.'",
        "'speaker_1': 'And sometimes it's just not realistic to just completely and decisively decide that you're going to wipe out a whole police department. We do have a charter that we have to uphold, whether it's one officer or 1200 officers. We have to have something there.'",
        "'speaker_1': 'And I think what this council has demonstrated in the last year is that public safety is community safety, and community safety is protectors, not warriors. And more officers doesn't make us more safe. And I think we all agree on that.'",
        "'speaker_1': 'I don't think there's no need to. Point fingers and call names and we call the Democratic establishment or whatever. So meanwhile, back on Earth, I just want to say this, particularly to Councilmember Morales. I want to end this chapter because I think it's caused, as you've all heard me say before, a lot of trauma.'",
        "'speaker_1': 'And I want to start the healing. And I think Councilwoman Morales, with her hard work and tenacity, is going to allow us not only to close the chapter, but to begin a new chapter with participatory budgeting. And I agree with the council president.'",
        "'speaker_1': 'We're not pitting one idea against the other. Both can be true and it will continue to be true. And we will continue to do that because as elected leaders, we can't just pander to our base or to a echo chamber.'",
        "'speaker_1': 'We have to represent all of Seattle and the needs of our city. And if anything, over this year, I think what we've learned is that we are going to reimagine and redirect funds from the police to upstream projects to take away from the harm in the trauma that has happened in our communities.'",
        "'speaker_1': 'Everyone agrees about that, and for the first time, what we're learning is we're finally putting together a plan. It's not perfect, and not everyone will always agree. And I want to thank Council member Lewis for bringing this forward to shift the 2 million over to the just care.'",
        "'speaker_1': 'So whether it's participatory budgeting, whether it's just care, these are conversations that we weren't having a year ago or six months ago. And now we are through the leadership of everybody. I am in the camp of closure. Being decisive, being a leader, making a decision and moving forward and moving on.'",
        "'speaker_1': 'And I'm also in the camp of believing in this great city and healing. And I think that's what's going to happen today. That's how I'm going to vote today. And. I think we've all been through a lot, and I don't think it does us any good to continue the divisiveness.'",
        "'speaker_1': 'We've all experienced different levels of frustration, and I think Councilmember Lewis outlined some of that. When people come to us, call us when they want camp removals, when they are upset about the homeless, when they're upset about the police.'",
        "'speaker_1': 'And I think that we've seen it in the city. Sorry about that. And we've seen it nationally, not just in this great city, but across this nation. And I'm ready to turn the page. And get some stuff done.'",
        "'speaker_1': 'So I will leave it at that. Thank you.'",
        "'speaker_0': 'And you can't awards for those comments. I really appreciate it. Next up is Customer Morales.'",
        "'speaker_1': 'I will be brief. I will say that I voted against this bill twice in committee, so I don't think my vote is going to be a surprise here. And, you know, I think for me, this really does come back to the original intent of this bill, which had been to hold the department accountable for their overspending.'",
        "'speaker_1': 'They've already acknowledged that they could absorb the, you know, reduction through salary savings. And if they find later that they have additional needs, they can always come back to council to request additional funds. That's how we hold the department accountable.'",
        "'speaker_1': 'The only thing that in their request that isn't new, that we know that they are obliged to pay is the separation pay. And again, salary savings could cover this. So my feeling about this is that Sbv created its own funding crisis when they decided to overspend on overtime last summer, and giving the department more funding won't prevent'",
        "'speaker_1': 'crime. It won't address homelessness or reduce substance abuse. It won't improve mental health outcomes for our community members. Only investing in community services will do that. And so our goal, I think, which we share, should be investing public dollars in a way that can actually change community conditions on the ground so that it leads to better health'",
        "'speaker_1': 'and well-being for our neighbors. And rewarding city for overspending outside of its budget authority won't accomplish that. So I cannot support this bill and will be voting whichever way it is that registers that disagreement.'",
        "'speaker_0': 'Okay. Because there's some.'",
        "'speaker_1': 'Some.'",
        "'speaker_0': 'Some lack of procedural understanding, as you all frame your thoughts here, a yes vote on council bill. Whatever the bill is, number is is an actual yes vote on passage of the bill. A no vote is you're voting the bill down.'",
        "'speaker_0': 'So. And look at Councilmember Herbold is disagreeing with me and also confused. She thinks she's supposed to also vote no. So that that I'm going to call upon the clerk. My understanding is that there is a recommendation from the committee to not pass the bill.'",
        "'speaker_0': 'But my understanding is that that doesn't that doesn't change how a yes or no vote effectuate the passage of this bill. So, Madam Clerk, can you just help us understand, is it the inverse or is it business as usual in terms of how we vote here?'",
        "'speaker_0': 'Council President Gonzalez It is confusing because the committee recommendation was to not pass, but in order to bring it forward today, we had to make a motion to pass the bill. So the motion before us right now is to pass this bill as we just had it amended.'",
        "'speaker_0': 'So if you are in favor of the underlying bill, you are going to vote to pass it. But if you're opposed to the underlying bill, you're going to not. Which is totally opposite of what came out of committee.'",
        "'speaker_0': 'But that's where we're at. I apologize for the confusion. No, no, no. I just want to note for the record that my procedural prowess and I remain the queen of process here. So I am feeling like that's a win already for this week.'",
        "'speaker_0': 'So again.'",
        "'speaker_5': 'If you want this bill to pass.'",
        "'speaker_0': 'In spite of the committee recommendation, you're going to vote yes. Okay. You want this bill to fail consistent with the committee's recommendation for a do not pass thing, you're going to vote no on the. Okay.'",
        "'speaker_5': 'You are the queen.'",
        "'speaker_0': 'Somebody send me a crown. All right. Next up is I think hold on. Let me look at this. Got a little Keesmaat Peterson is next. And then Councilmember Mosqueda.'",
        "'speaker_2': 'Thank you, council president. First, I'd like to commend Councilmember Herbold for her hard work as chair of Public Safety Committee and her her work to craft a compromise on this bill. Even though I'm not an agreement on several elements of it, I just want to commend her for trying to work through this and come up with a'",
        "'speaker_2': 'compromise and echo many of the comments that council from Juarez mentioned. I have worked hard to be clear and consistent for my constituents, and at this time I cannot support what I see as additional cuts to public safety until effective alternatives are in place.'",
        "'speaker_2': 'This council bill is complex, especially with the amendments, but at the end of the day, it continues to reduce resources from our police department at a time when we are seeing record breaking attrition of officers. So I will be voting no.'",
        "'speaker_2': 'I believe it's premature to label the loss of police officers through attrition as budgetary savings that can be immediately scooped away and spent elsewhere. The record breaking attrition of officers is alarming, and response times to priority number one calls are too long.'",
        "'speaker_2': 'By the end of the year, I want to be sure the department has the funds it needs to hire more crime prevention officers, to retain good officers to ramp up recruitment of diverse and progressive officers, to implement the federal consent decree and heed the warnings of the federal judge and monitor to increase training to return experienced officers'",
        "'speaker_2': 'to community policing work instead of working overtime on patrol. Yes, let's let's lift the budget provisos to free up some of those dollars, but not by ultimately cutting more with the other hand. While the intentions were positive, I believe this bill has become a distraction since it was can since it was conceived six months ago.'",
        "'speaker_2': 'Despite the well-intentioned amendments at committee and today, I believe this bill sends an unproductive and negative message to the remaining government workers and public safety field who are already stretched thin. It also takes time and attention away from the most impactful task at hand for justice and reform.'",
        "'speaker_2': 'And that's revamping the unjust, inflexible and expensive contract with the Seattle Police Officers Guild. So I look forward to getting back to supporting the work of our Labor Relations Policy Committee so they can revise the police contract in a way that's positive for the community, for the officers, for the budget, and for sustainable and systemic justice.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Maybe it gets more. PIERSON Because we're almost at a place. Thank you. Council President. I, too, want to thank council member Herbold. Cosmo Herbold Thank you very much. As Chair of Public Safety. You have really taken the reins in shepherding this bill through your committee.'",
        "'speaker_0': 'And we know that that's been no small task, that this has been months of work, and it's been increasingly made more difficult when the chief and the executive offices have weighed in, when the judge and the court monitor have been weighing in.'",
        "'speaker_0': 'This legislation, I believe, was intended to hold us accountable for their overspending last year. And our intent, as we described at the end of last year, was to use the council's power of the purse and the legislative branch, as we are supposed to do, to ensure that the executive agencies spend within the bounds of their budget and'",
        "'speaker_0': 'to make sure that there has been a reckoning or a balancing between this year's budget in a speedy and last year's overspend. As we heard in the Budget Committee just last month, it is very highly irregular for our council to be asked to authorize spending after the fact and to have a retroactive authority granted should be something'",
        "'speaker_0': 'that is very uncommon and happen very infrequently. But that's not been the practice here as it relates to speed. Not only is it highly irregular, it's out of alignment with what we see in the states are S.W. 3532 A where it says there shall be no orders, authorizations, allowance, allowances, contracts or payments made or attempted to be'",
        "'speaker_0': 'made in excess of the expenditure allowances authorized in the final budget or is adopted or modified, and any such attempt in excess expenditure shall be void. That's what the RTW says. Yet that's exactly what happened last year. And so the provisos that we put into place we now know were ignored or dismissed by speeding at the time'",
        "'speaker_0': ', and instead what spending was authorized for last year is our priorities that the Council did not want to see prioritized. And what it left on the table for funding was things that the Council absolutely wants prioritized, like payment for family leave and benefits and severance.'",
        "'speaker_0': 'These are items that we could not simply just not pay. So at the time, just as a reminder, the council authorized an after the fact authorization for those payments. That overspend total was 5.4 million. And there was a desire and I think there continues to be a desire by me that this budget rectifies that overspend and that'",
        "'speaker_0': 'this year's budget corrects for the overspend that SPV created in terms of their debt from last year, that the $5.4 million number is not arbitrary. It comes from the following three items in last year's overspend by a speedy 1.9 million FEMA reimbursement, 1.9 million in parental leave payback, and 1.6 million in separation pay.'",
        "'speaker_0': 'All of these things we knew were important to pay, but unfortunately, those were left to be paid instead of the department paid money on items that we heard about during testimony today. We've seen the videos and we've heard from firsthand, firsthand accounts of where people had been that with excessive force for expressing their First Amendment rights at'",
        "'speaker_0': 'the protests that were taking place just a year ago this week. The testimonials today constitute, I think, a makeshift tribunal on what was experienced at the time of protests a year ago. And we remain, I think, as a council committed to making sure that there is accountability for those pieces, not only accountability for the overspend in the'",
        "'speaker_0': 'budget, but accountability for the situations that we continue to hear about on a daily basis and that we're outlined in today's public testimony. We remain in the midst of a federal consent decree that's almost a decade old now.'",
        "'speaker_0': 'And we also remain committed to addressing the call for action from the folks who have been calling in for over a year to make sure that we align we realign our investments into things like mental health and case managers, making sure that homeless folks have social service providers showing up, and that when there's a traffic infraction, that'",
        "'speaker_0': 'we don't have armed officers showing up for these things. The council has begun some very important efforts, a lot of those efforts led by Councilmember Herbold through her committee and ongoing work in the budget last year. And I appreciate that those investors initial investments were made to align our values to what the community has been calling for'",
        "'speaker_0': 'and to divest in areas that have been overinvested in over the year. On this bill. I think that what we are trying to do is what we were trying to do was respond to the need to balance that $5.4 million addition that council was forced to make last year and to remove it from this year's budget.'",
        "'speaker_0': 'And doing that while also having to respond to the calls from the court monitor and judge, I think that made this bill a little bit out of alignment with what we were originally intending to do. I disagree with the concerns and the fears cited by the court in the monitor, and I hope that the court and the'",
        "'speaker_0': 'court monitor do listen to all of the public testimony that was provided today through this quasi tribunal that was offered via public comment, and that there is a careful examination of the central staff memo that accompanied the conversation around this bill.'",
        "'speaker_0': 'Notably, the Council has not put speedy in a position where they are not able to respond to emergency calls or perform basic functions. And the department does have the resources to fulfill the full hiring plan as we funded last year.'",
        "'speaker_0': 'Central Staff's Memo does the math that shows that Spd's entire staffing model is still fully funded and that it is expected that there will be 13 millions in salary savings over the course of this year. I think it's important to continue to remember that Spd's hiring plan, as requested by the mayor and the department, is still intact'",
        "'speaker_0': 'and that it can be what was known to be reasonably accomplished was fully funded. Through the committee process, we've learned that due to continued higher than attrition rates, that $13 million in salary savings is anticipated. And I am hopeful that with this bill, if it does not pass today, that we can direct those funds, those 13 million'",
        "'speaker_0': 'to things where I think that there is common agreement between what the bill offers and what I think we all would like to see. And that's more a quick response and accurate and adequate response to the public records request.'",
        "'speaker_0': 'Making sure more funding goes into community service officers. The I.T. needs the physical storage of space. And even if we were to fund all of those things and fully fund the and fully make the $5.4 million cut so that we could both fund just cares and participatory budgeting, there would still be over $5 million in unspent dollars'",
        "'speaker_0': 'at the end of this year. I think today's testimony was very powerful. I think it's heartbreaking that the stories have continued to surface about the violence, which has upset her. And I do hope that this testimony from today helps to paint a full picture of the issues that we have been trying to address, trying to rectify in'",
        "'speaker_0': 'this year's actions and last year's budget. But unfortunately, on this bill today, I will be voting no because I am concerned about the $5 million proviso that's being lifted. I'm concerned that there's not a full $5.4 million cut, though I appreciate that.'",
        "'speaker_0': 'It's a mere $3 million in cuts that's been suggested here. And I will continue to work with my colleagues here and look forward to continuing to work with the community to continue the path to make sure that we are holding accountable the department that overspent their budget outside of what the RTW directs the department to stay with'",
        "'speaker_0': 'within, and that we continue our efforts to reimagine and reinvest in community services and decrease the situations in which an armed officer is being required to show up again. The city of Austin, Seattle, New York and Los Angeles are among the four cities that are continually held up as being on the right path towards reimagining.'",
        "'speaker_0': 'And that work is not done, and we will continue even after today. But I appreciate the work that's gone into this, and I recognize the incredible obstacles that the good chair has had to address. Well, considering this legislation and I really appreciate her work and we're going to we will not be able to.'",
        "'speaker_0': 'Thank you, Councilor Muscat. Are there any other comments? On the bill as amended. Okay, colleagues, I just really wanted to quickly make some remarks as well. I do want to, like so many others have. Start by acknowledging Councilmember Herbold is hard work over the last several months to make progress on this legislation and to try to develop'",
        "'speaker_0': 'a sound and well-reasoned approach to this particular budget action that the Council has literally been considering since December. And so I do really appreciate her willingness, councilmember her willingness to engage all of the parties that have expressed concern or interest in our legislation over the past several months.'",
        "'speaker_0': 'That includes community advocates, CPD and the mayor's office, and also the Monitor and Department of Justice Representatives, as well as members of the Public Safety and Human Services Committee. And I think that the fact that it appears that almost all of the stakeholders involved in this budget action or who have interest in this budget action, appear to'",
        "'speaker_0': 'be to be similarly dissatisfied with the current version of this legislation. I don't think that that's a reflection on Councilmember Hubbard's policy work and efforts in the background to get us a piece of legislation that we could potentially support.'",
        "'speaker_0': 'But I do think it's a reflection and the result of, quite simply put, the deep division that exists in our city on the issue of policing and and their budgets. So I think, you know, fortunately, despite Councilmember Hubbell's well-intentioned and thoughtful attempts to find a compromise solution here on this particular bill, I will be voting consistent with'",
        "'speaker_0': 'my vote in committee, which is a vote against this bill, as I expressed during the Public Safety Committee's discussion of this legislation. My reasons for voting no on this bill are a little different. I feel I feel primarily that it's premature for us to be making several of the budget actions that the bill proposes.'",
        "'speaker_0': 'We compromise on including cuts to the Seattle Police Department's budget that the Monitor has significant concerns with. I believe it's important that we have further engagement with the Monitor to provide additional explanation about how this cut will impact or more importantly, not impact the department's ongoing operations, specifically the staffing plan.'",
        "'speaker_0': 'It also, of course, lifts the $5 million proviso on the speedy staffing plan. In my opinion, I think it's still too early in the year to fully lift or begin the process of lifting the proviso in order to give us additional flexibility with our budget.'",
        "'speaker_0': 'I'd like to continue to have you know, we of course, continue to have significant policy disagreements with with leadership about how they manage the department's budget, including overtime. And so I continue to believe that this proviso right now serves an important role as an accountability mechanism.'",
        "'speaker_0': 'And it's my position that the council needs to retain this proviso, the $5 million proviso in place until later in the year, so that we can effectively execute our oversight role and ensure the Department is not expending resources in a manner counter to the policies set by this Council.'",
        "'speaker_0': 'So again, I think that more appropriate time for us to consider those lives would be in the fall budget process when we have a better understanding and fuller context of what MPD budget will be at the end of the year.'",
        "'speaker_0': 'We know that the executive will be back before the Council with proposed budget changes later this year. That's going to include costs associated with grant acceptances, special events, overtime cost, separation, pay, pay, family medical leave reimbursement. These are all issues that may need to be addressed, may need to be addressed via a supplemental ordinance or through the'",
        "'speaker_0': 'ordinary budget process. So months from now, when the council's making these decisions on a city's budget. I believe we will have more flexibility to take more thoughtful action if the proviso is still in place and if any of the other provisos are still in place.'",
        "'speaker_0': 'So for these reasons, I am going to vote consistent with my committee vote, which is a no vote on this particular version of the Council bill, but do deeply appreciate everybody's hard work on. This is not easy and I know that we are all reaching our votes for some similar reasons and some different reasons.'",
        "'speaker_0': 'But. But I hope we can continue to move forward on this really critical issue together with as much consensus as possible. So with that being said, I'm going to hand it over to Councilmember Herbold to close out debate so we can call this bill to a roll call.'",
        "'speaker_0': 'You. Sorry about that.'",
        "'speaker_4': 'Just a quick note. So closing out the discussion first, want to respond to a number of the comments I heard from folks during public testimony, speaking to their experiences with excessive use of less lethal weapons, which can be lethal.'",
        "'speaker_4': 'I appreciate the testimony and regret these experiences in our city. I do want to say that this is another issue that is under the purview of the consent decree. The Council adopted legislation prohibiting the use of most less lethal weapons.'",
        "'speaker_4': 'The judge overseeing the consent decree placed a restraining order on the council's legislation and criticized the legislation for not protecting public safety. The legislation under the consent decree requires his approval, so just barreling ahead in this instant means that nothing has happened.'",
        "'speaker_4': 'We have no ban or regulations unless lethal weapons similarly barreling ahead with the budget bill risk the same outcome that no budget reduction will happen. In my opinion, calling your vote about a political win on either side of this issue.'",
        "'speaker_4': 'Yes, those who don't support any cut at all don't like this bill. And those who want the cut to be bigger don't like it either. But this bill is not about a number. It's about bringing about accountability. The objective of this bill is to exercise fiscal oversight of the Seattle Police Department while simultaneously funding important public safety'",
        "'speaker_4': 'investments in areas where there was broad agreement and heeding the authority of the consent decree in these matters where the court is suggesting suggesting our actions overlap with consent decree obligation over the last to still was voted out of committee with a do not pass recommendation with three votes in opposition to despite the fact that the majority'",
        "'speaker_4': 'of committee members three members voted in favor of the amendment on May 11th and in favor of substituting the original bill for a smaller budget reduction in March over the summer and fall budget cycles. The council listened to people calling for a 50% cut to the Seattle police to budget budget.'",
        "'speaker_4': 'And we also listen to people who opposed it. And we demonstrated that we can listen to multiple voices in our city and compromise to meet our objective, objective to redefine public safety in our city. The ability to listen to multiple voices is critical to change moving forward.'",
        "'speaker_4': 'The councilmember mosquitoes point that request for funding after the fact should be rare. I agree, but it's June and this separation and technology needs funding. Funding needs were identified by speed in February. If this bill fails, we are virtually guaranteeing that this dysfunction will happen again later this year.'",
        "'speaker_4': 'To council President Gonzalez's point about the timing of the $5 Million proviso left. Just a reminder, this is not a full lift. This is a gradual lift as we get reports from us. PD and respectfully. This was in the amendments supported back in March that that we, the majority of committee members voted in favor of bringing it'",
        "'speaker_4': 'in front of us. And if there was concerns about that approach, I would have happily considered a different approach had I known. Speedy's highest spending is during the summer and as we found out last year during the supplemental budget process, most of the money will already have been spent.'",
        "'speaker_4': 'We'll hear a vote today. Please do not allow both those who do not want us to exercise oversight of a speedy budget at all, as well as those who advocate for an all or nothing approach to revert us back to the status quo.'",
        "'speaker_4': 'If this bill doesn't pass, there will be no budget cut at all. So council members who wish to support the investments in the bill and the Council's fiscal accountability over a speedy. I urge you to vote. Yes. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilmember Herbold, for your final remarks. That does conclude debate on this particular bill. So at this point, I'm going to ask the clerk there, please call the roll on the passage of the bill as amended.'",
        "'speaker_1': 'KRAUSS No. Her bold. Whereas. Yes. Lewis. Yes. MORALES No. Must get to.'",
        "'speaker_0': 'Know.'",
        "'speaker_1': 'PETERSON No. Silent? No. Council President Gonzalez.'",
        "'speaker_0': 'Now.'",
        "'speaker_5': 'Three in favor, five opposed.'",
        "'speaker_0': 'Key. The motion fails and the bill does not pass. Okay, colleagues, thank you so much for that conversation and that debate. Again, I really want to appreciate all of the hard work that has that went into that very long legislative process.'",
        "'speaker_0': 'And again, that my deep gratitude and thanks to Councilmember Herbold, who is our current public safety and Human Services Chair, having served in that role for four years, I understand how difficult and challenging it is, and I have a tremendous amount of respect for you and the work that you continue to do.'",
        "'speaker_0': 'And and I know that you will continue to lead us and work with all of us on these really important issues. So thank you so much for your effort. Okay. Next up is item eight. Will the court please read the short title of item eight into the record?'"
    ],
    "Property Transfer to Phinney Neighborhood Association for Social Services.": [
        "'speaker_4': 'The Report of the land used in neighborhoods.'",
        "'speaker_0': 'Committee agenda Item eight Council Bill 120086 An ordinance relating to the transfer of city.'",
        "'speaker_4': 'Property located at.'",
        "'speaker_0': '5 to 5 North 85th Street. Authorizing the convenience of the property to the Finnie Neighborhood Association, a Washington nonprofit corporation consistent with the intent of Resolution 31856 and to provide for the continued delivery of social services.'",
        "'speaker_4': 'The committee recommends the.'",
        "'speaker_0': 'Bill pass as amended. Thank you so much, Cassandra Strauss. You are the chair of the committee, so I'm going to hand it over to you to walk us through the report.'",
        "'speaker_2': 'Thank you. Council President and thank you, Deputy Clerk Schwinn. CB 12086 Transferring the property at 525 North 85th Street to the Finney Neighborhood Association enacts a transfer of the Greenwood Senior Center from the city to the Finney Neighborhood Association, which currently operates the the Senior Center.'",
        "'speaker_2': 'This transfer is being done in line with the city's process for mutually offsetting benefit properties, and it was meant to be transmitted to council last year alongside the transfers of Byrd Barr Place in the Central Area Senior Center.'",
        "'speaker_2': 'Unfortunately, it was delayed and it's now before us, so this was intended to be part of that package. Under the terms of the transfer, if any neighborhood association would receive ownership of the property and would be obligated to continue providing the social services associated with the senior center.'",
        "'speaker_2': 'Additionally, should a future redevelopment on the site occur, the agreement requires that affordable housing that any housing be affordable to 80% of the area. Median income and at least half of the units would be affordable to 60% of the area median income.'",
        "'speaker_2': 'We made one amendment in committee from Councilmember Peterson. Thank you, Councilmember Peterson, for your amendment to clarify language that allows the city to reclaim ownership in the event that any neighborhood association does not meet its obligations. I can tell you many in our community have been very eagerly awaiting the passage of this bill, and I look forward'",
        "'speaker_2': 'to passage today. I recommend a yes vote. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. Are there any additional comments on the bill? Hearing on the clock. Please call the role on the passage of the bill.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_0': 'Sounds great. Yes.'",
        "'speaker_1': 'Thank you. Councilmember Suarez I. Lewis? Yes. Morales s most thorough. I. Peterson.'",
        "'speaker_2': 'Oh.'",
        "'speaker_1': 'So aren't. Yes. Council. President Gonzalez, I am in favor when opposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. Will. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read item nine into the record? Agenda Item nine Council Bill.'"
    ],
    "Grading Code Update and Alignment with Other Codes.": [
        "'speaker_4': '120084 An Ordinance.'",
        "'speaker_0': 'Relating to land disturbing activity. Updating the greeting code to align with updates to other codes and amending sections. 22.170.02. 0.050.060.070.110.190 of the Seattle Animal Code.'",
        "'speaker_4': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much, Madam Clerk. And colleagues, my apologies for not using my camera. My my Wi-Fi here is glitching a little bit, so it seems to improve when I turn the video off. If that resolves, I'll make sure to turn my video back on.'",
        "'speaker_0': 'But in the meantime, to hand this over to Councilmember Strauss, who is the chair of the committee and is going to walk us through this piece of legislation.'",
        "'speaker_2': 'Thank you, council president and thank you, Deputy Clerk, showing the this legislation and the next two bills are all related to the technical codes that are updated regularly by the State Department of Construction Inspection. These bills come to council after years long process processes that begin with updates to internal guidelines and eventually continues on to state level'",
        "'speaker_2': 'updates and finally, city level updates. This legislation specifically is updating the grading code, which is flat surfaces without subterranean anything and no buildings. This will be the first update to the grading codes since 2009 and the updates are minimal.'",
        "'speaker_2': 'Examples of the changes in this code include requiring a grading permit when land disturbing activity on a site exceeds 5000 square feet rather than one acre, requiring a grading permit whenever groundwater is being extracted and broadening the definition of potentially hazardous location to include any site on EPA or ecology list form this investigation or cleanup of contamination'",
        "'speaker_2': '. This is technical in nature and I urge a yes vote. Thank you. Council President.'",
        "'speaker_0': 'Thank you so much, colleagues. Are there any additional comments on the bill? Hearing? None. Will the clerk please call the role on the passage of the bill?'",
        "'speaker_1': 'Else?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold as. Whereas I. Lewis.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'MORALES Yes. Hostetter, I. Peterson Yes. Want. Yes. Council President Gonzalez I nine in favor and unopposed.'"
    ],
    "Amendments to Seattle's Construction Codes.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the first please affix my signature to the legislation on my behalf? Will the clerk please read item ten into the record? And the short title is fine. Jan Item ten Council Bill 120083 An ordinance relating to Seattle's construction codes amending section 7.13.1, 3.7 and 16131.1.'",
        "'speaker_0': 'And Table 20 902.1 of the 2018 Seattle Building Code adopted by Ordinance 126278. The committee recommends the bill pass rate. Thank you so much. Deputy Clerk That was a mouthful. Okay, I'm going to hand back over to Councilmember Strauss to walk us through this legislation as well.'",
        "'speaker_2': 'Thank you. Counsel Present Thank you. Deputy Clerk showing this S.B. Council Bill one to 0083 is updating sales construction codes. We updated the construction codes earlier this year following the same process I described of updating international, state and then local building codes.'",
        "'speaker_2': 'This legislation makes minor technical corrections to the construction codes we updated to ensure the code is and is consistent with the intent. I urge a vote. Thank you, Councilperson.'",
        "'speaker_0': 'Thank you so much. Councilmember Strauss, are there any additional comments on the bill? Herein, none. Will the court please call the roll on the passage of the bill.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'For both.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Whereas I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes.'",
        "'speaker_0': 'Mostrar AI.'",
        "'speaker_1': 'Petersen. Yes. It's a want. Yes. Council President Gonzalez I nine in favor and unopposed.'"
    ],
    "Boiler and Steam Engine Operations Ordinance Amendment.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will Clark, please affix my signature to the legislation on my behalf? Will the clerk please read item 11 into the record? Agenda Item 11 Council Bill.'",
        "'speaker_4': '120085.'",
        "'speaker_0': 'An ordinance relating to boiler and Steam Engine Operations meaning chapters.'",
        "'speaker_4': '6.420 of the Seattle Municipal Code. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss Greer, the chair of this committee. And I'm going to hand it over to you to walk us through this legislation.'",
        "'speaker_2': 'Thank you. Council President. Thank you. Deputy Clerk When this is the last of the three bills, S.B. 120085, which is relating to boiler and steam engine operations. This is the final of our technical code changes and updates. The Steam Engineer and Boiler Operator Licensing Code, which was last updated in 2006.'",
        "'speaker_2': 'The changes include updating the code to reflect the process that has moved online since the last update and adds exemptions for individuals installing boilers on manufacturer instructions and requiring applicants for a license to attest to their training and experience and require that any fees be paid in a month in advance of licensing.'",
        "'speaker_2': 'We urge a yay vote on this highly technical bill. If we had been here yesterday, if we had not had a holiday on Monday, we would still be in the month of May, which was building safety month. I would have been able to say This is the end, concludes the end of our Building Safety Month by updating'",
        "'speaker_2': 'our codes. Instead, I hope that everyone enjoyed May Building Safety Month. Thank you. Counts President Obama. I urge vote.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. Are there any additional comments on this bill? Hearing on a little clip, please call the role on the passage of the bill.'",
        "'speaker_1': 'Strauss Yes. Herbold Yes. Whereas I. Lewis. Yes. Morales. Yes. Mesquita, I. Peterson, I. Sawant Yes. Council President Gonzales. I am not in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please fix my signature to the legislation on my behalf? Will the clerk please read item 12 into the record? Agenda Item 12.'"
    ]
}