{
    "Income Tax on High-Income Residents for Public Services and Green Jobs.": [
        "'speaker_1': 'Bill passed and chair of Senate Bill. Both bills passed into law will sign both bills. Please read the report of the Affordable Housing Neighborhoods and Finance Committee.'",
        "'speaker_5': 'Report of the Affordable Housing Terrorism Finance Committee and item one Cancel 119002 Imposing income tax on high incomes, residents providing solutions for lowering the property tax burden and the impact of others. Regressive taxes replacing federal funding potentially lost through federal funding cuts.'",
        "'speaker_5': 'Budget cuts providing public services including housing, education and transit. And creating green jobs. Meeting carbon reduction goals and adding a new Chapter 5.65 to set a code. The committee recommends the bill passes amended.'",
        "'speaker_1': 'I believe Councilman Burgess will give some context and some history and I think it will then be pass counts for her vote, if I'm not mistaken. Councilmember Burgess.'",
        "'speaker_0': 'Yes, thank you. I just want to go through the history of our committee's consideration of this legislation. This began on May 1st, when the city council adopted a resolution expressing our intent to adopt a progressive income tax targeting high income households in the city.'",
        "'speaker_0': 'At that time, we indicated that we would pass this legislation by July ten, which is today. On May 31st, the Finance Committee held a special meeting and heard a presentation from local Seattle economists Dick Conway and John Burbank, the executive director of the Economic Opportunity Institute.'",
        "'speaker_0': 'Dick and John briefed us on tax regressive in Washington state. Dick Conway has studied tax policy in all 50 states for many, many years and reported the updated analysis of his work on that, which shows that Washington State has the most regressive taxes in the United States.'",
        "'speaker_0': 'On June 14, we held a public hearing here at Council on the draft income tax proposal. On June 21st, we had our first discussion of the legislation that was introduced, and there was a panel presentation from central staff, the city's finance director, Glen Lee, the city law department and outside legal counsel that was retained by the city'",
        "'speaker_0': 'attorney. On June 30, we held another special meeting of the Finance Committee, and we voted on various amendments to the bill. On June five at the Finance Committee, we voted on the final legislation and recommended it to the full council for adoption.'",
        "'speaker_0': 'Which brings us to today. So Councilman Council President Harrell, I'd like the sponsors, Councilmember Herbold and councilmembers to want to be able to speak. And then after other council members speak, I'd like to close the discussion.'",
        "'speaker_1': 'Very good, Councilmember Herbold.'",
        "'speaker_6': 'And I know Councilmember Gonzalez has an amendment that I think would be appropriate after my context setting of.'",
        "'speaker_7': 'Of.'",
        "'speaker_6': 'The ordinance, so maybe I could speak. And then Councilmember Gonzales, with that.'",
        "'speaker_1': 'That workshop for me.'",
        "'speaker_3': 'I would like to speak after the amendment is voted on.'",
        "'speaker_1': 'Okay. Very good to work through it.'",
        "'speaker_7': 'So as we all know.'",
        "'speaker_6': 'We face a serious problem in the city of Seattle. We have an increasing affordability gap between the haves and the have nots, and the middle class is being squeezed as well. And one of the reasons is our outdated, regressive and unfair tax structure in our state.'",
        "'speaker_6': 'We have the most regressive system in the nation. Local economist Dick Conway has noted that we finished last. When You Can Sit are the five measures of fairness, transparency, adequacy, stability and economic vitality. In our state, the top 1% only pay 2.4% of their income in taxes, whereas the poorest 20% pay almost 17% of their income.'",
        "'speaker_6': 'This is a big step forward in Seattle, but it's also hopefully a big step forward for our state. The council bill was developed according to the principles that we developed and called for in resolution 31747 adopted by the Council on May 5th, and is in addition to creating a process and a timeline for ourselves, we also committed'",
        "'speaker_6': 'to one another that legal viability would be our primary consideration in making decisions around the different elements of this legislation. The outcome has been a 2.25% tax on incomes over $250,000 for individuals, 500,000 for joint filers. And again, that's only on the income above those thresholds.'",
        "'speaker_6': '100% of the income under the thresholds will still be tax free. This is estimated to raise $140 million annually. And we also stuck to the the principles in the original legislation that identified the the purposes for this tax revenue.'",
        "'speaker_6': 'And those purposes are include lowering the property tax burden and the impact of other regressive taxes, addressing the homelessness crisis, providing affordable housing, education and transit, replacing federal funding potentially lost through federal budget cuts. And. Creating green jobs and meeting carbon reduction goals.'",
        "'speaker_6': 'And then finally, the costs associated with administering and implementing the tax. It's been designed for simplicity and designed to minimize the costs of implementation. An important thing to keep in mind is only people with qualifying incomes will will need to file.'",
        "'speaker_6': 'We're hearing from constituents who are concerned that they're going to need to spend money to file a form to demonstrate that they don't need to pay the tax. That is not the way the tax is structured. In a recent poll, 66% of satellites said they support this measure.'",
        "'speaker_6': 'And this is consistent with the 63% of satellites who voted to support the measure in 2010. In this city, support for tax fairness is increasing, and I hope that that continues throughout the state. Many thanks to the Trump proof coalition.'",
        "'speaker_6': 'I do want to say just a couple words about an issue that has come up recently. And I think it's also related to the the amendment that Councilmember Gonzalez is bringing up. There's been some concern about how this legislation treats certain types of business income, specifically those businesses that are organized as sole proprietorships, LLC or escorts.'",
        "'speaker_6': 'And it's important to recognize that not only are individuals taxed in the state in a way that's regressive, but businesses are too. And that's something that, you know, we're going to need to continue to work on. That's part of the commitment of this of this ordinance to dial down the regressive forms of of of taxation.'",
        "'speaker_6': 'But as it relates specifically to those those three types of businesses, it's important to note that the losses that those businesses and the expenses that those businesses invest in their company are not considered as gross receipts. And for the purposes of taxation, those are those can be recorded as losses on their filing.'",
        "'speaker_6': 'And so I just want to make that.'",
        "'speaker_7': 'Perfectly clear for for the viewing public.'",
        "'speaker_1': 'Thank you. Councilman Herbold, Councilmember Gonzalez, did you want to address the amendment at this point?'",
        "'speaker_6': 'Yes. And I'm going to move the amendment first and then have it seconded, and then we can have the discussion. So I'm going to move to amend Council Bill 119002 with this is not marked with a number. Emilio, do I need a reference number or is it just the only amendment?'",
        "'speaker_1': 'Okay. Amendment one and number 1/2, is it okay to move 1/2 for discussion? And Councilman Gonzalez, please explain.'",
        "'speaker_6': 'Thank you. Just really quickly, to dovetail off of what Councilmember Herbold was saying, and I really appreciate your remarks and your recognition of the fact that when we were talking about our tax system, it's important for us to recognize that that the entirety of our tax system is indeed regressive and that the impact that that our tax'",
        "'speaker_6': 'system has, regardless of whether you're an individual or an entity, is that the truth is that that across the board, we still see an incredible amount of regressive taxes, which means that those who make less pay more in terms of taxes.'",
        "'speaker_6': 'And one of the my amendment does two things. One is it recognizes that when we're referring to in the ordinance that there is an impact of other regressive taxes, that that includes business and occupation tax rates. And it also clarifies, consistent with the resolution in Section three, that the funding may be used for responding to changes in'",
        "'speaker_6': 'federal policy, which is consistent with the intent of the resolution that this Council passed earlier this year. And so my my amendment will do two things as it relates to the use of tax receipts. It will acknowledge that some of the funds can be used to take a look at these other regressive taxes, including the business and'",
        "'speaker_6': 'occupation tax rate. And it also clarifies that the funds could be used to respond to changes in federal policy as as we see fit, as the appropriation authority for the city. And I just I just wanted to point out that when we look at the regressive nature of of of our tax system, particular as it relates to'",
        "'speaker_6': 'small businesses, one of the things that the that I tap the Washington taxation organization found was that when you look at the tax rates for sales and excise on business, for those businesses that have an income, an average income of 11,900 they pay for.'",
        "'speaker_6': '8% in sales and excise on business. However, if you are a corporation that makes more than an average income of 1.5 million, you only pay 0.7% into the system. And I think we can all agree that that is an upside down system.'",
        "'speaker_6': 'And it's not fair that very, very large corporations pay only 0.7% into the system, while our beloved small businesses bear the brunt of of that of that particular structure. So with that being said, I am moving for this amendment and would appreciate your support.'",
        "'speaker_1': 'Thank you. We have an amendment. Moved and second it little discussion here comes from Russia wants.'",
        "'speaker_3': 'Thank you. No, I do not support this amendment because, in fact, B.A., taxes are not a regressive tax. B.A. Taxes are only paid by businesses. Working people do not pay tax. Ask yourself, have you ever paid a B.A. tax?'",
        "'speaker_3': 'In fact, until today, B.A., taxes have been the only taxes collected by the city that are not regressive. And B.A., taxes are basically the only taxes that businesses pay. I want to use the money from the tax the rich ordinance to fund affordable housing, not to cut taxes.'",
        "'speaker_3': 'Not to cut taxes for corporations like Target and Starbucks, which is what cutting business taxes would do. If we cut sales taxes, then we would be cutting a tax that taxes regular working class people, especially the poor, that I would support.'",
        "'speaker_3': 'But there is no truth in Reagan's trick. Trickle down economics and cutting business taxes is basically, you know, it's based on that theory. To be clear, B.A., taxes can and should be made much more progressive than they are.'",
        "'speaker_3': 'We should cut taxes on small businesses, many of whom are owned by women, people of color, immigrant and LGBTQ communities, and raise the taxes on big businesses. I hope that any council member here today who votes in favor of this amendment will support any legislation in the future to make the business tax more progressive.'",
        "'speaker_3': 'I vote no on this amendment to spend money lowering taxes for corporations like Target and Starbucks.'",
        "'speaker_6': 'Mr. President, I can clarify my amendment. My amendment is not a measure that would lower taxes for Starbucks. And I can't remember the other corporation that was named by councilmember. It is specifically designed to begin laying the framework for exactly what she has advocated for just now, which is to set and determine whether there is a more'",
        "'speaker_6': 'progressive way to to implement taxes on businesses so that we recognize that the small businesses are the ones who need more help, as opposed to those at the top of that income income bracket. And, you know, the the the ITEP recognizes that the Institute on Taxation, Taxation and Economic Policy recognizes that our business tax system in the'",
        "'speaker_6': 'state of Washington is, in fact, regressive and needs to be more progressive in order to help hold up small businesses within our community. And my or my amendment to this ordinance is designed precisely to allow the foundation to be able to undergo that particular analysis so that we have a progressive model.'",
        "'speaker_1': 'Thank you. Councilman Gosar and I had Customer Herbold in Q and then I'll pass. Okay. Customer on Herbal during Q.'",
        "'speaker_6': 'I just want to say that making a tax more progressive is the flip side of making a tax less regressive. And that's what this amendment is intended to say. We're talking about making the different forms of taxation in the city of Seattle less regressive.'",
        "'speaker_6': 'And one of the things that not many people are aware of is that our taxes on businesses are also regressive. And so it's just simply calling it out to make sure that people are aware that there is regressive ity there, too.'",
        "'speaker_6': 'And in trying to make our taxation system more progressive, that we intend to do so.'",
        "'speaker_7': 'As well.'",
        "'speaker_6': 'With the the impacts on small businesses.'",
        "'speaker_1': 'Swanson. Q I wasn't I'm probably misreading it, but I didn't read that into the proposed language. I my interpretation was simply to take the receipts or the revenue from this, and it just says use for the filing purposes, including the business and occupation tax rate, which seems to read to me that you could just offset some of'",
        "'speaker_1': 'the B, you know, for all corporations, regardless as to size. But I'm not reading your meaning into this language.'",
        "'speaker_6': 'So that is that's not the intent. The intent is as it was just described.'",
        "'speaker_1': 'So I understand the intent, but.'",
        "'speaker_7': 'I am reading other.'",
        "'speaker_6': 'Regressive taxes, including the business and the business and occupation tax rate. So it's specifically it's just identifying that this is one such tax that will benefit from addressing the regressive ity.'",
        "'speaker_1': 'Okay. We have Councilmember Swann.'",
        "'speaker_3': 'Well, first of all, just to clarify, if there is a tax that is only levied on businesses and not on working people, by that definition, it is progressive. Unlike a sales tax which falls squarely on the hands of working people, especially the poor, which is a regressive tax.'",
        "'speaker_3': 'That's a separate point from whether the existing tax on business is progressive or regressive. But then the businesses themselves, absolutely, the current business tax structure is regressive among businesses, and we should absolutely change it to make big corporations pay far more than small businesses.'",
        "'speaker_3': 'In fact, we should eliminate the tax burden on small business period. However, regardless of intent and attributing every best intentions to council members, the language in the ordinance that is being introduced to this amendment does not actually say that it.'",
        "'speaker_3': 'What it will do is reduce taxes on small businesses and increase taxes on big business. It will actually by law, what it will do is take the Senate tax into consideration, just like it would take sales tax into consideration and say, should we eliminate this tax?'",
        "'speaker_3': 'And if all the classes in that group that are being taxed. And furthermore, by law, if you want to make the tax structure of the BNL much more progressive, that actually needs to be taken to the ballot. And so I invite council members to join me in putting something on the ballot where we can we can change'",
        "'speaker_3': 'that struct tax structure rather than using this vague language, which in reality, in reality, this language has been introduced because business businesses do not support, except for a few exceptions, which I and I applaud them for, that especially big business does not support a tax on the rich because many of them are the richer will be taxed'",
        "'speaker_3': '. And so that is why I will oppose this amendment.'",
        "'speaker_1': 'Thank you. Okay. I think we've had enough debate in the language speaks for itself at this point. Any other closing comments for our call for the vote on the amendment that has been moved to the second? Any other questions were good.'",
        "'speaker_1': 'Okay. So I'm going to ask you to do a voice call and a voice vote and raise your hand if you support has been moved in Second Amendment number one, the language you have it from us has been moved in second.'",
        "'speaker_1': 'And all those in favor of amendment number one to council bill 119002 vote I in raise your hand.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'If you oppose, vote no and raise your hands. No. No. So six three. So the amendment has been successfully moved. The bill has been successfully minted. Now, let's go back to the base legislation that has been amended. And are there any further comments on that?'",
        "'speaker_1': 'Councilmember Johnson.'",
        "'speaker_9': 'Just briefly. I'm really excited to be voting on this today and wanted to spend a minute saying thanks to my colleagues for their support of a couple of amendments that are offered in committee to those amendments, increased transparency and clarity for the establishment of the tax and maintains the Council's authority as the city pursues the tax mechanism'",
        "'speaker_9': '. And one of those, the Third Amendment raised the base rate from 2% to 2.25%, and that was adopted unanimously out of committee by our colleagues. And as we discussed the legislation, the the city identified a lot of priorities that are under threat of funding cuts from the current federal administration.'",
        "'speaker_9': 'My fear was that as we continue to grow, that those cuts, particularly to those most vulnerable of our population that are on Medicaid and Medicare funding, as they can contemplate cutting those funds at the federal level, that we were going to see some really significant impacts to us as a city.'",
        "'speaker_9': 'So that amendment allowed us to raise a little bit of additional revenue. And I recognize that we have some additional hurdles to cross before implementing the tax. But I'm really grateful to my colleagues for their support of those amendments, and I look forward to seeing how this plays out over the next couple of weeks and months.'",
        "'speaker_1': 'Thank you, Katherine Johnson. I'm going to keep from heading into. I know a few of you have things to say. Customer Beck Show you are on.'",
        "'speaker_3': 'All right. Thank you very much. And I want to say thank you. Councilmember Herbold, Councilmember Swan, for leading this, but also special recognition to my good friend John in the front row. Because you were one of the first people that brought this to my attention that the state legislature was not going to do anything about an income'",
        "'speaker_3': 'tax and that local cities needed to do it. So for you and to you and to your organization, John Burbank, I want to say thank you for that good work. And just a couple of comments has already been recognized that our state has one, if not the very most regressive tax system in the nation.'",
        "'speaker_3': 'And it is flatly unfair. We know that. And I think, Councilmember Herbold, you mentioned that the Washington Washington state's lowest earners pay something like 16%, one 6% of their total income in taxes. And where people, families with the highest incomes pay just over 2%, there's 2% of their income in taxes.'",
        "'speaker_3': 'And besides being just grossly unfair to our neighbors who have the least. What happens is that the city's revenues, which are based on sales tax and property taxes, simply don't keep up with growth. So I think this is an opportunity for us to do what many of you in the audience have already mentioned, and that is that'",
        "'speaker_3': 'government should have more money to do what we need to do, whether that's fix the roads or pay for libraries or ad parks or deal with homelessness and promote public health and mental health, which are two of my top priorities.'",
        "'speaker_3': 'Clearly, we need to have a statewide income tax, but our legislature, as we just mentioned a moment ago, isn't going to do that. So having the city take the lead, as we have done, whether that is paid family leave, thank you very much.'",
        "'speaker_3': 'Or gun responsibility or $15 an hour. Other cities are going to follow this lead. I have heard from a number of people who said, well, people are just going to move out of the city of Seattle. The wealthy are going to move.'",
        "'speaker_3': 'You know that's not true. And that if it's able to pass and we get past the constitutional muster, other cities are going to jump on this and want to do it just as we are now. So I want to say that in that spirit, we know and I've already been alerted that we can expect a legal challenge'",
        "'speaker_3': 'the second that the mayor signs this. That said, we go to King County Superior Court. We go on to our Supreme Court. And I would really like to recommend and in this case, I support council members want I would like to see how much of this money can be used to reduce our sales tax.'",
        "'speaker_3': 'I know that that's an uphill battle, but that's where I would like to first work to invest this money. So during this time where we are facing the legal challenges, that's what I would like to do, is to figure out how can we reduce the sales tax and make our system fairer for everybody.'",
        "'speaker_1': 'Thank you. Councilman Russell. Council members to watch.'",
        "'speaker_3': 'Thank you, Brandon Harrell. Washington state and Seattle have had a tax code that is absolutely punishing to poor working class and middle class people for decades. Olympia is run by Republicans and Democrats. And yes, there are differences, very clear differences between those two parties.'",
        "'speaker_3': 'But one thing that they agree on completely is that their policies benefit big business and the super wealthy. And that is why our movement has done the right thing by not holding our breath for corporate politicians to make a change and build an independent mass movement in Seattle in order to tax the rich.'",
        "'speaker_3': 'Thanks to the city attorney's office, who have done an incredible amount of work, our city central staff, Councilmember Herbold, and her staff staff members in my office, especially Ted Walden, the Trump Pro Seattle Coalition, but especially the Economic Opportunity Institute and John Burbank and the Transit Writers Union and Katie Wilson and Socialist Alternative.'",
        "'speaker_3': 'And I have been proud members of that coalition. We need to be crystal clear that the fight is far from over. If you read the op ed from the big business representatives and strategists, they have made it clear that they intend to fight this in the courts rather than city hall.'",
        "'speaker_3': 'That is why actually we've had we've had to launch a muted battle on city hall. It's not because suddenly the Chamber of Commerce and their representatives on this body here agree with us on tax. But they but because they know that this will go to the courts and they would rather fight it there.'",
        "'speaker_3': 'And because the movement has been so strong that it is difficult for, you know, for them to fight that battle here. So we will need to fight this battle in the court, and we will need to be there to fight, to win.'",
        "'speaker_3': 'But throughout history, we've seen that where we have unjust laws, mass movements, when they get organized and decided to fight back, we do not have to accept these unjust laws because we can overturn them. Just one example, Roe versus Wade.'",
        "'speaker_3': 'The landmark abortion rights law was passed by the Supreme Court to defend women's rights in 1973. Why? What a change at that time. There were no new Supreme Court justices. It was the movement that forced the justices with no choice if they were to maintain their credibility.'",
        "'speaker_3': 'Our movement will have to and can do the same thing to defend taxing the rich.'",
        "'speaker_2': 'And just like we have.'",
        "'speaker_3': 'Packed City Hall. We will have to pack the courtrooms to make it clear that we will no longer tolerate a system that buries poor and working class people in taxes while giving business and the super rich yet another free ride and a system that underfund affordable housing to the point where thousands are homeless.'",
        "'speaker_3': 'A system that criminally underfunded education. The Washington State Republican Party is trying to trick people now into thinking that we want to tax everyone. They put out a press advisory today about this ordinance with the title. And I quote, Income tax for all is the real goal as far as I'm concerned.'",
        "'speaker_3': 'I can't speak for other politicians, but as far as I'm concerned, the goal is absolutely to tax the rich and not working people and the middle class. Thank you for all your incredible work building this movement. Thanks to Katy and John especially and all the organizers, including the Neighborhood Action Coalitions, who are the reason this has happened'",
        "'speaker_3': 'today. When I originally ran for office, Socialist Alternative and I highlighted three demands for Seattle $15 an hour, taxing the rich and rent control. We won the first two because we organized and fought to win. We can win not only rent control, but go towards a society free of exploitation and oppression.'",
        "'speaker_1': 'I think he wants those inspirational words. Councilmember Burgess, did you want to close us out?'",
        "'speaker_0': 'Yes, thank you.'",
        "'speaker_1': 'Because virtual you got to make sure everyone has had an opportunity to chime in. We're good. We're good. Okay, Councilman Burgess.'",
        "'speaker_0': 'Thank you. I think we've documented really well over the last several weeks with the experts that have appeared before us, with the various reports that we have reviewed, that Washington state's tax system is unfair and is not just.'",
        "'speaker_0': 'And that, in fact, is my core motivation for supporting this legislation today. State tax reform is needed here in Washington state so that our lowest income residents pay less. Our middle class neighbors pay about the same, and our highest income residents pay more.'",
        "'speaker_0': 'That would be adjust system of taxation to our business friends, small businesses and large businesses. And I love all of you. It's important that we'll let that go. It's it's important that it's important that you realize that state and local income taxes are, in fact, deductible from federal income tax.'",
        "'speaker_0': 'And so I would ask our business friends, would you rather send your revenues to Washington, D.C., or keep them local to improve our situation here in Seattle and in Washington State? And I think that's an easy answer. So I join with Councilmember Herbold and the folks who have advocated for this change.'",
        "'speaker_0': 'We want to compel and jumpstart a conversation in our city and state that will result in the status quo being changed so we can move forward to a much more just and fair tax system in Washington. And that will be for the benefit of all of us, including business.'",
        "'speaker_1': 'Thank you, Councilman Burgess. Okay. I think we are ready to vote. Please call the role on the passage of the amended bill.'",
        "'speaker_5': 'Burgess Gonzalez. Hi. Herbal Hi, Johnson. Suarez Oh, Brian. Hi.'",
        "'speaker_3': 'So I.'",
        "'speaker_5': 'Beg. Shall I? President Herrell. Hi. Nine in favor. Not opposed.'"
    ],
    "Second Amendment to Yesler Terrace Cooperative Agreement with Housing Authority.": [
        "'speaker_1': 'Thank you. The bill passed and the chair will sign it for the record. For the record, the bill passed and there was signage. Please read item number two into the record and you can read the short title if you can.'",
        "'speaker_5': 'Agenda Item to cancel 119005 relating to the redevelopment Yasser terrorist by the Housing Authority, the city of Seattle. The committee recommends the bill pass.'",
        "'speaker_1': 'So let's give a moment for the crowd to settle down.'",
        "'speaker_8': 'I'm not big on this. I just want to see what happens.'",
        "'speaker_1': 'Me and Councilman Burgess, you do have the floor.'",
        "'speaker_0': 'Thank you. This ordinance modifies the agreement between the Seattle Housing Authority and the city. That was it. It was adopted in 2012 over the. Yes, the Terrace Redevelopment Project. And this amendment does several things. First, it authorizes $13 million in additional city housing funds for three developments in the phase three part of the Hassler Terrace redevelopment.'",
        "'speaker_0': 'It revises requirements related to housing occupancy by returning yes, Hassler Terrace residents and other low income households, and it amends the allowable locations for pink patch community gardens to include a stretch of property along Interstate five and adjacent to Hassler Terrace.'",
        "'speaker_0': 'These funds will be used to support the development of at least 195 replacement housing units and 130 units of affordable housing to families at 60% of area median income or less. This legislation also allows a number of replacement housing units east of Bourne Avenue to increase from 140 to 190.'",
        "'speaker_0': 'And it prioritizes preschool classrooms in the project at Eisler Way and 12th Avenue. If the city provides capital funding for the classrooms.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Thank you. And good questions about this legislation. Please call the roll on the passage of the bill.'",
        "'speaker_4': 'Burgess Hi.'",
        "'speaker_7': 'Gonzalez, I Herbold Johnson Suarez.'",
        "'speaker_5': 'O'Brien. All right. So what.'",
        "'speaker_3': 'I think.'",
        "'speaker_7': 'Shire.'",
        "'speaker_5': 'President Harrell. Nine in favor, nine opposed.'",
        "'speaker_1': 'Thank you. The bill passes and the chair will sign it. Please read items three and four into the record.'"
    ],
    "Establishment of the Community Oversight Committee for the Seattle Park District.": [
        "'speaker_1': 'Thank you, Councilmember Burgess. Any further comments on these appointments? Those in favor of confirming the appointments vote I. Those opposed vote no. The motion carries and appointments are confirmed. Please read agenda item number five into the record.'",
        "'speaker_5': 'The Report of the Park Seattle Center Libraries and Waterfront Committee Agenda Item five Resolution 317 59 relating to the Seattle Park District, establishing the Committee Oversight Committee and setting its membership in terms of office and ratifying confirming certain prior acts.'",
        "'speaker_5': 'The Committee recommends the resolution be adopted.'",
        "'speaker_1': 'Thank you very much, Councilmember Juarez.'",
        "'speaker_8': 'Q I know you've all been on the edge of your seat on this one. Yes, this resolution ratifies the establishment, the Municipal Park District Oversight Committee. This resolution lists out the position numbers and appointed authority for the various positions on the oversight committee.'",
        "'speaker_8': 'This will not disrupt the terms that have been already been confirmed. The committee members have been fulfilling their duties and will continue to do so. The committee recommends adoption of the resolution.'",
        "'speaker_1': 'Thank you very much. Any further questions on this resolution? Those in favor of adopting the resolution. Please vote i. I those opposed vote no. The the motion carries and resolutions adopted and chair was signed it. We have. We've had a number six, so we'll go to item number.'",
        "'speaker_1': 'No, we have not six. I'm sorry. I have my pleasure. Please read agenda item number six. And to the record.'"
    ],
    "Housing and Building Maintenance Code Amendments.": [
        "'speaker_5': 'The report of the Planning and Zoning Committee Agenda Item six Council Bill 118 974 Relating to housing and building maintenance. Amending limits for code sections 22.220 2.0 8020 2.206.0 20.0 40.0 50.0 80.0. 90.1 ten 131 4161 7022 point 14.0 50 end point zero 86 antimony Ortiz 1240 11.'",
        "'speaker_5': 'The committee recommends the bill passed as amended.'",
        "'speaker_1': 'Councilmember Johnson, thank you.'",
        "'speaker_9': 'This is the rental registration and inspection ordinance and probably the reason why everybody else is still here with us this afternoon. I'm really proud of the progress we've made so far on improvements to the rental registration and inspection ordinance.'",
        "'speaker_9': 'The bill, as voted out of committee, made five changes. One of those changes was technical in nature, but the other four made some pretty significant differences. And I'd like to thank Councilmember Herbold for bringing those amendments forward. They incorporate references to requirements related to lead paint modify.'",
        "'speaker_9': 'The percentage of units selected for inspection requires inspection reports from private inspectors and amends requirements related to lead paint, carbon monoxide alarms, minimum fire and safety requirements, improving security standards and other technical corrections. We had asked for a little bit of additional time between the vote committee and the full council vote in order to better identify a'",
        "'speaker_9': 'range of issues within the checklist to better classify failures. One of those failures that we hear a lot from the private sector landlords are that tenants disable their own smoke detectors. It's one of the most common, if not the most common failure that we get in our rental registries and inspection ordinance.'",
        "'speaker_9': 'And obviously a very different type of failure than the kinds of failures that we heard during public comment, like very significant mold issues or other safety issues. So we were intending to try to identify a set of ways to respond to that checklist.'",
        "'speaker_9': 'We just didn't quite run run into enough time to be able to do that. So we did set up a pathway that allows the department through director's role to continue to work with community partners and landlords and others to identify a lot of issues identified by Washington can Columbia Legal Services and other folks during the public comment'",
        "'speaker_9': '. So I believe this is a really good step forward and continues to provide important protections for the 50% plus of our city who rent for their housing and really look forward to seeing what the outcomes of that additional work by the department looks like and commit to our friends who are still here that we're going to continue'",
        "'speaker_9': 'to do work in this fall's budget in order to make sure that we're adequately funding the department to continue to do their work. Thank you.'",
        "'speaker_1': 'Thank you, Captain Johnson.'",
        "'speaker_9': 'I'm sure Councilmember Herbold has something similar.'",
        "'speaker_1': 'To Councilmember Herbold. Thank you. You're good.'",
        "'speaker_6': 'Now. A couple of minutes. Oh, yeah, a minute.'",
        "'speaker_4': '30 seconds.'",
        "'speaker_6': 'I just want to thank the community partners as well as landlords for sharing their concerns with my office and thank Councilmembers Johnson O'Brien for supporting the amendments that I move forward during committee. In particular, the creating criteria for requiring additional units for inspection, I thought was very important.'",
        "'speaker_6': 'DCI had the the administrative discretion to to do that and has had it for a number of years. But we keep hearing of buildings that fail their REO inspection, but that aren't getting the additional inspections of units prior to a decision being made of whether or not these buildings are actually passing, but they're failing individual inspections without'",
        "'speaker_6': 'having a trigger for inspecting the whole building. So this is really, I think, important in identifying not just the need to correct violations within individual buildings, but to make sure that that's not indicative of other problems in the building.'",
        "'speaker_6': 'In addition, the reduction of the amount of notice to property owners of units selected for inspection I think addresses another sort of problem that has been identified with this program since its inception, which is there's among some landlords, certainly not all.'",
        "'speaker_6': 'There is some gaming of the system when landlords know which units are going to be inspected and they have a lot of notice, they are able to go in, fix those those problems quickly so that there's no indication to the to the department that there may be a problem in the in the building.'",
        "'speaker_6': 'And then lastly, the request that inspectors leave information in the unit after completing an investigation I think is really important to increasing tenant knowledge. In a building of the conditions and in ways to address those conditions in the future.'",
        "'speaker_6': 'And then finally, there's a signal of this council's interest in the future to address the program fees in such a way that we can evaluate and address any imbalances in the fee structure for small landlords while continuing to set the fees to cover the cost of administering the program.'",
        "'speaker_1': 'Thank you. Catherine Herbert. Any further comments? Thank you very much. Please call the roll on the passage of the bill.'",
        "'speaker_5': 'Burgess. Gonzalez Herbal. Hi. Johnson. Suarez. O'Brien. Swan. I beg your president. Herald. Hi. Nine in favor and unopposed.'",
        "'speaker_1': 'The bill passed and chair of Senate. Please read Agenda number seven. You can read the short title, please.'"
    ],
    "Ordinance on Accepting and Appropriating Non-City Grants for Transportation Projects.": [
        "'speaker_1': 'Thank you. Are there any comments on those in favor of filing clerk file 314337. Please vote i i those opposed vote no the motion carries and the clerk file is placed on file. Please read agenda item number ten The.'",
        "'speaker_5': 'Report Short.'",
        "'speaker_1': 'Title.'",
        "'speaker_5': 'The Report of the Sustainability and Transportation Committee Agenda Item ten Council 119008 relating to the Grants Fund for non city sources. The committee recommends the bill passes amended.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_4': 'Councilmember O'Brien. Thank you for those tracking this at home. This is a grant acceptance ordinance. The city law requires that when we receive grants from other entities, the city council goes through a process to do that. This grant acceptance ordinance includes a number of sources.'",
        "'speaker_4': 'The largest one is a $50 million grant we're receiving from the Federal Transit Administration and a $7.3 million grant from the Puget Sound Regional Council for the Center City Streetcar Connector. It also includes a $9 million fast grant.'",
        "'speaker_4': 'Fast is from the federal government, also for the Lander Street overpass and smaller grants for safe house schools and bike ped improvements from watchdog.'",
        "'speaker_1': 'Thank you, councilman brian. Are there any further comments? Councilmember Herbold.'",
        "'speaker_6': 'Thank you. I just wanted to make note that in committee I proposed an amendment to this legislation, and I thank the committee members for supporting that that that amendment. It adds a new Section five as it relates specifically to the streetcar project, requiring that the executive report to council detailing the financial operating plan and projected performance measures'",
        "'speaker_6': '. And it adds a requirement that potential funding sources be identified if operations funding proves insufficient and additional potential funding sources for construction if the FTA funding doesn't come through. And then finally it asks for projections of the streetcar fund balance.'",
        "'speaker_6': 'And how the Executive intends to retire the Interphone loan for operating the South Lake Union streetcar. There are a lot of good projects in this grant acceptance ordinance, namely funding for lander, pedestrian crossing safety, school zone safety, neighborhood greenways, intersection improvements and pavement paving projects.'",
        "'speaker_6': 'I If the streetcar funding was the only item in in the ordinance, I would very likely be voting no on it. I'm very concerned that we have an overly optimistic perspective on both the operations costs as well as the the funding that's available for construction.'",
        "'speaker_6': 'The grant is for 50 million. It's part of a $75 million request. I'm concerned that we won't get the full amount. Given the chaos in D.C. right now. The capital cost is estimated to be 152 million as it relates to operations.'",
        "'speaker_6': 'We're making a lot of assumptions around fare revenues, and I'm really concerned that we're going to end up cannibalizing metro bus service hours to pay for streetcar operations when the fare revenues aren't what we anticipate them them being.'",
        "'speaker_6': 'But that said, I appreciate that the amendment will get us a report to the Council by September 30th about the risk and funding for operations for the first six years and contingency strategies in the event that revenues don't come in.'",
        "'speaker_1': 'Thank you, Councilman Herbold, for the comments, Councilman Bagshaw.'",
        "'speaker_3': 'Yeah, I just want to say thank you, Councilmember Herbold. She and I actually share a lot of the same concerns, both in terms of the amount of money, what I think are very overly optimistic estimates on how many people are going to ride.'",
        "'speaker_3': 'But my concern, in addition to what you were saying, is that we're looking at having designated lanes for the middle part, that is the center city part for the streetcars. But those are not desert dedicated lanes from Mohi to Westlake, nor from Capitol Hill down to Jackson.'",
        "'speaker_3': 'And if we don't have designated lanes all the way along, it doesn't make any sense to dedicate lanes right through one central city, because the whole point of having the streetcar lines in one center city with dedicated lanes was to move the streetcar faster than cars.'",
        "'speaker_3': 'And if we don't have that straightened out before construction begins, I fear that we're putting in a tremendous amount of money without the results we want.'",
        "'speaker_1': 'Very good. Council Member Johnson.'",
        "'speaker_9': 'I feel obliged to remind my colleagues at this point that we received a letter from, I think, nearly 70 organizations and strong support of the Center City streetcar, and that ranged from institutions up and along First Avenue like the Pike Place Market and the Pioneer Square Alliance, as well as the Clark Museum and several other not involved'",
        "'speaker_9': 'directly on the line itself. You know, as someone said to me the other day, without this center city streetcar, we would look an awful lot like a smile with a big missing tooth in the middle. And, you know, that's not a perfect analogy, but I do think that this is a really great opportunity for us to make'",
        "'speaker_9': 'sure that we do connect those two disconnected systems with something that is going to really work well. I do not share the concerns of my colleagues around some of the operating costs. I do think that there's efficiencies to be gained here by adding a new line and having very similar maintenance loads as we have today.'",
        "'speaker_9': 'I do believe that this is going to be a good investment for us. I am long a proponent of getting those streetcar lines and frankly all transit into a dedicated right of way. Love to see us implement that.'",
        "'speaker_9': 'That's really about political will. That's not about anything other than that. So I'm excited to vote yes on this today and excited to see this move forward.'",
        "'speaker_1': 'Thank you, Catherine Johnson. Catherine Gonzalez.'",
        "'speaker_6': 'Just really quickly, I want to express my support of the comments that you just made, Councilmember Johnson, not just because your haircut haircut is on point today, but because you just made some brilliant remarks as well. And I you know, I want to recognize that a lot of those signatories included small businesses, particularly ethnic owned businesses in'",
        "'speaker_6': 'the Chinatown International District. I had an opportunity to have a conversation with them about the streetcar. And many of them expressed to me, you know, specific concerns around the city, not fulfilling a promise that they felt was made to them when we built the first hill streetcar.'",
        "'speaker_6': 'And I think it's important to recognize that this connection that we are creating through the the the city connector is an important part of making sure that we connect these different pieces of our city for purposes of economic development.'",
        "'speaker_6': 'And so I agree with the the analysis that Councilmember Johnson has made in terms of finding efficiencies and making sure that we're still fiscally responsible now. So just wanted to layer on top of that the recognition that I think that this is really critical to continuing to connect our business small, small business centers with each other so'",
        "'speaker_6': 'that they can benefit as greatly as they can from these transportation investments.'",
        "'speaker_1': 'Very good.'",
        "'speaker_3': 'And just one more and I'll take one minute or less.'",
        "'speaker_1': 'You don't have a nice haircut, though. Yeah. Okay. Go ahead, Councilman Bagshaw. It is.'",
        "'speaker_6': 'A very nice.'",
        "'speaker_7': 'Hair.'",
        "'speaker_3': 'Thank you very much. I'm going to support this. So I don't want Councilmember Johnson to think I am not. The dedicated land portion is the thing that I really want us to emphasize. If we don't get the dedicated lanes, we're not going to have the business development.'",
        "'speaker_3': 'So I'm just suggesting as we're going forward and making our decisions here, that we take that that opportunity for the political will and say, if we're going to have a streetcar, it's got to move through traffic. It can't get stuck.'",
        "'speaker_3': 'So let's let's move forward as you are recommending. I like the idea about having the full smile. I love your metaphor, but we can't have them stuck in traffic up on Broadway and then not have people get on down in the center city.'",
        "'speaker_3': 'It does not make sense.'",
        "'speaker_1': 'Very good. Okay. Please call the rule on the passage of the bill.'",
        "'speaker_5': 'Burgess Gonzalez. Hi, Purple. Hi, Johnson. Suarez O'Brien. Hi, Suzanne. Hi, Bagshaw. Hi, President Herrell. Hi. Nine in favor, nine opposed.'",
        "'speaker_1': 'Thank you. The bill passed and show sign it. We've held agenda item number 11, so we've come to the end of the agenda. Are there any further business going for the council? Councilmember O'Brien first.'",
        "'speaker_8': 'Well, I'm sorry, quick. I'm just going to comment on Rob's hair as well.'",
        "'speaker_1': 'That's that. We'll come back to that. Councilmember O'Brien.'",
        "'speaker_4': 'I have a haircut tomorrow afternoon. I would ask to be excused from full council meetings on July 24th, 31st and August 7th, doing some you.'",
        "'speaker_1': 'August seven is we've moved in second and the cast member can be excused for July 24th, July 31st and August 7th. All those in favor say I. I oppose the ayes have it council member whereas. Did you? I said.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Oh, no. I was wondering if you wanted to elaborate on any. If we're good, any further business. You know.'",
        "'speaker_8': 'Where he's going.'",
        "'speaker_1': 'To want.'",
        "'speaker_3': 'You, President Howell. I would like to be excused from full council this coming Monday, July 17th.'",
        "'speaker_1': 'July seven. It's a move in a second. The councilman won't be excused for July 17th. All those in favor say I. I oppose. The ayes have it. Any further business? Yes. Yes, we have.'",
        "'speaker_8': 'Oh, I have my poster. We have our live in D5 July 22nd on my birthday.'",
        "'speaker_1': 'July 22nd. It has been duly noted. And with that.'",
        "'speaker_4': 'Yes, we will stand adjourned.'",
        "'speaker_1': 'And everyone, have a great afternoon. Jesus.'"
    ]
}