{
    "Resolution to retire inactive Council items.": [
        "'speaker_3': 'A report of the City Council Agenda Item one. Resolution 32003. A resolution retiring, introduced and referred council bills, resolutions, clerk files, and appointments that have received no further action.'",
        "'speaker_1': 'Thank you, Madam Clerk. I move to adopt resolution 32003. Is there a second?'",
        "'speaker_2': 'Second.'",
        "'speaker_1': 'Thank you so much. It's been moved and seconded to adopt Resolution 32003. I am the sponsor of this item, so I will address it and then I'm happy to open the floor for additional comments. Colleagues, as I stated this morning during Council briefing, Resolution 32003 is legislation requiring introduced and referred council bills, resolutions, clerk files and appointments'",
        "'speaker_1': 'that have received no further action. This is a routine parliamentary action which occurs in accordance with the general rules and procedures of the Seattle City Council to retire legislation that has been introduced and referred but not acted upon by the Council.'",
        "'speaker_1': 'Each committee chair has been consulted on this process in order to ensure only legislation appropriate for retirement is included in this resolution. I'm happy to answer any questions or hear any additional comments. Hearing no additional comments. Will the clerk please call the roll on the adoption of the resolution?'",
        "'speaker_2': 'Morales. Yes. Muscular. I. Peterson I so want.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Strauss Yes. Herbold Yes. Suarez, I and council president gonzalez i eight in favor and opposed.'",
        "'speaker_1': 'Thank you, Madam Clerk. The motion carries, the resolution is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? All right, well, the clerk please read item two into the record.'"
    ],
    "License Agreement for AIDS Memorial Pathway Artworks on Transit Property.": [
        "'speaker_3': 'Agenda item two Council Bill 120037 An ordinance relating to the AIDS Memorial Pathway Project authorizing the Director of the Seattle Office of Arts and Culture on behalf of the City of Seattle to accept a license agreement for the installation and maintenance of artworks that are part of the City of Seattle's Municipal Art Collection on property owned by'",
        "'speaker_3': 'Central Puget Sound Regional Transit Authority.'",
        "'speaker_1': 'Thank you, Madam Clerk. I move to pass Council Bill 120037. Is there a second I can. Thank you so much. It's been moved and seconded to pass the bill. Councilor Morales, this is your primary sponsored bill, so I'm going to hand it over to you to provide the committee's report.'",
        "'speaker_4': 'Thank you. Colleagues, you'll recall last year we passed Council Bill 119739, which accepted a donation of $750,000 for from the Seattle Parks Foundation for this AIDS Memorial Pathway Project. We are now at the point of installation of this project.'",
        "'speaker_4': 'And so, as the clerk said, this is to establish an agreement to allow this project to be installed at the Capitol Hill light rail station. In the last few months, so the AIDS Memorial Parkway is a community driven, community funded project to use public art as a physical space to tell the story of the AIDS crisis and'",
        "'speaker_4': 'includes a civic call to action through engagement, reflection and remembrance. For those of you who have been through the Capitol Hill area in the last few months, a few of the installations are up already, including Stormy Weathers. In this way, we loved one another, which is inside community roots, housing station house.'",
        "'speaker_4': 'And this is a tribute to the missing narratives of women and black people who lost who we've lost to the AIDS crisis. And then just last month, crews installed one of three groups of statues called We're Already Here around Kyle Anderson Park.'",
        "'speaker_4': 'And these statues resemble protest signs that evoke the historic moments of public convergence. And that that project will also be the final piece of that installation will happen in the next couple of months. And the idea is to finish this project by June in time for pride so that the piece will be completed by then.'",
        "'speaker_4': 'And so this council bill, again, is just to confirm that there is an agreement to install the next piece at the light rail station. And I moved adoption.'",
        "'speaker_1': 'Thank you so much, Councilmember Morales, for that description of this really important project. Are there any additional comments on this bill? All right. Looks like there are no additional comments on the bill. So I'm going to ask that the clerk please call the roll on the passage of the bill.'",
        "'speaker_2': 'But Alice. Yes. Must get to. I. Peterson. I so want. Yeah. Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Yes. Purple goddess. I. And Council President Gonzalez I in favor and unopposed.'",
        "'speaker_1': 'Thank you so much. The bill passes and the chair will sign it. Will the court please affix my signature to the legislation on my behalf? Will the clerk please read items three through seven into the record?'",
        "'speaker_3': 'Agenda items three through seven appointments 1860, 1861 and 1863 through 1865. The appointments of Rick are Lucy and Ebony Karenga as members. Seattle Arts Commission for terms to December 31st, 2022, and the reappointment of James Myles, Sarah Wilkie and Michael Me Williams as member Seattle Arts Commission four terms to December 31st, 2022.'"
    ],
    "Resolution to Support Immigrants and Refugees.": [
        "'speaker_3': 'Agenda item 11 Resolution 32005. A resolution urging the United States Congress to enact legislation creating a roadmap to citizenship and other legislative priorities to support immigrants and refugees.'",
        "'speaker_1': 'Thank you, Madam Clerk. I move to adopt a resolution 3 to 0 zero five. Is there a second? 1/2. Thank you so much. It's been moved and seconded to adopt Resolution 32005. I am the sponsor of this item, so I will address it and then happy to open the floor for comments and colleagues because today is this'",
        "'speaker_1': 'really important resolution that I mentioned briefly during our council briefing this morning. My office has worked over the last several weeks with community with many community leaders, including those that want America to develop this resolution. It is in support of community organizing efforts.'",
        "'speaker_1': 'And Representative Pramila Jayapal, Roadmap to Freedom Resolution, which seeks to fix our broken immigration system. This resolution calls on Congress to do several things. First, to create a road map to citizenship for 11 million undocumented immigrants across the country, including for those residing working here in Seattle to support family reunification by increasing the number of family visas'",
        "'speaker_1': 'available. We also, through this resolution, call on Congress to improve our standing in the eyes of the world by improving our asylum and refugee systems and grow the number of asylees and refugees we admit into legally admit to our country.'",
        "'speaker_1': 'The city calls on our federal government to also put an end to private immigration detention, just like our Washington state legislature recently did in this past session. We must reform these punitive detention and deportation practices, and we ask for a moratorium on deportation.'",
        "'speaker_1': 'And finally, we ask Congress to not leave out immigrants, especially those that are undocumented, of any pandemic recovery efforts because of their status. It is vital that Congress acts with urgency and uses every tool at their disposal, including budget reconciliation, to finally, once and for all, achieve comprehensive immigration reform.'",
        "'speaker_1': 'As a council member, I have heard so many stories over the last 15 months about how this pandemic has exacerbated and magnified every systemic inequity we have in our society. The barrier that immigration status has caused for so many during this pandemic has been devastating.'",
        "'speaker_1': 'Thousands of local families were left out of relief and assistance needed to survive this pandemic because of their immigration status. Many undocumented immigrants cannot access lifelines like unemployment insurance, health care insurance and other types of benefits that they have that they need in order to continue to survive.'",
        "'speaker_1': 'Local governments like Seattle have continued to step up as both the first and the last line of defense. I am proud of the work our city has done. I'm proud of the work this City Council has done to support our immigrant neighbors, including making sure that we were not excluding our undocumented immigrant and refugee neighbors from our'",
        "'speaker_1': 'very own Jumpstart Seattle payroll tax. But we simply do not have the resources to meet the scale of the need of our community members. We need our federal government to act once and for all and with urgency. And that must include fixing our broken immigration system and ensuring immigrant communities do not get left behind as we come'",
        "'speaker_1': 'out of this pandemic. After four years of a federal government that has continually targeted, targeted immigrants and refugees telling us we do not belong brutalizing our communities and neighborhoods with xenophobia, racism and family separation, it is time for reckoning and healing.'",
        "'speaker_1': 'And it is my deep hope that Congress will finally act and not delay any longer. Passing this resolution is absolutely necessary in order for our representative and Representative Jayapal to have all of the all of the resources, all of the tools and all of support of her local jurisdiction and constituents to be able to go to Washington'",
        "'speaker_1': ', D.C. and advocate accordingly. So with that colleagues, I would encourage and appreciate your yes vote on this resolution. Are there any additional comments on the resolution? Hearing none. Will the clerk please call the ball on the adoption of the resolution?'",
        "'speaker_2': 'Morales. Yes. Must get us high. Peterson. Yes. Sergeant? Yes. Strauss. Yes. Herbold. Yes. Juarez, I and Counselor. President Gonzalez. I am in favor, Nipost.'",
        "'speaker_1': 'Thank you so much. The motion carries, the resolution is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Other business colleagues, we do have one item of other business that I'm aware of.'",
        "'speaker_1': 'Council Member Herbold, I understand, would like to have her signature added to her own proclamation. So go ahead, Councilor Herbold. Thank you so much. I was unable to attend this morning's council briefing and missed my opportunity to sign on to the two proclamations recognizing May as older Americans month and better hearing month.'",
        "'speaker_1': 'I'd like to request that the clerk please affix my signature to both proclamations. Thank you. Thank you so much, councilmember. Horrible. The clerk here is at your request and will act accordingly. Councilmember Suarez.'",
        "'speaker_4': 'Thank you. Council President I'm asking if I.'",
        "'speaker_0': 'Can be.'",
        "'speaker_1': 'Excused on.'",
        "'speaker_0': 'Monday.'",
        "'speaker_4': 'May 17th.'",
        "'speaker_0': 'And Monday, May 24th.'",
        "'speaker_1': 'Okay. If there's no objection because marijuana is will be excused on May 17th and May 24th. Hearing no objection. Councilmember Juarez will be excused on May 17th and May 24th. Is there any additional business, any further business come before the council?'",
        "'speaker_1': 'Councilmember Herbert, please. Thank you. I would like to be excused on May 10th. Okay. If there is no objection, Council Member Herbold will be excused on May 10th. Hearing no objection. Councilmember Herbold will be excused on May ten.'",
        "'speaker_1': 'Is there any for other further business to come before the council? All right. Hearing that and colleagues, this does conclude the items of business on today's agenda. Our next regularly scheduled city council meeting is on Monday, May 10th, 2021 at 2:00 PM.'",
        "'speaker_1': 'I hope that you all have a wonderful afternoon. We're joined by everyone.'"
    ]
}