{
    "Retirement of Inactive Council Bills, Resolutions, and Clerk Files.": [
        "'speaker_3': 'I but I think that I've got a short amendment on this.'",
        "'speaker_1': 'No, that's.'",
        "'speaker_3': 'Next. Thank you. Thank you.'",
        "'speaker_2': 'Councilmember Clark. I got him. And President Burgess.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Nine in favor and and unopposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Please read the report to the full council.'",
        "'speaker_2': 'The report of the full council agenda. Item number one. Resolution 31574 retiring, introduced and referred council bills, resolutions and quick files which have received no further action. Introduced March 30th, 2015.'",
        "'speaker_1': 'I move to pass resolution 31574. Second, thank you, Councilmember Bagshaw.'",
        "'speaker_3': 'Thank you. We have a cleanup to the cleanup here and that's to delete clerk file 314230 from the list of proposed 2015 retired legislation. What happened here was that this particular item was an error and should not have been included and is not eligible for retirement.'",
        "'speaker_1': 'I'll second that motion. Any questions or comments on the amendment? All in favor of the amendment to delete. Clark filed 314230 vote. I oppose vote no. The amendment is adopted. The resolution, as amended, is now before us. Any further comments or questions?'",
        "'speaker_1': 'All in favor of resolution 31574 as amended. Vote I oppose Vote No. The resolution is adopted unanimously and the chair will sign it. The report of the Education and Governance Committee, please read item two.'"
    ],
    "Seattle Preschool Program Implementation Plan and Tuition Model Amendment.": [
        "'speaker_2': 'The Report of the Education and Governance Committee Agenda Item number two Council Bill 118363 relating to the Seattle Preschool Program, approving an implementation plan as required by ordinance 124509 and Resolution three one 5 to 7. Amending the tuition model in the action plan adopted by Ordinance 124509 and ratifying and confirming certain prior acts.'",
        "'speaker_2': 'The committee recommends the best the bill pass as amended.'",
        "'speaker_1': 'Thank you very much. This is the culmination of about two and a half years of work where we've been working on implementing high quality preschool in Seattle and the first classrooms will open this next September. I remember very much at the very beginning when we were working on the Families and Education Levy renewal in 2011.'",
        "'speaker_1': 'We realized then that we should invest much, much earlier, even before kindergarten, with our three and four year olds. And so we set on this journey. We took a study mission, and several of you went with us to the East Coast, to Boston and New Jersey.'",
        "'speaker_1': 'In Washington, D.C., we read the literature. We brought researchers here who sat with us at the committee table, and we engage the community parents, preschool teachers, the school district, active participant with us, preschool providers, a long list. Hundreds of people that we talked to and and engaged with over the last couple of years about what could Seattle'",
        "'speaker_1': 'do to make sure that every child entered kindergarten ready to learn and have a successful education path. And last November, the voters of Seattle, 69.2% of them said, yes, we want to invest in our children. We do live in a great city.'",
        "'speaker_1': 'And Councilmember Clark, you're going to miss doing this kind of work because we actually move the needle here to make a difference for our kids. So this legislation adopts the implementation plan, all the specific details about what we need to do to get ready in September and for the next four years to run this pilot project.'",
        "'speaker_1': 'And then we'll be back probably in year three to figure out how do we make this permanent? How do we fund it going forward? Special thanks to Holly Miller and her team. They're sitting back here from the city's Department of Education and early learning lots and lots of hours that you all put in.'",
        "'speaker_1': 'And we deeply appreciate that work from you. Questions or comments?'",
        "'speaker_3': 'Just just one more.'",
        "'speaker_1': 'Member of Bancroft.'",
        "'speaker_3': 'Council, President Burgess, I really want to thank you for your leadership on this. It's been really it's been impressive for me to watch how thoroughly how deeply you have dived into this. And I really want to also say thank you, Holly Miller, and your team.'",
        "'speaker_3': 'For me, it's been great to participate and to learn what you have had to teach us. And I'm very enthused not only about the opportunity that every child in the city of Seattle is going to have to be ready to learn.'",
        "'speaker_3': 'We're ramping up on a program, which is a good way to do this. And I also want to acknowledge the fact that we had many teachers and administrators here suggesting to us that what the teachers need to be successful are to have the mentors, the coaches.'",
        "'speaker_3': 'And that is something that everybody has said over and over again. I'm very supportive of that. And again, Council President Burgess, thanks for your leadership. And I'm all in.'",
        "'speaker_1': 'Yeah, thanks. Please call the roll on the passage of the bill.'",
        "'speaker_2': 'HARRELL Lakota High. O'BRIEN All right. RASMUSSEN All right. So want back shot, all right. CLARKE Hi, Gordon and President. Burgess Hi. Nine in favor and unopposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Thank you. Please read items three, four, five and six.'",
        "'speaker_2': 'Agenda items three through six. Appointments 51 through 54. Appointments of William Chen, Saadia, Hamid, Ruth Kgi and Jonathan Pranab as members, families and Education Levy Oversight Committee for terms of confirmation to December 31st, 2018, the committee recommends all appointments be confirmed.'"
    ],
    "Shoreline Master Program Amendments.": [
        "'speaker_2': 'The Report of the Planning, Land Use and Sustainability Committee Agenda Item number eight. Council Bill 118311 relating to the Seattle Shoreline Master Program amending the Seattle Comprehensive Plan Provisions in the Shoreline District. Thank you. Committee.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_2': 'The Committee recommends approval bill pass as amended.'",
        "'speaker_1': 'I didn't want you to get started on all those numbers. So, Councilmember O'Brien.'",
        "'speaker_0': 'Thank you. As chair of the committee, I could ask of Councilmember Clark would like to read in all those numbers to get some some more face time here before we leave. So. Dunbar, I may have a substitution here in a minute, but why don't I go ahead and speak to the bill for a second?'",
        "'speaker_0': 'I think one of the things that's important to remember the what the reason we do the shoreline management, and it's really to protect our our shoreline habitat. And there's so many competing uses, especially in an urban area like Seattle, for competing for that valuable space on the waterfront and remembering that the end of the day, we're trying'",
        "'speaker_0': 'to preserve the habitat for all the critters that survive on that and manage our existing use of it in a way that's consistent with that. And as we heard in testimony today, this has been a very long process.'",
        "'speaker_0': 'But I'm proud to say that we're at a point now where we have a bill that everyone I've talked to can live with and supports. And I think that's a great spot to be in after a lot of hard work.'",
        "'speaker_0': 'I want to thank all the advocates in the community, whether it's industrial landowners or folks who live on the water working through this process. Also thank DPD staff for a very long process and Department of Ecology has been engaged in this too.'",
        "'speaker_0': 'Before we move forward, I want to go ahead and move to substitute version. I believe it's version 13 for version 12. And what this version does is it's just clean ups, things like correcting for parallel construction and changing for correct adjectival use.'",
        "'speaker_3': 'Second, always that word adjectival.'",
        "'speaker_1': 'The adjective ocean before us is to substitute version 13 for version 12. Any further comments? All in favor of the amendment vote. I oppose vote no. The amendment passes and version 13 is before us.'",
        "'speaker_0': 'So the final thing I'll say is this has been before the council before and came back with some changes. That's where we are today. Once we vote this out of council, it does have to go back to the Department of Ecology for ultimate ratification, I guess is the word I'll use.'",
        "'speaker_0': 'We've been working closely with Department of Ecology through this process, and our understanding is that and I'm confident that everything we've done here today is consistent with the state's goals, and I expect that this would be ratified soon.'",
        "'speaker_1': 'Thank you. Any other comments or questions? Councilmember Clark.'",
        "'speaker_3': 'Excellent. And in all seriousness, this is a big deal. So the updated the shoreline master plan, it's all I mean, your testimony almost makes it sound like it was easy in some way, which is an incredible feat that you two have been able to do that.'",
        "'speaker_3': 'And there's so much more to the shoreline master master program than what we've talked about in terms of overwater residences or houseboats or house barges. And I'm missing probably three or four other descriptions for what they are. But Joe, you came up to the microphone.'",
        "'speaker_3': 'There was a ton of work in terms of industrial uses and what it means to have a working waterfront and be and be consistent with those values that Councilmember O'Brien talked about. We have we have a habitat we care about.'",
        "'speaker_3': 'We have an economy we care about. We have in a way of people living on the water that's important to us as a community that isn't just cute, but is real. People actually live their lives in that way, and it's important to to the values and who we are as a city.'",
        "'speaker_3': 'And so being able to bring those things together, I echo the sentiment about Faith Lumsden being awesome. So she's been great and certainly having Brian Surratt do the shuttle diplomacy pretty awesome. So thanks very much to the staff and to the people who were able to see this out, who were able to see it all the way'",
        "'speaker_3': 'through.'",
        "'speaker_1': 'Thank you. Please call the roll on the passage of the amended legislation.'",
        "'speaker_2': 'Harrill Lakota by Orion Rasmussen All right so want back shot.'",
        "'speaker_3': 'By.'",
        "'speaker_2': 'Clark I got it and president Burgess high nine in favor and.'",
        "'speaker_1': 'Unopposed the resolution passes and the chair will sign it. Other resolutions, please read item nine.'"
    ],
    "Support for a National Mobilization for Higher Wages.": [
        "'speaker_2': 'Adoption of other resolutions. Agenda item number nine. Resolution 31575. Supporting the establishment of a dignified and robust wage for employees performing work in cities across America as part of a national mobilization on April 15th to promote higher wages for all working families.'",
        "'speaker_2': 'Introduced April six, 2015.'",
        "'speaker_1': 'Thank you, Councilmember Lakota.'",
        "'speaker_5': 'Thank you. This resolution is part of a national mobilization. It's going to be occurring April 15th, whereby workers across the country will be out demonstrating, but also making public statements, as well as public officials supporting the establishment of dignified and robust wages for employees.'",
        "'speaker_5': 'The April 15th event will involve 60,000 people in the fast food industry alone, and they will be involved in walkouts in many instances in 200 cities across the country. Should also point out that in Washington state there will be 1000 workers that will be doing these activities and will be in cities across the state such as Spokane'",
        "'speaker_5': ', Pasco, Yakima, Olympia, SeaTac. And it's more than just fast food workers. This will also involve workers that are adjunct professor is in fact myself in controversy while we're at a assembly of students and their drunk professors not too long ago at Seattle University who wanted to be recognized as a bargaining unit as well as other people working'",
        "'speaker_5': 'in this industry, the childcare providers and home care workers nationally. If going back to just looking at the fast food industry, there are roughly 2.5 million workers in that industry and about half of them earn less than $15 an hour.'",
        "'speaker_5': 'One of the major problems our country faces is a lack of the ability to sustain a vibrant economy. Just last month, the employment rate actually was lower than it had been in the previous year on a monthly basis.'",
        "'speaker_5': 'And one of the reasons is that people are just not earning enough money to actually go out and support the economy. So it's critical that we start recognizing that the concentration of too much money in too few hands has, in fact hurting the entire country's economy.'",
        "'speaker_5': 'So this resolution is a way of saying that we want our workers to receive a dignified wage and get the economy moving again. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Clark.'",
        "'speaker_3': 'I just couldn't help myself. It's a good resolution. That's okay.'",
        "'speaker_1': 'Thank you. All in favor of adopting resolution 31575 Vote I II oppose vote no. The resolution is unanimously adopted in the chair will sign it. Is there any other business to come before the council? Councilmember Clark, we're going to remove your May 11 excuse absence.'",
        "'speaker_1': 'Okay, great.'",
        "'speaker_3': 'I thought you would make it come back.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Thanks very much and will be adjourned.'"
    ]
}