{
    "Honorary Designation of South Jackson Street as Ernestine Anderson Way.": [
        "'speaker_0': 'Thank you. The bill passes the material signage report of the full council. Please read the report.'",
        "'speaker_1': 'Because the report, the full council agenda item one, resolution 316 19, providing an honorary designation of South Jackson Street from 27 south to 23rd Avenue South. S Ernestine Anderson Way.'",
        "'speaker_0': 'The council member o'brien.'",
        "'speaker_2': 'Thank you. So this is coming directly to full council. This ordinance would direct to the Seattle Department of Transportation to manufacture, install and maintain honourary signs at the intersections of South Jackson Street and 20th Avenue, South South Jackson Street and 20th Place, south South Jackson Street and 22nd Avenue, South and South Jackson Street and 23rd Avenue South'",
        "'speaker_2': '. Each will reflect the Ernestine Anderson Way honorary designation. Racine Anderson was a legendary American jazz and blues singer from Seattle Center Area and graduate of Garfield High School and Ernestine Anderson Place, a senior affordable housing complex, was constructed in 2012 on South Jackson Street between 20th Avenue South and 20th place south.'",
        "'speaker_2': 'So this designation will occur adjacent to that housing complex. I did not have an honor to hear Ernestine Anderson perform. She passed away at the age of 87 earlier this year. But her legacy certainly is impressive. One anecdote I read in her obituary talked about how she was born in Houston and moved to Seattle in high school'",
        "'speaker_2': ', and her father came to Seattle looking for work, but also because he wanted to be on the West Coast. And Seattle is like a sleepy town where he could get his daughter away from the music scene. Little did he know that Garfield in the Central District at that time was just emerging, and she played a significant role'",
        "'speaker_2': 'in that. And her overlap with Quincy Jones and Ray Charles and other folks who were in the music scene in Seattle at that time were impressive. This is a great a great chance to honor one of the leaders in our community for so long and look forward to voting yes on this bill.'",
        "'speaker_0': 'Thank you, Councilmember Rodney, for the comments. Alex, say a few words. No one else would. Casper and Brian, thank you for describing Ms.. Anderson's background. And many people have been around Seattle for decades and many are recent arrivals.'",
        "'speaker_0': 'And I just think it's critically important when we celebrate this kind of history is, as you described, she recorded over 37 albums in her lifetime and she was really celebrated as a jazz artists throughout the world when she attended Garfield High School.'",
        "'speaker_0': 'That's where she met Quincy Jones. And you have to talk publicly about Quincy was a classmate of my mother and father's at Garfield. High school. And so I've had the opportunity to sort of over the years, interface with Miss Anderson's family.'",
        "'speaker_0': 'And her daughter Yvonne was attending school with myself. She's part of some great history in Seattle with groups such as Bumps Blackwell and Buddy Catlett and, of course, Quincy Jones. And those folks, if you go to the Safeway on 23rd and in Madison, you'll see a picture of a group called Bumps Blackwell.'",
        "'speaker_0': 'That many folks. It was just one of the best jazz groups around. And Quincy Jones is in that picture. And my father is a saxophone player sitting right next to Quincy Jones. So it's quite extraordinary what talent has come out of this city.'",
        "'speaker_0': 'Quincy Jones described Ernestine his voice as, quote, honey at dusk, and he said that the world got a taste of her honey. And she performed in the Monterey Jazz Festivals at Carnegie Hall in the White House during the first inauguration of Dwight Eisenhower at the Kennedy Center.'",
        "'speaker_0': 'She toured Europe and had many concerts in London and New York. So again, quite a local treasure. In 1999, the Pulitzer Prize winning photographer, Brian Lenker published a book I think many of you have heard of. It's called I Dream a World.'",
        "'speaker_0': 'And in that book, she he describes 75 women, African-American women who really changed America, Coretta Scott King, Sarah Vaughan, Oprah Winfrey, Rosa Parks and our own Ernestine Anderson is in that book. So, so again, she's quite a legend.'",
        "'speaker_0': 'And I think as we preserved what's great in this city, I think part of that is actually preserving names like Reverend McKinney and Ernestine Anderson and others. So I'm very happy to support this resolution. You know the comments.'"
    ],
    "Open Housing Ordinance Amendments to Protect Renters' Income Sources and Fair Access.": [
        "'speaker_0': 'Okay. So those in favor of adopting the resolution vote i, i, those opposed vote no. The ayes have it. The motion carries and resolutions adopted and chair Cheryl, sign it. Next agenda item, please.'",
        "'speaker_1': 'Agenda item two accountable 118 755 relating to the open housing ordinance, adding anti-discrimination protections based on a renter's use of a subsidy or verifiable alternative source of income. Adding a first in time policy prohibiting preferred employer programs. Adding Section 14.8, Windsor 52 and amending sections 14.0 8.2 or 15.0 20.0 40.0.'",
        "'speaker_1': '45.0 60.0 79.1 90 of the Seattle Municipal Code.'",
        "'speaker_0': 'Thank you. So this is sort of going to be an exercise and procedure as well. So we'll lead off with Councilmember Herbold to introduce the base legislation. And thank you for all your work on this this ordinance.'",
        "'speaker_5': 'Thank you. So the bill expands the legally protected classes to include alternative sources of income like we've heard today, such as the pension, Social Security, unemployment, child support, disability, or any other governmental or nonprofit subsidy. We discussed the bill on May 24th, June 14th, and again on July 22nd.'",
        "'speaker_5': 'Throughout those discussions, the legislation was amended to add three primary further protections. The first is the new policy referred to as first come, first serve screening practice. Sometimes first in time is what we call it. It prevents housing providers from giving applicants with alternative sources of income or other participation in a protected class a lower priority.'",
        "'speaker_5': 'It requires landlords to review applications one at a time on a first come, first serve basis and offer the unit to the first qualified qualified tenant. A big part of this practice really relies on property owners notifying tenants on what it will require to qualify for a unit.'",
        "'speaker_5': 'So we've heard some people. QUESTION Well, will I have will I be forced to to rent to somebody who has a bad a bad tenant screening background or has done damage to two units in the past? That would not be the case.'",
        "'speaker_5': 'So you still have to qualify the tenant as eligible for for a unit. A second provision included in this new bill is a new eviction prevention. And now that's very distinct from what we've been hearing about an alternative source of income at the start of a tenancy.'",
        "'speaker_5': 'This deals with a new protection for tenants who have fallen behind in their rent and have received a three day pay or vacate. Under current law, a landlord is not required to accept a housing assistance or a rental assistance voucher during that three day pay or vacate time.'",
        "'speaker_5': 'At this point, with this new protection, housing providers will be required to accept that that voucher, as long as that voucher turns into cash within five days. You know, one of the things that we've. We've heard a little bit of concern about is whether or not that's going to result in greater numbers of people in the future'",
        "'speaker_5': 'being evicted either because this is a short term rental assistance, either on the front end or short term rental assistance during an eviction situation. And what we've found of the city's programs, we fund about ten programs through the housing lobby.'",
        "'speaker_5': 'And we found that of the households who have received eviction prevention funding or or move in assistance, 83% were stable in housing six months after the assistance ended. The third item that the bill includes is a preferred employer program prohibition.'",
        "'speaker_5': 'This encourages landlords to offer nondiscriminatory moving incentives and discourages or outlaws discriminatory move in incentives. In 2015, we heard from community members reporting discounts on deposits and other move in fees for rental applicants working for preferred employers. In this bill, with this provision would end that practice.'",
        "'speaker_3': 'So those are the highlights of the bill.'",
        "'speaker_5': 'And I know we also have some amendments to walk through. So I, I think the first one is a rather a substitute version.'",
        "'speaker_0': 'I have in my notes, Councilmember Herbold, that you would have a First Amendment which would basically substitute version five for version four.'",
        "'speaker_5': 'Correct. So I move to amend Council Bill 11 8755 by substituting version five for version for.'",
        "'speaker_4': 'Which.'",
        "'speaker_0': 'Second is their second, which just by way of context was the bill that we've been working from. So all those in favor of amending Council Bill 11875 by submitting version five for version four, vote I, I was opposed.'",
        "'speaker_0': 'Know you guys have it. And at this point, I think we can take Councilmember Burgess's amendment, too.'",
        "'speaker_4': 'Thank you. This amendment adds a requirement that the first in time measure in this legislation be evaluated by the city auditor after 18 months of full implementation. The purpose of this audit is to determine whether or not it has had any unintended consequences on low income persons or persons with limited English proficiency to obtain housing.'",
        "'speaker_4': 'It directs that the city auditor complete this evaluation, but at their discretion, they may use an independent outside party to conduct the evaluation and to report back to the City Council by the end of 2008. So I would move amendment number two.'",
        "'speaker_0': 'The second city councilmember words. Did you have a comment you'd like to make on the first in time issue?'",
        "'speaker_3': 'I do. So just so I'm clear, this is Councilmember Burgess and Johnson's new section D first in time. Correct?'",
        "'speaker_0': 'Correct.'",
        "'speaker_3': 'Okay. So from our discussion this morning and then some some more material that I looked at over the break, I wanted to just make a few comments there. Often times when we think is when we think what we think is most fair does not truly benefit those most in need.'",
        "'speaker_3': 'First come, first serve is one of those policies. Many programs that are meant to be economically diverse are programs that attempt to be more accessible to a wider range of populations. We use a lottery system to increase access rather than the first come first serve.'",
        "'speaker_3': 'Many nonprofit housing providers are also using a lottery system to place new residents in housing or on a waitlist for housing. People with the greatest level of access are often the first to be served because they have the means to apply first.'",
        "'speaker_3': 'I believe the intent of this provision is to limit a landlord's personal bias to cherry pick which residents they deem, quote unquote worthy and to instead into as well level the playing field for those looking for housing. Although I agree with that intent, I am concerned this provision may unintentionally solidify into law a practice that favors those'",
        "'speaker_3': 'who are who already have the privilege of access. In any event, I support the amendment and to require an honest report of this provision after eight weeks, after 18 months, to evaluate its effectiveness. So thank you, Councilmember Burgess and Johnson.'",
        "'speaker_0': 'Thank you, Councilman. Worse. We have an amendment, an amendment that's been moved in second. And any further comments regarding the amendment? Councilmember Johnson.'",
        "'speaker_7': 'Yeah, thank you. Council President. I just want to echo what councilmember was that. I think my intention in joining with Councilmember Burgess on the amendment today is. To ensure that what we're doing here is not creating an unintended circumstance where people of higher incomes with access to Internet and a private vehicle can quickly get out to somewhere'",
        "'speaker_7': 'where an apartment is available and beat other folks to the punch. I know, as Councilmember Herbold and I have talked, that this is happening already. This is an issue that is coming before us because it is happening already.'",
        "'speaker_7': 'And that this is an important first in time, is an important best practice and not only the local level but at the national level from our Housing and Urban Development Department as well as several others. But I just want to make sure that as we get into this legislation, that we really have a good understanding about who'",
        "'speaker_7': 'is benefiting from this and can have the authority in a couple of years to really say all is working. So thanks for the opportunity to speak.'",
        "'speaker_0': 'Very good. Councilmember Herbold, thank you.'",
        "'speaker_5': 'And I just wanted to clarify that there is a section in the bill that states that landlords who agree to voluntarily set aside available units to serve special vulnerable populations, including but not limited to homeless people, survivors of domestic violence, persons with low income and persons referred to the owner by nonprofit organizations or social service agencies or'",
        "'speaker_5': 'other protected classes. The first in time policy does not have to be observed if a landlord wishes to rent to one of those types of people.'",
        "'speaker_0': 'Thank you. So I'm going to call on a vote on the amendment. Councilmember Burgess proposed an amendment to Council Bill 118755 Section five by adding a new Section D. All those in favor say I. I opposed say no.'",
        "'speaker_0': 'The ayes have it. I believe Councilmember Burgess has another amendment.'",
        "'speaker_4': 'Thank you. This next amendment number three in our packet is very similar and asks for the city auditor to conduct an evaluation of the use of short term vouchers to determine if that program should be maintained and whether or not there are any adverse impacts on individuals being able to remain in housing with the use of these'",
        "'speaker_4': 'short term vouchers. And again, we ask for this evaluation to be completed by the end of 2008. I move amendment number three.'",
        "'speaker_0': 'Is there a second? Any comments on Councilmember Burgess's amendment number three?'",
        "'speaker_3': 'I do.'",
        "'speaker_0': 'Councilmember, once.'",
        "'speaker_3': 'Again, I just wanna make sure this is a new section. What I want to add about when I was looking at this and I want to thank the low income housing alliance folks for coming in and providing information in a briefing.'",
        "'speaker_3': 'Much of the funding for our rapid rehousing programs and other short term subsidies to help people experiencing homelessness find stability. Finding stability comes from the document recording fees. This is a state level policy. When this program was up for review two sessions ago in Olympia.'",
        "'speaker_3': 'The private market lobbied to require that 45% of these dollars for short term subsidies be spent in the private market. Now we have the private market saying that they should not be required to accept these dollars. One of the issues, of course, is they believe that it would lead to more evictions.'",
        "'speaker_3': 'So to me, these two things don't add up. I agree that we want to ensure that people are not being set up for evictions. The auditor's report in 18 months does show that the short term rental subsidies in the private market are not supporting renters.'",
        "'speaker_3': 'I would expect the private market to help us change the provision at the state level to remove the 45% requirement. I know that we are going to work hard, at least our office, some other people here, my colleagues, during next year's legislative session to continue to monitor the situation.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Whereas Councilmembers Burgess Third Amendment has been moved in second. It is there. Are there any further comments?'",
        "'speaker_4': 'I would just comment that Councilmember Johnson is joining in, sponsoring both of these. Don't want to leave him out.'",
        "'speaker_7': 'So he can do it.'",
        "'speaker_0': 'On his.'",
        "'speaker_7': 'Is he's.'",
        "'speaker_0': 'Got a press release ready to push the button so this passes. So all those in favor of Councilmember Burgess and Johnson's amendment number three, which basically adds a new section, j say i. I oppose say nay. The ayes have it.'",
        "'speaker_0': 'Now, my notes, Councilman Herbold, would suggest that you would like to look at Section two dealing with meaningful access.'",
        "'speaker_5': 'Thank you. I'd like to take this amendment in two parts. Amendment four, I moved to amend Council Bill 11 8755, Section two, by adding a new definition entitled Ensuring Meaningful Access, meaning the ability of a person with limited English proficiency to use or obtain language assistance, services or resources to understand and communicate effectively, including but not limited'",
        "'speaker_5': 'to translation or interpretation services. Okay.'",
        "'speaker_0': 'So that's a motion. And is there a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'Thank you. Councilmember Herbert, can you give a little context of why you would like to make this change?'",
        "'speaker_5': 'This is an amendment to the section of the bill related to the first in time policy. There is a stage within the first in time policy that if somebody needs more time to complete their application to provide information that the landlord has in advance, notified them that they are required to provide as part of a complete application'",
        "'speaker_5': '. And that person either needs a reasonable accommodation because of a disability or needs to ensure meaningful access. For instance, in the example of needing translation or interpretation services that they can then get additional time. We did not have a definition for for the types of people who might need meaningful access, and it really could be a very'",
        "'speaker_5': 'broad definition. And we thought that it would be best for censuses. This is a new policy that we're enacting that we ought to put some brackets around it to create some certainty for for property owners.'",
        "'speaker_0': 'Very good. Thank you. Comes from Herbold. It's been moved to add this new definition relative to ensuring meaningful access. Has it been seconded? It has been seconded. All those in favor of amendment number four, say I. I oppose a no.'",
        "'speaker_0': 'The ayes have it and we have Amendment four passed.'",
        "'speaker_5': 'Council President Harold May. I just wanted to make a couple of quick remarks on that particular statement. Not I'm sure is not going to diminish the vote in any way, but I just wanted to make sure that I know that there's a staff in the audience from the Office for Civil Rights.'",
        "'speaker_5': 'And I just wanted to make sure that the intent here was not just to capture folks who have limited English proficiency, but also folks who have no English proficiency at all in. And just wanted to confirm that that was your intent.'",
        "'speaker_5': 'It absolutely is our intent. And then secondly, I'll just say that I was really excited to see this particular narrowing of this definition. One of the things that we're going to hopefully be able to work on through my committee next year is around a language access code in our city ordinance that might lead to some some potential'",
        "'speaker_5': 'additional refinements of this particular language down the road. And would just wanted to put that on your radar and and the rest of the council's radar that we are looking at in conjunction with the Office of Immigrant Refugee Affairs, standing up a particular ordinance around language access and what that means beyond translation and interpretive services.'",
        "'speaker_5': 'And this certainly gives us an entree into having a broader discussion around that.'",
        "'speaker_0': 'Thank you. Catherine Gonzalez.'",
        "'speaker_5': 'There's a second part of Amendment four.'",
        "'speaker_3': 'I could.'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'A further move to amend Council Bill 11 8755, Section five, by substituting Seattle Municipal Code Section 14.0 8.050 as presented on Amendment four. There are some underlined language and some strikeouts that primarily do a couple of things the technical amendments, removing sort of duplicative language, and then further some some changes that constrict the timeline that the the'",
        "'speaker_5': 'first in time policy might result in. We had there was some concern that that with the requirement to. Post notice of what the what information was needed. We needed to make sure that that property owners understood that they could they could do it at the beginning of the process, that we weren't requiring additional an additional period of'",
        "'speaker_5': 'time to do so.'",
        "'speaker_0': 'So consumer health well before it's second. And I know this is emotion. It was my understanding this is sort of a technical cleanup, but it sounds like you're trying to do more than a technical cleanup because.'",
        "'speaker_5': 'The the it is primarily a technical cleanup, the first in the under section one, which says in addition to and at the same time as providing the information, that might be a little bit more than just a technicality, it just making clear that the information can be provided at the beginning of the process.'",
        "'speaker_5': 'It's not adding more time on to the process.'",
        "'speaker_0': 'Very good. Is there a second?'",
        "'speaker_2': 'Second?'",
        "'speaker_0': 'It's been moved in second second it to amend counts bill 118755 the section five by substituting shadow ministry code section 1408050 as presented on an amendment for all those in favor of that amendment, say I. I oppose a nay.'",
        "'speaker_0': 'The nays have no voice, so the ayes have it. That is passed as well. Let's move to amendment number five. Councilmember Baxley, I believe you have an amendment number five you'd like to discuss.'",
        "'speaker_3': 'Yes, thank you. It's the same that I brought forward this morning. It's really just a definitional correction or making it clear that this will not apply to single family dwellings, including accessory dwelling units where the owner is on site.'",
        "'speaker_3': 'I was directed to this because there was some confusion about in the individual, lived in her home and wanted to be able to have a specific effort to find a tenant that might have something like nursing skills or others wanted to make sure that under current law that she would be allowed to do so.'",
        "'speaker_3': 'And indeed, this makes no changes. It just highlights the fact that it is already in law.'",
        "'speaker_0': 'Very good. I will take that as a form of an amendment to the Council bill. Is there a second?'",
        "'speaker_3': 'I need a second here. Second.'",
        "'speaker_0': 'Little slow on trial here. Okay. Any further discussions on Council Member Bag Shaw's amended amendment? And just so I'll stated clearly that Customer Bagshaw moved it and it was seconded by two individuals. They had a new 11th recital, which I believe is second to the last, whereas the first in time policy will not apply to single family'",
        "'speaker_0': 'dwellings, including accessory dwelling units wherein the owner or person entitled possession maintains a permanent residence as described in 14.08.190.3. And of course, all those in favor of Amendment five, say I. I opposed say no. The ayes have it.'",
        "'speaker_0': 'We're almost through. We have a a comma. We have to discuss it. Councilmember her while there's a missing comma you would like to address.'",
        "'speaker_5': 'Thank you. I further moved to amend Council Bill 11 8755, Section two of the Seattle Municipal Code 14.0 8.0 to oh Preferred Employer Program Definition Line six of the definition to add a comma between the clauses. Other publicly funded housing comma for the benefit of city, etc..'",
        "'speaker_5': 'And so Councilmember Burgess raised this issue in council briefings meetings this morning, and we found that the issue of whether or not a preferred employer program to show preference for city workers, that we want to make sure our living in the city, such as our firefighters and our police officers, that that that that was clearly delineated in'",
        "'speaker_5': 'the ordinance that that was permitted. It did as it was as it read without the comma, it wasn't clear that it it was covered. But with the comma, I think it's a lot more clear.'",
        "'speaker_2': 'Good catch.'",
        "'speaker_0': 'And before we start debating about this comma, we're going to have to suspend the rule. So I will move to suspend Council Rule three A6 relating to presentation of full council amendments prior to 12:00 noon. There are second.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'All those in favor of the suspension of council rules. Three, eight, six. Say I opposed. Say no. The ayes have it. Now I'll just make the motion I move to. I'm sorry. So Councilmember Herbold amendment now can be considered.'",
        "'speaker_0': 'Councilmember Herbold, will you make that motion again and we can vote on it?'",
        "'speaker_5': 'I'm happy to make it again. I move to amend Council Bill 11 8755, Section two of the Seattle Municipal Code 14.0 8.020. Preferred Employer Program Definition Line six of the definition to add a comma between the clauses. Other publicly funded housing and for the benefit of city.'",
        "'speaker_0': 'There are second seconds after all that. I hope there's a second. I'll describe this as amendment number six. All those in favor of amendment number six. Vote I. I was supposed vote no. The ayes have it. Okay. We have six amendments to the base legislation.'",
        "'speaker_0': 'Are there any further comments or closing comments before we consider a final adoption of this bill?'",
        "'speaker_2': 'Councilmember O'Brien Yeah, I want to I want to just say that this is a impressive piece of legislation that will have a significant impact on folks lives trying to find housing in the city. And I want to start by thanking Councilmember Herbold for your ongoing advocacy on behalf of tenants in the city and really outstanding work on'",
        "'speaker_2': 'this piece of legislation in particular. I want to thank folks that are here looking at folks in the background representing various landlord groups from the Rental Housing Association, Washington Multifamily Association. Really appreciate your comments today. I know that you've expressed concerns about some of how this plays out, but I want to say that your engagement in this'",
        "'speaker_2': 'process has made this legislation stronger. And I look forward to continuing to work with you as we work through this and understand which aspects are working well. And if there's places where we need to make changes, certainly be prepared to do that.'",
        "'speaker_2': 'Mostly, I want to thank the advocates who have been tirelessly fighting for folks that are struggling to find places to live in the city. This piece of legislation, along with others that you all have worked on, has been really powerful.'",
        "'speaker_2': 'Do you continue to fight for those that need support the most in this community? And I'm pleased to be supporting voting in support of this legislation because of the great work you all have done. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Brian. Councilmember Johnson.'",
        "'speaker_7': 'I hope we'll leave the space for you, Councilmember Herbal, to close this out. But I just wanted to make a quick comment that says, you know, as the chair of the Planning Lands and Zoning Committee, I don't know if it was explained to me when I took the committee how much of the hollow recommendation responsibilities were going'",
        "'speaker_7': 'to come under my purview. But I'm really grateful and encouraged by the number of recommendations that we're continuing to adopt out of the work of that committee, including the work that we did last week on the mandatory housing affordability residential framework.'",
        "'speaker_7': 'That dovetails really very nicely with the action that we're going to take today, as well as upcoming moving forward legislation. When you combine that with the really impressive results coming out of last Tuesday's housing levy, I think it's a real demonstration that this council in particular is very committed to whatever we can do to make the city'",
        "'speaker_7': 'inclusive and affordable for everybody, regardless of your income. So I want to say thank you, Councilmember Herbold, for bringing this legislation forward. I'm pleased to be voting yes on it today.'",
        "'speaker_0': 'Further comments, I'll say a comment unless you close to the comments. Comments from Herbold. I want to thank you. You know, we're really deep in the weeds on this legislation, but and I say that sort of tongue in cheek, because that's exactly what you have to do, I think.'",
        "'speaker_0': 'I think we can recognize that there are a lot of really good landlords out there really trying to do the right thing. And we have organizations out there that, you know, a lot of these folks are not very wealthy folks.'",
        "'speaker_0': 'They're just trying to rent a home. Some we talk about some discrimination being unintentional. There's intentional discrimination out there, too. I mean, it's just there's no soft way to say that there are some people that are discriminating and they're are victims of this discrimination out there that are struggling with for places to live.'",
        "'speaker_0': 'So I think when we start going deep in the weeds like this on these kinds of policies, that is exactly what we have to do. And the Councilmember Herbold leadership and the others that have chimed in with six amendments, this is good work and I like the evaluation component because there's not a template or game plan out'",
        "'speaker_0': 'there that says this is exactly how you do it. So we we look at data out there and then we try to measure it to make sure we're doing the right things. So I appreciate this work, great work.'",
        "'speaker_0': 'And Councilman Herbold, would you like to close debate?'",
        "'speaker_5': 'I would. A few other words continue here.'",
        "'speaker_2': 'But can I interrupt for a second?'",
        "'speaker_0': 'Yes, Councilman Brown, you can slaughter the slaughter rules if you'd like, sir.'",
        "'speaker_2': 'I forgot. I need to disclose that I am a landlord and I try to do that. All the meetings we're discussing legislation that affects my landlord, so I want to make sure the world is aware of that.'",
        "'speaker_0': 'Thank you, Councilman Bryan.'",
        "'speaker_2': 'Sorry. And you still.'",
        "'speaker_3': 'Get a vote?'",
        "'speaker_2': 'I still get it, but.'",
        "'speaker_4': 'GOODLATTE okay.'",
        "'speaker_5': 'So as chair of the council committee with oversight of Civil Rights, I'm acutely aware of the need to balance both the rights of renters with the interests of our housing providers. Our city is a city of renters. Their interests must be protected if we intend to reduce the number of people living homeless and increase affordable housing opportunities'",
        "'speaker_5': '. Race and socioeconomic factors must not be used to prevent people from securing safe, healthy and affordable housing. But that's exactly what has been happening. We know that on any given night in our city, over 2800 people are living unsheltered.'",
        "'speaker_5': 'People of color continue to be disproportionately represented in emergency shelters, especially those who identify as black or African-American. These disparities are really striking when looking at data on families served in our emergency shelters. According to a report on homelessness in Seattle, King County, people of color made up almost 50% of those accessing emergency shelter in 2013.'",
        "'speaker_5': 'People of color made up 46% of single adults and 72% of families accessing emergency shelters. We have a lot of funds that are available to assist people in and homelessness prevention or eviction prevention. We know the city invests about 1.9 million annually for these purposes.'",
        "'speaker_5': 'But if tenants are unable to use these funds, our ability to use our city's resources to prevent homelessness is just simply not as effective as it can be. I mentioned earlier this morning some stats that if you bear with me, I think it really speaks to the need for a first in time policy.'",
        "'speaker_5': 'We can have all the anti-discrimination laws on the books that we want, but we know that discrimination in housing is still happening using HUD approved testing practices. It was revealed by association that prospective tester renters experienced different treatment than did control group renters across all three categories familial status, disability and the use of federal Section eight voucher'",
        "'speaker_5': 'testers reported disparate treatment in 64% of 42 tests related to race. 67% of 43 tests relate related to national origin. 43% of 30 tests related to sexual orientation. And 67% of tests related to gender identity. For 25 years, we have prohibited discrimination based on Section eight status, and I wholeheartedly commend the Seattle Office of Civil Rights for'",
        "'speaker_5': 'proactively enforcing our fair housing laws. I think using a an approach like the person time policy can help us with our compliance. There's a reason why our housing providers identified as as a best practice. They use it as a best practice so that they can make sure that they are avoiding fair housing claims.'",
        "'speaker_5': 'I want to just take a quick minute also to thank all the folks who are involved in developing this this this policy. I thank. They had a workgroup that originally made the recommendation to expand our protected classes to include sources of alternate incomes.'",
        "'speaker_5': 'I thank the mayor for bringing this legislation forward. I also think my staff staff under Councilor Susie Levy, Asha Venkataraman, Director Polly Lawley, Lauren Olson. Brenda Barro, also associate with Office of Housing Kathryn Jolly as well as the source of income discrimination stakeholders that both worked before the Mayor's proposed legislation and after it as we were deliberating'",
        "'speaker_5': ', including the tenants union. Washington Can the Rental Housing Association, the Washington Mall. Multifamily Housing Association. Columbia Legal Services. Wellspring Family Services. Solid Ground Northwest Justice Project. King County Bar. Why She Low Income Housing Alliance and the Seattle Disabilities Commission.'",
        "'speaker_5': 'And finally, thank you to my colleagues on the council. This was a truly collaborative process, and I do think we have a better bill for it. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Herbold. When we stop there and I will move to pass Council Bill 118755 as amended.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'Any further comments? Those in favor of the passage of the bill. Actually, I think we'll do a roll call in this script. Please call the role on the passage of the bill.'",
        "'speaker_1': 'Bagshaw. Burgess. Gonzalez. I. Purple. I. Johnson. Juarez. O'Brien. President. Harrell.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Aden. Favorite unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign this.'",
        "'speaker_6': 'Thank you.'"
    ],
    "Rezone Request for 1511 Dexter Ave North Property.": [
        "'speaker_0': 'All right. Report of the planning, land use and Zoning Committee. Please read the report.'",
        "'speaker_1': 'The report of the Planning Leninism Zoning Committee Agenda Item three Credit File 314 315. Application of 1511 Dexter Limited Partnership for approval of a resume of 16,234 square feet of property located at 1511 Dexter Avenue, north from neighborhood commercial three with a 40 foot height limit to neighborhood commercial three with a 65 foot height limit.'",
        "'speaker_1': 'The committee recommends that the full council grant the application.'",
        "'speaker_0': 'Councilmember Johnson.'",
        "'speaker_7': 'Thank you, Council President. This particular piece of property is a bellwether housing property. They've come to us and asked for a reason to neighborhood commercial 65 to build 45 units of affordable housing at folks earning between 30 and 50% of own median income.'",
        "'speaker_7': '26 units of affordable housing earning up to 60% of the area median income, so a total of 71 new affordable housing units. The corner of Dexter and Gayla Street, though they've asked for 65 feet, is part of this contract.'",
        "'speaker_7': 'Reason the building is only going to be built to 55. He hired to preserve some views and setbacks with unanimous support and approval from their neighbors and the committee. I proudly bring this thing this this application grant forward.'",
        "'speaker_0': 'Thank you very much. Thank you very much. Are there any further comments? Please call the role on the passage of the bill. I'm sorry to clarify all those in favor of the clerk file vote. I I'm sorry. Okay.'",
        "'speaker_0': 'So we just have to file it.'",
        "'speaker_7': 'Earnings. Please bear with us. There's some legal language that we definitely need to read in order to approve the court file.'",
        "'speaker_0': 'Okay. She throws the favor of granting the petition. Please vote. I find those oppose vote no. The motion carries the petitions. Granted, the chair will sign the findings, conclusions and decisions of the City Council. Next agenda item. Police Exigent item, please.'",
        "'speaker_1': 'Agenda item four. Councilmember Joe Council Bill 118 750 relating to the planning and zoning amending Chapter 23.32, the Seattle Municipal Code at page 90 of the official land use map tourism property located at 1511 Dexter Avenue North from neighborhood commercial three Dash 42 Neighborhood Commercial three, dash 65 and accepting a property use and development agreement as condition'",
        "'speaker_1': 'of rezoning approval, the committee recommends the bill pass.'",
        "'speaker_0': 'Councilmember Johnson So.'",
        "'speaker_7': 'Again, this is about the same property, the council bill in front of us and that's the reason granted by the clerk filed by amending the official land use map and accepts the property use and development agreement, which requires the applicant to adhere to the conditions of the reason.'",
        "'speaker_7': 'Since the committee meeting we've received the executed property use development agreement. So I move the council substitute exhibit B executed property use and development agreement for the UN executed version included in the bill.'",
        "'speaker_0': 'Their second. All those in favor of Councilmember Johnson's motion to amend the Council bill by the substitution vote i. I opposed vote no. The ayes have it. Please proceed. Councilman Johnson.'",
        "'speaker_7': 'I believe we now just have the underlying bill in front of us. And I have no further remarks to make. Council President.'",
        "'speaker_0': 'Any further comments? Please call the roll call on the passage of the amended bill.'",
        "'speaker_1': 'Bagshaw Burgess. Gonzalez Herbold. High Johnson. Maurice O'Brien. President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Aden favor and unopposed.'",
        "'speaker_0': 'Bill passes and the chair will sign it. Please read the next gen item.'"
    ],
    "Land Use and Zoning Changes for Lake City Urban Village and Lake City Way.": [
        "'speaker_1': 'Agenda item five Constable 118 675 relating to planning and zoning amending the official land use map to rezone land within the Lake City Urban Village and along Lake City Way and many subsection 23.40 78.005. C of the code to remove certain restrictions on street level, street facing residential uses and amending section 23.47 8.009 to adopt development standards'",
        "'speaker_1': 'for certain property along Lake City, where the committee recommends the bill passed as amended.'",
        "'speaker_0': 'Councilmember Johnson.'",
        "'speaker_7': 'Thank you. Council President So this council bill in front of us reflects several years of outreach by the Office of Planning and Community Development in the Lake City community. It doesn't change any building heights in Lake City, but what it does is it promotes some opportunities for us to create a more pedestrian friendly street along Lake City'",
        "'speaker_7': 'and in the Lake City Neighborhood Business District, Civic Core. The zoning change, as we described, is as capacity neutral, and we had some really good discussions about this in committee. The bill effectively expands the pedestrian designation within the urban village, which allows for us to change some of the way that the building meets the street.'",
        "'speaker_7': 'Does things like prohibit commercial development from having parking lots in front of the building and requires them to be built behind the building, for example. The bill would also effectively change some design standards for large lots, so it would ask us to do some setbacks on large lots over 40,000 feet.'",
        "'speaker_7': 'We had a request from the community to reduce some of the setbacks in those large lots from 45 feet down to 35 feet. And that amendment was passed out of committee. And these, along with other design standards that we're adopting today, we think are going to really result in a community that continues to, as they build in'",
        "'speaker_7': 'building new buildings, be a more pedestrian, friendly, walkable neighborhood that they aspire to be. And that concludes my remarks. I believe Councilmember Wise has some things you would like to achieve.'",
        "'speaker_0': 'Councilmember Johnson comes from a worse.'",
        "'speaker_3': 'Well, I know that you're not all excited about zoning changes, but some of us really are. I know, Robin. I'm excited. I'm excited to vote for the zoning changes today. Lake City is a vibrant, growing community and certainly benefit from the mandatory housing affordability framework that will be coming from this council as well.'",
        "'speaker_3': 'The changes in this legislation will create development guidelines and pedestrian designations to ensure new development meets the needs of the community that's becoming dense and needs to increase walkability and access. I want to thank Councilmember Johnson for his leadership on this legislation.'",
        "'speaker_3': 'I also want to thank Katie Sheehy from the Office of Planning and Community Development, who has spent years working with the neighbors in Lake City to bring these recommendations forward. And most importantly, I want to thank all the community members who dedicate their time and their energy and told their stories and came downtown to provide public comment'",
        "'speaker_3': '. Without their hard work and concern for their neighborhood. A lot of these changes would not be happening today. So with that, I'm happy to vote in support of this. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Worse. Any further comments? Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Bagshaw. Burgess. Gonzalez. I Herbold II. Johnson, Suarez, I. O'Brien, President Harrell high eight in favor and unopposed.'"
    ],
    "Proposed Comprehensive Plan Amendments for 2017.": [
        "'speaker_0': 'Bill passed and the chair will sign it. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item six Resolution 316 882 Identify and propose comprehensive plan amendments to be considered for possible adoption 2017 and requesting that the Office of Planning and Community Development and the Seattle Planning Commission Review and make recommendations about the proposed amendments.'",
        "'speaker_1': 'The Committee recommends the resolution be adopted as amended.'",
        "'speaker_0': 'Councilmember Johnson.'",
        "'speaker_7': 'Thank you. Council President So each year, community members and departments come to the city and ask us to study amendments to a comprehensive plan process. That's commonly called the darkening process. When the Council takes action and asks the Department to study these items to be included in that potential discussion for the next comprehensive plan, we pass a'",
        "'speaker_7': 'resolution. This year. We receive 14 applications for the darkening process. We move four of those applications for for further study. And in addition, during the. Discussion. We discussed two changes in addition to those. For one of those changes was an amendment offered by Councilmember O'Brien to have the Planning Commission and staff of the Office of Planning Community'",
        "'speaker_7': 'Development consider health impacts of residential land uses adjacent to transit, freight corridors, highways, industrial lands, etc.. And then secondly, I offered an amendment which will give a little more specific direction to the Industrial Lands Task Force being convened by the mayor, asking them to evaluate a couple of parcels that we chose not to docket to consider new'",
        "'speaker_7': 'types of industrial uses. So again, the outcome of today's resolution, should it be adopted, is that the planning staff will then spend the next year studying these items and come back to us with the recommendation about whether or not to include them in next year's comprehensive plan process.'",
        "'speaker_0': 'Thank you. Councilman Johnson, any further comments? Those in favor of adopting the resolution vote. I. All right. Those oppose vote no. The motion carries the resolution is adopted and the chair will sign it. Next report, please.'"
    ],
    "Historic Preservation Controls for The Theodora Landmark.": [
        "'speaker_1': 'The Affordable Housing Neighborhoods and Finance Committee Agenda Item seven Accountable 118 731 Relating to Historic Preservation, imposing controls upon the Theodora Landmark designated by the Landmarks Preservation Board under Chapter 25.12 zero Code, and adding it to the table of historic landmarks contained in Chapter 25.32 of the Seattle Ms..'",
        "'speaker_1': 'Mr. Codes Committee recommends the bill pass.'",
        "'speaker_0': 'Councilmember Burgess.'",
        "'speaker_4': 'Thank you. This is. Imposing controls on the Theodora, which is an apartment building in northeast Seattle. It was designated as a historic landmark in October of 2014. The ordinance, if adopted, imposes controls upon this building as specified by the Landmarks Preservation Board.'",
        "'speaker_4': 'This means that any changes to the site, the building exterior and portions of the interior require review and approval of the Landmarks Board. The ordinance details the approval process moving forward for both the Landmarks Board and the owner of the building.'",
        "'speaker_4': 'And the committee recommends this ordinance be adopted.'",
        "'speaker_0': 'Any further comments? Councilmember Johnson.'",
        "'speaker_7': 'Just want to say this building is in my neck of the woods, just up the street, just beyond 65th and 35th northeast. And one of the things that I'm I got a chance to understand better in committee is that when we take these kinds of actions, it becomes part of the inspection process.'",
        "'speaker_7': 'So when inspectors come out to the property to take a look at the development, these protections are outlined in their form. So when they go through their checklist, these are things that they're looking for as well. So we're doing a good job today of making sure that as we convert historic buildings to new uses, that we're doing'",
        "'speaker_7': 'a good job of preserving them and that the inspection process holds up that standard as well.'",
        "'speaker_0': 'Thank you, Councilman Johnson. Any further comments? Please call the rule on the passage of the Bill Bagshaw.'",
        "'speaker_1': 'Burgess, Gonzalez, I Herbold II Johnson, Maurice O'Brien, President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Eight favorite unopposed.'"
    ],
    "Creation of a New Retirement Plan for City Employees and Amendments to the Seattle Municipal Code.": [
        "'speaker_0': 'The bill passes and the chair was signing agenda item number eight. And please read the short title, will you please?'",
        "'speaker_1': 'Agenda item eight Council Bill 118 737 Relating to Seattle City Employees Retirement System Creating a separate retirement plan for city employees whose membership in the retirement system begins on or after January 1st, 2017. Clarifying certain provisions and making technical corrections.'",
        "'speaker_1': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Dan Simon Burgess, thank you.'",
        "'speaker_4': 'The retirement system that we have for city employees was created in 1929, and many provisions have been modified over the years. But the structure and the core component parts of the retirement system have not been changed until this legislation.'",
        "'speaker_4': 'In 2010, the City Council issued a statement of legislative intent that called for an interdepartmental team to explore options for creating different pension benefit for our city employees. The goal was to make sure that the plan remained financially strong.'",
        "'speaker_4': 'That work resulted in approval of a new Sears plan to benefit for new employees in the collective bargaining agreements that we ratified in late 2015 and were approved by the City Council. The ordinance creates a new plan two tier that benefits anyone hired by the city beginning January 1st, 2017.'",
        "'speaker_4': 'And after the new plan. Under the new plan and Tier two, employees will contribute a lower amount 7% rather than 10%. The city's contribution will remain the same. The system has a lower expected long term cost, which protects the long term viability of the retirement plan in total and puts us in a better position to fully fund'",
        "'speaker_4': 'the plan moving forward.'",
        "'speaker_0': 'Thank you, Councilman Burgess. Any further comments? Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Thank Shanghai Burgess. Hi. Gonzalez. Purple. Hi. Johnson Maurice O'Brien. Hi. President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes and the chair will sign it. Agenda item number nine, please.'",
        "'speaker_1': 'Agenda item number nine Resolution 316 88 amending resolution 331334. Establishing the City Council's intent to fund the Seattle City Employees Retirement System in accordance with the January 1st, 2016 Actuarial Study, the committee recommends the resolution be adopted.'",
        "'speaker_0': 'Councilmember Burgess, thank you.'",
        "'speaker_4': 'This is an annual resolution that we adopt that basically pledges the city to make the necessary annual payment to the retirement system. And this resolution again says we'll do that for 2016.'",
        "'speaker_0': 'Thank you. Any comments? Any further comments? Those in favor of adopting the resolution vote i. I. Those oppose vote no. The motion carries the resolutions adopted and the chair will sign it. Item number ten, please.'",
        "'speaker_1': 'Agenda Item ten Resolution 316 89 Approving interest rates set by the Seattle City Employees Retirement System Board and Admin of Administration for 2017. The committee recommends a resolution be adopted.'",
        "'speaker_0': 'That's been purchased.'",
        "'speaker_4': 'Thank you. The Board of Administration of the Retirement System is recommending that the city establish the interest paid to city employees who withdraw their funds from the retirement system at 2.86% on contributions made after December 31st, 2011. Member contributions received before December 31st, 2011 will continue to accrue interest at a rate of 5.75%.'",
        "'speaker_0': 'Any further comments? Those in favor of adopting the resolution vote i.'",
        "'speaker_4': 'I.'"
    ],
    "Alley Vacation Request by Swedish Health Services.": [
        "'speaker_0': 'Those opposed vote no. The motion carries the resolution that is adopted and the chair will sign it. Next report, please.'",
        "'speaker_1': 'The report of the Sustainability and Transportation Committee Agenda Item 12 Clerk filed 314304 petition of Swedish Health Services for the vacation of the Alien BLOCK 95 Teri Second Edition to the City of Seattle. The committee recommends the full council grant the application as conditioned.'",
        "'speaker_0': 'Thank you, Councilmember O'Brien.'",
        "'speaker_2': 'Thank you. So this is part of the expansion for Swedish Hospital. This plant on First Hill, it's part of the plans that were included in the major institution master plan, which came to the council recently. The alley in question is and it goes to the property bordered by between Columbia and Cherry and Miner and Boren.'",
        "'speaker_2': 'The Swedish hospital did a great job, in my view, of working with the local community to determine a set of public benefits that both met the local communities needs and I think the needs of more broadly of the city of Seattle.'",
        "'speaker_2': 'It's a good example of public benefits provided offsite, which is also more feasible because of Swedish the expanse of the campus. A couple examples of the projects that are included in the public benefit. You can see them all if you go into the documents.'",
        "'speaker_2': 'One is completing the what's called the first hill mile. This is a kind of walking circuit that the neighborhood has identified as part of their neighborhood plans. It's basically what Swedish would be doing would be upgrading the sidewalks, signage, curb cuts, those types of things for street frontages both adjacent to this project, but also stretches beyond Swedish'",
        "'speaker_2': 'Hospital into the neighborhood to make a nice one mile loop that people could walk on in the neighborhood. And also folks that are staying in Swedish or recovering it Swedish could use. There's also public art locations and access points on the project.'",
        "'speaker_2': 'I'm also wanted to say that I'm excited to be supporting Swedish for variety of reasons, including the fact that my kids were born there. And but they've also done a lot of great work to show their continued commitment to our community, including recently updating their charity care program, which serves as a national model for really doing work'",
        "'speaker_2': 'the way a nonprofit hospital should be doing. I also just want to say that during the comments at the committee, we had representatives of the first Hill neighborhood come in, speak directly to how excited they are for the public benefit that's coming.'",
        "'speaker_2': 'And so it's it's great when you have kind of community unanimity around a process like this. It makes our job easier. I will be happy to support this.'",
        "'speaker_0': 'Thank you. Councilmember Bryan, any further comments or questions? Those in favor of granting the petition as to please vote i. I. Those oppose vote no. The motion carries the petition is granted as condition and the chair will sign the conditions of the City Council.'"
    ],
    "Equity and Environment Agenda Policy Resolution.": [
        "'speaker_0': 'Please read the next agenda item.'",
        "'speaker_1': 'Agenda Item 13 Resolution 316 81 Establishing the Shared City and Community Goals and Strategies of the Equity and Environment Agenda as that policy and a critical aspect and foundation for all environment and sustainable sustainability work. In Seattle, the committee recommends the resolution be adopted.'",
        "'speaker_2': 'Councilmember O'Brien So just a reminder, the Equity Environment Initiative was initially rolled out by Mayor Murray a couple of years ago. It's a great program. The Council supported it significantly through the budget process two years ago and again last year.'",
        "'speaker_2': 'And the work has been an ongoing effort within the Office of Sustainability Environment and their Equity and Environment lead through a community group. The community leaders came together to help create the Implementation Plan for Equity Environment Initiative, including four goals and what this legislation would do, this resolution would adopt that agenda and those specific four goals.'",
        "'speaker_2': 'So I'll go ahead and just highlight those four roles. The first is healthy environments. For all the intent there is to make sure that folks throughout the community, regardless of their various circumstance, have access to clean air, clean water, green space, healthy food and safety and quality of life.'",
        "'speaker_2': 'The second goal speaks to jobs, local economies and youth pathways, the idea being that folks from every community should have meaningful opportunities to work in the fields that advance the environmental goals within their own community and find sustainable employment in those.'",
        "'speaker_2': 'An example is some more community members have been doing around local green career pathways and trying to ensure that low income communities and communities color youth from those communities can actually make careers in various aspects of the green.'",
        "'speaker_2': 'Economy, supporting their family and making their communities and our planet a safer, healthier place to live. The third goal is equity in city environmental programs. So making sure that everyone has access in the community, has access to the decision making process and other proposals the city puts forward.'",
        "'speaker_2': 'And the final goal is an environmental narrative and community leadership. And this is one way we can celebrate the stories from within our community and also make sure we're investing back in our communities. I continue to see the work done by both the Office of Sustainability here as the Office and the Equity Environment Directors.'",
        "'speaker_2': 'Joining us now as as nationally leading work. We have some amazing folks working on that locally, but I really want to give a shout out to the community partners that were part of this process that really highlighted this agenda and ensuring that the equity environment agenda is centered around the communities often most impacted by environmental degradation.'",
        "'speaker_2': 'But also the communities have much to gain as we continue to improve our environment. And I look forward to their ongoing involvement in this process as it continues to evolve.'"
    ],
    "Street Name Changes and Corrections in Various Locations.": [
        "'speaker_0': 'Thank you. And Brian, any further comments? Those in favor of adopting the resolution vote i. I. Those oppose vote no. The motion carries the resolution is adopted and the chair will sign it. Please read the next agenda item and you can read the short version.'",
        "'speaker_1': 'Agenda 14 Council Bill 118 732 Relating to City Streets. The committee recommends the bill pass.'",
        "'speaker_2': 'Councilmember O'Brien So this bill, well, it touches on a lot of street names throughout the city of Seattle. It's mostly clean up. The city has done some work to go back and review the naming of various streets, mostly for consistency with what is already in practice on the ground in our communities to make sure that our records'",
        "'speaker_2': 'line up for our first responders. So an example, kind of a hypothetical example is there are streets that are already signed a certain way that the community refers to them in a certain way. And yet our official records don't reflect that.'",
        "'speaker_2': 'So when someone were to call in an emergency at a certain address, first responders may have some confusion as to where that is. So this just for the most part, we we're bring our official records into alignment with signage that's already in place in many places and certainly common out there.'",
        "'speaker_2': 'There are a couple of places also where there are cleanups of roads. An example would be Broad Street, which is largely been vacated as the as we've redone the kind of Mercer area connecting I-5 to Seattle Center. But there's a little partial block segment of Broad Street that's left, but there's that since that is now the only'",
        "'speaker_2': 'little section of Broad Street that will be renamed. I forget what it's going to connect to, but with an adjacent street to make that clear, this this bill will require a handful of folks, I believe, less than a dozen to have to formally change their address because of the new street name.'",
        "'speaker_2': 'Those folks have all been notified to be aware of that and will have time to make those changes.'",
        "'speaker_3': 'Are they businesses?'",
        "'speaker_0': 'Customer Baker.'",
        "'speaker_3': 'Thank you. Are those businesses or residents?'",
        "'speaker_2': 'That's a good question. I don't know the answer to that.'",
        "'speaker_3': 'It's a lot more difficult for businesses, obviously.'",
        "'speaker_2': 'So my understanding is they've done multiple steps of outreach to folks in that. I haven't heard any concerns to the process of anyone saying that this is too burdensome on them, not to say that that is an inclusive group, but I know that we asked the question and they have done try to be proactive in making sure'",
        "'speaker_2': 'folks are aware of the changes.'",
        "'speaker_0': 'Thank you. Any further questions or comments? Please call the rule on the passage of the Bill.'",
        "'speaker_1': 'Bagshaw, Burgess. Gonzalez, Purple Herbold Johnson. Suarez O'Brien. Hi, Sowhat. Excuse me. President Harrell.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'And favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes and the chair will sign it. Next agenda item, please.'"
    ],
    "Lynnwood Link Supplement to the Memorandum of Agreement for Intergovernmental Cooperation between Sound Transit and the City of Seattle.": [
        "'speaker_1': 'Agenda item 15 Council Bill 118 733 relating to the Central Puget Sound Regional Transit Authority, authorizing execution of the Lynwood link supplemental to the Memorandum of Agreement for Intergovernmental Cooperation between Central Puget Sound Regional Transit Authority and the City of Seattle for the Central Link Light Rail Project and ratifying confirmed research and projects, the committee recommends the'",
        "'speaker_1': 'bill pass.'",
        "'speaker_2': 'Catherine O'Brien So the Lynwood link is the name of the Light Rail project that will extend from Northgate North to Lynnwood. The the agreement they were amending dates back to 1998. I believe this is something like the ninth or 12th Amendment to that agreement.'",
        "'speaker_2': '10th Amendment agreement. Thank you, Councilmember Johnson. So we continue to be basis on that original agreement, back when sound transit first started in the region and continue to add sections as it continue to add sections to the light, rail, spine and corridor.'",
        "'speaker_2': 'We continue to update that agreement. This is one of the places that we discussed a lot in the work this council did, along with sound transit board members and others throughout the region, leading to Sound Transit, putting the Sound Transit three ballot measure forward and that set of projects.'",
        "'speaker_2': 'There was a lot of talk, as you may recall, about what are the things that we can do as a city and other jurisdictions can do to coordinate better, streamline the process to both reduce costs for expanding light rail and perhaps more importantly, reduce the time line it takes to deliver it.'",
        "'speaker_2': 'I believe this memorandum of understanding reflects the ongoing, strong relationship that Seattle Department of Transportation has built with sound transit, things like how we work together on utility corridors, whether it's Seattle City, later Seattle Public Utility or right away that Seattle Department of Transportation owns or other ways the city interacts with light rail authority are important.'",
        "'speaker_2': 'And I also think it's something that we will continue to build upon and improve if voters do pass that on transit three this fall to allow us to continue to streamline that process so that we can get light rail in our communities as soon as possible.'",
        "'speaker_0': 'Thank you, Councilman O'Brien. Any further comments or questions, Councilmember Johnson?'",
        "'speaker_7': 'You know, we heard a lot from colleagues on the council as well as from members of the public about their interest in building out as Tier three were to pass more quickly. This is exactly the kind of framework legislation that we'll be relying on should voters vote yes in November?'",
        "'speaker_7': 'So I want to say thanks to Councilmember O'Brien for bringing this thing forward and looking forward to continuing for Amendment 11 and beyond.'",
        "'speaker_0': 'Thank you, Councilman. Just anything for the comments or questions. Please call the roll on the passage of the Bill Bagshaw Burgess.'",
        "'speaker_1': 'Gonzales.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Gonzales. I. Herbold. Hi. Johnson. Suarez. O'Brien. All right. President Harrell high eight in favor and unopposed.'",
        "'speaker_0': 'The bill passes in the chair of the Senate. Please read the next report.'"
    ],
    "Amendment to Seacrest Boathouse Concession Agreement with Marination LLC.": [
        "'speaker_1': 'The report of the Parks, Datacenter, Libraries and Waterfront Committee Agenda Item 16 Council Bill 118 725 relating to the Seattle Department of Parks and Recreation, authorizing the Superintendent of Parks and Recreation to execute for and on behalf of the city.'",
        "'speaker_1': 'An amendment to the existing Seacrest Boathouse Concession Agreement with Marin Nation, LLC, originally authorized by Ordinance 12411 to authorize and superintend to execute feature memos relating to concession fees, as the superintendent determines to be in the best interest of the city in ratifying confirming certain prior acts, the committee recommends the bill passed.'",
        "'speaker_0': 'Councilmember Wirth.'",
        "'speaker_3': 'Thank you. As you know, Mayor Nation is a fantastic local business that has been growing since 2009. Owners Camila and Ross dreamed up a delicious fusion of Hawaiian and Korean cuisine. Very nation, started with a mobile food truck and now they have four locations.'",
        "'speaker_3': 'In 2013, Muir Nation entered into a concession agreement with the Department of Parks and Recreation to lease the Seacrest boathouse at the Seacrest very dock. Very nation has put $200,000 of improvements into the boathouse. This led to this legislation is an update to their lease agreement to make their payments to the Department of Parks and Recreation consistent'",
        "'speaker_3': 'with other market rate partnerships. It would require imagination to pay $32 per square foot plus 2% of their gross receipts. This will increase consistency for imagination so they can continue to have successful a successful business and partnership with Parks and Recreation.'",
        "'speaker_0': 'Thank you. Thank you. Casper. In words, any further comments or questions? Councilmember Herbold.'",
        "'speaker_5': 'Well, first of all, it's no surprise that the rate that they were paying greatly outstripped their expectations. It's an incredibly popular and delicious restaurant. I do have a question about the looking at the fiscal note. It looks like the changes that we are voting on today will go back to 2013.'",
        "'speaker_5': 'The fee payment a change change will be effective. 22nd October 2013. And I don't need to know this now if you don't know the information off the top of your head when you're looking at the fiscal note, it shows an impact of $90,000 in 2016 and 2017.'",
        "'speaker_5': 'And I believe that's the revenue that they are anticipating to receive moving forward under this new rate. My question is, is are we giving are we giving them a refund for for fees paid over and above what they're required?'",
        "'speaker_5': 'And and if so, I'd be interested to know a little bit more about that.'",
        "'speaker_3': 'I believe we are not giving them a refund. If I remember correctly.'",
        "'speaker_0': 'I would sort of chime in and say that I was at the committee discussion when the. When the whole issue has come up. But that issue of a refund did not come up. And it was certainly my understanding when I voted on it to support the committee that it was moving forward.'",
        "'speaker_0': 'It was prospective, not retrospective. But currently there's a fiscal note that seems inconsistent with that company.'",
        "'speaker_3': 'And both owners were there. Okay. Well, we can check out afterwards.'",
        "'speaker_0': 'Okay. Any further comments or questions? Please call the rule on the passage of the bill.'",
        "'speaker_1': 'By John.'",
        "'speaker_6': 'Burgess.'",
        "'speaker_1': 'Gonzalez I Herbold Johnson. Suarez O'Brian. President Harrell. Hi. Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes and the chair will sign it. I believe that comes to the end of our agenda. And is there any further business to come before the council? Catherine Gonzalez.'",
        "'speaker_5': 'Now we're following the rules. Thank you so much. As I mentioned in council briefing this morning, I am asking to be excused for this Monday, August 15th, in order to be able to, as chair of the Safe Communities Committee, to be able to attend a very important hearing that will occur in Judge Roberta's court related to the'",
        "'speaker_5': 'city's ongoing compliance with the consent decree.'",
        "'speaker_0': 'Fails the lack of a second. Is there any further? No.'",
        "'speaker_6': 'Second motion.'",
        "'speaker_0': 'Their second. It's been moved. And secondly, that Councilman Gosar be excused on August 15th to attend this very important hearing. All those in favor say I. I opposed say no. She's representing us. Thank you very much. Any further business to come?'",
        "'speaker_5': 'And I'm hoping to be able to make it back before the end of end of council for council. But wanted to exercise some caution there.'",
        "'speaker_0': 'Very good. You know that. No further business. Everyone, have a great day and we'll stand adjourned.'"
    ]
}