{
    "Ordinance to Amend the 2020 Budget and a Proviso.": [
        "'speaker_0': 'Committee reports of the city council. The clerk. Please read item one into the record report. Thank you. Agenda item one Constable 119942. Amending Ordinance 126000, which adopted the 2020 budget. Amending Ordinance 126148 amended proviso and ratified confirming search and prior acts.'",
        "'speaker_0': 'Thank you, Madam Clerk. I move to pass Council Bill 119942. Is there a second? It's been moved and seconded to pass the bill. Councilor Lewis, you're the sponsor of this bill and are recognized in order to address this item.'",
        "'speaker_3': 'Thank you, Madam President. I'm just. Just. Just one moment. I'm sorry. Is this the time where I'm supposed to move, to amend, or. Or are we going to do that?'",
        "'speaker_0': 'Councilor Lewis. We can't. Is this. So I see that you do have an amendment. You are welcome to ask that the Council consider the amendment before you address the underlying bill. Or you can address the underlying bill first and then have us consider the amendment.'",
        "'speaker_0': 'I'm happy to go in whatever order you think would make most sense, that would help the Council have the most productive conversation about about the bill that will ultimately be before us. So if you want to if you want to address the amendment first.'",
        "'speaker_0': 'Completely happy to to have that happen first.'",
        "'speaker_3': 'I think I would like to address the amendment first technical in nature. So I move to amend Council Bill 119942 as presented on Amendment One, which was recently distributed.'",
        "'speaker_0': 'Excellent. We need a second on that amendment. Thank you so much. It's been moved and seconded to amend the bill as presented on Amendment one. Councilmember Lewis, please feel free to address Amendment One.'",
        "'speaker_3': 'Thank you. Madam President, as I mentioned at briefing this morning, Amendment One is technical in nature, and that is the the opinion of the city attorney's office, as well as central staff. And in distributing this amendment last week, clarifies the the amount of money HST is being being given and how that can be spent.'",
        "'speaker_3': 'Then, you know, a necessary change to make sure that this and that this legislation, the changes, the provisions from the summer session can go forward as we intended to. So I would ask that we we vote on this and then move on to discussing the legislation more holistically.'",
        "'speaker_0': 'Thank you, Governor Lewis. Are there any questions or comments on the amendment? No hearing. None. I will ask that the clerk please call the role on the adoption of Amendment One as described by Council Member Lewis.'",
        "'speaker_1': 'Our house guests. Her bold.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Lewis. Yes. Rallies. Spider. Wow. Yes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'So, aunt.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Council, President Gonzalez says.'",
        "'speaker_0': 'Eight in favor, nine opposed. Thank you, Madam Clerk. The motion carries and the amendment is adopted. Customer Louis, I will hand it back over to you to address the bill as amended before we hear other comments from your colleagues and is as is required by the rules, you will have the last word to close out debate.'",
        "'speaker_0': 'Once we've heard from others.'",
        "'speaker_3': 'Thank you very much, Madam President. And it is good to see that at 201 it was distributed to all council members. We did get the updated framework agreement between the executive and the providers to continue to go through and go forward on this conversation that has been convened to really make sure that we are working together as'",
        "'speaker_3': 'a council, a provider community and a mayor to start making material progress on getting outreach and services to folks who really, really need it right now, especially now that we are very clearly on the doorstep of winter. This framework and the conversation around it has been very productive for all of us to make sure that we are'",
        "'speaker_3': 'talking and working through ending 2020 with action and making sure that we are getting these resources out into the field to people who need them, resources around and around hygiene and behavioral, mental health and all the other things that are authorized in this bill and where there is an agreement and a framework to spend these resources and'",
        "'speaker_3': 'get them out to the folks that need them. But I want to be clear about what this legislation doesn't do. This legislation does not make any commitments in terms of what this city side of things on managing outreach is going to be for 2021.'",
        "'speaker_3': 'We have a variety of proposals that have come forward. The executive sat down a proposal for the team that they would like to have in a city similar to the proposal that is in this legislation to have a coordinating team that is not out in the field, to have a engagement policy that is centered on provider outreach'",
        "'speaker_3': 'for folks with expertize and connections in our community to be the the face and the implementers of our outreach policy and for the city to be in a coordinating and service providing role that is enhancing the mission of those providers.'",
        "'speaker_3': 'This is a is a good start to finish out 2020. It's good that we have been able to convene a conversation where we are moving closer to a consensus in this area. And we will continue to talk about what the model for 2021 is going to look like throughout the fall budget session.'",
        "'speaker_3': 'But we cannot wait any longer based on the the urgency and the need to really start deploying these resources. That is evident in all the districts of the city, that sense of urgency. So with that, I just want to say this isn't the end, this is the beginning.'",
        "'speaker_3': 'We have a long way to go still. But this is a good start where everybody has been working in good faith. I encourage everyone to read the framework that was distributed to everyone. I have. I have briefly glanced it, but definitely want to spend more time with that document.'",
        "'speaker_3': 'But this really does represent a material step forward on a new model of outreach that is no longer going to overemphasize the role of police, no longer going to overemphasize, or rather, I should say under emphasized the need for our service provider community to be the face of these efforts in all the neighborhoods that they serve.'",
        "'speaker_3': 'And with that, I would move that we or I look forward to further conversation, but we will certainly encourage and hope that we move forward with this today and that we continue to build on this in the 2021 budget and make sure that the resources we have appropriated in 2020 do get out there in the field, as'",
        "'speaker_3': 'is the expectation of the provider community in supporting this measure today.'",
        "'speaker_0': 'Thank you. Councilmember Lewis, are there any questions or comments on the bill from from my colleagues. Okay. Kids were silent. And then Casmir Morales.'",
        "'speaker_4': 'Others. I intend to vote no on this bill because what it actually does is shrink the scale of the proviso that was passed by the council to stop the encampment removals or as a homeless activist themselves have said stop the sweeps by almost a third shrinks the scale of the proviso by almost a third from $2.9 million'",
        "'speaker_4': 'to $2 million. This proviso basically said that the mayor could only use the funds allocated to the so called navigation team, which does the sweeps of homeless people, that it could only use those funds to do genuine outreach of homeless services instead.'",
        "'speaker_4': 'Councilmember Lewis says that everybody has been working on good faith and I think that's true of the. Workers at REACH and the employees of the Human Services Department. But I don't believe that that's true of the mayor's office, which actually has been an obstacle to getting any kind of change away from a removals of homeless encampments and'",
        "'speaker_4': 'homeless human human beings. Everything else that has been discussed as part of this bill, such as those shared principles and agreed framework of the service providers. All of which, of course, is moving in a good direction. Could have happened anyway and do not actually require this legislation.'",
        "'speaker_4': 'This legislation is precisely for shrinking the scale of the proposal. So what the Council is really voting on now is whether or not to shrink the 2020 job, the sweeps ratio from $2.9 billion to $2 million. And the only reason that's being discussed is because Melder can refuse to follow the proviso since it was passed by the'",
        "'speaker_4': 'city council in August. In fact, as of last Friday, my office checked with city council staff and it's still not being acted on. The proviso has not been acted on. It's true that because the mayor vetoed the budget, it did not legally take effect until last Thursday.'",
        "'speaker_4': 'But there was nothing stopping the mayor from voluntarily following the proviso earlier. So I don't I don't actually take these claims about a sense of urgency, any serious you know, I don't take it at face value. The only reason Mayor Durkan chose not to follow the proviso was because she was confident the city council would give her'",
        "'speaker_4': 'retroactive permission to do so. And here is a bill to do just that. I will say also, I'm really taken aback that this retroactive permission has been considered before the mayor actually takes any material steps to follow the proviso in any way.'",
        "'speaker_4': 'I mean, where is the funding for the service providers to do homeless outreach? Perhaps it would be different if it were December and the mayor had beautiful have dutifully followed the legal requirements of the proviso for two months and was then after that asking for retroactive permission for her slow start.'",
        "'speaker_4': 'But this bill gives her permission for being laid before she even begins. So what's to prevent her from delaying another couple of months and then bringing another bill retroactively giving permission for the next delay? I mean, we don't know that that's not going to happen.'",
        "'speaker_4': 'The sweeps of homeless encampments are cruel, inhumane and ineffective. People are removed again and again and again, sometimes from the same locations, because there's nowhere affordable to go. There are no alternatives. There have been well over a thousand sweeps and they're clearly not working.'",
        "'speaker_4': 'And they are wasting millions of dollars, forcing people to move, losing their belongings and becoming more and more desperate after one traumatic event after another. The mayor should have stopped, start sweeping people years ago, and it's not possible for my office to support a bill to retroactively give her permission for delaying even after a stop.'",
        "'speaker_4': 'The proviso has been that. So I'll be voting. No, thank you.'",
        "'speaker_0': 'You council members want Councilmember Morales.'",
        "'speaker_1': 'Thank you. I do have a couple of questions for the sponsor before I move on. Councilmember Lewis, can you talk a little bit about how Tim described in your memo, in your amendment sorry, is materially different from the HST team that the executive has proposed for 2021 on the 2021 budget.'",
        "'speaker_3': 'Yes, I can answer that question. This proviso change is not prescriptive in terms of the division of labor as to what these eight years can and can't do. It represents a four employee reduction from the number of HST employees who are on the old navigation team.'",
        "'speaker_3': 'So it's a smaller team. The team that we got a presentation about three weeks ago is also eight after years. So it would they could use those eight years in any way they see fit. That is consistent with the conditions of the proviso which explicitly says that they cannot be doing direct outreach.'",
        "'speaker_3': 'So they can essentially be doing things other than direct outreach, like coordinating with providers and coordinating with city departments to provide assistance to the mission of the providers. And it's it's important to note that that $245,000, which is the only amount of money that's released, so only quite a little less than a quarter million dollars is released'",
        "'speaker_3': 'for the last two months of this year for that HST team that expires at the end of the year. And it does not guarantee that HST will have those eight years any longer than December 31st. That would depend on what our conversations are this fall in terms of what we want, the long term team, whatever it is'",
        "'speaker_3': 'to to look like beyond that. And that is something I would add that the ongoing work that the mayor's office and the provider community are doing to go back and forth on this is also heavily discussing, you know, what will be the makeup of the team and what will their roles be.'",
        "'speaker_3': 'And, you know.'",
        "'speaker_1': 'So can I just. Sorry. I guess what I'm trying to understand and maybe this is a question for Jeff is is Jeff Jeff on Councilman Morales?'",
        "'speaker_0': 'Jeff was available this morning at council briefing. That was the time to ask questions of council central staff.'",
        "'speaker_1': 'So so I just want to be clear that I understand the 2021 proposal calls for eight team members. And as I understand it, the roles are team manager, outreach manager, communications manager, field coordinator, data analyst, department coordinator and two systems navigators.'",
        "'speaker_1': 'Right.'",
        "'speaker_3': 'That's my memory from the presentation and from reviewing the slides. So those.'",
        "'speaker_1': 'Are right. So those are all roles that existed on the previous team and are continuing. So I guess what I'm trying to understand is that aside from the the intent to shift, you know, coordinate outreach work, we know how this team would be different from the navigation team.'",
        "'speaker_3': 'Right. So, I mean, unlike the old navigation team, there are privies or sideboards in the proviso that limit what they can be doing. And I mean, that was important to the provider community since they don't want a team that's going to be out there competing with on the ground outreach efforts with a monopoly of resources that other'",
        "'speaker_3': 'providers don't have access to. And that is something that under this if if the the team were to have that mission, they would not be able to access this money or those fees. So, you know, I mean, that is a material difference.'",
        "'speaker_3': 'We will no longer have city employees be agents of outrage and certainly won't have police be integrated as part of that team. That proviso remains fully enshrined in the 2020 package.'",
        "'speaker_1': 'So it's again, I'm sorry, I'll just one more point, I guess, and I'll I'll wrap up. I just feel like this proposal amends the proviso that we passed this summer by shifting port 9 million away from the navigation team to service providers was the proposal.'",
        "'speaker_1': 'You didn't support. And I understand. But what I don't see is how this amendment itself does anything more than bring just these 2021 proposed navigation team online two months earlier than proposed. And what's frustrating for me and disheartening is that this legislative body voted to pass a budget, unequivocally stated our intent to shift away from a navigation'",
        "'speaker_1': 'time model and provide more resources to providers. We voted not once, but twice. So I want to thank the service providers who I know have been having long and frequent conversations with the executive branch. They've really been at the table to hammer out a deal for these dollars to finally get out the door.'",
        "'speaker_1': 'I want to thank the providers for working on this framework, which is wholly separate from this legislation. Excited to see that. And I and I know that those conversations do need to continue to make sure that the last unresolved issues are met.'",
        "'speaker_1': 'And my understanding is that there is a commitment to meet again with the executive, between the executive and providers in the next couple of days so that we can make sure these resources get put to their intended use.'",
        "'speaker_1': 'But I have to say that I believe this legislation, which in my mind disregards the incredible ongoing work that has led to this framework. Really, the only purpose of this is to bring back some version of the navigation team.'",
        "'speaker_1': 'I said, is also my understanding that a deal with the executive that would address some serious concerns that several providers have. That and a deal to address those issues is contingent on passing this amendment. So so I will be voting in favor of it solely to help make sure that those issues are addressed.'",
        "'speaker_1': 'Those concerns are addressed, and that deal can happen. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Morales, for those comments. Councilmember Herbold, please. Thank you so much. I really appreciate the work that's been done thus far to get us to this this point.'",
        "'speaker_2': 'So.'",
        "'speaker_0': 'You know, first off, many thanks to the outreach providers who worked tirelessly over the last few weeks on coming to this agreement about a new framework for outreach and encampment management. I remember at the end of September, I think it was September 30th when we received a letter from Deputy Mayor six killer about the next steps after'",
        "'speaker_0': 'council action to override the mayor's veto on three three issues. One of those issues was the end of the navigation team. And in that letter, there was no description on how to activate the funds provided by the Council for Outreach.'",
        "'speaker_0': 'I immediately reached out to representatives from our provider community with the request that they mobilize to help build something new with the funds provided by the Council. I want to really just thank you for responding with urgency, and I appreciate the many, many hours that you have been spending working with the executive on on the on the'",
        "'speaker_0': 'framework. Recognize that the framework is a is a beginning place, not an end place. I want to thank also Councilmember Councilmember Lewis for leading the discussion and Deputy Mayor six Kilmer for being a willing partner in the discussions and really being open and operating and in a way that shows, I think, a lot of goodwill towards something'",
        "'speaker_0': 'that the council, the executive and the provider community can get behind together as a unified front. I understand that the framework that was shared with council members. Again, it's a new effort to do this work differently and for us all to work together to build this new approach in alignment.'",
        "'speaker_0': 'As I mentioned before, the framework itself isn't the end of the process. It's just the beginning. There is more work to be done to operationalize the framework over the next several weeks and to ensure that the new approach truly serves the needs of people living unsheltered, of groups, of people living in encampments, and of the housed, neighbors'",
        "'speaker_0': 'and neighboring businesses. This action will reinforce council efforts from September to make available funds to the executive so that outreach can continue in 2020. Again, it's a mark of good faith in which the conversations have proceeded. I think I just want to uplift one portion of the shared framework that I think is particularly important to highlight.'",
        "'speaker_0': 'It says the city concurs that removals will not be the first response and will collaborate with providers to address obstructions in behavior through thoughtful and respectful dialog and problem solving, engaging both unsheltered and housed residents. Addressing specific neighborhood needs and priorities.'",
        "'speaker_0': 'And you know. Neighborhood needs. Include everybody to be present in the neighborhood, from people living unsheltered to housed people and people who work or frequent parks or businesses there. And I think this new framework recognizes the value of everyone in in this necessary problem solving model.'",
        "'speaker_0': 'And really, that's that's what I see. I see this as a shift towards a problem solving model rather than a model that assumes that when outreach is sent out, the purpose of the outreach is to remove the encampment.'",
        "'speaker_0': 'The agreement also addresses the need to for the city to continue to commit significant resources not only to outreach, but to shelter, housing, trash removal, hygiene, health promotion and harm reduction, including sharps containers and health health outreach in coordination with public health.'",
        "'speaker_0': 'I'm really glad that this agreement has been reached in time for council to be able to consider what it might mean for the 2021 budget as well. And if we can accomplish this work today from a foundation of shared principles, I think this will help propel us for those ongoing discussions from this agreed upon Starting Point.'",
        "'speaker_0': 'I've been in ongoing conversations with outreach providers who are on the front lines of this work every day. I know they've indicated their support with the transmission of this new framework. I will be voting to approve this legislation and I'm also marking my commitment to continue to be in conversation with the executive and providers.'",
        "'speaker_0': 'And as Councilmember Lewis, I do know that you you referenced the receipt of the 201 new framework. Have we have we done what we need to do to include it as a supporting document in the official record? I think that would be a useful thing to do as well.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'And and councilmember horrible. That might be a question for the for the clerk on how we procedurally do that. But I would be more than I'd be totally supportive of that. Mr..'",
        "'speaker_0': 'Madam Clerk, I do think there was a question that was deferred by the bill's sponsor to you. I'm going to ask that Councilmember Herbold, repeat the question so that the clerk may have an opportunity to hear the full question and respond accordingly.'",
        "'speaker_0': 'You are on mute. We received at 201 an updated framework that the provider community has sent to us, and just wondering whether or not there's a way to include it as a supporting document in the official record. It doesn't necessarily need to be an amendment at this point.'",
        "'speaker_0': 'I think there is another discussion about memorializing this framework through a resolution. But if we could at least ensure that it is attached to the to the materials for for today's meeting. I think that would be really useful.'",
        "'speaker_0': 'Thank you for repeating that question, Councilmember Herbold. Yes. If the council would like to add the actual updated version of the framework to the record, I just we just need confirmation that all council members have received it via email and after the meeting we can add the updated version to the record as a supporting document.'",
        "'speaker_0': 'Thank you. Councilmember Lewis, can you confirm for the clerk that the updated framework you are referencing during this meeting has in fact been circulated to all council members?'",
        "'speaker_3': 'Yes, Madam President, I can confirm that the document titled Shared Principles and Agreed Framework for Response to People Living on Sheltered 2022 2021 was emailed by Alison Risinger to the entire council at 201 and I can I can see all of our emails keyed on it.'",
        "'speaker_3': 'And so can can confirm that even Councilmember Juarez, who is excused today, received it as well. So.'",
        "'speaker_0': 'Yes, thank you, Madam Kirk. Does that suffice for the confirmation that you need in order to attach this to the final record? Yes, this is the correct and this is information needed in order to add a supporting document.'",
        "'speaker_0': 'Thank you very much. Thank you so much. And Casmir Lewis, if someone in your office could be so kind as to forward that final document that was circulated to all council members at 2:01 p.m. to the clerk, that would be helpful to them in order to update the record accordingly.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson.'",
        "'speaker_3': 'Thank you. Council President. Thank you. Councilmember Lewis, as chair of our Homelessness Strategies and Investments Committee and Casper Herbold. I want to say it sounds like deputy mayor, six killer and those in HST Human Services Department were involved helping to craft this.'",
        "'speaker_3': 'So thanks to them. I am concerned about the the shrinking of the city government team that's been involved with this effort. Essentially, it's going from, I believe, 14 offices down to eight figures approximately. And many constituents have contacted our office to share their concerns about the rise of visible, unauthorized encampments.'",
        "'speaker_3': 'We know that the Centers for Disease Control guidelines regarding social distancing and spacing requirements in congregate shelter models presents a problem, and city has acted to stand up shelters and provide hygiene and outreach. But I believe we need to have that role, a strong role of coordinating from from the city government, city government leadership on coordinating the'",
        "'speaker_3': 'outreach efforts. And I know we voted unanimously to remove the police department as a standard part of the team. So I'm glad to see this incorporated continuing as part of this compromise. There are times when SPD will need to be involved.'",
        "'speaker_3': 'I know firefighters are going out to encampments when there are fire hazards. And and so those want to have the police department available just in case something were to arise there. So, again, my chief concern throughout this discussion has been making sure the city government has a strong coordination role.'",
        "'speaker_3': 'And because ultimately the city and the county governments are responsible for addressing the problems of public health and safety and addressing homelessness. I'm very much looking forward to the King County Regional Homelessness Authority taking shape so that we can coordinate our efforts regionally to tackle this regional problem.'",
        "'speaker_3': 'So even though I am concerned about the shrinking role of city government and I wish it were a larger role, I hope it can be we can value our city employees in the role and expertize that they bring to the table and see about expanding their role in the future.'",
        "'speaker_3': 'Today, I will support this compromise, however. Thank you.'",
        "'speaker_0': 'Thank you. Any other comments from my colleagues? Okay. Hearing and I'm sorry. Okay. Councilman Moscato, please. Thank you very much, council president. And thanks to the folks who spoke today, especially those who articulated the urgent need for us to get out the door right now.'",
        "'speaker_0': 'I mean, that's the reality of the situation we're in. The average dollars that we allocated were not given to community partners to help with outreach. And instead of helping folks out in the community, the messages we've been receiving are that council has not stepped in to provide an alternative to the navigation team, which is just not true'",
        "'speaker_0': '. So I really appreciate that this is what the providers want because right now they are seeing for a lack of those dollars being allocated to the community, people going without the outreach services that they need, connections to housing and essential support like trash cleanup and making sure that people get the assistance they need to have food and'",
        "'speaker_0': 'ideally referrals to the right place. So it's in the spirit that many council members have already brought up about needing to just get the money out the door and wanting to see the good work of those community partners get funded.'",
        "'speaker_0': 'That I'll be looking forward to voting for this and recognizing that this is very much still in alignment with what the principles were from our earlier actions in making sure that homelessness outreach is not being led or done in conjunction with those who are sworn officers, and that there's the appropriate role for our excellent city team to'",
        "'speaker_0': 'be coordinating behind the scenes to make sure that people get the referrals that they need and into hopefully case management. And that's that's that's an important role for our city to continue to do, but making sure that the community partners with the trusted relationships are out there doing the hard work.'",
        "'speaker_0': 'So thanks to them for sending in the framework and to all of us, I think this is a good indication of how we can continue to make sure that those trusted partners are getting the dollars. And that's that's really the most important thing right now as folks deal with COVID and and the now, what, five year crisis'",
        "'speaker_0': 'of housing and homelessness affordability issues. So with that, I'll be voting yes, Councilperson. Thank you. Councilmember Mosqueda, any other comments? I'm going to ask Martin Lewis to close out debate with any final comments and then we will take up the bill.'",
        "'speaker_3': 'Thank you, Madam President. I'll be I'll be brief. You know, I. Understand we're folks who have some skepticism about this legislation are coming from based on the history of the old navigation team and a lot of the issues we've seen over the last three years around collaboration between the city and the provider community, which I think we'",
        "'speaker_3': 'can all agree has has not in and of itself been able to solve our homelessness crisis. And we see every day thousands of our neighbors living without basic necessities, without basic hygiene facilities, and without as as Councilmember Strauss often says, for walls and a door that locks.'",
        "'speaker_3': 'And this bill is not going to solve all of that immediately, but it is a step in the right direction to start this collaborative process of working through this with all of the principal operators in this area. I would note that while we are revising the proviso from the summer, only $245,000 is going back to the Human'",
        "'speaker_3': 'Services Department, $245,000 for the last two months of the year, and over $2 million is going to be released to our service providers. Also, based on revisions of what that money can be going to, based on collaboration and conversation with providers, on what they really need, based on what they're experiencing right now out in the field.'",
        "'speaker_3': 'And that includes more money for behavioral mental health services, flexible financial assistance, case management to expand existing case management contracts, housing navigation, as well as technology needs for service providers to enhance their mission in the field. So while we still have a lot of work to do in this, this one thing is not going to solve all'",
        "'speaker_3': 'of it. This is a really important step forward in continuing to come together to to really bring action and respond to what we are seeing in the city. There were folks in public comment who were stating their frustration about the city having been bogged down in really important disagreements about the future direction of what our homelessness response'",
        "'speaker_3': 'is going to look like. And this is the first step to all of us realizing our common interest in this and moving forward in a way that can hopefully finally bridge the divide and get people that the really critical resources that they need and that this council has appropriated money to address.'",
        "'speaker_3': 'So with that, Madam President, I look forward to the vote and look forward to the next steps in working through this policy area through the 2021 budget process.'",
        "'speaker_0': 'Thank you, Councilmember Lewis, for those closing remarks about this council bill. I want to thank everybody else on the council who also made comments about the bill and look forward to supporting supporting this effort and the long term ongoing efforts that are going to be necessary to really make a difference in this area.'",
        "'speaker_0': 'Okay. Well, the clerk please call the role on the passage of the bill as amended.'",
        "'speaker_1': 'Else. Yes, for both.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Where else? As.'",
        "'speaker_0': 'ROSQUETA Yes.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Sergeant. No. Council. President Gonzalez?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Seven in favor, one opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes as amended and the chair will sign it. Will the first please affix my signature to the legislation on my behalf? Okay. Other business. Is there any other further business to come before the council?'",
        "'speaker_0': 'Hey, no other business colleagues. This does conclude items of business on today's agenda. Our next regularly scheduled city council meeting is on Monday, November 2nd, 2020 at 2:00 PM. That is it for today. I hope you all have a wonderful afternoon.'",
        "'speaker_0': 'We're adjourned.'"
    ]
}