{
    "Rezone Application for 14302 Development, LLC, and the Seattle Housing Authority.": [
        "'speaker_3': 'And I don't want to call 314367. The application of 4130 to Development LLC and the Seattle Housing Authority to rezone portions of the lot located at 14302 30th Avenue Northeast and portions of the lot located at 14330 30th Avenue Northeast from single family, 7200 square feet to low rise three with a mandatory housing affordability two suffix project'",
        "'speaker_3': 'number 3023581 Type four.'",
        "'speaker_0': 'Thank you so much. I got to hand it over to Councilmember Strauss, who is the chair of the committee responsible for this item to provide us the report.'",
        "'speaker_2': 'I thank you, Council president, colleagues. This clerk files a contract rezoning application to rezone the property at 1430 to 30th Avenue Northeast and a portion of the adjacent property at 14330 30th Avenue Northeast from single family zoned 7202 low rise three.'",
        "'speaker_2': 'Both properties are currently split zone between S.F. 7 to 7200 and low rise three and the lot at 43 zero 2/30 Avenue Northeast. The applicant plans to develop four townhomes for a total of 21 units. The lot at 41330 30 if avenue northeast is owned by Sale Housing Authority and has no plans for redevelopment but is being'",
        "'speaker_2': 'included in the recent application to avoid a narrow strip of single family zoning remaining on a block, otherwise zoned for low rise land use and neighborhoods. Committee unanimously approved this application with two changes made in committee. The First Amendment increased the mandatory housing affordability requirements to the full development on these sites.'",
        "'speaker_2': 'Both the STSCI and hearing examiner recommendations included an m suffix to note denoting the low lowest level of affordable housing requirement. Thanks to list with some of central staff, the committee recognized that the higher M2 suffix should have been applied.'",
        "'speaker_2': 'This change increases the image a requirement from 7% or $7 per square foot to 9% or $12.50 per square foot. Contract reasons are typically conditioned on future development, conforming to the development proposal submitted at the time of the recent application.'",
        "'speaker_2': 'Because the Seattle Housing Authority has no plans to redevelop. The committee also removed that condition from a portion of the reason. Both the director and hearing examiner issued recommendations for this for the approval of this rezoning application, and that is the committee report.'",
        "'speaker_2': 'Council President, thank you very much.'",
        "'speaker_3': 'Thank you so much.'",
        "'speaker_0': 'Councilmember Strauss, are there any additional comments on agenda item one? Hearing no additional comments and no hands raised will call the roll on granting as conditions. The quick file.'",
        "'speaker_1': 'It is then.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So want. Yes. Strauss. Yes. HERBOLD Yes.'",
        "'speaker_2': 'LEWIS Yes.'",
        "'speaker_1': 'MORALES Yes, that's correct. I council President Gonzalez I Adan favor and opposed.'",
        "'speaker_0': 'The court filings granted as condition and the chair will sign the findings, conclusions and decision of the City Council. Will the verdict please affix my signature to the findings, conclusions and decision of the City Council on my behalf?'",
        "'speaker_0': 'Will the clerk please read Agenda Item two into the record? And Madam Clerk, I think your muted. Inc you.'"
    ],
    "Rezone of Lots at 14302 and 14330 30th Avenue NE and Property Use and Development Agreements.": [
        "'speaker_3': 'Report of City Council Agenda Item two Council Bill 120216 An Ordinance relating to land use and Zoning Amending Chapter 23.32 of the Seattle Municipal Code at page eight of the official land use map tourism portions of the lot located at 14302 30th Avenue Northeast and portions of the lot located at 14330 30th Avenue Northeast and accepting property'",
        "'speaker_3': 'use and development agreements as a condition of recent.'",
        "'speaker_1': 'Approval.'",
        "'speaker_0': 'Thank you so much. Colleagues, I move to pass Council Bill 120216. Is there a second second? Thank you so much. It's been moved and seconded to pass the bill and to hand back over to Councilmember Strauss to provide the report on this as the sponsor of the bill.'",
        "'speaker_2': 'Thank you. Council President. This is the Associate Council bill for the for the contract free zone just mentioned on the item previous to this. The clerk file contained the rezoning application is council bill effectuate the zone and accepts the property use and development agreements and changes the zoning map itself.'",
        "'speaker_2': 'That's the final word on this bill. Thank you.'",
        "'speaker_0': 'Short and sweet. Thank you so much. Customer stress there? Any additional comments? Not seen any hands raised. Will the Court please call the role on the passage of the bill?'",
        "'speaker_1': 'Paterson I so want. Yes. Strauss Yes. Herbold Yes.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales That was correct. I counsel President Gonzales. I aid in favor and oppose.'",
        "'speaker_0': 'The bill passes and the child will sign it. Will the court please affect my signature to the legislation on my behalf? Will the clerk please read Agenda Item three into the record?'"
    ],
    "Vacation of Alley in Block 14, Jos C. Kinnears Addition.": [
        "'speaker_3': 'Agenda item three File 314459. Petition of Grand Street Commons LLC for the vacation of the Ali in BLOCK 14 Jesse Kinnear's addition to the City of Seattle being the block bounded by South Grand Street, 22nd Avenue, South South Holgate Street and 23rd Avenue South.'",
        "'speaker_0': 'Thanks so much. I moved to Grant Clark file 31445, nine. Is there a second?'",
        "'speaker_2': 'Second?'",
        "'speaker_0': 'It's been we've been second to Grant Clark file 314459. I Kazmir Peterson. I understand that you have an amendment to make and I'm going to hand it over to you to make that motion.'",
        "'speaker_2': 'Thank you. Council President colleagues, this is just a traditional extra step involved with accepting the conditions to the Clark File. These are the same conditions that we discussed on November eight, and we're attached to the central staff memo.'",
        "'speaker_2': 'So I'll make the motion to amend the Clark file to accept the conditions. I move to amend Clark's file 314459 by adding the counsel conditions to the Clark file.'",
        "'speaker_0': 'It's been moved and seconded to amend the court file by adding the counsel conditions. The Hand of Equity Council member Peterson to address the amendment.'",
        "'speaker_2': 'Thank you, counsel. President, colleagues, this clerk filed 314459 enables us to approve an allocation for the mixed use mixed income transit oriented development called Grand Street Commons, located in District three near the boundary with District two. A few months ago, the Transportation and Utilities Committee received a briefing on this project from START Seattle Design Commission and the'",
        "'speaker_2': 'Sleepers last week on November eight. The full council had a similar briefing in the morning and we held the required public hearing in that same afternoon. So today is the actual vote to approve it. I support the approval of this vacation.'",
        "'speaker_2': 'Nearly half of the new residential units will be affordable to low income families. The project is 11 blocks north of the existing Mount Baker light rail station and only four blocks south of the future Judkins Park Light Rail Station, scheduled to open as early as 2023.'",
        "'speaker_2': 'And again, the conditions are the same conditions attached to the central staff memo from November eight. There are two amendments for this proposed allocation.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Okay. So. Okay. Sorry. This is a little confusing. This little procedural dance we're doing is is going to be a little confusing. So give me just a minute to get oriented here. So we moved to grant the clerk while there's been a second consumer, Peterson made an amendment to that.'",
        "'speaker_0': 'And now I understand that rather than pulling that amendment to a vote, there are two amendments to the amendment. Is that is that correct?'",
        "'speaker_2': 'Yes. There are two amendments. Yes, there are two amendments to them. That is correct. And the first one, I think, Councilor Mosquito will be addressing.'",
        "'speaker_0': 'Right. And the second is yours. Madam Clerk, can you please clarify for me if I need a call for a vote on the underlying amendment? That information is not included in my script, but it seems like we have to it.'",
        "'speaker_0': 'Eventually.'",
        "'speaker_3': 'President Council President Gonzalez I believe we should take the amendments first. And after we vote on the amendments, then we will vote on adding the conditions as amended.'",
        "'speaker_0': 'Got it. All right. Just making sure I wasn't accidentally missing a step. So appreciate that, Madam Park. Really appreciate it. Okay. So I am going to go ahead and recognize Councilman Mesquita, who has Amendment One and councilmember skater, if you can make your motion and after it gets a second, we can have a you can address the'",
        "'speaker_0': 'amendment.'",
        "'speaker_3': 'Thank you very much, Madam President. Colleagues, I move to amend the conditions as presented on Amendment one on the agenda.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'It's been moved and seconded to amend the conditions as presented on Amendment one. Hillsborough Mosquito handed back over to you to address Amendment One.'",
        "'speaker_3': 'Thank you very much, Madam President. I thank you as well, Councilmember Peterson, for your joint work on this effort. Colleagues, I'm excited to bring forward this amendment that I am sponsoring today to this vacation that would waive the strict vacation fee for the Grant Street Commons affordable housing project, Amendment One to this individual street.'",
        "'speaker_3': 'I meant a street vacation is a precursor to legislation that my office has been working on with Lesch Watson from Central Staff. That legislation is on the introduction referral calendar as well for consideration after budget deliberations. The legislation that we are interested in bringing forward in the future would follow a similar model that we are providing for'",
        "'speaker_3': 'and the amendment today that adds an exemption for city funded affordable housing projects. I'm excited about the broader conversations that will happen in my committee in December, along with joint discussions in Councilmember Peterson's committee as it relates to transportation.'",
        "'speaker_3': 'The amendment that we are bringing forward today is in the similar vein. We are seeking to remove internal barriers to building affordable housing and allows and allow us to save precious affordable housing resources that could be used for building more homes.'",
        "'speaker_3': 'This amendment aligns with legislation that we also passed in 2008 to encourage the city to prioritize city owned properties, city owned surplus property, and use it for the public good. That like building affordable housing today through this amendment is specific to this property.'",
        "'speaker_3': 'I'm excited to be able to help remove the fees associated for areas that the city has right away. When we can help to create an opportunity to build affordable housing, which is all of our goals, creating more housing throughout the city and making sure that we're moving any and all barriers.'",
        "'speaker_3': 'I also believe that it's more efficient to remove the unnecessary administrative processes associated with transferring city funds right back to the city. City, state and federal agencies have already exempt from the requirements to compensate the city for the property value of city vacation.'",
        "'speaker_3': 'And as the Council, we have the authority to waive these fees for other appropriate projects under our current code. City funded affordable housing projects are required to pay. Street education fees are limited, public housing dollars are going right back to the city to pay those fees instead of affordable housing.'",
        "'speaker_3': 'I'm excited about this amendment in front of us making sure public housing dollars are able to be used to build housing. Now, this issue was brought to our attention by Pastor Willie Seales. I want to thank Pastor Seales, who's been working with Lee High on redevelopment for the Spirit and Affordable Housing Project on church on property in'",
        "'speaker_3': 'the Central District. The T.C. Spirit project requires street vacation, which would typically cost the appraised value of the site. Without street vacation, the T.C. Spirit Project would create 45 affordable units. With the street vacation, they will be able to build 68 affordable units.'",
        "'speaker_3': 'However, the street vacation with the Grant Street Commons project under a current code is expected to cost hundreds of thousands of housing dollars. Exempting affordable housing projects from these fees would reduce costs and barriers to affordable housing projects that are creating more homes for community and activating the public realm with art activity and pedestrian oriented uses.'",
        "'speaker_3': 'As displayed in the briefing last week, which I'm very excited about legislation making permanent exemption for city funded affordable housing projects. Again, on today's introduction and referral calendar and I very much look forward to working with all of you cast member Peterson in his committee and in my committee in the next few weeks after budget to really'",
        "'speaker_3': 'move forward on this concept that we're introducing here today via the amendment to this specific legislation. Thanks so much for your consideration, colleagues, and your ongoing partnership to build affordable housing as best as we can.'",
        "'speaker_0': 'Thank you. Councilmember Mosqueda, are there any additional comments on Amendment One? I see no additional hands raised while the court fees played a role on the adoption of Amendment One to the conditions.'",
        "'speaker_1': 'Peterson Yes. Student Yes.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'For bold. Lewis Yes. Morales Yes. I council. President Gonzalez I vote in favor and then oppose.'",
        "'speaker_0': 'The motion carries. Amendment one is adopted and the amended conditions are before the council. I'm going to hand it back over to Councilmember Peterson, who has a motion to make an amendment to.'",
        "'speaker_2': 'As a council president, I move to amend the conditions as presented on Amendment two on the agenda.'",
        "'speaker_0': 'Second, he's been moved and seconded to amend the conditions as presented on Amendment two. I'll hand it back over to Councilmember Peterson to address the amendment.'",
        "'speaker_2': 'Thank you, Council President colleagues. As I mentioned during council briefing this morning, amendment number two was requested last week by the nonprofit Mt. Baker Housing Association. And I support this amendment as well as described well by central staff at the bottom of this amendment that we published on line condition of vacating the alley to facilitate the development'",
        "'speaker_2': 'of this affordable housing project was to provide 1500 square feet of space free to the cultural space agency for cultural activities. The proposed conditions imply that the space would be a condominium. However, Mount Baker Housing and the Cultural Space Agency are discussing the best way to transfer that space and so discussing that.'",
        "'speaker_2': 'So in addition to creating a condominium as a possibility, they're also exploring using a structure like a 99 year lease that would ensure the space is available for the life of the building. So Mount Baker Housing, the nonprofit, asked for this amendment to provide flexibility to them to create the most appropriate structure.'",
        "'speaker_2': 'So that's the purpose of this amendment to the conditions. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Peterson, are there any additional comments or questions on Amendment two? So, you know, hands raised will look great. Please call the role on the adoption of Amendment two to the conditions.'",
        "'speaker_1': 'PETERSON Yes, Sergeant. Yes. Strauss Yes. HERBOLD Yes. LEWIS Yes. MORALES Yes. I was going to.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Council President Gonzales. I Adan in favor and oppose.'",
        "'speaker_0': 'The motion carries an amendment to is adopted. Are there any additional comments on the amended conditions. Seeing no hands raised. Please call the role on the adoption of the amended conditions for inclusion in the corporal.'",
        "'speaker_1': 'Your son? Yes. Silent. Yes. Strauss Yes. Herbold Yes. Lewis Yes. Morales As for Skinner, I council President Gonzalez, I aid in favor and oppose.'",
        "'speaker_0': 'The motion carries and the amended conditions are included in the amended FERC file. Are there any further comments on granting as condition the amended file? Consumer data, please.'",
        "'speaker_3': 'I just want to say thank you again. This is exciting. I know that we often don't do policy conversations during budget and this is directly related to items that are very appropriate to go to a full council because we didn't get a chance to talk about it in council.'",
        "'speaker_3': 'I just want to say thank you to our central staff, which was then again Councilmember Paterson's office and art house in my office for the work on this and future work to come. In all three partners.'",
        "'speaker_0': 'Any any additional comments? Hearing them. Will the court roll on granting as condition the amended profile?'",
        "'speaker_1': 'Peterson. Yes. So. Yes. Strauss. Yes. Herbold. Lewis. Yes. Morales. That's. Mosquito. I. Council President Gonzales was eight eight in favor and opposed.'",
        "'speaker_0': 'The motion carries the amended quick file is granted as condition and the chair will sign the counsel conditions will fix my signature to the council conditions on my behalf. Will the Court please read Agenda Item four into the record?'"
    ],
    "Easement Agreement and Related Actions for Sand Point Cottages Development.": [
        "'speaker_3': 'And the item for Council Bill 120218 an ordinance relating to property at some point authorizing the Director of Housing to execute an easement agreement for a sanitary sewer main line with the University of Washington. Authorizing related agreements and actions to support the development of cottages for people experiencing homelessness on a parcel owned by the city and leased'",
        "'speaker_3': 'to SB Cottages LLC. And ratifying and confirming certain prior acts.'",
        "'speaker_0': 'Thank you so much. I moved the past council bill 120218. Is there a second second? Thank you so much. It's been moved and seconded to pass the bill. I'm going to hand it over to Councilor Mosquito, who is the prime sponsor of this bill in order to address the item.'",
        "'speaker_3': 'Thank you very much, Council President. Although this legislation is very technical, I am still excited. This legislation helps us advance a long anticipated project like Cottages for People Experiencing Homelessness. By way of background, in 2019, the Council approved legislation to lease city owned property on the former Sandpoint Naval Station site to Lehigh.'",
        "'speaker_3': 'That's the low income Housing Institute for creation of 20 to 25 units to serve individuals from families making 40% of the area median income. The project will serve homeless families who are children, seniors, veterans, people with physical disabilities, their community members.'",
        "'speaker_3': 'And we're really excited about the cottage vision that has been drawn up for this location and the way in which it integrates directly into community and creates thriving, local, connected neighbors. The cottages will have living and sleeping areas lofts and kitchens and bathrooms on site.'",
        "'speaker_3': 'The community will include common buildings, community gardens, outdoor recreation space and walking paths. Construction on the cottage is currently underway. There are being built modular through modules. I can't say that word around offsite by students in pre apprenticeship programs and using vocational training programs.'",
        "'speaker_3': 'These modules will be assembled onsite by a general contractor. We anticipate groundbreaking will occur January 2020, with tentative opening in September or October of 2022. This legislation helps move the project forward by enabling the Office of Housing to enter into an easement agreement with Connect with the connected University of Washington's adjacent sewer line.'",
        "'speaker_3': 'Thank you to Councilmember Peterson for your interest in this legislation as well, and happy to have you as a co-sponsor on this. I want to thank Representative Frank Chopp for all of the work that he has done specific in this area and helping to bring this vision to reality.'",
        "'speaker_3': 'I look forward to working with all of you over the next few years to do more of more projects like this, and specifically in bringing this project to life later next year. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman. Mosqueda, are there any additional comments? Councilmember Peterson. Go ahead.'",
        "'speaker_2': 'Thank you. Council President Thank you, Councilmember Skinner, for taking the lead on this. And I want to thank University Washington as well as Lehigh. And and like you said, Representative Frank Chopp, this project follows in the footsteps of other long term housing projects.'",
        "'speaker_2': 'And in District four, such as Gossett Place and Marion West and our court and the solid ground housing already at Magnuson Park and Mercy Magnuson housing there as well. This project is on the western edge of Magnuson Park and then of course the Cedar Crossing projects, which is under construction right now on top of Roosevelt Light Rail'",
        "'speaker_2': 'Station. So proud to be supportive of this low income housing infrastructure. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilman Peterson. Are there any other comments on the bill? Seeing no additional hands raised will occur. Please call the will on the passage of the bill.'",
        "'speaker_1': 'Paterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sergeant. Yes. Strauss. Yes. Herbold. Yes.'",
        "'speaker_2': 'LEWIS Yes.'",
        "'speaker_1': 'Morales Yes.'",
        "'speaker_4': 'Skinner I.'",
        "'speaker_1': 'Council. President Gonzalez I am in favor and oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Other business. Is there any further business to come before the Council? I'm not seeing any hands raised.'",
        "'speaker_0': 'So Collins is just going through the items of business. On today's agenda, our next regularly scheduled city council meeting is on November 22nd, 2021, at 2:00 pm, the very same day we are slated to vote. Take the final votes on our budget.'",
        "'speaker_0': 'So I hope that you all have a wonderful afternoon. I will see many of you later on this week, but for now we are adjourned. Thanks, everyone.'"
    ]
}