{
    "Ordinance to amend the City of Seattle's Paid Family Care Leave program.": [
        "'speaker_2': 'The Report of the Gender Equity Safe Communities, New Americans and Education Committee. Agenda Item one Council Vote 119 513 Relating to the City of Seattle's Paid Family Care Relief Program, amending sections 4.20 9.0, 10.3 20.0 39.07. A code the committee recommends about pass as amended.'",
        "'speaker_0': 'Catherine Gonzalez.'",
        "'speaker_2': 'Thank you. Council President Harrell colleagues Rachel and Erin Elder and members of the public. It is with both a heavy heart and immense joy that I advance council bill 119513 as amended in committee, otherwise known as BS law for a vote by the full council today.'",
        "'speaker_2': 'If approved, this bill will correct a gap and oversight in our existing paid family care program applicable to municipal employees and their families like the Elders. It will do so by doing the following. First, it defines qualifying death to include the death of a child or the death of a domestic partner or spouse who died from childbirth'",
        "'speaker_2': 'or from complications related to childbirth. Second, if there is a qualifying death, then it will allow a parent or surviving domestic partner or spouse the ability to access paid family care leave benefit of up to four weeks without drawing down vacation or sick leave within 12 months of that qualifying event, the City Budget Office has estimated that'",
        "'speaker_2': 'this policy change does not have a significant fiscal impact and can be implemented without additional budget appropriation by the City Council. As I mentioned during council briefing, this is not a legislative fix to a hypothetical scenario. We have had multiple occasions to discuss the specific circumstances of Rachel and Aaron's loss of their daughter, Beatrice.'",
        "'speaker_2': 'A short 36, 36 hours after her arrival into this world, we have seen the pictures of be we've heard the heartwarming stories of the profound love that Bea gave her moms in that short window of life. We are now bearing witness to a legacy that will leave an indelible mark on our cities family friendly work policies.'",
        "'speaker_2': 'I am honored to play a very small role in advancing that legacy today. Rachel and Erin had many choices in the aftermath of the loss of BEA and learning that our family leave policies were inadequate for the needs of their family.'",
        "'speaker_2': 'They chose to effectuate change, to effectuate change by contacting their union protection and sharing their grief as an example and catalyst for change, for positive change, for themselves and for future families. As a result, today, we take a final vote on this legislation that more fully recognizes the realities of the sudden loss of a child.'",
        "'speaker_2': 'Our city employees should be able to focus on healing with their with their families in these moments. And Bea's law will provide qualifying employees with four paid weeks to do so. We know that the healing of losing someone, especially a young child, will take a lot longer than four weeks.'",
        "'speaker_2': 'But four paid weeks is certainly more than the three days that you all had to come together and to mourn and to be prepared for what the future would bring. I want to thank Councilwoman Mosqueda for her partnership on advancing this law and the sale Perich and her office for her tremendous and tireless commitment to finding a'",
        "'speaker_2': 'solution for the alders and all of our city workers. And of course, one last thank you publicly to Rachel and Erin for your courage and commitment to sharing your moment of personal grief to effectuate change in the name of BEA.'",
        "'speaker_2': 'And with that, the committee recommends that the full council adopt Council Bill 119513, otherwise known forevermore as BS law.'",
        "'speaker_0': 'Thank you, Katherine Gonzales. Any comments or questions, Councilmember Mesquita.'",
        "'speaker_2': 'Thank you, Mr. President. I'm incredibly proud to be the co-sponsor of these law. As you heard, these laws, a policy that will provide time off for city employees, for the loss of a child and the emotional and physical recovery for families going through the loss of their child or the loss of a birthing partner.'",
        "'speaker_2': 'And this is just the beginning. I want to thank Rachel and Erin, thank you again for your advocacy for being here yet again to see this policy now put into statute without you sharing your story time and time again over the last year and a half, without your persistence to make sure that no family has to go'",
        "'speaker_2': 'through what you did. We would not be here, and many other families would be suffering the same loss and the same heartbreak. But this policy now makes the changes that you've been asking for for a very long time.'",
        "'speaker_2': 'It provides time off. If you lose your child for the emotional and physical recovery that you and your family have gone through. We want to make sure that that unimaginable pain is not felt by another family making the impossible decision of having to go back to work so that you can earn a living when you're trying to'",
        "'speaker_2': 'grieve and recover. We want to make sure as an employer that we make sure that those who work for the city are able to come back to work when they are ready, and that the time that they have is paid time off so that they can grieve and recover.'",
        "'speaker_2': 'This is the right thing to do. I want to thank Councilmember Gonzalez for her leadership on this, for her office. And thank you for recognizing, as well as Patrick, our chief of staff, who has been engaged with this with you on this issue.'",
        "'speaker_2': 'I'm very excited to see this move forward. Councilmember Gonzalez outlined the comprehensive components in this law. But I think I just want to underscore three of the critical policies that you all helped to make sure that we changed in the policy as it came down.'",
        "'speaker_2': 'One is you are no longer required to draw down your existing sick time or vacation time. I hate the concept that people would have to draw down leave that we have fought so hard for. Leave that's important for sick time.'",
        "'speaker_2': 'Leave that's important for rest and recovery for vacation. We have these vacation and leave time policies for sick leave for important reasons. And the loss of a child is no vacation. You should not have to use that time at this critical moment, and we've changed it so that there's no draw down policy.'",
        "'speaker_2': 'We've also made sure that you don't have to use this leave concurrently with family medical leave in the event of a qualifying death. This is really incredibly important to keep that policy separate and to create its own bucket.'",
        "'speaker_2': 'And then lastly, as you've heard, we have really made sure that the qualifying death is a definition that includes the death of a child, spouse or domestic partner as a result of childbirth. And I want to thank you for your willingness to include that component in here, as well as we think about how families may grieve during'",
        "'speaker_2': 'this moment, especially around the birth of a child, and to make sure that bereavement leave is kind of more conceptually applied to who that might apply to, and critically that we've used terms like birthing partner so that we're inclusive of all families.'",
        "'speaker_2': 'So thank you for your leadership on this. Thank you for your openness to some of these changes that we were suggesting. And thank you for helping us to really underscore that our existing bereavement policy is unacceptable. One day, as you had with BE, is not a significant amount of leave.'",
        "'speaker_2': 'So we will continue to work here at the city to make sure that our bereavement policies as a whole better reflect what families actually need. As that, as I said earlier, we believe this is just the beginning of having the opportunity to address our bereavement leave policies as a whole.'",
        "'speaker_2': 'So incredibly proud to have worked with you, with Councilmember Gonzales, and with the mayor's office to change our family medical leave policies, to address this critical gap as it applies to families that are needing time off to be with their child, to be with their partners, or to grieve the loss of their child.'",
        "'speaker_2': 'I just want to say thank you again for helping to illuminate the short but incredibly impactful life that has had to sparking this policy change to ensuring no other family has to suffer the same experience. And they're making sure that we lifted up the voice of not only B and you as their parents, but to making sure'",
        "'speaker_2': 'that there's lasting change. So much more to do. And thanks to Aaron and Rachel, these brave parents for helping to set this past path for comprehensive policy change. Happy birthday again.'",
        "'speaker_0': 'Thank you. Catherine ROSQUETA. Okay. Any last comments? Are we ready to vote? Thank you very much for those fine presentations from Castro and Gonzalez and council members. Get it? Okay, please call the roll on the passage of the Bill.'",
        "'speaker_1': 'Musgrave I O'Brien High Pacheco. I so want I Bexar Gonzalez I.'",
        "'speaker_4': 'Herbold, I.'",
        "'speaker_1': 'Suarez President Harrell High nine in favor and unopposed.'"
    ],
    "Correction of Map Errors for Land Use and Zoning Ordinance.": [
        "'speaker_0': 'Bill passes on chair will gladly sign it. Thank you. Strap on face. Read the report of the Select Committee on Citywide Mandatory Housing Affordability.'",
        "'speaker_2': 'The Report of the Select Committee on Citywide Mandatory Housing Affordability Agenda Item to cancel 119 500 Related Lands and Zoning Amending Ordinance 125731 to correct map errors contained a map for 23.58 points or 50 map for 23.50 3.0 50 and attention went to a125 791 committee recommend single pass customer and.'",
        "'speaker_2': 'GONZALEZ Thank you, Mr. President. Colleagues, as I mentioned last week, Turner, a subcommittee on the city wide mandatory housing affordability meeting. And this morning during council briefing, this council bill represents a set of technical changes to the citywide Mandatory Housing Affordability Ordinance that this fall council adopted in May of 2019.'",
        "'speaker_2': 'All of you attended that committee hearing last Monday and heard from Ali Pucci of Council Central Staff the particulars of the technical changes included in this version of the bill. So I won't belabor the point today, but those changes, as a reminder, are strictly limited to ensuring that the maps and code language reflect the appropriate payment levels'",
        "'speaker_2': 'for development capacity, as determined by the City Council and previous policy conversations, as well as making sure that all of the code language accurately reflects the many policy choices made by the City Council in its deliberations of the originally passed citywide mandatory housing affordability ordinance.'",
        "'speaker_2': 'Otherwise, there are no substantive policy shifts or modifications to those legislative policy decisions made by this City Council in May of 2019. With that being said, the Select Committee on Citywide may recommend to the full council adopt council bill 119500.'",
        "'speaker_0': 'Very good. Any questions or comments? Do not please call the role on the passage of the bill.'",
        "'speaker_1': 'Sarah O'Brien I Pacheco. I want I make sure Gonzalez.'",
        "'speaker_4': 'I Herbold II.'",
        "'speaker_1': 'Whereas President Harrell high nine in favor and in oppose the.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Please read the part of the Finance and Neighborhoods Committee. Please read the shirt. Tyler mentioned the number three.'"
    ],
    "Historic Preservation Controls for Seattle Tower.": [
        "'speaker_2': 'The report of the Finance Neighborhoods Committee Agenda Item three Constable 119 528 Relating to historic preservation imposing controls upon the Seattle Tower. The committee recommends the bill pass.'",
        "'speaker_0': 'Customer in Bexar. Thank you.'",
        "'speaker_3': 'Very much. This ordinance will impose controls on Seattle Tower. It was formerly known as the Northern Life Tower at 1212 30th Third Avenue. The building was originally nominated about 40 years ago in 1974. But due to ongoing negotiations and various changes in ownership, we're only just now making the designation official.'",
        "'speaker_3': 'Many of you will remember this building is very interestingly designed to Hall Tower. It was one of the tallest in in the Seattle area after Smith Tower. But it starts with dark, a brick on the bottom and gets lighter.'",
        "'speaker_3': 'And too, they have almost white brick on top. And it's supposed to be reflective of Mt. Rainier. And specifically what will be landmarked will be the exterior of the structure and the lobby recognized for various protections. And the committee moves adoption of 119528.'",
        "'speaker_0': 'Very good. Any questions or comments now? Please call the rule on the passage of the bill.'",
        "'speaker_1': 'Mosquera. I O'Brien Pacheco. I so want I make sure. Hi.'",
        "'speaker_4': 'Gonzalez Herbold.'",
        "'speaker_1': 'I was President Harrell high nine in favor nine oppose.'",
        "'speaker_0': 'Bill passed your senate. Please read the next agenda item. The short title, please.'"
    ],
    "Historic Preservation Controls for Mount Baker Community Club Clubhouse.": [
        "'speaker_2': 'Agenda item four Accountable 119 529 Related Historic Preservation Opposing controls upon the Mount Baker Community Club Clubhouse Committee recommends the bill pass.'",
        "'speaker_0': 'As mere backdrop.'",
        "'speaker_3': 'Thank you. This second ordinance will impose controls on the Mount Baker Community Club clubhouse, located at 2811 Mt. Rainier Drive South. And it was built in 1914. And I want to say thanks to the community members who came to my committee.'",
        "'speaker_3': 'Now, ten days ago, this landmarking will ensure the preservation of the site and the building's exterior, and it's believed to be associated in a very significant way with the economic heritage of the community in Mount Baker. So thank you for that.'",
        "'speaker_3': 'And we move adoption of 119529.'",
        "'speaker_0': 'Thank you very much. Any comments that please call the roll on the passage of the bill?'",
        "'speaker_1': 'Macheda I. O'BRIEN All right. Pacheco. I so want I make sure I. Gonzalez Herbold, I was. President Herrell. All right. Nine in favor, nine opposed.'",
        "'speaker_0': 'To passenger assignment. Please read agenda item number five, the short title.'"
    ],
    "Historic Preservation Controls for University of Washington Parrington Hall.": [
        "'speaker_2': 'Agenda item five cancel 119 530 Relating to historic preservation opposing controls upon the University of Washington Carrington Hall Committee recommends the bill pass.'",
        "'speaker_0': 'That's my best shot.'",
        "'speaker_3': 'Thank you. This ordinance will impose controls upon Farrington Hall, which is located at 4105 Memorial Drive Northeast on the UW campus. Many of us have actually had classes there or taught there, and it was built in 1902. Appearing in Hall, it's now the home to the Evans School of Public Policy.'",
        "'speaker_3': 'The designation will preserve the exterior of the building and the interior room volumes and skylights. On the third floor, east and west. And you may notice in some of the original photographs that it was white, and at the original it was painted white to be part of the 1906 fair.'",
        "'speaker_3': 'So it has now been restored to its original brick exterior and it meets the following standards for designation significant aspect of cultural, political and economic heritage on the UW campus. So we move adoption of Council Bill 119530.'",
        "'speaker_0': 'Very good. Any questions or comments, Councilman Pacheco?'",
        "'speaker_5': 'Well, I appreciate that certain elements of the building will be preserved. Will be preserved. I am very happy and ecstatic to learn to see the project move forward and that the Evans School get a new building because it was long overdue.'",
        "'speaker_5': 'Having spent a couple of years in that basement.'",
        "'speaker_0': 'Very good. You know the question of.'",
        "'speaker_3': 'Being better than the basement.'",
        "'speaker_0': 'Okay, so if not, thanks. Councilwoman Pacheco. Please call the rule on the passage of the bill.'",
        "'speaker_4': 'Macheda I.'",
        "'speaker_1': 'O'Brien. High Pacheco. I so want. I make sure I. Gonzales Herbold I. Whereas President Harrell I nine in favor and unopposed.'",
        "'speaker_0': 'Bill passenger senate. Please read item six and seven.'",
        "'speaker_2': 'Agenda Item six and seven appointments 1350 and 1351 reappointment to taste marvelous and Christopher Maquette as members Community Involvement Commission for a term to May 31st 2021. The committee recommends these appointments be confirmed.'"
    ]
}