{
    "Housing and Displacement Mitigation Ordinance Amendment.": [
        "'speaker_3': 'Reported the Sustainability and Interest Rates Committee Agenda Ember one Council 120 325 relating to housing and displacement mitigation. Expanding the information required for submission to the Rental Registration Inspection Ordinance for rental housing units required and submission of rental housing related information and amending Chapter 22.2 14 of the Code.'",
        "'speaker_3': 'The committee recommends that the bill pass with a divided vote, with councilmembers Lewis and Allison Faber and Councilmembers Nelson and Suarez opposed.'",
        "'speaker_1': 'Before we move on, I need to recognize that Councilmember Lewis has joined us with that council members to want.'",
        "'speaker_2': 'Thank you. Going to prison warriors. Councilmember Peterson is the prime sponsor of this legislation. I will turn the floor over to him to use it. I do have some comments, but I will wait until he has had a chance to introduce his bill.'",
        "'speaker_1': 'Let's hear. So what do you want to speak after Councilmember Peterson and then we'll go into. Okay. Okay. Go ahead. Go ahead. Customer Peterson.'",
        "'speaker_0': 'Thank you. Council President. Thank you. Chair Salon's Council President. May I move the bill?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay, colleagues, I'd like to move passage of Council Bill 120325 on our agenda.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Thank you, chelsea. President suarez. I'll go ahead and speak to announce that. Thank you again. Thank you. President Juarez. Thank you. Salon two colleagues. Council Bill 120325 will efficiently fill a longstanding gap in data collection and analysis for Seattle's rental housing inventory, which will generate several benefits, including key data needed to measure and prevent economic displacement of'",
        "'speaker_0': 'existing residents from a dynamic and growing city. Seattle's Rental, Housing, Registration and Inspection Ordinance, our i o adopted several years ago, already requires landlords to submit a list of the rental units, and this bill would simply have property owners include that list along with rental rates, occupancy status and square footage of each unit to a research university'",
        "'speaker_0': 'to compile and analyze this important data. No personal information of the tenants would be provided. For the past several years, our city government has lacked the level of detail needed to understand many details about Seattle's housing inventory, including the extent of affordable housing that's not subsidized but still housed below market rents.'",
        "'speaker_0': 'Usually because that housing stock is older, what some refer to as naturally occurring affordable housing. This legislation also follows through on our statement of legislative intent of zero zero for a001 that Council adopted in November 2020. I understand that rental housing providers have had to absorb many changes and requirements over the past few years.'",
        "'speaker_0': 'Yet for us, time is running out for the simple, yet vital data before we attempt to update the city's comprehensive plan that will serve as a foundation for future housing and land use policies. The July 2019 Report prepared by the city's Office of Prepared for the City's Office of Planning and Community Development States by the Urban Displacement'",
        "'speaker_0': 'Project. University of California titled Heightened Displacement Risk Indicators for the City of Seattle states that a more granular and localized data set is needed to best meet the city's racial equity goals. The Seattle market rate, housing needs and supply analysis prepared for the city in 2021, stated that displacement can result from demolition of rental housing for redevelopment'",
        "'speaker_0': '. As I mentioned before, we adopted a statement of legislative intent in 2018th November 2020 that asked the executive to come back with a plan to address this data gap. Unfortunately, the plan was not effective, merely suggesting that we hire a different private survey firm, which Dupr and Scott went out of business in 2018, demonstrating that we probably'",
        "'speaker_0': 'should not be relying on a private sector firm to collect data for a large city like Seattle that has dynamic changes going on with its policies. So it's time for us to take additional steps, such as requiring the data we need to mitigate and prevent displacement.'",
        "'speaker_0': 'So the IRR, the IO database already exists, but received an analysis of the rental housing data will require the contracted research university to set up spreadsheets or a database to enter and sort the rental rates and other information.'",
        "'speaker_0': 'I'm happy to address questions about cost. I can touch on that briefly here, but I believe the figures in the fiscal note are very high estimates and they lack the cost effective rigor and reality of a competitive request for proposals process that will occur.'",
        "'speaker_0': 'Also exceeding the budgets of PCD and CCI increased substantially from 2021 to 2022. During as part of the new bill that was introduced a few weeks ago, we did insert a sunset clause. So for landlords concerned about the ongoing burden of providing listing information that they would normally have for their own record keeping and tracking of rental'",
        "'speaker_0': 'revenues, this bill contains a sunset clause to end this process by December 2025. In other words, for those concerned about the bill, it's already been modified substantially by limiting the amount of time it's in effect. While the first round of data may not be available for the executive departments to complete their initial draft of comprehensive planning materials'",
        "'speaker_0': '. The data will be available for for us, for city council members before any final decisions are made on the comp plan. So happy to answer questions or turn it over to others.'",
        "'speaker_1': 'Before I turn over to Councilor Solon, does anyone have any questions or comments for Councilmember Peterson before we let councilmembers address it and then we'll move to Councilmember Ellis in a moment. Okay. Not seeing any customers. So what do you want to address this?'",
        "'speaker_1': 'And then I believe Caspar Morales has a few items for us.'",
        "'speaker_2': 'Thank you. I support this bill and I thank Councilmember Peterson for bringing it forward. It will be good to have more data about the rent landlord's charge. This bill simply requires landlords to disclose the rent that they charge so that policymakers can have accurate, objective data.'",
        "'speaker_2': 'So it is pretty ironic that in public comment, landlords are simultaneously claiming both today and the committee they claim ultimately claim that they charge low rent and also objected to actually disclosing the rent they charge. I'm not I don't buy the stated reasons by these landlords that they are opposed to collecting the data because it will be'",
        "'speaker_2': 'some sort of onerous burden. It's not clear at all why it would be a burden to simply report the rent that you're already charging. You're already doing the paperwork. And I think it's it's really telling that the landlord lobby has turned out in opposition to this very straightforward and a bill that simply is about data collection.'",
        "'speaker_2': 'It is not a commentary on rent in any way. It's certainly not anything like rent control. I think the reason is clear. More accurate and more complete data will help further confirm what every renter in Seattle and every housing advocate in Seattle already knows big landlords.'",
        "'speaker_2': 'And the predatory real estate markets are gouging renters with totally unconscionable rent hikes. The cost of housing is being set by the greed of speculative banks, private equity funds and rapacious property management corporations rather than what it actually costs to house people.'",
        "'speaker_2': 'So while the real estate barons make billions, working people and the poor are increasingly price gouged just to have a roof over their heads and both are getting pushed into homelessness, we need to strengthen all the aspects of renters rights.'",
        "'speaker_2': 'We also need strong citywide rent control and a big increase in taxes on the rich. Like the Amazon backs that our movement won in 2020 to fund and increase expansion of publicly owned social housing. This bill will simply stipulate that landlords have to provide information to the city about the rents that they are charging.'",
        "'speaker_2': 'So I will vote yes on this legislation and I hope all council members also vote yes.'",
        "'speaker_1': 'Thank you. First one, does anyone have any questions for Casper Salant before we move on to Councilman Morales? Okay. Not seeing any. Councilmember Ellis. Good afternoon, colleagues. Thank you very much, Council President. I do have a couple of amendments, so I would like to first move Amendment eight to House Bill 120325.'",
        "'speaker_1': 'These were distributed on Friday the second. I will grant you a second. Councilman Morales, thank you very much. This amendment, colleagues, just adds a recital to state that the council intent with this is that this information would be public.'",
        "'speaker_1': 'As we know, anything we do is public. And the data itself, as many have said, is already publicly available. I just want to cover our bases that stating that this correlation of publicly available information and its use by the city will ultimately be public, either through public disclosure or via a data source like the Seattle.'",
        "'speaker_0': 'Services.'",
        "'speaker_1': 'Portal. So that is what we are trying to do with this. Thank you. 30 Comments for Councilor Morales regarding her Amendment. Not seeing any. Will the clerk please call the roll on Amendment eight? Councilmember Herbold. Yes. Councilmember Lewis.'",
        "'speaker_1': 'Yes. Thank you. Councilmember Morales. That's. Councilmember Mosquera I. Councilmember Nelson. No. Councilmember Peterson.'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': 'Council members want? Yes. Councilmember Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council president, whereas. No. Six in favor. Three opposed. That was six in favor, three opposed. The motion carries an amendment, eight is adopted. Let's move on. Councilmember Ellis, I believe you have another amendment for us. Please. I move to amend Council Bill 1 to 0 3 to 5 as presented on Amendment eight, which was also distributed on'",
        "'speaker_1': 'Friday second. He's been moved and seconded. Go ahead, customer. Q So this amendment reflects some technical changes that we did receive a request for Stsci, and it would do a couple of things. The first is that it would set the start date for the legislation from the contract signing so that Stsci has some time to kind of'",
        "'speaker_1': 'ramp up. And it would also provide landlords some time to prepare for compliance of the legislation. And then it also sets sunset for all parts of this bill so that there's no ambiguity around enforcement of certain provisions versus others.'",
        "'speaker_1': 'And that is what we have with this amendment. Thank you, Mr. Morales. Are there any questions or comments? A customer, Peterson.'",
        "'speaker_0': 'Thank you. Council President I just want to thank the collaboration with council Morales and so odd and this this this amendment does two different things. I definitely support refining it so that the sunset clause is clearly in all the sections.'",
        "'speaker_0': 'I'm not you know, it will definitely make for a cleaner bill. I am concerned a little bit with giving the department all that time because the first date when the rental information is due is in October, and we really want to get the information as soon as possible for the comprehensive plan.'",
        "'speaker_0': 'I'll still support the bill if this pass, if this amendment passes, but be voting no on this amendment. Just wanted to explain why, because I'm not sure there's the teeth exists to make sure that that is expeditiously contracted with the research university.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Thank you. Chester Peterson, is there anyone else before we move to a vote on the amendment, Kessler mosqueda.'",
        "'speaker_3': 'Thank you very much. I appreciate that this amendment is being brought forward so that we could potentially work with the departments on some of the concerns that they have. I will be supporting this amendment. I still have some concerns on the underlying bill, so I'll make sure to chat about those after the vote.'",
        "'speaker_3': 'But I will be supporting this amendment today.'",
        "'speaker_1': 'Thank you, sir. Anybody else? Okay. Not. Oh, Caspar Herbold. I'm sorry. Thanks. I just want to flag Peterson, I think addressed it in his comments, but just want to uplift a little bit more detail. You know, in 2015, this was the first major comp plan that included what was called a displacement risk analysis.'",
        "'speaker_1': 'And we have, since that time used a displacement risk analysis for many of our land use decisions. The displacement risk analysis was instrumental to council's deliberations on the mandatory housing affordability reasons to try to minimize the likelihood of that those those reasons would sort of accelerate displacement.'",
        "'speaker_1': 'On April 5th, we all received a memo from the Planning Commission on issue specific topics related to our next major comp plan update. And they wrote to us to say that we should make anti displacement policies a focus of the comprehensive plan and and we should do so to disrupt decades of inequitable growth patterns that led to'",
        "'speaker_1': 'the disproportionate displacement of bipoc and low income communities. And that the major update to the comprehensive plan expected in 2024 needs to include not only anti displacement policies as a central focus of the plan, but we should supplement knowledge shared by communities affected by displacement, with improved data tracking of high displacement risk areas and the outcomes of'",
        "'speaker_1': 'policy actions. And so I'm just lifting that up to say if we are going to be making a change to the date when this information is due, we we might be depriving ourselves of of useful data that will help us guide us in making some of the decisions around the major update.'",
        "'speaker_1': 'So I am, for that reason, not inclined to support this amendment. Making calls for her. I have a question because I was looking at I just want to I'm going to address it to you because you brought up the anti displacement risk analysis.'",
        "'speaker_1': 'That was the that was like the heat map that we got that would say high opportunity or high displacement. Low. Okay, great. I just want to make sure we're on the same page. It was high up to the low access, high displacement.'",
        "'speaker_1': 'Okay. Got it. They just didn't make it. And so when we did those amendments to FHA, I remember us having to use those maps. Okay, good. Is there anyone else that would like to comment before we go to a vote on Amendment B?'",
        "'speaker_1': 'All right. Well, I'm sorry. Go ahead. I'm sorry. Yeah, I just want to respond. I appreciate the comments. I don't think anybody is as interested in anti displacement work as I am, given the district that I represent. So I certainly appreciate the comments.'",
        "'speaker_1': 'This is really about trying to make sure that SDI has the capacity to do the work that we're asking them to do. We know, I'm sure many of us hear about how sort of overtaxed they are and how the challenge that the department has with meeting some of the things that we're asking them to do.'",
        "'speaker_1': 'So this isn't in any way an attempt to delay us getting access to really important information. It's just a real chance for us to make sure that the department is prepared to do what we're asking them to do.'",
        "'speaker_1': 'So I urge your support, colleagues. Thank you. Thank you. And because we were also I think Councilmember Herbold wasn't suggesting that you were trying to. I think we're just making the point. So thank you. I'm going to thank everybody because that's what we do here.'",
        "'speaker_1': 'Okay. So with that, Madam Clerk, can we please call the roll on Councilmember Morales's amendment? Amendment B, Councilmember Herbold?'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember Morales. Councilmember Mosquera i. Councilmember Nelson, you know. Councilmember Peterson.'",
        "'speaker_0': 'So.'",
        "'speaker_1': 'Council members want? Yes. Council member Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council President. Whereas No. Six in favor. Three opposed. Six in favor. Three Oppose motion carries. Oh, I thought it was five for.'",
        "'speaker_3': 'That's correct. Council president. It's five in favor.'",
        "'speaker_1': 'Four opposed. Oh, it's five. Four. I'm sorry. What? Okay. I thought you said six three. Those last time. Okay. So the the motion carries. Correct. Correct. Okay. So the motion carries an amendment. B is adopted in the amended bill.'",
        "'speaker_1': 'We will move forward to now the amended bill that's in front of us. And so, Councilmember Peterson, our customers want which one of you will be discussing? Have any closing remarks before we go to a vote on that?'",
        "'speaker_1': 'Or and then after that, my colleagues can also raise their hand if they want to speak to it.'",
        "'speaker_0': 'I don't have any closing remarks.'",
        "'speaker_2': 'I don't either.'",
        "'speaker_1': 'Okay. Council members, let's see. Let's start with Councilmember Nelson, then Councilmember Morales. Well, I support.'",
        "'speaker_3': 'The stated policy goals.'",
        "'speaker_1': 'Of preserving affordable.'",
        "'speaker_3': 'Housing and also.'",
        "'speaker_1': 'Prioritizing displacement prevention as we deliberate on the plan. But I don't support.'",
        "'speaker_3': 'Singling out.'",
        "'speaker_1': 'A group of business owners to generate the data that will be using to make those decisions. And that's what this legislation does to housing providers. So I'll be voting no. Thank you. Casper Morales. Q I just want to ask I've been working with Councilmember Peterson with this on this legislation for some time.'",
        "'speaker_1': 'So I'd like to ask to be added as a co-sponsor. And want to encourage. Support you very much.'",
        "'speaker_0': 'You.'",
        "'speaker_1': 'Thank you, sir. Any other comments? Castro mosquito.'",
        "'speaker_3': 'Thank you very much. I'm excited about the conversation, about getting ready for the plan. So I'll focus first on where I think that there's a shared common ground, and that's a lot of excitement about the opportunity to address the housing needs in our city, both to develop new affordable housing units and to make sure that we're looking'",
        "'speaker_3': 'at displacement. I think it's been well articulated already in this meeting and in previous meetings that the plan in front of us of the community engagement this year, the policy development next year and then the drafting of the policy in 2024 is a real it's a huge opportunity to address the growing needs in our community and to'",
        "'speaker_3': 'also make sure that we're preventing displacement. I think that there is a number of ways that we concurrently get the data that was being sought here. And I really hope that we turn towards some of the data that the director of the University of Washington Center for Real Estate Research has offered to us to offer to help'",
        "'speaker_3': 'out help a framework and community engagement strategies to work on getting some of the information that we might need on rental data collection and look forward to potentially working with them. I also think that there is a huge opportunity for us to dig into the data that's currently being provided by the city and work with these external'",
        "'speaker_3': 'partners to really pull out from it additional information that might be needed. My concern is the price tags still associated with this. And thank you, Councilmember Peterson, for speaking to the potential opportunity to drive down some of those costs.'",
        "'speaker_3': 'And Councilmember Morales, your amendment is trying to extend out the the timeframe I think may help with some of the costs. But given that the departments have indicated via the central staff memo and the cost estimates in the fiscal note, an estimated range of 2 million to $5 million in a year where we have many competing budget'",
        "'speaker_3': 'priorities and a budget gap, as we've discussed, that we're going to be looking to close not just this year but in the out years. I want to make sure that we have a process to address the department's capacity concerns, to implement a program with our existing staff, including Staffing for Compliance, Review and enforcement, customer support and communications'",
        "'speaker_3': 'and I.T. upgrades to track the information that's being submitted. I'm also interested in working to see what we can do to support the departments because they've stated a large amount of uncertainty for the amount of funding that will be needed and a hindrance in attracting qualified entry to contracts with entities for the data collection and opacity has'",
        "'speaker_3': 'also identified that there's issues with the bills specification for the information property owners would provide and suggested various amendments that I don't see in the legislation in front of us. Again, not being on the committee. I appreciate the hard work that went into this, but at this point today, especially focused on the fiscal note and the other'",
        "'speaker_3': 'available data and the external partners who I think can help us get some of the data that the legislative intent really speaks to. I'm going to be voting no on this today, and I look forward to working with folks on that common ground that I started with.'",
        "'speaker_1': 'Thank you, sir. Anyone else? So I'm going to share that I will not be supporting this bill today. And I had a really good opportunity to talk to Councilmember Peterson about what some of my concerns were and obviously value the goals of looking at displacement.'",
        "'speaker_1': 'Councilor Herbert, thank you for bringing up what we were talking about in 252 to 24 with the comp plan and the anti displacement and what tools we've already been using. I guess for me there's a lot of things.'",
        "'speaker_1': 'I think some of this I spoke to Joint Committee on May 20th. I am concerned about the data. I'm concerned about the third party possession. And so I'm concerned that we have new data points. I'm concerned what customer data brought up about the budget implications and also having a firm number about what the cost would be.'",
        "'speaker_1': 'And I you know, someone threw out 2 million. We don't that's probably way at the high end as Councilmember Peterson shared with us earlier. But I really am concerned about the city having additional in a burdensome new possession and production responsibilities of raw rent data pursuant to the Public Disclosure Act.'",
        "'speaker_1': 'I don't know how much more we can place on PCD and CCI twice a year to bring forward this kind of raw data, because at the end of the day, the city will be responsible for the data, for the possession, for maintaining the data, for releasing the data.'",
        "'speaker_1': 'There are no exceptions, obviously, again, under the Public Disclosure Act. So at this juncture and this form, I'm going to have to unfortunately not be able to be supportive today. So with that, not seen any more. Madam Clerk, will you please call the roll on the passage of the amended bill?'",
        "'speaker_1': 'Councilmember Herbold? Yes. Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'And remember Morales as. Council members must get to know. Councilmember Nelson. They. Councilmember Peterson.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember. Silent? Yes. Councilmember Strauss.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Councilmember Morris No. Five in favor for post write the bill passes as amended and the chair will sign it. Will the clerk please fix my signature to the amended legislation on my behalf? Right. Well, we Don, we will go to the Public Safety and Human Services Committee of the mighty Councilmember Herbal.'",
        "'speaker_1': 'Madam Clerk, can you please read item number two to the record?'"
    ],
    "Compensation and Labor Standards for App-Based Workers.": [
        "'speaker_3': 'Well, to the report of the Public Safety and Human Services agenda item to council, but one to 0 to 94 relating to app based worker labor standards, establishing a compensation scheme for app based workers with the minimum requirements and related standards for transparency and flexibility.'",
        "'speaker_3': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you. Kiss rehearsal. Thank you so much, Madam Chair. And have some initial remarks here. And I think we also have. Do we have an amendment? We do. All right. So I will with your with your permission kicks off with my initial remarks.'",
        "'speaker_1': 'Thank you. So as we all know, we live in a very expensive city. And we also know that many app based delivery workers earn below the minimum wage after expenses and tips are accounted for. One platform that claims its workers receive $28 an hour after including tips and not accounting for expenses, also has one of the highest'",
        "'speaker_1': 'numbers of employees on food stamps in all of Washington state and one of the highest numbers of employees on Medicaid in all of Washington state. We know that app based work is one of the fastest growing sectors of our economy, with more and more workers turning to this type of work and not receiving the protections of basic'",
        "'speaker_1': 'labor standards. The passage of this legislation today would help tens of thousands of delivery workers make.'",
        "'speaker_3': 'Ends meet.'",
        "'speaker_1': 'While maintaining their flexibility. This conversation has been almost a year in the making. On June 9th, 2021, we held our first stakeholder meeting with. Since then, a total of a dozen large stakeholder meetings, followed by many additional one on one meetings.'",
        "'speaker_1': 'I want to thank the many participants in those efforts. This included representatives from DoorDash. DoorDash. Uber. Eats. TaskRabbit Rover. Instacart. Gopuff Chip. Seattle restaurants, United Workers and worker advocacy groups such as Drive Forward Working Washington and the National Employment Law Project.'",
        "'speaker_1': 'During last week's committee discussion, central staff walked us through 16 separate amendments. The committee then voted and with one abstention and four votes in favor to recommend the bill to the full council today. This is a testament to the hard work everyone has put into this process.'",
        "'speaker_1': 'While we know there are still some app based businesses that are concerned about the legislation. The fact is that, again, this is a very expensive city to live and work in, and if paying employees subminimum wage is the only way that businesses can sustain their model, there should be some consideration whether or not that business model really'",
        "'speaker_1': 'works. We know that these businesses are making record revenues. With DoorDash reported nearly 5 billion in revenue in 2021, up 69% over 2020. They also paid their CEO over $400 million in 2020. Uber Eats reported $5.8 billion in revenue for the fourth quarter of 2021, beating their own estimates and Instacart's 2021 revenue grew 10% year over year'",
        "'speaker_1': 'to 1.65 billion. That company's valuation is 24 billion, up four from almost 18 billion just a few months prior. Given this, how is it that paying workers a minimum wage could be a threat to their business model? Though I'm really disappointed that the legislation is passed out of committee strip protections for many app based workers.'",
        "'speaker_1': 'Let's remember that the legislation that the council passed last June, the Independent Contractors Protections Ordinance, means that independent contractors that are not covered by today's bill will have access to information so that they can receive pre-contract disclosures, timely payment and payment disclosure disclosures for services valued at $600 or more.'",
        "'speaker_1': 'The Office of Labor Standards has been conducting the directors rule process this year for that bill, and all of these protections will go into effect beginning of September this year. To the small businesses concerned about price increases, we know that a lot of small businesses are strongly in favor of this legislation like Seattle Restaurant United.'",
        "'speaker_1': 'But for those who do still have concerns, do keep in mind that you are currently protected from price increases in April of 2020. The former mayor signed an emergency order that prevents app based delivery companies from charging more than 15% of the purchase price of an order.'",
        "'speaker_1': 'And I understand that Council is working on drafting this policy as the Council bill to extend that protection. And I really look forward to supporting that, that incredibly important legislation. Remember, every dollar in a low wage workers pocket adds $1 in $0.21 to the economy and investment in our local businesses.'",
        "'speaker_1': 'And it leads to job creation, too, though, as we heard today, the app based platforms still have concerns. I do want to highlight the other alterations made to the bill on their request that I did support. We reduced each of the associated cost factors, the associated time factor and the associated mileage factor.'",
        "'speaker_1': 'These are all inputs that resulted in reducing the minimum payment calculation as originally proposed. We included a requirement that all US Office of Labor Standards produce the notices of rights and translations removing that burden from the company. We included a requirement that allows network companies to take adverse action against a worker for fraud if that company has'",
        "'speaker_1': 'a fraud policy. And we have changed the effective date of the ordinance from 12 months to 18 months. Remember that the transportation network company legislation, the fair share, was passed unanimously back in November 2019. The effective date for that legislation was January 1st, 2021.'",
        "'speaker_1': 'That gave them 13 months for rulemaking and for companies to adjust for pay up. We now have an effective date of 18 months after passage. That's five months longer than fair share. This gives the platforms more time to adjust, but also remember.'",
        "'speaker_1': 'It also means that the workers that we've been hearing from today will be waiting two years longer for the same kind of guarantees that taxi drivers are already receiving thanks to our legislation. I have some some closing remarks after hearing some a lot of.'",
        "'speaker_1': 'Thanks, Jim. Hopefully after hearing the amendment. But that's what I wanted to say from my opening remarks. All right. Remind me to come back to you, too, because I'll forget to do closing remarks. Councilmember Ellis, I understand you have an amendment, and even though it's labeled Amendment 17, I'm guessing it's 17 because 16 were in committee.'",
        "'speaker_1': 'Okay. Yeah, I'm not on that committee, so. Yes, but that is my understanding as well. And I would like to move to amend Council Bill 1 to 0 294 as presented on Amendment 17, which we did distribute before noon today.'",
        "'speaker_1': 'Second. Oh, I'm. You moved it. I second. It's been moved in second. Go ahead, Councilmember Ellis. Thank you. Well, I did watch the committee over the weekend and it was disappointing to see workers on a marketplace network. These get excluded from the policy at the last minute.'",
        "'speaker_1': 'I do believe that we need to make sure that these workers are protected as well. This amendment really expresses the council intent to consider regulating marketplace network fees regarding minimum payment flexibility and transparency protections in separate legislation no later than next summer, August 1st, 2023.'",
        "'speaker_1': 'I think it's important that we pass the legislation today and continue moving forward on additional policies to protect workers in our city. Because whether you get a job from an app or a want ad, work is work. And every worker deserves basic rights like minimum wage.'",
        "'speaker_1': 'So I am offering this amendment today in hopes that my colleagues will support it. Thank you. Councilman Morales, are there any comments for Council Morales before we move to a vote on the on Amendment 70? All right. Not seeing any.'",
        "'speaker_1': 'Will the clerk please call the role on the adoption of Amendment 17? Councilmember Herbold? Yes. Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember Morales. Yes. Councilmember Mosquera.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilmember Nelson. Okay. Councilmember Peterson.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Council members? Yes. Councilmember Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council president. Whereas. Yes. Seven in favor to oppose. All right. That means that the motion carries an amendment, 17 is adopted, and now the amended bill is before the council. So with that, I will hand it back over to Councilmember.'",
        "'speaker_1': 'I was hoping to give closing remarks. I don't know, particularly my co-sponsor, Councilmember Lewis might have some remarks as well. Yeah, I'm sorry. I apologize. Councilor Lewis has his hand up, too. So you came? I can't see. Is it just Casper Lewis?'",
        "'speaker_1': 'All right, Casper Lewis. And then councilmembers.'",
        "'speaker_0': 'Want council President Suarez appreciate the opportunity to briefly speak to this legislation and appreciate the partnership of Councilmember Herbold in moving this forward. This is the first in a series of measures to right size long standing inequities in our local economy that the introduction of gig work and app based work has driven over the past decade of'",
        "'speaker_0': 'technological changes and shifts in our economy. You know, this legislation by no means is going to be the final word on this. I appreciate the amendment brought by Councilmember Morales putting a timeline for one aspect of future legislation which will be looking at ways to.'",
        "'speaker_0': 'Create some level of certainty and regulation into how the marketplace that's conducted their work, but also several other pieces of legislation, including how do activations work in this world and transparency and and notice of how these pay standards impact folks who are in this gig economy.'",
        "'speaker_0': 'As Councilmember Morales just noted. A lot of this work increasingly is being driven not because it's new work or new types of jobs that people do, but because there are new ways to deliver them across varying business models.'",
        "'speaker_0': 'This council previously moved to regulate the transportation network companies Uber and Lyft in that same vein. Today we extend those regulations to delivery companies and soon will be considering other aspects in this economy and appreciate the work of Councilmember Herb in bringing us together.'",
        "'speaker_0': 'Very much appreciate the work of Camilla Brown on my staff, who has worked hand in hand with Alice Clardy in the Herbold office in the stakeholder ring and bringing together our folks appreciate the work and the stewardship of work in Washington, in this area, as well as all of the partners from other organizations who have provided input'",
        "'speaker_0': ', including representatives from the platforms and representatives from drive forward. So this is the first step in continuing the mission to expand increasingly what the role and future of work is going to look like in the city of Seattle.'",
        "'speaker_0': 'And I look forward to continuing this work throughout this year and into next year and to continue to monitor this legislation as it goes into rulemaking. So I appreciate the opportunity to speak to this and look forward to voting.'",
        "'speaker_1': 'If you just so I make sure I got the role, I got it correct, I think. Casper So what was next? And then Councilmember Mosqueda and then Councilmember Morales and then Councilmember Nelson and I write this down. I apologize.'",
        "'speaker_1': 'I kind of got it mixed up. Casper Salon.'",
        "'speaker_2': 'Thank you. I voted yes on the amendment, and of course, I support the legislation as a whole. And I thank all the workers who spoke today and previously in public comment in support of the legislation. As a socialist, I have repeatedly explained in the past that big business under capitalism has enormous power, and every victory of the'",
        "'speaker_2': 'workers movement that has been won comes under attack and is gradually chipped away. When the movement as the only alternative really is to fundamentally end the power that big business has to claw back every penny that workers have won and fight for global socialism.'",
        "'speaker_2': 'Big business does not want to pay minimum wage. It does not want to respect other worker rights. And when we say big business is not an inanimate object, it is the billionaires, it's the multi-millionaires, it's the very wealthy, the elite.'",
        "'speaker_2': 'So they invent the notion of gig workers, so-called gig workers, independent contractors. And suddenly you you have a whole section of the workforce where workers rights regulations apparently do not apply. The evolution of the gig industry is also linked in other ways to the fundamental nature of capitalism.'",
        "'speaker_2': 'It is not only the reforms that have been won by workers are constantly under attack, which they are. But the gig industry also illustrates how, as the global capitalist system has gone deeper and deeper into a long term crisis over the last decade, the billionaires and the multimillionaires have increasingly created more and more avenues to squeeze every'",
        "'speaker_2': 'last drop of blood from the global working class. And that is why you see the evolution of such industries now that the pay gap legislation would extend minimum wage protections to gig workers at the last minute, and committee members Peterson, Nelson and Lewis passed an amendment to create a new legal section called so, quote unquote, marketplace network'",
        "'speaker_2': 'workers. And no doubt more and more big businesses will redefine the marketplace. Network workers, no doubt more and more big businesses will redefine themselves into that loophole. Really, the city council should be reversing that loophole. But that was not the amendment before us in the last vote.'",
        "'speaker_2': 'I support this legislation to close the loophole in minimum wage protections created by the independent contractors legal notion. And I will support closing the marketplace network loophole too. If members want to do that. The workers movement fights for better wages and that is essential.'",
        "'speaker_2': 'And we also need to fight for socialism. So we are not continually the working class is not continually forced to fight for the right to survive like.'",
        "'speaker_1': 'You customers want. Council Member Mr..'",
        "'speaker_3': 'Thank you. Council President. And thanks again to Councilmember Herbold and to Councilmember Lewis, the co-sponsors of this legislation. It's my. My great privilege and pride to be able to support you in this legislation today and to continue to underscore for members of the public how long this process has been under way.'",
        "'speaker_3': 'And to say that it's been coming for a long time is an understatement. We knew that this type of legislation was needed for basic standards to protect gig workers. And the concept of the pay gap legislation and the campaign fund community really got a lot of attention way back in 2019.'",
        "'speaker_3': 'And since then, gig workers, frontline workers, quote, essential workers and workers that we deemed to be heroes have only since then, because of the pandemic, been put more in the spotlight in terms of the type of work they've done and more at risk to do the work that they do during this pandemic.'",
        "'speaker_3': 'So I'm excited to support this legislation today and to recognize the many months, the years of hard work that went into this piece of legislation. And to really as well thank the staff from the from the co-sponsors, Alex Clardy and Camilla Brown.'",
        "'speaker_3': 'I also want to thank central staff and named them by name. Amy, Carina and Jasmin. I know that they have done a tremendous amount of work with specifically Office of Labor Standards, but many of the other departments as well to craft the legislation.'",
        "'speaker_3': 'And I know, Councilmember Herbold, you are saving your thank you. So I hope I'm not stepping on toes, but I know that they probably don't hear it enough. So I do also really want to thank several for my chief of staff who has worked with these what the pieces of the piece of legislation in front of us'",
        "'speaker_3': 'through the various iterations and in close coordination with Alex and Camilla, as well as members of the Mayor's Office and Office of Labor Standards and the broad community, both the community of worker representatives as well as industry representatives, to further understand the implications of the bill in front of us.'",
        "'speaker_3': 'So thanks as usual, for the hard work that she did as well in digging into this legislation. I will be as well voting yes, as I noted. But I do want to underscore the significant reservations due to the amendments that were made in committee last week.'",
        "'speaker_3': 'This legislation, it will still benefit thousands of workers. That should be a moment where we all celebrate today. But to be honest, we also need to at the same time, recognize that the amendment that was passed in committee last week cuts out basic protections for thousands of other workers and sets a precedent that I hope will not'",
        "'speaker_3': 'replicate across this country. And I appreciate the amendment that was brought forward today so that we can continue to work on this policy area. We all know no policy is perfect, but when faced with the decisions, I think it's our belief and in my office that we always err on the side of listening to those who are'",
        "'speaker_3': 'on the front line, listening to those who have less power, listening to those who are in more vulnerable situations. And with the lived experience of being deprioritized, whether it's on platforms or deprioritized in terms of funding and protections and state and federal law, we need to continue to listen to those voices who have been on the front'",
        "'speaker_3': 'line. And we will not relinquish in our efforts to make sure that more workers are folded into these protections today. I appreciate everyone who has continued to call in and offer robust testimony and to explain how separate policy from marketplace workers will impact them.'",
        "'speaker_3': 'Looking forward to continuing this conversation throughout this year. As I know, council her will do have other pieces of legislation in the hopper and we'll look forward to the following conversations in 2023 as well as noted by the amendment.'",
        "'speaker_3': 'And thanks as well for the committee members for your support for the amendment that we put forward. Councilmember Hubble's and I put forward an amendment to make sure that we were looking at the implications for the budget this year and that we began a process of ensuring that there was additional conversations around drawing in revenue, especially in'",
        "'speaker_3': 'difficult budget year. So I look forward to building on this legislation and to celebrating all that workers were able to accomplish today without letting our eyes off the end goal of getting more workers included as well. So congratulations to everyone who has fought for pay up and thank you very much for all the work that you've done'",
        "'speaker_3': 'to incorporate so many different voices, ours included. And congratulations on this win today.'",
        "'speaker_1': 'OC House member Alice. Thank you. I am also excited for this legislation and the pieces that I know will be coming in subsequent weeks and months. We know that there's over 40,000 workers in Seattle who depend on work, particularly people with disabilities, people of color, immigrants, single parents, LGBTQ workers.'",
        "'speaker_1': 'And and these apps, while they do provide an opportunity for folks to find employment who might have challenges otherwise, they also shift all of the costs and all of the risk to workers and really leave them earning well below minimum wage after expenses.'",
        "'speaker_1': 'We know that a recent report found Seattle gig workers are getting paid just 958 an hour. 92% of jobs pay less than minimum wage. And we know that there has been an exploitation of a of a glaring loophole in our labor standards, simply calling workers independent contractors that these multibillion dollar gig apps have been able to evade'",
        "'speaker_1': 'basic protections. And that's the problem that we're trying to solve here. So the pay policy that is up for a vote today will close that loophole. It will ensure basic protection for thousands of workers by ensuring that they're paid at least minimum wage with other basic protections, regardless of whether somebody is cleaning a house or delivering food'",
        "'speaker_1': '. That's the goal, is to make sure that that regardless of the kind of app that they're on, we.'",
        "'speaker_0': 'Are protecting workers.'",
        "'speaker_1': 'And those who companies choose to call contract workers. So I think it's an exciting day. Seattle is leading the way by listening to gig workers, providing them what they need in these jobs, as I said, have the potential to be good paying jobs with important options for people who need flexibility.'",
        "'speaker_1': 'I do think it's important that rather than pass fair pay costs onto consumers, companies, some of which saw their revenues soar by close to 70%, this councilmember, Herbold said, should themselves pay the true cost of labor out of their own pockets and stop the exploitive model from becoming the new norm.'",
        "'speaker_1': 'I'm looking forward to supporting this, to supporting future legislation and continuing this conversation over the next year. I do want to thank my staff as well, Alexis, all of our and Silverdale who've been working on this with our colleagues and.'",
        "'speaker_0': 'Look forward to supporting.'",
        "'speaker_1': 'Thank you. Councilman Morales, I really like what you had to say, Councilor Nelson. Thank you very much. I support a minimum pay standard for delivery drivers, but I've always been concerned that setting the per delivery fee to high will lower demand, which could result in the consequences of reducing drivers overall income as well as the revenue.'",
        "'speaker_3': 'Of small.'",
        "'speaker_1': 'Businesses like restaurants. It could also disproportionately impact the most vulnerable customers, who also tend to be low income and might not be able to afford the fee. So I'm ambivalent about this legislation, but I'll be supporting it today because it's vastly improved from the bill that was introduced most significantly by Councilmember Peterson's amendment, which I supported, to'",
        "'speaker_1': 'remove.'",
        "'speaker_3': 'Marketplace companies from.'",
        "'speaker_1': 'Being covered by working Washington's proposal, because I believe their inclusion was an overreach. It made no sense to me to regulate apps used by service providers who set their own rates and negotiate directly with the customers to provide things like home health care, child care, pet care and help with household tasks.'",
        "'speaker_1': 'Just because those professionals use an app to reach some of their customers in places, I just really hadn't seen.'",
        "'speaker_3': 'Convincing evidence that the.'",
        "'speaker_1': 'Majority of them make under the minimum.'",
        "'speaker_3': 'Wage.'",
        "'speaker_1': 'So I ran as a pragmatist. And quite frankly, this this proposal has a long.'",
        "'speaker_3': 'History.'",
        "'speaker_1': 'And I believed it would pass. So I submitted several amendments and collaborated with my colleagues to minimize its negative impacts. Voting no would diminish their confidence that I can negotiate in good faith to improve future legislation, whatever it is.'",
        "'speaker_1': 'And so, well, that's what pragmatism is. And I'll be voting yesterday. Great. Thank you, Councilmember Nelson. And I like what you said, too. So I'm going to be supporting this. And I'll tell you why. I probably should tell everyone I like what they said, but I'll say I'll share with you.'",
        "'speaker_1': 'I'll be voting yes. But Councilmember Morales and Councilmember Nelson kind of hit the nail on the head for me. We have been dealing with the gig economy and I like what Morales said, and I've always felt this way.'",
        "'speaker_1': 'To some degree, it is a very exploitive model. And until we answer the question about whether or not a gig worker is an employee or indeed a contract worker, and we haven't addressed that straight on for the labor and for this economy and the people that actually take on these jobs.'",
        "'speaker_1': 'We're going to continually piecemeal in be trying to how to decide this works when we have a gig economy. I believe we're going in the right direction, that this is the shape of things to come because this is it's a labor issue and there's a surge about people who these are their jobs.'",
        "'speaker_1': 'And I think it is unconscionable that the and I'll just say that the bigger business companies have made billions of dollars during this during our pandemic. And if that's what it took, as you know, the pandemic has taught us many lessons, if that's what it took for us to get here, for people to recognize how much money'",
        "'speaker_1': 'these companies are making on people who they cannot do not have to call them employees. So what we have done as a city and a lot of other cities as well is take it upon ourselves as we should do as elected officials, to start deconstructing this economy and making sure that the people who are on the front'",
        "'speaker_1': 'lines, who we're delivering for, who are doing all those things, are compensated and are taking care of because that's our job. At the end of the day, is government officials, is to make people's lives hopefully better. So with that, we were handed over to you two closing remarks and then we'll call on the clerk to call the'",
        "'speaker_1': 'roll. Thank you so much. I really appreciate my colleagues excitement for the vote that we're about to take. In closing, I just want to read a couple sentences from the May 10th letter to counsel from the National Employment Law Project.'",
        "'speaker_1': 'They start talking about the history of the minimum wage. I quote The New Deal legislation excluded domestic, agricultural and temp workers from their wage protections of the Fair Labor Standards Act and systemically denied black people and workers of color the ability to earn the wages guaranteed to workers in industries dominated by white workers.'",
        "'speaker_1': 'And the legacy of this injustice continues today. More recently, venture capitalists running app based businesses deny workers the minimum pay and benefits that should be universal. As a city council itself recognize black and Latino, black and Latinx workers comprise a disproportionate share of the 40,000 individuals performing app based work in Seattle.'",
        "'speaker_1': 'The fact that app based workers are disproportionately immigrants and people of color reflects on the racialized exploitation within the app based delivery and marketplace industry. Indeed, the app based gig economy writ large functions on occupational segregation. Companies can get away with offering poor quality, unsafe jobs where workers have virtually zero legal protections on the job because for'",
        "'speaker_1': 'so many workers, there is simply no alternative. Far from offering economic opportunity, this business model deepens the desperation of underpaid black, Latin and other workers of color who have been shunted to the bottom of the economy. In closing, in addition to the stakeholder process I talked about earlier, the pay policy package has been discussed six times in'",
        "'speaker_1': 'a council committee, my council committee since July of 2021. I am just so honored to have had the opportunity to work with this growing workers movement who are determined to not be left behind. There's significant support for this legislation, including from the Seattle Restaurants United, a coalition of more than 240 small restaurant owners and operators.'",
        "'speaker_1': 'The Washington Local Housing Alliance. One America. Puget Sound Sage. Somali Community Services Al-Noor. Islamic Community Center. El Centro de la Raza Castle Latina. Asian Counseling and Referral Service. The National Domestic Workers Alliance. The National Employment Law Project. SEIU 775, SEIU six, the Transit Writers Union and the Labor Standards Advisory Commission.'",
        "'speaker_1': 'We will continue our work with additional legislation to cover issues such as restaurant access, anti-discrimination background checks, deactivation, and the creation of an advisory board. And I will continue to work with all stakeholders on the development of these policies.'",
        "'speaker_1': 'I want to thank Council. Members and their staff, specifically my co-sponsor, Councilmember Lewis and Camilla Brown from his office. I also want to thank the Office of Labor Standards, specifically Karen Le Virus and Lane Midha. I want to recognize the hard work of council central staff, specifically Carina Boal, Amy Gaw and Jasmine Marois.'",
        "'speaker_1': 'Finally, I want to thank Alex Clardy in my office. His work has been the driving force for the development of this legislation, and I want to thank him from the bottom of my heart for his time, diligence and attention to detail.'",
        "'speaker_1': 'I hope we can vote yes on this really important legislation today. Thank you. He also a verbal thank you for I. I normally don't do a bunch of thanks but I really want to thank you and your staff and essential staff.'",
        "'speaker_1': 'I know what it's like to get 16 amendments and try to accommodate and keep them all moving. So thank you and thank you and your staff and Alex and central staff and all the folks that did what they did.'",
        "'speaker_1': 'We got a running list of what the amendments were, which ones were passed, which one people abstained, how people voted. So thank you very much for this hard work. Okay. So with that, Madam Clerk, will you please call the roll on the passage of the amended bill?'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember Morales. Yes. Councilmember Mosqueda, I. Councilmember Nelson. Councilmember Peterson.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember Salant. Yes. Council member Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council President Juarez. Yes. Nine in favor. Nine opposed. Yay! Thank you. The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the amended legislation? Thank you. Okay. Moving on in our agenda to the adoption of other resolutions, there are no other resolutions for introduction in adoption today.'"
    ]
}