{
    "New Ballard Parking and Business Improvement Area Ordinance.": [
        "'speaker_1': 'Thank you. The bill passed and the chair will sign it. Please read the report of the Affordable Housing Neighborhoods and Finance Committee.'",
        "'speaker_4': 'To report the Affordable Housing Neighborhoods and Finance Committee agenda item one Capital 118 747 Establishing a new pilot parking in a business improvement area, levying special assessments upon owners of business, property, multifamily, residential property and mixed use property within the area, providing for the deposit of revenues in a special account and expenditures therefrom providing for collection of'",
        "'speaker_4': 'and penalties for delinquencies. Providing for the submission of a rate payers advisory board and providing for an implementation agreement with a program manager. The committee recommends the bill passes amended.'",
        "'speaker_1': 'Councilmember Burgess.'",
        "'speaker_5': 'Thank you very much. This legislation, as we've heard, establishes the Ballard Parking and Improvement District, the BIA in Ballard. It's one of the economic development mechanisms that we use in city government to allow neighborhood business districts to establish a variety of programs to address issues that they've identified as important to them.'",
        "'speaker_5': 'In this particular case, the Ballard Business Improvement Area is designed to accomplish eight objectives a clean environment, which includes sweeping of sidewalks, graffiti removal and advancing plans for a Ballard public restroom facility, advocacy on urban design and transportation issues that affect the Ballard Business Area.'",
        "'speaker_5': 'Business development and retention for businesses that are serving that community or may serve them in the future. Marketing and Promotion Activities. Promoting Ballard as a destination to live, workshop, eat or play. Public safety and health enhancements in the neighborhood.'",
        "'speaker_5': 'Programs related to education and network opportunities for individuals and for businesses. Promotion and management of the Ballard Seafood Fest, which happens every year and has been going for 40 some years in Ballard. And then finally, the management of the BIA and its financial and administrative obligations.'",
        "'speaker_5': 'Some speakers this morning indicated that they never received notice of the council's consideration of this matter. Notice was sent on August 22nd by the City Clerk to approximately 125 potential ratepayers in the area. That's 16 days before the public hearing was held.'",
        "'speaker_5': 'The public hearing was held in council chambers on September seven at 930 in the morning. One person spoke against establishing the ballot BIA. The committee recommends that this ordinance be approved.'",
        "'speaker_1': 'Any further comments or concerns? Councilmember O'Brien.'",
        "'speaker_5': 'Great. Thank you for highlighting all that. Councilmember Burgess. I've had conversations with a number of community members going back over a year now about this work, as we know, with business improvement areas throughout the city. There is a requirement for a certain threshold to be met and a lot of conversations to be had.'",
        "'speaker_5': 'We did hear today from some folks that have expressed concerns about their building being included. What I've heard on the street, my conversations with the folks in the area is is broad support for this. Today, we heard some folks highlight that they would like to see the boundary drawn a little bit differently.'",
        "'speaker_5': 'And what I know and I can share with my colleagues here is that the legislation around base does allow future expansion of those areas there. My understanding is there are folks that are outside the area that would like to be included in the future.'",
        "'speaker_5': 'It'll just take some time. I've talked to the folks at the Ballard Chamber and they have also an interest in doing that as it allows moving forward. What I can tell you is that there is a lot of growth happening in Ballard.'",
        "'speaker_5': 'There's a lot of opportunity in that neighborhood and a lot of challenges that come with it. And I really applaud the people that have come together and are willing to commit their resources to add to what the city is doing to help improve the conditions in the community.'",
        "'speaker_5': 'And I fully support this legislation. I want to remind colleagues that the the legislation talks about the different scales about how folks are charged, but there's a cap for a residential unit can be charged no more than $90 a year, $7.50 a month.'",
        "'speaker_5': 'So residential participants is relatively modest. This would raise nearly, I believe, $400,000 a year for community wide improvements.'",
        "'speaker_1': 'Any further comments from any of my colleagues? I'll just say that I'll be supporting this legislation. But some of the objections that I heard this this afternoon do concern me that I continue to think that the city should not do a bare minimum job of notice, that the notice is intended to create a discussion and a dialog'",
        "'speaker_1': '. Dare I say a negotiation. I trust that a lot of this was going on, but when I do hear I was barely complying with either the guidelines and I'm not sure that's what I heard. But I would like to be very proud of of solid outreach done by our departments.'",
        "'speaker_1': 'Even if we disagree with at least know that there was a forum by which the disagreements were vetted and they would move forward. So I'm very pleased to hear that there's still a process moving forward as we unfold.'",
        "'speaker_1': 'The Big I continue to think this is going to be very good for the neighborhoods and the businesses and the residents in this area. But again, I think lessons could always be learned when we establish these buys. No, the comments from any of my colleagues.'",
        "'speaker_1': 'Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Johnson. Suarez. O'Brien. Thanks, John Burgess. Gonzalez. President Harrell. All right. Seven in favor.'",
        "'speaker_1': 'Nine opposed the bill passed in the Senate. Please read agenda item number two.'"
    ],
    "Modification of Assessment Rates for West Seattle Junction Parking and Business Improvement Area.": [
        "'speaker_4': 'Agenda item to cancel bill 1.8 748 relating to the Seattle Junction Parking Business Improvement Area. Modify the assessment rates amending ordinance 113 326 as previously amended by ordinances one one 9530 9120 57 zero and 121 758. In accordance therewith, the committee recommends the bill passes amended.'",
        "'speaker_1': 'Councilmember Burgess.'",
        "'speaker_5': 'Thank you. The West Seattle Business Improvement Area was established in 1987 and this legislation in front of us today increases the assessment rate for all of the rate payers by 10%. Notice was also sent of this change and a public hearing was held at the Council on September seven.'",
        "'speaker_5': 'In this case, as well as the Balad BIA case, the advocates for this measure had to obtain signatures from at least 60% of the ratepayers. They did that. There was a notice published in the Daily Journal of Commerce in addition to the mailed notice.'",
        "'speaker_1': 'Thank you. Are there any further comments or questions that please call the role on the passage of the bill?'",
        "'speaker_2': 'Johnson Suarez. O'Brian. Bagshaw. Burgess Gonzalez. I President Harrell High seven in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passed in the chair was signing agenda item number three.'"
    ],
    "Historic Preservation Controls for Mount Baker Park Presbyterian Church.": [
        "'speaker_4': 'Agenda item three Council Bill 118770. Relating to historic preservation. Imposing controls upon the Mount Baker Park Presbyterian Church, a landmark designation by the Landmarks Preservation Board under Chapter 25.2 of the Settlement Civil Code and adding to the table of historical landmarks contained in Chapter 25.32 ceremonies.'",
        "'speaker_4': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Councilmember Burgess.'",
        "'speaker_5': 'Thank you. The Mount Baker Park Presbyterian Church was built in 1925. It's located at 3201 Hunter Boulevard South in the city's Mount Baker neighborhood. It was designated as a historic landmark in March of 2004. And this ordinance finally imposes the controls that the Landmarks Preservation Board has recommended for this particular property.'",
        "'speaker_5': 'This means that any changes to the site, the building exterior and portions of the interior must be approved in advance by the Landmarks Preservation Board.'",
        "'speaker_1': 'Thank you. Councilman Burgess, are there any further comments or questions? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Johnson. Suarez. O'Brian. Baker. Burgess. Gonzalez, i. President Harrell, i. Seven in favor and unopposed.'",
        "'speaker_1': 'The bill passed and the chair will sign it. Agenda item number four.'"
    ],
    "Compensation Program for Seattle Public Utilities General Manager/CEO.": [
        "'speaker_4': 'And I am for accountable 118804 relating to city employment. Creating a compensation program for the position of the Seattle Public Utilities General Manager, Chief Executive Officer specifying provisions for the administration of said compensation program and ratifying, confirming search and prior acts, the committee recommends the bill pass.'",
        "'speaker_1': 'Constable and Burgess.'",
        "'speaker_5': 'Thank you. This legislation creates a new pay band and a new title for the Seattle Public Utilities General Manager, Chief Executive Officer. As you know, SPU has just over 1300 employees and a budget on an annual basis of approximately $1 billion.'",
        "'speaker_5': 'As I mentioned, this legislation creates a new position known as the SPU general manager and chief executive officer. It makes this title and pay band generally the same as that of Seattle City Lights General Manager and Chief Executive Officer.'",
        "'speaker_5': 'The new pay band for this position is from $209000 to $335000. The City Council sets the pay band, but the city council does not set the specific salary. That is a decision for the mayor to make.'",
        "'speaker_1': 'Thank you. Are there any further comments? If not, please call the role on the passage of the bill.'",
        "'speaker_2': 'Johnson Juarez I. O'BRIEN Hi, Bagshaw. Burgess Hi. Gonzalez President Harrell high seven in favor and unopposed.'"
    ],
    "Employment Ordinance for Civil Service Status Changes.": [
        "'speaker_1': 'Bill passed in show sign it should not add a number five.'",
        "'speaker_4': 'Agenda item five Constable 118812 Relay City Employment commonly referred to as a third quarter 2016 Employment Ordinance designated positions as exempt from civil service status, returning a position to civil service status and ratifying confirming certain prior acts all by two thirds vote of the city council.'",
        "'speaker_4': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Councilman Burgess.'",
        "'speaker_5': 'Thank you. And I apologize for taking up all the airtime, but it's obvious that my committee got its work done this time around. This is the third quarter employment ordinance, which is a fairly routine piece of legislation that we entertain each quarter.'",
        "'speaker_5': 'It establishes four positions in city government is exempt from the civil service because these positions meet the exemption criteria set in the municipal code and it returns one position to the civil service that had been exempt previously but no longer meets the criteria.'",
        "'speaker_1': 'Thank you with any further comments. Please call the role on the passage of the bill.'",
        "'speaker_2': 'Johnson. Suarez. O'Brien. I beg Sharna Burgess.'",
        "'speaker_5': 'By.'",
        "'speaker_2': 'Gonzalez I President Harrell high seven in favor none opposed the.'",
        "'speaker_1': 'Bill passed into law was signed. Agenda item number six.'"
    ],
    "Seattle Fuel Gas Code Update and Repeal of Ordinance 124276.": [
        "'speaker_1': 'Thank you. Councilman Burgess, any comments? Those in favor of confirming the appointments vote i. I. Those oppose vote no. The motion carries and the appointments are confirmed. We'll hear the report of the Planning Land Use and Zoning Committee, but please read the short title of items 23 through 29.'",
        "'speaker_4': 'The Report of the Planning and Zoning Committee Agenda Items 23 to 29 Council 118776 relating to the sale of Fuel Gas Code Council 118777 Relating to the set of Plumbing Code Council 118778 relating to the existing building code council 118779 related to the sale energy code council 118 780 relate to Seattle Residential Code Council 1187.'",
        "'speaker_4': 'Eight one really into building code and cancel 118782 really into mechanical code. The committee recommends all these bills pass.'",
        "'speaker_1': 'Will move from the Burgess show to the Johnson Show. Council Member Johnson Thank you.'",
        "'speaker_6': 'Council President Yes, you're right. We were busy as well. Items 23 and 29 update our city's technical codes to conform to the national and state model code standards. We do this every couple of years and a few early adoptions of the National Code changes are expected in 2018 or Seattle.'",
        "'speaker_6': 'Specific changes that are included in these individual codes, which we'll be adopting individually. A couple of highlights of some examples of the kinds of actions that we're approving today removing requirements which conflict with our all gender restroom ordinance requiring rapid eradication prior to demolition, permit issuance to address public health concerns, requiring new dwellings to be solar ready'",
        "'speaker_6': 'by providing space for solar panel installation in the future. Clarification of smoke detector requirements in residential high rise building changes to the Energy Code to help us meet our climate action plan goals, etc. etc. Happy to speak to each of these individual codes of members would like me to.'",
        "'speaker_1': 'Are there any questions or comments on agenda items 23 to 29 hearing? Then we're going to vote on each one individually. Please call the roll on agenda item number 23 Council Bill 118776 Johnson.'",
        "'speaker_2': 'Suarez O'Brian. Bagshaw. Burgess. Gonzalez. President Herald. Hi. Seven In favor and unopposed.'",
        "'speaker_1': 'No pastoral assignment. Please call the roll on the passage of Council Bill 118777 and chin item number 24.'",
        "'speaker_2': 'Johnson Suarez O'Brien by pager Burgess Gonzalez President Harrell seven in favor and unopposed.'",
        "'speaker_1': 'Bill pass cheryl senate please call the roll call on an item number 25.'",
        "'speaker_2': 'Johnson Suarez O'Brien Bagshaw Burgess Gonzalez President Harrell High seven in favor and unopposed.'",
        "'speaker_1': 'Bill Pass and Cho assign it please call the roll call an agenda item number 26.'",
        "'speaker_2': 'Johnson Suarez O'Brien, Bagshaw, Burgess and Salas I President Harrell high seven in favor and unopposed.'",
        "'speaker_1': 'Bill passed and show of Senate Please call the roll call on an item number 27.'",
        "'speaker_2': 'Johnson Suarez O'Brien Major Burgess Gonzalez President Harrell high seven in favor nine opposed the.'",
        "'speaker_1': 'Bill passed in show assignment. Please call the roll call on agenda item number 28.'",
        "'speaker_2': 'Johnson Suarez O'Brien Bagshaw Burgess Gonzalez I President Harrell I save seven in favor and unopposed.'",
        "'speaker_1': 'Bill passed and show sign it and please call the roll call on the agenda item number 29.'",
        "'speaker_2': 'Johnson Suarez O'Brien Bagshaw Burgess Gonzalez I President Harrell high seven in favor and unopposed.'"
    ],
    "Revision and Update of the Living Building Pilot Program and Green Building Standards.": [
        "'speaker_1': 'Bill Parsons show was sign it all you read the next agenda item into the record. Did we cover number 30? Not yet. Yes. Please go to number 30.'",
        "'speaker_4': 'Agenda item 30 Council 118 783 relating to land use and zoning at a new chapter 23.58 of the citizens of a code and many sections 23.40 point zero 6020 3.40 1.00. 4.0 12 23.40 2.0. 5620 3.40 5.5 10.5 1620 3.40 8.0.'",
        "'speaker_4': '21.22 1.2 3020 3.40 9.3 11.0 32.1 80. 23.50 point zero 3320 3.60 6.1 40. 23.84 8.0 1420 3.80 8.0 ten and 23.90 point zero 18. And repealing SNC Section 23.40 5.5 26 and 23.40 9.0 22. Revised Living Building Pilot Program and reorganize, consolidate and Update Standards.'",
        "'speaker_4': 'When meeting the green building standard is a condition of permit, the committee recommends the bill pass as amended.'",
        "'speaker_1': 'Finally, Councilman Johnson.'",
        "'speaker_6': 'Thank you to our very capable city clerk. Council Bill 173 updates the Living Building Pilot Program and the Green Building Standards for Incentive Zoning, as I mentioned during council briefing this morning. We have two such buildings in the city.'",
        "'speaker_6': 'One is the Bullet Foundation Building, the bullet center on Madison in Capital Hill, and the other is the Stone 34 building just at the intersection of Stone Way and the Perkiomen Trail. This update to the pilot program, as you heard during public comment, responds to recommendations from a technical advisory group brought together by the Seattle Department of'",
        "'speaker_6': 'Construction and Inspections in response to a council resolution that we took up several years ago. The changes that were intending to pass today maintain the highest and. The program was also continuing to encourage participation. And let me give you a couple of highlights.'",
        "'speaker_6': 'Takes away some of the uncertainty of the program by allowing the incentives for participating projects by right as opposed to a variance, it allows the projects to participate by fulfilling the Living Building Challenge. Pedal Certification Program modifies the penalty for non achievement of certification and extends the enrollment period till 2025 or until 20 projects have participated.'",
        "'speaker_6': 'We had a near unanimous public comment on this throughout the several meetings that we discussed. These changes, as you heard from folks from the architecture community and from the Seattle 2030 district, a lot of support for this in the midst of what is really a building boom here in the city of Seattle.'",
        "'speaker_6': 'Disappointing to see that no current buildings are taking advantage of our Living Building pilot program. So my hope is that with adoption today, we'll start to see more folks adopt into the program in the very near future.'",
        "'speaker_1': 'Thank you, Katherine Johnson. Any comments or concerns or questions? Thank you very much. Please call the role on the passage of the bill.'",
        "'speaker_2': 'Johnson Maurice O'Brien beg John Burgess. Gonzalez, President. Harold I. Seven in favor.'"
    ],
    "Ordinance to amend the 2016 Budget for the Office of Arts & Culture and lift a proviso.": [
        "'speaker_1': 'Nine Oppose the bill pass and chair will sign it for the Civil Rights, Utilities, Economic Development and Arts Committee Fisheries Department.'",
        "'speaker_4': '34 Civil Rights, Utilities, Economic Development and Arts Committee Agenda 31 Council 118771 Relating to preparations for the Arts for the Office of Arts and Culture amending Ordinance 124 927, which is up to 2016 budget and lifting a budget proviso imposed upon the Office of Arts and Culture Capital Arts Budget Control level by Seattle City Council Green Sheet'",
        "'speaker_4': '47. Dash one, dash b-1. The committee recommends the bill pass.'",
        "'speaker_5': 'Councilmember O'Brien So this bill's follow up on budget work from last year. In 2016, the council approved a budget that included $1.5 million for three nonprofit cultural institutions $500,000 each for the Nordic Heritage Museum, the Burke Museum and Town Hall.'",
        "'speaker_5': 'At the time, we also adopted a proviso for that funding and waited for the Executive to provide the Council with contracts detailing the public benefits that would be delivered in exchange for the city funding. This bill provides three contracts for public benefits and would release the funds allowing the Arts and Culture, the Office of Arts and Culture'",
        "'speaker_5': 'to enter into separate contracts of $500,000 each with each of those three organizations.'",
        "'speaker_1': 'Thank you. Are there any further comments and thank you for pinch hitting comes from Brian.'",
        "'speaker_5': 'You betcha.'",
        "'speaker_1': 'Please call the roll on the part of the bill.'",
        "'speaker_2': 'Johnson. O'Brien. Bagshaw. Burgess. Gonzalez. I President Harrell I seven in favor and.'"
    ],
    "Property Rights Acquisition for Ship Canal Water Quality Project.": [
        "'speaker_1': 'Opposed the bill passed and chose signage. Maybe you could read the shorter version of it. You're not a number 32.'",
        "'speaker_4': 'Agenda item 32 Council 118 760. Relating to the sale of public utilities authorizing director of Public Utilities to acquire except at record of a have. The City of Seattle puts temporary permanent property rights for inviting property owners located along the alignment to plan combined sewage storage tunnel.'",
        "'speaker_4': 'The committee recommends the bill passes amended.'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_5': 'Thank you, sir. This this legislation is in and related to a CSO project in Ballater, a combined sewer overflow. The in this area of Ballard, there's a combined sewer system, which means that the stormwater runs into the sewer system.'",
        "'speaker_5': 'What that results in is in heavy rain events. It can overwhelm the sewer system, at least temporarily. The solution to this, and we're in our consent decree with the Environmental Protection Agency to deliver this in the next, I believe ten years is a combination of green stormwater infrastructure.'",
        "'speaker_5': 'So how we develop on the streets to capture that water and treat it naturally and also storage facilities. This specifically is a storage facility, the shape of the storage facility. This tank is essentially a tunnel that runs from Balad to Wallingford and it'll hold water and major rain events and delay the delivery to the sewer system until'",
        "'speaker_5': 'the sewer system has time to treat it. The majority of this tunnel is built under public right away, but there are a couple of parcels where a couple private properties that are affected by this. And so what this legislation does is allow us to have either permanent or temporary easements where the construction will overlap with private property'",
        "'speaker_1': '. Thank you. Any comments? Please call the role on the pastor of the Bill Johnson.'",
        "'speaker_2': 'Whereas O'Brien Bagshaw, Burgess Gonzalez High President Harrell.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Seven in favor and unopposed.'",
        "'speaker_1': 'Bill passed and chair of Senate Agenda Item number 33.'"
    ],
    "Ordinance on Recyclable and Compostable Bags for Solid Waste System.": [
        "'speaker_4': 'Agenda Item three three Council Bill 118805 Wellington City Council The Waste System Removing the sunset date for a five cent pass recharge for certain recyclable paper bags required certain compostable bags to be labeled and tinted green. Add a definition for compostable and amending.'",
        "'speaker_4': '21.30 6.110 Seattle Means Barcode. The committee recommends the bill passed as amended.'",
        "'speaker_1': 'Customer.'",
        "'speaker_5': 'O'Brien Thank you. So this legislation will update a bill that was passed five years ago in 2011, and that was the time in which the city council passed legislation to ban plastic single use plastic bags within the city and require that for folks switching to a paper bag that there would be a five cent fee charged the'",
        "'speaker_5': '$0.05 to be retained by the business that was giving out the the bag. That five cent fee requirement was to expire at the end of this year. This legislation would extend that indefinitely. This legislation also addresses one of the challenges we see around compostable bags.'",
        "'speaker_5': 'We like composting in the city. In fact, we require composting. But there's a lot of confusion in what types of plastic bags are compostable. I think a lot of folks are familiar with compostable branded plastic bags that we encourage people to use for managing their food waste.'",
        "'speaker_5': 'Those bags are often tinted green as a way to indicate that they are compostable. However, lots of other bags are also tinted green, and this is creating a lot of confusion among consumers. The confusion results in non compostable bags, regular plastic bags being put into the compost system.'",
        "'speaker_5': 'They're very difficult to remove. Often they can't be removed, little pieces of them contaminate the compost. It degrades the quality of the compost and sometimes means it's no longer compost and has to be rejected as waste. This legislation would require that bags that are not compostable not use the green coloring and also has a definition for what'",
        "'speaker_5': 'compostable is. It's consistent with the providers that provide composting in the region so that those bags will actually work in the system as intended.'",
        "'speaker_1': 'Thank you. Any comments? You know, Curtis, if it's leaking when you're carrying it, it's compostable. That's sort of the test.'",
        "'speaker_0': 'Of.'",
        "'speaker_1': 'All those in favor of, oh, it is a bill. Please call the role on the part of the bill.'",
        "'speaker_2': 'Johnson Suarez O'Brien Bagshaw Burgess Gonzalez, President Harrell.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Seven in favor and unopposed.'",
        "'speaker_1': 'Bill passed and the chair was Simon. Please read the next agenda item.'"
    ],
    "Relinquishment and Acceptance of Sewer Facility Easements at University Village.": [
        "'speaker_4': 'Agenda Item 34 Council 118806 Failing to sell public utilities declaring certain real property rights related to a sewer facility. Easement within property bounded by 25th Avenue, Northeast Northeast 49th Street, 30th Avenue, Northeast and Northeast 45th Street in Seattle as being surplus city's utility needs authorizing director of sale public utilities to relinquish such easement rights and to accept'",
        "'speaker_4': 'a new easement from University Village Limited Partnership for city owned sanitary sewer facility and ratifying confirming certain prior acts the committee recommends. The bill pass.'",
        "'speaker_1': 'Comes from O'Brien.'",
        "'speaker_5': 'Great. This is a fairly straightforward shift in easement. So the property in question here is under is at University Village. There are certain easements that the city has held where sewer lines for sewer lines in the past. Those easements are no longer needed.'",
        "'speaker_5': 'There's new easements that are needed, I believe, for realignment of sewer lines. And so this bill does both those. It relinquishes the easements that are no longer necessary and accepts easements where the new facilities are.'",
        "'speaker_1': 'Are there any further comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Johnson Suarez O'Brian by Bagshaw. Burgess Gonzalez. President Harrell. Seven In favor and unopposed.'",
        "'speaker_1': 'The bill passed in Charles Senate Agenda Item number 35.'"
    ],
    "Endorsement of Community Principles for Green Jobs and Sustainable Entrepreneurship.": [
        "'speaker_4': 'And item 35 Resolution 31712 Endorsing Community Principles for Green Jobs, requesting that the interdepartmental team on workforce entry and Employment Pathways incorporate strategies to advance green careers for people of color and other marginalized or under represented groups supporting sustainable entrepreneurship and economic cooperative models.'",
        "'speaker_4': 'Committee recommends that the resolution be adopted.'",
        "'speaker_1': 'Council Member O'Brien Thank you.'",
        "'speaker_5': 'I'm going to start by thanking the folks who stuck around through Agenda 35 and have been working on this for over a year. It's great to be here today. I am saddened that Councilmember Herbold is not here because she did a lot of work on bringing this legislation and deserves a lot of the credit, too.'",
        "'speaker_5': 'But I will do my best to speak on her behalf, in my behalf. I want to highlight well, first, let me just say that that is critically important, that we make sure that careers are available in the environmental field or in green careers for everyone in our community.'",
        "'speaker_5': 'And we currently have a system that doesn't allow that to happen. A couple of data points I want to read that came to me in the process of this legislation. There's a study out of University of Michigan that talked about something called the Green Ceiling, and it's a ceiling that keeps certain people from entering the environmental field'",
        "'speaker_5': 'or when they do enter green jobs, they're not they're not able to progress. One data point shows that people of color hold no more than 16% of positions in environmental organizations, agencies and foundations, and that once hired in environmental organizations, ethnic minorities are concentrated in the lower ranks, with less than 12% of the leadership positions held by'",
        "'speaker_5': 'people of color. What this does is it paints a picture of an ecosystem, if you will, a job system where we have very disproportional outcomes and we have white people able to access jobs and achieve higher ranks at a much higher rate than people of color can.'",
        "'speaker_5': 'And people in our community have done a lot of work around this and highlighted this is a priority and brought to our attention some of the challenges we have we heard about in comment today and in committee. Oftentimes to get jobs in these careers, you need to have experience.'",
        "'speaker_5': 'And how do you get experience when you don't have a job? What happens oftentimes is people who are able, financially capable of taking a free job, an unpaid internship, can work for free to build up their resume so they have access.'",
        "'speaker_5': 'But of course, there's a lot of people that don't have the financial support to take unpaid internships. They need to support themselves. And so what this resolution does is it calls upon the city to do a number of things to address these concerns.'",
        "'speaker_5': 'And hopefully, with the result being that we can make sure that everyone in our community has access to these green careers. The first thing it does, it asks the city to create a green job definition consistent with community principles outlined in the resolution.'",
        "'speaker_5': 'And I think it's powerful. So I want to read it here. A green job is one that preserves or enhances environmental health, as well as the economic and social well-being of people in communities, centers, communities most negatively impacted by climate change, and pays a living wage while providing career pathways.'",
        "'speaker_5': 'The resolution also calls upon an inter-departmental team to create an inventory of internships, apprenticeships and entry level jobs offered by the city of Seattle that meet the definition described above. Also, ask the city for examples of opportunities to create more local green jobs from our existing environmental investments.'",
        "'speaker_5': 'We make investments throughout the city, and those jobs and those investments should leverage the exact types of jobs we're hoping to create with pathways. Finally, this resolution expresses support for supporting sustainable entrepreneurship and encourages economic cooperative models of creating jobs not just at the city of Seattle, but partners in businesses throughout the city and throughout the region'",
        "'speaker_5': '. This was one of the highlights in the equity environment agenda that community members presented to us last fall and last spring, I should say, in the Council, and adopted the principles of those that agenda in August. This is a great step forward.'",
        "'speaker_5': 'It reflects a lot of really hard work on behalf of community members who who really want access to these green jobs. And we will all benefit when we create that access. There's still a lot of work to do, but it's a great step forward.'",
        "'speaker_1': 'Thank you. Councilmember Brian May for the comments. Councilmember Johnson.'",
        "'speaker_6': 'I just want to highlight one of the things that we spent a lot of time talking about last year on the campaign trail, and that's the and equity in terms of life expectancy in this city. It was really powerful to see that called out in the resolution today where a neighborhood that I represent, Lowell Hurst, an individual'",
        "'speaker_6': 'that grows up in that neighborhood, has a life expectancy of 30. Teen years, 13 years longer than someone who lives in South Park or Georgetown. I think that that is a credible statistic and reinforces, I think, the need for us to make sure that we're very equitably distributing resources throughout the city in terms of infrastructure and in'",
        "'speaker_6': 'terms of the continued support for the work that we are doing as a community to create more green jobs, green stormwater infrastructure and more investments to make it easier for folks to get around and live in our city.'",
        "'speaker_1': 'Thank you, Councilmember Johnson. I'd like to just say that, number one, the word pathways is very powerful, because when you think about a pathway, they just don't occur generically. There's usually an absence of a pathway in order for a pathway to.'",
        "'speaker_1': 'To get constructive takes. It's a fight takes it takes work, takes energy. And so this work that both the community has done really come and go with coming up with some really smart policy solutions in an area where there is action and whether that action is environmental sustainability or not relying on fossil fuels or even STEM education'",
        "'speaker_1': ', wherever there's opportunity, you are fighting for a pathway which becomes very, very powerful. So it's absolutely my honor to support this legislation and thanks for presenting it. Councilmember O'Brien. Any further comments? Those in favor of adopting the resolution vote i.'",
        "'speaker_1': 'I. Those oppose vote no. The motion carries the resolutions adopted and the chair will gladly signage. Okay. We got through all 35 agenda items. Is there any further business to come before the council? I'm looking my colleague on my left.'",
        "'speaker_2': 'Yes, thank you. I would like to be excused on December 5th.'",
        "'speaker_1': 'And we're going to second that. Okay. This moves in second to the councilmember backstab excuse from December 5th. All those in favor say I. I oppose. The ayes have it. Any further business from any other my colleagues? Well, that will stand adjourned.'",
        "'speaker_1': 'Everyone, have a great day.'"
    ]
}