{
    "Support for Initiative 124 on Hotel Employees Health and Safety.": [
        "'speaker_10': 'The report The Full Council Agenda Item one Resolution 316 95 Supporting City SEAL Initiative Measure 124 and urging Seattle voters to vote yes on Initiative 124 on the November 8th, 2016 general election ballot.'",
        "'speaker_0': 'Okay, just bear with me here. So as provided under state law, S.W. 40 217.8.555, the city council will now consider the adoption of Resolution 31695, which is basically a resolution dealing with hotel rates. It's a yes on initiative one, two, four.'",
        "'speaker_0': 'And at the conclusion of Councilmember comments, the Council will hear comments from members of the public who wish to speak either in opposition or support of the resolution. And an approximate equal opportunity to speak will be given to both opponents and from proponents.'",
        "'speaker_0': 'So having said that, will the clerk please read agenda item number one five.'",
        "'speaker_7': 'Please? You want to.'",
        "'speaker_10': 'Support.'",
        "'speaker_0': 'We have to some there's some other legislation we can do for that matter. You can turn around so we'll keep going through it. Please read.'",
        "'speaker_10': 'It. Supporting City Sales Initiative Measure 124 and urging Seattle voters to vote yes on Initiative 124 on the November eight, 2016 general election ballot.'",
        "'speaker_0': 'Okay. So. First of all, I'll move to adopt resolution 31695.'",
        "'speaker_7': 'Second.'",
        "'speaker_0': 'Okay. Before we actually move it, there's an amendment that needs to be done. So I'm going to move to amend Resolution 31695 by substituting the fourth, sixth and 11th recitals as provided on Amendment one on the agenda. Let me describe each recital.'",
        "'speaker_0': 'The first one I'll just read it is. Whereas providing housekeeping services can be difficult labor intensive work and can potentially lead to physical ailments or in some cases even injuries for housekeepers and sixth or recital. Whereas hotel workers, cleaning rooms and providing other services are often alone and potentially in a vulnerable position.'",
        "'speaker_0': 'And 11th recital. Whereas an issue of 1 to 4 would be a significant step forward in advancing Seattle's values of equity, inclusion, inclusion and genuine racial justice. And so those are the amendments that we want to substitute. Is there a second on those amendments?'",
        "'speaker_0': 'Are those in favor of the amendments? As I describe them, say I, I oppose the ayes have it. So. Okay, so we have an amended piece of legislation. Let me describe what initiative 124 that we agreed to put on the ballot does is there are several parts.'",
        "'speaker_0': 'At first it protects hotel employees, many of whom are people of color, many of whom are from the Immigrant Refugee Committee, many of whom are underrepresented in several groups. It protects them from violent assault and sexual harassment. So they would be required under this initiative to provide employers a hotel.'",
        "'speaker_0': 'Employers would be required to provide employees who work alone in a room, basically a panic button. Hotel employers must report accusations that a guest has committed an act of violence against an employee and maintain the records for five years.'",
        "'speaker_0': 'And any guest is accused of assault or sexual assault or sexual harassment may not return to the hotel for three years. Here in the city of Seattle, each guestroom will have a sign advising that the law protects its employees, its hotel employees from violent assault and sexual harassment, and that these employees have panic buttons and employees reporting'",
        "'speaker_0': 'an act of violence by a guest will be assigned a different floor or worker and be given paid time to contact the police. Consult a counselor that's part one. Part two protects hotel employees from injuries. So we want to reduce the initial says reducing workplace injuries by limiting an employee to 5000 square feet of a guestroom claims'",
        "'speaker_0': 'per 8 hours a day. Part three provides access, improved access to medical care for low income hotel employee. So in order for employees to afford family medical coverage, large hotel employers must pay full time, low wage employees by the 15th of each month, in addition to wages or salary, either $200 or the difference between the monthly premium'",
        "'speaker_0': 'for the lowest cost gold level policy available on the Washington Health Benefit Exchange. And 7.5% of the amount of employees wages exceeds 100% of the federal poverty level. The fourth part is preventing disruptions in the hotel industry. So when a hotel ownership changes, the outgoing employee shall, within 15 days, provide the new owner with employment information on'",
        "'speaker_0': 'his current employees. And the incoming hotel owner shall maintain a preferential hiring list of current employees and hire from that list from the date of ownership transfer to six months after the hotel is under the incoming employer and the fifth part is enforced in compliance with the law, that we make it very clear the initiative does that'",
        "'speaker_0': 'retaliation is prohibited. Employers may not interfere with any employer's employees rights under the law or discharge or discriminate against employees asserting their rights. There's a there's a employees have a private right of action to enforce these rights and are entitled to costs, reasonable attorney's fees and expenses if they prevail.'",
        "'speaker_0': 'So that's this part and parcel of initiative 124. Certainly there are more to it, but I tried to capture the major parts. So. At this point. I will ask any of my colleagues before we do the public hearing part.'",
        "'speaker_0': 'Do any of my colleagues have any statements they liked about Initiative 124 Bill before I open it up for public hearing? I see no hands going. Do anyone? Councilmember Johnson, please.'",
        "'speaker_12': 'I just want to say thank you to the folks at Unite Here Local eight for working really hard to put this measure on the ballot. They gathered an additional 10,000 signatures about plus what was required to make it to the ballot.'",
        "'speaker_12': 'And their efforts then and now to get this measure passed are crucial for building power for workers across the city, in and beyond the hotel industry. So I want to say thank you to unite here locally for their hard advocacy.'",
        "'speaker_0': 'Thank you, Casper Johnson.'",
        "'speaker_1': 'So I have one, two, three.'",
        "'speaker_0': 'Four, five, six, seven, eight, nine, ten, 11, 12, 13. So I am going to declare that I have 13 speakers. So we're going to have will now take comments from those who wish to speak in opposition or support of the resolution I described.'",
        "'speaker_0': 'The time allocated for these comments will be 15 minutes and speakers will alternate between opponents and proponents. And so I have folks that are proponents. I'll start off with first. So we're going to go with Corinne Barragan.'",
        "'speaker_10': 'How much time for.'",
        "'speaker_0': 'Each and each break will have? One minute. And Kareen, you are on and you have one minute. Pleased to hear from you. Oh. Started over. That's on 30 seconds. I'm sorry. Just one sec. You only have the.'",
        "'speaker_3': 'Oh, God.'",
        "'speaker_0': 'Please, God. So we will. We will probably in 20 minutes. 50 minutes.'",
        "'speaker_7': 'Are you supporting a hotel or just 20 minutes?'",
        "'speaker_10': 'And then we'll get back to you. Oh, Allah. My name is Guarino Barragan Alarcon and I work at Casa Latina as a program manager of the Worker Rights Enforcement Project. I would like to see my time for Ernie Burton, but I would like to say that Casa Latina is in support of Initiative 124, and we urge you'",
        "'speaker_10': 'to vote in favor. Thank you.'",
        "'speaker_0': 'Thank you. Okay. So before you begin, I'm going to ask, is there anyone who would like to speak in opposition of. At this time, I'm going to go back and forth as the rules require. I don't see anyone and I haven't signed up.'",
        "'speaker_0': 'So you're out.'",
        "'speaker_7': 'Hi, my name is Ernie Burton and I work at the Edgewater Hotel and I have worked in line to turn down for six years. I have been a union member for 40 years. That has all allowed me to raise my son as a young mother.'",
        "'speaker_7': 'But I am not. Everyone has the union rights like I initiated to vote will help protect all who work in the downtown Seattle Hotel. I was part of the civil rights movement growing up in Louisiana. TPO is definitely a civil rights issue.'",
        "'speaker_7': 'We need justice for all. I am past the retirement age, but I still work because I need health care insurance. Just $50 per month provides me with great coverage. Three years ago I fell and broke my wrist and got a shoulder contusion while on my way to work.'",
        "'speaker_7': 'My insurance covered a lot of my medical bills. The union benefit helps me pay my bills while I was out of work. I believe everyone deserved to have affordable health insurance. The phone would provide that. You're. Wanted to meet coworkers because I reply a lot of work to sit back.'",
        "'speaker_7': 'Can you? It would be hard for me to go out and find a job. The company that owns the hotel buys and sells hotel the time and we want to know our job and see if that happened to us.'",
        "'speaker_7': 'And when I quote to provide basic job security.'",
        "'speaker_0': 'Thank you, ma'am.'",
        "'speaker_7': 'The two cars that were introduced in and voted on a resolution to support.'",
        "'speaker_0': 'Doing it well. Thank you, Monica. It made their mind na nay. And they. Monica. And following Monica will be Zachary. Walking. Morgan. Morgan.'",
        "'speaker_2': 'Hello. My name is Monica NG and I'm here representing the Asian Pacific Islander Coalition of Washington State in King County alone. We have over 30 different API.'",
        "'speaker_10': 'Organizations and we would like to show support for this.'",
        "'speaker_2': 'Initiative. 124 But it actually like to cede my time to a hotel worker at a Calderon for the rest of my time. Thank you.'",
        "'speaker_5': 'Hi. My name is Ida Calderon and I work.'",
        "'speaker_2': 'In room service at a hotel in the area I support I 24 because I have experienced a lot of sexual harassment as a woman entering rooms by myself to deliver.'",
        "'speaker_3': 'Food. I've walked into a room.'",
        "'speaker_2': 'Where a male guest was not wearing any pants, so I mainly left and waited outside for him to put some clothes on.'",
        "'speaker_5': 'Once, a male guest ordered 14 shots of whiskey and told me to put on a little French maid outfit and join him in his room. I've seen guests running around the hotel with just a towel or a sheet covering their body.'",
        "'speaker_5': 'I once had to deliver a food to a guest who was just wearing a blanket, and I felt uncomfortable not knowing.'",
        "'speaker_2': 'If he would physically trap me or not. A panic button would really help me by letting security know where I am located to come and help me as soon as possible if there was a dangerous incident. We have the rights as.'",
        "'speaker_10': 'Human beings to not be hurt on the job and to be safe.'",
        "'speaker_3': 'Happy and secure at the.'",
        "'speaker_2': 'Workplace. My health insurance is also important to me. Both my husband and I have.'",
        "'speaker_5': 'Had major injuries in the past and the coverage is great. My daughter is also on my insurance. Everyone who works in the hotel.'",
        "'speaker_3': 'Deserves to have affordable coverage. Thank you, Mayor.'",
        "'speaker_5': 'Marie and City Council for introducing. But I want to.'",
        "'speaker_0': 'Thank you can. Zachary. Zachary, Steve. I don't see Zachary. I go to Leonard Smith. I'm following Leonard Smith as Stefon. MARRITZ Leonard, head to the OC. Stefon and then following Stefon March would be Eleanor Perez.'",
        "'speaker_1': 'Good afternoon. Council members. I'm also speaking on behalf of the King County Labor Council on the grant had to leave but the Labor Council has made initiative 124 the top priority for this fall's campaign season. So I want to thank Mayor Murray for introducing this resolution and for allowing us the opportunity to testify.'",
        "'speaker_1': 'Hotel housekeepers are cleaning bedrooms without any protection, no security guards standing by, no general public watching, no surveillance cameras and initiative 124 will provide hotel housekeepers with a panic button to immediately call security so bad circumstances can can be prevented.'",
        "'speaker_1': 'Surveys this year show that as many as 53% of women working as hotel housekeepers have been subject to growth sexual behavior by male hotel guests. Housekeepers will have the right to know when a known harasser returns to their hotel to protect themselves.'",
        "'speaker_1': 'And under certain circumstances, guests will be asked to leave and not return to that hotel in the future to keep workers safe. That is the least we can do. Also, housekeepers clean, oftentimes more than 20 rooms a shift.'",
        "'speaker_1': 'That's lots of injuries. And 124 provides reasonable workload standards that are.'",
        "'speaker_8': 'Elena Perez, followed by.'",
        "'speaker_0': 'Howard Green at our Greenwich Village next week.'",
        "'speaker_10': 'Hi, my name is Elena Perez with UFC W Local 21. We are representing in the state of Washington 45,000 members who work in grocery, retail, health care and other industry jobs. And on behalf of our 10,000 members who live or work in Seattle, we are here in strong support of Resolution 31695.'",
        "'speaker_10': 'Thank you to Mayor Murray for introducing the resolution, which supports local hotel workers and their upcoming ballot initiative. 124 Council members. We urge you today to vote in support of Resolution 31695. Among the basic standards expected of all employers, the very least that we should be mandating is safety on the job.'",
        "'speaker_10': 'Nine times out of ten guests in our local hotels are respectful and law abiding, but our local hotel operators should still be providing the equipment and protocols necessary to keep workers safe from injury, harassment and assault. More and more often, hotel workers are being forced to work faster and leaner.'",
        "'speaker_10': 'This results in injury rates and them working alone. Initiative 124 is a common sense solution. Please vote yes.'",
        "'speaker_0': 'Thank you. Four Before you begin, Mr. Greenish. Are there any speakers opposing one? 24. I'll give them the opportunity to speak right now. David, you could come here and you can sign a sheet here. Can you actually sign this sheet?'",
        "'speaker_0': 'And I don't know if that was one is four and one. And so so have any opponents of it saying that she will alternate time as the rules require.'",
        "'speaker_10': 'I'll sign it after. Is that okay?'",
        "'speaker_0': 'That's. That's fine. So I'm going to scrape you off there. This one here. That's what you're asking me to do. Go ahead, Miss Hinkle.'",
        "'speaker_10': 'Hi, everybody. I'm speaking to you on behalf of the local hotel community, and we are asking you not to support the resolution endorsement. 31695. Our local hotels are proud to be progressive members of and contributors to this community.'",
        "'speaker_10': 'We care deeply about ensuring a safe, healthy and supportive work environment for all our employees and are committed to protecting our employees every day. But I want 24 is about much more than safety. It has major flaws. And as you may know, deep legal concerns, including conflicts with state and federal law and blacklisting of guests without due'",
        "'speaker_10': 'process. We're also very concerned about the insincere carve out included for unions. I went 24 as a policy written in isolation. There was no collaboration with hotels, hotel associates. Local and state agencies are experts. As a result, it is vague and unfunded.'",
        "'speaker_10': 'There are more straightforward ways to protect our employees. We ask you not to support the resolution moving back.'",
        "'speaker_0': 'Moving back to the support. Moving back to the support of the rezone should be Howard Greenwich.'",
        "'speaker_7': 'Good afternoon, council members. I want to thank thank you and the mayor for your leadership in supporting initiative 124. Four years ago, SAGE published a report on the painful working conditions for healthcare workers in Seattle borne disproportionately by women of color and immigrants and refugees.'",
        "'speaker_7': 'You can find it on our website. We recognize that not all hotels are bad places to work, and many hotel employers care about exposure of workers to safety and health risks. But we need AI 124 to bring up the standards for all hotels and to advance racial and social justice in Seattle's workplace.'",
        "'speaker_7': 'Given the other item on your agenda, I want to highlight that before the era of mass incarceration and the war on drugs, the hotel and hotel industry was a viable union career opportunity for many African-American workers. It can and should be again.'",
        "'speaker_7': 'We must end the new Jim Crow. In addition to supporting I Want 24 weeks, we urge you to oppose the north north precinct resolution today. Thank you. Thank you.'",
        "'speaker_0': 'When we like to speak in opposition to measure 124 at this point. That's the opposition list. I can't read it from here.'",
        "'speaker_7': 'Do you think.'",
        "'speaker_0': 'Mr. Watkins, you are up, sir.'",
        "'speaker_7': 'Afternoon. Counsel, I just want to share a letter. This two individuals that I mentioned that have come out of the incarceration system or the criminal justice system. And I just want to share a little letter I received on Thursday from one of the guys that I'm entering, and I am a hotelier.'",
        "'speaker_7': 'David, how are you doing? I hope that all is well. And you are my family are in excellent health and spirits. As for me and my family, we're doing great. Great work has really kept me busy, even more so with the added response of being a manager running a stand.'",
        "'speaker_7': 'You are so right about hard work paying off and I will continue to thank you for the time and assistance because it has really turned things around for me. I just celebrated my 49th birthday. It was my first time as a free man in 22 years.'",
        "'speaker_7': 'I feel blessed to be in the position with a season is over. I'll be working on the weekends at Central Lincoln Husky Stadium, so I'm in the process of looking for a weekday job and purchasing a worker because having one vehicle is tough on my wife.'",
        "'speaker_7': 'And, well, I believe that I've written you a written you a novel. So take care and have a good day and I'll be on my you be in touch. Respectfully, this is just one of two individuals that I'm supporting that's come to the criminal justice system.'",
        "'speaker_7': 'I asked you to oppose 124 on the other things that we do in hospitality to take care of the community.'",
        "'speaker_0': 'Thank you. Thank you. Moving to the.'",
        "'speaker_7': 'Supports.'",
        "'speaker_0': 'Moving to the support list, I have Gina Owens of Gina Owens on the sports science unit here. So if Gina Owens is not here to support side. Irma. Arlene. Mike. Tuba. Irma. Arlene here. Not seeing Irma. Leon's not here?'",
        "'speaker_0': 'No. She coming? Cain. Or Eugene or Molly, and I call it Tuna. Okay, you're up. Please proceed.'",
        "'speaker_9': 'Hi. I work for the hotel for 12 years in downtown Seattle. I work for 64 hours as a room service and a server. I've been doing this job for 12 years and my sister just got harassed a couple months ago from the guest that asking her.'",
        "'speaker_9': 'I came downstairs to the lobby. I was working at the room service. She's working as a night added. The guest came up to her, asked her to do look for prostitute on him and then he said my sister said it's not part of my job.'",
        "'speaker_9': 'And then the guest went to the internet and find an Asian Chinese. And we both Filipino and my sister and the guest was telling that the that my sister he wants a Filipino a prostitute. And he's really insulting me and my sister that we're Filipino.'",
        "'speaker_9': 'And. And one thing to happen to me yesterday, I guess throw a key on me in my face and it's really hurting me because the guest was key is not working. And I was working with the front desk to charge the guest room and then the guests just throw the key on me and say my keys not'",
        "'speaker_9': 'working. This is the third time. And then he's not.'",
        "'speaker_8': 'There any speakers in opposition?'",
        "'speaker_0': 'Speakers in opposition to measure 124 that we have not heard from. I go back to the pro side, that'd be Lana Roach Salo. Tory. Okay. You're up, right. And then following you will be Zach Claflin.'",
        "'speaker_2': 'Hey, council members. Hi. Laurie for allyship again. We stand. We want to thank you for introducing this resolution in support of Initiative 1 to 4, which will improve the lives of hotel workers and protect them from sexual harassment.'",
        "'speaker_2': 'Hotel workers often are disproportionately women of color, and also there are a lot of LGBTQ individuals working in hospitality, and we wholeheartedly support this initiative and we stand in solidarity with them and all workers who deserve safety and dignity at work.'",
        "'speaker_2': 'Also, take my last 30 minutes just to remind them that like 50 minutes, 30 seconds. Ari, we respect the agenda. Thank you so much for having the space to support the hotel workers. We also would really like to know when the council members go back to addressing the issues of the MCR.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_7': 'Thank you. Is Zac.'",
        "'speaker_0': 'Claflin here? Zac Claflin and then have a Nicole Grant's. Is Nicole here? And C Nicole should leave. Okay. Are there any other speakers in opposition to measure 124 who did not have an opportunity to sign opposition 124. Okay.'",
        "'speaker_0': 'Not seeing anyone in opposition to I came close to public comment on initiative measure 124. It has been moved in second and before we vote on it, I'm going to ask any of my colleagues if you have any comments you'd like to make.'",
        "'speaker_0': 'Councilmember Burgess.'",
        "'speaker_4': 'Thank you. After the King County elections certified the signatures on Initiative 124, the Council on August 1st voted unanimously to place Initiative 124 on the November ballot so Seattle voters could decide whether adopted as law or to reject it.'",
        "'speaker_4': 'After our discussions at City Council and our decision to send it to the voters, we we carefully wrote that referral to the voters without taking a position. We did not state whether it should be adopted or rejected. We remained neutral.'",
        "'speaker_4': 'And I believe that that's where we should remain today. And for this reason, I will be voting no on the resolution.'",
        "'speaker_0': 'There any further comments? Councilmember Beck.'",
        "'speaker_5': 'Yeah. Thank you very much. I am supporting this today. But there is one thing that I would like to add, and that is to request our hotel owners and our workers union that are proponents of this initiative to work together to devise protocols between now and the end of the year on how a hotel worker can identify'",
        "'speaker_5': 'a guest or someone who's in the hotel that you believe has harassed or worse of you. I would like to be able to record any allegations of violence, including assault or sexual assault, sexual harassment by a hotel guest.'",
        "'speaker_5': 'And then it would be in everyone's interest to know how that hotel guest could respond. I think that's the one of the issues in this particular initiative that concerns me. It's a little vague, and I think that's something that we could work on collectively.'",
        "'speaker_5': 'I will be supporting it, but I would encourage, again, our hoteliers and our workers to address that particular issue.'",
        "'speaker_0': 'Any other comments from any of my colleagues? Comments from Gonzalez.'",
        "'speaker_2': 'Thank you. Council President. I am in similar fashion to the remarks I made when we originally voted on putting this on the ballot. I'm going to state again that this one's a no brainer for me. It's it I think it is important to stand with our hotel workers as someone who at once upon a time worked three'",
        "'speaker_2': 'jobs to pay for college. I also had the experience of working in a hotel and you know, and had had the privilege because I spoke English of not having to clean the rooms, but having the luxury of working in the reception.'",
        "'speaker_2': 'But I understand that these are real struggles for our workers. It reminds me of when I worked as a migrant farm worker in terms of the work load components, in terms of the risk to injury, in terms of how.'",
        "'speaker_10': 'Hard.'",
        "'speaker_2': 'These women work to be able to put food on the table for their families. So I am going to proudly support the resolution. I am not only going to support the resolution, I have also already endorsed initiative one, two, four and am one of the signatories, along with Senator Pramila Jayapal and a Nicole Grant with the Martin'",
        "'speaker_2': 'King with I'm sorry, with Martin Luther King County Labor Council in submitting the ballot argument in favor of passage in November. So I hope that that we have the votes today to be able to pass on our official position as a city council that we support protecting protecting women, particularly women who work so hard, particularly immigrants and'",
        "'speaker_2': 'refugees who serve those who have the greatest privilege of paying to stay in our city.'",
        "'speaker_0': 'Thank you. Councilman Gonzales, any further comments? My colleague. Okay. At this point, I'm going to call for a vote. Those in favor of adopting the resolution as amended, vote i, i. Those opposed vote no.'",
        "'speaker_7': 'No.'",
        "'speaker_0': 'The motion carries. The resolution is adopted as amended, and the chair will sign it.'",
        "'speaker_8': 'Next agenda item, please.'"
    ],
    "Ordinance to amend Seattle Municipal Code for Sister Cities program.": [
        "'speaker_0': 'Exigent item, please.'",
        "'speaker_10': 'Agenda item to cancel 0118 754 Relating to International Affairs and the Seattle Sister Cities Program amending section three point 14.4. 40.4 50.4 69.4 74. Code held August 8th, 2016.'",
        "'speaker_0': 'So this point on this agenda item I move to amend counts bill 118754 by substitute version four for version three A and just so you know, you may recall that I held this just because there were some typos in the first version so that the new versions are second to remove and second to amend.'",
        "'speaker_0': 'Council Bill 118754 Any further comments? All those are in favor of the amendment for I. I oppose. No. Okay. So what this legislation does very quickly is it broadens the scope of our Sister Cities program. You may recall the we have 21 sister cities across this world.'",
        "'speaker_0': 'In 1957, it started in Kobe, Japan, and they formed one of the first such AC relationships. But there's been a moratorium on the sister cities for quite some time. And we have a waiting list, if you will, to add sister cities with emerging cities around the world.'",
        "'speaker_0': 'So what we're trying to do here is expand its size and its scope to address issues, to strengthen our Sister Cities program. And I sort of had gone over this at the briefing with you, so I won't waste time in diving too deep in.'",
        "'speaker_0': 'And so basically we're changing its name and changing its scope from its is going from 20 members to 30 members. And we're looking at the scope to make sure we strengthen our cultural ties, particularly with those cities that have been sort of boxed out because of the moratorium and any further questions in this legislation.'",
        "'speaker_0': 'So this is a bill, so please call the role on the passage of the amended bill.'",
        "'speaker_2': 'Burgess. Hi. Gonzalez. Herbold. Johnson. Suarez. O'Brien. Shire President Harrow.'",
        "'speaker_0': 'High.'",
        "'speaker_10': 'Seven in favor.'",
        "'speaker_0': 'Hey, O'Brien, give me his proxy. Can you count that in record?'",
        "'speaker_1': 'No, I can't do that. Okay.'"
    ],
    "Mandatory Housing Affordability for Residential Development Ordinance.": [
        "'speaker_0': 'Please read the next report. And by the way, we're getting there. We just have an agenda. We'll get there. We'll get there. We'll get there for you to read the next report. We've already admitted our agenda. So we got the report.'",
        "'speaker_10': 'The Planning Lenses and Zoning Committee Agenda Item three Cancel 118 736 relating to land use and zoning at a new chapter 23.58 See how the ceremonies have occurred to establish the framework for mandatory housing affordability for residential development and amending Section 23.30 4.00 for subsection 23.40 point zero.'",
        "'speaker_10': '20.8 23.70 6.00. Six point B and .03 to point B. Sections 23.90 .002 and 2.0 15 and subsections 0.18 points. C SNC Can we recommend Civil Pass as amended?'",
        "'speaker_0': 'I'm sorry, I didn't actually read the church version. My apologies. Councilmember Johnson.'",
        "'speaker_12': 'Thank you. Council President Harrell As you are aware, this piece of legislation will require all residential development in the city to either pay a fee to build more affordable housing or to build affordable housing on site. I'm very excited to bring this piece of legislation forward today, but before I speak to the bill, we have two small'",
        "'speaker_12': 'amendments. And may I suggest that now that Councilmember Bryan is back, we start with his amendment.'",
        "'speaker_0': 'Senator, in your timing, you have an amendment, I believe, to the section one one.'",
        "'speaker_13': 'Great. Thank you, Councilmember Johnson. I'll go ahead and move amendment number 1/2. But amendment number one does it corrects a typo that we caught in the process. If you look at the amendment, you can see where they changed the language specifically.'",
        "'speaker_13': 'We had always intended to refer to looking at the pin payment in lieu fees and how they affected projects inside of the downtown South Lake Union area. We actually had put outside in there and so this would correct that.'",
        "'speaker_0': 'So the bill has been moved. The amendment has been moved in second. And all those in favor of the amendment bill I, I opposed. The ayes have it. So it is a minute in that sense.'",
        "'speaker_12': 'So Council President Harrell I've got a Second Amendment that as you know, the establishment of the framework legislation is subject to our 36.7 a .50. Our legal team has requested that we amend the ordinance to include a findings of fact which demonstrates how our program meets the requirements of the our CW, including facts related to our affordable'",
        "'speaker_12': 'housing need, and outlining how the proposed program will operate in accordance with state code. The amendment is proposed to insert a new section into the ordinance to attach the findings of fact. And I'd like to move Amendment two to amend Council Bill 118736 by adding new Section one and titled The City Council hereby makes the findings of'",
        "'speaker_12': 'fact an attachment add to this ordinance.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'Second. So a Second Amendment has been proposed by Councilman Johnson in the other questions on the amendment. All those in favor of the amendment vote i. I opposed. The ayes have it. So we have an amendment piece of legislation with two amendments.'",
        "'speaker_0': 'Councilmember Johnson, you.'",
        "'speaker_12': 'Wouldn't mind allowing me to speak just for a few minutes on the underlying bill? Council President Harrell I want to first start by saying thank you to the members of Washington. Can LGBT, LGBTQ allies ship as well as Puget Sound Stage for showing up today to testify in support of this program?'",
        "'speaker_12': 'This program is critical for the success of our city. As you're aware, rising housing costs in the city are having a real impact on our residents. Over 40,000 of our households are paying more than 50% of their income in rent.'",
        "'speaker_12': 'We know this burden is experienced even more acutely by communities of color. We hear from residents every day who are struggling to afford to stay in the city of Seattle, where they move away from their families, from their places of worship, from their schools, to get the services that they need, they need to be able to afford'",
        "'speaker_12': 'to live in the city. We must address the tools with all the available tools in front of us. And I think this is a critically important tool in order to build out 6000 affordable units towards our goal of 20,000 new units over the next ten years.'",
        "'speaker_12': 'We had a great discussion over several months around this legislation. We heard from many folks who in the community emailed, called or stopped by our hearings or our public meetings, and we made some significant changes to the legislation.'",
        "'speaker_12': 'And I want to thank in particular Councilmember Herbold and O'Brien, who spent a lot of time working with me on this legislation. One of the elements that we heard is that the community was interested in seeing a greater percentage of the units that will result from this program being built in the neighborhood.'",
        "'speaker_12': 'So we amended the legislation to include that. We heard that the community would like the term of affordability to last longer. So we amended the term from 50 years to 75 years. We heard from the community that they wanted us to do a better job of allowing folks who are renting in that building when it gets converted'",
        "'speaker_12': 'into homeownership, be offered the opportunity for first rate refusal to stay in their building and purchase those units. We, I think, really heard from the community about how they want more accountability and reporting. So we changed the timeline to advance how early reporting, to understand how the program is really working as it's intended to.'",
        "'speaker_12': 'This bill is a culmination of years of dedication from advocates in the community who have been fighting for more affordable housing in the city. I was proud to shepherd this through the city council. We've still got a lot of work in front of us.'",
        "'speaker_12': 'This bill doesn't actually change any zoning codes today, but what it does do is it provides an important framework to ensure that every new residential development the city will either pay a fee into the Office of Housing to build more affordable housing or build more affordable housing on site.'",
        "'speaker_12': 'I'm proud of this piece of legislation and encourage my colleagues to vote yes.'",
        "'speaker_0': 'Thank you, Councilman Johnson. Any further comments on Council Bill 118736? Councilmember Herbold.'",
        "'speaker_6': 'Thank you. So this legislation is definitely historic in that we will, for the first time require developers to contribute to affordable housing whenever they build. That's that's a really big deal. I want to highlight the other sort of historic nature of this bill.'",
        "'speaker_6': 'For the past 30 years, housing advocates have been trying to get displacement mitigation recognized. The amendments that we worked on to this bill, I think, takes a really important step towards towards that effort. Councilmembers O'Brian and Laquita were the first to encourage the city in 2014 to discuss and study how development left unregulated, regulated without some level'",
        "'speaker_6': 'of mitigation can impact vulnerable communities. Before that, displacement was largely unrecognized as a result of development. We know that between 25 and 2015, the city permitted the demolition of almost 6000 units of housing. We don't know how many of them were affordable and we don't know how many of them were rental.'",
        "'speaker_6': 'But we do know that those were units that were contributing to our our housing. Dock. Since older buildings are more likely to be affordable than new construction, this inevitably has been an impact on our our affordable housing stock.'",
        "'speaker_6': 'The. The efforts of this amendment, I think, are small and incremental. They will not stop housing demolition in the city, but it is an important recognition that a racially inclusive and affordable city will mean taking steps to not lose what affordable housing that we already have.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Katherine Herbert. Any further comments from any of my colleagues? Council Member O'Brien.'",
        "'speaker_13': 'Now, I'll just briefly want to also thank council members Johnson and Herbold for your great work on this. This is an outstanding piece of legislation that I'm very excited to support today. For the reasons you've heard before, requiring that all development contributes to affordable housing in the city is a great step forward.'",
        "'speaker_13': 'Also, the work around addressing displacement. The language in this bill, I think is a great step forward. There's a lot of good language in this bill, but until we do further actions both around how we address displacement and the zoning changes needed to necessary to make this implemented, it'll just be language.'",
        "'speaker_13': 'And so I'm proud and excited to stand with my colleagues today and support this, recognizing that we have some ongoing work to do so we can actually get more affordable housing in our community.'",
        "'speaker_0': 'All right. Take her home. All those a call. Let me have a call. A roll call on the passage of the amended council. Bill 118736.'",
        "'speaker_1': 'BURGESS All right.'",
        "'speaker_2': 'Gonzalez I. Herbold. Johnson. Suarez. O'Brien. I beg your president. High eight in favor and unopposed.'",
        "'speaker_0': 'The bill passed and chair will gladly sign. The Port of the Human Services and Public Health Committee. Please read, read items four and five together.'"
    ],
    "Ordinance to Increase Solid Waste Collection Fee or Tax.": [
        "'speaker_0': 'To outstanding candidates. Any comments from any of my colleagues? All those in favor of confirming those two appointments? Vote i. I, those opposed vote no. The motion carries and the appointments are confirmed. Please read the next report into the agenda, please.'",
        "'speaker_10': 'Three Part of the Civil Rights, Utilities, Economic Development and Arts Committee Agenda Item six Council 118 739 Increasing the fee or tax on persons engaged in or carrying on the business of the collecting of garbage, rubbish, trash, cdel waste and other solid waste.'",
        "'speaker_10': 'The many setting Mr. Code Section 5.40 8.0 55 and providing a special referendum opportunity as required by state law the committee recommends. The Bill Pass.'",
        "'speaker_0': 'Comes from Herbold. Thank you.'",
        "'speaker_6': 'Seven Relate to solid waste, solid waste rates and solid waste rate taxes. Seattle Public Utilities proposes to increase the 2017 2019 Solid Waste Waste rates to collect $26 million more in revenue in 2019 than was expected for 2016.'",
        "'speaker_6': 'This new revenue would fund increased costs for services, capital investments, higher enrollment in the utility discount program, and compliance with financial policies, as well as a proposed 2.7 percentage point increase in this city's solid waste business and occupation tax from a 11.5% to a total of 14.2%, revenue from the solid waste tax is deposited into the general'",
        "'speaker_6': 'fund and can be used for any municipal purpose. The executive estimates 3.2 million in 2017 and 4.4 million in 2018 in new revenue. Although this is an increase, it is still in line with the Seattle Public Utility Department's six year strategic plan and the targets for rate increases over a period.'",
        "'speaker_2': 'Of six years.'",
        "'speaker_0': 'Thank you very much, Councilor Herbold. Any further comments? Please call the roll on the passage of the Bill Burgess.'",
        "'speaker_2': 'Hi, Gonzalez. Purple. Hi Johnson. Suarez O'Brien. Shire President Harrell. Hi. Eight in favor and unopposed.'",
        "'speaker_0': 'Bill Pass and Chair of the Senate. Next agenda item please.'",
        "'speaker_10': 'Agenda item seven Council Bill 118 740 Relating to the solid waste system of the Seattle Public Utilities revising rates and charges for solid waste services, revising credits to low income customers for solid waste services, and amending chapters 21.40 and 21.76 of the of Mr. Code Committee recommends the bill passed.'",
        "'speaker_0': 'I'm sorry, Herbert.'",
        "'speaker_6': 'I don't have anything further to add. My description to item six blended both the the impact of both items and seven together.'",
        "'speaker_0': 'Any further comments? Please call the roll on the passage of the bill.'",
        "'speaker_5': 'Burgess II Gonzalez.'",
        "'speaker_2': 'I Purple II Johnson Suarez O'Brien Bagshaw President Harrell I Aden favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate next gen item please.'"
    ],
    "Grant Acceptance and Budget Amendment for Seattle Public Utilities.": [
        "'speaker_10': 'Agenda Item eight Council Bill 118 some 45 relating to grant funds from non city sources authorizing the Director of Public Utilities to accept specified grants and execute related agreements for and on behalf of the city and amending ordinance 124 927, which adopted the 2016 budget to increase appropriations to Seattle Public Utilities, the committee recommends the bill pass'",
        "'speaker_0': '. Consumer Verbal.'",
        "'speaker_6': 'Thank you. This ordinance accepts grant funds that have been awarded to Seattle Public Utilities, two specific grants totaling $570,000 from King County to expand their clean up programs in Thornton Creek, Pipers Creek and several additional watersheds outside of the city, including potential city annexation areas.'",
        "'speaker_6': 'The grants are used both to identify areas requiring clean up as well as doing the necessary cleanup once those areas have been identified.'",
        "'speaker_0': 'Thank you, Councilman Herbold. Any further comments? Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Burgess Gonzalez Herbal. Hi, Johnson. Whereas I O'Brien beg sr President Harrell Aden favor and unopposed.'",
        "'speaker_7': 'The bill.'",
        "'speaker_0': 'Passes and share with Senate. Please read items nine and ten together.'"
    ],
    "Establishment of a Customer Review Panel for Seattle Public Utilities Strategic Business Plan Update.": [
        "'speaker_0': 'Thank you for the comments. All those in favor of confirming the appointment vote i. I. Those opposed vote no. The motion carries and the appointment is confirmed. Adoption of other resolutions. Number 12.'",
        "'speaker_10': 'Please. Agenda item number 12, Resolution 31694 relating to Seattle Public Utilities, establishing a customer review panel to provide input to the 28 2018 through 2023 Strategic Business Plan Update.'",
        "'speaker_0': 'Councilmember Herbold.'",
        "'speaker_6': 'Thank you. Ordinarily, we would send this resolution to my my utilities committee for discussion, but we are working on a quick turnaround. The Seattle Public Utilities has a desire to get this review panel up and running. So we're sending it directly to full council without committee review.'",
        "'speaker_6': 'Just some quick background. Seattle Public Utilities has a six year strategic business plan. It's updated every three years. SPU expects to submit a new 2018 2023 proposed plan to council by mid-May 2017. When SPU developed its last plan, the Council directed SPU to create a customer review panel to provide input into that plan.'",
        "'speaker_6': 'And at the time, the panel was composed of nine members, five appointed by the mayor and four appointed by the council. The panel dissolved once the council adopted the 2015 2020 plan. This is an effort to reconstitute that committee.'",
        "'speaker_6': 'In addition to this panel, the utility also has three additional ongoing customer advisory committees, one for each water, solid waste, drainage and wastewater.'",
        "'speaker_0': 'Thank you for the comments about this resolution. I move to adopt resolution 3169. For those in favor of adopting the resolution, vote I those opposed vote no. The motion carries and resolutions adopted. The chair will sign it next.'"
    ],
    "Public Hearing on Alley Vacation Petition by SCD 2U LLC.": [
        "'speaker_0': 'Agenda Item.'",
        "'speaker_10': 'Agenda Item 13 Resolution 316 97 Setting the public hearing on the petition of s c d to you LLC for the vacation of a portion of the alley in BLOCK six A.A. Dennis second edition to the City of Seattle and the Seattle Downtown Urban Center.'",
        "'speaker_10': 'According to Chapter 35.79 of the Revised Code of Washington, Chapter 15.62 of the Code and Clerk file 314 320.'",
        "'speaker_0': 'Council Member Brian.'",
        "'speaker_13': 'Thank you. Washington State law requires that the council set public hearing dates for street and alley vacations by resolution because there are no substantive decisions related to setting this public hearing date. The legislation was introduced directly to full council.'",
        "'speaker_13': 'The public hearing for the vacation will be on September 14th at noon in the Sustainability and Transportation Committee meeting. Note that that is a special committee meeting. This impacts project at second and University, often referred to as two in you.'",
        "'speaker_0': 'Thank you. Are there any further comments about this resolution? I move to adopt resolution 31697. Those in favor of adopting the resolution code i. I. Those opposed vote no. The motion carries the resolution as adopted than Sherrill signage.'"
    ],
    "Council Direction on North Precinct Capital Project.": [
        "'speaker_0': 'Next agenda item, please.'",
        "'speaker_10': 'Agenda item 14 Resolution 316 98 relating to council direction on budget and other matters related to the North Precinct Capital Project.'",
        "'speaker_0': 'Councilmember Gonzalez, I believe. Will you lead the discussion, Casper and Burgess.'",
        "'speaker_2': 'I will. I will walk us through the components of the resolution that is before us. This is a resolution related to the existing proposal to construct a north precinct in north Seattle. This resolution, if approved by the city council, would it would direct the Department of Finance and Administrative Services to do several things.'",
        "'speaker_2': 'First, it would require that the Finance and Administrative Services Department hire an independent third party cost estimate or to ensure that the estimated project costs are are accurate and reasonable with an eye towards finding additional cost savings. The resolution also directs the Finance and Administrative Services to engage in that independent cost estimate analysis in two different junctions'",
        "'speaker_2': 'throughout the project. First, it would be at the 60% construction documents submittal phase, and then again at the 90% construction documents submittal phase. Again, all towards and I of trying to continue to reduce the costs associated with the this particular project.'",
        "'speaker_2': 'It also would direct the Finance and Administrative Services Department with the assistance of the Seattle Office for Civil Rights, Department of Neighborhoods and the Seattle Police Department to engage in a full racial equity toolkit. Analysis of the facility's design and operations, including the interior and exterior building design for all plan programmatic assets.'",
        "'speaker_2': 'Cost of the facility, consistent with the city's race and social justice initiative and consistent with Council Resolution 31164, which was passed in 2009 and reaffirmed excuse me, and directed city departments to use the available tools to assist in the elimination of racial and social social disparities.'",
        "'speaker_2': 'As part of the Racial Equity Toolkit analysis that is directed via this resolution, FISA will be required to solicit community perspectives from historically underrepresented populations, vulnerable populations. Those are most likely to interact with the police, those historically and disproportionately impacted by police action, and those most likely to be victims of crime.'",
        "'speaker_2': 'The resolution directs FASB to provide my committee the Gender Equity Safe Communities and New Americans Committee with report of its intended community engagement plan. It also requires that the race excuse me that the Racial Equity Toolkit analysis be completed by October 3rd of 2016.'",
        "'speaker_2': 'The results of the analysis are to be provided to the Gender Equity Safe Communities Enumerations Committee. Upon completion of the analysis and the resolution specifically expressly states that the results of the Racial Equity Toolkit analysis will help to inform the Council's decision on what is the appropriate total project cost of the North Precinct project in the course'",
        "'speaker_2': 'of the City Council's ordinary budgeting process around capital improvement programs. So in other words, the racial equity toolkit, because it will be completed on October 3rd and because City Council doesn't vote on the budget until the end of November, which we should and the community should have an opportunity to have the results of the racial equity toolkit'",
        "'speaker_2': 'analysis approximately 4 to 6 weeks before any decisions have to be have to be made. And I want to make sure that my colleagues know that we did speak with the Office for Civil Rights. They've indicated that they need approximately eight weeks or so to be able to complete the racial equity toolkit analysis and do it some'",
        "'speaker_2': 'justice. And so October 3rd is slightly shy. It's about a week shy of that eight week mark. So we may need to provide the Office for Civil Rights a little a little wiggle room around that October 3rd deadline, just to make sure that they they are able to fully engage in their in their toolkit analysis process and'",
        "'speaker_2': 'wanted to just disclose that for the benefit of the public and for the benefit of us. The resolution also directs FASB to provide my committee with regular progress reports, both written progress reports to the full council, but also progress reports to my committee.'",
        "'speaker_2': 'It will. Those progress reports are directed to include information on the current project status, design and community engagement efforts, along with the outcomes of community engagement efforts. A detailing of life to date expenditures. The most recent total project cost estimate with explanation of any changes since the last report and budget risk issues that may be identified in'",
        "'speaker_2': 'the course of and of all of the work that we anticipate that they're going to continue to do on the with respect to both the community aspects of the the north precinct facility and with regard to the training facilities of the North Precinct, it provides that both of those will be informed by the race and equity toolkit'",
        "'speaker_2': 'analysis that we anticipate receiving sometime in October. The last part of the resolution indicates that that it is essentially messages on the front end that we have to do something with the existing north precinct property and building. And to the extent that that that that occurs, which we anticipate it will, then then all of the funds that'",
        "'speaker_2': 'are appropriated, all the proceeds from the sale of either the property or the building where the current north precinct is sited would be wholly allocated to to meeting the city's affordable housing and affordable housing needs. And we haven't got an evaluation of that property quite yet.'",
        "'speaker_2': 'But the the the city budget office has indicated that it would be several millions of. That is the nuts and bolts of the resolution. And so I move for the adoption of resolution 31698 second.'",
        "'speaker_0': 'Council members now have good time to comment. As any council member. I'm probably going to see a bunch of hands go up here in a minute. If I wait long enough. We'd like to comment. Councilmember Brian.'",
        "'speaker_13': 'Yeah, I would like to comment. I want to start by thanking my colleagues, especially council member Gonzales Councilmember Herbold. And I know probably everyone at this table worked over the weekend and this morning to make some changes to this legislation, to get it to a point where I think it's a lot stronger this resolution.'",
        "'speaker_13': 'I want to start by saying that I do not support the north precinct in its current design. I. I do not I do not support the current budget for this. I've raised concerns, as have many others, through the number of meetings we've had, both public meetings and private meetings.'",
        "'speaker_13': 'And frankly, the answers we've gotten back have been not particularly satisfying. There's a lot of work to do going forward. I think this resolution actually does a good job laying out what some of those steps are, including the racial equity toolkit.'",
        "'speaker_13': 'I want to highlight what that racial equity toolkit is. It's not a simple exercise in checking a box and moving on and producing a document. It is an exercise in working with community to understand the impacts, not because we as government know what the impacts are, but because we have a conversation with community to understand what those'",
        "'speaker_13': 'are and we address those. That is a very important process, and to be meaningful, it's got to influence the outcome. I believe the language in this resolution leaves room for that to happen. I came into this meeting prepared to vote yes for this resolution because there's been good work done on it.'",
        "'speaker_13': 'But what's become apparent to me is despite a number of amendments that folks worked on over the weekend and this morning, the community has not had time to see those, to digest those, to talk to us about that, to give us input on it.'",
        "'speaker_13': 'I. I think there are productive conversations that can be had with the community. In fact, if we're going to be successful on doing a racial equity toolkit, we need many of you engaged in that process and we have some work to do on our end to build that trust, to have that conversation when we introduce a resolution'",
        "'speaker_13': 'and vote on it the same day. I do support that, but I weigh that versus what the urgency of that resolution is, but versus the drawbacks of that. And based on what I'm hearing today, I know the community has serious concerns, and I would like to give the community more time to see that.'",
        "'speaker_13': 'When I look through this resolution, there is nothing in here that's that rises to the level of urgency to move forward. Everything the good parts of this resolution don't require the resolution being passed to move forward. And frankly, I would hope that the city, regardless of this resolution, can start work on a racial equity tool kit today'",
        "'speaker_13': '. I hope that we can. I. I hope that we can do the work called out to look at the design elements and figure out other ways to reduce the costs. None of that requires this resolution to happen. And so I would actually like to make a motion to table this resolution until September 12th, the meeting after the'",
        "'speaker_13': 'second meeting after we come back from recess.'",
        "'speaker_8': 'For before we. Okay.'",
        "'speaker_7': 'Before.'",
        "'speaker_0': 'So I think you used the term table, but I think we mean a motion to.'",
        "'speaker_13': 'Hold motion the whole thing.'",
        "'speaker_0': 'So before we proceed that online, why don't we shy that? Why don't we have some discussion first and see? Some of my colleagues would like to. I didn't hear it in the form of a form of motion yet.'",
        "'speaker_0': 'So would you like to make the motion?'",
        "'speaker_13': 'Yes, I would like to make a motion to hold this resolution until September 12th.'",
        "'speaker_0': 'Okay. 0303. We? Is there a second to hold to? We got about 100 seconds, but these are the seconds that count. Is there motion? Is there a second? I would like to hold the emotional hold till September 12th.'",
        "'speaker_8': 'Made up a few.'",
        "'speaker_0': 'So why don't we withdraw the motion just for timing? Have more. Have more conversations. So because. Because you took a chance here. And, you know, I like these things in the morning, by the way. So he raises an issue about it being time sensitive now.'",
        "'speaker_0': 'One could say you rip off the Band-Aid. I don't know if we've done a great job of explaining what's in the resolution, because, quite candidly, I don't know how anyone could support the precinct in its current state, quite candidly.'",
        "'speaker_0': 'I mean, even if you are fighting passionately for Black Lives Matter or you are a fiscal conservative on the far right that doesn't even care about Black Lives Matter, we have a lot of challenges with this this capital project.'",
        "'speaker_0': 'I think we all can agree on that. So. So I think one of the issues you raised about is a time sensitive. And so, again, this motion, this resolution, I don't think endorses the structure as it is. And so maybe so, so maybe someone could speak to.'",
        "'speaker_0': 'I think what's most important is people to understand what's in the resolution. There's language in there. And Catherine, I think you did a good job. There's language know that makes it clear. It's not it's not an endorsed project.'",
        "'speaker_0': 'It says very clearly in the resolution that we are as far as it's cost it, we're waiting for feedback based on the race and social justice toolkit and that you're asking for other cost updates. So I don't see this as an endorsement of the 149 price tag and surely not the 160 price tag, but maybe someone could'",
        "'speaker_0': 'speak to what we're endorsing. We're not endorsing through the resolution.'",
        "'speaker_2': 'I need to communicate that here.'",
        "'speaker_0': 'Would you like to.'",
        "'speaker_2': 'I, i, i, i just I spent about 10 minutes going through each of the components of the resolution. I believe that this resolution does does not endorse the 149. I think it creates a a framework by which we direct the department to look for additional cost savings, which is what I heard community wanted it also.'",
        "'speaker_2': 'It also provides it also provides it also provides for a path forward and a plan, a very concrete plan on performing the racial equity toolkit. And I think that those are important. I think those are important components of the work that we are trying to accomplish here.'",
        "'speaker_2': 'And the budgetary decisions related to the appropriations related to the ultimate cost of this project will be done in my mind once we have the value of all of this information in the course of the in the course of the budget process.'",
        "'speaker_2': 'So that is that is why we are not indicating or providing or endorsing a number is because that number has to be defined by the information we are directing efforts to get.'",
        "'speaker_0': 'Thank you. But any other? I was talking to Councilmember O'Brien. I don't disagree with what you said. In fact, I agree with what you said. But Councilmember O'Brien, if you would like to make the motion, I would second it to further the conversation.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_8': 'I will move to.'",
        "'speaker_0': 'I will move to.'",
        "'speaker_13': 'Hold this resolution until September 2nd, September.'",
        "'speaker_0': '12th, and our second that so when. One thing that has occurred to me is that I know almost every council member, but in particular council members Herbold and Burgess and Gonzalez and Juarez have worked feverishly since Thursday and Friday and Saturday and Sunday trying to come up with a resolution that works.'",
        "'speaker_0': 'And I think we are hoping to get celebration on this resolution. And this is not exactly a celebration. And so I do question the wisdom of saying let's pass it and then sell it versus sell it and then work with the community.'",
        "'speaker_0': 'I think, you know, in how long this.'",
        "'speaker_8': 'How long this part.'",
        "'speaker_0': 'That that a lot of the public comment that I hear, I think are heartfelt and accurate about are we listening to what's happening in this country with, you know, you don't have to hammer me with Black Lives Matter.'",
        "'speaker_0': 'No, you don't. You don't have to. My three kids are black. I'm black. My wife is black. You do not have to tell me that black lives matter. I've spent a lifetime for black people. I think we need to tell you because I'm.'",
        "'speaker_7': 'So, so.'",
        "'speaker_0': 'So as we speak, as we speak, as we speak about this, I think it's very important what's happening in this country. This shadow could lift all boats. I mean, we have an opportunity here. We have an opportunity here.'",
        "'speaker_0': 'So I just would suggest possibly we could take a little time and explain it and maybe even tweak it and come back for a couple of weeks. But that's just that's just where I am on this. But I'll certainly defer to my colleagues.'",
        "'speaker_0': 'I think that there's there's people that my have there there are people that whose comments I routinely ignore because they don't have the credibility I like. But there are a lot of credible folks out there. So I'd like to hear from you.'",
        "'speaker_0': 'And if not, I'll just call on the motion to hold. I'll call. Catch my words if you want to speak. Thank you. Show some respect, sir, as I try to sharpen cuts. Final words.'",
        "'speaker_3': 'I'm just so I'm clear as. Because, you know, I just got elected. I've been on this job nine or ten months. So just to be clear, please be respectful because I wasn't raised the way you were, apparently were raised.'",
        "'speaker_3': 'I was raised.'",
        "'speaker_8': 'In Indian Country.'",
        "'speaker_3': 'I was raised for respect.'",
        "'speaker_0': 'Please. Respect. Please. Respect. Please.'",
        "'speaker_3': 'Please have respect.'",
        "'speaker_0': 'Please proceed. Please proceed.'",
        "'speaker_7': 'Folks, I want to say that I.'",
        "'speaker_13': 'You know, I'm with you all and I want to I want a chance for my colleagues to express themselves. And I know this is tense and I know we have different opinions and there's space for that.'",
        "'speaker_7': 'But if folks would please, I'd ask folks to.'",
        "'speaker_13': 'Please just just give us a few minutes to have a dialog so I can hear their points and they can hear our points. Okay.'",
        "'speaker_3': 'What I'm saying is this. I have listened to you. I've lived this life. I understand. Please, just let me talk. Thank you. So I was raised to listen, to try to understand and to try to do the right thing.'",
        "'speaker_3': 'And I think one thing that I want to point out here is I respect everybody who I sit with today. We've all worked very hard. We've met with groups. We've met with communities. We've met with the Chief O'Toole, FARC.'",
        "'speaker_3': 'I mean, you name it. So I just want to point something out. On August 17th, this council passed a law, and in that law it said 160 million. I wasn't here then for a police station right here. The vote was 8 to 0 five.'",
        "'speaker_3': 'Of those people that voted yes are on city council today. And before we got to that vote, we had 11 other votes ahead of that. So this is my job here. My job here isn't to do my job and to be called names.'",
        "'speaker_3': 'I've worked too hard in my life to get where I'm at. And so has Councilmember Gonzalez. My job here today is to look at something that a former don't flip me off. My job here today.'",
        "'speaker_7': 'As you know, out.'",
        "'speaker_3': 'Here in my job here today, is to do my job. And our job was to look at this number and bring it down and bring it down and bring it down. I wasn't there. Many of us were not here when this was passed for $160 million on August 17th, 2015.'",
        "'speaker_3': 'Now, I just want to again go back and reframe the issue. Do I believe what it means? It has to do with public safety. Every district in this city has a police station. Every district in this city has a police station.'",
        "'speaker_3': 'This police station isn't a District five issue. It's not even a district for six. It's about three communities with well over 300,000 people. Well. Five hospitals, two shopping malls. We have over 39 schools. Northgate alone has well over 2000 employees.'",
        "'speaker_3': 'North Sale College has 15,000 students. I won't go through all the stats of all of this, but I do know as light rail coming in in 2021 that we are looking at upswing in density, transit oriented housing and transit or development.'",
        "'speaker_3': 'I also know that if we're looking at 130th Street Station, we are looking at more density. My concern is this when I've read everything is that we were looking at the replacement of this facility for a 50 year life expectancy to accommodate population growth and associated public safety needs in regards to transportation, housing and social services.'",
        "'speaker_3': '40% of the population population lives north of the ship canal. I never thought that this was something about against anybody. I thought it was about doing my job and not sacrificing political correctness or political expediency for my career.'",
        "'speaker_8': 'I mean, I. I.'",
        "'speaker_3': 'Can I finish? So.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'May I finish? Yes, ma'am. Thank you. Thank you. My main concern is that we deliver a brick and mortar building that fits a price tag that we can live with, that we can justify essential governmental function to serve and deliver an essential governmental service that is public safety for everybody.'",
        "'speaker_3': 'And that is my goal. I'm not sure you can.'",
        "'speaker_8': 'Extend that down.'",
        "'speaker_3': 'So anyway, with that, I just want you to know that I heard you loud and clear. I'll continue to represent this city. And I just want people here to know that all of us up here who are elected, we all work together and we all try really hard to do the right thing.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you. So right now, we have a, uh, excuse me. Excuse me. We have a motion to hold till September 12th. It's been moved to second. And all those in favor of the motion to hold to the 12th vote.'",
        "'speaker_0': 'I. I all those polls vote nay.'",
        "'speaker_13': 'You know.'",
        "'speaker_0': 'They sort of motion the motion fails to hold.'",
        "'speaker_8': 'We now we now have a well, having.'",
        "'speaker_0': 'A a resolution and a resolution in front of us that is ready to be voted on. Any further comments at any of my colleagues like to make before I call on a vote? Councilmember Burgess, you have the other floor, sir.'",
        "'speaker_4': 'Thank you. President Harrell. Thank you. The the new facility that we're talking about here is more than just a replacement of the existing north precinct. It also includes an urgently needed new training center, which is a key component of the city's continuing path toward compliance with the federal court consent decree, in fact.'",
        "'speaker_4': 'Councilmember Gonzalez, just before this meeting and the first part of our meeting was up and in federal court listening to Judge Robert give us further direction as to how we should come into compliance with that consent decree over the past year.'",
        "'speaker_0': 'So I'm here is to rely rely on the fact that you could hear me.'",
        "'speaker_7': 'Where you can see the comments made by.'",
        "'speaker_4': 'Over a third of the new building will be used for police training, including seven classrooms and simulation areas, plus offices for training staff. This training is essential to essential reform of the police in Seattle. We're investing tens of millions of dollars in police reform separate from this facility.'",
        "'speaker_4': 'For example, we underwrite the cost of the federal court monitoring team. We're paying for thousands of court mandated training hours. We're adding additional front line supervisors. We're investing in new data collection and analysis capabilities. These are investments that are worth every single dollar.'",
        "'speaker_4': 'And so is this new facility in North Seattle. Our police officers work every day to protect the city, and they deserve a building that is not 65% overcrowded. They deserve the highest quality training that will help us continually improve, improve policing in Seattle.'",
        "'speaker_4': 'We set very high standards of excellence for our police officers. We hold officers accountable because we expect professional, fair and constitutional policing. The people of Seattle deserve the best from our police officers, and our police officers deserve the best from us.'",
        "'speaker_0': 'Thank you. Are there any further comments from any of my colleagues, Councilmember Herbold?'",
        "'speaker_6': 'I have serious concerns about the proposed price of this precinct building. For this reason, I requested that the resolution not endorse the $149 million cost. I could not have voted in support of this resolution without that specific change.'",
        "'speaker_6': 'But the Council will vote in November on a budget, and that budget will include an endorsement of a particular price tag. So we clearly have work to do and we need.'",
        "'speaker_2': 'You to help.'",
        "'speaker_6': 'Us do that work. It's also it's also clear that we are at a point of crisis in policing in this country. We're well past that point, in fact. Again, I'm voting.'",
        "'speaker_9': 'For this resolution.'",
        "'speaker_7': 'To hear.'",
        "'speaker_0': 'You ask to hear from the council members. You wanted to know here where they are. Let's hear them out, please. Thank you, Councilmember. Well.'",
        "'speaker_6': 'Again, I'm voting for this resolution because it does not endorse a budget costs and commits the city to using the racial equity toolkit and working with communities of color disproportionately impacted by policing to help inform our decision in November on the appropriate project costs.'",
        "'speaker_6': 'What makes this building a bunker? To my knowledge, there is nothing that makes this building more bomb.'",
        "'speaker_2': 'Proof or or biblical proof than any of our other four.'",
        "'speaker_6': 'Precinct buildings.'",
        "'speaker_2': 'But I will learn more. Is it the size which is nearly two times larger.'",
        "'speaker_6': 'Than the South West Precinct? Is that what makes it a bunker? Because it's so.'",
        "'speaker_2': 'Large?'",
        "'speaker_8': 'In in considering the size of this facility.'",
        "'speaker_6': 'I think it's very important to recognize, as Councilmember Burgess did, that the training center in the proposed facility will fulfill an obligation identified by the Department of Justice.'",
        "'speaker_9': 'That the consent.'",
        "'speaker_6': 'Decree requires police officers to receive five times the amount of training than in the past.'",
        "'speaker_2': 'That. The training facility in this building.'",
        "'speaker_6': 'Will be used for training all SBT officers throughout the city, not only north precinct officers. I hope that we can find a way.'",
        "'speaker_2': 'To turn what the community is telling us is a symbol of police brutality into a symbol of police accountability. I hope that those of you who are active on this issue.'",
        "'speaker_6': 'Will remain active as the Council considers legislation to reform the.'",
        "'speaker_10': 'Seattle Police.'",
        "'speaker_6': 'Accountability System, as.'",
        "'speaker_9': 'Well.'",
        "'speaker_6': 'As the decision making around the cost of the North Precinct.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilor Herbert SB Councilmember O'Brien.'",
        "'speaker_7': 'Regarding you folks. So you know.'",
        "'speaker_13': 'Where I'm going, I'm going to vote.'",
        "'speaker_7': 'You're going to sell the police by your threes and you're going to police.'",
        "'speaker_8': 'The film as well. It shows you that your decision was you with you. Who pays your taxes? Who? Alexis.'",
        "'speaker_7': 'So. So can I. To bipolar.'",
        "'speaker_13': 'I'd like to address my colleagues.'",
        "'speaker_0': 'Let's finish the hearing, please. Let's finish here. All right, let's finish the hearing, please. Councilmember O'Brien. Yeah?'",
        "'speaker_1': 'I'm going to start talking, and I.'",
        "'speaker_13': 'This resolution lays out some steps. Some things are good things in here. I'm going to be voting no on the resolution, but I want folks to understand that regardless of this passing or failing, this is a letter, a statement of intent by this council.'",
        "'speaker_13': 'The real work to be done is over the course of the budget, in the coming months and to get the outcome you all want and I want. We need to get a majority of the people sitting up here next to me to understand that.'",
        "'speaker_13': 'And we're going to have to do some work to work together to get there. And I'm going to do my part because I believe that the city can do a much better job in engaging our community and spending and prioritizing our resources.'",
        "'speaker_13': 'But having my vote alone is not going to get you the outcome you want. I want to respond. I want to respond to the comments. I was one of the council members who voted for the budget last year.'",
        "'speaker_13': 'The budget last year included the capital line items, including $160 million for the police precinct. That was something that things have changed since then. And I just want to be clear that $160 million today, in light of the movement about Black Lives Matter that's happening around this country.'",
        "'speaker_13': 'I mean, the purpose of movements, what the movement means to me is it's calling on us to reexamine our assumptions. And the assumptions that I went into that last year are different today, that they're different today. BLACK And I don't think I'm going to I don't think this is a I want to be clear and tell my'",
        "'speaker_13': 'colleagues, I don't think this is a bad resolution. I think this is a good resolution. But I'm going to be voting no because the we haven't taken the time necessary. And I haven't heard a compelling reason why we need to vote on this today.'",
        "'speaker_0': 'Hold it down. Council Member Johnson You have the floor, sir.'",
        "'speaker_12': 'Just, just a couple of months. Council President Erm there's two ways that we can save money on this police precinct, but we have one way, which is through the Policy Committee, through the Racial Equity Toolkit, and the second is through homeserve.'",
        "'speaker_8': 'So I'm going to have to an answer to. Oh, yeah, yeah, yeah. No. Okay, we got it.'",
        "'speaker_0': 'Councilmember Johnson, you have the floor, sir.'",
        "'speaker_12': 'So I want to echo the statements of Councilmember Herbold. I think when we had seen an original copy of this resolution included a cap at 149. I've heard from constituents, regardless of where you are on the political spectrum, who have said that they think that that number is too high, and if that number had stayed in, I'",
        "'speaker_12': 'would have been like Councilmember Herbold, an opponent of the resolution. I want to say that there's two ways that we can really save money on the cost of this precinct. One is through the racial equity toolkit work, and the second is through independent cost evaluation.'",
        "'speaker_12': 'So I want to say thank you to Councilmember Gonzales for working with me to make sure that the third party validators are working with the council to make sure that we find ways to save money for this precinct.'",
        "'speaker_12': 'I want us to be able to spend these resources on other critical projects in the community that I think are desperately needed in the North End. And as Councilmember Herbold said, I think that the real discussion here is as we move forward into the budgeting process, I'm looking forward to continuing to do work with folks to keep'",
        "'speaker_12': 'bringing those costs down and making sure that we get to a number that's reasonable.'",
        "'speaker_0': 'Thank you, Councilmember Johnson. Any other comments?'",
        "'speaker_2': 'I was just going to.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'Was just going to add on that. I mean, I think that's exactly what the resolution is, is framing up, is allowing us the space to have a conversation over the next several months, in fact, towards trying to find a sensible resolution and a reasonable pathway of of moving forward with the north precinct.'",
        "'speaker_0': 'Thank you to the vote. Okay. So if I don't hear any further comments, those in favor of adopting resolution vote i. I. Those oppose vote no. No. The motion carries the resolutions adopted and the chair was silent. Is there any further business to come before the council that we will stand adjourned.'"
    ]
}