{
    "Seattle's Affirmation of the UN Declaration on Human Rights Defenders.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Just one moment. Okay. Let's move to our first agenda item, please.'",
        "'speaker_2': 'The report of the City Council Agenda Item one, Resolution 318 44 proclaiming the yet that Seattle affirms the United Nations declaring declaration on human rights defenders in the wake of increased targeting of local activists.'",
        "'speaker_0': 'Cast member Herbold Thank you.'",
        "'speaker_1': 'As we have heard, this resolution is the result of a broad community effort specifically designed to address the targeting of local activists and leaders. Danny, a skinny one such activist and the former director of the Gender Justice League, a local gender and sexuality civil rights organization, reached out to the city council a number of months ago about'",
        "'speaker_1': 'several concerning threats and experiences of harassment. This harassment ranged from specific detailed threats via email to property destruction and physical in-person person threats. Much of the harassment targeted at Mrs. Kinney included specific anti-transgender language, and we know that the violence experienced in this instance is not isolated.'",
        "'speaker_1': 'We have heard similar concerns from other LGBTQ leaders and leaders of color in Seattle. This resolution was introduced or we started working on this introduce this resolution before the Trump administration's memo targeting transgender people. This resolution, in support of the United Nations Declaration on Human Rights Defenders is now Sunday.'",
        "'speaker_1': 'Since that memo even more poignant in the face of continued federal erosion of civil rights protections, we worked with the four Office of Civil Rights Commissions, the Human Rights Commission, the Women's Commission, the LGBTQ Commission, and the Commission for People with Disabilities.'",
        "'speaker_1': 'In putting together this language. And in it, we proclaim that Seattle affirms the UN Declaration on Human Rights Defenders. We describe it. The resolution describes the declaration and its history. It outlines Seattle's support of local human rights defenders and recommends that local law enforcement examine current practices with regards to supporting human rights defenders and activists who are'",
        "'speaker_1': 'experiencing threats and harassment. And as an aside, my office did share this resolution with the police department, and we have heard back from the police department and understand that they have no problems taking a look at what their practices are and making some some joint effort towards addressing the fact that there is very little, if any, enforcement'",
        "'speaker_1': 'related to cybercrimes. I want to thank the LGBTQ commission, the Human Rights Commission and the Women's Commission and the Commission for People with Disabilities. And Shannon Perez Darby from my office for their work on this resolution. And I would just like especially to thank Jessie Murray, the LGBTQ commission co-chair, for her leadership on this issue.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Kathryn Herbold. With any of my colleagues like to make any other remarks on the resolution. I think we're good. I don't think all of those that came out to testify and think, do you consider honorable for your leadership?'",
        "'speaker_0': 'Okay. I will move to adopt resolution 3184 for second, somewhat and second it should adopt RESIDENT 331844. Those in favor of adopting the resolution. Please vote i i those oppose vote no. The motion carries and the resolution is adopted.'",
        "'speaker_0': 'Please read the next agenda item.'"
    ],
    "Public Hearing on Seattle City Light's Petition for Broad Street Vacation.": [
        "'speaker_2': 'Agenda item two Resolution 318 45 Setting the public hearing on the petition of Seattle City Life for the vacation of a portion of Bridge Street between Harrison Street and Taylor Avenue North.'",
        "'speaker_0': 'Councilmember Johnson. Nope. Nope.'",
        "'speaker_4': 'Member O'Brien.'",
        "'speaker_0': 'Council member. I thought that was right for a joke, by the way, but I'm going to I'm not going to touch it. Councilmember O'Brien, I had the bad notes.'",
        "'speaker_4': 'Thank you. This resolution simply sets the public hearing for street vacation. The street vacation is near the Broad Street. Satellite substations see light as as a small parcel of land to expand this the substation. And again, this is a satellite would be looking for a street vacation for this and we would.'",
        "'speaker_4': 'The resolution just sets the public hearing for, I believe, December 4th.'",
        "'speaker_0': 'Very good. Any further comments? So I will move to adopt resolution 3184 or five. It's been moved in second act to adopt resolution 31845. Any further comments? Those in favor of adopting the resolution please vote i. I. Those opposed vote no.'",
        "'speaker_0': 'The motion carries and the resolution is adopted. Adoption of other resolutions. Correct? Yes. Please read that agenda item. Well, just a minute here. For me. We have two of them, correct?'",
        "'speaker_3': 'Yeah, I think I'm last.'",
        "'speaker_0': 'Okay. Please read the message and I'll.'",
        "'speaker_3': 'Have a script. I'm sorry. You the.'"
    ],
    "Support for Initiative 940 on Police Training and Accountability.": [
        "'speaker_0': 'Yes. Just one moment here. That coming at me. Thank you. Okay. As provided under RTW 42.17 8.555. The City Council will now consider the adoption of Resolution 31850. I'm reading the correct one. Yes. And at the conclusion of the Council member comments, the Council will hear comments from the members of the public who wish to speak on'",
        "'speaker_0': 'the resolution which endorses statewide Initiative 940, which concerns law enforcement on the November six, 2018 general election ballot. An approximate equal opportunity to speak. To speak will be given to members of the public. Having said that, will the clerk now please read agenda item number three?'",
        "'speaker_2': 'Agenda item three. Resolution three 2050 Supporting Washington Initiative Measure 940 and urging Seattle voters to vote yes on Initiative 940 on the November six, 2018 general election ballot.'",
        "'speaker_0': 'Okay. Just to as a matter of process, and we'll have some speaking opportunities here in a second, I'd like to formally move it first. And then there may even be an amendment I move to adopt Resolution 31850. Okay.'",
        "'speaker_0': 'Is the move in second to adopt the resolution? So we'll now hear comments from council members on the resolution. I'll begin the comments that basically, if you aren't following the issue and I want to thank Councilmember Gonzales for co-sponsoring that with me.'",
        "'speaker_0': 'This is a resolution that supports Washington initiative Measure 942, which urges Seattle voters to vote yes on Initiative 940 on the November six ballot. What does this do? The goal of the initiative is to decrease the use of deadly force by police in Washington State.'",
        "'speaker_0': 'On March 8th, 2018, the Washington State Legislature adopted this initiative, as well as House Bill 3003, which modified the initiative as a compromise between, quote, De-escalate Washington, an organization, community leaders and law enforcement agencies. But the Washington Supreme Court held that the initiative required a vote of the people.'",
        "'speaker_0': 'Personally, I believe the systemic racism and I think the history which would validate this implicates all facets of society. And our history has shown deep racial disparities in policy and the criminal justice system. Numerous reports reflect the fact, as an example, that black men age 15 to 34 are significantly overrepresented in police shootings relative to other demographic'",
        "'speaker_0': 'and age groups. The current standard under RC W 90.1 6.04 to determine whether law enforcement is criminally liable for using deadly force is a standard requiring proof of, quote, malice, unquote. Washington state is the only state that requires this extremely high malice standard for criminal liability in the use of deadly force.'",
        "'speaker_0': 'Initiative 940 would change the standard for when a law enforcement officer may justifiably use deadly force to quote good faith, unquote, a standard that has been adopted by other states. Initiative 940 would also require law enforcement officers in Washington to take violence, de-escalation training, mental health training and first aid training.'",
        "'speaker_0': 'A few other points of this resolution that I believe are noteworthy. That initiative 940 would also require investigations to include tribal governments where their members are involved. In short, I believe this is good policy. This is good policy for the residents and people of the city.'",
        "'speaker_0': 'This is good policy for the police department and a strong proudly to support initiative. 940 and would invite members of the from the diocese also speak to it. I'm aware of at least one amendment that will be advanced by council members who want which it basically takes out two.'",
        "'speaker_0': 'Whereas us I support this and look at this actually as a friendly amendment in that the issue in front of us is whether we are supporting. Initiative 940, which I believe we are, and as our own police department is still on an evaluation period.'",
        "'speaker_0': 'We are hoping many of us are hoping that we we we stay in compliance. But I think it is worth noting that accountability is something that you never sleep on. Accountability is a value that is at the forefront of good policing.'",
        "'speaker_0': 'So I think the initiative I so I welcome Councilmember Swan's comments and her basically amendment. And before we get into that, this s in general words about the base legislation and then we'll take any possible amendments that I became became aware of.'",
        "'speaker_0': 'So I'll give you all a minute to get your notes ready.'",
        "'speaker_8': 'And then, Harold, can I just ask one question? Yeah, sure. I'll wait for you to call on me to move the amendment, but I want to. I have a few general comments about the resolution as a whole, which I'd like to do after absolute.'",
        "'speaker_0': 'Very good. Councilmember So you're going to speak generally and then we'll come back to you on the amendment. Is that what you're saying?'",
        "'speaker_8': 'Not the other way around.'",
        "'speaker_0': 'Okay, that's fine. Councilmember Belcher.'",
        "'speaker_3': 'I'll just say this, is that I will support your recommendation to remove those two warehouses, and I certainly support moving forward with this resolution.'",
        "'speaker_0': 'Thank you. Councilmember Gonzalez, you'd like to speak? Sure.'",
        "'speaker_1': 'Well, I want to thank you, Council President Harrell, for meeting us as a council on this important resolution to support Initiative 940. There's a lot of initiatives on the ballot this fall, so I think it's important for the city council to follow through on what I have been hearing a lot of our constituents express, which is a'",
        "'speaker_1': 'very strong favourability for this particular initiative. So with this resolution, we'll have an opportunity to state publicly our support for this as a city. And I'm looking forward to taking a vote on this. I just wanted to comment on a couple of things that I think Council President Harold, you did a really great job of describing the'",
        "'speaker_1': 'overall components of Initiative 940. I wanted to emphasize a few things. One is that I think it's absolutely critical for the public to understand that in order for us to be able to save lives of people who come into contact with police officers, we need to make sure that those police officers and that all law enforcement receives'",
        "'speaker_1': 'improved training to both de-escalate the situation and to also make sure that law enforcement, if they do have to use excessive force or deadly force, that they receive mental health treatment in order to prevent a tragedy from occurring again in the aftermath of those critical incidents.'",
        "'speaker_1': 'This initiative would also provide a fair process when a tragedy does occur for all those involved, but in particular for families and the communities that that those individuals come from. And, you know, I think it's really important for us to acknowledge that this the state of Washington has the harshest rules and the hardest burdens to meet when'",
        "'speaker_1': 'it relates to officers who have been who have engaged in deadly force. And there has been a lot of study done in this issue. The Seattle Times published a report, I think it was about a year ago, that talked about how out of the over 200 incidents across the state that involve deadly force, only one had been'",
        "'speaker_1': 'brought to prosecution in a court of law. And I think that that is an incredibly unjust outcome as a result of this law. And I think that the impact that it creates on our families and our communities, on our black and brown communities in particular, when they be they, first of all, lose a loved, loved one.'",
        "'speaker_1': 'And then on top of that, to add injury, to insult, we, we end up creating a situation where they can even pursue any form of justice in our criminal court system. And so I really think that this is an important initiative for our residents to support.'",
        "'speaker_1': 'And I would urge all of our colleagues up here to join us in in voting in favor of this resolution and supporting initiative. 940 And, and like you, Council President Harrell, I also do not have an objection to Councilmember silence amendments and see them again as friendly amendments.'",
        "'speaker_0': 'Very good. Councilmember Swan, before you proceed, let me sort of walk us through the process because it's a little confusing when we're going to hear from public comment as well. So Councilmember Swan will speak to the Bass legislation and her amendment, but we're not going to vote on it.'",
        "'speaker_0': 'Then we are going to hear from public comment. And then we're going to come back after public comment and then vote on both the base legislation and the amendment. Okay.'",
        "'speaker_8': 'Do you want me to move the amendment before public comment or.'",
        "'speaker_0': 'Why don't we do that? Because I think I think if we get into a colloquy after, then I have to open it back up for public comment. So it's a closed public comment and then we're supposed to vote.'",
        "'speaker_0': 'But can she move it before without the vote? It wasn't. So I should vote on the amendment before public comment. Yes. Okay. So I stand corrected. So we'll take your amendment, vote on it, but we won't vote on a piece of legislation.'",
        "'speaker_0': 'And then I also want to make it clear, I see Mr. Zimmerman as one of the persons that spoke on this agenda. My intent was not to deprive him an opportunity to speak on this agenda item. If I don't know where he is, but he is allowed to speak on this agenda item, at least per my request'",
        "'speaker_0': '. Unless there are other issues that I don't know about that security may be aware of. So having said that, Councilmember Sawant, you have the floor on both the base legislation and your potential amendment.'",
        "'speaker_8': 'Thank you, President Harrell. First, I move to amend Resolution 31850 by removing to various clauses would say, quote, Whereas the Seattle Police Department has led the nation in implementing the reforms on its use of force, particularly in the area of crisis intervention.'",
        "'speaker_8': 'And. WHEREAS, the Seattle Police Department has reached full and effective compliance under a consent decree with the Department of Justice and continues to seek best practices in the investigations and reviews of officer involved shootings and other uses of force.'",
        "'speaker_8': 'And that's the end and good. I will wait for a second.'",
        "'speaker_0': 'I'll second.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_8': 'Thank you. The resolution as a whole supports statewide initiative 940, which I am very much in favor of. And I appreciate the comments made by President Howland Councilmember Gonzalez on the amendments already. This is a statewide initiative. And so, first of all, I do not think it is specifically about the Seattle Police Department.'",
        "'speaker_8': 'And so whereas clauses about the Seattle police are unnecessary. But while referencing the Seattle police is unnecessary and this resolution should also be clear that this initiative was a grassroots citizens initiative initiated and organized by the families and communities of John T Williams and Shea Taylor, both of whom were shot and killed at the hands of the'",
        "'speaker_8': 'Seattle Police Department. And this amendment, I am only proposing that we remove the references to Seattle police not proposing to add anything. Although ideally I think the narrative of the communities that have been impacted by Seattle police could also have been added since they could not prove malicious intent when SBT officers shot and killed their loved ones'",
        "'speaker_8': '. And because, of course, you cannot prove intent. These community organizers gathered hundreds of thousands of signatures to put Initiative 940 on the ballot so future families do not face the same injustices. I fully support 940 and will vote on yes on the resolution, but I also think that these two various glosses would be completely contrary to supporting'",
        "'speaker_8': 'the people who have suffered violence at the hands of police officers. So I think we should remove these and I appreciate the support that has already been given to the amendment. I also wanted to add a few points on the resolution as a whole.'",
        "'speaker_8': 'It takes a particular type of courage to respond to a personal tragedy by organizing to prevent other people from having to face those same. So my deep appreciation to the families of those who have been killed at the hands of the police for their leadership in the United States, police departments use deadly force at a rate far'",
        "'speaker_8': 'beyond most other parts of the world. Just for one example, in one year, all the police forces of Finland combined combined fired a total of seven bullets total. That is fewer bullets than Seattle police officers fired into Charlie Knolls alone.'",
        "'speaker_8': 'Across the country, officers have killed 798 people so far this year. And for an officer to be held accountable for this, to be prosecuted, to be found guilty is almost unheard of. The conviction of Jason Van Dike in Chicago for the murder of Laquan McDonald earlier this month was the first time in half a century that a'",
        "'speaker_8': 'Chicago police officer was found guilty, and that was only made possible after a liberal conspiracy to cover up video evidence of the murder involving the heights of Chicago's political establishment was uncovered. Officers need to be held accountable for excessive force, particularly when people are killed.'",
        "'speaker_8': 'And we should very much support 940 and urge voters to pay attention to this ballot initiative on their ballot. It will, if passed, remove a frankly impossible burden of proof to hold officers accountable. I would also add, though, that while winning this initiative was extremely important and critical, we should not expect that discrimination and violence at the'",
        "'speaker_8': 'hands of police officers would end by this important step, which is only one step. It has required incredible dedication of thousands of activists and organizers, and it deserves our full support. But after November, the fight for justice in policing must continue.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Swann. We have a live amendment to delete to, whereas is on the floor. Would anyone like to speak on either the amendment or the base legislation? General comments on the legislation. If not, we're going to just vote on the amendment.'",
        "'speaker_0': 'Okay. It's been moved in second to amend the legislation as described by council members. So what all those in favor say I, I oppose. The ayes have it. So the base legislation is amended by deleting the two whereas this.'",
        "'speaker_0': 'And now are there any further comments before we take it to the public council member?'",
        "'speaker_1': 'HERBOLD Thank you. I just want to echo Councilmember Swann's gratitude to the grassroots efforts and the and the many, many people who have come together to work for a correction of a grave injustice in our state. Last year, more Washingtonians were killed in encounters with law enforcement than in 45 other states, and a third of those showed'",
        "'speaker_1': 'signs of a mental health crisis. I agree with Councilmember Sawant that it takes an incredible amount of courage to be a family member or a loved one who has lost someone and has had the fortitude to work tirelessly to make sure that there is redress from their government in the future.'",
        "'speaker_1': 'I do, in light of the amendment that we just made, want to recognize that there have been a number of law enforcement endorsements of this measure. And I want to thank the Black Law Enforcement Association of Washington, King County Sheriff Mitzi.'",
        "'speaker_1': 'Janette King County Sheriff John Urquhart, former. The Law Enforcement Action Partnership. The National Black Police Association. Retired Police Chief Jim Pugel and retired Police Chief Norm Stamper. Thank you.'",
        "'speaker_0': 'Thank you for those comments. Councilmember Herbold. Okay. So at this point. That will conclude comments from council members and we'll hear from comments from members of the public who wish to speak on the resolution. And the time allotted for these comments will be, I'll say, 20 minutes and the speakers will be called an order which in which'",
        "'speaker_0': 'they signed up and they can go in two minute segments. First, we have Mr. Alex Zimmerman, who I believe has left the building. And Yochi, your second, Yochi Markovich. I was struck with your name. I apologize for that thing I have by now.'",
        "'speaker_0': 'And then Allie Lee will follow. Thank you.'",
        "'speaker_1': 'Hi, my name is Sochi. Make You Rich. And I'm with Washington Community Action Network. We are on the leadership team for De-escalate Washington. So I'm just here on behalf of the coalition to say thank you for putting forward this resolution in particular Councilmember Gonzalez Council President Harrell for introducing this.'",
        "'speaker_1': 'And we just wanted to express gratitude for all of the support that each of you have given to this cause. If it wasn't for the early support that many of you gave during the signature gathering, we wouldn't have gotten to this point.'",
        "'speaker_1': 'And so we just wanted to express thanks and we're looking forward to a likely unanimous vote.'",
        "'speaker_3': 'So that's all. Thank you.'",
        "'speaker_0': 'Thank you. And our last speaker was Allie Lee.'",
        "'speaker_3': 'Hello. Um, I wanted to thank you for your support on the endorsement of 940. We're helping as a leadership team member of De-escalate Washington and served on the Community Safety Task Force after the death of Donnie Chin. Discussions on training for de-escalation for state in mental health have always been at the forefront for safety in our communities'",
        "'speaker_3': '. We need to remember that teachers as well go through de-escalation, first aid and mental health training. Why would we not ask the same of our law enforcement? I am so proud and honored to serve in a leadership team that puts impacted families and communities first in our community strong that have all supported.'",
        "'speaker_3': 'I want to thank you again for your support and hope for yes on 940.'",
        "'speaker_0': 'Thank you. Thank you. Are there any other members of the public who would like to speak on Resolution 3185 of dealing with. Nine 3940. I'm sorry. Any other members of the public? No. Okay. So we are ready for a vote.'",
        "'speaker_0': 'Any further comments from my colleagues? I hope that we're ready for those in favor of adopting Resolution 31850 as amended. Please vote i. I those opposed vote no. The motion carries a resolution is adopted as amended, and then Cher will sign it.'",
        "'speaker_0': 'And before I move to our Jane, I want to also thank the mayor and her team for preparing the legislation. I should have made that I want to thank them for their work and their support on this as well.'"
    ],
    "Resolution on Pebble Mine and Environmental Review.": [
        "'speaker_0': 'Let's move to our last agenda item. Please read it into the record.'",
        "'speaker_2': 'Agenda item four. Oh, excuse me. Resolution 318 51. Addressing the proposed Pebble Mine in Alaska's Bristol Bay and urging the Trump administration to undergo the appropriate environmental review economic assessment in consultation with the public to protect the wide ranging interests in the region, including that of Seattle.'",
        "'speaker_0': 'Business Community Councilmember Words The floor is yours.'",
        "'speaker_3': 'Thank you. Council President. First, I will move to adopt resolution 31851 second. And so I'm going to I'm going to read some things into the record that may sound a bit wonky, but I do want them on the record because we did put a lot of work and worked with the advocates and thank them.'",
        "'speaker_3': 'Who gave us public comment here today? Because this is important. A lot of what I was going to share, the advocate shared. But I wanted to focus on one thing and then I will go into my prepared notes.'",
        "'speaker_3': 'I think it's important that the people here today in the city of Seattle recognize why protection of Bristol Bay is so important and relevant, not just to the Puget Sound or the Salish Sea, but the city of Seattle.'",
        "'speaker_3': 'We are looking at a 3.3 billion in seafood income alone in the Puget Sound. It provides, as you've heard from one of the advocates, well over 3000 jobs. And also this industry generates 580 million economic impact to the state of Washington.'",
        "'speaker_3': 'Also, I want to thank the mayor's office who will be signing on as I will move on later when I do the amendment to support this resolution. The Clean Water Act requires the Army Corps of Engineers to identify the least environmentally damaging, practical alternative before issuing a dredge infill permit.'",
        "'speaker_3': 'Pebble Limited Partnership, a mining company, intends to mine Bristol Bay, Alaska for copper and gold. It's also known as Pebble Mine. This partnership is part of Northern Dynasty Minerals, which is a Canadian based company in Vancouver. As you heard, Bristol Bay is home to the largest salmon fishery in the world.'",
        "'speaker_3': 'Native communities and environmental advocates in particular have a well-founded concern regarding the significant impact on the habitat and therefore the wildlife in the fishing industry that depends on a thriving habitat. The Corps contracted out to a company called AECOM, a California based engineering company, to assess an environmental impact statement.'",
        "'speaker_3': 'AECOM has regularly performed EIA services to and for the core Pebble Mine included in their recent mine plan investments to protect Bristol Bay to reduce environmental impacts. However, ACORN has stated they need financial information to fully determine if the company is financially capable of carrying out this massive project.'",
        "'speaker_3': 'On this proposed mitigation actions. The request for financial information has been denied by Dynasty Minerals. Again, Dynasty Minerals is Pebble Mine's partner in this project and the Corps have decided to continue with the permitting process anyway without getting the financial information requested by AECOM.'",
        "'speaker_3': 'The permit is on track for completion by January 2019. As you heard me share this morning, and you heard one of the advocates state. This project and this issue has been going on since 2008 and has also spent time in the federal courts.'",
        "'speaker_3': 'I take seriously the huge risk posed on the Bristol Bay Habitat, native communities, the fishing industry and consequently Seattle's economy. I'm introducing this resolution calling for a suspension on the federal permitting process to allow stakeholders an opportunity to fully evaluate the environmental and economic impact of the Pebble Mine plan.'",
        "'speaker_3': 'The resolution request the Office of Intergovernmental Relations Air to communicate the resolution to the federal government, including the White House, EPA, Army Corps of Engineers, the U.S. Department of Interior, and, of course, Senator Patty Murray. And Senator Maria Cantwell.'",
        "'speaker_3': 'So with that, I'm done. And then I will I will go ahead and do it, and then I will go ahead and do another adopt.'",
        "'speaker_0': 'Very good. So.'",
        "'speaker_3': 'So anybody.'",
        "'speaker_0': 'I didn't.'",
        "'speaker_3': 'If there's any if there any more discussion.'",
        "'speaker_0': 'A vote on the amendment. The resolution, but is there an amendment? Okay.'",
        "'speaker_3': 'So I have to do that too. I just want to have one of my colleagues had anything they want to say.'",
        "'speaker_0': 'Any other comments on the base legislation before we specifically move to the amendment?'",
        "'speaker_2': 'Mr. Chair.'",
        "'speaker_0': 'Yes, because we're a mosquito.'",
        "'speaker_2': 'I'm sorry. Thank you. I just wanted to echo my support for this resolution. And thank Councilmember was for bringing it forward and thank all the individuals who came forward to testify. My support for this is rooted in wanting to make sure that we protect both the environment and good living wage jobs.'",
        "'speaker_2': 'My family is in Homer, Alaska. My uncle and his family have been able to have a good living wage job fishing in Bristol Bay and fishing salmon every year and every year the salmon stock, it's smaller and smaller and every year the fish get smaller and smaller.'",
        "'speaker_2': 'We have to both protect the environment and protect the industry so that we can have good living wage jobs and we can have the ability to feed our community around the world, as you mentioned. I want to also acknowledge that this is about making sure that we think creatively about how we protect that fishing stock going forward'",
        "'speaker_2': 'and do everything that we can to stop this mine. When you are in Alaska, you see stickers. You see bumper stickers on almost every car saying, Stop, Pebble Mine. My Uncle Fish for many years on his fish. His boat was called the breaker because his sons were Brady and Corey, if you combine their name and now both'",
        "'speaker_2': 'my cousins Brady and Corey Fish in Bristol Bay every summer, this is how they now raise their two children each. And this is how they hopefully will have a good living wage job. But we have to make sure that this industry is sustainable, that we protect the environment, and that we prevent the Pebble Mine from coming in'",
        "'speaker_2': 'place. I believe we can do both. We can protect the environment as we protect this good living wage job industry. And hopefully future generations will have the ability to fish in this bay like my cousins currently do. Thank you, Manager.'",
        "'speaker_0': 'Thank you. Customer. I'm a skater. Okay, so let's just walk through the amendment first. That's an easy one, so. And I'll, I'll move. It comes from work to lighten the load a little bit. Okay, I'll move to amend the resolution 31851 by simply adding the mayor's concurrence on the be it resolved and signature lines so moved and'",
        "'speaker_0': 'second it to amend it as I stated all those in favor of the amendment please. What I. I oppose the ayes have it councilmember words. We want to see some closing remarks on this resolution. And I just want to say before you say that, thank you, thank you for working with the communities.'",
        "'speaker_0': 'There's some pretty strong language in here about conflicts of interest and what this industry means to the great state of Washington, etc.. So thank you for putting forth a I think a real significant piece of legislation comes from our worst of clause years.'",
        "'speaker_3': 'Thank you. Following up on what you said, council president, I very seldom do this, but I will say this on the record and looking at the legal ramifications that this has gone through, I'm very disappointed in EPA and Scott Pruitt.'",
        "'speaker_3': 'And of course, this isn't this decision by EPA to withdraw this respective permit when they're on track to look at these these impacts stopped in 2006 with this current administration. And I think there's something really wrong when the lobbyist for Pebble becomes the acting EPA person and that those are all political issues.'",
        "'speaker_3': 'This project wasn't stopped because there is scientific data or concerns or more opportunity for consultation. It was stopped for purely political purposes and sometimes things like that happened and we can sometimes work our way through them. But the damage is here to this to this area of the world we'll never get back.'",
        "'speaker_3': 'And so that's what I struggle with. I'm sure that's what the advocates are saying, and that is certainly what we heard from the Native American community as well. So with that, President Harrell, I moved to adopt resolution 31851 as amended.'",
        "'speaker_0': 'It's been moved in second. And I mean, before we vote, I want to thank members of the community for your strong testimony to advocacy as well, those in favor of adopting the resolution as amended. Please vote i. I.'",
        "'speaker_0': 'Those oppose vote no. The motion carries. The resolution is adopted as a minute and the chair will sign it.'",
        "'speaker_3': 'Thank you. Yay!'",
        "'speaker_0': 'Yay! Other business. Councilman Gonzalez.'",
        "'speaker_1': 'Thank you. I mentioned this morning during council briefing that I need to move to be excused from for council on November 5th, 2018, so that I can attend the court hearing on the consent decree.'",
        "'speaker_0': 'Second to move in. Second, and the Council Planning Czar be excused for the November 5th, 2018 meeting. All those in favor say I am. I oppose. The ayes have it. She is excused. Any other business coming for the council?'",
        "'speaker_0': 'If not, we stand adjourned. Everyone have a great rest of the day.'"
    ]
}