{
    "Acceptance of Non-City Funding and Agreements for Various Departments.": [
        "'speaker_1': 'Every part of the Finance and Housing Committee agenda item two accountable 120111 authorizing and 2021 acceptance of funding from non city sources. The committee recommends the bill passed.'",
        "'speaker_0': 'Thank you, Madam Clerk. I'm going to hand it over to Councilmember Mosquito, who is the chair of this committee, to provide the report on this bill.'",
        "'speaker_1': 'Thank you, Madam President. Colleagues, I am excited that we finally have in front of us the mid-year supplemental budget. This has been extensively discussed in the Finance and Housing Committee, which all of you have been invited to. I think those of you who have joined our committee meeting and prepared amendments that we were able to discuss in'",
        "'speaker_1': 'that committee and in front of you, I think we have a bill that reflects many of the amendments from council and again, accomplishing some investments in new emerging areas that we did not anticipate when we had considered our 2021 budget.'",
        "'speaker_1': 'As a reminder, the supplemental budget and amendments that we consider are intended to be focused on emerging and necessary items for this calendar year. We only have two more weeks until we begin discussing the fall budget, which will allow for us to make investments in the 2022 calendar year.'",
        "'speaker_1': 'House Bill 120112. Is this councilmember.'",
        "'speaker_0': 'Mosquito? Sorry, I'm going to throw up the flag here. I thought maybe you were ahead of us. But we are an item too, which is Council Bill 120111, which is the acceptance of funding from non city sources. So I'm going to just take you back one agenda item so that you can walk us through the grant acceptance'",
        "'speaker_0': 'ordinance before we begin the conversation around the supplemental budget.'",
        "'speaker_1': 'Apologies for that Council President. It's a good thing these two items go together. But my apologies, colleagues. Council Bill 120111 is the grant acceptance ordinance. Again, this is a periodic ordinance that we consider to accept funds directed at various city programs and departments.'",
        "'speaker_1': 'We did have the opportunity, along with discussing the supplemental budget, to ask questions in committee several times on this. And this is a unanimous, unanimous recommendation for our consideration today. Hope to have your support.'",
        "'speaker_0': 'Excellent. Thank you so much. Okay. Are there any comments on this council bill, which is again, the grant acceptance bill? I'm not seeing any hands raised or anyone wanting to make additional comments on the bill. So I'm going to ask that the clerk please call the role on the passage of the bill.'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'What? Yes.'",
        "'speaker_4': 'Strauss Yes.'",
        "'speaker_1': 'Herbold Yes.'",
        "'speaker_6': 'Suarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales Yes. Mosquera. I. President Gonzalez I. Nine in favor. None opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read the short title of item three into the record?'"
    ],
    "Ordinance to Amend the 2021 Budget and CIP and Modify Positions.": [
        "'speaker_1': 'Agenda Item three Council Bill 120112 Amending Ordinance 126 237, which adopted the 2021 budget, including the 2021 through 2026 Capital Improvement Program. The committee recommends the bill.'",
        "'speaker_0': 'Pass as amended. Thank you so much. Okay. Council members say that now we can talk about the supplemental budget ordinance. I'm going to hand it over to you to provide the committee reports.'",
        "'speaker_1': 'Thank you. Council President. Apologies, colleagues. Let's talk about agenda item number three. This is Council Bill 120112. As I was beginning to say, this is the second comprehensive supplemental budget legislation that has been transmitted by the executive to the Council in 2021.'",
        "'speaker_1': 'This proposed midyear appropriation included positions and capital projects necessary to meet the needs that were unforeseeable at the time of the 2021 budget. Adoption in November of 2020. Several departments totaled mid-year. Supplemental improvements include necessary investments in key categories like Office of Labor Standards, which is receiving $1.8 million, which is to go to the drivers resolution center'",
        "'speaker_1': '. This was a key piece of legislation that the Council passed to make sure that Lyft and Uber and other good drivers had a driver resolution center to make sure that they had their needs met. Excited about that piece.'",
        "'speaker_1': 'Another piece that I'm excited to lift up is $2.5 million that goes into several programs at the Department of Arts and Culture. This includes 1.6 million from the Municipal Arts Fund for public art projects associated with the waterfront.'",
        "'speaker_1': 'As we look to continue to get folks out and actively engage our community, especially along the waterfront, I know there's a lot of anticipation for that and includes things like $2.5 million to increase the FAA fund to support staffing and contract suppliers and operations of vaccine sites that the city works so diligently to make sure we're available'",
        "'speaker_1': 'for our residents and we're making sure that we're providing the funding necessary for those previous operations. The Neighborhood Large Vision Zero Project is also included. $2 million is going to move Seattle increase to a $2 million increase from the Seattle Levee Fund is going to implement changes recommended by the Levy Oversight Committee to increase support for safety'",
        "'speaker_1': 'projects and accelerate in-demand neighborhood projects. I'm excited about a few additional amendments that the colleagues on the committee help to support and include in the legislation in front of you. And if I may, Madam President, just want to highlight a few of those before turning it over to our colleagues that have really made this a robust supplemental'",
        "'speaker_1': 'discussion. This includes. Thank you, Madam President. This includes the inclusion of an additional position at Seattle Fire Department for a crisis counselor. This will assist with training and facilitating conversations with Seattle Fire Department personnel. Colleagues, this is a complement to the crisis counselor that we provided in last year's budget that provides trauma informed counseling services, referrals and'",
        "'speaker_1': 'trainings for those who are focused on scene safety and making sure that we're keeping firefighters safe and in increasing the positive interactions that they have with individuals in crisis or suffering from mental health and behavioral health issues. We now with this funding will have two crisis counselors, one within Seattle Fire Department and one again within the local'",
        "'speaker_1': '27 trust to make sure that we really have reduced the barriers for firefighters to be able to access crisis counselors. I'm also excited about the $200,000 that we included in this supplemental budget to make sure that we're helping provide funding for material support as we continue to build tiny houses through organizations such as sound foundations, Northwest.'",
        "'speaker_1': 'And finally, I will be I will try to be brief as we have worked on a large amendment with Councilmember Herbold as vice chair of finance and housing, but as chair of public safety, as we were on the cusp of passing the supplemental budget, we did get word from the mayor's office and then subsequent press events, about'",
        "'speaker_1': '$15 million underspend. And so it Councilmember Herbold, than I did with the support of the colleagues on the committee, was work to bring forward an amendment that included many strategies to address public safety and to couple those public safety investments with community efforts to scale up alternatives to our traditional police response by making sure that we had'",
        "'speaker_1': 'investments directly into community. I think the package in front of us, including the amendment that we worked on, is an important balance, an important balance of investing and the community services civil service positions 3 hours. One represents an effort to make sure that we're meeting council and executive priorities and that we have expressed our intent to to'",
        "'speaker_1': 'make sure that we are moving forward with things like making sure that the mental health providers are available for front line responders, for making sure that we are paying for paid parental leave, addressing the increased use of overtime by making sure that we're recognizing that that overtime is probably larger than what was actually needed given the fourth'",
        "'speaker_1': 'wave of COVID and that we've made sure that we've invested in King County regional peacekeepers and the funding that was needed to make sure that our community has the funding that they need to respond to these crises. I'm most most excited to highlight the $3 million that we have included in this proposal as well, to invest in'",
        "'speaker_1': 'the human service department, community safety contracts that are needed to provide stability so that there's truly a landing zone or a landing place, as the firefighters have talked about, so that we can extend those contracts from not just not just 18 months, but truly to two years.'",
        "'speaker_1': 'And we have received support from those frontline responders that that's really important to have stability for the community partners so that when 911 is called, if fire or police show up, they have someone to refer those individuals to.'",
        "'speaker_1': 'That is what those agencies safety and contracts are doing. We are excited about those, but let's make sure that they last for at least two years. So the $3 million investment in councilmember, verbal and EIS amendment that was passed in committee accomplishes that.'",
        "'speaker_1': 'I'm proud of the work that we've done in front of us. I know that there's a few amendments for us to discuss today, but I want to thank all of you for your work on the supplemental. It it was three months in our committee intentionally so that we could address this underspend and and respond to the need'",
        "'speaker_1': 'for public safety investments as well as community investment so that upstream solutions could be funded as well as investments in our cities as departments, please Council President, thank you very much for the opportunity to speak to this and I'll hold the remainder of my comments.'",
        "'speaker_0': 'Great. All right. Colleagues, we do have several amendments. My suggestion, sort of consistent with how we usually structure these conversations, is to go through the amendments and and before opening up discussion and debate on the substance of the bill.'",
        "'speaker_0': 'If there's no objection, I would like to go ahead and proceed in that manner. So. Consideration of amendments, first debate on amendments. And then we can sort of make closing wrap wrap up comments on the bill as amended.'",
        "'speaker_0': 'Is there any objection to proceeding in that way? It seems to make the most sense to me. Okay, so why don't we go ahead and go through the amendments? I do have a list of all of the amendments in front of me, including the sponsors of said amendments.'",
        "'speaker_0': 'I'm just going to I'm just going to keep us moving through this and call on each council member as they're listed in my in my script here. So let's go ahead and move over to Councilmember Herbold, who I understand is intending to move Amendment One.'",
        "'speaker_3': 'Thank you so much. I move to amend Council Bill 12 0112 as presented as Amendment one on the agenda.'",
        "'speaker_1': 'Right now.'",
        "'speaker_0': 'It's been moved and seconded by Councilman Mosquito to adopt Amendment One as presented on the agenda. And I'm going to hand it back over to Councilmember Herbold to address the amendment.'",
        "'speaker_3': 'Thank you so much. So this amendment is a technical amendment. It moves appropriation authority within the Seattle Police Department budget summary levels to effectuate the spending cycle, the spending of salary savings described in Section 20 of Council Bill 12 zero one.'",
        "'speaker_3': 'One two, including the technology updates, the civilian divisions, the work scheduling timekeeping project, the junior contract, the SPD mental health provider program, contract, background services, separation pay shortfall, the deferred compensation shortfall and paid parental leave. This is consistent with a long held priority of mine for the oversight of the Seattle Police Department, where we work to make'",
        "'speaker_3': 'sure that the appropriation authority is in place in advance of the spending so that we don't have a situation where SPV, in essence, goes forward with the spending in alignment with their objectives and comes back to council after the fact and asks us to approve it after those decisions have already been made.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Excellent colleagues. Any comments or questions on Amendment One? I'm not seeing any. We did have a conversation about this amendment during a council briefing, so thanks so much for the opportunity to engage on that this morning as well.'",
        "'speaker_0': 'Okay, colleagues. Hearing and seeing no additional comments. Will the clerk please.'",
        "'speaker_1': 'Call the.'",
        "'speaker_0': 'Role on the adoption of Amendment One?'",
        "'speaker_2': 'PETERSON That's.'",
        "'speaker_1': 'So what? Yes.'",
        "'speaker_4': 'Strauss Yes.'",
        "'speaker_1': 'HERBOLD Yes. Suarez, I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. As a setter by President Gonzalez hi nine in favor nine opposed.'",
        "'speaker_0': 'The motion carries the amendment is adopted and the amended bill is before the council. We're not going to go ahead and move over to Councilmember Lewis, who has amendment to.'",
        "'speaker_2': 'Thank you, Madam President. I moved to amend Council Bill 1 to 0 one one to as presented on Amendment 2/2.'",
        "'speaker_0': 'It's been moved and seconded by Councilmember Peterson to adopt Amendment two as presented on the agenda and to hand it back over to Councilmember Lewis to walk us through his minutes.'",
        "'speaker_2': 'Thank you, Madam President. Fairly simple amendment. I touched on it this morning at briefing. This amendment was recommended by the City Budget Office to move some money that I amended at committee into this bill from the Human Services Department, into the Planning Department to take advantage of an existing contract for capital support in the Planning Department for'",
        "'speaker_2': 'the Chief Seattle Club, which has a permanent supportive housing project that this amendment aims to provide support to. It is merely a technical amendment to take advantage of that existing contract and more efficiently get that investment out the door.'",
        "'speaker_2': 'And happy to answer any questions otherwise. Stand by those comments.'",
        "'speaker_0': 'Great. Thank you so much, colleagues. Any additional comments or questions on Amendment two? All right. Hearing on all these other on the adoption of an amendment to Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'So far.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Suarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_6': 'Morales Yes.'",
        "'speaker_1': 'Mosqueda i. President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor.'",
        "'speaker_0': 'An unopposed motion carries the amendment is adopted and the amended bill is before the council. So we are going to move now to Amendment three A and I'll hand it over to Councilmember Peterson to make his motion.'",
        "'speaker_2': 'Thank you. Council President I and just for context, there are two options here, but I'll go ahead and move the first option. I move to amend counts 4120112 as presented as Amendment three A on today's Council agenda.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'It's been moved and seconded by Councilmember Juarez to adopt Amendment three A as presented on the agenda. I'm going to hand it back over to Councilmember Peterson to walk us through his amendment.'",
        "'speaker_2': 'Thank you, Council president, colleagues. This budget amendment would allocate funds that were already in city's adopted 2021 budget to help recruit and retain personnel because we've lost 300 officers and detectives over the past 18 months. There are two options for the amendment option and would keep 3 million within these budget for recruitment and retention, whereas option B'",
        "'speaker_2': 'would take it on allocated 1.1 million and dedicated for recruitment and retention. This first vote is on option one. The larger amount, colleagues, I believe this motion should be viewed in the bigger picture of the substantial investments and actions that we have taken and will continue to take to boost human services programs and to reimagine public safety'",
        "'speaker_2': 'as we await various alternatives to be put in place. We must also recognize the tidal wave of attrition, the spike in 911 response times for priority one and priority two calls the benefits of having community policing officers and detectives, and as noted by the Monitor, the federal consent decree.'",
        "'speaker_2': 'The need to have sufficient staffing to advance and sustain reforms for the department that we still have. We also have an obligation under City Charter Article six, Section one, to maintain adequate police protection in each district of the city.'",
        "'speaker_2': 'I want to thank the Reverend Harriet Walden, the leader of Mothers Police Accountability for supporting these amendments, for recruitment and retention, as well as many people who sent emails and support. I also want to acknowledge everyone who called in today to voice their opposition and concern.'",
        "'speaker_2': 'I also hear you. It's important to note these funds were already funded to SBT as part of the 2021 budget. So labeling the proposals as a funding I don't believe is fully accurate. These amendments would, however, focus some of those funds for recruitment and retention.'",
        "'speaker_2': 'Option A would still enable the human services programs to be funded all through next year, 2022. And we have plenty of opportunities to extend and expand those effective programs later this fall or next year. But we are in the middle of an SBT staffing crisis now.'",
        "'speaker_2': 'Specifically option would keep the 3 million with 233,000 for hiring incentives for the last three months of this year, plus the remainder of the 2.7 million as an immediate down payment for flexible retention strategies, which could include retention pay but does not have to.'",
        "'speaker_2': 'It's authorized by a separate bill that I had introduced earlier. These what I believe modest amounts in my budget amendment go beyond mere words to demonstrate that we recognized the impacts of the staffing crisis and that we want our remaining officers and detectives to stay in Seattle.'",
        "'speaker_2': 'So rather than delaying until the end of November to vote on this for next year's budget, we can take this swifter action this week to reduce the amount of time Seattle residents wait for an officer after calling 911.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson, are there any additional comments or questions on the amendment? Okay. I have three folks in the queue. First up, is councilmember verbal, then Councilmember Lewis and then Councilmember one.'",
        "'speaker_3': 'You so much. I totally agree that hiring and retention is a really important issue and important I agree with it in not just words, but in action. The legislation before us, as amended by the Finance and Budget Committee and without Councilmember Peterson's amendment, includes recruitment, support by hiring, by funding, hiring process accelerators.'",
        "'speaker_3': 'The topic merits additional attention, and I believe it merits additional attention through the annual budget process, which begins in a couple of weeks. And I, I believe this because I want to look at the vacancy rates of all city departments and look at this question of how we incentivize folks taking these good family wage jobs across all'",
        "'speaker_3': 'the departments that are experiencing vacancies right now. Central staff has determined that the executive has documented staffing shortages and accompanying service delivery issues in and a few different departments. And it's well known that the impacts of COVID on employment has been unprecedented, both for the private sector as well as the public sector, with people leaving their jobs'",
        "'speaker_3': 'and with sustained vacancies across most unemployment, most employment sectors as well. I value the delivery of city services of all city departments and if we need to just discuss recruitment, I think we need to consider vacancies across all city departments and whether we need to consider hiring bonuses to fulfill hiring goals and service delivery obligations for other'",
        "'speaker_3': 'departments as well. So I would support considering this within the context of 2022 budget and which will be weeks, the proposal from some member Peterson would authorize up to $15,000 per CPD hire if we are considering hiring bonuses for hires to other departments.'",
        "'speaker_3': 'We need to consider the possible citywide cost if we're if we're allowing for for one particular department up to $15,000 per hire. Just as a little bit of background on this topic, generally back in July, I request at a speedy send a memo to the city council to to make some recommendations for spending.'",
        "'speaker_3': 'Given the fact that we knew there was a lot of a lot of funds within the Seattle Police Department budget in the salary savings category that MPD was not going to be able to spend unless we authorized reallocation of some of those funds.'",
        "'speaker_3': 'And so in that memo, the police department requested funding for hiring bonuses, including, as I mentioned earlier, the hiring process accelerators. But there was no broader request at the time for funding for retention. So these are my comments as it relates to the retention piece of Councilmember Pearson's proposal.'",
        "'speaker_3': 'So I just want to highlight that as it relates specifically to retention, as I mentioned during budget, I mean, sorry, during briefings this morning, I really want to focus on the recommendations of a 2019 hiring and retention report that called for what are called wellness first schedules.'",
        "'speaker_3': 'These are 410 hour shifts that provide officers three consecutive days of rest for officers rather than just two. This has historically been the highest rated priority for my four officers, and I'm concerned that although the amendment includes some specific language $230,000 for the hiring bonuses piece, the description of the amendment by the sponsor is.'",
        "'speaker_3': 'Is. Is. Expresses a vague intent. And as the $30,000 is very specific for hiring bonuses and the larger amount of of the funds, the rest of the $3 million isn't specified for any particular use. That would mean it would likely need to be reauthorized during the 2026 in any event.'",
        "'speaker_3': 'So again, a package adopted by Finance and Housing Committee includes apology upgrades for that will support officer wellness and supervision that hundred and $20,000 that was included there. And so what I just want to note that many front line workers have received what's called appreciation pay for their service during the pandemic.'",
        "'speaker_3': 'And I'm supported up supportive of continuing discussions for how best to authorize appreciation pay for police officers. I'm very grateful for the work of Seattle Police Department and the officers who have not left SPD and remain committed to community safety and committed specifically to community safety in Seattle.'",
        "'speaker_0': 'Thank you. Councilmember Herbold, Councilmember Lewis.'",
        "'speaker_2': 'Thank you, Madam President. And I want to thank the sponsor for bringing this amendment forward for the discussion. I am going to say at the top that I will not be voting for this amendment, but I want to expand on the reasons why.'",
        "'speaker_2': 'And I appreciate the opportunity for this debate. That's why this council is here to debate pressing public issues. I agree with the sponsor of the amendment and with Chair Herbold and her comments just now that we do have a police staff in crisis.'",
        "'speaker_2': 'And I think a lot of us on the council agree more broadly with that, which is why we fully funded a police hiring class for 2021. That's often not mentioned in the media or the stories discoursing about police hiring.'",
        "'speaker_2': 'But the council did fully fund a hiring class, and I don't disagree that a partial strategy to mitigate this crisis can be through the hiring and retention incentives that are being proffered today by Councilmember Peterson. When I disagree with his the reprioritization of the money component of this amendment, money earmarked for critical crime prevention programs in the'",
        "'speaker_2': 'Human Services Department. And I just want to make take a moment to discourse a little more broadly about the public safety crisis in the city and how alternative investments are needed and how they can make an impact. And I want to focus, particularly because it's been a big crisis in my district, and I know it has across'",
        "'speaker_2': 'many other districts. It's touched every district in the city throughout this year, and that's gun violence. And I want to start by strongly acknowledging the critical role that the police play in responding to and preventing gun violence. As of August 31st, Seattle police have recovered more than 700 guns this year, taking them off the street, physically removed'",
        "'speaker_2': '700 guns from the street and secured them. Seattle police continue to have, as part of their mission, serving extreme risk protection orders to seize firearms from folks who pose a safety risk to themselves or others. And these efforts undoubtedly prevent gun violence in our community, save lives and make the community safer.'",
        "'speaker_2': 'But there's limits to what police alone can achieve. And we need to keep leaning in to the investments this council has advocated for that can have a profound impact on gun violence prevention. And I think this becomes more evident when we look at the data on the shootings that we are seeing and experiencing in Seattle this year'",
        "'speaker_2': 'to really determine what can we do to intervene and prevent these shootings before they occur that are having such a horrible impact on our community. This last Friday, I listened to Kristen Nicole Fincher's Week in Review podcast for her hacks and walks highly recommended.'",
        "'speaker_2': 'If folks have haven't listened, I recommend you give it a shot. It's great. And Crystal and former Mayor McGinn had a great conversation about the current discourse our city is having around gun violence in particular. And they noted and I can't say I disagree from their discussion, that there's been a lack of critical analysis by many in'",
        "'speaker_2': 'the media to delve into our increase in shootings and what the data is indicating so that we can have a real response as a community on what we're going to do to deal with this epidemic of gun violence that is crippling our city and killing people in our community.'",
        "'speaker_2': 'And we need to see who are the victims. Who's doing the shooting. And we need to look holistically at how we can respond. And I want to briefly just just illustrate by sharing a little bit of analysis I did, because I was curious and getting information and data shared by the police department.'",
        "'speaker_2': 'And overwhelmingly in 2021, our neighbors experiencing homelessness have vastly and disproportionately been the victims of the increase in gun crime. According to data that was provided to me, a report by the police department on September 1st. So a bit over a week ago, we have had 64 shots fired incidents with a homeless nexus.'",
        "'speaker_2': 'That's up 120% from 2020. It's a huge part of the increase in gun violence we're seeing on the street. It's nearly one fifth of all the shootings that have occurred in 2010. And tragically, I had no doubt after the last 12 days since I got that data, that that data is probably out of date.'",
        "'speaker_2': 'And in almost all of these cases, the victim of the shooting is a neighbor experiencing homelessness. In most cases, the shooting occurs in an unsanctioned encampment setting. I raise this because police alone can't prevent these shootings. I have incredible gratitude for the officers that have been responding to these encampments and responding to these shootings and in many'",
        "'speaker_2': 'cases, apprehending a suspect. Recovering guns and getting them off the street. And I appreciate that exigent response. And I know it makes the community safer. But until people are provided with desirable alternative places to live with wraparound services, all we are doing is responding to encampments that are providing and in many cases in exigent hub of continued'",
        "'speaker_2': 'gun violence. And we're not proactively solving for the underlying causes of the trauma and the violence. We are also, frankly, putting more work and exposure on our officers to continue to respond in many cases to very dangerous situations by not solving for these underlying causes.'",
        "'speaker_2': 'And I know I'm a broken record on this, and I know I have agreement from my colleagues here nearly unanimously, but just care. Has undeniably prevented shootings that would have occurred, but for their intervention. Just care offers highly desirable, well-supported hotel room shelter spaces, which are overwhelmingly accepted by community members and by our neighbors experiencing homelessness.'",
        "'speaker_2': 'And a University of Washington study demonstrated that neighborhoods where chest care is active see a 38% reduction in 911 call volume after their outreach operations. I have no doubt that the just care outreach at the former encampment on Third Avenue downtown at the Second Avenue Extension and Pioneer Square at City Hall Park by the courthouse prevented shootings'",
        "'speaker_2': 'from occurring. That would have otherwise occurred because there is a clear correlation between having thousands of our residents exposed to the elements and their tragic likelihood of being a victim of gun crime. Bringing it back to the amendment.'",
        "'speaker_2': 'I think it's critical that we center these human services investments as a large portion of these salary savings. To invest in these proactive community safety strategies. And we need to look no further than the mentorship and community building efforts of community passageways to know that that's true and that's possible.'",
        "'speaker_2': 'Known gang related shootings this year have actually decreased in 2021. The city, the council and the mayor working together have expanded these youth support programs, and they're building strong communities. These innovative community programs can get to scale. They can give us the resources to build strong, supportive and safe communities.'",
        "'speaker_2': 'We shouldn't be pitting these investments against each other. And I stand by dedicating this money to the Human Services Department. And for that reason, I'm going to vote against this amendment.'",
        "'speaker_0': 'Thank you, Councilmember Lewis, for those comments. Councilmember Long.'",
        "'speaker_5': 'Thank you. I will be voting against this amendment. Needless to say, for members of the public who are listening to this budget bills should be a clear illustration of the importance of movement. At the height of the Justice for George Floyd movement, the majority of the council committed to defund the police by 50% and to instead put'",
        "'speaker_5': 'those funds into supporting community development into social needs. Now that the street movement has waned, every marginal victory that the movement won last year is under attack. We saw earlier this year how the majority of the city council drove in loopholes into the historic ban on the so-called crowd control weapons that our movement had won through the'",
        "'speaker_5': 'efforts of hundreds of activists and my council office. This is why our movement cannot trust the political establishment and why we need to build our own political power outside the Republican and Democratic parties through our party for working people.'",
        "'speaker_5': 'And keep in mind that here in Seattle, every council member currently except for my office is a Democrat. This is why I am a socialist on this issue. First, let's be clear about the double standard we are talking about.'",
        "'speaker_5': 'When council members like Peterson advocate for hiring bonuses in the Seattle Police Department. But it's frankly, it's not just Peterson who has talked about this today or in the past. The police are some of the highest paid people among city of Seattle employees making more than double what is paid to many social workers, like homeless service workers'",
        "'speaker_5': '. The mayor has claimed that she cannot use the funding for shelter and dining villages, that the people's budget movement and other activists won in the last budget because there are not enough homeless service workers to staff new spaces.'",
        "'speaker_5': 'But other hiring bonuses are just a raise for the impoverished homeless service workers who actually help people turn their lives around. I have heard council members lamenting the rate of attrition among police officers. I would ask them as they looked at the turnover among social workers because of how low they are peers in relation to the services'",
        "'speaker_5': 'they provide. It should not be a surprise that there is low morale among police officers. Of course there is. Over the last year, we saw the murder of George Floyd. We saw Seattle police filling our communities with tear gas, pepper spraying children in the face, running over protesters, heads with bicycles.'",
        "'speaker_5': 'And all that is in addition to the usual level of violence from the police towards communities of color, working class communities and poor people, especially our homeless neighbors. And overall repressive policing practices. And we should, of course, know that the police do this with the consent of the political establishment.'",
        "'speaker_5': 'Of course, there is low morale among police officers when so many ordinary people have opened their eyes and are totally outraged by the harm that the police do. The solution is not to pretend that those problems and that are justifiable outrage doesn't exist.'",
        "'speaker_5': 'The solution is to hold police accountable for the violence that they do and to fund the needs of the community. I do not support reinstituting hiring bonuses for police, the highest paid people in the city. I do not support this amendment which would slash the funds to community programs to fund the expansion of repressive policing.'",
        "'speaker_5': 'Remember, the amount of police funding does not have any statistical any statistical impact on the amount of crime in a community. It is inequality that has a greater statistical impact. I absolutely share the concerns that ordinary people have about the rise in gun violence.'",
        "'speaker_5': 'I have that concern as well. There is no question that we need to address this. But if you look at this statistically, you would see that this is happening. Even though the police budget has been bloated for many years, the 50% difference hasn't happened.'",
        "'speaker_5': 'That demand was never fulfilled. And if you look at the data, the police budget has been bloated for many years. While the social services and affordable housing are working people, oppressed communities and the poor need continue to be gravely underfunded.'",
        "'speaker_5': 'And I don't just mean in the city, they are underfunded at the state level and at the federal level also. And at the same time, we are seeing rents by corporate landlords skyrocketing even in the midst of a pandemic.'",
        "'speaker_5': 'Studies show overwhelmingly that the best and really only solution to public safety issues is to fund the needs of our society to address crime, and particularly to stop crimes before they even happen. We need to fund affordable social housing expansion like we did with the Amazon tax, and that was important and historic.'",
        "'speaker_5': 'But it is not enough. We need to raise wages even further. We need to have rent control and other renters rights. And we need to end exploitation as a whole. Not. Increase repression. And in addition to all of this, we need an elected community oversight committee with full powers to hold the police accountable.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. So for your comments, are there any additional comments on Amendment three? A. Okay. I'm not seeing any other hands raised on Amendment three a. I do want to make sure that Councilmember Peterson has an opportunity to have the last word since this is his amendment.'",
        "'speaker_0': 'So I'm going to hand it back over to Councilmember Peterson to close out debate on Amendment 38.'",
        "'speaker_2': 'Thank you, council president. Appreciate the comments from my colleagues and happy to just vote on Thursday and then we might be getting to three B sooner than I thought.'",
        "'speaker_0': 'Okey dokey. All right, colleagues, that does conclude debate on Amendment three. A So I am going to ask that the clerk please call the role on the adoption of Amendment three a Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_4': 'No.'",
        "'speaker_1': 'Her bold. Now, Juarez, I. Louis No. Morales No. Most scatter? No. President Gonzalez.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Two in favor, seven opposed.'",
        "'speaker_0': 'The motion fails and the amendment is not adopted. So we're going to go ahead and move to Councilmember Peterson's Amendment three. BE So I'm going to hand it over to Councilmember Peterson to make his motion.'",
        "'speaker_2': 'Thank you. Council president and moved to amend council bill 12011 to as presented as amendment three be on today's council agenda.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded by Councilmember Juarez to adopt Amendment three B as presented on the agenda and handed back over to Councilmember Peterson to walk us through this amendment.'",
        "'speaker_2': 'Thank you, Council President, colleagues, this option B is A is a more modest version of what we were trying to do with option A. It would take just 1.1 million, which was previously unallocated by the council's finance committee.'",
        "'speaker_2': 'So it not part of the 20 2023 HST programs. I support those HST programs and will support them in 2023. This, however, is just $1 million and it's from an allocated portion. It would be dedicated toward retention and recruitment.'",
        "'speaker_2': 'It would be the same amount for recruitment 233,000, which is for the last three months of this year, and the remaining amount as a down payment toward efforts to retain existing officers and detectives. Thank you.'",
        "'speaker_0': 'Thanks so much. I do see a couple of people with their hands raised. And so I'm going to go ahead and start calling on folks. Councilmember Herbals is up first.'",
        "'speaker_3': 'Thank you. All of my comments that I made about recruitment and retention strategies and my belief that in addition to the funding that's in this legislation are for recruitment and retention strategies, which again, there is some funding in this bill devoted to those purposes.'",
        "'speaker_3': 'So all of my comments about the funding objectives that I made in the previous amendments still stand for this. I want to just very quickly speak to the funding source as I understand the proposal and the impacts of proposal.'",
        "'speaker_3': 'As I understand it, and from the central staff memo that if this amendment is passed in this department, spend it. Salary savings consistent with the modified intent and SPV would not have remaining salary savings to spend on some items that we have ident that council has identified as a priority and included support for and that it what'",
        "'speaker_3': 'we think would we not include support for it in this bill. But they have been identified by us as as I priorities and one of those is funding for a new CISO squad of at the rate of a $120,000 for 2021.'",
        "'speaker_3': 'Potential COVID related related compensation 0.5 million. And then the ID of $3 million to fund overtime costs. We did find $1.5 million of the requested $3 million of overtime, and that is authorized, authorized in Council Bill 12 0112 as amended.'",
        "'speaker_3': 'But then we specifically referenced the 1.5 million in the bill that came out of committee as potential sources for these. There are these other high priorities from the police department. So if we vote in favor of this second option, we're pretty close to zero rolling out Spd's budget and we can't look at funding of MPD, can't look'",
        "'speaker_3': 'at the funding for its other priorities in particular as it relates to the overtime. Although I'm really I'm glad that we have sort of held the line at adding 1.5 million through overtime in the bill before us. I just want to signal that my understanding that as it relates to some specific training priorities, specifically use of force'",
        "'speaker_3': 'training, de-escalation training, crisis response training, as well as some particular reviews that the police department has to do. Their force intervention, their fit reviews, their force reviews, their force review board reviews. These reviews are required for CPD to do in advance of an OPA investigation when there's an open investigation associated with the use of force.'",
        "'speaker_3': 'And there they have a big backlog on doing these two step reviews and these FRB reviews, which then delays the okay investigations. And then finally supervision ratios, sergeant to officer ratios. A lot of those. And so we think of some we think of over time, as, you know, over time for for emphasis patrols or overtime for associated'",
        "'speaker_3': 'with protest response. This is also a really critical use of overtime, particularly when the department does have a lot of vacancies. They then rely more on overtime so that officers can be paid to again complete the training, the required consent decree required training, these these vet reviews, the FBI reviews as well as the supervision ratios are part'",
        "'speaker_3': 'of the consent decree. So for this reason, I'm I apologize, but I cannot support the amendment, modified amendment with the different sorts of funds you.'",
        "'speaker_0': 'Thank you so much, Councilmember Her. Really appreciate that additional details. Councilmember Lewis, you are next in the Q and then Councilmember, go ahead.'",
        "'speaker_2': 'Thank you, Madam President. While I opposed Councilor Peterson's amendment, A, I do intend on voting for Amendment D today, and I want to expand on some of the reasons why. As I said before, I agree that the police staffing crisis is real, and I agree that we need to transition to a rightsize first response for police or'",
        "'speaker_2': 'one of several services that can be dispatched. We have a report now from the National Institute for Criminal Justice Reform, commissioned by SPD and funded by this council, indicating that 75% of calls for service could ultimately be handled by a civilian response service.'",
        "'speaker_2': 'We know that that number is contested by the department, but that there is a consensus on a sizable percentage. And we know that some of those services are being stood up. Now, those services have not been completely built, nor have they been scaled.'",
        "'speaker_2': 'And the council has taken those initial steps by building an independent dispatch service, which is critical and essential. We've expanded the Health One program. We're in the process of developing triage one, which will take on a large range of calls for service.'",
        "'speaker_2': 'My hope is that triage one will be in the mold of Denver Star program or Eugene, Oregon cahoots or something similar to those low acuity response programs. But this is still in the future. It's still being discussed. And we still don't completely know what role those programs will fill, let alone when they'll be at scale to take'",
        "'speaker_2': 'calls for service. I firmly believe, based on analyzing the whole national situation on policing and public safety, that the American cities of the future are going to be the cities that engage in this diversification of response services, not only for the benefit to health and wellness of getting a better tailored first response for calls for service.'",
        "'speaker_2': 'But because responding to historic levels of attrition for police to continue to fill the same footprint police have always filled in the United States is not going to be logistically possible. Police hiring is down 5% nationally. Resignations from police services have risen 18% and retirements have risen 45%.'",
        "'speaker_2': 'It's a crisis that is not unique to Seattle. New York City alone lost 5346 police officers in 2020, a 75% increase in their attrition rate. But such large attrition prior to the establishment of scale of alternative services and responses greatly hampers our ability as a city to provide first responders the only service that is the scale that'",
        "'speaker_2': 'can fill the role of exigent first responders as of our deliberations right now. Today is the police department. I didn't support Amendment A because the only way we're going to realize the future vision that all of us on the council share is going to be continuing to make steady and consistent investments in the Human Services Department to'",
        "'speaker_2': 'develop and and other departments to develop and create these response services and have those programs continue to be evaluated and scaled to take on new and bigger duties. But until that time, we need a viable police department capable of responding to exigent calls for service.'",
        "'speaker_2': 'For that reason, I'm voting in favor of taking a currently on dedicated portion of salary savings for some of these hiring and retention services and strategies, and will vote in favor of the amendment today.'",
        "'speaker_0': 'Thank you so much, Councilmember Lewis. Councilmember Saillant, you are next in line.'",
        "'speaker_5': 'Thank you again. I will be voting no on this amendment. I won't repeat what I said for the previous vote, but this proposal has all the same problems. I do not support increasing repressive policing. We should instead invest in reducing inequality.'",
        "'speaker_5': 'One year ago, council members were saying that they could not defund the police in 2020 as promised because they would require several months to lay off worker officers, police officers. But they said, don't worry, they will do so in 2021.'",
        "'speaker_5': 'Then in 2021, rather than cutting the bloated police budget, they instituted provisos to study out out of order layoffs. Now the supplemental budget ends those provisos, and they are talking about hiring bonuses to increase the size of the police force.'",
        "'speaker_5': 'The thing that change is the movement in 2020 where we had thousands on the street in Seattle, streets in Seattle protesting police violence. I do not support reinstituting hiring bonuses for the police and will be voting no on this amendment.'",
        "'speaker_5': 'And as members of the public know, I do have an amendment from my office to actually put some of the money in to the supporting Safe Communities, funding the Human Services Department. That will be upcoming. And I'll speak to that at that time.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thanks so much, Councilmember Swann. Are there any additional comments on Amendment three? B Councilmember Maceda, please.'",
        "'speaker_1': 'Thank you. Council President. Colleagues, I, too, wanted to give you my rationale for voting no on this amendment. I want to start with reminding ourselves about what is in this amendment. What is in this amendment largely reflects conversations that we've had with community, with the Seattle Fire, with members of the mayor's office about ideas to make sure'",
        "'speaker_1': 'that we are addressing some of the pressing stressors that we see in PD. That includes making sure that there is full funding, as requested for the mental health provider, full funding for the paid parental leave. As we know, more people have taken paid parental leave on sick leave because of a pandemic, which is something we want them'",
        "'speaker_1': 'to be doing. This includes the requested civilian support positions at 1.047 million to make sure that there's additional people who can respond to crises so that it doesn't have to be an armed officer with a badge and includes it includes a half a million requested for the King County Regional Peacekeepers Collective focused on addressing gun violence in'",
        "'speaker_1': 'King County. That is a proven public health strategy, again, as requested, to help relieve officers with the gun from having to show up. It also includes the requested 700,000 for triage, one with the additional amendment that we will be making to make sure that there is a appropriate and well thought through protocol system so that we are'",
        "'speaker_1': 'having community places where people can go when 911 when is called a true landing zone. We've included these things in addition to making sure that the CDC or the new department that we're standing up has the support that it needs to invest in the protocol system that Councilmember Herbold led on last year.'",
        "'speaker_1': 'It includes the two positions for public records, disclosure and i t to help alleviate some of the pressure that SBT is currently facing, apparently for their lack of response to their public requests, public records request. And we have included these positions to make sure that we're addressing the long backlog of PDR requests that will hopefully relieve some'",
        "'speaker_1': 'of the pressure on the existing staff as well. And in the wake of last year's uprising, there has been rightfully a call for us to increase demand for transparency and records requests. We want to do this. In addition to that, I want to underscore the importance of what council members have been talking about this morning, and that'",
        "'speaker_1': 'is the investments that we were making previous and today, and the Human Service Department, community safety programs. We have included in this proposal $3 million, as we talked about previously, to make sure that our community organizations who are showing up as alternatives to policing are are able to have funding not just for a year and a half'",
        "'speaker_1': ', but stability for two years, which is something that we've heard directly from frontline fire responders, which is so critical for those who are experiencing mental health or behavioral health issues, a place to go. So I bring that up to underscore the importance of what is in this bill to address the pressure that we have been hearing about'",
        "'speaker_1': '. But it is also important to put that information in context of what the data set data has been mentioned in this comment so far. So I want to emphasize what we see from the Marshall Project that led with the headline recently that said, Police say demoralized officers are quitting in droves.'",
        "'speaker_1': 'Labor Day data says no. Well, other industries were devastated by the pandemic last year. Police departments across the country, including in Seattle, saw a much smaller impact, according to federal data. Those worries were founded that U.S. economy shed 6% of workers and local police departments lost under 1% of employees.'",
        "'speaker_1': 'Now, that attrition is something that we are all working on addressing by way of the investments that we're making today, by way of the 3 million plus the 10 million that we've invested in community contracts. We are not not acting today.'",
        "'speaker_1': 'We are acting. But we have to talk about why we're acting in the way we are. We're acting the way we are with this hybrid approach to invest in community partnerships. Because we know from the National Institute of Criminal Justice Reform, the analysis of Seattle Police Department calls for services between 2017 and 19 found that of the'",
        "'speaker_1': '1.2 million calls for services covering that period, nearly 80% of the calls were for non-criminal events. So to me, that means it is important for us to be scaling up the non-criminal response side. That is why I think it's important to have this balanced approach that we worked on in the amendment.'",
        "'speaker_1': 'If only 6% of those calls were associated with felonies, I think that that really underscores the importance for hiring strategies, retention strategies and community oriented solutions to create stability for community alternatives to policing. That is what I think the proposal in front of us reflected.'",
        "'speaker_1': 'I'll continue to work with all of you as we work to make sure that we are addressing the stability that our community partners need so that there truly is an alternative to investing in alternatives. Lastly, I think that this.'",
        "'speaker_1': 'Policy is a policy decision that should have been discussed in more detail, either in committee or in a future committee, for the purposes of really answering the questions about how the strategy would work. Today, I would offer to you colleagues that the both investments that we're making help relieve some of that pressure that we're hearing about and'",
        "'speaker_1': 'also appropriately invest in community oriented solutions. So for those reasons today. Thank you.'",
        "'speaker_0': 'Councilmember Mosqueda, are there any additional comments amendment being. Okay. I'm not hearing any additional comments on Amendment three B, so I'm going to go ahead and call on Councilmember Peterson for closing remarks on this amendment.'",
        "'speaker_2': 'Thank you. Council president and colleagues, thank you for the discussion today. I remain committed to reimagining reimagining policing and revamping the police contract to provide the most effective pathways to community safety. But I believe that includes a combination of strategies, and that includes not only our increased investments in upstream human services programs and alternatives, alternative responses, but'",
        "'speaker_2': 'also acknowledging the staffing crisis. We've known about the staffing crisis for months. I agree it should have been discussed earlier, and I believe that we've got an obligation on city charter to provide adequate police protection in all districts.'",
        "'speaker_2': 'So we need to do both. And I think we can and I look forward to the vote on this and further discussions in the future. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson, will a quick please.'",
        "'speaker_1': 'Call the roll.'",
        "'speaker_0': 'Call of Amendment Three?'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Her bold. I know. Suarez.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Now. Macheda now. President Gonzalez.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Four in favor, five opposed.'",
        "'speaker_0': 'The motion fails and the amendment is not adopted. I believe we have another amendment and this one is sponsored by Councilmember Mesquita. I'm going to hand it over to you to make your motion.'",
        "'speaker_1': 'Thank you very much. And Councilmember Herbold, appreciate your leadership on this as well. Colleagues, I move to amend Council Bill 1 to 0 112 as presented on amendment number four on the agenda that.'",
        "'speaker_0': 'It's been moved and seconded by Councilmember Herbold to amend the bill as presented on Amendment four. I'm going to hand it back over to councilmembers to walk us through the amendment.'",
        "'speaker_1': 'Thank you very much, colleagues. We are bringing this amendment forward to you after it being drawn to our attention from first responders at the fire department who are on the front line. That the triage response proposal was a step forward.'",
        "'speaker_1': 'But the best use of our limited resources responding to noncriminal 911 calls is to make sure that we have a place to send folks. We don't want there to be a triage unit that gets deployed and then not to have a landing place for folks.'",
        "'speaker_1': 'And we also know that there's much work in the pipeline thanks to Councilmember Purple leadership, to create a protocol system that is currently being designed as well. We want to make sure that that protocol system is truly fleshed out so that we don't have a system that ends up referring folks to an emergency room or seeks housing'",
        "'speaker_1': 'and shelter or medical services when there isn't capacity to receive them. We know that much of our shelter services, including the most recent data that we got last Thursday when meeting with Lead and Reach, folks show that there was only five beds available for the entire night.'",
        "'speaker_1': 'For all of the folks who are experiencing homelessness out there and the intent of the trail system is well-received. We also just need to make sure that that protocol system is aligned with making sure that there is a place to go for those who get visited by the triage team.'",
        "'speaker_1': 'I appreciate the work on this. And again, thanks to ATF Local 27 for their thoughtful approach to this Councilmember Herbold, for her leadership and co-sponsorship on this, and to central staff and the team who has helped create this proposal in front of us, we all want a complete response protocol that at a minimum identifies confirmed service providers'",
        "'speaker_1': ', case managers, health, mental health providers and support systems to make sure that folks are getting the care that they need after that call is made. So looking forward to learning more from that complete protocol system. And the proposal under this amendment will be lifted when that report is submitted to Council to Councilmember Health Committee.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember Herbold, I see that you have your hand raised, please.'",
        "'speaker_3': 'Thank you. Yes. Real quickly, I just want to flag that this amendment and proviso is not in any way intended to slow down the launching of the proposed cash program. As soon as authorizations and operations are approved and after the establishment of the protocol system, that will make it possible for the Community Safety and Communications Center to'",
        "'speaker_3': 'dispatch a response to the sort of right size the dispatch, and ensure that they are sending the right person to the either the one on this check or the person on call as proposed by the by the triage one program.'",
        "'speaker_3': 'This amendment also flags another. It's a discussion that that we're having in the city right now about where the staff for the for the trash programs should be housed. There is some interest in having that be housed out of the Seattle Fire Department.'",
        "'speaker_3': 'I just want to remind counsel that the other vision for the Community Safety and Communication Center is broader than just a new department to house dispatch functions. And we recently made the decision that we are not going to house parking enforcement officers within the new Community Service Communications Center, despite our our intention, our stated intention to do'",
        "'speaker_3': 'so legislatively last year. We made a different decision a couple of weeks ago. I want to flag that this amendment parks these dollars, the dollars that are for staff in finance general, while we continue the discussion of whether or not these bodies should be housed in the fire department or in New DC and flagging, if we if'",
        "'speaker_3': 'we make the decision to not have the triaged one pilot program and the staff beat the staff of Ccxi, we may be deciding to to minimize the foot print of the CSC CC to become more than a dispatch function.'",
        "'speaker_3': 'So just want to just want to flag that we have asked Seattle Fire Department and the FCC for information about the pilot startup aims under both scenarios. And we have heard from the Budget Office do not believe that leaving Ridge one in CSC you see would delay implementation, would require additional resources.'",
        "'speaker_3': 'And so I look forward to sharing with the rest of the council information I receive from Chief Scoggins, as well as Director Lombard, about those projects up times for stage one under both scenarios. Thank you.'",
        "'speaker_0': 'Thank you so much. Are there any additional comments on Amendment four? All right, customers get it. Anything else to add? There's a dance party unfolding in my living room. So sorry about that. Hope you guys all like the Rio soundtrack.'",
        "'speaker_0': 'With that being said, will the third place play a role in the passage of Amendment four?'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Suarez I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Mosqueda. President Gonzalez I nine in favor and unopposed.'",
        "'speaker_0': 'All right. The motion carries, the amendment is adopted and the bill is before the council. We do have one additional amendment to consider, and that is council members, the wants amendment. So consumers want to hand it over to you to make your motion to get the amendment before us.'",
        "'speaker_5': 'Thank you. President Gonzalez I move to amend Council Bill 1 to 0 112 as presented on Amendment five, which was recently distributed, which cuts $2.41 million from the SPV and adds that $2.4 million to the supporting Safe Communities Fund in a just second.'",
        "'speaker_0': 'Thank you so much. The amendment has been moved and seconded so many. Hand it back over to you. Council members want to walk us through the amendment.'",
        "'speaker_5': 'Many of the comments that I made earlier, they remain valid for this one as well in terms of why this amendment is very important. And we know that last year the city council placed provisos on $7.5 million in the city budget for this year in response to the demand from the Justice for George Floyd movement last year'",
        "'speaker_5': 'to reduce the spending on repressive military policing and to instead invest in building and supporting communities, which, in my view, as I said in briefing, I think is the least that the city council should be doing. This supplemental budget, the supplemental budget as a whole removes the provisos, essentially freeing up an additional $7.5 million in the police'",
        "'speaker_5': 'budget and only transferring part of those funds to other departments. $2.41 million is the remainder of the balance that this amendment addresses. And as I informed the city council this morning, this budget amendment is in response to the request from the activist of Decriminalize Seattle to transfer the Seattle Police Department salary savings into community funding as the'",
        "'speaker_5': 'Council member committed to do last November. And I hope that council members would support it, especially keeping in mind the powerful public testimonials that were provided by activists, ordinary people, community members, including medical professionals, as to why this is important.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_0': 'Customers want are there any additional comments on Amendment five? I see that Councilmember Morales.'",
        "'speaker_1': 'Has her hand raised, so please.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_6': 'Thank you. Council President So I am going to support this amendment. And as as we've all been saying, it's for me, it's for a couple of reasons. During our deliberations last year, the council worked with Community. Our office worked very hard with community to begin investing in a new ecosystem, a community safety ecosystem that really acknowledges humanity'",
        "'speaker_6': '. Our residents, particularly for black and brown people. So I think we made a lot of strides. We've created a new division within each city to look at, particularly invest how we invest in community organizations that have alternative options for what community safety could be.'",
        "'speaker_6': 'And we've come a long way in beginning to repair the harm done to our communities, just acknowledging that need by setting up these systems and creating some initial investment, that if we're going to have the outcomes that we seek, we really need to commit to the kind of investment that it will take to change the community conditions'",
        "'speaker_6': 'that lead community safety challenges. And I think also Member Lewis earlier laid out a lot of those programs and the efforts that we have begun, but we aren't nearly done that work. And as several folks have said, the investments that we've made are our short term.'",
        "'speaker_6': 'We really need to be looking at how to invest in the sustainable ways that those organizations can scale up and can really have the kind of outcomes we're talking about. And so that's one thing I'm interested in. The other, though, is that as the fiscal body for the city, our budgetary and policy decisions are just that.'",
        "'speaker_6': 'They are decisions for the legislative body, and that is our role. These aren't permissive. They aren't suggestions to the department. The appropriation authority that is given to the departments are guardrails. We we we have a check and balance system, the executive authority and this isn't theoretical, something that's codified in state law.'",
        "'speaker_6': 'So I think it's important to remember that we're in this position in part because of an intentional overspend on overtime last year and on several other things. And it's important to recognize that public officials are not allowed to willfully overspend their budget.'",
        "'speaker_6': 'Our state values fiscal responsibility, such that over expenditure can result in a misdemeanor. So I think it's important for us as we continue this conversation, and particularly as we move into budget conversations in the fall, that as a deliberative body, we make a decision on rebalance today on the appropriation.'",
        "'speaker_6': 'This isn't something that should just be cured. Overspend shouldn't just be cured by exceptions later. So I hope that as we move into the fall discussion and into next year's budget, that we continue to support thoughtful process for community investment and that we really commit to holding a speedy, accountable to appropriation in the future as we do'",
        "'speaker_6': 'every other department. They have to perform within their authority in order to serve the city best. And I just want to to encourage all of us to keep that in mind as we continue this discussion and as we begin the next discussions over the next few weeks.'",
        "'speaker_6': 'So I will be supporting this amendment. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Morales, because when I see that your hand is raised as well.'",
        "'speaker_3': 'Thank you so much. As I understand it, this amendment would by cutting 0.41 million from the 2021 budget and adding 2.41 million to the Human Services Department's budget. In addition to the 3 million that the Finance and Housing Committee added to the budget from SBT, that this would basically undo 2.4 million in decisions that the committee made'",
        "'speaker_3': 'and. In our closing remarks. I'm sure we'll get into that and how those investments support community safety. I simply can't support boiling point $4 million off of work we have painstakingly done in in. In Finance, in Budget Committee, without knowing specifically of approximately $15 million of the segments where those dollars would come from.'",
        "'speaker_3': 'In addition, if the amendment were asked, it's very likely that SPD will request additional creation authority from the Council later in 2021 to pay for some of the expenses that we have agreed in the bill coming out of committee that we should pay.'",
        "'speaker_3': 'And as I mentioned before, it's a high priority of mine to work with the executive to identify what spending priorities are shared between the executive and the Council and to grant that authority. Other than renewing a scenario where they they fund their priorities and ask us for permission to to to backfill those expenses after the fact.'",
        "'speaker_3': 'And then Ellie is unclear. You know, one of the provisos lifted is a $550,000 proviso that restricted funds and PPE. And a report on Harbor Patrol Services report was sent in June and lifts the proviso as a matter matter, and I'm not sure that this was considered I amendment sponsor in the calculations of the amount be cut'",
        "'speaker_3': 'for speedy. So again there's a lot of me there's a lot of uncertainty about where these dollars would come and how that would intersect with the decisions that we already made in committee. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Herbold. Okay. Any other comments on Amendment five? Not seeing any additional hands raised comes customers want you're the sponsor this amendment so you get the last word.'",
        "'speaker_5': 'Thank you. I'm not sure I understood exactly what Councilmember Herbold was saying. And forgive me if I'm Miss Mis mistaking what was said. But just to be clear, the amendment that I've put forward does not touch the Highway Patrol proviso funds.'",
        "'speaker_5': 'And, um, and I believe also Councilmember Herbold said something to the effect. I mean, I'm not putting you in paraphrasing you that, that if the Council does not through council passes this amendment, then SBT will come back anyway to ask for more.'",
        "'speaker_5': 'Well, of course, they will do so anyway. Obviously, that that's been the practice, but this amendment comes from precinct budgets. Just to be clear. And so I'm not sure that that should be a problem, really. And it is.'",
        "'speaker_5': 'It is. It is. It should be. I mean, I'll tell you this, it should be completely possible for the police department to do their work without these $2.41 million. So I would really urge the Council to support the amendment.'",
        "'speaker_0': 'Okay. Thank you so much. Councilmember So once I did make a call for last comments, but I think I heard Converse wasn't asking for clarification from Councilmember Herbold. So Councilmember, did you want an opportunity to respond? And of course, consumers want if you want to have the last, last word you are will be entitled to due to'",
        "'speaker_0': 'have that right under the council.'",
        "'speaker_3': 'And we're under my clarification. I have to make as I'm reading from the simple staff memo, I think.'",
        "'speaker_0': 'Because there isn't anything else to add that closes out.'",
        "'speaker_5': 'No.'",
        "'speaker_0': 'Okay, great. Well, thank you so much. Appreciate that. Okay, colleagues, I'm not seeing any additional hands raised or anyone waving at their camera to get my attention here. So we're going to go ahead and conclude debate and call the roll on this.'",
        "'speaker_0': 'So will the clerk please call the roll on the adoption of Amendment five?'",
        "'speaker_2': 'Peterson No.'",
        "'speaker_1': 'Sergeant.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'STROUSE No.'",
        "'speaker_3': 'Per bolt? No.'",
        "'speaker_1': 'Juarez? No.'",
        "'speaker_2': 'LEWIS No.'",
        "'speaker_1': 'Morales As. Most clever, though. President Gonzalez now two in favor, seven opposed.'",
        "'speaker_0': 'Thank you so much. The motion. Passive and sorry. The motion fails. I'm looking for the language. Motion fails and the amendment is not adopted. Are there any further comments on the bill as amended? Councilmember, do you have your hand?'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_3': 'Thank you so much. I just would like to make some comments on the overall bill that I've been I've been holding as we go through the amendments. I want to really thank our housing and finance chair, councilmember mosqueda for her clobber on this legislation.'",
        "'speaker_3': 'The amendments regarding the Seattle Police Department budget up the committee show strong commitment to addressing the officer shortage by reducing the workload on sworn officers who have stayed with Seattle, as well as implementing as well as supporting implementation of alternative funding in this bill, or speed for the community service officers and crime prevention coordinators.'",
        "'speaker_3': 'There's funding for SPV, for hiring process accelerators for both sworn officers and civilian hires. There is funding for the nine on one call data analysis that we have received from the National Institute for Criminal Justice Reform. Support Reimagining Policing.'",
        "'speaker_3': 'There is funding for the work, scheduling and timekeeping project so important aiding in modernizing spd's management of our time and as well as management of off duty work and addressing the recommendations by the City Audit are in 2016 and recommendations recently made by the Office of Police Accountability 1.5 million.'",
        "'speaker_3': 'For over time, SPD stood 3 million. Both the Mayor and council opposed reductions for in the overtime budget. Well, actually, I should probably not mention the 1.5 million for overtime because I think we've made it an amendment. Take some of the money of the 1.5 million in overtime out of the budget.'",
        "'speaker_3': 'So that is an issue that we might need to take up. And since additional events are now taking place, more overtime ending may be needed. We've now scooped that extra funding for the initial action around our retention and recruitment services.'",
        "'speaker_3': 'Nine SPV funding that is included in this bill, but that is still so important to community safety. Is funding for phase one, both funding for the program, the bodies themselves to do the response. But also as we've talked about the patch protocols funding or the regional peacekeepers collect of this is so important right now.'",
        "'speaker_3': 'Community violence intervention programs such as the Regional Peacekeepers Collective have been shown to reduce violence by as much as 60%. The mayor had proposed funding that in the 2020 budget and I'm really glad we are today making a down payment on it in 2021.'",
        "'speaker_3': 'And then finally, two other items, one related to recommendations from the inspector general, that is, funding for evidence storage space. We are at capacity for the storage of critical evidence that's necessary for for our ability to pursue charges against offenders.'",
        "'speaker_3': 'And that could be everything from cars to actual other types of of of evidence. And then finally, funding for additional disclosure work as recommended by the city auditor. Many of these items, not all of them, but many of them are priorities that I had in the spring.'",
        "'speaker_3': 'And then I had proposed funding for in a speedy budget, but did not ask. And so I'm really, again, dazed and grateful that Chair Mosqueda, within the context of the mid-year supplemental, has provided the opportunity to discuss those those important priorities and investments.'",
        "'speaker_3': 'Again.'",
        "'speaker_4': 'The.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_1': 'Councilmember.'",
        "'speaker_0': 'Herbold. Excuse me. I do see that Councilor Roslyn has her hand raised. So because we're.'",
        "'speaker_5': 'Just making sure this is the time to make general comment and supplemental budget.'",
        "'speaker_0': 'Yep. This is the time for general comments on the bill as amended. We don't have any more amendments, so this is your opportunity to make comments about the bill before we vote on the bill, isn't it?'",
        "'speaker_5': 'Thank you. I will be voting no on the supplemental budget, which, as we just saw, has been used by the political establishment as a vehicle to increase the funding available in the bloated police budget by 2.4 million $1 million by reversing $7.5 million in provisos that were won by the Black Lives Matter movement last year.'",
        "'speaker_5': 'As I have said during budget votes for the past nearly eight years now a budget is a moral document, and this budget continues to betray the victories of the Black Lives Matter movement. As several people mentioned in public comment spree flagrantly wastes public resources.'",
        "'speaker_5': 'And this is on top of the fact that they have an already bloated police budget. Just look at their spending of over $2 million on Accenture, which, in addition to other various suits and fraud cases, has been listed.'",
        "'speaker_5': 'Accenture as a corporation has been listed in the federal contractor misconduct database nine times since 1995, with $124.2 million in penalties. That contract alone is almost enough to fund two tiny house villages for a year in what was being spent on Accenture.'",
        "'speaker_5': 'That's just a small factoid in the overall story of how much wrongdoing there is in relation to the police department. However, before I close, just like in previous budget votes, even though I have voted no on the budget as a whole because it has not lived up to being a genuine moral document, standing up for the needs'",
        "'speaker_5': 'of working people, oppressed communities and the poor. I do want to highlight what has been won by grassroots organizing the work of my office and the people's budget movement. Particularly, I want to acknowledge the work of all the Garfield Super BLOCK activists who worked with my office to successfully win funding to make the Garfield Super BLOCK proposal'",
        "'speaker_5': 'shovel ready after a decade of delays. The Garfield Super BLOCK canvass comprises the Garfield Community Center, Medgar Evers pool, the tennis court, an adjoining Garfield Park, including the historic Garfield Ballfields, the Teen Life Center, the Quincy Jones Performing Arts Center and Garfield High School and Track and Field.'",
        "'speaker_5': 'The $500,000 in funding now included in the supplemental budget bill will complete pre-development work for this project. Allow it to be shovel ready in 2022. The Garfield Super BLOCK is a grassroots effort to create a vital civic space that honors and tells the story through art and cultural representations of the people who have lived here over the'",
        "'speaker_5': 'millennia, from the Amish people to black Americans today. The Garfield Super BLOCK, working with staff from the Parks and Recreation Department, aims to enhance the area around the Garfield Community Center, the McGovern School under Garfield High School with art that celebrates the area's history with new trees and walkways to ensure access for all.'",
        "'speaker_5': 'New, safe, publicly accessible bathroom facilities and other urgently needed community amenities. And it is precisely the kind of public project that should be funded in neighborhoods like the Central District. When completed, undoubtedly this will be a community gem and will be greatly valued.'",
        "'speaker_5': 'Unfortunately, like many such project in working class communities of color, the city had loved the Super BLOCK unfunded for over 15 years. And so this is exciting that it is starting to come to fruition. After that, over the last three months, my council office has worked closely alongside the Garfield superbug activists to organize working people support for'",
        "'speaker_5': 'this project. Among more than 600 community members signed our community petition and wrote letters to council members, and dozens of people spoke up in public testimony. And organizers worked with our office to organize a public event at Garfield Community Center, where community members learn much more about the project.'",
        "'speaker_5': 'And really, it wasn't even I was there myself. It was an event that really brought the community together, especially in the time of isolation because of the pandemic. Winning this funding is an important victory for the Central District and is entirely the result of organizing and activism of ordinary people.'",
        "'speaker_5': 'In two weeks, the City Council will begin discussing the city budget for the next year. The lessons from this supplemental budget vote today is that we can win transformative victories if we have powerful people's budget movement work, which we have seen year after year, yield many victories for art, for working people.'",
        "'speaker_5': 'Or we can have our communities continue to fall further and further behind if we do not have a movement. It all will depend, as always, on organizing and movement building. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Swann, for those comments. Are there any additional comments on the bill as amended? I'm not seeing any hands raised. So we're going to go ahead and close that debate by having council members get to make closing remarks.'",
        "'speaker_1': 'Thank you. President just wanted to say thanks to the Vice chair for her complete summary and accurate summary. And also to note that it is actually a reduction of 5 million to SDD, not an increase of 2 million.'",
        "'speaker_1': 'Thank you, Vice Chair for summarizing. So completely no additional comments for me.'",
        "'speaker_0': 'Thank you so much. That does conclude debate on this particular council bill. So I'm going to ask that the clerk please call the roll on the passage of the amended bill. Go ahead, Madam Clerk.'",
        "'speaker_1': 'Councilmember Peterson.'",
        "'speaker_2': 'Gets.'",
        "'speaker_1': 'To want?'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Strauss. It's purple. Yes. Paris, I. Louis?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Let's get that. I. Morales yes. And Council President Gonzalez I eight favor one opposed thing so much the.'",
        "'speaker_0': 'Bill passes as amended and the chair will sign it. Will the piece affix my signature to the legislation on my behalf? Will please read item four into the record.'"
    ],
    "Lease Agreement with the Port of Seattle for the Tsubota Property.": [
        "'speaker_1': 'Jan Davenport Council 120 165 Relief to the Department of Finance Administrative Services authorizing the Director of the Department of Finance Administrative Services for the Director designate to negotiate and accept and execute a real property lease with the Port of Seattle for vacant land known as the super up property and ratifying confirming certain prior acts to recommend the'",
        "'speaker_1': 'bill passed.'",
        "'speaker_0': 'Thank you so much. Council members get them to hand it back over to you to provide the committee report on this council bill.'",
        "'speaker_1': 'Thank you and sorry, colleagues to be off camera. I'm just unstable internet for a second. Colleagues agenda item number four is legislation that would authorize a new lease for the Port of Seattle to use their vacant land in an urban neighborhood for continued use and expansion of townhouse village site.'",
        "'speaker_1': 'This would add approximately 30 additional units at the Inner Bay Village. This legislation is needed to allow for the lease of the expanded property that is approximately 44,000 square feet, which exceeds the FAA assets directors leasing authority. We worked really quickly to get this legislation to the Finance and Housing Committee so that we can move forward on'",
        "'speaker_1': 'this tiny village as quickly as possible. And again, to underscore the importance of what we talked about this morning, to make sure that there's no further delays in standing up emergency housing options. I want to thank central staff and Aaron House on my team for their work on this.'",
        "'speaker_0': 'Thanks so much. Consumers get it. Are there any comments on the bill? Lewis, you have your hand raised. Go ahead.'",
        "'speaker_2': 'Thank you so much, Madam President. And I appreciate the quick movement from council member Ms.. Data and cueing this up and getting this through. You know, we could have passed this, we would have passed this earlier, but we had to wait until the CBO review was done on the site before we could pass this.'",
        "'speaker_2': 'Legislation today to move us one step closer to getting this expanded village in the heart of District seven in the inner bay neighborhood. I just want to give a brief shout out to the Port of Seattle, in particular, Commissioner Bowman, who has been a really, really big booster and advocate for the initial siting of this village and'",
        "'speaker_2': 'now our efforts to more than double that size. And I look forward to continuing that partnership potentially at other Port of Seattle sites as we look for opportunities to expand. More tiny household, tiny house shelters in other parts of the city and build on this great work.'",
        "'speaker_2': 'So thank you again, Councilmember Mosquito. Looking forward to voting on this and getting another one of these villages up and running.'",
        "'speaker_0': 'Well, something you can ask my Lewis. Are there any additional comments on the bill? Hearing no additional comments on the bill. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Herbold. Yes.'",
        "'speaker_4': 'Suarez Hi.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales.'",
        "'speaker_6': 'Yes.'",
        "'speaker_1': 'Mesquita. Yes. Zane Gonzalez Yes. Nine in favor, nine opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the quick fix my signature to the legislation on my behalf? Will the clerk please read items five through seven into the record?'",
        "'speaker_1': 'Agenda Items five seven appointments 1936 to 1938. Three Appointments of Frank Alvarado. Third Orbit Numbers Glass Andrew Parker as Member Community Roots Housing Development Authority Governing Council for Trump March 31st, 2024. The committee recommends his appointments be confirmed.'"
    ],
    "Property Acquisition for Terminal 5 Quiet Zone Improvements Project.": [
        "'speaker_1': 'Every part of the Transportation and Utilities Committee, eight counts about 120 138 link to the terminal, five flights on improvements project under the Freight Spot Improvement Program. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much, Councilman Peterson. I'm going to hand it over to you to walk us through this committee report.'",
        "'speaker_2': 'Thank you. Council president, colleagues, as I mentioned in council briefing this morning. All 11 items on today's council agenda from our Transportation Utilities Committee were recommended unanimously by committee members. This first item, Council Bill 120138 is co-sponsored by Councilor Herbold and will provide limited condemnation and acquisition authority in cases needed to secure portions of property necessary to'",
        "'speaker_2': 'implement a quiet zone that will support freight operations at the Port of Seattle's Terminal five facility and will benefit surrounding neighbors concerned about the noise of the freight trains. Thank you.'",
        "'speaker_0': 'Thank you so much. Are there any additional comments on this bill? Councilmember Herbold, please.'",
        "'speaker_3': 'Thank you so much. I just want to reference that this is a really high priority issue for folks. And one many constituents have written about the noise that emanates from trains entering and leaving T5 at the Shell and Cafe intersection.'",
        "'speaker_3': 'And this is this goes back to to predates the redevelopment of of terminal five. And many have suggested that we should make this area a quiet zone. This led to the development of a statement of legislative intent sponsored by myself in 2016, and that that statement of legislative intent from nearly five years ago requested that a start'",
        "'speaker_3': 'work with the port, the Federal Railway Administration and the railway companies doing business at Terminal five to extend the existing quiet zone from Terminal five to the Dulwich Way West Marginal Way intersection. As we all know, Terminal five has been undergoing a modernization project was just nearly complete and the port expects full rail operations beginning in 2022'",
        "'speaker_3': '. The timeline originally slated for the quiet zone to be completed was was originally in December 2020 in advance of the completion of the Terminal five project. But the project has been plagued with delays associated with the topic of the of the legislation today related to the business tenant's appeal of the design of the quiet zone, resulting in'",
        "'speaker_3': 'the city and port conducting extensive outreach to ameliorate the outstanding concerns of that tenant. And I really appreciate the joint efforts of the city and the port in doing so, but also recognize that given the fact that those efforts have not thus far been successful, this legislation is absolutely necessary to move the quiet zone forward.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember honorable any additional comments on the bill? Okay. And Councilmember Peterson is already letting me know that he is done with his comments. So we won't. We will consider his first word to be the last word on the on this bill.'",
        "'speaker_0': 'Having said, will the clerk please call the roll on the passage of the bill?'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_5': 'Yes.'",
        "'speaker_4': 'STROUSE Yes.'",
        "'speaker_1': 'HERBOLD Yes. Suarez I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales Plus, get a i. President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affect my signature to the legislation on my behalf? Will the clerk please read the short title of item nine into the record?'"
    ],
    "Grant Acceptance and Budget Amendments for Seattle Department of Transportation Projects.": [
        "'speaker_1': 'Agenda Item nine Council Bill 120 159 Building to grant funds from the United States Department, Transportation and other non city sources. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much, Casmir Peterson, back to you.'",
        "'speaker_2': 'Thank you. Council President Colleagues Council 120159 authorizes our Seattle Department of Transportation to accept various grants totaling $40 million. This includes federal, state and regional grants for the West Seattle Bridge, 38 million, a Puget Sound Regional Council grant for 15th Avenue South, and also a pedestrian safety grant for Aurora Avenue North.'",
        "'speaker_2': 'The $1.5 million state grant for Aurora is vital. That state highway has been a dangerous area that we must address for the city to meet its vision zero transportation goals. Thank you.'",
        "'speaker_0': 'Thanks so much to their any additional comments on the bill? Thank you so much. Hearing no additional comments, including from the sponsor. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Sen.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. Why, yes.'",
        "'speaker_4': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes.'",
        "'speaker_1': 'Suarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales s mosqueda i. President Gonzalez. I am favorite and unopposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it will is affixed my signature to the legislation on my behalf. Will the clerk please read the short title of item ten into the record?'"
    ],
    "Drainage Rate Adjustment and Low-Income Credit Amendment.": [
        "'speaker_1': 'And Adam, ten counts go 12012 8 million to drainage services of Seattle Public Utilities Adjusting drainage rates to pass through changes to treatment rates charged by King County Committee recommends the bill passes amended.'",
        "'speaker_0': 'Thank you so much. I want to hand it back over to Councilmember Peterson.'",
        "'speaker_2': 'In council president. Colleagues, as I mentioned earlier today during council briefing, we're finally voting on three utility rate ordinances for Seattle Public Utilities to implement the Strategic Business Plan and Rate Path, already endorsed by the Customer Review Panel and then by the City Council on May 10th via Resolution 32000.'",
        "'speaker_2': 'As you may recall, we had good news with average, as do rates coming in lower than what was promised during the previous strategic plan. And that was made possible thanks to ideas proposed by our previous committee chair, Councilmember Herbold, as well as the focus of general manager Mommy Kara and her team to keep rates low.'",
        "'speaker_2': 'Keeping rates low is important for you and Seattle City Light as rates are essentially regressive, with lower income households paying a larger percentage of their household income for utility bills. The rate ordinance is to be approved today for drainage, wastewater and fresh water.'",
        "'speaker_2': 'And this is the first one, drainage council 4120128. Thank you.'",
        "'speaker_0': 'Great. Thank you so much, Councilmember. So why don't you have your hand raised, please?'",
        "'speaker_5': 'Thank you. This agenda item and the following two items all relate to increasing utility rates. I will speak to all three at once. I will be voting no on all these three bills because increasing utility rates on regular working class people is simply not acceptable.'",
        "'speaker_5': 'In fact, since the COVID emergency began, I have supported community demands to cancel rent and utility debts, and increasing utility rates for those same communities that are facing the brunt of the COVID crisis is going in the wrong and opposite direction.'",
        "'speaker_5': 'The reality is, utility bills are negligible for the rich and for big business, but can be a real burden for working class people. If these bills raise utility rates on big business but not on working people, I would certainly support that.'",
        "'speaker_5': 'In fact, several years ago, when I was the chair of the City Council Committee that the Seattle City Light reported to a move legislation to redistribute the utility costs to the electricity cost to lower the bills of working people.'",
        "'speaker_5': 'But the majority of the council at that time opposed it. I will be voting no on these three bills increasing SB rates. Thank you.'",
        "'speaker_0': 'Thank you so much. Customers want are there any additional comments on the bill? Hearing none. Well, the quick, please, for the role in the passage of the bill.'",
        "'speaker_1': 'PETERSON Yes. So what?'",
        "'speaker_5': 'No.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Whereas I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales a musketeer. I President Gonzalez. I.'",
        "'speaker_0': 'Sorry, I was on mute.'",
        "'speaker_1': 'Eden Faber. Want to pose?'",
        "'speaker_0': 'Oh, it's been almost two years. You think I'd figure that out? Okay, the bill passes, and the chair will sign it with a quick fix to fix my signature to the legislation on my behalf. Well, the clerk please read the short title of item 11 into the record.'"
    ],
    "Wastewater Rate Adjustment and Low-Income Credit Amendment.": [
        "'speaker_1': 'Agenda Item 11 Council Bill 120129 Related Waste Water Services of Seattle Public Utilities Adjusting Waste Water Rates to pass through charge changes to treatment rates charged by King County. Committee recommends the bill.'",
        "'speaker_0': 'Passed as amended. Thank you so much, Madam Clerk. Casmir Peterson, back to you.'",
        "'speaker_2': 'Thank you. Council President, colleagues, my previous comments on steam utility rates apply to this bill as well. Again, the rates are lower than we had originally anticipated. These are the wastewater rates and these are mainly passed through by King County.'",
        "'speaker_2': 'So that's important to note. So the committee unanimously recommended approval. Thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember Peterson, are there any additional comments on the bill? Hearing none will the please call the roll on the passage of the bill.'",
        "'speaker_1': 'Your son?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'So I.'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Herbal est Juarez. I. Louis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales mosqueda i president Gonzalez I 18 favor one opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read item 12 into the record?'"
    ],
    "Water Rates and Charges Revision and Low-Income Customer Credits.": [
        "'speaker_1': 'Gender. Adam 12 accountable 1 to 0 132 Rates and charges for want of services of public utilities, revising water rates and charges and credits to low income customers and amending sections 21.0 4.4 30.4 40 and 21.70 6.0 40 of the settlements for Coke.'",
        "'speaker_1': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much. I'm going to hand it back over to Councilor Peterson to walk us through this bill.'",
        "'speaker_2': 'Thank you. Council president, colleagues, my previous comments on utility rates apply to this bill as well. This is for fresh water. And I do want to take a moment to thank council central staff Brian Goodnight for his his hard work on these bills with Seattle Public Utilities.'",
        "'speaker_2': 'Again, the committee unanimously recommended approval. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Are there any additional comments on the bill? Hearing none. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_5': 'No.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Suarez I noticed.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. The most Jetta I.'",
        "'speaker_0': 'President Gonzalez.'",
        "'speaker_1': 'I. In favor one opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the Court please read the short title of item 13 into the record?'"
    ],
    "Revised Framework for Husky Stadium Transportation Management Plan.": [
        "'speaker_1': 'Agenda Item 13 Resolution 320161 to the University of Washington Safety and Transportation Management Plan. The committee recommends the resolution be adopted as amended.'",
        "'speaker_0': 'Thank you so much. Back to Councilmember Peterson.'",
        "'speaker_2': 'Thank you. Council president colleagues. The University of Washington asked just to prove their updated transportation management plan for major events in and around Husky Stadium, including how the university intends to encourage the use of transit during big sporting events.'",
        "'speaker_2': 'The committee added language to Resolution 32016 to encourage increased use of transit, to reduce traffic congestion and improve the environment, and also to ensure the university covers the full costs of their impacts, including traffic management costs. I appreciate the flexibility from the University of Washington in their crafting and implementation of this plan, as well as the generous'",
        "'speaker_2': 'and insightful input we received from the impacted communities. Thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember Peterson, are there any additional comments on the resolution? Hearing that. Will the court please call the role on the adoption of the resolution?'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_5': 'Yes.'",
        "'speaker_4': 'STROUSE Yes.'",
        "'speaker_1': 'HERBOLD Yes. Suarez, I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. I. President Gonzalez. I nine in favor and unopposed.'",
        "'speaker_0': 'Thanks so much. The resolution is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read item 14 into the record?'",
        "'speaker_1': 'Agenda Item 14 Appointment 2027 Reappointment of Warren Jr as member of Seattle Freight's Advisory Board for Trump two May 31st, 2022. The committee recommends the appointment be confirmed.'"
    ]
}