{
    "Budget Amendment for Small Business Financial Assistance.": [
        "'speaker_2': 'Agenda item one. They're part of the city council. Bill 119 760 126000, which adopts the 2020 budget changing appropriations to the Executive Department's Office of Housing, the Executive Department's Office of Economic Development and Budget Control levels, and from various funds in the Budget for the purpose of providing financial assistance to small businesses and ratifying confirming certain prior'",
        "'speaker_2': 'acts.'",
        "'speaker_0': 'Thank you. I'm going to move past Council Bill 119760.'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'It's been moved and seconded to pass the bill. This bill is sponsored by Councilmember Morales. Would you like to address this bill?'",
        "'speaker_3': 'Sure off me. It's okay. Thank you. Council President Gonzalez. This is a bill I referenced last week. This would add another approximately $1,000,000 to the Office of Economic Development for the purpose of expanding the business stimulus, small business stabilization funds.'",
        "'speaker_3': 'I know there are some folks who are concerned that this is shifting money from the low income housing fund in the Office of Housing. My understanding is that the Office of Housing Plans to do two offers and that there will be an additional opportunity for funding for housing in the fall.'",
        "'speaker_3': 'And while I completely understand the the struggle and this is probably the first of many that we're going to have to balance how we how we make adjustments to our plans during this crisis. You know, it's important that we support small business and certainly shouldn't be pitting them against any housing production that we're going to be doing'",
        "'speaker_3': '. And we know that we have very limited options as a city for how we support small business and community development. BLOCK Grant money is one of our very few options. So I am going to we support this bill so that we can expand the support for small businesses through the Business Stabilization Fund.'",
        "'speaker_3': 'I do want to say, if I might, as I've said many times already during this crisis, we need to be aware of, you know, that we're not robbing Peter to pay Paul during this crisis. And also that as we as we look to these emergency measures that we're taking, that we aren't creating new systems that might perpetuate'",
        "'speaker_3': 'inequities in our community. That said, I do think that it's important that we proceed with this bill.'",
        "'speaker_0': 'Thank you. Councilman Morales, are there any comments on the bill?'",
        "'speaker_1': 'Council. President Gonzalez, this is Councilmember Mosqueda.'",
        "'speaker_0': 'Please, the floor.'",
        "'speaker_1': 'Thank you, Madam President. And thanks to the prime sponsor for bringing this forward, along with the mayor's office for sending it down. I want to reiterate a few points that were made in conversations with the Office of Housing.'",
        "'speaker_1': 'We have been able to confirm that the redirection of these CBG funds will not hurt any existing housing projects, and we will continue to be vigilant, along with our partners in the Mayor's office as we move forward to make sure that there is sufficient funding for housing.'",
        "'speaker_1': 'But the roughly $1 million in redirection will not affect any of our currently funded projects. I want to thank the Office of Housing for their opportunity to engage with us and make sure that we plan for affordable housing projects to move forward.'",
        "'speaker_1': 'That there's not any negative impacts as we think about the emergency that's in front of us, especially as we think about how important it is for folks to have access to housing and affordable housing in the near future.'",
        "'speaker_1': 'When and if this virus continues in the fall and winter, we want to make sure that these housing projects continue and that they're funding allocated this year and next year to moving forward on these important housing projects. I think that we talked a little bit about it this morning and have talked repeatedly about how the COVID pandemic'",
        "'speaker_1': 'has made affordable housing production even more critical. And it really is our only long term strategy for creating affordable housing and stability. So as we ramp up our sheltering capacity and we think about immediate assessment facilities that we're going to stand up soon, having an equal amount of emphasis on building affordable housing is going to be critical'",
        "'speaker_1': '. So I want to thank the mayor's office and the Budget Office for helping to explain the budget impacts of this decision. And I think overall, to echo what Councilmember Morales said, we want to make sure that the COVID crisis, when it means the loss of revenue coming in the door, that we do protect funding for critical services'",
        "'speaker_1': ', including affordable housing, as we think about reallocating funding. I think this is a good use of these funds and and appreciate the effort to get these dollars out the door for our smallest businesses.'",
        "'speaker_0': 'Thank you. Councilmember mosqueda, are there any other comments on the bill.'",
        "'speaker_1': 'After president resolved?'",
        "'speaker_0': 'Okay. So I heard two people, Councilmember Herbold and Councilman Swan. Did I get that right?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay. Councilmember Herbold, I heard your voice first. So I'm going to let you go first and then I'll call on Councilmember seven.'",
        "'speaker_1': 'Thank you so much. I really appreciate knowing that this transfer of funds from the Office of Housing will not impact any current funding commitments that OHSU housing has made to to our affordable housing projects. And we take knowing that the Office of Housing Estimates at this time that they'll have 67 million to allocate the new housing projects'",
        "'speaker_1': 'in need of funding. And of course, I understand that CDBG funds can uniquely support the business assistance program as other city and state funds cannot be used to provide this assistance due to constitutional limitations. We know that COVID 19 will put pressure on many thousands of households who will be out of work or under-employed and struggling to'",
        "'speaker_1': 'make ends meet, as well as pressures on the affordable housing providers who have very tight margins to keep people house. I did reach out to the Housing Development Consortium this weekend. They are supportive of this legislation, but I think we need to assume that housing must be a key component of the city's response to COVID 19.'",
        "'speaker_1': 'And I don't want to regret these kinds of transfers away from the Office of Housing. We know that the Washington Low Income Housing Alliance has made a request of the governor's office that should any future shelter in place, orders be be instituted, that housing production be considered an essential opportunity and be permitted to continue.'",
        "'speaker_1': 'In addition to the housing affordable housing projects that are already planned, it seems very likely that we may have emergency housing related needs, where future CDBG funds could be an important funds source. We've checked in with the city's CDBG administrator.'",
        "'speaker_1': 'We know that emergency housing and shelter is an eligible CDBG activity. It is defined as a public service. We are limited on how much CDBG dollars we can spend on a public service, such as emergency housing or shelter.'",
        "'speaker_1': 'We are only permitted to spend 35.92% of our total CDBG grant on public services. And it has been our policy of the city to spend those dollars towards emergency shelter. So as I understand it, those that 36% has already been contracted out for 2020.'",
        "'speaker_1': 'But our CDBG administrator indicates that Congress may be working on statutory relief to temporarily remove the cap on public services for CDBG. We will be kept updated on the progress on this, but what this means is we may have the ability to use more CDBG funds for emergency shelter and emergency housing related needs related to COVID 19'",
        "'speaker_1': '. And so I think this important conversation that.'",
        "'speaker_0': 'We're having now.'",
        "'speaker_1': 'About striking the right balance between all of these competing needs is is really critical to the council and the city's ability to be fair and meet those needs.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. So on.'",
        "'speaker_1': 'Thank you, President Gonzalez. I have concerns about this bill from the mayor, and I have the concern not only about this bill, but that the concern I'm going to express that it's going to start becoming apparent from the emergency orders that come forward and that it will be an ongoing issue.'",
        "'speaker_1': 'And I have shared my concerns with Councilman Morales in advance, but I wanted to show them here and then also explain what I intend to do with this bill today in the vote. Yes, we already funds relief for small businesses, which are absolutely supported.'",
        "'speaker_1': 'In fact, it was my office, along with community members, that we were able to fight for businesses in the Central District a couple of years ago. And when 6000 $650,000, it was that is unprecedented for really struggling people of color own businesses that we were able to win through organizing.'",
        "'speaker_1': 'And so there's no question that small businesses are struggling, as well as the vast majority of working people who are reeling from this crisis. However, this bill would pay for small businesses by cutting the low income housing fund, and I oppose that.'",
        "'speaker_1': 'But I agree with those members who said that it does not come from currently planned project. That is true, but it takes away from the next round of projects, the projects of the 2020 that will come under the 2020 notice of funding availability.'",
        "'speaker_1': 'My office has checked thoroughly with city council central staff and they estimate that if this those million dollars, if the funding housing funds are not made whole, this would cost ten individual families, individuals or families, affordable homes to live in during this crisis.'",
        "'speaker_1': 'That's concrete. That's a concrete loss that could happen if we if we did not actually take care. And I don't understand why we have to do that when there's actually a lot of money in the city is just in the hands of the wealthy and big business.'",
        "'speaker_1': 'Now, it would be reasonable to ask whether the affordable housing construction was being suspended right now in accordance with social distancing guidelines or shelter in place. That is being anticipated. But we know the notice of funding availability has gone out as planned.'",
        "'speaker_1': 'So either though it will affect the schedule or the scheduled affordable housing for this year, or it will not affect this year, but it will affect, you know, in a in an ongoing basis. And so my point is that regardless of whether this million dollars comes from the spring or fall, no fine.'",
        "'speaker_1': 'Regardless of whether or not construction was suspended, the fundamental problem here that I'm objecting to is the robbing Peter to pay Paul approach that is going to be used by the mayor. I'm anticipating that more more emergency orders of this kind and the council needs to take action.'",
        "'speaker_1': 'But I think all of this is being done in order to avoid taking on big business so that until we have the perpetuation of this politics of scarcity, which I don't accept, most struggling small businesses and working families need to be supported and their need should not be pitted against each other.'",
        "'speaker_1': 'The city of Seattle has an emergency fund of $66 million that is reserved exclusively for emergencies like this. And we should use emergency funds rather than cutting funding for affordable housing and council members. And they argue that the emergency fund will have many other demands on it, which of course is going to be true.'",
        "'speaker_1': 'But we know that $66 million can only scratch the surface of what is needed to support our community at this moment. I mean, we are in a pandemic that is going to result not only in completely preventable loss of life due to the criminal primodos health care system, but we're going to have depression like economic effects, with'",
        "'speaker_1': 'the Fed estimating 30% unemployment rate in the second quarter. I mean, that is devastating. So we you know, that is why Councilwoman Morales and I put forward the Amazon tax. But even that is not going to be enough.'",
        "'speaker_1': 'The city needs to use the emergency fund for more immediate needs. It needs to immediately approve the Amazon tax to make additional funding available. And we need to demand that the state also act by closing corporate tax loopholes and facing big business and taxes on the wealthy at the state level.'",
        "'speaker_1': 'My office checked with us and Gustav about possibly amending the bill to change the source of funding to be the emergency fund. But because that would require our title change, it cannot be legally be done in the same bill.'",
        "'speaker_1': 'That is why if Councilwoman Morales or any other council member were to make a motion to hold this bill from a vote today, I would support that motion or I will make that motion if no other council member makes it.'",
        "'speaker_1': 'And I don't I wouldn't agree if councilmembers are going to say that such a motion holds up emergency relief, I do not agree with that. Today the council could pass an Amazon tax and make relief available. So I don't accept that.'",
        "'speaker_1': 'I wouldn't accept that excuse on its face value, but I will make that motion if nobody else is going to make it. And if the motion. It's a majority rule, and we could easily put forward a replacement bill to use emergency fund.'",
        "'speaker_1': 'Living funds and if there is agreement, my office is happy to rapidly put this together. I know there are concerns that have been expressed that the funds need to be community development block grant money in order to legally be used for this purpose.'",
        "'speaker_1': 'And emergency fund does not come from anybody. We all know that is easily solved by using CWG money from any other part of the budget and backfilling it with emergency funds. And I will use the guidance of the Council President and the City Clerk to make that motion.'",
        "'speaker_1': 'But I also wanted to say that if this bill goes out today, unfortunately it allows to vote no on it. For the reasons I have just explained, we cannot adequately address this extraordinary crisis by simply shifting the damage back and forth between working people and small businesses.'",
        "'speaker_1': 'We need a fundamentally different approach.'",
        "'speaker_0': 'Excuse me. Thank you. Sarah So, unfortunately, I think your intention to hold the bill would be out of order. This bill has been moved and seconded and is now in the discussion phase. If there wasn't an interest in your part to move to hold the bill, I believe that that should have been done consistent with the council'",
        "'speaker_0': 'rules at the time that we were considering approval of the agenda. Will the city clerk please clarify that my understanding of the rules of order here.'",
        "'speaker_2': 'Yes. Come some of us can be quick second so I can get my little cheat sheet out. But I believe that the motion to hold has a higher it's a higher motion. And so therefore, it takes over the motion to pass the bill right now.'",
        "'speaker_2': 'So two calls could be changed and if it weren't, so we can go back to the motion to pass the bill. Okay.'",
        "'speaker_0': 'So customers. So if you intend to make a motion to hold this bill, now would be the time to do that. It would require, I think, a significant and then a majority of the city council to pass. Is that correct, Amelia?'",
        "'speaker_1': 'Correct.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay. I'm not sure exactly the words I want you to use, but I will say I make the motion to hold accountable 119760.'",
        "'speaker_0': 'And Councilor. Excellent. Are you proposing to hold it for a date? Certain or to hold it? Indefinitely.'",
        "'speaker_1': 'But I'm obviously it's not indefinite in my mind, but I don't want to specify a date because I'm not exactly sure whether this will be done in a week or not. But obviously, needless to say, the intention would be to do it, work on it as soon as possible.'",
        "'speaker_0': 'Okay. So yes.'",
        "'speaker_2': 'If you don't mind. So our council rules provided that I'm to hold something to be held for a certain time. As far as a specific date meeting or hour until when the actual item will be taken by the council.'",
        "'speaker_0': 'So in.'",
        "'speaker_1': 'That case, I.'",
        "'speaker_0': 'Miss a lot. No, go ahead, please.'",
        "'speaker_1': 'No, I think I heard Amelia say that I need to attach a date to my motion.'",
        "'speaker_0': 'That's what I heard. Yes.'",
        "'speaker_1': 'Okay. In that case, I will make the motion to hold the bill until the City Council meeting of March 30th.'",
        "'speaker_0': 'Okay. There's been a motion to hold council bill 11976. So until the full council meeting on March 30th. Is there a second? Okay. Hearing those seconds, the motion fails for a lack of a second. So we will now move on to continue discussion of the previous motion that was made, which was a motion that was moved and'",
        "'speaker_0': 'seconded to pass Council Bill 119760. I can appreciate the concerns that were expressed by all of the other council members, including Councilor Sylvan, and I understand that we want to make sure that as we are considering these emergency funding sources, that we are doing so in the full context of making sure that we are not sort of'",
        "'speaker_0': 'engaging in mission creep, if you will, where we are taking from other priorities to address the needs of of the emergency response as it relates to the coronavirus. And fortunately, there will be situations, I think, where we will need to make some intentional, transparent decisions that might require reallocation of funds, either in the short term or the'",
        "'speaker_0': 'long term. And I think it is prudent for us to have a conversation with the executive and with the guidance of our council central staff and the Chair of the Finance and Housing Committee to make sure that we have a clear understanding of where those lines are drawn.'",
        "'speaker_0': 'I do want to address sort of the issue around small businesses and the intersection between that and affordable housing. Several of us have already spoken to that. I want to clarify that. It's my understanding that one of the largest housing nonprofit housing consortiums, the Housing Development Consortium, does support this proposed Small Business Stabilization Fund and the legislation'",
        "'speaker_0': 'to expand that fund. They have indicated in an email to Councilmember Herbold, dated March 23rd at 1:48 p.m., that they're, quote, anti displacement policy position calls for support of locally owned small businesses with tools that would allow them to thrive in their communities.'",
        "'speaker_0': 'We understand the inextricable link between small business livelihood and the ability of residents to pay rent or mortgage payments and remain housed, which is of paramount concern to EDC members. Now more than ever, we call for compassionate support that keeps us east, keeps us a strong community.'",
        "'speaker_0': 'A close quote. So I think it's important for us to take that into consideration with the understanding that they support the bill, knowing that it's not going to take away from existing projects and really sort of making sure that we understand that this bill is is specifically not in contravention to some of the housing interests we have'",
        "'speaker_0': ', but is, in fact, something that is going to continue to promote this council's priority around ongoing future affordable housing opportunities. We certainly could use more in that regard and look forward to seeing the federal and state resources coming through that allow us to leverage future affordable housing projects through the Office of Housing to make sure that we'",
        "'speaker_0': 'are meeting the dire housing needs of so many in our city that certainly existed before this crisis. And and, you know, as I think many of us are nervous about might be exacerbated as a result of this of this crisis.'",
        "'speaker_0': 'So councilmember councilmembers, any other individuals have comments on this. Otherwise, I will allow the sponsor to make closing remarks and I will call this to a vote. Hearing on Caspar Morales. Do you have any other comments to make on the bill before I ask the clerk to call the roll on the passage of the bill?'",
        "'speaker_3': 'I'll just say that. Well, as we've all said, it's important that we support these small businesses. You know, this is one of the few CDBG funding is one of the few sources that we have. And many of these small businesses that we're supporting with this fund are themselves low income folks who are dealing with, you know, all'",
        "'speaker_3': 'of the same issues, rental issues, being able to provide for their families. And so the assistance that this provides them is going to be really important. So thank you.'",
        "'speaker_0': 'Thank you, Councilmember Morales. Okay. I will go ahead and ask the clerk to call a role on the passage of the bill.'",
        "'speaker_1': 'Councilmember Herbold, I. Councilmember Suarez. I. Council member, Lewis. I. Councilmember Morales. I. Council members must get a. I. Council member Peterson. Hi. Council members want. No. Councilmember Strauss i. Council President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Eight in favor. One opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Right. We're going to go ahead and move to the next agenda item. Will the clerk please read agenda item two into the record?'"
    ]
}