{
    "Moratorium on Development in Mobile Home Parks.": [
        "'speaker_4': 'The report of the City Council. Agenda item one accessible 119 451 really into land use and zoning w a moratorium on the filing, accepting acceptance, processing and or approval of applications for development in areas currently used as mobile home parks, declaring an emergency and establishing an immediate effective date all by three fourths vote of the City Council'",
        "'speaker_1': '. And I apologize. I was not clear on my order of the agenda. Councilmember Swan, you have the floor.'",
        "'speaker_0': 'Thank you, Bruno. And and let me just say, I don't blame you all for not knowing that there was not the legislation because this is parliamentary procedure. Why would you know it unless you absolutely have to? And even then, it can be very confusing.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'So everybody who's been paying attention to the question of the al-Shabaab mobile home crisis knows what this is about. But I just want to do share to do a three quick stories of what we've heard from our community members at Halcyon.'",
        "'speaker_0': 'And one of them is Renny Hagan, who's a retired bartender and member of Unite Here, a local aid, who told us about being homeless for years, having lived in a tool shed with no heat or electricity or running water before finding a home at Halcyon, where she now tends a garden and grows vegetables for her neighbors.'",
        "'speaker_0': 'She told us she would likely be homeless again if the developers succeeded in evicting the mobile home owners. And she says, for seven years I've had the security without worry, and now they're going to take it away. Eloise MIKKELSON, whom you heard from just now, is the retired machinist and member of the Machinists Union, is a painter'",
        "'speaker_0': ', musician and grandmother who has lived at Halcyon for 16 years. She says this is a caring community. We look out for one another. Some of us really would have no other place to go. You heard from Wesley Shearer, a former Teamster, who is raising a granddaughter who has special needs.'",
        "'speaker_0': 'Halcyon is a neighborhood where Wesley and his family feel safety and trust, he says. Help save our community because that's all we have. We know that what happened, as the committee members have said, was this property went on the market for $22 million.'",
        "'speaker_0': 'Garland based corporate developer named Blue Fawn filed pre-application. The residents have known about this because they got letters in the mail and they got organized. They got they contacted my office and we had an incredibly moving committee meeting on Friday, January 18th, where we had all these testimony and well, not only the residents, but so many of'",
        "'speaker_0': 'their supporters, some of whom we spoke to, they demanded that council take action. As it was said earlier, this demonstrates what you can accomplish by building a movement. And when that movement has its own voice in City Hall, this is what you can accomplish.'",
        "'speaker_0': 'You can actually win victories. And let me just say also, it is nice that Yudof is now saying that they will ask you as bank to sell the property to someone who wants to rent it, run it as a mobile home park.'",
        "'speaker_0': 'But the residents of Halcyon, as those of us who have fought for housing justice for years, no talk is cheap. The residents were promised that their homes wouldn't be saved in the past, but then they were surprised by a notice on their doors last fall, saying that the park was being sold.'",
        "'speaker_0': 'So we know that we know not to trust empty words. We know we have to continue fighting right the way. And we also know that because of our activism, Blue Farm, that developer has backed off for now. But we know better than to take promises and intentions at face value when a 22 million property sale is on'",
        "'speaker_0': 'the line. So if you have intent to keep this property as a mobile home park, then they will have no problem with council passing legislation for flowing from this moratorium to designate this region, this property with the manufactured home park designation.'",
        "'speaker_0': 'And as we've said before, Seattle will not be the first city doing this. The city of Portland has already done that. The Portland City Council unanimously voted last summer to do have a manufactured home mobile home park designation.'",
        "'speaker_0': 'They are mobile home park communities because there was a widespread demand from from ordinary people. Let's preserve for existing affordable housing. I want to do first of all, I want are a lot of people talking, but I wanted to first of all, congratulate the residents of Halcyon themselves.'",
        "'speaker_0': 'Can you please give yourself a big hand? And look at this Seattle Times cover page. This. This my dear friend and fellow activist. This is a testimonial to the kind of power you can build. When we get organized collectively and this has happened because we did that not because any one person championed your cause, but you do'",
        "'speaker_0': 'need your own voice. As at City Hall, as Linda Chase in the article says, there are million there are a million sites where developers can build. There are only two mobile home parks in the city. This is housing for people who don't have a lot of money.'",
        "'speaker_0': 'This is working class housing. Let's preserve it. And as HBO, they can said in the article, it shouldn't take a crisis for you to do something. It shouldn't take people with gray hair crying on your shoulders while these people with gray hair are done crying.'",
        "'speaker_0': 'They are now fighting. Thank you, Councilmember O'Brien, for agreeing to co-sponsor the legislation. Thanks. Thanks also to Kendall Freeman and Denver Doan, who did a lot of the work on this and also getting arrested as usual, the council's central staff director.'",
        "'speaker_0': 'Special thanks to Nick Jones from my office, who spent a lot of time with you all. He's right there. And Jonathan Rosenblum and Saja Soma. And I wanted to join the others who have already said in thanking Unite here.'",
        "'speaker_0': 'Local eight OPIO Local eight. I am Local 751. The Puget Sound Advocate for Retirement Action, the Vietnamese Seniors Association, Trinity Methodist Church, the Faith Action Network. Reverend Angela Yang of the Bethany United Church of Christ. So many spoke in support of the preservation of this affordable housing.'",
        "'speaker_0': 'I really thank everybody. I also want her to know that not Paul Bergman is your long time member of the labor movement who's been here at every meeting with you all. You have a lot of support, but let's not stop here.'",
        "'speaker_0': 'Let's win this moratorium and let's make sure we keep fighting. I do have some closing remarks at the end before we take the vote. Very good.'",
        "'speaker_1': 'Thank you, guys, from Councilmember O'Brien.'",
        "'speaker_2': 'Thank you. Councilmember Swan, thank you so much for your leadership on this. But I really want to give so much credit to the residents of Halcyon for your work to make this possible. In addition to everything that Councilmember Simon said, we have a lot of work to do to protect the remaining two mobile home or manufactured home'",
        "'speaker_2': 'parks in Seattle. And we have a lot of work to do to ensure that we have enough affordable housing for everyone in our city who needs it. And one of the things that you reminded us all again in your testimony today and last week was this is not just about housing.'",
        "'speaker_2': 'This is not just about a roof in a wall, but it's about community. And the power of your community has really showed up in amazing ways. And as we continue to build more and more affordable housing, we need to make sure that we're also creating spaces where communities, powerful communities like yours can form, because that's what we'",
        "'speaker_2': 'need in our city. So thanks for your leadership and work.'",
        "'speaker_1': 'Unless you're any other comments on the base legislation. I believe Councilmember Johnson has an amendment and we could come back to the base legislation for comments as well. So, Councilmember Johnson, you'd like to describe your amendment.'",
        "'speaker_7': 'Thanks. Appreciate that. Council president. As my colleague saw this morning, and for the benefit of the public who've heard this a couple of times, I'll just repeated the amendment that I'm bringing forward this afternoon would make a change to the fifth section of this bill, and it would insert two key concepts.'",
        "'speaker_7': 'The first concept is that a set of recommendations will be developed by the Office of Planning and Community Development and the Department of Construction and Inspections about what a set of long term proposals could look like for something beyond the moratorium that is being proposed today.'",
        "'speaker_7': 'And secondly, that that legislation will be transmitted to the committee that has jurisdiction over it, which is currently the planning land use and zoning committee. So those are the two substantive changes to the amendment. I'm happy to answer questions, but I know that our clerk would like me to read the official movement into the records that we'",
        "'speaker_7': 'have this official in front of us and that I will do. Now I move to amend Council Bill 119451 by substituting Section five as presented on the proposed amendment in front of you.'",
        "'speaker_2': 'Second, as.'",
        "'speaker_1': 'A council member, Johnson has been moved on. Second has made the amendment. Are there any questions? Just on the amendment only. Any questions on the amendment? Or would you like say, any closing remarks on the amendment? Councilman Johnson Councilmember comes from words or some remarks comes from awareness.'",
        "'speaker_5': 'Thank you. First of all, I want to thank Councilor Swan and her staff for bringing this very important issue to city council. And I also want to thank Councilmember Johnson for working with me on doing the making this this amendment.'",
        "'speaker_5': 'I am proud to co-sponsor this amendment. And I also want to thank, of course, the residents and the 47 people that showed up today and on January 22nd to let us know about the concerns about what goes on in the manufactured home mobile park.'",
        "'speaker_5': 'Some of the comments that I'm making now I made this morning, and we want you to know that we understand how important it is for this city council, any legislative authority to look at protecting the stock of homes that is manufactured homes in mobile parks, and that we know how important it is that we protect the use'",
        "'speaker_5': 'of such property. We had an opportunity to look at the law and run these issues by law. We had an opportunity to review the legislation to protect the use of such property over 30 years ago. We had an opportunity to look at the Lynnwood model and the Tumwater ordinance and to understand how the federal courts have upheld'",
        "'speaker_5': 'the city's rights, the legislative rights to protect the use of such property. Our goals here today are to address the lack of housing for our elders, disabled and marginalized communities. We believe that this is an emergency. Things today are not like they were 30 years ago.'",
        "'speaker_5': 'Obviously, I think it's important that the people that showed here today, particularly the residents, that this has never been a us against them attitude. This has always been about that we care that we want to know the facts, we want to the legal posture, and we also want to know where we are on solid ground to make'",
        "'speaker_5': 'sure that it isn't just a moratorium, but that we work towards protecting the land and its use. I want to share that something today that I read and actually last night. And I thought about you folks. You know, being on this job, you make difficult decisions.'",
        "'speaker_5': 'But this was not a hard one for any of my colleagues, quite frankly. But I want to share a quote, and it's really important for me to share this. Democracy cannot survive in a swamp of mutual contempt. I don't know.'",
        "'speaker_5': 'This country can survive if we all continue to despise each other. You don't have to change your mind about something. You don't even have to like me. You just have to realize that the person you're talking to is a human being.'",
        "'speaker_5': 'And sometimes we don't do that. So this issue today has always been about being supportive of particularly our elders. I've been at the Halcyon Park. My staff has been out there. Your circumstances have never been lost on us.'",
        "'speaker_5': 'And so again, I want to thank Councilmember Swan and her staff. I want to thank, more importantly, the residents. I know US chartered busses to come down here. I want to thank my staff who did all the research and the University of Washington, the people that we spoke to, to make sure we understood.'",
        "'speaker_5': 'I want to thank Legal for giving us the analysis that we need to make sure that we can make a sound decision that lasts. And, of course, I want to thank my colleagues that have come into my office to ask questions of.'",
        "'speaker_5': 'Councilmember Bagshaw was out there Saturday, I believe. And you really do have a council that cares. So thank you.'",
        "'speaker_1': 'Thank you, Councilman. Whereas. But I want to address just the amendment right now. There's been an amendment and it's been second. And I'm going to call on that vote. Would you like to see some more words on that concern?'",
        "'speaker_7': 'Just briefly, you know, I want to offer that as part of public testimony was mentioned, that people are going to be keeping a close eye on me and my committee. And when we're planning to take this up, it's our intention stated in this proposed amendment that we ask for a preliminary list of options to be delivered by'",
        "'speaker_7': 'April. So if in case people aren't clear enough that we're keeping this as a front burner issue, we're expecting at least a draft list of recommendations to come to us in April with the goal of adopting something before the end of our sort of policy calendar year, which is generally in the September or so time frame.'",
        "'speaker_7': 'And that's going to include a broad list of options. Many folks have talked about the Portland model, which allows for current property owners to transfer their development rights to other properties. There have been lots of discussions about the access to funds out of Olympia for people to be able to purchase the the land that they sit on'",
        "'speaker_7': 'for what would effectively be a home ownership opportunity, an edge away type situation. There's a lot of options available to us, so we're going to be discussing this more and looking for recommendations coming as soon as April.'",
        "'speaker_1': 'Thank you, Councilman Johnson. Okay. So it's been moved on second. And all those in favor of the amendment as articulated by Councilmember Johnson, please say I, I, all the polls say no live. The ayes have it. So now we are back to our base.'",
        "'speaker_1': 'Legislation as amended would come from our backs. I'd like to say a few words.'",
        "'speaker_0': 'A quick thank you to all of you. I did get a chance to visit on Saturday again, and I just want to very respectfully say thank you for coming and putting your arms around each other because you've created a caring community that really is a.'",
        "'speaker_3': 'Model for others. And I'll be honored to be.'",
        "'speaker_0': 'Voting yes for this moratorium and working with Councilmember Johnson to find the options that will really protect you long.'",
        "'speaker_3': 'Term.'",
        "'speaker_1': 'Thank you, Councilman Bagshaw. Consumer.'",
        "'speaker_6': 'Herbold Thank you. Just really quickly, I want to just sort of give a nod to your vigilance as somebody who used to herself be an organizer with the tenants union, as Ashfield Dickens was once. And I think Reverend Rich Campbell, I don't know if he's still in the room, was a founder of the tenants union.'",
        "'speaker_6': 'Vigilance is really important. And a lot of times, so many times the folks who are out there in the community in this case, in in your community or in other cases in apartment buildings, really know more about what's going on than than city government does.'",
        "'speaker_6': 'And so we really rely on you and your expertize and what you're hearing on the ground from your property managers or or from what what you're seeing from talking to one another. I think that's really important. And thank you, because it's really what's.'",
        "'speaker_3': 'Allowed us.'",
        "'speaker_6': 'To act. If it if it was not for your vigilance, we would actually be very limited in how we could act if this had gone on much further. So thank you.'",
        "'speaker_1': 'Thank you. Okay. I will say a couple of comments and then Councilmember Swan and ask that you close the debate on the issue. I'll simply say, number one, thank you. Thank you very much. I think that your story has resonated throughout the city, and I think that the entire city sort of looked at what you're going through'",
        "'speaker_1': 'and what you shouldn't have to go through. So I'm I'm excited about the discussions that will take place in a Councilmember Johnson's committee. I also heard that there was a park that has not been kept up to the standards that should be kept and some other things.'",
        "'speaker_1': 'And so I'm going to anticipate that during our budget deliberations, we'll also look at not just fighting for status quo, but what we can do to be a better partner to you. You are fine residents and fine Seattle folks, and so it's our honor to work with you.'",
        "'speaker_1': 'Thank you again. Thank you, Councilmember Swan, for your leadership in bringing this to the city's attention. And with that comes from everyone, please close the debate.'",
        "'speaker_4': 'Mr. President, may I make a comment? Oh.'",
        "'speaker_1': 'I. Timing is always off. But, Councilmember, I'm a skater. Thank you. I'm sorry, ma'am.'",
        "'speaker_4': 'Thank you. And I know council members won't want to close. I'll just say a few words. You know, I want to lift up some of the comments that Councilmember Johnson also mentioned in terms of the longer term vision, as we work on a comprehensive plan, it must be comprehensive for every family, for every retiree, for every artist'",
        "'speaker_4': ', for every activist in Seattle, so that we have affordable housing for those who are currently here or those who've retired here, and for future families who we want to welcome here as well. I think this conversation today is just another reminder that we need to make sure that we're not only investing in more rent restricted, affordable rental'",
        "'speaker_4': 'units, but that we're creating more affordable homeownership options for everyone, including mobile units, including first time homebuyer options, including the ability to turn apartments like mine into our first time homebuyer options, and creating more affordable units as we create solutions to address the restrictive zoning that has limited our ability to have homeownership options.'",
        "'speaker_4': 'I think that we at the city level have been pushing our friends at the state level as well to get additional revenue in hand so that we can build quickly and respond more effectively to the fact that we don't have enough housing in the city, housing for our lower income and working families.'",
        "'speaker_4': 'And we don't have the opportunity to have lower cost homeownership options through affordable condominiums. This has resulted in people getting pushed into the streets and being people getting pushed out of our city. So I look forward to working with all of you as we talk about scaling up the type of housing that we can create in our'",
        "'speaker_4': 'city, scaling up to make sure that we're more inclusive city, creating more affordable housing for all working families, and that we look at this through a holistic approach to make sure that we are not responding parcel by parcel, but that we have public policies that reflect the values that working families and retirees ought to be able to'",
        "'speaker_4': 'live in the city. I'll also be working with you as we respond to the question of why the good sister who just left. She asked, Why are we in the situation where we don't have enough affordable housing in the city?'",
        "'speaker_4': 'And part of the reason why is because we've been we've had our hands tied for far too long with restrictive lawsuits and dragging seats. We have not been able to respond to the crisis of housing and homelessness. And I think what you're seeing here is not just a response to, say, protect the existing housing, but actually make'",
        "'speaker_4': 'sure that we have permanent, affordable housing for everyone. So let's make sure that this is the impetus that we need, as someone said, so that there's not an island of affordable housing in the mix of expensive housing and that we actually create affordable housing throughout the city.'",
        "'speaker_4': 'I'm excited to work with you on some of the pieces that Councilmember Johnson mentioned regarding transfer rights, regarding home away opportunities, and I'm going to be introducing legislation in the next few months that will be the tenant opportunity to purchase act so that when apartments like mine get sold while I'm living there, we get notification so that'",
        "'speaker_4': 'we can have the opportunity to come together and purchase together and we can have access to those resources to make sure that folks have the opportunity to stay in place so that we can afford our homes. I'm really excited to work with you on all types of affordable housing and to to use this as the impetus for'",
        "'speaker_4': 'longer term, more robust solutions across our city. Thank you.'",
        "'speaker_1': 'Thank you. Thank you. Can someone get a counselor on this one?'",
        "'speaker_0': 'Thank you. So we we know that we have come this far to win the moratorium, but as you yourself have said, that is not going to be enough. We need to make sure that the manufactured home park zoning designation goes through and that is not going to be automatic.'",
        "'speaker_0': 'We are going to have to fight for it. And let me tell you, I've been I've been through this routine many, many times in five years now, where it starts a fight, the fight for some sort of justice, whether it's housing, justice, rent or just as a workers, justice starts with ordinary people demanding it.'",
        "'speaker_0': 'One or two councilmembers supporting it. A lot of you know. Pushback from a lot of corporate politicians, but when they recognize they cannot, then it's all where we always wanted it. So let's be very clear that we are not going to have to we're not going to be able to stop fighting just because we hear a lot'",
        "'speaker_0': 'of grand speeches today. We know what we're up against. We're up against a city hall that is primarily still let's let's be sober and not complacent, primarily still dominated by politicians who are, you know, serving corporate interests for the most part, and then are pushed into doing the right thing.'",
        "'speaker_0': 'So let's make sure that we keep building our movement to do the right thing. I really thank the Association of Manufactured Home Owners. I specifically wanted to thank Island Park for all the organizing effort she has done. Not just but Colin, not just in this battle, but you've all already fight fought a lot of battles.'",
        "'speaker_0': 'And I really urge you all to continue your work in forming your own homeowner's association. In reality, this homeowner's association will be like a branch of the tenants union because you are fighting for working class home ownership, similar, similar to tenants union, fighting for the rental rights of working class people.'",
        "'speaker_0': 'I really wanted to also thank the Tenants Union and by Seattle and Devon Southern Air who spoke, which really shows that we need to unite our working people, whether they are homeowners or renters. We need to unite us.'",
        "'speaker_0': 'We need to get united because our enemy is not each other. Our enemy is a corporate developer dominated city, a billionaire dominated city, as Imogene said. And also the fact is that, you know, a lot of politicians will talk about humanity while whose humanity gets lost in all of this.'",
        "'speaker_0': 'The humanity of ordinary people gets lost. Because when we lose our affordable housing, when we lose our rights, it's our humanity that is put to the test and that, you know, put to question. And that's why we should continue fighting.'",
        "'speaker_0': 'We should not apologize for fighting because that is the right thing to do. And let's wear it like a badge of honor.'",
        "'speaker_1': 'But any of my I was going to close debate. But implicit in your comments were, I think, baseless insults. If anyone liked to respond to it, I'll I'll let you respond. Otherwise, I'll just call for the vote. So.'",
        "'speaker_1': 'Okay, so we're going to call for the vote. Please call the role on the passage of the amended Bill.'",
        "'speaker_4': 'Herbold II.'",
        "'speaker_3': 'Johnson Suarez Macheda I O'Brien sir want.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Beg John President Harrell all right.'",
        "'speaker_4': 'Eight in favor nine.'",
        "'speaker_1': 'Oppose bill passed and shared with Senate. Please read the next agenda item. You can read the short title.'"
    ],
    "Transfer of Partial Jurisdiction of Park Land and Park Boulevards within Discovery Park.": [
        "'speaker_4': 'The Report on the Civic Development of Public Assets and Native Communities Committee Agenda Item two Constable 119446 relating to the Department of Parks and Recreation and see public utilities transferring partial jurisdiction of portions of park, land and park boulevards within Discovery Park.'",
        "'speaker_4': 'The committee recommends the bill passed.'",
        "'speaker_1': 'Councilmember Suarez.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Thank you. Council President so this is the discovery park. This bill transfers partial jurisdiction of portions of park, land and park boulevards in discovery park from Department of Parks and Rec to Seattle Public Utilities for maintenance and repair work.'",
        "'speaker_5': 'The bill also means requirements of Ordinance 118477, which adopted Initiative 42. The Committee on Civic Development, Public Assets and Native Communities made a unanimous recommendation on January 24th that the City Council passed the Council bill.'",
        "'speaker_1': 'Thank you very much. Any comments on this bill? It's called the rule on the passage of the bill.'",
        "'speaker_3': 'Her Bolton II Johnson. Whereas I must get to O'Brien.'",
        "'speaker_2': 'All right.'",
        "'speaker_3': 'So what I think shire president Harold Hayden favor opposed.'",
        "'speaker_1': 'The bill passes and the chair of the Senate please read items three, four and five. You can read the short title and then I'll say a few words before Councilmember Words speaks to the items.'"
    ],
    "Establishment of Local Improvement District for Central Waterfront Improvement Program.": [
        "'speaker_4': 'Agenda items three, four and five. Constable 119447 relating to the Central Waterfront Improvement Program and the land improvements identified herein establishing local improvement district number 6751 and ordering and carrying out of the proposed improvements as a component of the Seattle Central Waterfront Improvement Program in accordance with Resolution 31812, the committee recommends the bill Pass Council Bill 119448'",
        "'speaker_4': 'relating to the funding operations and management for essential waterfront improvements. Identifying philanthropic funding for construction and operations and maintenance and safety and security of public spaces. On the central waterfront, the Kitty Bear recommends the bill Pass Council Bill 119449 related to the protest waiver agreement between and among the city, the Waterfront Park Conservancy and certain property owners'",
        "'speaker_4': 'affected by the proposed Waterfront Local Improvement District. The committee recommends the bill passed.'",
        "'speaker_1': 'Thank you very much. Because remember whereas let me say a few words before we introduced the Bass legislation. As we all know now, there has been an appearance of fairness doctrine challenged to seven of the nine council members.'",
        "'speaker_1': 'You do have at least one document in front of this, sort of gives you some ideas on how to respond to this. And I think we've been briefed by central staff on how to respond to it. If necessary, I can bring central staff back to the briefing table if necessary, and we can suspend the rules for further'",
        "'speaker_1': 'clarification. If not, what I am planning on doing is going down the dais, starting with Councilmember Johnson. Since Councilmember Herbold was not alleged to violate the doctrine and have each council member then say on the record their position regarding the appearance of fairness challenge.'",
        "'speaker_1': 'And again, if you have any questions, I can suspend the rules and we can have that if not. JOHNSON How would you like to respond to the Preparedness of Fairness Challenge?'",
        "'speaker_7': 'Thank you. Council President There are two issues in the memo related to myself. The first of which is a series of briefings that council members entered into as part of the deformation ordinance. This was a set of briefings I received by city staff related to the Office of the Waterfronts around the revision of the total local improvement'",
        "'speaker_7': 'district amount. The commitments from the private philanthropy, as well as the framework on the operations and maintenance and other elements related to the proposed legislation. The Office of the Waterfront Manager was giving me technical information that I felt was necessary in order to make an informed decision.'",
        "'speaker_7': 'I was not stating an opinion of of fact one way or another, either in support or in opposition to the formation of the local improvement district, but rather giving me a, to use your phrase from earlier, a just the facts, man, kind of an approach.'",
        "'speaker_7': 'In addition, I disclosed that earlier on this year in a private communication from a personal friend, that personal friend sent me a note in the mail here to my council offices, and that note expressed condolences about some issues that have been happening in my life.'",
        "'speaker_7': 'And in the middle of that note happened to also mention this friend's desire to see the lady not move forward. They are a ratepayer in downtown and they do not want to see the idea assessment pass. I never engage in a follow on communication with that individual, but passively receive the information based on advice from our council'",
        "'speaker_7': '. They believe that it was important for me to disclose that passive receipt of that information, which I've done so as well based on these two issues. I don't believe that I should be conflicted out of these deliberations in this vote today, but wanted to cure these matters, as was advised by both legal counsel and our central staff'",
        "'speaker_7': 'earlier today.'",
        "'speaker_1': 'Thank you. Councilman Johnson, so am I hearing you state that you believe there's been no violation of the appearance, the Fairness Doctrine or in the alternative and or I should say that you believe you are not biased or prejudiced.'",
        "'speaker_1': 'Is that what I'm hearing you saying, sir?'",
        "'speaker_7': 'Yes, sir. I believe I fall into the former category as opposed to the latter.'",
        "'speaker_1': 'Okay, very good. Councilmember Bagshaw, thank you.'",
        "'speaker_0': 'I would like to build on what Councilmember Johnson just said. I have a unique experience because I am in District seven. I am within the local improvement district as proposed. My condominium is, as I've said, at ground zero at first in spring.'",
        "'speaker_0': 'This has been known. I have done my best to disclose it at every meeting that we've had. I also have been advised by our. Explored and by Wayne Barnett prior to June 1st of this year, I was not able to participate in the meetings, nor could I vote.'",
        "'speaker_0': 'But as effective the 1st of June, our council will 119254 changed our rules, allowing those of us who are elected by districts, particularly if we had a financial interest to disclose that financial interest. But to make sure that if I were to be taxed, it would be in the same proportion or percentage as everybody else within the'",
        "'speaker_0': 'the designated area. And that is then the case of my husband and my participation in this going forward. Like Councilmember Johnson, I have been briefed by our city staff. At no time have I talked to proponents or opponents, and any emails that I have received have been subject to public disclosure and turned over.'",
        "'speaker_0': 'For those reasons. I do not believe that I am prejudiced on this. I will be taxed like others should this pass, and I do not have any bias or prejudice or preconceived notions coming forward on this.'",
        "'speaker_1': 'Thank you. Councilmember Councilmember Johnson. I mean, sorry. Councilmember O'Brien.'",
        "'speaker_2': 'Thank you. Council President Herrell similar to the first point that Councilmember Johnson made, I, I did take meetings with city staff. Councilmember Johnson adequately described the content of those meetings. And I disagree with the challenge because I believe that I am not biased because of those meetings.'",
        "'speaker_2': 'I was gathering information and asking questions.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilmember Sawant I did not personally have meetings of this nature. My staff had them, but that information was not communicated to me. To the extent that it would. Violate the appearance of fairness doctrine.'",
        "'speaker_1': 'Thank you very much, Councilmember, staunch councilmember mosquito.'",
        "'speaker_4': 'Thank you very much, Mr. President. I disagree that I don't have the right to vote in there, so I very much want to explain the conversations that I had out of an abundance of caution. I recognize that this is a quasi judicial matter, and as such, I have only had conversations relating to the operation and maintenance legislation'",
        "'speaker_4': ', which again is one piece of the legislation that we will be discussing today. I've had conversations related to aspects of my support for the oommon oh and m legislation to include language around inclusive representation across the city on the board, the role that Labor should have, the ability to have child care subsidies for those who are serving'",
        "'speaker_4': 'on the board. None of that relates to anything related to the assessments or any of the quasi judicial aspects. Again, I want to be really clear. This is a conversation I've had with members of the community because I am a labor advocate.'",
        "'speaker_4': 'I am not bought by corporations, and I will continue to make sure that those voices have a role in sitting on all of our boards and commissions as a principle of myself, as a council member, and I believe shared by many of the other councils up here.'",
        "'speaker_4': 'So there has not been a direct conversation about the lid assessment legislation or any other aspect that has been quasi judicial, but out of an abundance of caution. I wanted to share that with you, to be transparent.'",
        "'speaker_1': 'Thank you. Catherine Mesquita, Customer Scout. I was just taking notes. Mental notes, I should say, not physical notes. We are sort of in the A and B. Options on how we're dealing with this. And did you say that you just believe you're not biased or prejudiced because of the contact?'",
        "'speaker_4': 'A I want to state on the record that I do not believe there has been a violation of the requirements that we don't hear. Appearance of fairness doctrine.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_4': 'She made me restate that for the record.'",
        "'speaker_1': 'No, I think we're fine. Okay. We're out of the find councilmember words.'",
        "'speaker_5': 'Thank you. Council President. I disagree with the challenge. And as chair of the waterfront, I can confirm that this council member myself, I believe that there has been no violation of the appearance of Fairness Doctrine because I've not had any quasi judicial or substantive conversations regarding the assessment with any of the property owner community or the Office'",
        "'speaker_5': 'of the Waterfront and or the Executive. I've spoken to no proponents or opponents. All discussions have been on the record in accordance with the Open Meeting Act. I've had meetings with city staff regarding, as Councilmember Johnson said, just the facts.'",
        "'speaker_5': 'And as you know, I've been shepherding and this legislation in my committee for three years and I can honestly and fairly state on the record there has been no violation of the appearance of fairness doctrine.'",
        "'speaker_1': 'Thank you very much. So what I've heard from six of the seven council members that were challenged, that they disagreed with the challenge and they stated their their reasoning and their basis for disagreeing with the challenge. And for that basis, I'm concluding that we can proceed with a vote.'",
        "'speaker_1': 'But as Council member, whereas describes the base legislation, I would encourage members of the central staff to signal to me that I've missed something up and I can pivot in a minute. So unless we are proceeding, unless we are comfortable proceeding.'",
        "'speaker_1': 'Councilman Waters, please introduce the legislation as it has been read into the record in a short time is correct. Councilmember Walsh, you have the floor.'",
        "'speaker_5': 'Thank you, Inger. In regards to item number three, council, bill 119447 formation of ordinance number 6751. What I'll do is I'll read, talk about all three of them and I'm assuming we'll come back and vote. This is the first of three bills that complete the proposed waterfront legislative package.'",
        "'speaker_5': 'This ordinance creates the waterfront lead. That's the local improvement district. The city has proposed at least 6751 lids are local improvement districts, which is where the where that number comes from. Lids are commonly used, commonly used for funding a funding tool governed by the state law by which property owners pay to help fund the cost of public'",
        "'speaker_5': 'improvements that directly benefit their property. The waterfront is Seattle's gem. If passed, the city will not only not only be able to see the waterfront park, but also fully enjoy what the waters of the Salish Sea have to offer to our city.'",
        "'speaker_5': 'This ordinance allows the waterfront to serve all of Seattle and will include 20 acres of public space and an elevated pathway that reconnects the Pike Place Market in downtown to the waterfront. This ordinance creates the account in the city treasury to manage the waterfront led funds.'",
        "'speaker_5': 'This ordinance also allows the use of bonds for financing. The Committee on Civic Development, Public Assets and Native Communities made a unanimous recommendation on January 4th that City Council pass this Council bill. I'll move to item number four now.'",
        "'speaker_5': 'Council Bill 119448 Operations and Maintenance. This ordinance lays out stipulations of the agreement totaling $712 million. Office of the Waterfront provided a helpful chart that explains which stakeholder is responsible for which amount of the $712 million pie. It also includes a two year pilot agreement in preparation for a long term agreement with Friends of the Waterfront to'",
        "'speaker_5': 'operate and manage this public space. The committee recommended unanimously that City Council pass this Council bill. Item number five Council Bill 119449 Protest Waiver Agreement. This public private partnership provides a protest waiver agreement allowing a 30 day protest period upon potential adoption and mayor's and the mayor's signature of these items also followed by with a 30 day'",
        "'speaker_5': 'appeals period. I apologize.'",
        "'speaker_3': 'For that.'",
        "'speaker_5': 'This creates the waterfront. Conserve can never say that word. Waterfront Conservancy a Washington a for a Washington not for profit. It's a corporation for the property owners rights to enforce obligations while also protecting legal representation for this group similar to the functions of Friends of the Waterfront for the city.'",
        "'speaker_5': 'This is another example of the public of this public private partnership serving a complex, yet thorough and balanced agreement for all parties to move forward in a waterfront for all. I want to thank central staff and the Office of the Waterfront for thoroughly briefing members of my committee and step committee together and separately with Council for a'",
        "'speaker_5': 'thorough examination of each ordinance and how it impacts our city and its people. I've been working on this legislation's. Since I got elected three years ago. I understand, as Councilman Bagshaw has been working on this for 15 years, the Committee on Civic Development, Public Assets and the American Communities made a unanimous recommendation on January 24th that the'",
        "'speaker_5': 'City Council pass this Council bill and City Council passed all three bills. Thank you.'",
        "'speaker_1': 'Thank you. Councilman, where's Councilmember Bagshaw?'",
        "'speaker_0': 'Thank you. Councilmember Wise, let's just start off by saying thank you to you and your team for both your legal and procedural sense. I know that it has been a lot on your shoulders as you have also taken many other things that have to do with our civic projects this year.'",
        "'speaker_0': 'But you've done a super job and I want to say thanks. I also want to recognize the people who are in the audience. I mean, I could just go left to right and the front, starting with council central staff.'",
        "'speaker_0': 'Thank you for that, Dori and Angie. Appreciate it. Marshall and Joshua, my goodness, what you have done, the number of meetings that you have attended this year, I think there's people hiding back behind it. Heidi, thank you. Heidi Hughes and Jessica murphy for the work that you've done and not just the seawall, but activating the waterfront.'",
        "'speaker_0': 'I am truly grateful for what you have done, what I have been seeing and I know Maggie Walker, I don't think she's back there, but appreciate what she has done around philanthropy and the waterfront community, bringing them together.'",
        "'speaker_0': 'And then the Wayback Machine. And this really does go back 15 years when I first started working with Allied Arts and shared Waterfront for All. David You were taught me the phrases like We prefer green over gray and the idea that we really were making this for all ages and abilities and looking for a revenue package that'",
        "'speaker_0': 'came together. I know that there we have heard comments this morning or this afternoon. A number of my neighbors have let it be known. And of course, all those are subject to public disclosure and have been turned over that they're unhappy with having to pay additional taxes, that their property values are going up and they think that'",
        "'speaker_0': 'is enough. I understand. I know how people feel. Yet I will say that the vision for what these 20 blocks are going to be like both impressive, acknowledging these natural resources that we have. The once this viaduct comes down, first of all, we know how much quieter it is the last three weeks.'",
        "'speaker_0': 'But building this waterfront for all is something that, frankly, I'm going to look back on and think my time on this council and as working with Allied Arts on that as one of the highlights of my career. And I do want to acknowledge many of the architects that did this for free in 2004 when we first did'",
        "'speaker_0': 'our design charts. And I'm just, you know, just picking out a few Alan Hart and Matt Roae and Leslie Bain and Stephanie Bower with her amazing illustration Pen and John Fight. These folks were dedicating their time, their energy for free to show us what this could look like.'",
        "'speaker_0': 'And once I saw those illustrations, I knew that this was something that people would want to have, that words don't convey what the the illustrations did and that vision. And I want to recognize people like Bob Donegan and Bob Davidson down on the waterfront.'",
        "'speaker_0': 'I mean, they have worked tirelessly, and I know that it's been hard as we've moved the seawall and we've moved the roadway and we brought Alaskan way from one place over to another, and now they're going to go through another year of having the viaduct come down.'",
        "'speaker_0': 'But that said, it's going to be astonishing for businesses, for the aquarium and connecting the aquarium to Pike Place Market and all the way up to Melrose, I can just envision what our city is going to look like when people can walk and be separated and have that green space that we want.'",
        "'speaker_0': 'And I do want to acknowledge that we taxpayers who live down there aren't the only ones who are paying for this. The state put billions of dollars in the city has put in millions and millions, hundreds of millions of dollars.'",
        "'speaker_0': 'The port is also involved. The county has stepped up and this local improvement district is a piece. And I know that $160 million is a significant piece. And to those of us who will be living down there and the businesses who are there, we're going to have a front row seat on this regional asset.'",
        "'speaker_0': 'So I think connecting the waterfront to the pipeline corridor, to Queen Anne, to Pioneer Square, to West Edge, and creating those green public spaces and improving the habitat along the waterfront, it's well worth paying for. We're also separating and making it a safe place for pedestrians.'",
        "'speaker_0': 'I know many of you have heard me talk a lot about age friendly Seattle, about making our city someplace safe for all ages and abilities. This is an exciting opportunity for us to do just exactly that. I do want to do one word of warning.'",
        "'speaker_0': 'I can tell you that we will probably hear from developers who would be very interested. And taking some of the remaining blocks down there and going higher than 170 feet that it is zoned for. I'm going to argue strenuously that in order for us to keep a waterfront for all, we cannot allow ourselves to get sucked into'",
        "'speaker_0': 'building buildings that are hundreds of feet higher than what is zoned, even for the best of all causes. I have been fighting assiduously to keep this from looking like what?'",
        "'speaker_3': 'Miami Beach. We truly need.'",
        "'speaker_0': 'To have the stepped downs, which we have been talking about for the last two decades to actually happen. So with that said, I believe that this is fair. It's reasonable. Those of us who are paying the tax are going to be getting more.'",
        "'speaker_0': 'And I look forward to paying my share. And I want to thank all of you who have been part of this vision to make this happen. So saying now I'll be running. Yes.'",
        "'speaker_1': 'Council President Casper and Back Shore.'",
        "'speaker_5': 'I'm sorry, I forgot. Oh, I know. I forgot to say something, but I think Cosmo Johnson has had it before me.'",
        "'speaker_1': 'Councilmember Johnson.'",
        "'speaker_7': 'Thanks. I just briefly want to expand on some of Councilmember backsides talking points in the late 1940s when we first started construction on the Alaskan Way Viaduct. It's baffling to me that we would have chosen to build a highway on our waterfronts instead of connecting people to that waterfronts.'",
        "'speaker_7': 'And it's a wonderful thing to think that, you know, 75 years later, we might actually finally have the chance to have that waterfront be a place where people can congregate, where people can share, where people can talk to one another, as opposed to be a place where cars can drive quickly through and past.'",
        "'speaker_7': 'And while I know many mourn the loss of the view on the top of the viaduct while you're traveling in your single occupancy vehicle at 55 miles an hour and trying to make sure that you are keeping an eye on the road while also keeping an eye on The View.'",
        "'speaker_7': 'I myself will be glad that so many more people will be able to enjoy that outside. And I think Councilor and back side, you would agree when I say that this won't just be original acid, it will be a national and international asset as we finally turn over our waterfront back to the people, as opposed to a'",
        "'speaker_7': 'place that is very loud and for cars. So I'm excited for that to really begin in earnest and look forward to several years from now when we finally completed this. What a vision we will finally be able to accomplish and what an asset this will really be for all of us.'",
        "'speaker_1': 'Thank you, Councilman Johnson, because some words you like clarify something.'",
        "'speaker_5': 'Yes, I would. Thank you, council president. I just wanted to say and I apologize for not sharing this in my notes. I just realized I. Anyway, so we know that this is a $712 million project. And I think it's important to note that, yes, there is a local improvement district for 160 million, but the state is putting'",
        "'speaker_5': 'in 193 million, the city is putting in 249 million. And the philanthropy group Friends of the Waterfront will be raising 110 million. And so I think we're doing something phenomenal in this city that we haven't always been able to do, and that is to grow 20 acres of new and improved public space.'",
        "'speaker_5': 'And again, getting back to like we did with Seattle Center in the Space Needle, this is a gem. This is an icon. It will reconnect us with the Salish Sea originally how it was to be. And with that I'll be voting yes and I hope my colleagues join me.'",
        "'speaker_1': 'Thank you. Customer Councilmember Words for that clarification. Okay. Councilmember McKenna.'",
        "'speaker_4': 'Thank you, Mr. President. I want to thank Councilmember Wise and her team for being incredibly inclusive of our conversations as of late. I understand that I'm the newest member to this discussion, but I want to thank you for all of your work and especially and again for working with us as we thought of a few additional ads'",
        "'speaker_4': 'to lift up the voices of workers on the board and ensure that our city was represented in full at the table that we're creating. I also want to thank the Friends of the Waterfront and the labor members of the Martin Luther King County Labor Council who have been working with the waterfront folks to make sure that union'",
        "'speaker_4': 'jobs are created and that we're not just talking about union jobs as we create the new facility, but that as we clean the facility and maintain it, we also have good living wage jobs. Really excited about that language that has been included.'",
        "'speaker_4': 'I also want to thank my staff, Michael Maddox. This is an opportunity for me to thank him on land use, housing, energy issues, etc. But this is a great example of where he was able to quickly, quickly work with the council to make sure that those are values around labor and inclusivity were part of the solution.'",
        "'speaker_4': 'I think as we think about this new entity being a public property, we want to make sure that we keep our eye on long term costs. And having those jobs be in-house is a really great example of how we can make sure that they're good living wage jobs and we're keeping an eye on cost.'",
        "'speaker_4': 'Often we think about outsourcing as a way to save money, but in the end, we end up underpaying workers and costing ourselves in the long term term. So here's a really. Great example of where from the beginning our partners were interested in the strong labor business community dynamic, and we ensure that this project was reflective of those'",
        "'speaker_4': 'values. I also want to thank folks for all of your participation on the upcoming board. We know that it's not a very exciting thing that we're asking you to sit on, but the 19 members who will be sitting there if you do have child care needs, we've now included language to try to figure out pathways forward so'",
        "'speaker_4': 'that potentially child care could be compensated. We know from other boards and commissions that often child care costs are one of the main reasons that we don't see a lot of participation, especially from communities that are underrepresented in public policymaking.'",
        "'speaker_4': 'So really excited to have that voice there as well. And I just really look forward to seeing this vision that you've been working on for 15 years. Councilmember Bagshaw play out, having been able to play on the vacated viaduct and having this is my commute to work along the waterfront when I bike, I just can only imagine'",
        "'speaker_4': 'how great it will be. So working together, I'm sure that we will create a huge amount of accountability to fulfill that vision that you started 15 years ago and excited to be voting yes with you all.'",
        "'speaker_1': 'Thank you. Councilmember Skater Okay. I think that concludes our remarks. And if that we will take each bill separately. So please call the roll on the passage of bill 119447.'",
        "'speaker_3': 'Herbold i Johnson. I was Mr. O'Brien. Suzanne by President Harrell.'",
        "'speaker_4': 'I eight in favor and.'",
        "'speaker_1': 'Unopposed bill passed and chair of Senate please read the roll on the on constable 119448.'",
        "'speaker_4': 'Purple.'",
        "'speaker_3': 'JOHNSON Whereas I. O'BRIEN So what Peter hi president Harrell I eight in favor and.'",
        "'speaker_1': 'Unopposed the bill passed and chair saying please call the roll on the passage of bill 119449.'",
        "'speaker_3': 'Herbal Johnson Forest must get I. O'BRIEN All right so what makes your president narrow by.'",
        "'speaker_4': 'Eight in favor and.'",
        "'speaker_1': 'Unopposed bill passes and show sign it very good a lot of body of work. Operations it please read agenda items six through eight.'"
    ],
    "Sale and Acceptance of Sidewalk Easement to Snohomish County.": [
        "'speaker_4': 'Report of the Housing, Health, Energy and Workers Rights Committee. Agenda Item ten Cancer Poll 119 353 Relating to the city weight department declaring certain real property rights surplus to the city needs of the city white department authorizing the Sullivan easement for sidewalk purposes to Snohomish County and accepting the payment of fair market value for the easement.'",
        "'speaker_4': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Customer Mosquito.'",
        "'speaker_4': 'Thank you very much, Mr. President. As you heard, this ordinance declares a certain piece of property no longer necessary for transmission line purposes and authorizes an easement to the home of accounting to build sidewalk over city owned property in exchange for payment of fair market value.'",
        "'speaker_4': 'I want to highlight again for the Council that this parcel is not large enough for housing purposes and as such is not being retained under our disposition policies that the Council passed last year, which would ask our Council and the city to look at every parcel of surplus land and determine if housing can be built.'",
        "'speaker_4': 'If it can, then we would retain that property with the goal of creating affordable housing on that property. And this person is so tiny it cannot accompany that. So we are asking for your support in passing Council Bill 119353.'",
        "'speaker_1': 'Thank you very much. Any further questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_4': 'HERBOLD Hi.'",
        "'speaker_3': 'JOHNSON Whereas I must shatter I. O'Brien Swan Bagshaw High President Herald Hi, Aiden.'",
        "'speaker_1': 'Favorite unopposed bill passes and the chair will sign it. Please read agenda item number 11 the short title.'"
    ],
    "Ordinance on Accepting and Surplusing Real Property for City Light Department and Salmon Habitat Protection.": [
        "'speaker_4': 'Council Bill 119 354 related to the city excuse me. City Satellite Department Accepting statutory warranty deeds. Can we recommend civil.'",
        "'speaker_5': 'Pass.'",
        "'speaker_1': 'As member skater?'",
        "'speaker_4': 'Thank you very much, Mr. President. This legislation authorizes Seattle City land to accept a series of deeds in exchange for previously appropriated funds for environmental conservation and salmon habitat protection. This continues our commitment and city lights ongoing effort to procure and preserve environmentally, critically and critical lands across Washington for permanent preservation.'",
        "'speaker_4': 'Good for the environment and good for our city.'",
        "'speaker_1': 'Any questions or comments in that? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Herbold II. Johnson Suarez Macheda I. O'Brien Swan Bank Shire President Harrell. Hi eight in favor and unopposed.'",
        "'speaker_1': 'The bill passed in show assignment. That concludes our agenda. Is there any further business cover for the Council? If not, we stand adjourned and everyone have a great rest of the day. Thank you for being here.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Very much.'"
    ]
}