{
    "Extension of Moratorium on Mobile Home Park Land Use Changes.": [
        "'speaker_0': 'Thank you. The bill passes and the chair will sign it and doubt that the clerk please affix my signature to the legislation. All right, let's move into committee reports of the city council. Will the clerk please read agenda item one into the record?'",
        "'speaker_1': 'Agenda Item one Council Bill 1197 97.1 Banning extending for six months the moratorium established by ordinance 1 to 5 764 and extended by Ordinance 20 6006 on the filing, acceptance, processing and or approval for any application to capture a new principal or accessory you or change a principal or accessory use for any site.'",
        "'speaker_0': 'Currently used.'",
        "'speaker_1': 'As a mobile home park, as defined in section 23.84 8.20 32 on this code.'",
        "'speaker_0': 'Thank you. Before I open the public hearing on this item, I'm going to turn it over to council members to want who as lead sponsor of the bill, may want to provide us with some introductory remarks. And then if Councilmember Warrens would also like to provide some introductory remarks, she will have an opportunity to do so as'",
        "'speaker_0': 'well as members want. The floor is yours.'",
        "'speaker_2': 'Thank you, President Gonzalez. This council will extend the temporary zoning restrictions that protect the residents of Seattle's remaining mobile home parks from displacement. One and a half years ago, the residents of the Halcyon Mobile Home Park not to have them contact the city council because their park owner at the time.'",
        "'speaker_2': 'There's a new owner. No. Was attempting to sell it to a developer. And when mobile home parks are eliminated, it can be absolutely devastating for the residents. The residents own their mobile manufactured homes, but despite the name, they are often unable to be moved.'",
        "'speaker_2': 'So when the land is redeveloped, everyone often loses everything. People are left with mortgages to manufactured homes that they can no longer keep and have nowhere to go. This was particularly dangerous as an outcome potential outcome for the residents of the Halcyon Mobile Home Park, who are seniors who have paid their dues to the community work for'",
        "'speaker_2': 'decades, and many of whom have been former union members. My office worked with the residents to develop and bus temporary zoning protections to prevent mobile home parks from being redeveloped into anything different. And through their excellent community organizing, we were able to pass that legislation, and councilmembers who were there the last few years will remember that they'",
        "'speaker_2': 'are moving public testimony. Councilors passed temporary zoning restrictions and requested that the city departments do the work required to make those or other zoning protections permanent. Unfortunately, Mayor Dawkins departments have not prioritized so far that protecting the homes of the residents of Seattle's mobile home parks and really no progress has been made on the zoning work.'",
        "'speaker_2': 'So we will need a council bill for the temporary extension, which the residents have correctly requested. I thank contemporaries for co-sponsoring this. I hope the Council will pass this six month extension day and I again request Mayor Durkan to agree to have the Seattle Department of Construction inspections of the Department of.'",
        "'speaker_2': 'Learning and community development. Do the CPR work necessary to make these protections permanent? Thank you.'",
        "'speaker_0': 'Thank you, Councilmember, and the want for bringing this bill forward together with councilmember suarez and for those opening remarks. I understand that councilmember suarez and you coordinated in advance and you were taking the lead on making remarks. So we will go ahead and move on now to the public hearing portion of today's agenda.'",
        "'speaker_0': 'So as Presiding Officer, I am now opening the public hearing on Council Bill 119797 extending the moratorium established by Ordinance 125764 on the filing, acceptance, processing and or approval of any application to establish a new principal or accessory use or change a principal or accessory use for any site currently used as a mobile home park.'",
        "'speaker_0': 'There are currently at least two mobile home parks located in the city of Seattle. The first is the housing mobile home park and the second is the Bellerby mobile home park. The online registration to sign up to speak at this hearing opened at 12 noon today, and I will call on speakers in the order of pre-registration.'",
        "'speaker_0': 'The online registration will remain open until the conclusion of this public hearing. The rules apply to the public comment period also apply to those public hearings at which Speaker will be provided 2 minutes and will receive a 10/2 warning to wrap up their comments.'",
        "'speaker_0': 'Speakers microphones will be automatically muted at the end of the allotted two minute public comment period. Public comment relating to Council Bill 119797 is only being accepted at this public hearing. Speakers are asked to begin their comments by stating their name.'",
        "'speaker_0': 'And without further ado. We'll go ahead and begin the process of. Accepting public comment on this particular council bill. We only have three people signed up at this point for public comment. The first is Linda McCoy and then we will hear from Dominique Chandler.'",
        "'speaker_0': 'Linda.'",
        "'speaker_1': 'Hi, I'm Linda McCoy, and I'm the current president of the homeowner's association here at Health Yard. And I just want to say that we learned very, very late, like just yesterday evening, how this worked. So several people have sent emails to you about this.'",
        "'speaker_1': 'So if you have a chance to read them, please do. Patti Zetland is one and Sharon Brown is another. She wanted me to mention that. So thank you. Councilmember suarez and councilmember someone for putting this forward and for helping us get through.'",
        "'speaker_1': 'Two things happened that made it difficult for us to move forward on getting the things done for the. Reason or permanent. Where and when we changed the board of directors here. So we had to kind of start over with a new group.'",
        "'speaker_1': 'And then of course, COVID 19 happened. So because of that, we really weren't able to to move forward with use or intention is to request that you pass this extra extension. And then in the next six months that we work with you in the mayor's office and the city department to get the reports done that need to'",
        "'speaker_1': 'be done in order to move this into a permanent zoning mobile only. Okay. I guess that's it. I am I.'",
        "'speaker_0': 'You got about 4 seconds. You got about 4 seconds.'",
        "'speaker_1': 'Okay, well, vote yes. I don't know what else to say. Thank you, Linda. We've worked on this for a year and a half, so. Yeah.'",
        "'speaker_0': 'Thank you, Linda, for calling in and for your continued work and advocacy on this. Our next speaker is Dominique Chandler. Dominique. Is Dominic Chandler on the line?'",
        "'speaker_3': 'Hello.'",
        "'speaker_0': 'Hello. Now we can hear you. There you go.'",
        "'speaker_1': 'Oh, thank you, Del Monte Chandler. And yes, I live in Halcyon Park. And let me tell you, the last hour has been. Oh, so tragic to hear everyone's sadness. And that's not the reason for this phone call. But my God, everyone is suffering now.'",
        "'speaker_3': 'And all I want to say.'",
        "'speaker_1': 'Is help him park.'",
        "'speaker_3': 'It's a senior park.'",
        "'speaker_1': 'And he now the choice we've got is we bought our homes. It's only one really left here that we're homeowners of ours, you know, mobile unit. And if they kick us out or just, you know.'",
        "'speaker_3': 'Level it.'",
        "'speaker_1': 'We have no place to go. There are a lot of people that will add to the homeless.'",
        "'speaker_3': 'Population.'",
        "'speaker_1': 'Because we're seniors. And come on, you guys, don't you have senior parents? Don't you have people that love you and that, you know.'",
        "'speaker_3': 'There's a time that.'",
        "'speaker_1': 'Yeah, taking care of your elders should be.'",
        "'speaker_3': 'A good thing.'",
        "'speaker_1': 'Not a bad day. And I. My hearts being broke. With everything going on, as all of yours are. And that's about what I need to say.'",
        "'speaker_3': 'That let's hope tomorrow is better than the weekend. All right.'",
        "'speaker_0': 'And and thank you, Dominique, for calling in. We appreciate you taking the time to do it. We have Stuart Duckworth listed on this public hearing list. I know we heard from him during the general comment period. But if Stuart is still on the line, we'll be happy to hear from him.'",
        "'speaker_3': 'Well, hello again. Yes, I'm still on the line. And I agree with Dominique about all the other people that have talked. This is an amazing situation that we have out there. However, I'm here just to support the extension of the mobile home park, and actually we should make it permanent because this has always been a mobile home'",
        "'speaker_3': 'park and they try to develop put development in here because it's a fairly large piece of property, but it is built on a garbage dump in the late fifties or middle fifties, and underneath the garbage dump is the water from hell or lake.'",
        "'speaker_3': 'So this is really unstable ground and a mobile home park is basically all that it's really good for or manufactured home parks. We have homes, we have a couple of those in here, too. So we just need to get a vote to.'",
        "'speaker_3': 'Make this a permanent mobile seniors mobile home park. Thank you very much. And. Have a great rest of your day.'",
        "'speaker_0': 'Thank you, Stuart, for calling in today. That concludes the public commenters that I have formally signed up for today here. So we will go ahead and close out the public hearing on a council bill 119797. And we will now proceed with a vote on the bill.'",
        "'speaker_0': 'So I will move to pass Council Bill 119797. Is there a second? I thank you so much, because there was a lot. I thought I saw your lips move, but I didn't hear anything, so I wanted to have a little pause there.'",
        "'speaker_0': 'Thank you. It's been moved and seconded to pass the bill. Councilmembers want again as lead sponsor of the bill. I'd like to go ahead and recognize you in order for you to address this item in further detail.'",
        "'speaker_2': 'Thank you, President Gonzales. I don't plan to have any more points. I think the points that we made are also by the residents themselves about why it's important that we maintain their housing and that. And as they highlighted, they are our senior members of our society and we should absolutely be prioritizing, protecting their housing.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Council Member So what? Are there any other comments on the bill? City Councilmember Peterson, followed by Councilmember Mosqueda and then Councilmember Strauss. Councilmember Peterson, you're recognized, please.'",
        "'speaker_3': 'Thank you. I wanted to thank the residents who called in today and also to thank Councilmember Sharon and Councilmember Arias for their leadership on this. It's this is a great example of preserving affordable housing that we already have, preventing homelessness.'",
        "'speaker_3': 'So I just want to thank them for their leadership on this.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. We will now hear from Councilman Mosqueda and then Councilmember Strauss. Thank you, Madam President. Just a quick question for the sponsors, if I might. Given the delay in the initial plan to have a more concrete strategy, can you talk a little bit more if it's appropriate, Madam President, if it's appropriate for the sponsors'",
        "'speaker_0': 'to do so? Can you talk a little bit more about what your hope is at the end of the six months? And I know we want folks to work with us to see that. Are there concrete plans that we think will come to fruition at the end of these six months?'",
        "'speaker_0': 'Who wants to take that? Does that council member so want or Juarez want to take.'",
        "'speaker_1': 'Back.'",
        "'speaker_0': 'Something worse?'",
        "'speaker_1': 'Madam Chair. Thank you. Councilmember Mosqueda. As you know, we've been working on this for health promotion and I, when councilor was drafted, was here as well. And the short answer is yes. We would like to see what success looks like is a legislative fix.'",
        "'speaker_1': 'That is that we join with CCI and we actually carve out a particular zoned area for these manufactured mobile home parks. I think a lot of people think these are just mobile homes, that these are actually manufactured homes with a concrete foundation where people have lived there for many, many, many years.'",
        "'speaker_1': 'And as council members who want shared, we have a lot of elders, retirees, we have a lot of we just have a older generation living there. We've been there at least three times and have met with the different leadership at both areas.'",
        "'speaker_1': 'And so the endgame is that we carve out some legislation that we make it permanent. And we looked at other zoning and how other cities did, it appears, the home county, Thurston County, and I believe the city of bias, if I'm correct.'",
        "'speaker_1': 'So that's that's what success should look like, hopefully. So thank you for that question.'",
        "'speaker_0': 'Okay. Council member, council members wanted. You want to respond to that as well? Okay. We'll do that. And then we'll hear from Councilmember Strauss because mercyone.'",
        "'speaker_2': 'Thank you. As I mentioned here, there are other cities that have created that permanent mobile home park zoning designation. And so there's nothing new or strange or difficult about this. But Seattle does not happen to have that zoning type so far.'",
        "'speaker_2': 'So in order to make that happen and to make that zoning board permanent, the department would need to carry out a CPI analysis, which is a state Environmental Protection Act analysis. Again, this should be fairly routine work. But for whatever reason that, you know, the mayor's office should be answerable to, they have not carried that out.'",
        "'speaker_2': 'But if they did carry that out, which they should be doing, because we cannot indefinitely be extending the temporary. Designation, they should carry that out. And once they do that, the council can pass a similar bill. But that designation would be permanent, and not just for six months only.'",
        "'speaker_2': 'And so, I mean, in terms of controlling mosquitoes. QUESTION Concretely, I think it comes down to the city council members. You know, joining me in putting pressure on the mayor, do not postpone this any longer and just do this, because as far as I understand from a technical standpoint, there are no obstacles to getting this analysis out'",
        "'speaker_2': 'so that we can make the zoning designation permanent.'",
        "'speaker_0': 'And I thought that clarification would be helpful as we think about what happens at the end of six months. So thank you both to the prime sponsors and happy to support today.'",
        "'speaker_3': 'Councilmember Strauss Yeah, thank you. Council President Thank you, council members for sponsoring this bill. It is something that I would like to engage with you on for a permanent fix for six months is up because we know that a permanent piece of legislation will stop us from having to renew every six months.'",
        "'speaker_3': 'My grandmother lived in a manufactured home park for seniors, and I understand that. I understand that the ground that you keep your home on is not necessarily the ground that you own. And it's important for us to be able to provide this affordable housing and ensure that it remains stable.'",
        "'speaker_3': 'So I'd love to work with you on making this permanent fix. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Strauss. Any other comments or questions from my colleagues? I'm not seeing any. I think I share the same interest as many of you. I think it might be the third or fourth time I'm being asked to vote, a third time that we're being asked to vote on this issue.'",
        "'speaker_0': 'You know, it would be really nice to be able to just have the substance and the actual legwork done and completed by the executive so that we can move on from this issue. It is really frustrating that that has not happened.'",
        "'speaker_0': 'So. So hopefully we will be able to encourage the mayor's office and and and the SDC to actually just do the CPA and allow for us to have some level of certainty as it relates to this particular issue.'",
        "'speaker_0': 'So. Looking forward to ongoing leadership from Councilmember Juarez and so on in that space and of course from our land use chair. Councilmember Strauss. To be able to figure out what the path forward is to facilitate the execution of the work that needs to happen.'",
        "'speaker_0': 'So I definitely plan to support this bill. Okay. Looks like folks don't have any more questions or comments. I do want to offer the sponsors an opportunity to close out the conversation if they have anything else that they'd like to add.'",
        "'speaker_0': 'It was like, all right, looks like nothing else to add here. So I would ask that the clerk please call the role on the passage of the bill.'",
        "'speaker_1': 'Morales. I must get.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'So what.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Juarez. I. Herbal. I. Lewis.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'President Gonzalez, I. Nine in favor. None opposed.'",
        "'speaker_0': 'Excellent. The bill passes and the chair will sign it. I'd ask that the clerk please affix my signature to the legislation. All right, colleagues, we're going to go ahead and move to our next agenda item. That's item two.'"
    ],
    "Labor Standards for Paid Sick and Safe Time for Gig Workers.": [
        "'speaker_0': 'Will the clerk please read agenda item to interview the record?'",
        "'speaker_1': 'Agenda Item two Constable 119 783 relate to gig workers in Seattle establishing labor standards requirements with paid sick and paid space time for gig workers working in Seattle and amending Section 3.02. 120 56.208.020. I was going to propose.'",
        "'speaker_0': 'Thank you so much, Madam Clerk. I will move to pass Council Bill 119793. Is there a second? Okay. It's been moved and seconded to pass the bill. Councilman Ross gave a you are the sponsor of the bill, so you are recognized in order to address this item.'",
        "'speaker_0': 'Thank you, Madam President. I would like to move to amend Council Bill 119793 by substituting version five A preferred version three B. It's been moved. Is there a second pocket? It's been moved and seconded to substitute the bill.'",
        "'speaker_0': 'Councilor Mosqueda, I will hand it back over to you so that you can address the to. Thank you so much, Madam President, and thanks to my council colleagues for all of your engagement on this issue. As you know, paid sick and safe leave is something that the city of Seattle has been proud to have implemented in 2012'",
        "'speaker_0': 'and paid sick and safely, as we know and as you talked about during the initial passage, is not just about the workers it protects, though that's critical. It's also about protecting the community at large. When workers go to work sick, they interact with other people.'",
        "'speaker_0': 'They take longer to recover. They have the potential to infect their coworkers and members of the public. And when workers don't have the ability to take time off for safely due to domestic violence, they are unable to get the support and resources they need to be safe.'",
        "'speaker_0': 'It's in light of the importance of paid, sick and safely for both the workers and the community at large that we want to make sure this vital labor standards protection was extended to gig workers, especially in light of the critical work they're doing right now to serve our community.'",
        "'speaker_0': 'These are our friends, is our neighbors, these are our family members. And they deserve the same protections that every other worker needs under paid, sick and safely in recognition of the broad and long lasting health and safety and economic stability benefits that paid sick and safe leave.'",
        "'speaker_0': 'Have we wanted to make sure that we built on the good work that you all passed in 2012 for the council members who were here then, and also to make sure that we extended the protections that we all passed as a state when we voted to implement Initiative 1433 that I had the pleasure of, part partially leading'",
        "'speaker_0': 'in 2016, we're proud of these protections. We're proud that they have been a leading example for other states and cities across the country. But we also recognize that these protections largely only apply to traditional W-2 employees. And that's why it's problematic to leave gig workers out, especially at a time when we've seen gig work for medically increase'",
        "'speaker_0': 'in the past decade, where roughly around one sixth of workers across the country are doing gig work. As our council has said a number of times, this is not just about the gig economy, quote unquote. This is just about the economy at this point.'",
        "'speaker_0': 'Workers are being left out who are essential components of our economy, and they don't have paid sick and safely. Especially now during the coronavirus, given the amount of work that is happening right now from workers who are delivering food, who are delivering groceries, who are driving people to essential appointments across our city, we need to make sure'",
        "'speaker_0': 'that their needs are met. And keeping them safe. Allowing them to be protected from getting sick. And also making sure that if they get sick or they need a safe day, they have the protection they need for their day to day protection so they can get paid.'",
        "'speaker_0': 'This is about interacting with members of our public. Many of these workers have countless contacts with individuals throughout our community. As you heard from the folks who testified today that go right up to the doors of our neighbors, right up to the doors of our house to deliver groceries, to deliver food, and to provide folks with the'",
        "'speaker_0': 'essential services that they need. It is critical that they have protections if they are sick or need to take a day off to take care of their family members. Many platforms that we have worked with over the last two months, two plus months.'",
        "'speaker_0': 'At this point, we're on to ten weeks of engagement with stakeholders. Many platforms have stated that they are providing sick leave for their workers. But we've heard from many workers that they don't have access to adequately or it's hard to access the policies that have been offered.'",
        "'speaker_0': 'We've been working to make sure that this legislation is in the right form to protect the workers and make sure that it's implementable and make sure that the actions are receivable from the workers so that when we pass the law, the workers can actually get to take advantage of sick and safely when they need it.'",
        "'speaker_0': 'We've been in coordination with a number of partners to get this right, and many of those partners include you on City Council for all of your feedback over the last two weeks. Thanks so much to a few folks and then I'll stop and save a few.'",
        "'speaker_0': 'Thank you for the end council president. But I want to say thank you to the labor unions and worker advocates, including working Washington Teamsters 117, MLK Labor U.S. 21 for helping us develop this legislation. Thank you to the platforms we have briefed and sometimes heard feedback and incorporated that feedback from entities like Postmates, DoorDash, Uber, Eats, Uber'",
        "'speaker_0': ', Lyft, Uber, Lyft, Instacart and the Seattle Rideshare Association and drive forward. Thank you to our friends at the National Employment Law Project, the Center for Popular Democracy and the Center for Law and Social Policy at the national level for helping us learn from policies across the country and here locally.'",
        "'speaker_0': 'You saw an email from Jasmine Mera Kareem I'm sorry, Jasmine Riot at the Office of Labor Standards, who provided us with some feedback earlier today. And over the last few weeks they have been very engaged with us. Also, folks like Kareem Libertas and Jenny Jen from the Office of Labor Standards, Kylie Roth and Anthony Mariama from the'",
        "'speaker_0': 'Mayor's office. They have been tremendous to work with and we're happy that this legislation is passing. Hopefully with your support today. Madam Chair, I'll save my thank you's for hiring a bull from Central South and Central Creek after comments because I think they deserve a few more minutes.'",
        "'speaker_0': 'But with that, I just want to say thanks again to all of you for your feedback. This legislation is stronger because of your input and I think we have a lot to be proud of here. Even though we recognize this is the first of many policies that these workers need to be protected.'",
        "'speaker_0': 'Thank you, Councilmember Mosqueda, for those remarks. Colleagues, this morning at council briefing, of course, we discussed the we had Karina bull join us for a substantive conversation and briefing an update on what was included in the substitute bill.'",
        "'speaker_0': 'So I think we're all familiar with that. So at this point, we are voting first on the the substitution and then we're going to vote. We're going to have a second motion where we will vote on the on the bill as substituted.'",
        "'speaker_0': 'So. So I would if you have substantive comments now on the the substituted bill on sort of the underlying policy, I'd ask for you to save those until the second motion so that we can go ahead and get the substitution in front of us to allow for that conversation to move forward.'",
        "'speaker_0': 'So are there any comments for the sponsor or questions for the sponsor on what's included in the substitute bill before we vote on putting the substitute before us? Okay. Hearing and seeing none are there. I will ask the clerk to please call the role on the adoption of the substitute.'",
        "'speaker_1': 'Morales.'",
        "'speaker_2': 'Council President Gonzalez?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'I think I froze up. Are we are we voting? My apologies.'",
        "'speaker_0': 'We are. It's okay. Totally fine. This is the nature of technology in these remote settings. So what we are voting on now is not the substantive bill we are voting on putting forward in front of us the substitute version of the bill.'",
        "'speaker_0': 'We will then entertain a motion to adopt this substitute version and then hear comments again. Does that answer your question, Councilman Morales? You may have lost Councilmember Morales. Okay. Madam Clerk, I'm going to ask you to call the roll on the on the bill, and we might have to circle back to Councilmember Morales.'",
        "'speaker_1': 'Council member Macheda.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Peterson.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council members want. Council members of the one. I. Council member Strauss.'",
        "'speaker_3': 'II.'",
        "'speaker_1': 'Council member Suarez. I. Councilmember Herbold, I. Councilmember Lewis, I. Councilmember Morales. I. I. I council President Gonzalez. I. Nine in favor, nine opposed.'",
        "'speaker_0': 'Thank you so much. So the motion carries and the substitute is adopted and version five eight of the bill is now before the City Council. Are there any further comments on the bill as amended? Colleagues. I'm scanning. Okay.'",
        "'speaker_0': 'So council members, the want has raised her hand. Anyone else have any comments? So I can put you in the queue because we're losing. Okay, great. So we will hear from her. So what then? Councilmember Lewis. Then Councilmember Peterson.'",
        "'speaker_0': 'Councilmember Swan, please.'",
        "'speaker_2': 'To Brisbane. I will of course be voting yes on this legislation to extend Seattle's paid seven sick day protections to gig workers. Gig workers deliver groceries. Drive for Uber and Lyft. And do many, many other jobs essential to our society.'",
        "'speaker_2': 'These are jobs like any other, except they are marked with the legal fiction that they are one person, small businesses instead of employees of a corporation. The result of this legal fiction is that workers are suddenly no longer protected by labor laws, and the bosses do not have to pay the employer's share of Social Security taxes.'",
        "'speaker_2': 'And the workers are denied their rights to organize into a union to collectively bargain for a fair contract with their boss. This is totally unjust, and it's a clear example of how, under capitalism, the working class must continually organize and struggle to avoid falling farther and farther behind.'",
        "'speaker_2': 'We should remember that 100 years ago, over a hundred years ago, no workers could legally form unions in this country, but courageously they did anyway, often having to defend their picket lines against physical attack and threat to their very lives.'",
        "'speaker_2': 'In the 1920s, the US military was even deployed to bomb the picket lines of striking miners. Today's courageous and historic struggles. Workers won the decent contract that formed the so-called middle class that lasted for about two generations, which of course, is not accessible for most millennials now.'",
        "'speaker_2': 'But those labor, those protections were won through those labor struggles. The right to organize was won through a struggle. Since then, over decades, big business has been attempting to claw back every gain that workers fought for and won.'",
        "'speaker_2': 'Wealth inequality. Inequality has ballooned, as we know, and an estimated one out of every five workers in the US is now classified as an independent contractor, also known as gig workers. So in other words, this is a problem that is that is something that all working people should be fighting against.'",
        "'speaker_2': 'Ultimately, gig workers will need to unionize with or without the legal permission to do so, because we only have the power in the workplace when we get organized to fight for it. In the meantime, however, I am happy to support this legislation to extend basic, safe and secure home rights to gig workers in Seattle.'",
        "'speaker_2': 'This is extremely important. Only I would raise the caution around enforcement that I had spoken to when we had had this discussion in council meeting, leaving when we first discussed it. Seattle Office of Labor Standards is empowered to enforce these workers rights, but because so many big businesses engage in wage theft, the Office of Labor Standards has'",
        "'speaker_2': 'a serious backlog. They do excellent work, but they don't have enough resources. If your boss steals from you, it takes many months even to get the money you are owed. And we have seen how ruthless giant corporations like Uber can be.'",
        "'speaker_2': 'This can be disregarding workers rights, workers rights. The Office of Labor Standards is currently understaffed. The Mayor has instituted a hiring freeze, claiming that there is not the budget to adequately staff the department because of the COVID related budget shortfalls.'",
        "'speaker_2': 'These shortfalls are not automatic. They are not an act of God. If Mayor Durkan and the City Council were willing to tax big business and raise progressive revenues, we could have the resources to stop austerity to fund departments like the Office of Labor Standards to the extent that they needed to be fund in order to fully function'",
        "'speaker_2': 'in protecting workers rights. And in addition, creating more public sector jobs, building social housing and the Green New Deal as a background on movement is demanding as many and as many people in public comment indicated today. Gig workers deserve to be protected with space, safe and sick.'",
        "'speaker_2': 'Time rights, that means. It's important to support this legislation today, but we also need to push back and refuse to accept austerity that is coming down the pike. And we should adequately staff departments like the Office of Labor Standards and expand progressive revenues.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sawant. Next up is Councilmember Lewis, and then we will hear from Councilmember Peterson.'",
        "'speaker_3': 'Thank you, Madam President. It goes without saying, and I'll say it at the top that I will be voting for this legislation. I just wanted to briefly do a shout out to Dan Beacon for his reporting.'",
        "'speaker_0': 'On the report. I can't remember her saying.'",
        "'speaker_3': 'Why can't it be it?'",
        "'speaker_0': 'I mean it. I love that I should never underestimate their ability.'",
        "'speaker_1': 'To go on.'",
        "'speaker_0': 'As a member. Councilmember Herbert Okay. Got it. We got we got we now have here all conversation. Councilman Lewis.'",
        "'speaker_1': 'You're down here.'",
        "'speaker_3': 'Let me let me let me regain my composure a little bit here. So as I was saying, I want to do a shout shout out to Dan Beekman for his reporting this weekend, which I made some points that I just wanted to highlight and that I think are really prescient.'",
        "'speaker_3': 'He interviewed a driver named Daisy Taurus who, before driving for one of these gig based platforms, had worked in a hotel and had been an employee and as such, was entitled to paid sick and safely. He interviewed a gentleman named Zach Albacete, who was driving for an app who, prior to COVID, worked at a car dealership and'",
        "'speaker_3': 'in that position would have been entitled to paid sick and safely. I bring that up because I think it is is a horrible harbinger of things to come in our economy, post-COVID, that the openings and opportunities that are thriving for people who have fallen off in the economy that existed pre-COVID, who were already in positions where earnings'",
        "'speaker_3': 'and benefits were not keeping pace with the rising cost of living, are now sustaining themselves economically by working for these apps and do not have these benefits. That all of us have taken for granted in the normal economy over the last decade, as folks have fought for and successfully won, including many of the folks on this council'",
        "'speaker_3': ', higher wage borders, a sick and safely, in some cases, nationally mandated vacation time. And it's just critical that legislation like this I'm so grateful for your leadership on this council that is being put forward, because this is a massive gap in this economy.'",
        "'speaker_3': 'And every time we have one of these downturns, as we did in the oh nine, 2010, 2011 downturn, there has got to be very conscious work on the part of leaders at all levels of government to work really hard, to try to make sure that inequities that I'm enduring, a desperate time in the economy taking a hit'",
        "'speaker_3': 'don't get entrenched, solidified and become a new normal that shapes what the economy on the other side of the recovery looks like. And, you know, I I've heard stories. I cannot speak to them personally. And if there used to be paid internships, for example, in the workforce or I've heard about, you know, mandatory overtime or a defined'",
        "'speaker_3': 'benefit pensions that existed during the period of middle class growth that council members alluded to. We need to really make sure that paid sick and safely through this legislation, but also more broadly is a fundamental part of our economy.'",
        "'speaker_3': 'When we come out on the other side of COVID and that it is during COVID as well. So thank you. Councilman Mosca and I will be voting for this. And I really appreciate your leadership.'",
        "'speaker_0': 'Councilmember Lewis. Next up, we'll hear from council member Peterson. And if any of my other colleagues wish to make comments, please, please do let let me know. Councilmember Peterson, the floor is yours.'",
        "'speaker_3': 'Thank you. I wanted to thank Councilmember Mosqueda for her generously giving us more time to review this legislation. That was very helpful. I know that your city council staff and our central staff have worked really hard on this.'",
        "'speaker_3': 'I also appreciate your working with the executive on just the how to practically implement the legislation and also for reaching out to those in the private sector who would be impacted by the legislation. Also, I wanted to shout out to work in Washington for their advocacy for this legislation.'",
        "'speaker_3': 'So I will be voting for the legislation. And just wanted to thank Councilor Muscat. Thank you.'",
        "'speaker_0': 'Thanks so much, Councilman Peterson. Colleagues, any other comments on the bill? Okay. I'm not. Oh, you will get the last word. Any other. Any other of my colleagues want to give any comments on the bill before we hand it over to councilman to close this out?'",
        "'speaker_3': 'Councilmember Strauss saying thanks to everyone for working on very important legislation. Thank you.'",
        "'speaker_0': 'Thank you so much. I also want to thank Casmir mosqueda for her work on this. I know she's been working on it for quite some time, obviously, and such such common sense legislation that during a period of time when there is a high level of, you know, high level of risk to exposure to a highly infectious disease'",
        "'speaker_0': 'that we will provide this coverage to the sector of workers is just is just common sense, not just for the health and safety of the workers, but also for the people that they interact with as sort of a Connector of Services.'",
        "'speaker_0': 'I really want to appreciate Councilor Moschino's efforts on this. I absolutely agree that there's a lot more work that we need to do in this space and look forward to an opportunity to finally be able to engage in that in that body of work in the coming in the coming months.'",
        "'speaker_0': 'So with that being said, we're going to go ahead and move forward here. And there appear to be no more comments or debate on this. So I'm going to go ahead and ask Councilor Mosquito to close us out and then we'll be able to call the roll on the bill.'",
        "'speaker_0': 'Thank you so much, council president and thanks to all of our Council colleagues for your comments on the paid sick and safe leave ordinance for gig workers. As the council president said, it is common sense. And even though it makes sense to give workers sick days during a global pandemic, you can imagine there was a lot of'",
        "'speaker_0': 'complex policy conversations that went into making sure that this policy was going to be actionable and that people would receive these benefits. And the two people that I want to thank again are Carina Bole from central staff and a chief of staff in my office.'",
        "'speaker_0': 'Those are the folks that I'm going to be passing along this thank you to. And I know they're probably watching with great anticipation as this labor of love over the last ten weeks looks to be about to make it over the finish line.'",
        "'speaker_0': 'A huge thank you to Carnival for the hundreds of hours that she has put into this piece of legislation, her energy and her knowledge and her willingness to think of creative solutions and for doing it all with incredible patience and grace.'",
        "'speaker_0': 'As you saw this morning, as she presented to our council colleagues and Senator Cory for her endless hours, hundreds of calls with various stakeholders, multiple meetings throughout both days and nights and weekends to make sure that voices were heard, ideas were incorporated, and that the important nuances were worked out.'",
        "'speaker_0': 'This is a really critical policy, and I think it will have lasting impacts for both the workers and the protection of all of our health in the upcoming months and years until we can get both a vaccine for COVID, but also more importantly for the broader protections that every gig worker needs to have as they are truly'",
        "'speaker_0': 'essential workers with or without a pandemic, and wanting to look to continue to strengthen the protections for those workers as well. I do want to thank, as you've heard over the last three or four weeks, folks have been writing in, calling the folks who you heard testify today, people in the Beckman article and others.'",
        "'speaker_0': 'These are the workers who themselves have had to not only figure out how to sustain themselves in this crisis, but really have put in a ton of work to crafting this policy with us. So thank you to the workers impacted by this legislation who've been at the table to help craft this basic set of protections to provide'",
        "'speaker_0': 'a floor so that every worker can have access to sick leave. This is an incredible win for those workers and for the city as a whole. The permit, the public comment from today's workers and over the last few weeks have really spoken for themselves.'",
        "'speaker_0': 'You all have heard these stories that I want to lift up. Just a few comments that we heard from today. And then last week, what you heard from Jason today was a sentence that really resonated that I think we should just spend another second or two to reflect on.'",
        "'speaker_0': 'He said, Don't call me essential and then not pay me like I'm essential. Don't call me a hero. Treat me like I'm human. He was followed by Mr. Thomas, who talked about how critical it is for us to make sure that folks actually have the safe leave, that they need, the sick leave, that they need to make'",
        "'speaker_0': 'sure that they haven't been left behind. And as he goes to the door, he sees people put their wallets away because of inherent bias, racism that continues to perpetuate in our community. It should go stated explicitly that the vast majority of workers that we're talking about protecting today are black and brown workers.'",
        "'speaker_0': 'And the vast number of people that have been left out of state and federal policy in terms of labor protections are black and brown workers. And that was true when we passed the Domestic Workers Bill of Rights last year.'",
        "'speaker_0': 'Thanks again to the council members who supported that legislation. And that, you know, we've made tremendous strides across the nation and passing that it's because they were explicitly left out of the federal protections at the at the national level, and we took the action to protect them.'",
        "'speaker_0': 'And today, yet again, we're standing up, especially for those who've been intentionally left out of labor protections in the past to. Make sure that our vulnerable workers, workers who are now calling essential, have these explicit protections as a critical component of our economy and making sure that they have the safety that they need during the time of'",
        "'speaker_0': 'the pandemic. And in recognizing that these are mostly black and brown workers. And then lastly, I want to leave you with the comments that I shared from Carmen, who is a GrubHub driver. She says now that people are hungry and hiding in their homes from the virus, I am suddenly essential and risking exposure to highly contagious, possibly'",
        "'speaker_0': 'deadly viruses to fetch people's dinner. That's why we need sick leave. I was sick with extreme flu like symptoms throughout March, although extremely weak, constantly coughing and having trouble talking in a full or taking a full breath. I kept working as a delivery driver because it was my only source of income.'",
        "'speaker_0': 'At times I was too weak to work or finished my shift. I lost my opportunity to earn income. Gig work was my only income, so I am now behind on all my monthly bills. I work as much as possible, but there are days where I only make enough for the next day to put gas in the car'",
        "'speaker_0': 'and grab a few groceries. I do not live paycheck to paycheck. I live day to day. I live order to order. I do not know how I will financially recover. I'm still experiencing waves of COVID 19 symptoms. At times I am not able to work with sickly.'",
        "'speaker_0': 'I will now make sure that I will never be in that situation. With sick leave. I would have not had to work when I was very sick and possibly spread the virus with sick leave. I would have stayed home with sick leave.'",
        "'speaker_0': 'I may have recovered faster. So thank you, council colleagues, for all of your work to support this legislation. And it's a great day. Thanks for all the workers and their time and for all of the stakeholders who provided input on this piece of legislation.'",
        "'speaker_0': 'Thank you so much, Councilmember Mosqueda. So that closes out our debate on this particular council bill. So I'm going to ask that the clerk please call the role on the passage of the bill as amended.'",
        "'speaker_1': 'Morales, I. Mascara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'So what.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Juarez, I. Purple. Lewis.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'President Gonzalez hi nine in favor and then oppose.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it and I'd ask that the clerk please affix my signature to the legislation. And congratulations, Counselor Muscat, on the passage of that bill, and especially congratulations to all of the all of the workers who will be covered by this new protection.'",
        "'speaker_0': 'It's really, really is a good day for them. Okay, folks, we have other business. I understand that Councilmember Morales does have an item in other business, so I will go ahead and hand it over to her for her remarks and have her walk us through her request.'"
    ]
}