{
    "Collective Bargaining Agreement between The City of Seattle and the International Brotherhood of Electrical Workers Local 77.": [
        "'speaker_1': 'The Report of City Council Agenda Item one Council Bill 120102 An ordinance relating to City Employment authorizing the execution of a collective bargaining agreement between the City of Seattle and the International Brotherhood of Electrical Workers, Local 77 to be effective January 23rd, 2021 to January 22nd, 2023.'",
        "'speaker_1': 'Amending Ordinance 126237, which adopted the 2021 budget by increasing appropriations to Seattle City Light for 2021 payments therefor and ratifying and confirming certain prior acts all by a three quarter vote of the City Council.'",
        "'speaker_0': 'Thank you so much, Madam Clerk. I moved past Council Bill 1 to 0 102. Is there a second? Thank you so much. It's been moved and seconded and as sponsor of this bill, I will address it first and then happy to open the floor to comments from any of you colleagues as the title States Council Bill 120102'",
        "'speaker_0': 'would authorize the execution of a collective bargaining agreement between the City of Seattle and the International Brotherhood of Electrical Workers, Local 77. This collective bargaining agreement is a two year agreement on wages, benefits, hours and other working conditions for a term from January 23rd, 2021 through January 22nd, 2023.'",
        "'speaker_0': 'It affects about 565 regularly appointed city employees, and its terms include a cost of living adjustment of 2%, 2.5%. There is also an additional one time base wage market increase of 10% to certain job titles as listed in Attachment eight to the collective bargaining agreement and an increase to the cable slicer and electrical constructor classifications for parity'",
        "'speaker_0': 'with the corresponding line worker classification rates of the pay. The terms of the Collective Bargaining Agreement do meet the negotiation parameters set by the members of the Labor Relations Policy Committee, of which five members of the City Council sit on and participate in actively and colleagues.'",
        "'speaker_0': 'After the Labor Relations Policy Committee process, I do as the Chair of the Labor Relations Policy Committee on behalf of the City Council, I do recommend that my colleagues support the passage of this legislation. Are there any additional comments on the bill, Councilmember Peterson.'",
        "'speaker_4': 'Thank you. Council President. Appreciate your hard work on this and the hard work of the members of the Labor Relations Policy Committee. I'm not one of the five council members serving on the LRP C, which which also includes the mayor's executive team.'",
        "'speaker_4': 'Essentially, the combined council members and mayors executive team represent management arm of city government that negotiates these labor contracts with city government employees. So when this proposed Labor contract appeared on the interaction referral calendar last week was the first time I was able to review it.'",
        "'speaker_4': 'I'd like to take this opportunity to explain my vote today to my constituents and how I'm able to get to a yes vote on this. First, I want to express my gratitude to our electrical workers who dedicate themselves and their skills to our city.'",
        "'speaker_4': 'And thanks again to the hard work of the members of the RTC, who members of the public may not know that you spend hours upon hours outside the spotlight working on all of these labor contracts. As I understand it, this proposed contract would increase compensation for many of the workers by 12.5%, which appears to be unusually high'",
        "'speaker_4': 'in just one year. This is an increase of $7.5 million, and most labor contracts with city government employees recently received an increase based on the Consumer Price Index plus 1%. This 12 and a half percent increase today, as I understand it, is comprised of, as you said, the CPI of approximately 2.5 plus another one time 10%, while'",
        "'speaker_4': 'the 10% one time it does create a new baseline of compensation for these city employees. In other words, the higher costs will continue into the second year of the two year contract. So that's about $15 million increase over the life of the contract.'",
        "'speaker_4': 'And while this 10% bump is significant, I have the benefit of chairing the committee that includes Seattle City Lights. I have additional opportunities to witness the important work conducted by these workers who go out into the field under dangerous conditions to use the skills of their trade to benefit our city.'",
        "'speaker_4': 'I understand there's been increased attrition within this group of workers leaving Seattle City life for other utility enterprises in the region who have been offering compensation at these higher levels. So this proposed increase in compensation appears to be an appropriate adjustment to reflect our realities.'",
        "'speaker_4': 'This is both public sector and private sector utilities. That's what's special about the utility industry's public sector and private sector. Utilities were competing against our skilled field workers. Satellite data also seems to show higher attrition rates among women and people of color.'",
        "'speaker_4': 'So I hope this increase in compensation can help our utility attract and retain skilled staff to meet its race and gender equity goals. Another important consideration is how this cost increase might impact utility rates for everyone in Seattle.'",
        "'speaker_4': 'As we know, utility rates are regressive, with lower, lower income households paying a larger percentage of their household income. And in a city where many of us are concerned about affordability for our long term residents, we want to be mindful when increasing costs.'",
        "'speaker_4': 'And this case, Seattle City Light, under the leadership of Deborah Smith has been working, has been making so much progress to control other cost drivers that the overall electricity rate increases in their strategic plan have come down. And as we've learned in our committee just two weeks ago, our electricity rate increases will average no more than three'",
        "'speaker_4': 'and a half percent, close to the rate of inflation, rather than four and a half percent increase previously projected. And this proposed increase in pay for these highly skilled workers is already built into that 3.5% average rate increase.'",
        "'speaker_4': 'In other words, this proposed increase in compensation for these highly skilled professionals will not increase overall electricity rates further. Another important consideration is that we're emerging from the pandemic, which should help with overall city revenues. This is relevant because our general fund takes money from Seattle City Light and Seattle Public Utilities every year with what's called a'",
        "'speaker_4': 'utility tax. I'd like to see city government tax on our publicly owned utilities reduced over time to further reduce the regressive, regressive rate pressures on low income households. I appreciate having the past week to review this contract. I know it's not always possible, but I look forward to an allocation of even more time to review labor contracts'",
        "'speaker_4': ', especially when we're reviewing multiple ones. This was just one, so it was manageable. Our current council rules require us to vote yes or no on legislation at the full council, and some more times are always welcome to make a well informed decision.'",
        "'speaker_4': 'Thank you for the space to make these lengthy comments and I will be voting yes.'",
        "'speaker_0': 'Not a problem. Thank you, Councilman Peterson. Appreciate you digging in and taking a closer look at that. Okay, colleagues, any additional any other additional comments on the bill? Hearing that will the clerk please call the role on the passage of the bill?'",
        "'speaker_1': 'Morales. S. Whatsoever.'",
        "'speaker_5': 'Hi.'",
        "'speaker_1': 'Petersen.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'So one. Yes. Strauss.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Suarez, I. Lewis. I think council president Gonzales. I need a favor. And then opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the court please affix my signature to the legislation on my behalf? Okay. Reports of the Finance and Housing Committee. Will the court please read the short title of item two into the record?'"
    ],
    "Ordinance on COVID-19 Response Fund and Budget Changes.": [
        "'speaker_1': 'The Report of the Finance and Housing Committee Agenda Item two Council Bill 120013 An ordinance relating related to the city's response to the COVID 19 crisis. Creating a new fund in the City Treasury. The committee recommends the bill passed as amended.'",
        "'speaker_0': 'Thank you so much. Appreciate that. Montclair Councilmember Macedo, you are the chair of this committee and I'm going to hand it over to you to provide the reports.'",
        "'speaker_5': 'Thank you very much, Madam President. And I am honored to be able to kick off a summary of this legislation that you and I have the chance to coauthor together, along with the mayor's office and all of the council members that are here today who provide a tremendous input along with community members.'",
        "'speaker_5': 'So I will do my best to get us kicked off and I really just want to say thank you. I'm excited to be able to be here today as we look to pass the Seattle rescue plan. And I will note that this is the first of three acts that you can expect from us over the next few'",
        "'speaker_5': 'months as we seek to respond to the crisis that COVID not only created but exacerbated in many cases, when you look at the inequities in our previous system that were just exposed by COVID. So first of three acts to come.'",
        "'speaker_5': 'We have before us with this proposal in the Seattle rescue plan, one in front of us, the first tranche of the American Rescue Plan Act dollars. This represents the first tranche that the city of Seattle is receiving that will total 232 million over the course of this year and next year, which means that half of that 160'",
        "'speaker_5': 'million is being passed today. We are adding to that $12.2 million from the Home Investment Partnership Plan. These bills together, these investments together represent an incredible opportunity for us to move forward on the commitments that this council made when we first passed Council Resolution 31999 back in March.'",
        "'speaker_5': 'Since then, we've had five subsequent meetings. We've had a public hearing completely devoted to hearing from the public about what community members need and where they would like these dollars prioritized. We've had the chance to talk to city councils from Austin to Minneapolis to Denver and so many others, to hear where other progressive cities are looking to'",
        "'speaker_5': 'invest these dollars. And most importantly, we've heard directly from community partners, from organizations, from those most impacted by COVID and from all council members where you would like to see these these dollars invested so that our city money can be coupled with state and federal investments to truly make an impact now and to lay the groundwork for'",
        "'speaker_5': 'a more equitable economy as we seek to recover and respond to COVID. Two weeks ago, we had the chance to introduce this legislation again in partnership with the Council, President's office, and with the mayor's office. And we kept in mind all of the recommendations and the priorities that each councilmember added to the Council resolution.'",
        "'speaker_5': 'Since then, we've made sure that among within our finance and housing committee members, we heard from various community members and community and Community Council participants about their priorities. And we had a chance to have discussions about where we would like to see dollars invested so we could address the most urgent needs in our community and lay that'",
        "'speaker_5': 'more equitable framework. The priorities we centered in this bill are similar to the priorities we've been talking about since the beginning of the onset of COVID. We included these priorities when we passed the Jumpstart Progressive Revenue proposal back in June and July of last year, we included them again, centering our values around equity and making sure that'",
        "'speaker_5': 'we are putting funding directly to those most impacted in our budget last year, these bills in front of us today respond directly to the crises exacerbated by COVID, by investing in housing and homelessness, economic resiliency and small businesses and the arts and culture, and directly into making sure that those who've been most disproportionately impacted and often left'",
        "'speaker_5': 'out of previous federal assistance under the Trump administration, administration were first to receive dollars, and that we centered investments not just in ensuring that those individuals were thought of, but that the organizations who work directly with those individuals and who have trust and come from and have deep ties and roots within those communities are receiving those dollars'",
        "'speaker_5': '. There's only a few areas that I'll highlight because I know a lot of folks are excited about highlighting various commitments that they've included. But one of the things I'm most excited about is $25 million in direct cash assistance specifically to go into the hands of working families and individuals, our elders and folks who have been really struggling'",
        "'speaker_5': 'by the impacts of COVID to make sure that we can have a direct infusion into our local economy, recognizing that those who are experiencing hardship know best how to use that cash assistance. I'm most excited about the childcare assistance of $8 million combined, going directly to support childcare providers and 5 million of that going to create greater'",
        "'speaker_5': 'access to affordable childcare throughout our city by making sure we have capital investments to build more affordable childcare in King County and Seattle, we know that somewhere between 7 to 10% of our childcare facilities have closed and some looking like they're going to unfortunately stay permanently closed unless we do something and act with urgency now at a'",
        "'speaker_5': 'city council level. We know that this is a critical investment for us to make because across our nation and right here in the city of Seattle, if we don't invest in childcare, it hurts our local economy as well as hurting local families.'",
        "'speaker_5': 'The closure of childcare across our country is resulting in billions of dollars lost to employers each year and over. 500,000 children without childcare in our country. Childcare workers have found themselves out of work during this pandemic, with a net loss of around 170,000 childcare worker positions opened between January of 2020 and January of 2021.'",
        "'speaker_5': 'But we can do something about that right here. And our investment of $8 million into childcare, specifically attempts to make sure that we're encouraging the creation of additional childcare and recognizing and honoring and appreciating those childcare providers who helped us during this last year.'",
        "'speaker_5': 'We've talked about the need for this rescue plan to respond to the C section, not the recession, the C section, recognizing that women were much more likely to have to have left the workforce because of lack of access to childcare and also recognizing that it's been disproportionately women and people of color who've been on the frontline more'",
        "'speaker_5': 'exposed to COVID, if they've been able to keep their job as essential workers in the service sector in many cases. I'm really excited about the ways in which we've tied in care for the trauma that people have been through in the last year by investing funding into the Domestic Violence Prevention and youth services, senior services to care'",
        "'speaker_5': 'for isolation and neglect. And I know that there's much more that we need to do. But I want to also see these investments paired with what the county has offered. King County is of that investing about 38 million, specifically for behavioral health responses and recovery, to help identify ways in which we can make sure that those who've'",
        "'speaker_5': 'been hardest hit even before COVID, but especially those who have their behavioral and mental health needs exacerbated during COVID, that they have the services they need. And I want to applaud King County Council and the executive for the passage of their Rescue Plan Act just a few weeks ago.'",
        "'speaker_5': 'Our proposal is going to be package and complement many of the areas that King County invested in and investments in. Behavioral health is one area where I'm excited to see the complementary funding streams align. I want to note, as I'm sure Councilmember Lewis may speak, to the importance of the five of over $5 million, I should say'",
        "'speaker_5': '$7.5 million that I remember from recollection that's going in to match the King County just cares like program. So services like just cares that are responding directly to the need for homeless folks or those that are experiencing homelessness to have access to appropriate shelter during this time of COVID, recognizing we're not out of the storm yet and'",
        "'speaker_5': 'the variants continue to show increasing concern in our area. We want to make sure non congregate shelter options like hotels are invested in and that we match the county's effort of around $7.5 million to bring programs like Just Cares to Scale.'",
        "'speaker_5': 'We said a countless times throughout the pandemic, we know that the exacerbation of the inequities that were present before have just been made worse by COVID. But those especially are true for the racial inequities that we see. We see rates of communities of color who've been contracting COVID and dying from COVID, the exponentially higher than white residents'",
        "'speaker_5': '. And this pattern follows many other social inequities that put racial and ethnic minorities at increased risk and an increased risk of health disparities, educational attainment disparities, wealth and income gap disparities, and so much more. And that's why we have centered our investments today on making sure that we're looking at near and long term investments for the Seattle'",
        "'speaker_5': 'Rescue Plan Act through the lens of what is just just for our racial and ethnic commitments to making sure that folks who've been disproportionately impacted by COVID have the assistance they need and that we're creating greater opportunities for economic stability and opportunity in the out years.'",
        "'speaker_5': 'I'm very excited about the language that we also included that makes sure that community based organizations are culturally relevant and historically rooted in and founded by communities that have been disproportionately impacted by COVID and have organizational leadership, staff and board composition that reflect the communities they serve.'",
        "'speaker_5': 'For the purposes of direct grants and allocation of grants to communities. We built this community, this language with community partners. We heard a manager call in and others talking about it's not just important to talk about where the funding goes, but how the funding gets allocated.'",
        "'speaker_5': 'And that language was intentionally written in and expanded actually as well into both this bill and the cash assistance bill that we will pass as a follow up to this legislation. I will stop there with just noting those few areas and my excitement around the $28.5 million going into housing and acquisition and building more homes, that we're'",
        "'speaker_5': 'really creating affordable housing and stability for folks as we seek to recover from COVID. And I'll say with the rest of my comments from the President for wrap up at the end of this discussion.'",
        "'speaker_0': 'Thank you so much. Customer Musketeer for that. Customer Louis I do see that you have your hand up, so I'm going to calling you first. And colleagues, for those of you would also like to make comments on this particular council bill, do let me know by raising your hand.'",
        "'speaker_0': 'Councilor Lewis, please.'",
        "'speaker_4': 'Thank you, Madam President. I do just briefly want to lift up the really critical homelessness and public safety investments that are being made in this package today. All of the conversation that we have been having in this council in regards to the dress care model.'",
        "'speaker_4': 'My comments this morning at briefing some of that is going to come to reality through the very real investments that we are making here, by joining forces with King County to do this joint procurement for a just care like approach and just hair like strategy to extend the benefits that we have seen in the Chinatown International District'",
        "'speaker_4': 'in Pioneer Square neighborhood to neighborhoods throughout the city and really start to see a very the very tangible improvement and benefit that that model brings. And I'm really looking forward to voting for this package for those investments alone, let alone all the other great investments that Councilmember Mesquita just gave an an overview for.'",
        "'speaker_4': 'I do want to just briefly address that. Over the last week, working with central staffs, city departments and downtown stakeholders. We were able to get a go ahead from the people we've been working with on downtown programing and reopening and support that they will be able to achieve their programmatic ambitions within how this package is currently being'",
        "'speaker_4': 'divvied up. So there was no need to bring an amendment to seek additional exclusive appropriation for downtown recovery. So I just want to address that, since I had indicated that I would potentially be bringing such an amendment. My understanding from talking to downtown Seattle Association, Department of Economic Development and our various arts partners is that there is'",
        "'speaker_4': 'enough resource that can be allocated under the current provisos and budget line items to accommodate the plans that are being made. And so there's no need for any kind of additional authority in the package. So I just wanted to acknowledge that.'",
        "'speaker_4': 'And with that, I don't have any additional comments. I'm looking forward to voting on this today.'",
        "'speaker_0': 'Thank you so much, Councilor Lewis, for that. Morales I see that your hand is raised. Please.'",
        "'speaker_2': 'Q Thanks so much, colleagues. I do want to just talk about a couple of the amendments that were included in this bill. Our office, after lots of conversation with small business, with arts organizations, grassroots activists and even other elected officials, worked really hard to gather their ideas and input on how to use this sort of once in'",
        "'speaker_2': 'a generation investment to build a more equitable economic recovery. And I'm excited to have two amendments that were developed in partnership with them included here. So the kinds of conversations we were having included an acknowledgment that there just isn't enough economic opportunity for folks in the city.'",
        "'speaker_2': '46% of the workforce in greater Seattle is either unemployed or stuck in low wage work before COVID. And we know that a problem has only gotten worse. We know that there is also an equitable access to opportunity in the city, particularly for black and Hispanic folks in our community.'",
        "'speaker_2': 'And that Seattle ranks in the bottom third of large metro areas for black and Hispanic representation in technology and in managerial roles. So I'm excited that with this bill we can really begin to address some of these disparities and the commitment of $22 million into this bill to create good jobs, to begin developing skills that are relevant'",
        "'speaker_2': 'to good jobs, supporting firms with technical assistance, increasing access to wealth building strategies. These are the kinds of investments that we need in order to really begin building an equitable recovery for folks. The other thing that I want to acknowledge is that and I do want to thank Councilmember Lewis for your comments.'",
        "'speaker_2': 'You know, a big part of the inequity that we've experienced is because our neighborhood business associations, neighborhood commercial districts just don't have access to the kind of resources that a downtown BIA might be able to generate. And so I do think it's important that a five and a half million dollars of the of the funding will is'",
        "'speaker_2': 'specifically for neighborhood business organizations and associations. And then the last thing I want to say is that the bill also addresses or begins to address the challenges of our young people who are trying to get the skills that they need to have a pathway to a good union, paying union wage jobs to career paths, and especially for'",
        "'speaker_2': 'those who may be taking care of family members or may not have an opportunity to go to college. I'm excited that our office has been working with the Port Commission to expand the current Opportunity Youth Initiative by adding $1,000,000 to the existing program.'",
        "'speaker_2': 'So as I mentioned before, I know an important strategy that can help lead young people into good union jobs, includes expanding internships, and this million dollars will go a long way toward expanding that program, not just for the summer, but expanding it to a year round program that can really support, support our young people.'",
        "'speaker_2': 'So I want to thank the members of the Finance and Housing Committee for their support of these amendments that I offered and look forward to passing a bill that is really rooted in the principles of an equitable recovery.'",
        "'speaker_0': 'Thank you so much, Councilman Morales, for those comments. Next up is Councilmember Herbold. Please.'",
        "'speaker_6': 'Thank you so much. I just want to really recognize that there's just been actually some good news recently about the pandemic. King County hitting 70% vaccination rates, hospitalizations and cases down. Families and friends reunited, reuniting and state wide reopening right around the corner.'",
        "'speaker_6': 'And, you know, the work that we've been doing here at the city council and that the county has been doing at the county council is really making that this concept of building back better, something that is seems like a realistic thing to to strive for from addressing the harms and traumas of the last year and a half'",
        "'speaker_6': ', which have taken a toll on each and every person in our community. As always, those harms have not fallen equally on our communities. And we know that bipoc communities, immigrants, refugees and those without technology, access or mobility have been the hardest hit.'",
        "'speaker_6': 'And so to truly build back better, we have to have we have to target these precious recovery funds to those who need them most. Those are the parts who are the furthest from recovery. So, you know, we know that families are still struggling to meet the basic needs of their children and keep food on the table.'",
        "'speaker_6': 'Survivors of violence have been cut off from their network of support and crisis services. A year of isolation and insecurity has taken its toll on the mental health of so many people in our community. I've talked a lot before about the shadow pandemic, how the restricted movement, social isolation and economic security has increased our vulnerability to violence'",
        "'speaker_6': 'and self-harm. But the Seattle rescue plan includes more than 35 million focused on trauma informed well-being services to address the shadow pandemic, including investments in senior isolation, mental and behavioral health, gender based violence, diaper distribution and free meals.'",
        "'speaker_6': 'With these investments, more families who have been the most impacted over the past year will have what they need to emerge stronger and healthier. I really want to thank our partners for their strong advocacy for these investments, including Tony, Sarge and Sara Cody Roth at West Side, baby Mary Ellen Stone at the King County Sexual Resource Center'",
        "'speaker_6': ', Merrill Cousin and Merritt Marin Thea Torres at the Coalition for Ending Gender based Violence. And in areas where the proposed version of the bill didn't quite live up to the promise of the Council's intent resolution. Councilmember Muska to help right the ship so that we could fulfill all of our commitments.'",
        "'speaker_6': 'Thank you. Councilmember ROSQUETA, the package now also includes critical investments in Samantha in Seattle's creative economy, as we promised to do in the council's intent resolution, the city's 2029 Creative Economy study found that the creative sector drives 18% of Seattle's GDP.'",
        "'speaker_6': 'That's four times the national average. So that means that this sector is so critical to Seattle's economic recovery, as well as being vital to making Seattle the unique and special place we love. Artists and musicians have been uniquely hardly hit, and many are struggling to hang on while still contributing to our communities.'",
        "'speaker_6': 'I want to thank you to the councilmembers who supported these amendments that ensure that artists hardest hit by the pandemic are eligible for direct cash assistance from this package and for also creating a fund within the Office of Arts and Culture to focus target assistance on small and bipoc led creative organizations so that they can reopen and'",
        "'speaker_6': 'bring back their staff. This investment will help ensure our extraordinary creative communities are not yet another victim of the pandemic, like I did for the advocates working for funding to address the shadow pandemic. I want to also thank you the advocates who have worked to ensure that these critical cultural economy investments are included.'",
        "'speaker_6': 'Thanks to Seattle Arts Commission co-chairs Sarah Wilkie and Dr. Quentin Morris. And thank you as well to Seattle Music Commission chair Tanner Marra and the many musicians and artists who provided public testimony to help council understand how they've been uniquely impacted.'",
        "'speaker_6': 'And thank you for their extraordinary advocacy. When also give a shout out to some of the work of my constituents in District one who have organized over the past year to preserve one of the positive legacies of the pandemic, the keep moving streets.'",
        "'speaker_6': 'This package ensures that the city will continue its work to consider making moving streets such as Alki point permanent. Thanks as well to the Seattle Neighborhood Greenways and many community members who have been involved to make this available.'",
        "'speaker_6': 'As part of this this package. And just we know that building back better means investing in those furthest from recovery. And I'm glad to have had the opportunity to work with all of you to do that today and to underscore it with my vote.'",
        "'speaker_0': 'Thank you so much, Councilmember Herbold, for those comments. Are there any additional comments on the bill? I'm not seeing any other hands raised, but I would like to take an opportunity before I allow Councilmember Mosqueda to close out debate on this bill.'",
        "'speaker_0': 'I would, as one of the co-sponsors, like to take an opportunity to make my own comments about this particular suite of bills related to these federal funds. Council colleagues, again, thank you so much for the opportunity to comment on this legislation and for your strong collaboration and unification around the Seattle rescue plan.'",
        "'speaker_0': 'I am going to try not to duplicate many of the comments made by others, including the Budget Chair, Teresa Mosquito. But I did want to underscore some of the key highlights of this legislation. From my perspective, I'm proud of the hard work that went into creating a collaborative path to developing the Seattle Rescue Plan in the first'",
        "'speaker_0': 'place. I'm grateful to Budget Chair Mosqueda, Mayor Durkan, as well as a number of council and executive branch staff that spent weeks drafting this plan in a way that addresses the most pressing priorities and objectives that were raised by council members, public commenters and community based organizations.'",
        "'speaker_0': 'The fact that budget legislation of this size received so few substantive amendments, I think is testament to the good work that was done to build a consensus back package for us to consider in committee and subsequently in today's full council meeting.'",
        "'speaker_0': 'Although $128 million is not sufficient to meet the various critical needs facing our city's residents, we have a unique opportunity with this funding to make a difference in the lives of countless Seattleites and set our city on a path towards a more equitable economic recovery from the COVID 19 public health and economic crises.'",
        "'speaker_0': 'I am truly excited about the resources being provided in this legislation to do some of the following expand affordable housing opportunities and homelessness services. Provide direct support to small businesses, workers and neighborhood commercial districts across the city, increase childcare infrastructure and enhance wages for childcare workers.'",
        "'speaker_0': 'This infusion of resources will help. Home based and daycare centers reopen or expand, which will ultimately grow our city's childcare network and allow parents to get back to work. We'll also invest in the reopening of cultural and arts institutions.'",
        "'speaker_0': 'We will reactivate and enhance our public spaces like parks and streets for outdoor recreation, commercial opportunities and socially distant activities. And this package offers direct cash assistance to those who have been most impacted by the pandemic. These critical investments made in the Seattle rescue plan could not be possible without the hard work of our state's congressional delegation'",
        "'speaker_0': 'as well, particularly Senators Patty Murray and Maria Cantwell and Representative Pramila Jayapal. Well, I want to thank for Pat for their efforts in passing the American Rescue Plan Act to begin with. I am very grateful to our federal representatives and President Joe Biden for ensuring that these needed resources were made available to local government and, of course'",
        "'speaker_0': ', our residents. Finally, in closing out my comments, I would be remiss if I didn't acknowledge the fact that this Council, led by Councilmember Mosqueda and a broad coalition of stakeholders, have this Council not passed the Jumpstart Seattle Progressive Payroll Tax in 2020?'",
        "'speaker_0': 'We would not be in a position to be making any of these investments without the roughly $200 million in revenue expected from the Jumpstart Seattle Progressive Payroll Tax. We would have been forced to lay off hundreds of city of Seattle employees and drastically reduce city services.'",
        "'speaker_0': 'Without that revenue, we would be using all of the funds from the American Rescue Plan Act to plug holes in the city's budget and simply restore spending and services to pre-pandemic levels. Fortunately, thanks to the tremendous work that was done to pass Jumpstart Seattle and to defend its legality in court, we are in this position today to'",
        "'speaker_0': 'use these federal dollars to greatly expand the services and resources our city is able to offer as we look towards rebuilding equitably across our city. So I want to say thank you to all of you, my council colleagues, and in particular to our budget chair, Teresa mosqueda, as well as all of our community partners that have helped'",
        "'speaker_0': 'us to set a course towards a robust and equitable recovery from the COVID 19 pandemic, both in the economic context and in the public health context. So thank you so much for the opportunity to make some comments. Again, I really want to lift up the tremendous amount of work that our legislative staff and our city budget office'",
        "'speaker_0': 'staff and mural staff have done to bring. This package for. That is a good moment for us as a city family. And I especially want to thank Councilman Mosquito's Partnership and Angel for reaching her office and Cody writer in my office.'",
        "'speaker_0': 'For all of the countless amount of hours we have spent together working on these on these issues with Allie Pucci, Jeff Sims, Yolanda Ho, so many others to mention. Thank you, everyone, for all of your important work on this really, really important piece of legislation.'",
        "'speaker_0': 'That being said, I'm going to hand it back over to Councilman Mosquito, who's going to close out debate, and then we will be able to vote on this bill.'",
        "'speaker_5': 'Thank you. Council President, thank you very much for your remarks as well, especially about Jumpstart. It's been tremendous to be able to work with you and your team as we've crafted this legislation in front of us. So thank you very much.'",
        "'speaker_5': 'Colleagues, this is our chance. This is our chance to build back better and it's our chance to build back more equitably. The Seattle Rescue Plan Act here today. Again, the first of three acts to come this year helps to ensure that the critical dollars are going to where they're most needed in attachment number one that you found'",
        "'speaker_5': 'from Ali, financially, it summarizes $49.2 million and the housing and homelessness, $41 million and the community well-being to address the trauma that so many have been through and are still dealing with, $23.5 million in the community and small business recovery and 40 over 14 million going into community assistance, city programing and city services and our critical city'",
        "'speaker_5': 'workers. This is a package we can all be proud of and a package that we can build on for the future. Tranche two will be discussed later this year when we consider the 2022 budget and we'll have a chance in just the next few weeks, starting in July, to look at Seattle Rescue Plan two, which will be'",
        "'speaker_5': 'a combination of funding that comes from the federal government, that relates to the Older Americans Act funding, rental assistance, transportation funds from the federal government, and so many more pieces to help us center our recovery efforts. Again, thank you to our congressional delegation, as the council president rightly mentioned, for helping to free up these much needed dollars'",
        "'speaker_5': 'to cities across the country and especially to the city of Seattle, where we continue to deal with five and six years now of a crisis in housing and homelessness that has only been made worse by the COVID pandemic.'",
        "'speaker_5': 'And so this is truly an incredible opportunity to set the course to right our investments now and begin building on those in the upcoming months. I want to thank every council member who offered amendments, as you all discussed in your summary of your amendments.'",
        "'speaker_5': 'And Councilmember Strauss, I heard you this morning say some great comments and folks and get a chance to see that. I hope you get to see Councilmember Strauss's Amendment summary as well, because every single one of those amendments truly helps to strengthen and clarify language in this final proposal.'",
        "'speaker_5': 'Especially, I want to thank the work that councilmembers Morales and Herbold noted on the work to extrapolate more details out of the $23 million that's being allocated to business recovery efforts, making sure that we're centering investments into black, indigenous and people of color, community organizations and businesses specifically focused on small and micro-businesses, neighborhood economic hubs in our'",
        "'speaker_5': 'downtown core by making sure that youth employment and paid internship opportunities help folks get into good living wage jobs, and that we're investing in the recovery and vibrancy of our arts and cultural organizations and those workers. This package is something that I'm proud of and I continue to look forward to working with you as we build on'",
        "'speaker_5': 'these efforts in the summer efforts again for Seattle Rescue Plan Act number two and for the fall budget activities, which will include tranche two in our Seattle Rescue Plan Act. Number three, no rest for us because there's a lot to make up for here in terms of needs and investments in our community.'",
        "'speaker_5': 'And as we do so, I know we'll continue to center homelessness, response, economic resilience and direct assistance to those who need it most. And that will continue to draw direction and leadership from communities who've been writing in and helping us craft this bill together.'",
        "'speaker_5': 'I want to thank as well central staff led by Allie Pantry and her incredible team. I'll try to list a bunch of them, but I know that there's so many more involved you want to hold. Tracy Ratcliff, Brian Goodnight and Justin's principal and so many others.'",
        "'speaker_5': 'Folks in the city budgets office, Julie Daley, led the conversations along with director Ben Noble. Thank you very much. And to Mayor Durkan, it's been really good to see this proposal come together so that we can jointly make sure that folks who are most in need get a direct assistance as soon as possible so that we can'",
        "'speaker_5': 'release these federal dollars. I appreciate your partnership on this. I want to thank the executive team and the council teams, communication departments who have jointly been working to get the information out and again to Council President Gonzales for the co-sponsorship on this legislation.'",
        "'speaker_5': 'To your team member, Cody, writer who's been working on this on a weekly basis, along with several pretty chief of staff in my office and the entire team within our office, Aaron Sigal and Ari along with Lori, but especially to say for their work in coordinating the effort in front of us.'",
        "'speaker_5': 'And I'll end with that quote from Aaron Hite, a child care provider union at SEIU 95. Every parent deserves a safe, nurturing place to spend their day while their parents are at work. But quality care is expensive, and a workforce made primarily of women has been women of color, has been underpaid and undervalued in the past.'",
        "'speaker_5': 'The. Pandemic made it clear to parents and employers that affordable, accessible childcare is critical to our economy and our recovery. When schools shut down. Childcare professionals stepped up caring for kids and facilitating online learning for school age kiddos.'",
        "'speaker_5': 'Today's legislation, the Seattle rescue plan, is one step in rebuilding a child care system that works for everyone, whether you're black, white or brown. This bill will help everyone and make us have a more equitable recovery. Thank you very much for all of your work.'",
        "'speaker_5': 'Look forward to building on this with your efforts in the future.'",
        "'speaker_0': 'Thank you so much, Councilmember Musketeer, for those closing remarks. Debate is now closed on the bill, so we're going to take a vote. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'What else?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Russia. Hi.'",
        "'speaker_4': 'Peterson I.'",
        "'speaker_1': 'So want. Yes. Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Herbold. Yes.'",
        "'speaker_3': 'SUAREZ Yes.'",
        "'speaker_1': 'Lord. LEWIS Yes. And Council President Gonzalez I nine in favor and in a post.'"
    ],
    "COVID-19 Response Budget Amendments and Provisos.": [
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. Will the clerk please fix my signature to the legislation on my behalf? Well, the clerk please read item three into the record.'",
        "'speaker_1': 'Agenda item three Council Bill 120094 An ordinance related to the City's Response to the COVID 19 crisis. Amending Ordinance 126237, which adopted the 2021 budget, changing appropriations to various departments and budget control levels and from various funds in the budget, imposing provisos and ratifying, confirming certain prior acts all by a three quarter vote of the City Council'",
        "'speaker_1': '. The committee recommends Bill pass as amended.'",
        "'speaker_0': 'Thank you, Madam Chair. House Members. You are the Chair of this committee, so I'm going to hand it back over to you to provide the committee report.'",
        "'speaker_5': 'Thank you so much. And I will be brief here and just noting that this is an important carry through so that we can adopt and implement the Seattle rescue plan specifically for the cash assistance, which is critical here.'",
        "'speaker_5': 'And I want to just say thanks if I did it quite well. So I think I am inadvertently left off and my thank you to my staff in the last go around who has been clerking all of these meetings for the majority of the last two months.'",
        "'speaker_5': 'And thank you very much to all of you for your consideration of this legislation. This is the trailer bill to the bill we just voted on.'",
        "'speaker_0': 'Thank you so much, Governor Mosqueda. I also wanted to just briefly address the cash assistance fund bill. So this obviously is designed to promote the good work that has been done by the city and the Office of Immigrant Refugee Affairs in particular, which reports to my committee to make this cash assistance possible.'",
        "'speaker_0': 'We needed to rely on some of the good work and lessons that we learned from direct cash assistance programs that we have run through the Office of Immigrant Refugee Affairs. This $25 million fund is being modeled after an incredibly successful city of Seattle and O'Hara led program to quickly deploy cash assistance awards of 1000 to $3000 to'",
        "'speaker_0': 'immigrant families who were unable to access federal support despite the disproportionate impacts of the COVID 19 pandemic on immigrant and refugee families. They did this by working with community to ensure that there was strong language, access and prioritizing those people that are the hardest to reach.'",
        "'speaker_0': 'OIRA is taken on the charge of administering this $25 million fund and to expand the eligibility criteria to serve not only immigrants and refugees, but also bipoc families, artists and other folks who have been most impacted by the pandemic.'",
        "'speaker_0': 'I am confident, though, that OIRA, although small, is very mighty and that they will have the ability and expertize to scale up and build on their success to help our constituents, and that they will center equity while lowering access barriers to help those who have been most impacted.'",
        "'speaker_0': 'I'm excited by the opportunity to provide direct financial assistance to the individuals and families who have the greatest need for support, allowing them to share in the strong recovery that we hope the city and the region is about to experience.'",
        "'speaker_0': 'So huge thanks to OIRA and their contracted partner organizations in making sure we get these funds to the most deserving folks. So that being said, are there any additional comments on the bill? All right. Hearing that, will the court please call the roll on the passage of the bill?'",
        "'speaker_1': 'Moralez. Yes.'",
        "'speaker_3': 'Macheda and.'",
        "'speaker_0': 'Petersen.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Strauss What's.'",
        "'speaker_1': 'Turbo s? Suarez, I. Luis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'And Council President Gonzalez, I am in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Well the clerk please read item four into the record.'"
    ],
    "Housing Levy Plan, Funding Policies, and Loan and Contract Actions.": [
        "'speaker_1': 'General item for Council Bill 120101 An ordinance relating to housing for low income households. Adopting the Housing Levy, Administrative and Financial Plan for Program Years 2021 through 2023. Adopting Housing Funding Policies. For the 2016 housing levy and other funds sources authorizing actions by the Director of Housing regarding past and future housing loans and contracts and ratifying and'",
        "'speaker_1': 'confirming certain prior acts. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. Mr. Mosquito. This bill comes out of your committee as well, so I'm going to hand it over to you to provide the community report.'",
        "'speaker_5': 'Thank you very much. Council President. Colleagues, this legislation updates the city's affordable housing funding policies, also known as the NF plan, and it makes some important updates building on the deep changes that were rooted in community needs and suggestions that we took in my community, in my committee back in 2019.'",
        "'speaker_5': 'Those changes included expanding upon and clarifying the city's intent to use community preference and affirmative markets marketing policies as a framework, as a policy framework for ensuring that those who've been most disproportionately impacted by displacement had a strong opportunity to remain in our city and have access to affordable housing.'",
        "'speaker_5': 'At that point, we included stronger labor standards to make sure that our new housing that was being built had opportunities for greater labor standards, and that we looked for opportunities to strengthen our commitment to good living wage jobs as we built housing.'",
        "'speaker_5': 'Language on that should be forthcoming in a report on the case site and other work that we did as well. We also at that point increased Office of Housing Acquisition Authority up to a cap of $30 million at the time.'",
        "'speaker_5': 'And a lot of that work that we did in 2019 was really rooted in a number of community roundtable discussions that we had, specifically with Bipoc led housing development groups and communities who are most in need of affordable housing in the city.'",
        "'speaker_5': 'So fast forward to 2021. This is an opportunity for us to expand upon some of those really important changes that we made and make some important and make some small sort of tweaks to really allow for some of those important policy changes to come to fruition.'",
        "'speaker_5': 'But this does not include major policy directive changes, given that this is a proposal that I think was really well crafted as it was sent to us and included some of the previous work that we had done just two years ago.'",
        "'speaker_5': 'There's a few things that we should be really excited about in this legislation that we haven't had a chance to hear me say this before. This is a really great opportunity for the Office of Housing to increase its home ownership subsidy, to make sure that we're adequately funding the construction of permanent, affordable homes, to make sure that'",
        "'speaker_5': 'our very competitive and hot housing market has actual chance of having competition and being able to have more for folks access first time home ownership opportunities. We are in this legislation removing that cap. Previously we had upped the cap on the acquisition authority and now we're removing it.'",
        "'speaker_5': 'So the Office of Housing has the authority where needed, when there is new revenue available to quickly move and seize opportunities to acquire property for the creation of affordable housing. Given the changing market conditions we're seeing, and why is this important right now?'",
        "'speaker_5': 'If we see multifamily structures going on the market or derelict buildings that could be used for affordable housing now or in the future, we want to be competitive and to bring in more publicly owned housing options and create public opportunities for folks to have access to good, affordable housing within the city.'",
        "'speaker_5': 'And removing this cap is a smart way for us to make sure that we're seizing those opportunities. With the onset of COVID, we've also seen a huge demand and acquisition. We built some of the acquisition language into our Jumpstart legislation from last year, and with the money now coming in January of this upcoming year, we'll have the'",
        "'speaker_5': 'chance to spend those dollars. We just put a portion of the $28.5 million for acquisition and development that you all just voted on in the Seattle Rescue Plan Act Bill. Acquisition acquisition. Acquisition is the theme of the show when it relates to affordable housing right now.'",
        "'speaker_5': 'And we have made sure that the state is a priority in this plan as well. And there's already several products projects that have given notice to the city to apply for acquisition from funds directly rooted in community organizations and communities that are working.'",
        "'speaker_5': 'Community organizations that are working on building, building affordable housing have already submitted their notice to apply for acquisition funds in this year's notice of intent to apply around. And we know that there's much more opportunities needed on the horizon.'",
        "'speaker_5': 'So really excited to have these important changes included in the NF plan and look forward to having your support. And just very quickly, want to thank Emily Alvarado and her team at the Office of Housing, Tracy Ratcliff from Central Staff and Erin House from my office, who've been working closely on getting this legislation ready for us to'",
        "'speaker_5': 'go out today. I hope you'll support it.'",
        "'speaker_1': 'Thank you so much because.'",
        "'speaker_0': 'We're almost there for those comments. Are there any additional comments on the bill? I don't see any hands raised for any additional comments. So I'm going to ask that the clerk please call the role on the passage of the bill.'",
        "'speaker_1': 'Palace. S Macheda. Hi, Paterson.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Sergeant.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Strauss. That's Herbold. As Juarez as Luis?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'And Counselor, President Gonzalez. I need a favor. And unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? All right. Item five, will the clerk please read item five into the record.'"
    ],
    "Water Quality Combined Financial Assistance Agreement for the Ship Canal Water Quality Project.": [
        "'speaker_1': 'Report of the Transportation and Utilities Committee Agenda Item five Council Bill 120100 An ordinance relating to Seattle Public Utilities authorizing the general manager CEO of Seattle Public Utilities to enter into a water quality combined financial assistance agreement between the State of Washington, Department of Ecology and the City of Seattle Public Utilities Department to partially finance costs related'",
        "'speaker_1': 'to the construction of the ship Canal Water Quality Project through a clean water state revolving fund loan. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. Councilmember Peterson, you are chair of this committee, and I'm going to hand it over to you to provide the committee report.'",
        "'speaker_4': 'Thank you. Council president, colleagues, as I mentioned in council briefing this morning. This is Council 120 100. It authorizes Seattle Public Utilities to accept a low interest loan provided through the State Department of Ecology to finance 66 million of the $570 million ship canal water quality project.'",
        "'speaker_4': 'As you may know, or as you may recall, that ship canal water quality projects, major megaproject planned over many years due to the state and federal governments requiring the city and county governments to prevent harmful storm water and wastewater from polluting our local waterways.'",
        "'speaker_4': 'This Environmental Protection Project includes a new tunnel boring machine, creating a 2.7 mile stormwater storage tunnel from Wallingford to Ballard. This particular financing program through the State Government enables a below market interest rate of approximately 1%. Whereas if we went out to the conventional bond market, we would need to pay a higher rate of around 3%.'",
        "'speaker_4': 'Using the state program will save ratepayers approximately $12 million from this particular loan. This council bill was recommended unanimously by our committee. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson, for those comments. Are there any additional comments? Hearing no additional comments. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'What else? Yes. Must gather. I Pietersen. I so want. Yes. Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Purple. Yes. Flores. Yes. Lewis. Yes. And Council President Gonzalez. High nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read items six through eight into the record?'",
        "'speaker_1': 'Agenda item six through eight. Appointments 1947 through 1949, the appointments of Eric Fitzpatrick, Penguin and Greyson Simon as members Seattle Pedestrian Advisory Board for terms to March 31st, 2023. The committee recommends the appointments be confirmed.'"
    ],
    "Public Hearing on Seattle City Light's Petition for Street Vacation.": [
        "'speaker_1': 'Adoption of other resolutions. Agenda Item nine Resolution 32008a resolution setting the public hearing on the petition of Seattle City Light for the vacation of a portion of diagonal way south west of Fourth Avenue, south in the Greater Duwamish Manufacturing Industrial Center of Seattle, according to Chapter 35.79 of the Revised Code of Washington, Chapter 15.62 of the Seattle'",
        "'speaker_1': 'Municipal Code and Clark File 314451.'",
        "'speaker_0': 'Thank you, Madam Park. I move to adopt resolution 32008. Is there a second?'",
        "'speaker_4': 'Second?'",
        "'speaker_0': 'It's been moved and seconded to adopt the resolution. Jasper Petersen, you are the sponsors. I'm going to hand it over to you to address this item.'",
        "'speaker_4': 'Thank you, councilor, president, colleagues, as I mentioned at council briefing this morning. This is resolution 32008. It simply says the time of a public hearing at our Transportation and Utilities Committee for Wednesday, July 21st at 9:30 a.m. to discuss another small property transfer associated with work on Seattle City Lights facilities and associated with the south parts of'",
        "'speaker_4': 'Georgetown Bike Trail. If approved after the July 21st public hearing, our Seattle Department of Transportation will be authorized to vacate the right of way of the 13,000 square foot parcel and provide that Seattle City Light, which owns the adjacent properties at Diagonal Way south just west of Fourth Avenue, south in the Greater Duwamish Manufacturing Industrial Center of'",
        "'speaker_4': 'Seattle. Clark File 314451 is associated with this resolution and is Seattle City Lights official petition to City Council for the vacation of Stotts Right of way. The occasion of the right of way will be handled in a manner that does not negatively impact Seattle Public Utilities.'",
        "'speaker_4': 'Again, this resolution simply sets the date of the public hearing and will get more information on the substance of this proposal before and during the July 21st public hearing at our committee. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Are there any additional comments on the resolution? Hearing, none will please call the role on the adoption of the resolution.'",
        "'speaker_1': 'Alice?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Let's gather. I hear your son's.'",
        "'speaker_4': 'High.'",
        "'speaker_1': 'School want. Yes. Strauss. Yes. Herbals. S Juarez? Yes. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'And counselor. President Gonzalez. I nine in favor and and opposed.'",
        "'speaker_0': 'The resolution is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Okay, folks, we are at other business colleagues. I do have one matter of other business that came up after council briefing that I just want to read for the record.'"
    ]
}