{
    "Resolution on Local Broadcast News for Emergency Information.": [
        "'speaker_3': 'The Report of the Gender Equality, Safe Communities and New Americans Committee. Agenda Item number eight Resolution 316723. Affirming Seattle City Council's commitment to high quality, locally produced broadcast news to effectively inform the public in the case of emergencies.'",
        "'speaker_3': 'The committee recommends the resolution be adopted as amended, with councilmembers Gonzalez and Burgess and Swanson in favor of Councilmember Bagshaw abstained.'",
        "'speaker_1': 'So I have Councilmember Gonzales as the chair, but I'll let Councilman Gonzales or Councilmember Swan decide how they like to proceed on this.'",
        "'speaker_3': 'I think since we have some amendments, there's a couple of different ways that we can proceed on this. We can first consider the first, have Councilmember Sawant give a description of the resolution that she co-sponsored, along with Councilmember Herbold, and that we discussed in my committee hearing last week.'",
        "'speaker_3': 'And then perhaps it would be best at that point to consider the amendments if a council president. You're amenable to that. That's the I would suggest proceeding.'",
        "'speaker_1': 'That makes absolutely good sense to me. Councilmember Swan, she'd like to describe this resolution.'",
        "'speaker_0': 'Thank you, Fresno. I'd like to thank all the activists from ISC and IBEW 46 who were instrumental in bringing us this resolution. They represent workers in television news in general and at King five in particular, where they are involved in contract negotiations at the present time.'",
        "'speaker_0': 'And thank you, member Gonzalez, for coordinating this through your committee this year as IFC and IBEW negotiate a contract that defends their members, all the workers in the field, they're also being forced to defend the public in general and our rights to locally produced news with social values such as essential emergency notifications.'",
        "'speaker_0': 'That is because the whole television news industry is changing, and many of these changes are natural, inevitable and even desired. Because as technology changes, I think we need our infrastructure to evolve. Part of the change is the change in the function of airwaves from broadcast television to wi fi.'",
        "'speaker_0': 'And these are positive reflections of technological advancements. But some of the changes are motivated purely by a drive for greater profit by private corporations rather than for any public good. And that technological changes are being used as an excuse or a cover to bring in undesirable changes.'",
        "'speaker_0': 'Let's be clear that privatization and consolidating the media by corporate conglomerates has nothing to do with technological innovation. Unfortunately, what's happening is that more and more media companies are being conglomerated into a few mega-corporations. Here in Seattle, King five has been bought by a conglomerate called Tegna Inc. to maximize their profits going five.'",
        "'speaker_0': 'Tegna is attempting to shift away from professional, locally produced quality news and replacing it with rebroadcasting nationally produced news bits. This is bad for quality unionized jobs at King five, but it is also bad for the quality of the news coverage for the people in Seattle.'",
        "'speaker_0': 'In particular, we should be concerned about their future reliability and ability to report necessary information during disasters or other emergencies. If this trend continues, especially in the context of the FCC public airwaves auction this summer. To be clear, this is a resolution, and through this resolution, the City Council does not have a legal mandate on Tegna Inc.'",
        "'speaker_0': 'or any other body to act in public interest. But it will register the formal opinion of the Seattle City Council in support of the workers in broadcast media and in support of the public interest in the media, and in a way that the activists from IOC and IBEW can immediately use in their contract negotiations and in their'",
        "'speaker_0': 'ongoing struggle. And for this reason, I think it is very important, please, to support this resolution. This resolution passed through committee. And I thank all the organizers, again, who are standing up to powerful media conglomerates for the public good.'",
        "'speaker_1': 'Thank you, Councilmember Swan. Before we get into the any possible amendments, are there any other comments from the as far as the base legislation is concerned? And Councilman Baxter, I believe you would like to propose an amendment.'",
        "'speaker_0': 'Thank you very much. I would move to amend Resolution 31673 by substituting version three for version two.'",
        "'speaker_1': 'Is there a second on the amendment?'",
        "'speaker_0': 'Second.'",
        "'speaker_1': 'There is a second. Okay, so why don't you discuss why you would like to do this and what it sort of adds or detracts.'",
        "'speaker_0': 'All right. Thank you very much. First, I do want to acknowledge the hard work from IBEW 46 and also the I had C 600. And there's absolutely no doubt in my mind that the direction that we're going with this resolution is the appropriate one.'",
        "'speaker_0': 'But my concern was in being accurate in our language and using the act, the accurate language in the resolution about channel sharing. I am not debating at all by my amendment whether or not amateurs should be providing our network news.'",
        "'speaker_0': 'Absolutely not. And also, I will be the first to confess that I'm an amateur when it comes to it language. So I asked for some help from one of the experts that I really appreciate. So what I was what my amendments do is clean up language that I want to make sure that the were accurate when we're'",
        "'speaker_0': 'talking about channel sharing. We recognize that the advances in technology in the amount of spectrum that's required to broadcast a television signal has decreased because of the changes. We also recognize that there is space that was formerly reserved for one television channel.'",
        "'speaker_0': 'It can now fit multiple channels. So I don't want to debate whether or not the FCC encouraging TV is the appropriate thing to do or whether we've got corporations that are greedy. What we do know is that channel sharing approach will free up spectrum for wireless spectrum that could be used for other purposes.'",
        "'speaker_0': 'That is my goal and my intention here in the language is simply to be accurate upon the language that is being proposed. Because I do want to make sure that just as we are providing for professional clarity, using professionals when we broadcast that we too are expressing ourselves clearly and accurately in our resolutions.'",
        "'speaker_1': 'Thank you very much. Any responses or concerns? What would you like to respond to, Councilman? Bank shots, amendment or would anyone else like to speak to it?'",
        "'speaker_0': 'I would like to speak to her, but I wanted to see if other council members want to go before me.'",
        "'speaker_1': 'Well, I'll I'll give a I'll give a shot at it here. Number one is I do appreciate the fact that this was provided by the customers want I think weeks in advance and that she was very transparent in going about it and talked to labor.'",
        "'speaker_1': 'And one reason why I'm supporting the base legislation is because for me it's all about jobs, it's about local jobs, it's all about the integrity of the reporting process. And so I think that I'm very happy that customers want brought forth the resolution, that the new language is somewhat technical, and I appreciate that.'",
        "'speaker_1': 'Councilmember Bagshaw went through the great pains of talking, I believe, to our share loss of technology and other technology folks to sort of describe what's happening in the FCC world and what's happening with the spectrum. And I just I'm not comfortable supporting it.'",
        "'speaker_1': 'So I will be voting against the amendment and sticking with the base legislation unless the chair, in her opinion, feels as though it is neatly aligned with the point of the resolution. But absent that sort of strong endorsement, at least from my standpoint, I'll be I won't be supporting the amendments.'",
        "'speaker_1': 'But again, I'm all ears from all of my colleagues.'",
        "'speaker_3': 'If I may, and Councilmember Gonzales.'",
        "'speaker_1': 'And I'll let you speak. Sure.'",
        "'speaker_3': 'I'm I'm I'm also not going to support the amendments. I think that while I understand Councilmember Bag Shaw's perspective, as I think I see them reflected within the additional whereas clauses, I do think that the language that is removed from the resolution ends up in a resolution that I think doesn't hit at the heart of what the'",
        "'speaker_3': 'resolution is intended to address from the advocates perspective, and I think from the sponsors perspective, which is to really put a focus on not just how we do this technologically in terms of what spectrum and what's broadband and all of those other fancy words that I'm going to stop throwing around because I probably am using them incorrectly'",
        "'speaker_3': ', but really focuses on the value of making sure that whatever those channels are or whatever those channels may be that they are, that there is a priority placed on making sure that they are not privately owned and that they maintain integrity of the publicly owned broadcast waves.'",
        "'speaker_3': 'And so I want to make sure that the resolution stays true to what I think that purpose and that intent is, and for that reason will not be supporting the amendments.'",
        "'speaker_0': 'So I have a quick question here and maybe this just to our clerks. I can count votes. Perhaps it would be just better if I withdraw this amendment and we vote on the bass.'",
        "'speaker_1': 'Okay. Well, that could save some debate time. And before I relinquish Florida councilman, she wants to if she has any closing remarks, I want to thank all of the folks that came out or even from Portland for your great testimony and your support.'",
        "'speaker_1': 'It really means a lot, at least to me. And I'm sure my colleagues, we listen to community members and leaders in these areas and so thank you for being here. Councilmember Swan, you'd like to say any closing words before we take a vote?'",
        "'speaker_0': 'Just that it's really a positive thing when elected bodies hold themselves accountable to working people and not to telecommunications corporations or big business of any kind. So I think this resolution will be a good step forward and help workers specifically in their contract negotiations.'",
        "'speaker_1': 'Thank you for that. Any other further comments from my colleagues? Okay. To be clear, the amendment has been withdrawn by Councilmember Bagshaw and she said she can count votes. Okay, let's proceed. Those in favor of adopting the resolution vote i.'",
        "'speaker_1': 'I. Those oppose vote no. The motion carries and the resolution is stopped and the chair will sign it. Very good. Agenda item number nine, please. Please read it into the record.'"
    ],
    "Resolution on Seattle Police Department Overtime Usage and Audit Recommendations.": [
        "'speaker_3': 'Agenda Item nine Resolution 316 75 related to the Seattle Police Department over time usage and progress reports to the Gender Equity, Safe Communities and New Americans Committee on Implementation of City Auditor Recommendations from the April 2016 Overtime Audit.'",
        "'speaker_3': 'The committee recommends the resolution be adopted.'",
        "'speaker_1': 'Councilmember Gonzalez.'",
        "'speaker_3': 'Thank you. Council President Harrell This is a resolution related to the Seattle Police Department overtime usage and progress reports that will be required from the Department to the Gender Equity Safe Communities and Americans Committee on implementation of a set of 30 recommendations from the City Auditor from the April 2016 overtime audit.'",
        "'speaker_3': 'In essence, as I mentioned this morning, the chief of police, when she first arrived, I think about three or four months after she arrived as our chief of police made we made a request to our city city auditor's office to have the overtime usage and processes and tools at the Seattle Police Department be subject to an audit'",
        "'speaker_3': 'by the city auditor. As the result of that particular request, there were 30 recommendations that were issued by the city auditor related to some failings in control systems at the Seattle Police Department. And all of those 30 recommendations were accepted by the police department.'",
        "'speaker_3': 'And this resolution is intended to, in a in a different way, impose upon the Seattle Police Department clear milestones and deadlines and expectations around deliverables in terms of how it is they are complying with the auditor's recommendations. This this resolution, in my mind, is critically important to ensure that we continue to have a police department that is'",
        "'speaker_3': 'accountable, not just in police misconduct, police accountability, police discipline issues, but also on the operations side. And I think that Councilmember Burgess made a very fine point in committee last week when we heard from the department that they would like to engage in a conversation around whether the overtime budget allocated to the department is accurate.'",
        "'speaker_3': 'In response to that, Councilmember Burgess indicated that. Why don't we try to figure out how to get this house in order before we throw more money at the house? And so I think that that's an important point. My hope is that this overtime resolution will steer us in that direction so that we are making sure that the'",
        "'speaker_3': 'money that the Seattle Police Department does have for purposes of overtime is being utilized efficiently and effectively and transparently. Before we dove into these two, which is is the overtime budget set at the appropriate levels, yes or no?'",
        "'speaker_1': 'Thank you, Councilman Gonzales. Any further comments from any of my colleagues for questions? CNN. Those in favor of adopting the resolution vote i. I. Those opposed vote no. The motion carries, the resolution stopped and then Charles signed it.'",
        "'speaker_1': 'Please read the next agenda item into the record, please.'",
        "'speaker_3': 'Agenda item ten Resolution 316 76 relating to responsible police gun procurement. The committee recommends the resolution be adopted as amended concerning Gonzales. I will defer to Councilmember Bagshaw, who is the prime sponsor of this resolution.'"
    ],
    "Transportation Funding Ordinance and Seattle Transportation Benefit District Assumption.": [
        "'speaker_3': 'The report of the Sustainability and Transportation Committee Agenda Item 11 Council Bill 118667 related to transportation funding, assuming the rights, powers, immunities, functions and obligations of the Seattle Transportation Benefit District by the City of Seattle, amending sections 3.1 20.0 20 of the Shadow Code and repealing section 3.1 20.2 or 30.0 40.0 58.0 60.'",
        "'speaker_3': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you. I believe Councilmember Johnson is pinch hitting for Councilmember O'Brien.'",
        "'speaker_5': 'Thank you. Council President Harrell. So for my colleagues who don't serve on the transportation committee, when the state legislature authorized the creation of transportation benefit districts, they did not at that point allow for local jurisdictions like ours to take on the roles and responsibilities and required us to wear a different hat, as it were, a couple of'",
        "'speaker_5': 'years later, i.e. a couple of years ago, the state legislature changed our law to allow for local jurisdictions like the city of Seattle, to wear both those hats concurrently and did not require the separation between the benefit district and the city.'",
        "'speaker_5': 'So this legislation would consolidate the Seattle Transportation Benefit District into the city of Seattle, which has some real benefits for us. Simplifies administration and governance. Eliminates the need for a separate board as well as a separate budget in separate legislation.'",
        "'speaker_5': 'This could save us money should we go back to the ballot by not requiring us to pay for different administrative costs out of different places? If the legislation is approved today, the city would continue to account and budget for the transportation benefit district revenues as special revenue.'",
        "'speaker_5': 'It doesn't change the amount that we collect or we spend. It doesn't change it. And the commitments or obligations of the benefit district just effectively makes it a little bit easier for us to meet and govern as a body.'",
        "'speaker_5': 'So with that, I'm happy to answer any questions and when asked for my colleagues approval.'",
        "'speaker_1': 'Thank you, Councilmember Johnson. Any questions or concerns for my colleagues? Sheng Nan, please call the role on the passage of the bill.'",
        "'speaker_2': 'GONZALEZ Hi, Johnson. Suarez I saw the picture. Burgess By President Harrell. I. Seven in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passes and the chair will sign it. Adoption of other resolutions. Please read the report.'",
        "'speaker_3': 'For introduction and adoption. Agenda Item 12 Resolution 316 79 Providing an honorary designation of East Lake Avenue from court to place two Denny Way as Bill Hobson Way.'",
        "'speaker_1': 'Council Member Burgess.'",
        "'speaker_4': 'Thank you. Bill Hobson's memorial service is this Thursday at 330 here in City Hall downstairs in the birth of Nightline. This room, I think many of us knew Bill well and worked with him over the years. He became the executive director of the Downtown Emergency Services Center in 1988.'",
        "'speaker_4': 'He actually started working there in 1984. Bill was a real agent of change in our community. He was incredibly compassionate, a man of integrity who worked really hard for the homeless and those living with poverty in our city.'",
        "'speaker_4': 'What this resolution does is it makes an honorary designation of East Lake Avenue right in front of East 1811, East Lake, which is the award winning Housing First project that's located there. It provides home for up to 75 homeless individuals who have chronic alcohol addiction.'",
        "'speaker_4': 'I should mention that 1811 East Lake has been studied twice now by researchers from the University of Washington and has proven itself not only in a beneficial way to the residents of 1811 East Lake, but also for the city, the county in the state in saving significant amounts of money, because these individuals, not all of them, but'",
        "'speaker_4': 'many of them were very high frequent users of other services. The emergency room up at Harborview King County Jail and other services that we have been able to forego because their lives were stabilized and they didn't need to use those services.'",
        "'speaker_4': 'So it's a it's a great project. And this resolution allows the city to designate East Lake Avenue as Bill Hobson Way. And I really do hope we pass it because the signs have already been prepared and they will be presented on Thursday afternoon to the Hobson family and then installed soon on East Lake Avenue.'",
        "'speaker_1': 'Thank you, Councilman Burgess. Any further comments or questions? I will move to adopt Resolution three one. Six.'",
        "'speaker_4': 'Seven, 9/2.'",
        "'speaker_1': 'Been moved in second that this resolution be adopted. Any further comments? Once again those in favor of adopting the resolution vote i. I those oppose vote no. The motion carries and resolutions adopt and chair will sign it. Is there any further business to come for the council today hearing that we will stand adjourned and we will reconvene'",
        "'speaker_1': 'very shortly as Parks Board commissioners and I don't have a time for that, but 5 minutes. She hasn't been elected yet. What are we looking at? I think we're.'"
    ]
}