{
    "Hazard Pay Ordinance Amendment and Repeal Date.": [
        "'speaker_1': 'The Report of the City Council Agenda Item one Council Bill 120372 An Ordinance relating to employment in Seattle amending sections of the Municipal Code to establish a new date for ending hazard pay requirements and automatically repealing the ordinance.'",
        "'speaker_0': 'Thank you. And today I'm going to move to postpone Council Bill 1 to 0 372 to August 2nd, 2022. Is there a second think thinking has been moved and seconded? Are there any comments? See more comments on the clip.'",
        "'speaker_0': 'Please call the role on the motion to propose postpone council bill 1 to 0 three seven to.'",
        "'speaker_1': 'Council Member Nelson I. Council Member Petersen.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Council Member Silent.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Council Member Herbold. Yes. Council Member Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council President Pro Tem Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Six in favor and unopposed.'",
        "'speaker_0': 'Thank you. The motion carries in council 120372 is postponed to August 2nd, 2022. City Council Meeting Item number two Please read the short title. Read the item to into to the record.'"
    ],
    "New Chapter and Amendment to the Seattle Criminal Code.": [
        "'speaker_1': 'Agenda Item to Council Bill 120375 An ordinance relating to the Seattle Criminal Code adding a new chapter 12 .8.32 to the Seattle Missile Code and amending Section 12 .8.20.06 out of the Seattle Municipal Code.'",
        "'speaker_0': 'Thank you. A move to pass Council Bill 120375 to bring this item before us. Is there a second? Thank you. It has been moved and seconded to pass the bill. Councilmembers want as the sponsor of this bill. Would you like to share opening and closing remarks with others joining in between?'",
        "'speaker_2': 'Yes. Thank you, Jordan Strauss. This is legislation from my office to make Seattle a sanctuary for women and pregnant people and their doctors and other care providers facing persecution for seeking and performing abortions. Laws violating basic bodily autonomy and criminalizing reproductive health care are fundamentally unjust, and we should not allow Seattle to be complicit.'",
        "'speaker_2': 'This bill prohibits Seattle police from arresting people, either patients or providers, based on outstanding warrants or otherwise aiding investigations related to and abortion laws around the country. Let anyone burdened by draconian anti-abortion laws come to Seattle without fear of prosecution.'",
        "'speaker_2': 'This will unfortunately not make unjust arrest warrants go away. That would require building of powerful women's rights and LGBTQ rights movement to win back the right to bodily autonomy nationwide. But the legislation will mean that people with unjust arrest warrants can live in Seattle without being extradited to whatever state is attempting to prosecute them.'",
        "'speaker_2': 'This is decisive because the police of other states and cities do not have the power to arrest outside their jurisdiction. And if Seattle police, the county sheriff and Washington state patrol refused to do those arrests based on anti-abortion laws, there is no law enforcement agency left to arrest.'",
        "'speaker_2': 'If this legislation passes in Seattle alone, it will have a vital impact on protecting many women in a particular people. However, if bringing it here can help it spread to other cities and states, the impact could be truly profound.'",
        "'speaker_2': 'If half the states in the nation refuse to extradite people under investigation for breaking abortion laws in the other half of the states, those laws will become extremely difficult to enforce. Like all this is already being conducted by elected representatives in several cities and counties interested in similar legislation.'",
        "'speaker_2': 'Thank you to Chicago Alderman Biden, Sergio Lopez and Minneapolis City Council member Robin Wamsley, both members like me of the Democratic Socialists of America who planned to push for similar legislation in their respective cities. Thank you. Especially to Heidi.'",
        "'speaker_2': 'Wayne White, Light, district supervisor in Dane County, Wisconsin, who met with me and other activists yesterday and who wrote to the Seattle City Council in strong support of our legislation. As Supervisor Greg Lightner said, quote, The immediate impact is severe and sickening in my state where we had an abortion ban on the books from 1849.'",
        "'speaker_2': 'The abortion ban makes it a felony crime to provide an abortion unless it is necessary to save the life of the mother. There are no exceptions for rape, incest or other health issues of the parent. After all, for 50 years, the 173 year old law was not enforced after the dogs decision was announced.'",
        "'speaker_2': 'Abortion providers stop scheduling appointments in Wisconsin. Now pregnant persons in the stands need to find a way to get an abortion provider in a state where they can still access an abortion. Like Illinois or Minnesota, they have to line up the forms, not just for the procedure or pills, but arrange transportation and lodging.'",
        "'speaker_2': 'And they have to wait likely much longer to get the care they need. They have to worry that our state legislature will enact even more draconian restrictions on their right to pursue the health care they need in other places.'",
        "'speaker_2': 'I plan to pursue legislation to prohibit county resources from being used to report, investigate or prosecute any person for violating the 1849 abortion ban. I write to let you know that your commitment to protecting those providing and seeking abortion care is incredibly important to me.'",
        "'speaker_2': 'It's important to me as a woman who has been pregnant four times but only birthed one child. It's important to me as a fellow local elected official, working with other legislators, activists, public health officials and health care providers to figure out how to do everything in our power to push back against the horrifying 1849 abortion ban in'",
        "'speaker_2': 'a country which no longer recognizes the constitutional right to access an abortion. Please vote yes on this bill and reject any attempts to watering down like some of what is found in Amendment B. As policymakers, we have a responsibility to use our power to protect human rights when we choose to change the words in our policy to'",
        "'speaker_2': ', quote unquote, request something to do, quote unquote requiring it. We are failing the people who elected us. Anyone can request something of a government body. Legislative bodies like your council can require it. Watering down this bill would render it virtually meaningless.'",
        "'speaker_2': 'Pregnant people and people with uteruses in my state and in yours need more than grandstanding. They need real legislation which will protect them. End quote. Thank you, supervisor regulator. I do want to also clarify that this legislation is very different than current state laws such as House Bill 1851 and legal opinions which protect people who perform or'",
        "'speaker_2': 'have an abortion in Seattle, including if a pregnant person lives in another state and comes to Seattle to have an abortion. Because their. State ban stuff. Those laws are good to have, but they do not protect people who perform or have an abortion in a state where they have been banned in, which requires breaking those unjust laws'",
        "'speaker_2': 'and consequently they need refuge. This is what this legislation will address. If people break the unjust, unfair abortion laws in their own state and believe they will be caught. They can come to Seattle and be protected from prosecution.'",
        "'speaker_2': 'After I announced this legislation at a press conference, Governor Inslee issued an executive order in May. Harold Brett pledged at a press conference to temporarily instruct state and city police not to aid in those out-of-state abortion related investigations.'",
        "'speaker_2': 'However, those executive orders are significantly weaker than those legislation because they make no mention of out-of-state arrest warrants. They're also no substitute for actually codifying these protections in the law, which our legislation will do. The overturning of ROE shows the importance of codifying human rights into law.'",
        "'speaker_2': 'I want to thank Jasmine Morrow from City Council Center staff for all the help she provided in drafting this bill. And thank you to central staff member and Gorman for continuing the work on the bill. Thank you to the over 5500 people who signed the public petition from my office in support of this legislation.'",
        "'speaker_2': 'Special thanks. Go to the rank and file union members who have supported this and local unions have endorsed the legislation. UAW 4121 who represent thousands of registered workers. The Resident and Fellow Physicians Union Northwest who represent physicians and residents of the University of Washington Hospital, American Federation of Government Employees, Local 3197 representing the healthcare workers of the'",
        "'speaker_2': 'Seattle Veterans Administration. Thank you to real change through this town navigator Diamond Action Group up and the Puget Sound Mobilization for Reproductive Justice who have publicly supported this legislation and Socialist Alternative my organization whose members have been doubling almost daily every week across the city and gathering thousands of petition signatures.'",
        "'speaker_2': 'Finally, my office has prepared an amendment amendment to this bill, which I will move after concluding these introductory remarks and with the permission of the Council President Pro Tem. The amendment makes some small technical edits and removes a line in order to make the bill better reflect its original intent.'",
        "'speaker_2': 'The line deleted had said code provided by a licensed healthcare provider operating within the scope of their practice, unquote, when describing the abortion related arrest warrants and investigations that Seattle police would not be. The reality is, states that have provided or passed draconian abortion laws also make it impossible to be licensed to provide reproductive health care.'",
        "'speaker_2': 'And as a result, people find other illegal ways they are forced to find other legal ways to do the same thing. Thousands will find their own solution to unwanted pregnancies because they will be forced to do so. We will order the abortion bill online or get it from a friend by limiting the protections in this bill to'",
        "'speaker_2': 'licensed healthcare providers operating within the scope of their practice. It would have inadvertently undercut the impact of the bill. So this amendment corrects that. As I said in the council briefing yesterday, this amendment aligns the bill's language to its original intent and is consistent with how I have been publicly describing the bill.'",
        "'speaker_2': 'I fully agree with the dozens of working people who spoke today during public comment, including the opposition to any amendments that would weaken the legislation. I want to make it clear to all working people that this amendment I'm moving also is not an amendment that will weaken the legislation but actually make sure that the intent of the'",
        "'speaker_2': 'legislation is fulfilled. So I urge Council members to support this legislation, including Amendment eight and Council.'",
        "'speaker_0': 'Would you like to move your amendment?'",
        "'speaker_2': 'Yes, thank you. Council President Jordan Strauss I move amendment a to council bill 120375.'",
        "'speaker_0': 'Second, it has been moot. It has been moved in seconding to amend Council Bill 120375. Councilmember Swan, I know you've addressed the amendment already. Any further remarks on the amendment?'",
        "'speaker_2': 'Nothing for me unless any questions.'",
        "'speaker_0': 'Fantastic colleagues. Any questions? Seeing no questions. I had just been moved when the clip was called around the amendment.'",
        "'speaker_1': 'Councilmember Nelson. I. Councilmember Peterson I council members want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis. Yes. Council President Pro Tem Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Six in favor and unopposed.'",
        "'speaker_0': 'Thank you. The Motion Kings and the amendment is adopted. Councilman or so on. Any clue? I know you spoke very well to the bill in the amendment. Anything else? I guess let me call and colleagues, any comments on the bill?'",
        "'speaker_0': 'Colleagues. Councilmember Herman.'",
        "'speaker_1': 'Thank you so much. Just a couple very quick words. I'm very pleased to vote in support of this legislation, which provides important safeguards to ensure that people seeking abortion here are protected from an attempt to stop or prosecute them.'",
        "'speaker_1': 'I do want to say for the record that I publicly stated my support for this legislation at last week's full council meeting, and I'm frustrated that an email was sent out from the sponsors office incorrectly claiming that no council member had done so.'",
        "'speaker_1': 'I've since received a significant amount of advocacy. I welcome the advocacy but urged me to take a vote that I had already committed to taking more broadly on the substance of the bill and the substance of the issue.'",
        "'speaker_1': 'Ensuring safety and full access to reproductive health care is an urgent and very, very important priority for me. I've created sort of a track record on on some of these issues by first adding language to the original resolution that the Council passed, sponsored by by council members to want.'",
        "'speaker_1': 'But focusing on the immediate investment that the Northwest Abortion Access Fund was was needing to receive, which the Mayor has called that that has answered that call. And the council is now poised to approve $250,000 for this purpose this year, consistent with that amendment.'",
        "'speaker_1': 'I've met regularly with advocates and providers on the front lines of abortion, access to understanding their ongoing needs and emerging priorities. I had a briefing this morning from Public Health on how they're working to protect abortion access and what more we can do here at the city council.'",
        "'speaker_1': 'Had that rethink in my public committee this morning. I'm also co-sponsoring two bills with Councilmember Morales to protect pregnant people who are seeking abortion here, which the council will consider on August 9th. I think these are important, significant pieces of legislation.'",
        "'speaker_1': 'I don't think it's appropriate to minimize their importance. One bill is to create a protected status of of people seeking abortion. The other relates specifically to the actions that others may take towards people seeking comprehensive reproductive services. And I'm really looking forward to bringing those bills before the full council.'",
        "'speaker_1': 'They have already passed the committee where they were heard. And then I'm really looking forward to working to find ways to expand abortion access and protect what can only be called medical refugees, people who are coming here and cannot receive basic health care in their home states so that we can make sure that people understand the the'",
        "'speaker_1': 'the places here in Washington State where they can receive those those services, because it's very confusing right now with some of the deceptive practices that some clinics are engaged in and the fact that we have hospital mergers with with hospitals that simply don't provide those services services.'",
        "'speaker_1': 'Again, more important work that is yet to be done in closing. Again, I support this bill and I thank members to want to bring it forward.'",
        "'speaker_0': 'No, thank you. Other colleagues. Any questions? Comments. Seeing none. Councilmember Swanton, final words passed quickly.'",
        "'speaker_2': 'Yeah, I appreciate councilmember horrible support for this bill and I hope all councilmembers will vote yes on it. And this fall, the people's budget movement will also be bringing forward a budget amendment to fund free abortions in Seattle, both for residents and those escaping rightwing and abortion laws in their own states.'",
        "'speaker_2': 'That would be another way that Seattle and hopefully other states as cities in Washington state and other states as well, can work to make these deeply unjust and rising laws difficult to enforce.'",
        "'speaker_0': 'Thank you. Great. Thank you. Will the court please call the roll and the passage of the bill as amended?'",
        "'speaker_1': 'Council Member Nelson I.'",
        "'speaker_0': 'She said, I.'",
        "'speaker_1': 'I said, I.'",
        "'speaker_4': 'Don't.'",
        "'speaker_1': 'Think you.'",
        "'speaker_2': 'Councilmember Peterson?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember silence.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis.'",
        "'speaker_0': 'Yes. I said yes.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Council President Pro Tem Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Sits in favor and unopposed. That's a press release now.'",
        "'speaker_0': 'Huh? The bill passes as amended, the chair will sign it with a clear. Please fix my signature to the legislation on my behalf. Next time. Number three will the clerk please read item three into the record? I am very excited about this.'",
        "'speaker_1': 'Agenda Item three Report of the Sustainability and Riches Rights Committee. A point nine excuse me. 02268. The appointment of Justine Justine Bell as Director of the Office of Sustainability and Environment. The Committee recommends the Council confirm the appointment.'"
    ],
    "Authorization of Funding Acceptance from Non-City Sources for Various Departments.": [
        "'speaker_1': 'The Report of the Finance and Housing Committee Agenda Item for Council No. 120365 and the authorizing and 2022 acceptance of funding from non city sources. The committee recommends the City Council pass the Council bill.'",
        "'speaker_0': 'Thank you. Councilmember Ruiz, on behalf of Councilmember Mosquito, you are recognized in order to provide the committee report. Yes. Thank you so much. President Pro Tem strauss i so council member Mesquita indicated that you wanted to hold these bills.'",
        "'speaker_0': 'So I think at this time I'm going to move to hold them. And I could explain after I make the motion and it's seconded or before. Thank you. Councilmember Lewis, I understand that there are two of four bills to be held.'",
        "'speaker_0': 'Did you want to hold all of them or were just two of them just the two budget bills? President pro tem. Yes. So which requires seven it requires seven members to pass without appropriate quorum today. But otherwise, as you indicated, the committee report does include the gift.'",
        "'speaker_0': 'Well, I think that that's one of the ones that we need to hold for the quorum. So maybe we could have interim clerk Adkinson jump in on this. It's my understanding that the gift of public gift.'",
        "'speaker_1': 'And unless I heard something from earlier that I am for does not need the three quarter vote and could be moved forward today. It's agenda item five that takes the seven council votes.'",
        "'speaker_0': 'And the supplemental budget bill, the supplemental and the and the CHP, those are the two that require seven votes. The other.'",
        "'speaker_1': 'I was only aware of item five.'",
        "'speaker_0': 'Okay. Just when we lose hope, we can hold everything if you want. No, no, no. I think that we can go ahead and proceed with Council Bill 120365. Council bill per the clear representations if we can go forward with countable 120366.'",
        "'speaker_0': 'And. So we are currently on three, six, five. It has been read into the records at this time and acceptance of funding from non city sources.'",
        "'speaker_1': 'Yes and pass or a motion to postpone. Sebelius is.'",
        "'speaker_0': 'Concerned. Nelson.'",
        "'speaker_1': 'Do you know if council bill 120365 could be voted on today? Is that what are the words?'",
        "'speaker_0': 'Yes. Could be voted on today. Was that the question?'",
        "'speaker_1': 'Is that what are the words it needs to be? I just remember in committee we handled those three, six, five and three, six, six together. So as I understand it, they don't have to be voted together as long as agenda item four is passed before agenda item five.'",
        "'speaker_1': 'So if we were to pass agenda item four today and agenda item five on next city council meeting next week, we should be fine.'",
        "'speaker_0': 'That's my understanding as well. Yeah. Thanks for that clarification. And no need for words when we've got Deputy Clerk Schwinn at the helm. Yes. So with that, Mr. President pro tem, I would move that we pass council bill 120365.'",
        "'speaker_0': 'Thank you. Second set has been moved and seconded customer reviews. Would you like to provide the committee report? Yes. Thank you, Mr. President. Pro tem. So we had a discussion on this legislation in committee last week. It ultimately passed with four council members voting in favor and recommending full passage.'",
        "'speaker_0': 'This legislation allows these departments to accept grants of funds from non city sources and the committee recommends that we pass legislation. Wonderful colleagues. Any questions? Comments. Concerns. Seeing none of the cultural.'",
        "'speaker_1': 'Councilmember Nelson, I. Councilmember Peterson.'",
        "'speaker_4': 'All right.'",
        "'speaker_2': 'Councilmember Sawant. Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis. Yes. Council President Pro-Tem Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Six in favor, nine opposed.'",
        "'speaker_0': 'Thank you. The bill passes with the clerk. And the terrible sign over the cliff. Please fix my signature to the legislation on my behalf. I remember fiber click please read the short title written five into the record.'"
    ],
    "Ordinance to Amend the 2022 Budget and CIP and Modify Positions.": [
        "'speaker_1': 'Agenda Item five Council Bill 120366 An ordinance amending ordinance 126490 which adopted the 2022 budget, including the 2022 to 2027 Capital Improvement Program. The committee recommends the bill pass as amended.'",
        "'speaker_0': 'Thank you. Also known as the supplemental budget, this is both the budget and the capital improvement program, which both Councilmember Lewis and I just referenced. Councilmember Lewis also noted for budget bills we require seven votes in the affirmative.'",
        "'speaker_0': 'We currently have six council members present and so we will hold the bill for next week. So I move to postpone Council Bill 1 to 0 366 to August 2nd, 2022. Is there a second second? It has been moved and seconded.'",
        "'speaker_0': 'Are there any comments seen or comments with a quick please called on the motion to propose postpone cancel 120366 by one week.'",
        "'speaker_1': 'Councilmember Nelson, I. Councilmember Peterson.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'Councilmember Sawant.'",
        "'speaker_2': 'Yes. Councilmember Herbold.'",
        "'speaker_1': 'S. Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Council president pro-tem Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Six in favor nine.'",
        "'speaker_0': 'Opposed the motion carries comfortable 120366 is postponed to August 2nd 2022 City Council Meeting I remember six with the court read item six into the record.'"
    ],
    "Gift Acceptance of a Harvard Government Performance Lab Fellow.": [
        "'speaker_1': 'Agenda Item six Council Bill 120367 An ordinance accepting the gift of a hybrid government performance lab zero and not a fine confirming certain facts. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. And this is another bill coming out of finance and housing. Unfortunately, I don't sit on it anymore. I'd love to be. There comes Bruce. On behalf of Councilmember Musketeer, you are recognized to provide the committee report.'",
        "'speaker_0': 'Yes. Thank you, Mr. President. Pro tem. We had a good presentation on this item in the committee. It's an exciting opportunity to be accepting a fellow from the Harvard Government Performance Lab. At the conclusion of the presentation, the Council unanimously recommended passage of this ordinance here at full council.'",
        "'speaker_0': 'And given that there's no was no controversy raised in that discussion. I move that we pass the ordinance great. In particular, we need to formally move. And second, this bill.'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'Great is before us. Colleagues, any questions, comments, concerns. Checking the dials, checking the zoo, seeing none. Well, the police got the wrong.'",
        "'speaker_1': 'Councilmember Nelson, I. Councilmember Peterson.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Swan.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold? Yes. Council member Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Council President Pro-Tem Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Six in favor and unopposed.'",
        "'speaker_0': 'Thank you. Bill passes. Jill signing with the clerk. Please fix my signature to the legislation on my behalf. I remember seven or the clerk. Please read the short title of item seven to the record.'"
    ],
    "Surplus Property Sale and Transfer for Affordable Housing.": [
        "'speaker_1': 'Agenda Item seven Council Bill 120371. An ordinance relating to the Department of Finance and Administrative Services declaring a portion of Lot 31 BLOCK two Grammar Heights edition Item 13 of Pratt's Page 66. That is not needed for street purposes.'",
        "'speaker_1': 'A surplus to the city needs. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Russo. Again, on behalf of councilmember skater, you're recognized to provide the committee report. Thank you so much, Mr. Chair. This is a great opportunity that's being pursued by the Department of Finance Administrative Services. One of the fairly routine departmental matters that have to come to the council was the city's board of directors for final'",
        "'speaker_0': 'approval involves the swapping around of a couple of properties for the use of the department. This was scrutinized in a presentation before the committee last week and resulted in a unanimous decision from the committee to recommend full passage to the Council.'",
        "'speaker_0': 'And I do so move that we pass Council Bill 120371. I think it comes from colleagues questions, comments, concerns. CNN was the piece called The Wrong Passage of the Bill.'",
        "'speaker_1': 'Councilmember Nelson, I. Councilmember Peterson. Hi. Councilmember Swan?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council President Pro-Tem Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Six in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes the General Senate with a plan to fix my signature to the legislation on my behalf. I items removed from the consent calendar. There were no items removed from the consent calendar today. Item J Adoption of other resolutions.'",
        "'speaker_0': 'There are no resolutions for introduction and adoption today under item K at a business colleagues. Is there any other business to come before the council? I'm seeing none. I will. I believe that I made this request previously. I'll make it again today.'"
    ]
}