{
    "Hing Hay Park Property Agreements and Public Restroom Project.": [
        "'speaker_2': 'Thank you, Mr. Smith. Congratulations. Okay. Please read the next agenda item.'",
        "'speaker_4': 'That the report the city council agenda item to cancel 119 361 relating to hing hei park and property agreements with the SEAL Chinatown, International District Preservation and Development Authority and the city of Seattle.'",
        "'speaker_2': 'Thank you, councilmember suarez.'",
        "'speaker_0': 'Thank you. Council President. This ordinance authorizes the Superintendent of Parks Recreation to execute a settlement agreement and associated documents extinguishing an easement on city owned real property and modifying a covenant encumbering Seattle Chinatown National District Preservation Development Authority owned real property, otherwise known as Skipjack.'",
        "'speaker_0': 'The Bill The bill amends ordinance 124927, which was.'",
        "'speaker_9': 'Adopted in the.'",
        "'speaker_0': '2016 budget. The bill also lifts a proviso, and the bill authorizes the use of certain city funds to design and construct a public restroom within the Bush Hotel building to serve users of HING, a park and other members of the public.'",
        "'speaker_0': 'The Committee on Civic Development, Public Assets and Native Communities made a unanimous recommendation on September 14 that the City Council pass the Council bill as amended. Thank you.'",
        "'speaker_2': 'Thank you. Are there any questions about this council bill? Okay. If not, I will move to pass this council. Bill, is there a second? Okay. Please call the rule on the passage of the bill.'",
        "'speaker_0': 'Herbold I Johnson. Suarez Mosqueda O'Brien Sergeant Bagshaw Gonzalez. President Herald Hi nine in favor not oppose the.'",
        "'speaker_2': 'Bill pass and show sign it. Please read the next agenda item.'"
    ],
    "Resolution to Update Policies and Procedures for Reuse and Disposal of City-Owned Property.": [
        "'speaker_4': 'Agenda Item three Resolution 318 37 amending adopting the policies and procedures that govern the re-use and disposal of real property owned by the City of Seattle, not subject to the city department jurisdiction, updating certain portions of the procedures relating to property, reuse and disposal for affordable housing, and adding provisions regarding the use of proceeds from surplus property'",
        "'speaker_4': 'disposal. The committee recommends a resolution be adopted as amended.'",
        "'speaker_7': 'Councilmember Mesquita Thank you very much, Mr. President. Mr. President, this legislation is a call for development done right? It's a call for development done through the community lens for the families and workers who want to and need to live within the city.'",
        "'speaker_7': 'It's in. It's in response to the call for density to help address the environmental impacts of displacement. Earlier today, I was listening to public testimony from the legislative body that oversees housing in Olympia. And Jaime Hahn, president of the Northwest Carpenters, testified saying the following.'",
        "'speaker_7': 'Despite the boom and despite the fact that our membership is overwhelmed with work, we are still not producing, producing enough housing, he said. Just like the police officers who cannot afford to live on the streets that they patrol.'",
        "'speaker_7': 'Just like the teachers who cannot afford to be neighbors to the children they educate, carpenters cannot afford to live in many of the homes we build with our own hands. This legislation is a response to the housing crisis and the injustice that many of us have talked about so far.'",
        "'speaker_7': 'We need housing. We need affordable housing. We need to house the homeless and we need to do it now. This legislation is in response to the call for reversing the exodus, especially of communities of color. As our friends from the tribal community said today.'",
        "'speaker_7': 'People who are the most vulnerable are losing out on the opportunity for housing. We're losing out on the opportunity for density in our neighborhood. We're losing the opportunity for more greenspace and public space for communities to engage and have opportunities for engagement.'",
        "'speaker_7': 'We're losing the opportunity for individuals to be able to live in the city that they work. And we need to make sure that all city property is used for the best use and not just sold at the highest price.'",
        "'speaker_7': 'Many of us know the root causes of the sad reality. The historic roots of redlining and restrictive zoning has often made it harder for working families, especially women and people of color, to have access to affordable housing. When housing is so limited in our city, it's often redlined communities where we see families and community organizations that are'",
        "'speaker_7': 'trying to serve those families who don't have the capacity to purchase new land and don't have the ability to create housing opportunities, especially mixed use opportunities for the density done in our for density in our communities. But when we remove the cost of land, the cost of producing affordable housing can be decreased by 15%.'",
        "'speaker_7': 'So in response to the comments that we've heard today, no, this legislation doesn't correct the injustice of redlining and it doesn't correct the injustice of having land taken. But it does help us begin the first steps necessary to make sure that more community organizations and individuals who are the most vulnerable have actual site control, and that we'",
        "'speaker_7': 'build the housing to respond our communities need. And now is the time where we have to act. Here is where we need to act at the local level. The Federal Department on Housing and Urban Development has just engaged in efforts to dismantle efforts to create affordable and fair housing.'",
        "'speaker_7': 'Here is where we have the opportunity, and I want to thank representative for you another woman of color who we should constantly thank when they are leading the effort, who passed House Bill 2382. She passed this earlier, this legislative session to make sure that we look at opportunities for us to take a step further and make sure'",
        "'speaker_7': 'that community has the opportunity to build the housing that we need on surplus property, that we commit ourselves to engaging and creating affordable housing to meet our fair housing goals, and that we are not only building housing but building community opportunities by making sure that housing is above child care facilities, above health facilities, next to public parks'",
        "'speaker_7': ', and creating opportunities for small businesses to thrive on the first and second floors. And that we do this in a way that is built next to transit centers. And when we see maps of Seattle and where we know that displacement is occurring, especially for these most vulnerable communities, we have an obligation to do more.'",
        "'speaker_7': 'The community organizations who helped pull together this legislation have made it possible for us to now have tools in hand for us to take the next steps in living our values. And that is public land should be used for the best public use.'",
        "'speaker_7': 'And over the years coming up, I hope that we can act with urgency to make sure that these policies are set into place. Mr. President, there's six bullets that I'd like to read that outline what this legislation does, if I might.'",
        "'speaker_2': 'Please do. Councilmember.'",
        "'speaker_7': 'First, it sets a policy that requires the city to prioritize using surplus land for affordable housing in addition to parks and open spaces. Childcare and early learning centers. Educational facilities. Light routes. Light rail stations think little things like grocery stores so we can address food deserts.'",
        "'speaker_7': 'It allows for us to make sure that the land can also be leased, which means that the city maintains public ownership or partial ownership from municipal use. And that means that the property can be developed into affordable housing for mixed use.'",
        "'speaker_7': 'It directs the Office of Housing to partner with community organizations in areas of heightened risk of displacement, allowing for greater community ownership, site control and affordable housing to be developed through their lens. And it sets a benchmark that if a parcel is sold, if after an intense analysis, that the land is not going to be developed by'",
        "'speaker_7': 'the city in partnership with community organizations, that if it is sold, a goal of 80% of that revenue will be generated for parcels to go into affordable housing and into making sure that we meet our goals under the Equitable Development Initiative.'",
        "'speaker_7': 'It adds additional reporting from the Office of Housing regarding implementation to ensure accountability. So we're actually living our values and those organizations are serving the community that they intend to serve and that they're reflective of the community through their boards and leadership.'",
        "'speaker_7': 'It also cuts in time, cuts it in half the time for internal process in the city to review these parcels so we can build housing with urgency of the changes that I'm most excited about. It directs the Office of Housing to work with community organizations and to design affordable housing, especially for those who are at risk of'",
        "'speaker_7': 'displacement. To make sure that we are actually working with the communities that are at highest risk of displacement, instead of just assuming that that will happen with development and development is done right when community organizations are brought to the table, we can create the housing that we need and we can do it in a way that addresses'",
        "'speaker_7': 'the environmental impacts of displacement and as an effort to try to reverse some of the injustices that we talked about before. So I'm excited about this legislation, as you can tell. Mr. President, there's been a number of efforts that we have worked on together over this last year.'",
        "'speaker_7': 'But this is the piece of legislation that I think really helps us live our values in terms of how we can do a better job with publicly owned land and make sure that we get more affordable housing and community assets.'",
        "'speaker_7': 'This wouldn't have been possible without the organizations that you heard of today and a number of additional ones that I'd like to read very briefly, including folks from Puget Sound, Sage Got Green Interim CTA, El Centro 350, Seattle, Sierra Club, Campus Housing, Housing Development Consortium Future Wise of four Terra Enterprise Community Partners Chief.'",
        "'speaker_7': 'South Seattle Club. Seattle Indian Services Commission. Beacon Hill Development Group. Rainier Beach Action Coalition. Filipino Community Center Abundance of Hope Sustainable Seattle Sightline Mount Baker Housing Seattle Tech for Housing Seattle for everyone and so many more. I want to say very briefly before we get to amendments, a huge amount of appreciation to Sally Bagshaw.'",
        "'speaker_7': 'Thank you, Councilmember Bagshaw, to your team Allison, Dan, Brian and Linda for their ongoing work with us to make sure that we got this right. To Tracy Radcliff from central staff who constantly worked with us to make sure this was possible and to the intense work from our team, especially Michael Maddox and all of his research on'",
        "'speaker_7': 'this. I want to thank also as well Aretha Basu and Farida Cuevas, who helped shape this work and working with community organizations. This is a continuation of the work that you all worked on, I think, in 2017 within Councilmember Burgess.'",
        "'speaker_7': 'What we've done today is taking it to the next level in terms of what we mean by highest and best use of the parcels. And I'm really excited with this legislation. We will hopefully be able to see more.'",
        "'speaker_7': 'PLAZA Roberto Maya's does more Filipino community centers, more literal shopping places and more opportunities for, for example, Seattle Club as chief Seattle Club to acquire site control for production of permanently affordable housing to serve communities who've been left out and are at risk of displacement.'",
        "'speaker_7': 'And this is, I think, how we respond to the housing crisis today and also the housing crisis that will be here with us in 20, 30, 40 years if we don't act now. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you. Catch from a skater. Any. My colleagues like to address the resolution. So we'll go with Councilmember Beckstrom.'",
        "'speaker_9': 'Thank you. I want to just say. Councilmember Mesquita, you and your office have been fabulous partners on this. Thank you very much for taking the lead. Michael Maddox, I know you're embarrassed in the background that we call you out, but truly working with you and with the folks in my office who've done that is make a big'",
        "'speaker_9': 'difference. I just want to say I completely concur that this is the right way to go and we simply need a whole lot more housing, a lot faster, which means much more resources in order to do this that people say, well, it costs so much money.'",
        "'speaker_9': 'And I want to remind my legislator friends that last year the housing trust fund offered $100 million, which was a great beginning, but not statewide. We could so easily use $100 million right here to build the kind of units that we need.'",
        "'speaker_9': 'And if we're doing full on brick and mortar, we know that it's about $30 million for 100 units. And if we want to look at some options, like what we've been arguing for around modular is to try some pilots to get some things built and up and on, just ready to go for people.'",
        "'speaker_9': 'I really want to encourage us to look at every possible alternative. And in that regard, I would like to say thanks to my King County colleagues, John Arthur Wilson and Adrian Quinn, who are helping us look at those kinds of opportunities across the county.'",
        "'speaker_9': 'We cannot do this alone. You will hear me say a thousand times. The city government can do anything, but we can't do everything. And we need help and we need money in order to get this going. So. Also, we've got the green space, the parks, the education, all the amendments that we talked about.'",
        "'speaker_9': 'Do you have an amendment, an amended version that we need to bring forward before we vote on this?'",
        "'speaker_7': 'I sure do.'",
        "'speaker_9': 'Great, July. Thank you. Please. So that's my comments. I just say. And what?'",
        "'speaker_2': 'Thank you. So why don't we take the amendments and then we could describe the the amended legislation and we have some closing comments. So you have, I believe, an amendment one councilmember mosquito.'",
        "'speaker_7': 'Thank you, Mr. President. I think I unfortunately described the amendments as I was doing my spiel. So I do have two amendments, both just to clarify legislation. So the first is Amendment one, I'd move to amend Resolution 31837 by using substitute version five for substitute for version for the second.'",
        "'speaker_2': 'It has been second. So basically we're just accepting version since she actually spoke to the the new version. So substituting version five for version for any comments on the amendment. All those in favor of the amendment. But I.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Opposed the ayes have it and amendment one has passed.'",
        "'speaker_7': 'Amendment two relates to attachment. I'd like to move to amend resolution 31837 attachment A by substituting version five for version for a second.'",
        "'speaker_2': 'It's been moved in second on the attachment. Any comments those in favor of amendment number two, which is again the attachment a subsequent version five for version for a. All those in favor say I. I opposed the ayes have it and those two amendments are passed.'",
        "'speaker_2': 'So we have an amended resolution and Casper bring back show you're through with your remarks, I assume. And Councilmember O'Brien, you have the floor, sir.'",
        "'speaker_8': 'Thank you so much again. Thank you. Thank you, Councilmember Mosqueda, for your work on this. And thanks community members for continuing to make sure that the city is focused on delivering as much affordable housing and using and prioritizing all of our resources towards that.'",
        "'speaker_8': 'I am thrilled to be supporting this going forward. I also want to acknowledge that there are there are surplus properties that are currently going through a process. Some of the homeowners spoke to that, specifically the Mercer Mega BLOCK, and I've been working closely on that and want to make sure that the process will maximize the amount, affordable'",
        "'speaker_8': 'housing and want to work with community members to really understand how we can do that to serve the best interest and get the most housing and in the neighborhoods where we need it most at the same time. So I think this resolution is a great step forward and we'll continue to work on those that are in the'",
        "'speaker_8': 'process.'",
        "'speaker_2': 'Thank you, Casper and Brian. I'll just say briefly councilmember skater that and I think what? What makes a difference in a good legislature legislator is the the ability by which they can get creative and really think outside the box and look at new problems and old solutions.'",
        "'speaker_2': 'And again, sort of put on their thinking hat and really push the envelope. And I think that's what you and your staff are doing. So I want to commend you on that. We've looked at surplus property and both from the generous Upton and for our utilities for years.'",
        "'speaker_2': 'But I think you've taken a much more aggressive approach and one that will better serve our residents and our our constituents throughout this city. So thank you for bringing forth this resolution. And with that, I think we are ready to vote.'",
        "'speaker_2': 'Are you ready to vote, Catherine Mosquito. Okay, all those in favor of adopting the resolution as amended. Please vote i. I those oppose vote no. The motion carries the resolution is adopted. Then Chair will sign it. Please read the next.'"
    ],
    "Pre-Tax Commuter Benefits Ordinance.": [
        "'speaker_2': 'Yeah, let's step on that. Please read the next agenda item.'",
        "'speaker_4': 'The report on the Sustainability and Transportation Committee Agenda Item for Council Bill 119 329 relating to employment in Seattle required certain employers to offer employees the opportunity to use pretax earnings to purchase commuter benefits other than parking in accordance with federal law.'",
        "'speaker_4': 'Adding new Chapter 14.32 code and amending Sections 3.15 .00 and 6.208.0 24. Code Can we recommend civil bill as amended?'",
        "'speaker_2': 'Thank you, Councilmember O'Brien.'",
        "'speaker_8': 'Q I want to take a minute just to explain what this legislation would do, but I want to start by apologizing to Mr. Wasserman in the North Seattle Industrial Association. The first they I learned about it was in a newspaper article today.'",
        "'speaker_8': 'We've been discussing this legislation for over a year. And last year in the budget we reached out and we funded Seattle to do work to engage business folks, and they've been doing that with a lot of folks. And Mr. Weisman, I since I heard you, I've asked my staff to connect.'",
        "'speaker_8': 'Q Seattle, I actually see Nick Franklin with Seattle's in the audience, and I will make sure you can physically chat today to do some of hours work to your members to to make sure they understand it. I will also talk.'",
        "'speaker_8': 'So this legislation, what it does is it takes advantage of a piece of the Internal Revenue Service Code that allows businesses, allows the sorry employees to have transit passes deducted from their payroll pretax. The effect of that means is they get essentially the tax deduction for both their Social Security and Medicare and also their federal income tax'",
        "'speaker_8': 'from the costs of that pass. The result is that for a minimum wage worker who's in a 20 to 25% tax bracket, who's currently buying $100 a month transit pass 1200 dollars a year would save over $300 a year through this mechanism.'",
        "'speaker_8': 'Employers also get savings because the employer is no longer have to pay their payroll tax for that amount that's deducted. So on a similar similarly positioned employee employer would save close to $90 a year on that one employee who's taking advantage of it.'",
        "'speaker_8': 'This is one of those rare opportunities where I believe we have a win win win. The first win being for employees who get to save money on their transit. The second win being for employers who get to save some of their tax liability.'",
        "'speaker_8': 'And the third being for all of us, because when we make it easier, more cost effective for people to have access to transit passes and we reduce congestion and pollution and give people access to the mobility that they need.'",
        "'speaker_8': 'And in the process of this, I want to applaud Seattle for their ongoing work to reach out to both business owners and organizations that work with business leaders. Myself and staff have also met with a number of those folks.'",
        "'speaker_8': 'Obviously not everybody, but we will continue to do that work. One of the things we heard was folks wanted to make sure they had enough timeline to implement this. So in committee we extended the deadlines. This law we're passing it today will not take effect, meaning it will not be implemented for businesses to have the requirement to'",
        "'speaker_8': 'offer this their employees until January 1st of 2020. So a little over 12 months. And then we've put in another year of of what I call a grace period where we won't do any enforcement. It'll just be education.'",
        "'speaker_8': 'And if employees says, Hey, I wasn't notified that I have this right until January 1st of 2021. We've seen similar laws enacted in other cities around the country. New York City is one of those. In the first eight months of their implementation, they had eight complaints where businesses weren't doing what they were required.'",
        "'speaker_8': 'All eight of those complaints were resolved by simply educating the business and explaining how they could do that. And so I feel very confident in both what's been happening elsewhere and in the communication with local businesses that this is something that folks will be able to do without any significant burden, and that to the extent there is'",
        "'speaker_8': 'a burden, it should be more than offset by the tax savings to them. Again, we have another year and change to work with folks before this will be in effect. And I look forward to working with businesses and organizations who are just hearing about this and in the coming year to make sure folks are aware of how'",
        "'speaker_8': 'this will be implemented. And I want to just say that I'm open to in that process, if folks say, hey, there's a very unique concern we have in our business or in our industry where this may not work well, that we can always come back and make changes to that at that time.'",
        "'speaker_2': 'You concern, Brian. Any further questions on this bill? Councilmember Johnson.'",
        "'speaker_1': 'Just a couple of brief comments. I was just looking at the most recent Bureau of Labor Statistics, which I know you guys all know off the top of your head. But for those of you who aren't tracking that, you know, the average person is spending a little bit under $10,000 a year in their transportation cost.'",
        "'speaker_1': 'This is part of their household expenditures. And we all know how critically important it is in a city that is becoming less and less affordable by the day, to give people more transportation choices, gives them more economic freedom.'",
        "'speaker_1': 'And I think that that's the intention here. We have a significant portion. We're still working on the statistics and the data, but a significant portion of Seattle's employers who are not required to offer transit benefits to their employees.'",
        "'speaker_1': 'This gives a pathway for those employees to get access to those benefits and will only prove good dividends for us who try every day to show up to the office to make sure that folks can get to work safely, easily, and reduce their household expenses.'",
        "'speaker_1': 'Oh, by the way, also being good for the environment, too. So I think this is a good bill. We heard from the Office of Labor Standards about their plans for enforcement and their plans to keep us in the loop if they do think that it will cost additional money in order for them to do more enforcement.'",
        "'speaker_1': 'So I'm proud to support this one today.'",
        "'speaker_2': 'Thank very much, Councilwoman Johnson. Councilman Herbo, thank you.'",
        "'speaker_5': 'I'm just taking a look at the fiscal note related to this legislation. And the fiscal note states that the legislation anticipates that the Seattle Department of Transportation will assist in education and outreach as part of the department's ongoing commute trip reduction program.'",
        "'speaker_5': 'And I'm thinking that it might make sense.'",
        "'speaker_0': 'To.'",
        "'speaker_5': 'To think about ways that the Office of Labor Standards can help in the education piece, because I think they have they have ways of engaging with employers because we often rely on their work to do the education piece for for new labor laws that the that the city establishes.'",
        "'speaker_5': 'And they might have deeper tentacles out into the employer community than the.'",
        "'speaker_0': 'Commute trip.'",
        "'speaker_5': 'Reduction program. So I think that might be something that we want to talk about.'",
        "'speaker_2': 'Thank you, Councilman Herbold. Any further comments? We're ready to move forward. Heritage comes from a brand like The Closet.'",
        "'speaker_8': 'Thank you, Councilman Harold. I appreciate that idea. And I know one of the things we anticipate is in the the signage requirements, the posters that go up, that this will be added in the future. As to one of those other requirements and I think a robust dialog with Office Labor standards and to help figure out how we'",
        "'speaker_8': 'make sure that word gets out to be on folks who typically think about computer production. I also want to just say thanks to some of the advocates. The folks at the Trans Writers Union have been key in the work, in the research, to make sure that employer employees who work at smaller employers, where the vast majority of'",
        "'speaker_8': 'us all work, often don't have access to the same types of transit benefits that those who work at the larger employers. And so your research on this and your advocacy on this has really helped get us to where we are today.'",
        "'speaker_8': 'So thank you to the Transit Writers Union and so many other transit advocates who've been part of this throughout throughout the work.'",
        "'speaker_2': 'Thank you. Okay. Please call the roll on the passage of the Bill.'",
        "'speaker_0': 'Herbold II Johnson Suarez. Macheda O'Brien, Swan Bagshaw, Gonzales, President Harrell. I nine in favor and unopposed.'",
        "'speaker_2': 'The bill passes and shows sign it. Please read the next agenda item.'"
    ],
    "Wastewater Rate Adjustment Ordinance.": [
        "'speaker_4': 'Three Civil Rights, Utilities, Economic Development and Arts Committee Genda in five Council Vote 119 356 relating to sale of public utilities in many sections 21.20 8.0, 40.0 80 and 21.70 6.0. 42 Items for code to address wastewater rates committee recommends the bill pass.'",
        "'speaker_2': 'Council Member Herbold Thank you.'",
        "'speaker_5': 'So the drainage in wastewater rates relate to the strategic business plan that the City Council passed last year by Resolution 31769. And the strategic business plan endorsed a six year average rate increase of 5.2% across all lines of business.'",
        "'speaker_5': 'This legislation would establish drainage and wastewater rates for 2019 through 2021, and this package before us actually lowers that rate by a 10th of a percent lower than what is in the endorsed six year strategic business plan.'",
        "'speaker_2': 'Thank you very much. Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_0': 'Herbal Hi. Johnson. Suarez, Moscato. O'Brien All right, so what? Big John Gonzalez President Harrell.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'Eight in favor not opposed.'",
        "'speaker_2': 'Bill passes and share with Senate please read agenda item number six.'",
        "'speaker_4': 'Agenda item six Principle 119 345 Land and zero Public Utilities and many sections 320 1.33.0 30 and 21.76 zero. 40th C Transfer Code to Adjust Drainage Rates Committee recommends the bill passed.'",
        "'speaker_5': 'Councilmember Herbold Thank you. The Water System Plan provides guidance for planning and managing the city's drinking water system and associated capital facilities for the next 20 years, in coordination with growth management planning by the city and other planning agencies.'",
        "'speaker_5': 'The Water System Plan provides guidance to Seattle Public Utilities on future direction for all elements of its water system, including new water use efficiency goals for the Regional Water Conservation Program. An update to the Water Shortage Contingency Plan and strategies and plans for operating, maintaining and improving the system for the next ten years and beyond.'",
        "'speaker_2': 'Thank you, Casper Herbold. Any questions about agenda item number six? If not, please call the role on the passage of the Bill Herbold II.'",
        "'speaker_0': 'Johnson Whereas I macheda i. O'Brien All right, so on. Big shot Gonzalez. President Harrell.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'Eight in favor and unopposed.'",
        "'speaker_2': 'Bill passed in show Senate. Please read agenda item number seven.'",
        "'speaker_4': 'Agenda item seven Council Vote 119 347. Relating to set of public utilities adopting the 2018 Water System Plans Committee recommends the bill pass.'",
        "'speaker_2': 'Customer Herbold.'",
        "'speaker_5': 'Thank you. I just.'",
        "'speaker_0': 'Realize.'",
        "'speaker_5': 'When the city clerk read the second item into the record that the, my, my comments for item five were actually for item five and six and I already gave my comments for item seven. So I have nothing more to add.'",
        "'speaker_9': 'Efficiency as leaders.'",
        "'speaker_2': 'Many of us were well aware of that because.'",
        "'speaker_0': 'You're.'",
        "'speaker_5': 'Tracking it.'",
        "'speaker_2': 'Okay. Now, are we ready to vote on number seven? Please call the roll on the passage of the Bill.'",
        "'speaker_0': 'Herbold by Johnson Suarez Moscato. O'Brien All right. So on John Gonzalez President Harrell.'",
        "'speaker_2': 'I.'",
        "'speaker_9': 'Have.'",
        "'speaker_0': 'Eight in favor and unopposed.'",
        "'speaker_2': 'The bill passed in show senate. Please read items eight and nine together.'"
    ]
}