{
    "Honorary Designation of 22nd Avenue NW as Rob Mattson Way.": [
        "'speaker_5': 'The report of the City Council. Agenda Item one Resolution 31878. A resolution providing an honorary designation of 72nd Avenue Northwest between Northwest 56th and Northwest 57th streets as Rob Madsen Way introduced day April 15th, 2019.'",
        "'speaker_0': 'Councilmember O'Brien.'",
        "'speaker_6': 'Thank you, Council President, colleagues. I'm excited to pass this designations today. This would designate the 22nd Avenue between Northwest 56th and Northwest 57th. So that's the block between or on the west side of the Ballard branch of the Seattle Library as Rob Madsen Way.'",
        "'speaker_6': 'Rob passed away last year. He retired in 2013 from the city of Seattle, having worked for the city for 42 years in 1973 and or Mayor Wes Holman. He was appointed the the director of the Ballard Little City Hall at the time as head of the Ballard Neighborhood Service Center and founder of the Ballard District Council.'",
        "'speaker_6': 'Rob continued his work, connecting residents of Ballard with each other in the city services through most of his career. In later years, Rob was often referred to as the mayor of Ballard. By introducing this resolution, Mayor Durkan, along with his family and friends, intends to honor Rob with this honorary street station.'",
        "'speaker_6': 'There will be a celebration as the signs go up in the neighborhood at a date to be named in the future. But Rob was someone I didn't get to work with a whole lot, but someone who I know is respected by just about everyone in the community.'",
        "'speaker_6': 'Amazing person.'",
        "'speaker_0': 'Thank you, Casper and Brian. Any other comments or questions on this resolution? Actually my honor in supporting this. Thank you, Councilman Bryan, for bringing the full council's attention. Okay. Those in favor of adopting the resolution, please vote. I, i those opposed vote no.'",
        "'speaker_0': 'The motion carries and the resolutions adopted, and Cher will sign it. I don't know. He had some fans out there and given a longer speech. Okay, please read the next agenda item.'"
    ],
    "Proposition to Lift Property Tax Limit for Library Investments and Seismic Retrofits.": [
        "'speaker_5': 'The report of a Select Committee on the Library Levy Agenda Item five Council Bill 119491 An ordinance relating to regular property taxes providing for the submission to the qualified electors of the city and an election to be held on August six, 2019.'",
        "'speaker_5': 'A proposition to lift the limit on regular property taxes under Chapter 84.55 RTW and authorize the city to levy additional taxes for up to seven years for the purpose of sustaining investments in library. The committee recommends a bill passed as amended.'",
        "'speaker_0': 'Councilmember Suarez.'",
        "'speaker_2': 'Thank you. Council President So you know, this has been a quite a process. I'm glad we're finally here. In 2012, Salem voters approved access to critical educational literacy resources for every resident by passing a seven year $120 million library levy levy funds concluded by the end of this year.'",
        "'speaker_2': 'Hence the creation of the Select Committee of the Library Levy to possess a proposed renewal to continue services. I was I am proud and honored to have chaired this committee regarding one of the city's most valuable institutions and assets, our public libraries.'",
        "'speaker_2': 'As a committee, we closely examine the mayor's proposal, which slated to continue baseline services while keeping up with the demands of a growing city sale. Public libraries invested in priorities and values set by our constituents, all of our constituents, residents across the city of Seattle and users of the library who have said which include I'm sorry, the'",
        "'speaker_2': 'for are the open hours and access collections, technology, online services, safety and maintenance maintenance meaning that we are protected from earthquakes. Because you all know I can't say that word. Seismic. Seismic libraries are the People's University. They are the most public of institutions since our country's founding.'",
        "'speaker_2': 'The library, the 21st century, provides more, more services than ever. And these past decades, they are neighborhood centers that give greater access to learning books like. Tronox Media Equipment Conference Space Lecture Series and much, much more, including library time for little ones, for reading and for English as a second language.'",
        "'speaker_2': 'At its at its core, libraries have been serving millions of people and transforming lives. To that end, build a stronger, more democratic society. I hope that we continue to look at libraries as we do with other institutions as evolve.'",
        "'speaker_2': 'Last week, the committee approved three amendments that strengthen the proposal in addition to the mayor's proposal. Number one, I want to thank Councilmember Gonzalez for her amendment to the expansion of play and learn from 0 to 5 years old, 0 to 5 years for education.'",
        "'speaker_2': 'Second, I want to thank Councilmember O'Brien for his amendment for the proposal, the additional open hours at 26 libraries. And finally, I want to thank Councilmember Mosquito, who worked very closely with our office and adding the expanded community resource specialist program for use.'",
        "'speaker_2': 'Thank all of you for working with our office and the mayor's office to move this important levy forward. The total committee has presented from the mayor's proposal is an estimated $219 million. The Select Committee and Library Levy recommended that the City Council Pass Council Bill 119491 as amended and hopefully or I hope that this will be on'",
        "'speaker_2': 'the August six, 2019 ballot. I again want to thank central staff. That would be Asher for doing a phenomenal job in briefing us and drafting the amendments and again in my office, who worked closely not only with the executive but with Asher and put together much of the framework and the analysis.'",
        "'speaker_2': 'And of course, I want to thank my colleagues for supporting this very important levy. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Walls. Any other comments or questions on this legislation? Customer Beck Show.'",
        "'speaker_2': 'Thank you. President Herald. Councilmember Suarez. Thank you for your leadership on this. Just as in some of the previous items, I appreciate very much your organization. Getting that information to us early and keeping the notebooks updated. Marcellus Turner, thank you for being here.'",
        "'speaker_2': 'We really appreciate your leadership in this as well. I don't know whether our library foundation or friends of the library are here, but having that kind of a robust community engagement on the front end is really helpful. So I'm fully supportive of this.'",
        "'speaker_2': 'I think it's a good package, one that is tempered but still addresses the needs of the People's University. Council President.'",
        "'speaker_0': 'Yes, Councilman. Whereas I just.'",
        "'speaker_2': 'Want to add one thing. I want to thank Marcellus versus I'm sorry, I did not see you sitting out there, but thank you so much and your staff for getting all the material back to us. And I know we pushed a lot of deadlines on you and asked you for tons of information, statistics and trends and more'",
        "'speaker_2': 'information. So thank you so much.'",
        "'speaker_0': 'Okay for the comments. Councilmember Mosquito.'",
        "'speaker_7': 'Thank you, Mr. President. And thank you, Madam Chair, for who helped shepherd this lamprey levy through the process. It was a great to be able to work with Chair Juarez and the Select Committee and all of my colleagues to help strengthen the levy package that we're bringing to voters this August.'",
        "'speaker_7': 'I want to specifically thank the folks on the front line, our librarians and the folks who are working in the libraries who came up with some of the strategies that we floated during this last few weeks. I'm very, very honored to have been able to work with you to get into this levy, the ability to make sure'",
        "'speaker_7': 'that we have community service officers who are serving our youth across the city in more locations, especially for those who are self-identifying as homeless. Making sure that we're connecting them to housing services, health services and educational and job opportunities.'",
        "'speaker_7': 'We heard from folks who came to testify that sometimes our libraries are unintentionally being used as data centers. And while the reality is we need to continue to scale up our housing and shelter services, the librarians, the folks who are working on the front line, you all are providing tremendous service to the community at large.'",
        "'speaker_7': 'And we want to make sure that there's community service officers there to help make sure that we're connecting those who are self-identifying as being without shelter into appropriate shelter and services. So I see this as a huge compliment to the work that you all are already doing and an additional need that was identified by folks on the'",
        "'speaker_7': 'front line. I look forward to working with the council and the Budget Chair as we think about some of the other opportunities going forward around child care and greater security for our folks who are both patrons and workers at the library.'",
        "'speaker_7': 'So thank you and thanks to your team and to the board for all that you do and to our frontline staff. Thank you to our suarez for your work with us on this issue.'",
        "'speaker_0': 'Thank you, councilman shader. And I'll just say a few parting words. Thank you again for your leadership council and worse thing for shepherding this through and you and your board, your various boards and volunteers and employees. You know, the library has always been very personal to me.'",
        "'speaker_0': 'My my mother's, I think you well know, spent most of her career at the library and retired from the library. And so I just think it's so critical for this to pass. And so the sometimes difficult conversations we had looking at the finances of this, of what we're trying to do, were good conversations because at the end'",
        "'speaker_0': 'of the day, our library system is so much more than just brick and mortar. I mean, particularly given all of the issues that are facing our underserved communities, are youth people on fixed income. The libraries are just one of our most treasured gems.'",
        "'speaker_0': 'And so I think the hard work will begin after this to make sure that everyone understands that. And so it's going to be my pleasure and actually supporting this legislation, I think all of the hard work that went into it.'",
        "'speaker_0': 'So. So having said that, please call the role on the passage of the Bill.'",
        "'speaker_2': 'O'Brien by Sergeant Bagshaw i. Gonzalez Herbold. I was I macheda I President Harrell I favor favorite unopposed.'",
        "'speaker_0': 'Bill passed and show sign it gladly. Okay. Please read the next agenda item into the record.'"
    ],
    "Ordinance to Amend Interlocal Cooperation Agreement with King County for Conservation Futures Levy Funds.": [
        "'speaker_5': 'The Report of the Civic Development, Public Assets and Native Communities Committee Agenda Item six Council Bill 119494 An Ordinance relating to King County Conservation Features Levy proceeds. The committee recommends the bill pass.'",
        "'speaker_0': 'Council member US.'",
        "'speaker_2': 'Thank you. Council President The proposed ordinance will significantly streamline the conservation future levy the CFL, the Interlocal Agreement Amendment Process. This upgraded process will allow faster reimbursement for Seattle's CFL projects that have been awarded funding by the King County Council.'",
        "'speaker_2': 'The Civic Development, Public Assets and Native Communities discuss these items. Last week. Last Wednesday, voted out of committee and we recommend that city council pass this bill.'",
        "'speaker_0': 'Thank you very much. Any further questions or comments? If not, please call the rule on the passage of the Bill.'",
        "'speaker_2': 'O'Brien.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'So aren't I make sure I. GONZALEZ Hi. Herbold Hi, Warriors. Mascara Right. President Harrell high eight in favor and unopposed.'"
    ],
    "Ordinance on Vacant Building Monitoring and Inspection.": [
        "'speaker_0': 'The bill passenger will sign it. Please read the next agenda item.'",
        "'speaker_5': 'The Report of the Planning Land Use and Zoning Committee Agenda Item seven Council Bill 119497 An ordinance related to monitoring and inspecting vacant buildings for compliance with the requirements of the Housing and Building Maintenance Code. The committee recommends the bill pass.'",
        "'speaker_0': 'Councilmember O'Brien.'",
        "'speaker_6': 'Thank you. Just really briefly, this ordinance would implement a new set of rules for inspecting vacant buildings. But I'm going to hand over to my colleague, Councilmember Herbold, who did a lot of work on this.'",
        "'speaker_0': 'As a member. Herbold.'",
        "'speaker_2': 'Thank you so much. So this is legislation that I sponsored post budget cycle last year. During the budget, the council acted on an amendment to the existing mandatory I'm sorry, not mandatory, a vacant building monitoring program. And these recommendations came out of a couple of years process that council had engaged in.'",
        "'speaker_2': 'We both hired or funded the hiring of a staff person at SDC to make some recommendations for how to improve the monitoring of the vacant building monitoring program. And we also indicated in a prior piece of legislation that we intended to.'",
        "'speaker_4': 'Make these changes in.'",
        "'speaker_2': 'Last year's budget cycle because of the concerns that the executive had about those changes. We agreed to have them not go into effect until the beginning of June, and we addressed some of the concerns that they had prior to it going in effect.'",
        "'speaker_2': 'So the changes to the program will modify fees for buildings found to meet the requirements of the code to better reflect the cost of the inspection to the Department of Construction and inspections. Fees would change from $171 to to 61.'",
        "'speaker_2': 'Again, this is intended to be a fee neutral program. The fees associated with inspecting these buildings are intended to pay for the inspections themselves. It also allows buildings to fall off of the monitoring list. In other words, no longer be in enrolled in the monitoring program when there have been three consecutive inspections without violation.'",
        "'speaker_2': 'And then finally, the amendments allow the city to enroll buildings after one violation. If that violation is not remedied by the compliance date established in the note of violation, or if there are subsequent violations within 365 days from the date of the first notice.'",
        "'speaker_2': 'Again, just this sort of big picture, the reason why this is really important is we've seen how much damage can be done to a.'",
        "'speaker_4': 'Vacant building that is.'",
        "'speaker_2': 'Not being maintained.'",
        "'speaker_4': 'In a way that is.'",
        "'speaker_2': 'Consistent with the city's existing vacant building code. Those are requirements that really are focused on boarding up the property so that.'",
        "'speaker_4': 'People cannot.'",
        "'speaker_2': 'Access it.'",
        "'speaker_4': 'And so that, frankly, they can't be.'",
        "'speaker_2': 'Magnets for.'",
        "'speaker_4': 'For crime and other.'",
        "'speaker_2': 'Unlawful activity. We found through our review of the existing program that police and fire are often having to go out to these properties hundreds of times.'",
        "'speaker_4': 'And that is.'",
        "'speaker_2': 'That.'",
        "'speaker_4': 'Is being paid.'",
        "'speaker_2': 'For with public tax dollars instead of.'",
        "'speaker_4': 'Being paid for.'",
        "'speaker_2': 'By the.'",
        "'speaker_4': 'The property.'",
        "'speaker_2': 'Owners who are choosing to keep these.'",
        "'speaker_4': 'Buildings vacant rather than.'",
        "'speaker_2': 'Either maintaining them as occupied buildings for people to.'",
        "'speaker_4': 'Live in or.'",
        "'speaker_2': 'Moving forward with.'",
        "'speaker_4': 'Their development projects, because many of these properties.'",
        "'speaker_2': 'Are within the development, redevelopment process and cycle.'",
        "'speaker_0': 'Very good. Thank you, Councilman Herbold. Are there any other questions or comments on this bill? Customer Gonzalez.'",
        "'speaker_4': 'Thank you. Council President.'",
        "'speaker_2': 'Oh.'",
        "'speaker_4': 'And I might need it later on because I just pulled a bunch of water on my keyboard. Oops. I just wanted to say that I was one of the councilmembers during the budget process that expressed some reservations and concerns about this particular program as it was being proposed, and wanting to make sure that whatever approach the city'",
        "'speaker_4': 'took was one that was going to be responsive to the realities around the implementation of the program and really want to appreciate the work that Councilmember Herbold has done as their prime sponsor on this bill to make sure that those the flexibility is going to continue to exist within the program, but also making sure that we're managing'",
        "'speaker_4': 'community neighbors expectations about the city's obligations to respond to what are real, real concerns within the community. So I really do appreciate your your hard work over a long period of time to be responsive to those what I think were reasonable concerns around implementation.'",
        "'speaker_4': 'And I am excited to be at a place now where I am supportive of this legislation.'",
        "'speaker_0': 'Those comments, any other questions or comments? If not, please call the role on the passage of the Bill O'Brien.'",
        "'speaker_2': 'Sergeant Bagshaw. Hi. Gonzalez, I Herbold. Hi, Suarez. Let's get to President Harrell. Eight in favor. Nine opposed.'"
    ],
    "Resolution on North Delridge Action Plan and Delridge Neighborhood Plan Amendments.": [
        "'speaker_0': 'The bill passed. And, Cheryl, sign it. Please read the next agenda item into the record.'",
        "'speaker_5': 'Agenda item eight Resolution 31880. A resolution recognizing the effects of the North Delbridge community to prepare an action plan for their community. The committee recommends the resolution be adopted.'",
        "'speaker_0': 'Cast Member O'Brien Thank you.'",
        "'speaker_6': 'This resolution would recognize the North El Ridge Action Plan. We had a good discussion in committee and like the last item, I'm also going to refer to my colleague, council member Herbold, who did a lot of work on this.'",
        "'speaker_2': 'HERBOLD Thank you so much. And I should also thank the chair for his willingness to have both of these pieces of legislation.'",
        "'speaker_4': 'In a.'",
        "'speaker_2': 'Committee that didn't necessarily have to be moved forward. And this was sort of a holdover legislation from previous chair, Rob Johnson's committee chair, Shep. And so I really appreciate Councilmember O'Brien fulfilling those commitments. So this resolution memorializes many years of effort by community members in North Delbridge to develop their neighborhood plan.'",
        "'speaker_4': 'The action plan itself identifies.'",
        "'speaker_2': 'Six separate priority areas diverse and engaged communities, dynamic neighborhood destinations, access to affordable, healthy food.'",
        "'speaker_4': 'Active transportation.'",
        "'speaker_2': 'Choices, a healthy Longfellow Creek basin, and support of parks and cultural facilities. The resolution also requests that the executive review and make recommendations regarding the action items indicated at each of those six priority areas. So we'll be looking for movement on funding some of these priority areas in the budget process this year.'",
        "'speaker_2': 'And then finally, the resolution requests that.'",
        "'speaker_4': 'The Office of Planning Community Development Review.'",
        "'speaker_2': 'And make recommendations as identified by the community.'",
        "'speaker_4': 'In the Action Plan in the 2035 comp plan for consideration in 2020. I have a very.'",
        "'speaker_2': 'Small amendment that I mentioned in briefings this morning and I'll pass it out. And basically, it just makes a change to one of the.'",
        "'speaker_4': 'Action plan priority.'",
        "'speaker_2': 'Actions to just clarify that one of the action items, its success moving forward really relies.'",
        "'speaker_4': 'On our ability to coordinate efforts with city departments.'",
        "'speaker_2': 'So first, I'd like to move Amendment One, which is contained in Attachment B, the Northridge Action Plan, priority actions.'",
        "'speaker_0': 'Second to move in second, and to make the amendment as described by Councilmember Herbold. This is just the amendment vote, although. Any questions on it?'",
        "'speaker_4': 'Just a quick question.'",
        "'speaker_0': 'Please.'",
        "'speaker_4': 'Councilmember Herbold, just want to confirm that the language that you just handed out now is the same as what you handed out this morning. It is. Okay, great.'",
        "'speaker_0': 'Okay. We had it this morning. Good to go. All those in favor of the amendment. Please vote I. I oppose. The ayes have it. The resolution is a minute. Councilmember Herbo.'",
        "'speaker_2': 'Thank you. I just want to thank the community members who participated in the development of the action plan again for several years. This has been a long time coming and I would think also David Goldberg at the Office of Planning Committee Development for shepherding the process.'",
        "'speaker_0': 'Very good. Okay. Any other questions on the amended resolution? All those in favor of adopting. The resolution as amended. Please vote i i those opposed vote no. The motion carries the resolution is adopted as amended and the chair will sign it.'",
        "'speaker_0': 'Please read the next two items please.'"
    ],
    "Resolution to Update Legislative Department Policies on Workplace Expectations.": [
        "'speaker_5': 'The Report of the Housing, Health, Energy and Workers Rights Committee. Agenda Item 16 Resolution 31879a resolution supporting a safe and responsive workplace in the city of Seattle's Legislative Department and providing guidance to update Legislative Department policies, including Policy 100 on workplace expectations.'",
        "'speaker_5': 'The committee recommends a resolution be adopted.'",
        "'speaker_7': 'Customer ROSQUETA Thank you very much, Mr. President. Over the last year and a half since arriving and before that, even when working at the Washington State Labor Council, the AFL-CIO, I've been constantly working to try to make sure that we're creating safe workplaces.'",
        "'speaker_7': 'That means not just safe from hazards and injury, but also safe from intimidation, harassment and retaliation. I'm really excited that this council and the city at large has been engaged in a conversation to respond to the MeToo movement and to make sure that those who are speaking up and speaking their truth to power, that those who are'",
        "'speaker_7': 'sharing their experiences of retaliation or intimidation or even assault and harassment are having their words met with action. Today, I'm excited to move for forward the resolution that looks internal to our department, in the Legislative Department and our smaller affiliated departments.'",
        "'speaker_7': 'Externally, from the executive branch, we have made a commitment to supporting policy changes within our legislative branch, to changing our policy, to updating our training, to making sure that we are learning from the stories directly from frontline workers and incorporating anti-harassment and prevention training on the front end.'",
        "'speaker_7': 'I've been excited to participate and learn from the folks on the interdepartmental task force, as we've talked about ways in which we can change the city's response to creating an inclusive and welcoming workplace. And now, as we move forward with looking at our own department policies, we have such an incredible opportunity to build on that, work on'",
        "'speaker_7': 'the leadership of our department leaders and making sure that we have a responsive resolution. This incorporates the voice of city workers on the front line from silence breakers, from change team makers and from labor unions. We asked them directly what they would like to see in terms of amending our policies and procedures so that we can not'",
        "'speaker_7': 'only ensure that those who are getting elected adhere to these requirements for a safe and respectful workplace, but that we're also making sure that our staff we're more responsive and creating a safe place for people to come and share comments here.'",
        "'speaker_7': 'And that as electeds and staff, that we have a decorum that we expect of our communication with the public at large as well. I'm excited to make sure that the folks who've engaged with us from the very beginning of this resolution will continue to have a role in helping us shape what the policy changes will be going'",
        "'speaker_7': 'forward, and that our workplace resolution is about setting the table, making sure that those who've had direct experiences of intimidation or harassment are helping us understand better what we can do to update our personnel policies. We're reaffirming our commitment today that staff should be treated with respect by members of the public and by any bosses and middle'",
        "'speaker_7': 'management, also making sure that we're stepping up and creating not just a place for one time advice to be given, but an ongoing work group so that we can continue to advise us as electeds and our department leaders on policies and practices.'",
        "'speaker_7': 'I want to thank you, Mr. President, for your support on this. I want to thank Monica Simmons for her support and work with our office on this as well, and specifically to the frontline workers who provided feedback and ideas.'",
        "'speaker_7': 'We again here in public office are hoping to lead by example. As public employers. We want to show across the city what it means to stand up and be responsive and good employers, high road employers, as we respond to the MeToo movement.'",
        "'speaker_7': 'Thank you very much, Mr. President. We'd love to have the full council support as we move this resolution forward.'",
        "'speaker_0': 'Thank you, Councilwoman Maceda. Any questions or comments from any of the colleagues on the dais? The Casper customer. I just want to thank you for for your leadership and for working all the the the constituents and the issues and making sure that we are leading by example.'",
        "'speaker_0': 'And certainly your commitment as a as a leader, we should all follow. So thank you very much for your leadership. Okay. Those in favor of adopting the resolution, please vote i. I those oppose vote no. The motion carries.'",
        "'speaker_0': 'The resolution is adopted. The chair will sign it. Please read the report of the Gender Equity Safe Communities, New Americans and Education Committee.'",
        "'speaker_2': 'On.'"
    ],
    "Implementation and Evaluation Plan for the 2018 Families, Education, Preschool, and Promise Levy.": [
        "'speaker_5': 'The Report of the Gender Equity Safe Communities, New Americans and Education Committee Agenda Item 17 Council Bill 119 480 An Ordinance relating to the 2018 Families, Education, Preschool and Promise Levy.'",
        "'speaker_4': 'Catherine Gonzalez Council President Harrell, if I may request that the clerk also read Agenda Items 18 and 19 into the record. I'd like to speak to all three of them at once.'",
        "'speaker_0': 'Excellent. Please do that.'",
        "'speaker_5': 'Agenda Item 18 Resolution 31881a resolution relating to the 2018 Families, Education, Preschool and Promise Levy approving a partnership agreement between the City of Seattle and the Seattle College District and Agenda Item 19 Resolution 31882a resolution relating to the 2018 Families, Education, Preschool and Promise Levy approving a partnership between the City of Seattle and the Seattle School District'",
        "'speaker_5': '. Number one, the committee recommends the resolutions be approved.'",
        "'speaker_2': 'Adopted.'",
        "'speaker_0': 'We will vote on them individually, of course. Councilmember Gonzalez, lead us through these.'",
        "'speaker_4': 'Thank you. Council President Harrell I spoke to all three of these pieces of legislation during council briefing today. I won't rehash all of the remarks that I made this morning, since I know that I spent quite some time going through all of the details of the amended version of the Council, Bill and I walked us through the'",
        "'speaker_4': 'bare components of the partnership agreements with our partners. I do just want to say that the bill, the underlying bill, which was originally transmitted by the mayor's office, the city council in this particular version of the bill is it includes nine different amendments from committee work in my committee.'",
        "'speaker_4': 'All all really centered around making sure that the implementation and evaluation plan, as presented in this Council Bill is in alignment with the the priorities of the City Council as adopted both in the ordinance and in the resolution that we all considered last year before the levy went to two voters for their consideration in the fall.'",
        "'speaker_4': 'And again, I won't belabor those points. I went through them pretty thoroughly this morning during a council briefing, but I'm very excited about having the council bill in front of us at this juncture, which will effectively provide appropriations to the Department of Education and Early Learning in order for Diehl to be able to begin the process of'",
        "'speaker_4': 'contracting out with partners, to begin the process of investing taxpayer dollars in the various areas of education, both from preschool to the K-through-12 system. And, of course, by establishing a sustainable revenue stream for the Seattle Promise Program, which will provide two free years of college for high school graduates of our public schools.'",
        "'speaker_4': 'And so Council Bill 119480 would accomplish all of those things consistent with the levy as adopted and approved by the voters. And of course, our Levy Oversight Committee also considered the bill and the resolutions that I'm about to talk to and recommends that the city council approve all of the above.'",
        "'speaker_4': 'The two resolutions that we will consider 3181 and 31882. Our resolutions that would approve the partnership agreements between Seattle School District Number one and the Seattle College District. These are our first two identified partners as it relates to the K through 12 Investments and the Seattle Promise Program.'",
        "'speaker_4': 'And again, the FAP Levy Oversight Committee reviewed those partnership agreements and approved or recommends that the City Council adopt those resolutions. I will also note that as it relates to the Seattle school district there, the Seattle School Board did review and consider the partnership agreements and they approved those partnership that partnership agreement last week during their Seattle'",
        "'speaker_4': 'school board meeting. I will just end by saying a few thank you's. There are some folks in the audience today and some folks who couldn't be here today. But I do want to thank some folks before we take a final vote.'",
        "'speaker_4': 'On advancing the implementation and evaluation plan and the accompanying partnership agreements. I'd like to thank Chancellor Pan from the Seattle Colleges. Thank you so much for being with us this afternoon. And Dr. Sheila Edwards Lang also here from Seattle Colleges.'",
        "'speaker_4': 'Thank you so much to both of you for your ongoing partnership and making sure that we got the model just right and that we're centering the Seattle Promise program on on those students who have the least amount of access and opportunity to pursue a college degree or a certification for a career after after graduating from high school'",
        "'speaker_4': '. So really thank you. Thank you to both of you for all of the work that you've been doing us and for your ongoing commitment to making college accessible and affordable for as many students as as we possibly can.'",
        "'speaker_4': 'So thank you both. I also wanted to thank Superintendent Denise Juneau and her staff over at the Seattle Public School District, number one for all of their ongoing partnership and cooperation in structuring our education investments in a way that will really, really wrap around a student who has additional needs to be able to learn and and be'",
        "'speaker_4': 'successful in their academics. I've really enjoyed getting to know and work with Superintendent Juneau on these really critically important issues and have just been really honored to be able to share that space with her and to really see her center.'",
        "'speaker_4': 'The academic performance of our students that are furthest away from educational justice within the Seattle Public School System. So thank you all for your partnership. Equal thanks. Go out to the Seattle School Board and their members really appreciate their insight as we continue to develop these investments.'",
        "'speaker_4': 'And again, making sure that these partnership agreements are workable for the Seattle school district is really, really important to making sure that the investments are being leveraged as as efficiently and as strongly as possible as they continue to look at their budget as well.'",
        "'speaker_4': 'And then I would also like to thank the Department Education Early Learning director Dwayne Chappelle and all of his staff for all of their really hard work on shepherding this along. Over the last a year and a half or so, we've actually all collectively have been working on the families and Education, Preschool and Promise Levy proposal and'",
        "'speaker_4': 'now implementation evaluation plan since 2017. So it has been a long road and I'm really excited to be able to be at this juncture when we can finally give our final vote of approval to the Department of Education and Early Learning to begin deploying the dollars and investing in our kids through our partners.'",
        "'speaker_4': 'So thank you so much to Director Chappelle, who just happened to walk in. It's like he heard me and to all of his staff for really being so committed to to this work and ultimately to the kids of our city.'",
        "'speaker_4': 'So thank you all so much. I also want to thank Mayor Jenny Durkan for her cooperation and her steadfast commitment to working with my office and with City Council on advancing these really important areas of investment. Especially want to thank Chris Delano from her office, who's here with us and serves as a representative on the FAP Levy'",
        "'speaker_4': 'Oversight Committee. Thank you all so much for your ongoing partnership in and wanting to continue to work in a spirit of collaboration to make sure we give our kids the best opportunity they can have. And then lastly in my office, wanted to thank V Nguyen, who really worked very hard and diligently on shepherding through a lot of'",
        "'speaker_4': 'my policy priorities in this implementation and evaluation plan and the overall levy as a whole. I also want to thank her for shepherding through a lot of her own priorities in this levy to continue to invest in English language learners and diversifying our teachers and educators within the Seattle Public School System.'",
        "'speaker_4': 'And in really making sure that we are continuously centering our work on those students who again, are furthest away from opportunity. And then, last but not least, wanted to thank our former colleague, Rob Johnson, who was my co-chair on the Select Committee on Education and really worked closely with me and my staff and my office to just'",
        "'speaker_4': 'continue to champion the needs of kids, particularly in the K through 12 system. So he is missed because he's not here with us in in in the in the physical sense. But his legacy will continue to live on in the work that he did on this particular levy.'",
        "'speaker_4': 'So I want to give him a shout out also for all of his partnership on the Families and Education Preschool Levy, including this implementation evaluation plan. I think the only thing he didn't get to do was take a final vote in committee.'",
        "'speaker_4': 'So I know he's watching. So I want to thank him. I thank him for that. And. And with that being said, I would like to move for the council to adopt Council Bill 119480.'",
        "'speaker_0': 'It doesn't have to be moved because.'",
        "'speaker_4': 'Okay, well, then I won't move it, but I'll just encourage you all to support it.'",
        "'speaker_0': 'Very good. Well done. Any other comments or questions? Customer mosquito.'",
        "'speaker_7': 'Well, I was ready to second that because I'm very excited about the work that you've done. And I just want to congratulate you. Councilmember Gonzalez, you mentioned you and your co-chair have been working on this for years. And as we talked about it in your committee, there was a round of applause and murmurs as people had talked'",
        "'speaker_7': 'about how long they had been waiting for this to happen. So just a huge amount of congratulations to you and everything that you got accomplished in this levy. You had a good document to start with and you made it even better.'",
        "'speaker_7': 'Thank you for all the work that you did to include race and social justice, especially trying to think about alternative career pathways, good living wage jobs, making sure that we had a focus on our earliest learners. You mention a legacy as we think about our former colleague, Councilmember Johnson, and I think you should also give yourself a'",
        "'speaker_7': 'pat on the back for what did that for you, for the legacy that you've also included in this legislation. I also want to thank our colleagues, and especially you as the chair, for your support for the amendment that we were able to work in to make sure that our public dollars are being used to really support our'",
        "'speaker_7': 'institutions that are adhering to labor laws and a commitment to labor harmony. The amendment that we got in, as you read this morning, item number eight ensures that our city dollars makes ensure that our city dollars are providing a baseline protection for the labor policies that the city has already passed and that we don't further erode labor'",
        "'speaker_7': 'protections or collective worker voice. And I just think that this is really important to lift up, especially in the era of the Janice and the attacks on labor nationally, that we continue in this city to stand up and show what it means to be a strong Union City, to support workers across the board, whether or not they'",
        "'speaker_7': 'have a collective bargaining agreement or not. And I applaud you for including this in there. We were really excited to make sure that our amendment was included because we wanted to make sure that we we applaud the fact that when we have higher unionization rates, we see higher retention, less turnover, less stress and improved health outcomes.'",
        "'speaker_7': 'And all of these things are good for our kiddos and our city at large. I also think that it's important that we continue to applaud the good work that our public schools are doing just by recognizing the hard task that you all have in front of you to to raise our youngest learners all the way through now'",
        "'speaker_7': 'the Seattle Promise Program. So thank you for everything that you do and to your frontline staff for helping to raise and grow our kiddos in the in this community. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember skater Councilmember Swan.'",
        "'speaker_1': 'Thank you, Carol. This resolution adopts the implementation plan detailing how the funding from the education levy will be distributed to schools and programs. When the mayor first sent it to council, my office was concerned to see that the mayor explicitly put in the implementation plan that funding might go to charter schools in Seattle.'",
        "'speaker_1': 'I do not support charter schools as an institution. They are cynically used to disempower teachers and their unions. They remove democratic community oversight of schools and they drain resources from the already deeply underfunded district schools. Ever since labor movements have won public education, they have been relentless, profit driven forces trying to privatize it.'",
        "'speaker_1': 'In the nineties, these forces tried to push for vouchers that would take public education funds and put them towards private schools. When they failed to win support for that. They started pushing for charter schools, which in many states do not.'",
        "'speaker_1': 'In Washington state are operated by for profit companies with devastating impacts for both children and our teachers unions. The Waltons, the owners of Walmart and the Gates Foundation. Both are examples of institutions that pour money into charter schools, even in cases where charter schools may be well run.'",
        "'speaker_1': 'They siphon off funding from the district schools, hurting the education of other students. And of course, we know the most adversely affected are very low income and poverty stricken communities with no accountability. Seattle's charter schools are nonprofit, which is good, but they are all run by charter school chains out of California.'",
        "'speaker_1': 'I hope these problems are considered when funding awards are made so that Seattle Public Schools does not lose out. I will vote in favor of this implement implementation plan because I support the overwhelming majority of it. But I just wanted to state for the record that I do not support funds being taken from our public schools to'",
        "'speaker_1': 'fund charter schools. Ultimately, educators are charter schools will need to unionize to push back against the privatization and austerity agenda of the so-called school reformers. And it is encouraging that charter school teachers in cities like Chicago are starting to move towards this.'",
        "'speaker_1': 'As a member of an educator Union American Federation of Teachers Local 1789. I know firsthand how important unions are. Adjunct professors will tell you. You know, I join professors who cobble together a living by teaching courses, and different universities will tell you that they are paid more in introductions where they have a union than in universities where'",
        "'speaker_1': 'they don't. Even though the universities don't have unions and may actually have larger resources simply because when you have a union, you have better wages and benefits. If only educators at Seattle charter schools would want to unionize. I would urge you to contact the Seattle Educators Union or my office so that we can make sure that all'",
        "'speaker_1': 'charter schools are unionized and then ultimately brought into the public purview. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Swan. There's no further comments. I'll say a few words and then I'll ask Councilman Bizarre if she'd like to close. I just want to thank Councilmember Johnson and Councilmember Gonzalez basically for doing their job so well, that this is a time where the Legislative Department will do a very deep dove, almost very granular in'",
        "'speaker_0': 'its approach to make sure that the investments are exactly where our priorities are. And that's not easy. Work is thorough work. And I want to thank you and commend you for the level of detail that this legislation presents.'",
        "'speaker_0': 'Thank you very much. Councilwoman Gonzales, would you like to see any closing remarks before we vote?'",
        "'speaker_4': 'Just really quickly, I want to thank Councilmember and want for her remarks. I think it is important for us as an institution, an agency that continues to invest in education, to make sure that we are centering the children that we are investing in at the center of that work.'",
        "'speaker_4': 'And and I also think that our investments in the area of educator diversity really signals to potential partners that those are the things that we really value. So even though charter schools will be allowed to apply for levy dollars, it doesn't mean that they're guaranteed funding.'",
        "'speaker_4': 'And it is my expectation, I think the city council's expectation that deal will be taking our priorities very seriously, seriously in evaluating any applications for funding of public dollars in the space of education. So it is not it is very common for us to invest in nonprofit organizations.'",
        "'speaker_4': 'You know, our Seattle preschool promise I'm sorry, Seattle Preschool program relies on nonprofit agencies that are not public entities to deliver preschool and early learning opportunities. We also have a similar partnership with Seattle school districts in terms of co-locating preschool classrooms with K through 12 rooms.'",
        "'speaker_4': 'And again, I think my expectation and this council's expectation is that we will continue to work. With partners in the area of education that really fundamentally understand and have a strong commitment to race and social justice, equity and to educational justice, and at the same time, with partners who are willing to commit to transparency, accountability, reporting, data'",
        "'speaker_4': 'sharing and also to their workforce. We know that when we invest in our educators and when our educators look like the students they are serving, we do well in terms of reducing the opportunity and achievement gap for our students of color in particular.'",
        "'speaker_4': 'And and I have full faith in deal that they will figure out how to tread the line of complying with the law of the land while also continuing to center our investments on the students who need the most investment in order to be able to succeed in school and and beyond.'",
        "'speaker_4': 'And there is some work that is left to be done through the implementation and evaluation plan. For example, figuring out how to connect students who are graduating from charter schools, figuring out how to connect them to the opportunity of Seattle.'",
        "'speaker_4': 'Promise is something that still needs to be done. Again, those are dollars that go directly to and opportunities that go directly to students. And that's a good example of when I think this council would be supportive in general of making sure that those partnerships exist for purposes of connecting with the actual student and not punishing the student'",
        "'speaker_4': 'for having gone through a charter school process but could still benefit from Seattle promise. And the last thing that I'll say that I learned in terms of Council President's comments around the granular details in this space. One of the things I found most astonishing is when you dig into the demographics of who is attending the three charter'",
        "'speaker_4': 'schools in Seattle, it is a predominantly majority demographic of students, of color, of students and children who are on free and reduced lunch. And I think that's exactly the kind of population we want to be helping in the future.'",
        "'speaker_4': 'So my hope is that we've been able to thread the needle well enough here to be able to comply with state law while at the same time continuing to center our work on the students who need it the most.'",
        "'speaker_4': 'And, and I'm looking forward to continuing to, to do that hard work with deal and with community partners to make sure that we continue to get it right. So with that being said, thank you so much. Really appreciate my colleagues engagement on this, somewhat wonky but very important policy area and really look forward to continuing this work'",
        "'speaker_4': 'in my committee.'",
        "'speaker_0': 'Thank you. Okay. I think we're ready to vote. We're going to vote separately on three different piece of legislation. We'll take the bill. First, please call the role on the passage of Bill. Constable 119480.'",
        "'speaker_2': 'O'Brien I want I make sure I.'",
        "'speaker_4': 'Gonzalez I.'",
        "'speaker_2': 'Herbold, i. Whereas to by president narrow high eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed and show sign it. We're going to vote on resolution 31881. Those in favor of adopting resolution 31881. Please vote i. I those oppose vote no. The motion carries and resolutions adopt and share with Senate and those in favor of adopting resolution 3188 to please vote.'",
        "'speaker_0': 'I. I. There's little work on those eyes. Please, Lord, I. There you go. Now we're now in rhythm. Those vote no. The motion carries a resolution of Adobe and the chair will sign it. Just one moment. I need a just a quick second.'",
        "'speaker_4': 'Can we applaud? Yes, we can. Yay! I was standing between the end and identifying a new colleague. So thank you so much for allowing me an extended period of commentary on this.'",
        "'speaker_0': 'Thank you. Okay. Filibustering and I may have to do that as well. Okay. We will move to the adoption of other resolutions. I don't believe we have any resolutions for introduction. Adoptions will move to other business, which of course is our council vacancy position.'"
    ]
}