{
    "Resolution to Remove U.S. President Donald J. Trump from Office.": [
        "'speaker_0': 'Will the clerk please read item one into the record? Agenda Item one, Resolution 319 85, calling on federal government officials to immediately remove U.S. President Donald J. Trump from office by any means permitted by the U.S. Constitution, including impeachment, for violating his oath of office on January six, 2021, or for committing any other high crimes and misdemeanors'",
        "'speaker_0': '. Thank you, Madam Clerk. I need to adopt resolution 31985. Is there a second? I. Thank you so much has been made and seconded to adopt the resolution. Councilmember Herbold. You are the lead sponsor on this resolution and are recognized in order to address the item.'",
        "'speaker_0': 'And then we can hear from Councilmember Peterson, who I understand is also a co-sponsor of the resolution. But Councilmember Herbold, first.'",
        "'speaker_2': 'Thank you so much. As I mentioned this morning, this resolution was written in conjunction with local progress and is based on a draft article of impeachment from Representative Ilhan Omar. I've learned this morning that our sister city in local progress will Minneapolis will be taking a similar action on Wednesday, and I suspect other cities will follow this'",
        "'speaker_2': 'resolution. The content of it has, of course, been reviewed and approved by the Law Department and the Office of Intergovernmental Relations. This is an updated version that includes changes from Councilman Peterson. Thank you to Councilmember Peterson and your staff for providing valuable input.'",
        "'speaker_2': 'I want to uplift some of the the elements of the resolution. As mentioned, it mirrors the introduced resolution that accompanies the article of impeachment introduced in the House of Representatives, urging Donald Trump with incitement of insurrection in violation of his constitutional oath to faithfully execute the office of the president of the United States.'",
        "'speaker_2': 'It further states that Donald Trump suggested that the Georgia secretary of state should overturn verified Georgia state results of the presidential election, and he repeatedly made false claims that he won the election. This person has used the presidency to incite violence and orchestrate an attempted coup across our country.'",
        "'speaker_2': 'And against our country. This effort has injured and killed law enforcement personnel, menaced members of Congress, the vice president and staff, and interfered with the congressional duty to to inconsistent with the Constitution to certify election results. This person demonstrates with his words and his actions that he will remain a threat to the national security and democracy of'",
        "'speaker_2': 'our country and warrants impeachment and trial removal from office and disqualification to hold any future office in the United States of America. I also want to condemn the possibility of any threat in Olympia and state legislatures across the country.'",
        "'speaker_2': 'As I think we all know, the FBI has warned of armed protests being planned at all 50 state capitals. And as mentioned this morning in council briefings, our thoughts and hopes are with our delegation and the rest of the legislature in fulfilling their obligations to the the the constituents of Washington state, and that they do so in'",
        "'speaker_2': 'in safety and security. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Herbold. I'm going to hand it over to Councilmember Peterson next as one of the other co-sponsors of this resolution and then colleagues, if anyone else would like to make comments, please do let me know by either raising your hands to the camera or using the raise the hand feature in, say, one customer'",
        "'speaker_0': '. Peterson, please.'",
        "'speaker_3': 'Thank you council president and thank you councilmember herb all for your leadership on this. On January 20th, 2017, Donald J. Trump swore an oath of office to preserve, protect and defend the Constitution of the United States. On January six, 2021, the Associated Press reported.'",
        "'speaker_3': 'And we witnessed with our own eyes the shocking video of a violent mob loyal to President Trump storming the U.S. Capitol. Forcing lawmakers into hiding in a stunning attempt to overturn America's presidential election, undercut the nation's democracy, and keep Democrat Joe Biden from replacing Trump in the White House.'",
        "'speaker_3': 'This is as reported by the Associated Press. The rioters were egged on by Trump, who spent weeks forcefully attacking the integrity of the election and had urged his supporters to descend on Washington, D.C., to protest Congress's formal approval of Biden's victory.'",
        "'speaker_3': 'Five Americans are dead. President Trump has violated his oath of office. As someone who has had the honor to work inside those sacred halls of the Capitol building in our nation's capital. I'm eager to join the call for federal government officials to safeguard peace, security and democracy for our nation and its people by immediately removing President Donald'",
        "'speaker_3': 'Trump from office by any means permitted by the U.S. Constitution. And so one of the things we added to this was to basically expand it so that it could be through any means under the U.S. Constitution, in addition to the impeachment articles that are proceeding through the House of Representatives.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. And I do want to thank both you and Councilmember Herbold for getting together offline to coordinate efforts around the proclamation. Both of you had expressed independently interest in pursuing a resolution. And again, I want to thank you for.'",
        "'speaker_3': 'You guys.'",
        "'speaker_0': 'Making it a little easier for us on the council to just do some of that background work, to coordinate and give us one unified resolution to consider. So my my deep appreciation to both you and House members for those.'",
        "'speaker_3': 'Efforts.'",
        "'speaker_0': 'And to your staff, of course. Okay, colleagues, I haven't seen anybody raise their hand using the A Zoom feature, but I just just want to sort of do a quick scan. Again, I think I just saw councilmember sergeant who also wants to make comments.'",
        "'speaker_0': 'And again, if anyone else would like to make a comment on the resolution before I call the roll, please do let me know as soon as possible, because we're.'",
        "'speaker_4': 'Thank you. I'm glad to vote in favor of this resolution supporting the impeachment of Donald Trump. Donald Trump should have been impeached long ago. He should have been impeached for massive corporate tax cuts and handouts, including to his own companies at the expense of vital social services for elderly failing to represent working people, and instead representing the'",
        "'speaker_4': 'billionaire class beginning with himself. He should have been impeached for an utterly criminal approach to the COVID 19 pandemic, which has undoubtedly directly cost tens of thousands of lives. He should have been impeached for caging children. He should have been impeached for sexually assaulting so many women.'",
        "'speaker_4': 'And frankly, it is unfortunate that the establishment of the Democratic Party has done so little to fight his far right agenda over the past four years. Impeachment at this time would be symbolic. I fully support it because we need to make crystal clear that there is no support for this right wing violence.'",
        "'speaker_4': 'But impeachment in the last few days of the Trump presidency are not a substitute for a concerted resistance to his agenda over the last four years, or to building a left alternative to the right wing going forward with mass protests, labor mobilizations and political demands that would genuinely help working class people like the Green New Deal and'",
        "'speaker_4': 'Medicare for All. There could have been grassroots organizing that could have destroyed Trump's legitimacy by promoting a genuine progressive alternative to the corporate establishment and also the right populism. But Trump took advantage of the vacuum on the left and again was able to falsely pretend to be that anti-establishment alternative.'",
        "'speaker_4': 'And on that basis, he won over 74 million votes in the last election and has widespread support, which should alarm anyone serious about fighting the right. Biden won over 81 million votes. He is the first U.S. presidential candidate to have won more than 80 million votes.'",
        "'speaker_4': 'But Trump won over 74 million votes, which is more votes than any other presidential candidate has ever won. With the exception of Biden. We know that all of this will do lasting damage unless we build the left and social movements.'",
        "'speaker_4': 'Wednesday's far right mob in DC, in a violent attempt to overturn a democratic election result, should be understood as a wake up call for the left. Not surprisingly, media the media report there are now warnings of plans for more armed, far right pro-Trump protests at all 50 state capitals and in Washington, DC, in the days leading up'",
        "'speaker_4': 'to Joe Biden's inauguration, stoking fears of more bloodshed. The right will continue to scarily grow as long as there is no alternative to the status quo of corporate politics. But despite their differences, the two parties serve the interests of big business and put the burden of the COVID crisis and brutal recession on ordinary people in Seattle.'",
        "'speaker_4': 'Most immediately, our movement needs to make sure the City Council is accountable to the Black Lives Matter movement, to the working class and all those fighting the right buy and make sure that all council members work correctly today.'",
        "'speaker_4': 'Going to be voting yes on the Impeach Trump resolution should also make sure to pass the strongest possible ordinance on the ban on police use of the so called crowd control weapons. And I wanted to be clear that my office looks forward to working with any and all council members who want to make sure that the best'",
        "'speaker_4': 'and strongest possible ordinance is upheld. And nationally, the best and only way to stop the far right is to build the left and social movements. This is the only way we are going to pull millions of ordinary people away from the right wing's influence by building a powerful fightback for the interest of the working class and where'",
        "'speaker_4': 'actual fascists are in the street, they should be met by a massive show of force led by unions and the left. This week we heard the inspiring announcement of employees at Google forming the Alphabet Workers Union. This is a step in the direction of what is urgently needed the rebuilding of a militant American labor movement.'",
        "'speaker_4': 'We cannot expect Joe Biden or Nancy Pelosi to provide any alternatives. That is why I have endorsed a grassroots Force the Vote campaign, which is demanding that the squad and other movement elected Democrats use a floor vote on Medicare for All as part of a larger strategy to build a fighting movement for socialized medicine.'",
        "'speaker_4': 'Representatives of working people cannot support a corporate tool like Nancy Pelosi continuing as Speaker of the House, while millions face misery as even the squad members have unfortunately done. While I agree Trump should be impeached, this cannot be our main focus.'",
        "'speaker_4': 'The Left has the responsibility to address the urgent needs of the working class, and that means, as a starting point, fighting tooth and nail for Medicare for All. Comprehensive COVID Relief. A Socialist Green New Deal. And preparing the ground to launch a new party.'",
        "'speaker_4': 'This is a critical juncture in history, and we cannot accept a false unity with the corrupt Democratic establishment. But instead, we need to build a powerful unity of millions of working people and the oppressed to fight for a different kind of society.'",
        "'speaker_4': 'The final point I would make is that we need to be clear about what needs to be condemned. I condemn Trump's violence and the right wing bigoted agenda that it serves. I condemn Trump's authoritarianism and his attempt to steal the election.'",
        "'speaker_4': 'A democratic election result. I condemn this con man for posing as a representative of working people while actually being an utterly reactionary representative of the rotten billionaire class. We do have to be careful about using words like, quote unquote sedition and quote unquote treason in a way that can backfire on working people.'",
        "'speaker_4': 'These words have been used by elected officials throughout the nation since Wednesday. These are words that are used overwhelmingly to attack movements of progressives and socialists and the labor movement. In 1919, the great American Socialist Eugene Debs was sentenced to a decade in prison for sedition and was a charge for speaking out against World War One courageously'",
        "'speaker_4': '. That same year, Seattle's Socialist, another strong the last socialist elected in Seattle before me, was part of a movement against World War One. She publicly and courageously stood by the Wobblies or the Industrial Workers of the World and one of their staff members who was then jailed on sedition charges for opposing the war.'",
        "'speaker_4': 'Soon after that, Strong herself was recalled from office and the school board for her association with the Wobblies and those who were courageously opposing World War One. This act of 1940 was created in response to attacks by the far right, but was then used to attack the left and the labor movement.'",
        "'speaker_4': 'Thank you. And I will vote yes on this important resolution.'",
        "'speaker_0': 'Any additional comments about this resolution? Councilmember Lewis, please.'",
        "'speaker_3': 'Thank you, Madam President, I. I wasn't planning on saying anything, but I want to share a couple of brief comments, because I do want to point out that because there's been some speculation in the media of if it's strategically worth it to impeach Trump or what the value of impeaching Trump at this late stages.'",
        "'speaker_3': 'And it's important to note that the Constitution provides that when someone's impeached, they're disqualified from holding that office in the future. President Trump is currently eligible, even having so nakedly violated the trust in his oath to run again and any point in the future in a presidential election or hold other federal offices.'",
        "'speaker_3': 'So this impeachment is more than symbolic. On this important future, it is critical to the future America we want to build. And I do want to share just an observation about some news that I had actually wanted to talk about briefly in briefing.'",
        "'speaker_3': 'But I have forgotten. But I think it is just important to point out that, you know, before we saw the worst of America on Wednesday, we saw the best of America on Tuesday, when the people of Georgia sent.'",
        "'speaker_3': 'The pastor of Ebenezer Baptist Church, the Ministry of Dr. King, Raphael Warnock, and the son of Jewish immigrants, Jon Ossoff, to the Senate, in violation and in condemnation or in condemnation of the divisive politics of President Trump and an explicit rejection of senators who had been running on a campaign of virulent racism and confrontation and the kind'",
        "'speaker_3': 'of divisiveness that Trump has attempted to cultivate and that the Democrats, for the first time in ten years, following on the disastrous results of President Trump just to comment on the news, have unified control of the federal government on policies and platforms in stark contrast to the vision of this country that President Trump has perpetrated.'",
        "'speaker_3': 'And I just want to lift up briefly in a in a limited to to the extent that I can hear that that was only due to incredible effort of normal people in communities and neighborhoods all over this country who were apolitical, who never voted, who were never involved, who were never active, who saw it as their duty'",
        "'speaker_3': 'to get involved, to organize and to push. And it's in no small effort the result of the organizing fair fight Georgia did for voter integrity and security, or Stacey Abrams as a community and movement leader in that state that we have seen these results.'",
        "'speaker_3': 'So I am I am optimistic that the spirit that was present on Tuesday is going to be a guiding force of American politics to come in the future instead of the division and treason that we saw on Wednesday.'",
        "'speaker_3': 'And this resolution gets us closer there by encouraging the Congress to reject and firmly reject this man and this man's politics and to bar him from ever holding this office in the future to bar him from drawing a pension for that office.'",
        "'speaker_3': 'And there are lots of other relevant considerations to taking this action. So I did just want to mention that and state that I will be very enthusiastically voting for this. And I want to thank Councilmember Herbold and Councilmember Peterson for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilmember Lewis, for those comments. Colleagues, any additional comments on the resolution? I do want to give the sponsors of the resolution the last word. To the extent that they have anything else to add, Council Herbold or Casper Peterson.'",
        "'speaker_0': 'Okay. I am receiving visual cues that that that there are no additional comments that either of the sponsors would like to make. So I'm going to go ahead and ask that the clerk please call the role on the adoption of the resolution.'",
        "'speaker_1': 'Herbold. Yes. Suarez, I.'",
        "'speaker_3': 'Lewis Yes.'",
        "'speaker_1': 'Morales s macheda.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Strauss Yes.'",
        "'speaker_1': 'President Gonzalez, I nine in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign. It will please affix my signature to the legislation on my behalf. Other business. Is there any further business to come before the Council? A hearing nun colleagues, this does conclude the items of business on today's agenda.'",
        "'speaker_0': 'Our next regularly scheduled city council meeting is on Tuesday, January 19th, 2021, at 2 p.m.. Of course, Monday is an observed holiday, so our full council meeting, instead of being on Monday in our council briefing, instead of being on Monday, will be on Tuesday, January 19th, 2021 at 2:00.'",
        "'speaker_0': 'So I want to thank you all for your hard work today and hope that you all have a wonderful afternoon and evening. We are adjourned.'"
    ]
}