{
    "City Light Department's Participation in the California Independent System Operator's Energy Imbalance Market.": [
        "'speaker_1': 'The bill passes and the chair will sign it. Please read the report of the Energy and Environment Committee.'",
        "'speaker_3': 'The Report of the Energy Environment Committee Agenda Item one Constable 118 788 related to the City Light Department authorizing department to participate in the call for an independent systems operators, energy and balance market, including authorizing the execution of the necessary agreements with the California Independent System Operator, as well as any additional agreements necessary or convenient for implementation'",
        "'speaker_3': 'and participation. As in California, Dependent Systems Operators Energy and Balance Markets Committee recommends the bill passed as amended.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_4': 'Councilmember Salaam Thank you, brother. This is an ordinance to authorize Seattle to be allowed to explore entering a California energy imbalance market. City Light estimates that it will cost 8 million in infrastructure to join the market and they expect to make 4 to 23 million per year in additional net wholesale revenue once they have entered.'",
        "'speaker_4': 'This could be a good thing for the city, particularly if it allows you to put more of our clean hydropower on the market to replace the natural gas energy generation that, for example, private companies like Puget Sound Energy Use.'",
        "'speaker_4': 'However, it is also important for the Council to have sufficient oversight. After all, the last time City Light was part of an energy imbalance market in California. That was when the Enron debacle happened. To be clear, City Light assures us that they have protections in place to avoid something similar in the future.'",
        "'speaker_4': 'But again, for us as a council, it should be a question of adequate oversight. This got this council bill was amended in committee to allow City Light to explore entering the energy imbalance market while retaining for council the opportunity to take further action before it is finalized.'",
        "'speaker_4': 'The Energy and Environment Committee recommends passing this Council bill as amended, and I just wanted to note that in the written agenda it leaves out the words as amended. But I just want to make sure the council knows that this is as amended.'",
        "'speaker_1': 'Thank you. Councilmember Swan, are there any further comments or questions on this legislation?'",
        "'speaker_3': 'Councilmember Gonzalez I was unable to stay for the ultimate vote in last discussion of this particular council bill, but I have significant concerns about supporting this particular council bill. I think that while the amended version does provide some additional oversight, I think there are a lot of questions in my mind about the amount of money that needs'",
        "'speaker_3': 'to be spent by Seattle City Light just in order to even engage in that exploratory process and have strong reservations about the fiscal implications of moving forward even with the Council bill as amended. My understanding is that the proposal from Seattle City Light would require the spending of several millions of dollars over the next three years just'",
        "'speaker_3': 'to begin the process of entering into the energy imbalance market. So I have concerns about this particular. Bill. And we've had I've had conversations with central staff who have told me that waiting a year to pass this bill would not significantly impact Seattle City Lights ability to consider exploring entering into this energy imbalance market in the future'",
        "'speaker_3': '. So I'm going to be voting no on this council bill today because although the bill, as amended, does create some oversight, I actually think that they need to go back to the drawing board and do some more work before I would be willing to support even an exploratory phase of entering into the energy imbalance market in California'",
        "'speaker_1': '. Thank you. Councilman Gonzales. Councilmember O'Brien.'",
        "'speaker_7': 'Yeah, I. Councilmember Gonzales. I appreciate those concerns. And actually, I share those. The idea that the city council would ensure that the city would invest $8 million on this is a big chunk of money and raises a lot of concerns.'",
        "'speaker_7': 'The amendments, as I understand it, would prevent them from doing any investments and would require them to come back to council to get our approval before they can proceed on entering it. The questions we asked the table were about that, the financial payoff, and also about the risks and making sure the oversight was in place.'",
        "'speaker_7': 'And my understanding with the bill as amended is that they can come back. This this gives them the ability to move forward, to do the research and come back to us. But they cannot proceed in entering the imbalanced market without further approval from the council and making those types of investments.'",
        "'speaker_4': 'Yes, I know. Just very quickly, I won't repeat what Councilman Brown said. I just wanted to say that if you look at the amendments that were presented as part of the amended bill, they're not minor. They actually changed the bill from allowing City Light to do it, to allowing them to explore and then requiring them to come'",
        "'speaker_4': 'back to council.'",
        "'speaker_1': 'Very good. And we can very easily suspend the rules to ask Tony killed off to tell whatever the heck he's telling Councilman Burgess to tell us that we can have a little dialog. But Councilman Gosar, you want to speak?'",
        "'speaker_3': 'Sure. I mean, I again, I'm not saying that the amendments aren't an improvement from the original version of the bill. There certainly is an improvement to the oversight functions that were absent from the original council bill. You know, my my concern is that I heard from central staff and Tony is here and perhaps ready at their at'",
        "'speaker_3': 'the ready when we're when we're ready to hear from him. But my my concern is that they're from my recollection of the presentation is that there were significant upfront costs that would be associated with even standing up an exploratory process of this.'",
        "'speaker_3': 'And this is this is a significant investment. We've never engaged in the imbalance market, an energy imbalance market before. It's a relatively new industry. It's only been around for 2 to 3 years. And so my preference would be that we give ourselves, as a city council, an opportunity to learn more about what this energy imbalance market is'",
        "'speaker_3': 'and to give Seattle City Light a greater opportunity to tell us exactly what the risks are here. And and from the materials that I have reviewed, from the conversations that I've had with central staff. I personally do not feel that I have enough information to truly appreciate the the risks associated with giving Seattle City light the permission'",
        "'speaker_3': 'to move forward with even an exploratory phase. I get nervous about saying it's just an exploratory phase because we still have to invest resources to do that exploration. And then there is created sort of an expectation that we're going to continue to move forward.'",
        "'speaker_3': 'So again, I think the amendments are an improvement, but my preference would be to not move forward with this council bill at this juncture. So I'm going to vote no unless there is interest in in holding it to give the Seattle city light some additional time to get us more information.'",
        "'speaker_1': 'So if there's no objection, I'm going to suspend the rules, allow Mr. Cool off to address the Council and Mr. cut off. Perhaps you could start off with at least one of my concerns is how time sensitive this is and maybe the intended or the actual effect of the amendments in terms of still having a safeguard against'",
        "'speaker_1': 'utility in light of the concerns Councilmember Gonzales has raised.'",
        "'speaker_0': 'Yes, it's it's not time sensitive, other than every with every year that passes City Light and in theory, misses the opportunity to make the additional revenues that it could make by trading in the market in California. And if their analysis is correct, that would be foregone revenue of anywhere from 4 to 20 plus million dollars.'",
        "'speaker_0': 'The amendments that that I put in were specifically to prevent City Light from making any major investments until they had come back to the Council and provided a better understanding of the costs that would ultimately be be borne to enter into the market and also the revenues that they would expect to receive.'",
        "'speaker_0': 'We're expecting if the Council did move forward with this, that our city light would come back to the council early next year, probably by the end of the first quarter, with a more detailed description and analysis and information that would make a the final decision easier for the council.'",
        "'speaker_1': 'Councilman Herbold, thank you.'",
        "'speaker_3': 'The fiscal bill associated with this camp or this fiscal note, especially with this council bill.'",
        "'speaker_2': 'Estimates a annual gross benefit of $4 million a year.'",
        "'speaker_3': 'But Councilmember Gonzales mentioned a cost of the study, and I don't see that the cost noted in the fiscal note.'",
        "'speaker_0': 'The cost. It's not up the study. If city lights were to actually enter the market, it would need to stand up new software and hardware systems to support it. And that's approximately $8 million. It might be as high as ten, but right now the high end of the estimate is $8 million.'",
        "'speaker_0': 'That would be an ongoing cost for for additional staffing at City Light of around about two and a half million dollars a year. That was the caution that led me to recommend the the amendment to the bill that we would not spend the $8 million and we would not engage the additional staff until the council had better'",
        "'speaker_0': 'information.'",
        "'speaker_3': 'Thank you. Especially considering the fact that this information was not contained in the fiscal notice, I.'",
        "'speaker_2': 'Believe is our our policy.'",
        "'speaker_1': 'So when. Possible councilmembers. I'm going I'm sort of heading down the path of holding it for a few weeks, and I don't think the supporters of it have a lot of heartburn over that. But. Councilmember Burgess, go ahead.'",
        "'speaker_0': 'That's what I was going to raise, that if we could have a motion to hold this for a couple of weeks, I would make that motion.'",
        "'speaker_1': 'So I'm looking at October 31st is three weeks. That should give us plenty of time to work on that and a lot if we're doing budget. So I'd.'",
        "'speaker_7': 'Second the.'",
        "'speaker_1': 'Motion. Okay, I'll make a motion to hold it till October 31st has been seconded by Councilman O'Brien. All those in favor of holding it for three weeks. I, I opposed I have to. We'll hold this until October 31st and hopefully talk it council briefing or other opportunities to discuss it.'",
        "'speaker_1': 'Before we move.'",
        "'speaker_0': 'On.'"
    ],
    "Electricity Rates and Conditions for City Light Department for 2017 and 2018.": [
        "'speaker_1': 'Please read the next agenda item into the record.'",
        "'speaker_2': 'Agenda.'",
        "'speaker_3': 'Item to cancel 118802 relating to the rates, terms and conditions for the use and sale of electricity supplied by the City Light Department for 2017 and 18. Amending C.R. Mr. Code Sections 21.40 9.3 or 30.0 40.0. 52.0. 55.0.'",
        "'speaker_3': '47.0. 58.06 60.0. 65.0. 81.0 82.3 85.1 ten. And repealing CMC Section 21.40 9.0 80 in connection with the committee made no recommendation with the divided report with Councilmember O'Brien in favor and council member. So want to.'",
        "'speaker_2': 'Post.'",
        "'speaker_1': 'Can I'll turn to Councilmember O'Brien for this one to present it or have you guys cast member branch like to present the in favor position.'",
        "'speaker_7': 'Actually looks to me typical of the other work.'",
        "'speaker_0': 'That.'",
        "'speaker_4': 'The bill just in general in adopted highlights 2017 2018. Customer rates on average rates are increased in 2017 by this ordinance by 5.6%, which is consistent with the revenue requirements that were laid out in Seattle City Lights strategic plan, which we all voted on.'",
        "'speaker_4': 'But as I've explained several times in the past, I'm opposed to these rate increases because it really divides its costs into rate clauses that result in residential customers paying a significantly higher rate per kilowatt hour than big corporations like Boeing and Nucor Steel.'",
        "'speaker_4': 'I don't think that is right. And what I have recommended in the past, and I continue to recommend that we revisit the way the rate classes are organized and actually eliminate the rate clauses. And in that case, we could have revenue requirements met by a different rate structure in which the increases proportionately go out to big business'",
        "'speaker_4': 'as they do on residential customers. But I've not heard agreement on that from other council members, which is why we had the rate we have the rate ordinance that we have in front of us. So if council members agree with me, then we can vote against it and come up with a different scenario.'",
        "'speaker_4': 'But otherwise I will be voting no on this ordinance.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember O'Brien, for the in favor position.'",
        "'speaker_7': 'Thank you. So as Councilmember Swan said, this does implement the rates generally and consistent with the strategic plan. I share some of the concerns from councilmembers who want about the different rate classes. At the same time, I have not seen a new rate policy that wouldn't have unintended consequences that undermine some of the other policies that are'",
        "'speaker_7': 'really important to me. And so in the interim, I continue to support the existing rate classes and do support the the rate path as outlined in the strategic plan and these rate increases that would achieve that.'",
        "'speaker_1': 'Thank you. Comes from Brian. Any further comments or questions from my colleagues case? Please call the roll on the passage of the bill. I'm sorry, i move to pass council bill 118802 second. Okay. Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Whereas now O'Brien, I so want.'",
        "'speaker_4': 'To.'",
        "'speaker_3': 'Make sure. Burgess Gonzalez I Herbold Johnson, President Harrell.'",
        "'speaker_1': 'High.'",
        "'speaker_3': 'Eight in favor one.'",
        "'speaker_1': 'Opposed the bill passes and the chair will sign it please read agenda item number three.'",
        "'speaker_0': 'So for as.'",
        "'speaker_2': 'I said, nine.'",
        "'speaker_1': 'Seven, nine. What is a nine.'",
        "'speaker_7': 'I know.'",
        "'speaker_1': 'We can't. That is a yes. I'm on the yes side so yeah.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': '77 in favor to opposed. Thank you.'",
        "'speaker_1': 'Thanks for that clarification.'",
        "'speaker_2': 'Old English.'",
        "'speaker_7': 'On back some credibility their.'",
        "'speaker_1': 'Agenda item number three please please read that into the record.'"
    ],
    "Commercial Building Energy Efficiency Goals and Expectations.": [
        "'speaker_2': 'Agenda.'",
        "'speaker_3': 'Item three resolution 31714 reaffirmed Seattle's commitment to the Climate Action Plan and setting expectations for increasing commercial building energy efficiency through the year 2035. The committee recommends the full council drop the resolution as amended.'",
        "'speaker_1': 'Councilmember So what?'",
        "'speaker_4': 'So for this, I would turn it over to guys from Iran.'",
        "'speaker_7': 'Thank you. This bill does a number of things. And I just want to give folks a little bit of background here. Earlier this year, the council passed legislation to require mandatory tune ups in existing buildings of certain sizes.'",
        "'speaker_7': 'And we talk about tune ups. This is making sure that buildings on a go on on a regular basis. And they phased in from the largest buildings to smaller sized commercial buildings. Can we in an update make sure that their mechanical infrastructure has been optimized to minimize the amount of energy that's been used?'",
        "'speaker_7': 'It was a great step forward and folks throughout the community are planning to implement that. And our hope is that by simply going in and making sure that your existing HVAC and lighting equipment is optimized to work as well as possible, we will start to achieve the energy savings that we need to from the building sector to'",
        "'speaker_7': 'be on our trajectory to be carbon neutral by 2050. But it's not there's not certainty around that. And 2050 is going to come sooner than we think. And so what this bill does is it recognizes that plan is in place.'",
        "'speaker_7': 'It calls on the sustainability environment to monitor the results of that, which won't be fully known for another about five years. But if we see that we are not on that trajectory to and the bill defines that to reach carbon neutrality, it would call upon implementing some mandatory requirements for energy upgrades in those buildings at that point'",
        "'speaker_7': 'sometime five or six years out from now.'",
        "'speaker_1': 'Thank you very much, Councilwoman Brainard. Any further comments or questions? Councilmember Herbold.'",
        "'speaker_2': 'Just a question. So the report back that we're asking for is 2022. Can you talk a little bit about what we're.'",
        "'speaker_3': 'Expecting to occur between now and then and whether or.'",
        "'speaker_2': 'Not there will be some report back from O.C. on on that work? It just seems like a long time. Yeah.'",
        "'speaker_7': 'So I don't have it corrected. Sure. Yeah. I don't have the previous resolution in front of me, so I'm going to speak from my recollection here. But there were three essentially tiers of buildings that would phase in from the largest on down to, I think, buildings to 50,000 square feet.'",
        "'speaker_7': 'Those get phased in towards the end of this decade, I believe, 18, 19 and 20. And so for us to monitor what kind of savings we would need a year of full operation under the tune up to compared to the previous year to see if we're on that trajectory.'",
        "'speaker_7': 'And as these phase in thing would take a couple of years for them all to phase in to see if the net effect is going to be enough. And so we will certainly be monitoring those. The reality with with these types of changes is that there's a fair amount of lead time necessary for folks to make it'",
        "'speaker_7': '. And the reason why we're passing this legislation today, even though there is some really long lead times, is to just acknowledge that if we get to a point five years from now, six years from now, and we're not on track, we don't have two or three years to wait to debate, we want to signal immediately that we're'",
        "'speaker_7': 'going to switch to something else.'",
        "'speaker_3': 'But we know that. So for the phase in that's supposed to happen in 2018.'",
        "'speaker_2': 'I understand that the the the results of.'",
        "'speaker_3': 'That phase in will take a couple of years. But but there's no question of whether or not the buildings that are required to phase in in 2018 actually do that. That just happens.'",
        "'speaker_7': 'That's a requirement, though. That's a requirement of both the building size and what the tune up is. The the open question because this was a folks talk about a couple of ways to approach this work. One is requiring that you take certain actions.'",
        "'speaker_7': 'One is the requirement that you achieve certain energy savings. This was the former requiring them to take actions. But the ultimate climate goal we need is to achieve the energy savings. And we we're hoping those match up, but we don't know for certain yet.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Any further comments or questions? All those in favor of adopting the resolution vote i. I. Those oppose vote no. The motion carries the resolution is adopted and the chair will sign it. I think that will conclude our business.'",
        "'speaker_1': 'I did want to tell some of our guests on the council member, where is this proposed legislation on the Arch Highway peer? How are we going to describe it that we'll take that up in the next full council, sign a referral calendar would take that up at full council next week.'",
        "'speaker_1': 'Councilman, where is it? You want to address it? Just something.'",
        "'speaker_2': 'To say.'",
        "'speaker_1': 'Please.'",
        "'speaker_2': 'Could I be excused on December 5th?'",
        "'speaker_1': 'No, you cannot. It's been. It's been moved and seconded, councilmember. Whereas be excused on December 5th. All those in favor of that motion say I. I opposed the ayes have it is any further business to for the council.'",
        "'speaker_4': 'I would just like to say I thought we were going to be addressing further the resolution today about.'",
        "'speaker_2': 'The slice.'",
        "'speaker_4': 'Of the off ramps on ramps that are going to be saved. And I just want to say for my colleagues that I had the pleasure of going out with Keenan BLOCK to go look at it, because when I.'",
        "'speaker_2': 'First heard of it.'",
        "'speaker_4': 'What I heard in my mind was we're going to keep one of those off ramps. And I just couldn't believe that anybody would be recommending that. So knowing Keenan and knowing that he has good ideas, I walked out.'",
        "'speaker_4': 'And what's impressive about it is that if you can imagine slicing off a piece of bread or a piece of meatloaf, that's what we're talking about. It is the end of one space. I was impressed because it's the vines have grown up on it.'",
        "'speaker_4': 'It looks like something that totally would fit in with what you're trying to do down at the arboretum. And so I just wanted all of you who came to know that I appreciate the hard work both 50 years ago and also today to retain something that's important.'",
        "'speaker_4': 'So in case you didn't all come back next week, I just wanted you to know how much.'",
        "'speaker_2': 'I appreciate your work.'",
        "'speaker_1': 'Thank you there, Councilmember Gonzalez.'",
        "'speaker_3': 'I move to be excused on November 28th, December 5th and December 12th.'",
        "'speaker_0': 'Just from second.'",
        "'speaker_1': 'November.'",
        "'speaker_3': 'I'm going to be in Spain.'",
        "'speaker_1': 'December 11th, 2012, five. And what.'",
        "'speaker_3': '11, 28, 12, five and 12, 12 or 12/2?'",
        "'speaker_1': 'It's been moved in second. And that comes from Gonzales be excused from 11, 11, 2812, five and 1212. All those in favor say I, I oppose. The ayes have it. Are they is there any further business, Councilmember O'Brien?'",
        "'speaker_7': 'Well, we're at it. I'll ask to be excused on 1128 also. Where are you? I don't know where we're going to go.'",
        "'speaker_1': 'I'll second that. All those in favor of Councilmember O'Brien being excused for 1128 say I. I oppose the ayes have it any further business? Confer the council.'",
        "'speaker_0': 'Mr. President, I would just point out that November 28 is our backup day to adopt the city budget. So if we don't do it on the day it's scheduled, you'll miss the opportunity. And who knows what we'll do?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'We're going to get it done.'",
        "'speaker_0': 'We're going to get done, which is why the Budget Committee is going to reconvene as soon as we're done.'",
        "'speaker_1': 'As soon as we're done. So we thank you for being here. We will reconvene and budget just in a few moments. Councilman Burgess wants us there in 3 minutes. 3 minutes will stand adjourn.'"
    ]
}