{
    "Collective Bargaining Agreement between the City of Seattle and the Seattle Police Officers Guild.": [
        "'speaker_2': 'The bill passes in the chair assign it please read the first agenda.'",
        "'speaker_3': 'Item three part of the City Council Agenda Item one Council Bill 119 368 related to the city employment authorizing the execution of the collective bargaining agreement between the City of Seattle and Seattle Police Officers Guild to be effective January 1st, 2015 to December 31st, 2020.'",
        "'speaker_3': 'The many Ordinance 25 493 which amended the 2018 budget by increasing appropriations to the Seattle Police Department and.'",
        "'speaker_5': 'The Police Relief.'",
        "'speaker_3': 'And Pension Fund and ratifying confirming certain prior acts all by three fourths vote of the City Council.'",
        "'speaker_2': 'Okay. So this is actually an action that's come out of the Labor Relations Policy Committee, which I chair, but it's a public safety police department matter. And certainly Councilmember Gonzales is the lead there. So, Councilmember Gonzales, we'd like to introduce the matter and speak on it.'",
        "'speaker_5': 'I have one minor amendment to make that came to me from the law department. So I'm going to first put the council bill on the table and then I'll need a second and then we can discuss the amendment, vote on the amendment, and then we'll have a bill amended bill to discuss.'",
        "'speaker_2': 'Okay, so that was your motion.'",
        "'speaker_5': 'I moved to pass Council Bill 11936 8 seconds.'",
        "'speaker_2': 'So just so people understand, this sort of this amendment is being moved in second for the bill to be amended. And Catherine Gonzalez, can you explain that a little bit?'",
        "'speaker_5': 'Yes. So I moved to amend Council Bill 119368 and of Section two by adding the following language, quote, Any portion of the above appropriations shall not lapse at the end of the 2018 fiscal year, but shall automatically carry over into the 2019 fiscal year until fully expended, abandoned or reappropriated closed quote.'",
        "'speaker_5': 'So the effect of this particular amendment is to add language that allows the appropriations represented in Council Bill 119368 to effectively carry over into the 2019 year as opposed to ending on December 31st, 2018. So this was an error in the originally transmitted bill from the mayor's office that we were asked to correct in order to appropriately'",
        "'speaker_5': 'reflect the appropriation actions we are going to take upon vote of Council Bill 119368.'",
        "'speaker_2': 'Thank you. So just to be clear that this is a technical amendment. This is not the controversial piece of it at all. This is a more of a fiscal note. So this is just the amendment. This is not the base legislation.'",
        "'speaker_2': 'So you're just amending it, the technical piece, and you can still reserve your right to vote on the base legislation either way. So any questions about the amendment? Okay. It's been moved in. Second, on all those in favor of the amendment as articulated by Councilmember Gonzales, say I, I oppose the ayes have it.'",
        "'speaker_2': 'The base legislation is amended. And Councilmember Gonzales, you could proceed.'",
        "'speaker_5': 'Thank you. Council Bill 119368. So I wanted to just make some remarks. I would love to be able to sit up here and say that they are brief, but they will not be brief. So buckle up. So before becoming a council member, I was a civil rights attorney for ten years.'",
        "'speaker_5': 'My law practice included many types of cases, but the foundation of my practice was representing people whose civil rights were violated by those in power, including by police officers. Many of my clients were monolingual Spanish speakers, women or people of color.'",
        "'speaker_5': 'I had the honor to advocate for their civil rights as a constitutional lawyer in federal and county courtrooms across the state of Washington, including here in Seattle. But my advocacy for people's civil rights and my commitment to advocate for police reform extended well beyond the courtroom.'",
        "'speaker_5': 'For example, in 2008, I was appointed by then Mayor Greg Nickels to serve on a blue ribbon panel to recommend changes to the city of Seattle's police accountability system. After eight months, the task force recommended almost 30 changes to the police accountability system, many of which needed to be negotiated with the city's police unions.'",
        "'speaker_5': 'Some of those changes were successfully negotiated while others were not. So I understand that disappointment that comes along with not getting everything you want in labor negotiations after advocating for them for so long. My work as a civil rights lawyer was fueled not just by my law degree, but by my lived experiences as a Mexican-American woman growing'",
        "'speaker_5': 'up in central Washington as a migrant farm worker. I have unfortunately personally experienced what it means to not have public confidence in the police. And as recently as this past July, I witnessed one of my own brothers be pulled over and treated unfairly and disrespectfully by my by law enforcement in front of the house I grew up'",
        "'speaker_5': 'in. So for those people that are passing judgment on me for supporting this contract on the basis that I somehow don't get what is at stake here, let me disavow you of that belief. I do get it. Not because I have heard a recent story about police brutality, but because I've seen my own brothers and family members'",
        "'speaker_5': 'experience racial profiling and unconstitutional policing. I have sat in rooms with black and brown families as well, with men who have been stripped of their dignity by a man wearing a police uniform. I've sat in a room holding a woman's hand while she sobbed and cried about being tased and physically assaulted by an officer and then been'",
        "'speaker_5': 'unfairly prosecuted for assaulting that same officer. I've sat in a room listening to a mom or grandmother telling the trauma of having lost her son or grandson after an encounter with an officer. I became a council member to put those lived experiences, my legal experience and my subject matter expertize in the specific area of constitutional policing, police'",
        "'speaker_5': 'reform and accountability to work. And I certainly did not sign up for this job to take a step backwards on police reform. That's why in 2017, I was honored to work with my friends on the Community Police Commission to chart a path forward on passing a belt and suspenders ordinance that would laid out our pie in the'",
        "'speaker_5': 'sky vision for the police accountability system in Seattle. There is no question that our goals were lofty, and along the way we each knew that many aspects of the accountability ordinance that so many of you have cited here in this room today would need to be negotiated in good faith with the Seattle Police Management Association and the'",
        "'speaker_5': 'Seattle Police Officers Guild. Indeed, that is why in section 3.29.510, the accountability ordinance we lay laid out our collective understanding of how and when the accountability ordinance would or could be implemented into effective law. The language of the accountability ordinance clearly provides that the accountability ordinance is in limbo until two things occur.'",
        "'speaker_5': 'One, collective bargaining is completed. And two, the court overseeing the city's compliance with the consent decree reviews the collective bargaining agreement and the ordinance, all to determine compliance with the spirit of the consent decree. The accountability ordinance also clearly provided that until these two things occurred, quote, the current accountability system shall remain in place to the extent'",
        "'speaker_5': 'necessary to remain consistent with provisions of the consent decree in the matter of United States of America versus city of Seattle, close quote. Shortly after passage of the 2017 Accountability Ordinance, the city attorney's office filed our legislation with the federal court seeking approval of it and requesting permission to immediately implement the accountability ordinance.'",
        "'speaker_5': 'The Court, in an order dated September seven, 2017, declined to approve the accountability ordinance, thereby consistent with the accountability ordinance leaving the current accountability system in place. And in that September seven, 2017 order, there were three different areas in that order in which the court not only invited, but in fact ordered the city to submit to the'",
        "'speaker_5': 'accountability ordinance and the collective bargaining agreements. At the end of the collective bargaining process to the court for judicial review. And I'm going to take a moment to read directly from the Court's order on the first on page three, lines three through eight, the Court indicated that the court declines to rule on the entirety of the ordinance'",
        "'speaker_5': 'as it relates to the speedy accountability system at this time, until the collective bargaining process is complete, the court cannot be assured that the ordinance, as it stands today, is a final product. The court declines to rule on a variant of the ordinance, but will await the final version that is ultimately implemented following collective bargaining.'",
        "'speaker_5': 'Also on page three lines 14 through 18, the court stated the court simply declines to place its final imprimatur on what is essentially a work in progress. The court cautions the parties who either are or will be engaged in collective bargaining over provisions of the ordinance that the United States Constitution and the right of the city's citizens'",
        "'speaker_5': 'to have constitutional policing ultimately trumps all other concerns. At issue here and on the final pages, page four, lines eight 311. The court conditionally approves the creation of the Office of Inspector General and also some of the provisions related to the Office of Police Accountability, but cautions that its approval is conditional.'",
        "'speaker_5': 'And states, quote, If these provisions change in any way as a result of the collective bargaining process or otherwise, the parties, meaning the city of Seattle and the Department of Justice, must so inform the court and resubmit the provisions to the court for further review.'",
        "'speaker_5': 'On November 5th, 2018, Judge Ro Bar held a status conference to learn more about the tentative agreement and the city's next steps. It was clear to me during that hearing that Judge Robart had some concerns that aligned with some, but perhaps not all of the Community Police Commission's concerns.'",
        "'speaker_5': 'I also heard him state that he would not that he could not and would not weigh in on those concerns until this city council voted to approve the tentative agreement. Colleagues, I would suggest that it is incumbent upon the city council to now take that step to approve this contract and to petition the court to, with the'",
        "'speaker_5': 'city's guidance, evaluate whether the deal represented in this contract meets the mandates of constitutional policing. I believe that the city's best interest in our ongoing journey of reform is best served by pursuing a legally viable path through the judicial process.'",
        "'speaker_5': 'Some have argued that rejecting the accountability ordinance aspects in this contract and heading back to the negotiating table on those issues is the more viable option. Unfortunately, I disagree with that position. Rejecting this contract will send the parties back to their respective trenches, where each side will begin the process of orchestrating their legal positions and likely litigation'",
        "'speaker_5': 'that will consume whatever reservoir of good faith is left between the parties. And that is unacceptable. Again, I believe that it is now the City Council's turn to approve that tentative agreement, as we did last November with the Seattle Police Management Association.'",
        "'speaker_5': 'This is the next step in what has been a very long journey of progress towards the long term and sustainable police reform, accountability that we all seek. As one of the authors of the Accountability Ordinance. Let me assure you that there is perhaps no one else on this dais that is more vested in protecting the integrity of'",
        "'speaker_5': 'the legislation that the City Council unanimously passed in May of 2017, together with community partners and our former colleague, Tim Burgess. We clocked hundreds of hours and insights and yes, in some cases literally shed tears and sweat to craft this legislation.'",
        "'speaker_5': 'I care deeply about the accountability ordinance and about this city's ongoing and iterative work of constantly reforming the Seattle Police Department. The accountability ordinance, however, is not the Constitution of the United States of America. It is an important piece of legislation that aspires to meet the mandates of constitutional policing.'",
        "'speaker_5': 'It is also an important piece of legislation that, as I've previously discussed, the Federal Court has declined to approve. Intel Collective bargaining with our police unions is final. That moment has come. And on balance, I believe that the contract is a better deal for the city than the contract that expired on December 31st of 2014.'",
        "'speaker_5': 'And today is one of those days where I find myself in the unfortunate position of agreeing with some of the observations made by my friends at the CBC while disagreeing as to others and fundamentally disagree. Disagreeing as to one, the impact of this contract on our ongoing police reform efforts and to the appropriate next steps to take'",
        "'speaker_5': 'to continue making progress on police reform. I believe that friends can remain friends, even in the midst of disagreement on substantive issues. And just because I have come to a different conclusion than the Community Police Commission, that does not mean that I do not have profound respect for their work and role within our accountability system.'",
        "'speaker_5': 'And there have been many remarks made publicly and privately to me about the CPC that I find incredibly troubling. So let me be clear. I believe that the CPC is doing exactly what it should be doing for those, it's not easy to lift up concerns that are not politically expedient for those that question the cpc's legitimacy within'",
        "'speaker_5': 'our accountability system or the depth of their representation of community. I ask you to reevaluate your position. For years, communities that have been disproportionately impacted by unconstitutional or unlawful policing have not had a voice within the morass of government.'",
        "'speaker_5': 'And the CPC was specifically created by the consent decree to address and lift up those concerns of those community members. So accordingly, the CPC has taken its charge under the consent decree seriously and we must continue to support the spirit of what CPC was designed to do.'",
        "'speaker_5': 'Second, I am recommending that my colleagues approve this tentative agreement for three basic reasons. One chief, Carmen Best, who's with us in chambers today, has clearly stated that approval of this contract is necessary to increasing department morale and to her basic ability to hire and retain additional officers.'",
        "'speaker_5': 'The contract brings the compensation we offer to our officers up to a competitive level with cities that we ordinarily compete with for recruits and lateral hires. Currently, Seattle is dead last in this wage comparison. This contract would bring Seattle officers wages to the middle of the pack of the seven comparative cities on the West Coast that historically'",
        "'speaker_5': 'have been used as a benchmark for compensation comparisons. Second City sanctioned public safety service continue to tell us time and time again that virtually every single neighborhood in the city of Seattle believes we need additional officers to effectively deal with neighborhood specific public safety concerns.'",
        "'speaker_5': 'That is an important aspect of the evaluation for this city council in determining whether or not to approve this contract. While I am not satisfied with every term included in this contract, this contract does advance some critical refer reforms to our accountability system that we will lose for years if this contract is not advanced and reviewed by'",
        "'speaker_5': 'the judge overseeing our compliance with the consent decree. So I'm going to spend time on that last point. And while I don't have time to go through every single aspect of the contract that could fairly be characterized as progress, I do want to spend some time to highlight a few that are important to me.'",
        "'speaker_5': 'One, I believe that this contract allows the City of Seattle to increase civilian oversight of the police department in order to strengthen public confidence in our police department. It does this in a few critical ways. It increases the number of civilians in the Office of Police Accountability, which investigates complaints of misconduct lodged against officers.'",
        "'speaker_5': 'Many have criticized that the civilian ization of the Office of Police Accountability doesn't go far enough. But and they cite the accountability ordinance as requiring complete civilian ization. But my reading of the accountability ordinance simply provides that there be a mix of civilian and sworn investigators.'",
        "'speaker_5': 'And this advances us in the direction of increasing the number of civilians within the Office of Police Accountability. Secondly, it legitimizes the entire existence of the of the Office of Inspector General as the third leg of the city's accountability system, with full and unfettered access to information from CPD and OPA.'",
        "'speaker_5': 'Let me say that again. This contract legitimizes the entire existence of the Office of Inspector General for Public Safety, which has the responsibility to do full system wide audits of the Office of Police Accountability and the Seattle Police Department to ensure the health and the fidelity of our police reform efforts as it relates to the consent decree'",
        "'speaker_5': 'and the need to continue to engage in ongoing, sustainable police reform. Without this contract, the Office of Inspector General effectively would sit on a shelf and have no power to do anything. Thirdly, this contract abolishes the disciplinary review board, otherwise known as the Derby, as the third venue for officers to pursue appeals of disciplinary actions.'",
        "'speaker_5': 'In my experience, that is the area in which we saw many disciplinary proceedings be dismissed or be reversed in favor of police officers and in contravention to those filing complaints about this about discipline and excuse me, about misconduct.'",
        "'speaker_5': 'In my view, abolishing the Derby goes a tremendous way towards increasing the public confidence in our disciplinary system. At the Seattle and at the Office of Police Accountability. And lastly, this contract would allow for full implementation of body worn video cameras to be worn by all uniformed officers.'",
        "'speaker_5': 'Body worn video cameras are seen as a tool for improving police services and public confidence, and I believe it is time for us to fully deploy that as a tool. So from my perspective in this thing, we call in a gauci ation.'",
        "'speaker_5': 'It is fair to say that there was an appropriate amount of give and take to balance the needs of bringing wages up to a fair and competitive level and cementing key aspects of the accountability ordinance. The question for us is whether we are willing to forego not just pieces of police reform, but all of it while we'",
        "'speaker_5': 'continue to wade through the legal battles that will ensue if we reject this contract. We cannot throw the baby out with the bathwater. We should not leave aspects of the accountability ordinance that are included in this contract on the table.'",
        "'speaker_5': 'We should take what we've been able to achieve and commit to continuing to work for more, both through the judicial review process and through the impending labor negotiations that are going to come to us very soon and through the various re-openings that are included in this tentative agreement.'",
        "'speaker_5': 'This contract is not perfect, but it is progress and it continues the reform process that we began in 2012. Our labor negotiation process on this contract in particular has been tough. It's been tough on us as management. It's been tough on community.'",
        "'speaker_5': 'And it has been tough on the men and women of the Seattle Police Department who have been working in 2018 under 2014 conditions. But ultimately, we have before us a contract that recognizes the collective bargaining rights of SPARC members under Washington state law, while also prioritizing the need to ensure that the public can continue to have confidence'",
        "'speaker_5': 'in our police officers. And I believe that rejecting this contract now would be a mistake. This being said, I believe that there are aspects of this contract that worry me. This is why I'm advancing a resolution that we will consider after this bill that would request that the city attorney's office petitioned the federal court to review the'",
        "'speaker_5': 'tentative agreement and the accountability ordinance, as he indicated he wanted to do at the recent status conference on November 5th, 2018, and in his September seven, 2017 order in which he declined to approve the Accountability Ordinance pending City Council action on a contract with our police unions.'",
        "'speaker_5': 'I believe that this that that that is the appropriate venue to address concerns about the standard of review when discipline is being appealed by officers adjustments to the 180 day investigation rule and the narrowing of the subpoena powers of the Office of Police Accountability and the Office of Inspector General, as reflected in our original accountability ordinance.'",
        "'speaker_5': 'It will be up to the Federal Court overseeing the consent decree to pass judgment on those aspects of the contract and the accountability ordinance that bump into the consent decree and the Constitution and colleagues. With all of that being said, I.'",
        "'speaker_5': 'I would urge you to join me in voting in favor of ratifying this contract and then saying yes to the resolution. We will discuss shortly.'",
        "'speaker_2': 'Thank you, Councilman Gonzales, for your explanation. I'm sure many of my colleagues will have things to say. I have a few things to say to you, but I'll wait for a moment until I see Councilman Mesquita grabbing that.'",
        "'speaker_2': 'Mike Kaspersky, as you like to say a few words, my comments.'",
        "'speaker_3': 'Thank you, Mr. President. So, as Councilmember Gonzales so eloquently explained.'",
        "'speaker_5': 'Really, we're.'",
        "'speaker_3': 'Being asked to vote on two issues today. First, should we approve the collectively bargain negotiated wages and benefits for workers who've been without a contract for years?'",
        "'speaker_5': 'And what we've heard.'",
        "'speaker_3': 'Today is.'",
        "'speaker_5': 'Unanimous agreement.'",
        "'speaker_3': 'Yes. On the comments that we've heard.'",
        "'speaker_5': 'From people today and the many emails and calls we've received over the last few months, the answer is yes. And it is my commitment that anyone who works for the city.'",
        "'speaker_3': 'And anyone who contracts with the city. Should be paid.'",
        "'speaker_5': 'A fair wage.'",
        "'speaker_3': 'So that we can afford to live in the city that we work. And I will continue to advocate for that in the budget that's coming up in the next week. Second, should police reform long demanded by black and brown communities by the Latino and African-American and the API communities be realized?'",
        "'speaker_5': 'And the answer here is also clear. Yes.'",
        "'speaker_3': 'Today, we are being asked to vote on both of these issues at once. And unlike regular legislation, our options today are limited for amendments that would help clarify the points that Councilmember Gonzalez has just raised. I know that we all agree we need good living wage jobs.'",
        "'speaker_5': 'And we also need to.'",
        "'speaker_3': 'Make sure.'",
        "'speaker_5': 'That there is accountability in the system and that.'",
        "'speaker_3': 'We make improvements centered on racial justice. I deeply respect the collective bargaining process. I also deeply.'",
        "'speaker_5': 'Respect the individuals and the.'",
        "'speaker_3': 'Organizations that have raised questions and concerns. And my hope is that with judicial review by a federal judge, we will be able to.'",
        "'speaker_5': 'Get the answers.'",
        "'speaker_3': 'To the questions that have been raised and.'",
        "'speaker_5': 'Clarity on a path.'",
        "'speaker_3': 'Forward. The resolution that accompanies this collective bargaining agreement makes sure that if the federal judge tells it that there is a violation or a misstep on any aspect of the contract, we will be back at the bargaining table and we will be bargaining in good faith.'",
        "'speaker_2': 'Thank you, Councilman Mesquita. I customer and jobs feel like safety.'",
        "'speaker_0': 'Just briefly, I know that other folks will probably speak for longer about this topic than I, but I just wanted to offer a few thoughts. You know, when the consent decree was signed two years ago, I think that the officers and leadership of MPD have made really great strides towards reform, and I recognize that there are differences'",
        "'speaker_0': 'between the negotiated contract and the accountability ordinance that was passed last year. Those have been outlined very well by my colleagues. I'm looking forward to hearing more from the judge about Judge Robart, about how the new contract affects compliance with the consent decree.'",
        "'speaker_0': 'But fundamentally, I believe that Seattle's police officers work really hard to serve our city and keep our neighborhoods and communities safe. I believe they deserve a living wage. I believe and respect that the city should bargain in good faith, and the collective bargaining process is something that we should respect.'",
        "'speaker_0': 'So I'm looking forward to voting yes on this bill today.'",
        "'speaker_2': 'Thank you. Councilmember Johnson. I'll say a few words since I did chair the LPC and then I'm certainly not meaning to be last. I don't have notes. You guys had notes, so I just sort of keep it real as my kids say, you know, I sort of grew up in a city born here where if you didn't'",
        "'speaker_2': 'believe in accountability and you didn't believe in reform. You are a Uncle Tom. You're a sellout. You. You're lost track. You are. It's one of the worst characteristics you're going to have in the streets that I grew up in, in Seattle in the sixties.'",
        "'speaker_2': 'And I see your signs. We're rolling back reforms. And I heard a lot of testimony to that effect. So what I did was I tried to listen and I dug deep to see exactly what reforms we were rolling back.'",
        "'speaker_2': 'And many of you who testified and said, hey, man, you're rolling back reforms, you are losing police accountability. I say as an attorney, as a person that is committed to my community, that we are not. That if you look specifically at the suggestions that are made, and I'll take them one by one from the subpoena power of'",
        "'speaker_2': 'the inspector general to the clause in the contract that says if there's a conflict between the accountability ordinance and the SPA contract, that this contract will prevail. I'll take that as an example. That does not roll back reforms out of standard contract union language that we there's no clause in there that where there's a contradiction, we are'",
        "'speaker_2': 'rolling back reforms. I'll tell you, my introduction coming out of Garfield High School of dealing with the police officers was very simple. It was testifying in superior court on behalf of Pastor Witherspoon from Mount Calvary Church against his brother, looking at an officer.'",
        "'speaker_2': 'And basically the officer gave testimony one way, I gave testimony another. And I realized right there that. Let me just put it this way. There was a lack of trust in that situation because I know exactly what I saw and it was different from what the officer saw.'",
        "'speaker_2': 'So when I. Tell you at the ripe age and how old I am is none of your business. But at my ripe age that we are committed to reform. We are and it is in this contract. So if you go through each one of these these clauses where we're saying that not one person said, how in the'",
        "'speaker_2': 'hell we're rolling back reforms, that one person said that they just repeated this rumor. And I got to tell you, rumors usually have more wings than a truth. So if you go back to the first one, it says and by the way, KUOW did a very nice piece on looking at the highest criticisms, the first one about'",
        "'speaker_2': 'the contractual language, about if the SPARK contract, there could be a clause where the spot contract could supersede the accountability. What clause is that? Where are we losing what we fought for? In fact, if you remember, in 2017, we passed a racial bias law.'",
        "'speaker_2': 'We gave private people a right to sue the city, one in a few cities in this country that allowed citizens to sue for racial bias policing. One of the concerns I had is who gets stopped by the police.'",
        "'speaker_2': 'I want to see that demographic. Because I could tell you experiences about that demographic. So we are required the department is required to keep those demographics such that attorneys can look at that and see if they do see a pattern.'",
        "'speaker_2': 'Who said, who are these folks that seem to get more Terry Stotts than others? Okay, so you go back through the data and like I said, I could go through each one. This notion of somehow the. The investigation on bad offices is thwarted.'",
        "'speaker_2': 'We are giving the inspector general a position. We created unfettered access to these files and we are staffing that through our budget. We are giving them more resources to do their job. And if you look at who the inspector general is hiring for these positions, these people are not sellouts.'",
        "'speaker_2': 'Let me tell you, these people are committed to protecting the rights of people who routinely and historically have gotten the bad end of the deal on policing. So don't tell me we're rolling back reforms. That is an insult.'",
        "'speaker_2': 'I understand what the CPC is. I understand where your hearts are. But trust it. When we go through this thick binder. We're going through it to make sure we get the reform to protect our community. That's what we do.'",
        "'speaker_2': 'So when I hear that, I understand and many of you are my friends are my good friends. And there's an old saying that fake friends believe in rumors and real friends believe in you. And I will vote for this contract.'",
        "'speaker_2': 'And I will say that we have not rolled back any reforms. And today, tomorrow and the next day, I'll protect my kids and my grandkids for misconduct from the police. And one last thing about the police. I believe in leadership.'",
        "'speaker_2': 'You change the culture by changing some of the people. I believe in Chief best. I believe in Andrew Meyer Burge as an inspector general. I believe in as a as an opiate director. I believe in at least a judge.'",
        "'speaker_2': 'I believe we are changing people to change the culture. And there have been times where I have mistrusted officers and there's been times where I've relied on officers to protect me and my family. And I believe we are achieving both in this contract and I make no excuses about supporting this contract.'",
        "'speaker_2': 'I will support it. I'll say whatever I have to say when I vote for, because I think it's a darn good contract both to achieve accountability. And to protect the people that needs to be protected in this city.'",
        "'speaker_2': 'I yield the floor. Council members sworn you had the floor, man for you.'",
        "'speaker_1': 'When do you get to go?'",
        "'speaker_2': 'And my blood pressure high up in here.'",
        "'speaker_6': 'I will be voting no on this proposed contract between Seattle police and the city of Seattle, which I cannot support in its current form. I am a rank and file member of a public sector union. I want to be clear that I support the right of all public sector workers to negotiate raises, including the police.'",
        "'speaker_6': 'Though it is deeply unfortunate that few public sector workers get raises as substantial as these, including EMT. I also want to be clear that I support the right of the police to their union and to collectively bargain. However, I am completely opposed to the serious and unacceptable rollback of police accountability measures in this contract.'",
        "'speaker_6': 'I do not share the view of the establishment that the accountability measures passed in last year's ordinance were, quote unquote, landmark legislation, because I believe that they did not go nearly far enough, but they were extremely important and they were hard fought by years of activism, by working people, especially led by communities of color like the black'",
        "'speaker_6': 'and brown communities and the indigenous community. And now this proposed contract between the city and Bog would dramatically undermine even those steps forward, unanimously approved last year by the same city council. As I have said before, it is my view that the Seattle police have had a long record of police brutality and racial bias and that this'",
        "'speaker_6': 'is an ongoing problem. This is also a nationwide problem and in reality is part and parcel of the capitalist system which relies on structural racism and inequality. Council president. Carol, I think it is disrespectful for you to say that community members are going by rumors in the last week.'",
        "'speaker_6': 'More than two dozen community groups have come forward to oppose this rollback of police accountability, including the Seattle King County and ACP, the Church Council of Greater Seattle. One America. Casa Latina. Not this time. El Centro de la Raza.'",
        "'speaker_6': 'The Northwest Immigration Rights Immigrant Rights Project. The American Civil Liberties Union. Creative Justice. Africa Down. Models for Police Accountability, Asian Counseling and Referral Service. Latino Civic Alliance. Real Change. See more. And last but not least, the experts on this issue, the Community Police Commission, who unanimously voted to reject the contract.'",
        "'speaker_6': 'I joined these groups, along with more than 40 of my fellow union members who have signed a statement opposing this contract in its current form and calling for it to be renegotiated with all police accountability measures restored. The labor movement has a proud history of standing with working people facing racism and oppression in its best traditions.'",
        "'speaker_6': 'The labor movement has fought against how the ruling class uses the police to oppress and divide sections of the working class against black and brown workers in particular, but also against the community homeless community members, impoverished people, and against protest and picket lines.'",
        "'speaker_6': 'Also, as Naomi Finkelstein said in public comment, an injury to one is an injury to all. It is with this proud tradition and with my fellow union members in Seattle who are opposing this contract in its current form that I stand in calling for the contract to be renegotiated and all police accountability measures restored.'",
        "'speaker_6': 'Our statement from the union members says, quote, The right of community members, as enshrined in the 2017 law, are not bargaining chips to be traded away, unquote. In 2011, public sector workers in Madison carried out a courageous occupation of the Capitol building and met in Madison to prevent rightwing Republican Governor Scott Walker from ramming through legislation to'",
        "'speaker_6': 'strip all public workers except police and firefighters of their right to collective bargaining. Hundreds of thousands of people at that time occupied the Capitol. Enough teachers and students called in sick that many schools were forced to close during the protests, and there was even widespread discussion of a general strike among public sector workers.'",
        "'speaker_6': 'Of course, I am greatly happy to say that Scott Walker will no longer be Governor Walker, but. At that time, as always happens when there are strong progressive movements. The police forces were mobilized to attempt to quell the protests.'",
        "'speaker_6': 'However, we also saw many of the individual rank and file officers had personal or political sympathy for the other public sector workers who were protesting with signs reading cops for Labor. Some of them even marched with other protesters.'",
        "'speaker_6': 'Police were given orders to guard the doors of the Capitol building and while they did, stationed themselves there as ordered, many did not obey their superiors orders to physically stop the public sector union members from entering. Unfortunately, this break in the chain of command out of sympathy with fellow workers is not usually the case with the police'",
        "'speaker_6': '. But on that day it was for many on the left. The police are the force that physically stops you from exercising your free speech rights. The force that defends the interests of billionaires and those in power against everyone else.'",
        "'speaker_6': 'And the reality is, that is how big business and corporate politicians use police forces around the world. Workers are arrested if they steal $10 out of desperation or poverty. But when bosses are, banks steal billions from workers, they are rarely held to account.'",
        "'speaker_6': 'When mass movements break out and big business and the political establishment attempt to use the police to put down the movement. Police officers connection to the labor movement to their unions can sometimes be the difference between the violent suppression of the movement and an uncommitted police response like in Wisconsin.'",
        "'speaker_6': 'I raised these examples to explain that if this police contract was fundamentally a labor issue, if it was fundamentally only about wages and benefits and working conditions that do not infringe on the rights of other workers, then it would be my position as a socialist and union member to vote yes.'",
        "'speaker_6': 'However, what this contract in its current form, I feel this is clearly and fundamentally an issue of police accountability. It is working people who are the most impacted by crime and a lack of public safety. Well, there is no doubt that the police frequently play a useful role in apprehending violent people and preventing violent attacks.'",
        "'speaker_6': 'It is also, unfortunately, the case that the police are too often a source of harassment and at worst, terror among particularly communities of color, homeless community members and poor people. I do not agree with the union representative who said that these are outside groups that are trying to influence the police contract.'",
        "'speaker_6': 'What about our own union members who are black and brown? While we do not believe that all police officers behave the same way? There are far too many examples and far too systematic a record of people being wrongfully arrested.'",
        "'speaker_6': 'There have been far too many people of color who were killed for no reason at all. Like Charlene, who lives in Seattle, an elderly black man, William Wingate, was arrested walking with a golf club. And then after it was proved that it was racially biased policing, the officer faced no disciplinary penalty because a 180 day investigation window'",
        "'speaker_6': 'was closed. Such abuses must stop. When the details of this contract were released to the public, it was met with unanimous opposition from the members of the Community Police Commission and later a letter of opposition from the 24 organizations that some of whom I mentioned, which represent tens of thousands of workers who are concerned that this contract'",
        "'speaker_6': 'would harm their human rights. Today this morning, we saw the ACP, not this time. Nikita Oliver and others say loud and clear that the black community and others facing the brunt of police brutality strongly reject this contract. That is not a labor issue.'",
        "'speaker_6': 'It's a police accountability issue. Other council members have argued that the accountability changes in the contract are inconsequential or somehow even positive. This is appallingly dishonest and inaccurate. What are some of the specifics of why so many have objected to this contract?'",
        "'speaker_6': 'And I'm guided here by the CBC's expert recommendation, not rumors. First, the proposed contract states that in any conflict between the accountability laws and the language of the contract, the contract language takes precedence. If, as the mayor and some council members have claimed, this contract does not reverse important accountability measures.'",
        "'speaker_6': 'Then why was this this clause deemed necessary in the first place? Next, the contract language reintroduces the 180 day accountability loophole that dubs officers Cynthia writ large from facing consequences for the racist arrest of William Wingate for walking with a golf club.'",
        "'speaker_6': 'That is an illustrative example because it also points to another problem. That is, the language also hampers the ability to investigate reports of police brutality, racially biased policing, etc. It puts extreme limitations on civilian investigators. Again, the SBT will be investigating.'",
        "'speaker_6': 'The SBT and the rest of society is just expected to accept that they are policing themselves fairly. It prohibits. It prohibits accountability in investigations from coordinating with criminal investigations into the same incident. It removes some of the subpoena powers of the investigators, meaning that investigators again need to rely on the information that is volunteered.'",
        "'speaker_6': 'In other words, this contract reverses many of the hard won and yet limited police accountability reforms to defend the rights and in some cases, the actual lives of regular people in Seattle. This is completely unacceptable. Even Judge Roberts, in reviewing this contract, has questioned the city's contention that the contract is consistent with a consent decree, saying he'",
        "'speaker_6': 'doesn't believe that to be, quote unquote, accurate. He also responded sharply to the addition of what he called a quote unquote bribe to pay officers for wearing body cameras when in fact, they have already been ordered to do so in the context of the 2012 Department of Justice consent decree.'",
        "'speaker_6': 'I have stated as I have done so right now and in the past, that the accountability bill passed last year is not sufficient to create genuine accountability, to end discrimination and violence from the sort from the forces that are given the immense power over life and death that the officers are given.'",
        "'speaker_6': 'Really, we need to go much further in passing serious reforms. We need an elected community oversight board with full powers to hold police accountable, including the right to subpoena. This would also include the right of police to have union representative if being interviewed or disciplined.'",
        "'speaker_6': 'In this contract, we can see that when police negotiate with the political establishment, there is no one in the room that cares about how police officers impact communities of color and other working class people. This blog is advocating for their members, but the political establishment is mainly interested in maintaining the police as a force to reliably defend'",
        "'speaker_6': 'their power. What elected officials here is defending the rights of Sharlene Elias. Winning real change and serious police accountability measures will require that we all those of us who care about our members of the community, who are impacted by police brutality and racial profiling that we all together join to bring a stronger build a stronger and broader'",
        "'speaker_6': 'movement. As I've said so, for the last five years, social movements and class struggle are how change will be won in Seattle, not by putting any confidence in this city's Democratic Party led political establishment. We can take, as an example the inspiring block the Vanguard movement right here in Seattle, which forced this establishment very much against its'",
        "'speaker_6': 'will to halt the construction of what would have been the most expensive police station in the nation. While the city languished and still languishes in a deep housing affordability crisis that are gentrifying the working class and communities of color out of the city.'",
        "'speaker_6': 'This housing crisis is a central part of the deep and growing inequality in the city deep inequality, which is itself at the root of crime and public safety problems. We can also take as an example the movement that demanded and finally won justice for Laquan McDonald in Chicago, but doing more far reaching and urgently needed reforms.'",
        "'speaker_6': 'We will need a far stronger movement that brings together different sections of the working class and the labor movement, together with the oppressed, to fight together. I want to be clear. I support the wages and benefits negotiated in this contract, and if they were proposed without reversing any of the city's accountability legislation, I would be voting yes'",
        "'speaker_6': '. For people who consider this fundamentally a labor issue. I would ask you to also consider the rights of other union members and working people in Seattle when they are negatively impacted by the police force. Think about your fellow union members who are stopped by the police simply for driving while black.'",
        "'speaker_6': 'I have read in the news that some have said that voting against this contract would lose me their support in the next election. However, at the end of the day, I am not a career politician. I am here to fight for all those who are left out in the corporate politics of City Hall and its backroom deals'",
        "'speaker_6': '. If I wasn't going to consistently stand up for working people and oppressed communities, there would be no point in my being here. In closing, I also want to point out that the upcoming resolution that council members are claiming is somehow some sort of evidence that this police accountability will be upheld.'",
        "'speaker_6': 'I just want to let you know, I will have my comments later. But that does not the resolution does not address anything. I would hope that council members would today send this contract back to the mayor and the Labor Relations Policy Committee to restore all accountability measures and bring back a new version that the movement and I'",
        "'speaker_6': 'can support, one that does not increase the discrimination people face everyday or the danger of military mistreatment at the hands of the Seattle police. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Stewart.'",
        "'speaker_2': 'Councilmember. Councilmember O'Brien. You have the floor, sir.'",
        "'speaker_1': 'Thank you. I want to thank all the folks who came out to testify today. I really appreciate hearing passionate. Dedicated testimony on two different sides of an issue, but in a respectful way of the whole system. We what I heard today broadly was agreement in the room that we want to see.'",
        "'speaker_1': 'Fair wages for our public servants and their right to collective bargaining. And I also heard a commitment that we want to see police accountability. Unfortunately, it feels like the vote today has made those two mutually exclusive, but I do not believe that they are mutually exclusive.'",
        "'speaker_1': 'I do believe the reality of what we're facing today is particularly challenging and is one of the public commenters said it's an unfortunate place we're in where it feels like we have to pick between those two. I am 100% dedicated to making sure that all workers have the right to collectively bargain and that certainly public servants have'",
        "'speaker_1': 'a right to a fair and living wage. I also am 100% committed to the police reform work that's necessary. The decision before us today with the contract we have could go further. I think it could be a better document.'",
        "'speaker_1': 'But I'm going to support and vote yes on this today. I think that when I look at the options that are going to play out before us and the options I have by voting yes or no, I believe the best path forward to getting the reform we want is a yes vote on this contract.'",
        "'speaker_1': 'I know that the contract is not as strong as the legislation we passed earlier this year. That legislation that we passed was a unilateral decision by this council, as opposed to a bilateral negotiation. And the idea that we would get everything we wanted in that legislation in the contract.'",
        "'speaker_1': 'That would be ideal. But it's maybe not the reality that we could do. I think that when I look at the contract and what's in there, there are some good things that will allow us to move forward and improve police accountability.'",
        "'speaker_1': 'There are some things that folks have raised questions about that may prove to be challenges or they may not be. We're going have to look at those. And there are probably also components of this legislation that we have not focused on much.'",
        "'speaker_1': 'And yet when we move forward, we'll find them to be challenges that need to be worked on. The reality is that police accountability work is an ongoing exercise, that we're going to continually be moving in the right direction.'",
        "'speaker_1': 'And I believe what we have today and the choices before us that the most prudent thing to do is move forward. Council President Harrell, you spoke a little bit about your experience growing up in the city and I was also born and raised here.'",
        "'speaker_1': 'But my experiences are very different. My interaction with the police are very different, and that's largely because I'm white. And I think as we move forward on police accountability, it's critically important that we center race and thinking about how police accountability works.'",
        "'speaker_1': 'Unfortunately, the color of your skin is a huge predictor about getting involved in the criminal justice system today, and it shouldn't be that way in our city and our country today. And yet it is the reality. I'm proud of what's in this contract.'",
        "'speaker_1': 'Many aspects of it. I'm also disappointed that we weren't able to go further here. But I think what's going to be necessary, the next step is to live with this and learn from it and be ready to continue to revise it and move forward going forward.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilmember Brown. Councilmember Herbold, I believe you have the floor.'",
        "'speaker_5': 'So to start off, I just want to make note so I don't forget that I'll be making a motion after consideration of this legislation and after Councilmember Gonzalez's resolution to move the clerk file that I mentioned earlier in that relates specifically to some needed transparency about the documents referenced in this contract.'",
        "'speaker_5': 'I want to vote for a contract way to raise officers wages and pay them their four years of fairly negotiated back pay. I also want to defend all of the reforms contained in the historic ordinance the Council passed in 2017.'",
        "'speaker_5': 'Many of these reforms are outside of the consent decree, but that doesn't make them any less important to me. 1300 Seattle police officers, detectives and sergeants provide critical public safety services to the residents of the city of Seattle, and they've done so without a labor contract since January 2015.'",
        "'speaker_5': 'Officers have implemented police reform. The Federal Monitor's report on use of force from 2017 said. At the same time, the force that MPD officers do use is by and large reasonable, necessary, proportional and consistent with the department's use of force policy.'",
        "'speaker_5': 'Credit for this major milestone goes first and foremost to the men and women of the Seattle Police Department. I've also heard very compelling principles from Labor about the importance of preserving the sanctity of bargaining in a post Janis reality.'",
        "'speaker_5': 'The Janis decision has put public sector unions in a challenging position, so they need to show that they can be effective in representing their members. The bargaining process is paramount as unions face a nationwide struggle in the wake of a Janis decision.'",
        "'speaker_5': 'We've heard strong critiques of this agreement from the Community Police Commission and from a number of community leaders, some of the same leaders whose original complaint to the DOJ in 2010 led to the DOJ's findings in 2011 and the consent decree in 2012.'",
        "'speaker_5': 'I've heard a lot of reassurance that reform is a result of incremental change. And to be really honest, I find that reassurance, really cold comfort. I was working on the council in 1999 when the OPA was created. I'm really well familiar with the incremental reform that we've eked out since that time, and I don't feel that incremental'",
        "'speaker_5': 'form is acceptable for policing today because I feel we need transformational reform. The public believes in the need for transformational reform with a statewide passage of i. I. 940 lives lost here and nationally proven that we in Seattle need to pave the way here and not incrementally.'",
        "'speaker_5': 'I believe we in Seattle need to pave the way for the nation because we have a president that in 2017 told officers, when you guys put somebody in the car and you're protecting their head, you know, like don't hit their head and they just killed somebody.'",
        "'speaker_5': 'I say you can take the hand away. Okay. We need to pave the way, like we said we were going to do when we passed legislation in 2017 that was heralded by this council as historic, that was unprecedented in other cities.'",
        "'speaker_5': 'So acknowledging this urgency in 2013, the Community Police Commission was formed by agreement between the City of Seattle and the Obama Justice Department, nod to Mayor Durkan and asked to inventory the accountability system, which had been incrementally revised over 14 years and to propose a complete revamp.'",
        "'speaker_5': 'This work was co-led by ideologically diverse participation from the downtown Seattle Association director Kate Junkie's Spark, then vice president Kevin Stuckey and Mothers for Police Accountability founder Harriet Walden. The proposals that the CPC had drafted before the last contract expired in 2014.'",
        "'speaker_5': 'In order to be available to the city for bargaining without constituting an you LP were put forward in the midst of a major scandal, as a large number of disciplinary findings were reversed contrary by SPD leadership, contrary to OPA recommendations in 2014 and at the high watermark of the Black Lives Matter movement, this law was not created'",
        "'speaker_5': 'upon ideology. Every sentence of the 71 place page plus page ordinance was crafted with the experience of 18 years of experience with the OPA. We have today. Each sentence addresses cases that were overturned or on sustained and identified by our auditor or community leaders as justice not served.'",
        "'speaker_5': 'But that could, in the future, with reform, be fixed. The changes and appeal process were made in the ordinance because of a group of disciplinary findings revealed to be overturned on appeal in a deal by CPD management contrary to OPA recommendations.'",
        "'speaker_5': 'The changes in the 180 day timeline were recommended because of a high profile case mentioned earlier today by my colleagues in which an officer who was fired by Chief O'Toole for bias and making an unlawful arrest was given backpay and allowed to resign in lieu of termination because the 180 day limit made her termination vulnerable to being'",
        "'speaker_5': 'overturned on appeal. And also because OPA faced repeated challenges in competing completing quality investigations due to the time limit. The prohibition on using unpaid leave to serve suspensions came after repeated public frustration at the idea of officers who had been found to have committed serious abuses being paid to sit at home.'",
        "'speaker_5': 'These are all specific, necessary changes resulting from actual cases that will not be made with passage of this contract. I think it's really important for us to recognize this. You know, don't clap. I'm sorry. I'm going to be letting you down.'",
        "'speaker_5': 'But I want I want this all to be on the record because it's really important to me, because I believe that we should not miss the chance to do what happened at the state level last January when backers of Initiative 940, knowing that they were overwhelmingly likely to win at the polls, still chose to sit down with'",
        "'speaker_5': 'statewide law enforcement leaders and find language that police groups found more palatable than the original version of I-94. That process of finding a win win Third Way actually built lasting relationships of trust, that foster harmony between police and community.'",
        "'speaker_5': 'And I hoped that we could do the same here locally by by choosing another approach rather than forcing through the contract that is before us. Based on the requests from the CPC and the 24 community organizations writing to council last week.'",
        "'speaker_5': 'I was very interested in proposing today a one week delay on voting on the contract and immediately moving next week to pass a separate piece of legislation. A proper appropriating spouse. Three years of backpay of $65 million with a request that Spag and the Executive bring back a contract in December and one in less than one month'",
        "'speaker_5': '. With all of the points of agreement in that contract, including Spock's economic package, a back pay and raises body cameras and other points of agreement, such as the authority of the new OIG with a re opener for only the identified items of agreement.'",
        "'speaker_5': 'Was this a viable path? Officers would be paid their new wages begin to receive their 6065 million in three years of three years back pay beginning in January. That approach was intended by me to ensure that this Council expressed today a good faith to SPOHN, that this Council would support passage within a month of a contract with'",
        "'speaker_5': 'their wages in their back pay. Even without agreement on reform elements and with a desire to bargain those reform elements, however long it took without exerting the leverage held by management around wages. Yet good intentions aside, I understand that the Council unilaterally expressing an interest via legislation and doing what the Union, what Spargo or any other union'",
        "'speaker_5': 'wants outside of bargaining flies in the face of what unions are for. If the Council stated, as a matter of course started saying, Yeah, we'll pay you what you want, you don't have to bargain it. Unions would have a more difficult time demonstrating their worth to their members.'",
        "'speaker_5': 'This approach and this affects all unions and that the city bargains with this approach that I would have liked to pursue has been explained to me to be in violation of those very principles that I referred and referenced earlier as so important to a post Janice world.'",
        "'speaker_5': 'For this reason, what I had hoped was a win win proposition is actually not a viable path forward. I also proposed an amendment this morning that would move the ordinance effective date to sometime after the Federal Court has ruled on whether the elements identified in Councilmember Gonzalez.'",
        "'speaker_5': 'This resolution, which we hear about later, conflicted with the consent decree. Upon light advice of legal counsel, I'm not moving that amendment forward. So I'm left with a difficult decision where there's no clear path forward to vote for a contract, to both raise officers wages and pay them their back pay and guarantee our ability to defend all'",
        "'speaker_5': 'of the reforms contained in the historic ordinance the Council passed in 2017. And so since there's no path forward to do, both of those things are to work even towards both of those things, recognizing that we wouldn't necessarily get all the reforms in the ordinance.'",
        "'speaker_5': 'I have to actually weigh the relative value of what reforms this contract does guarantee with my desire to vote in favor of the economic terms of the contract. So to help me make that decision, I turn to the three legged civilian accountability system that has been created in part to guide our policymaking around issues of accountability.'",
        "'speaker_5': 'We've heard and discussed a lot the KPCC's view of this contract, and I value and deeply respect their experience and expertize that they carry on these issues generally. And the 2017 Accountability Ordinance specifically, Councilmember Gonzales requested that each the OPA director and the Inspector General on the contract requested their input on the contracts ability.'",
        "'speaker_5': 'On the contracts impact on their ability to do their job. So I appreciate that I have their perspective to consider in this balancing act. The EPA director has said there were improvements included in this agreement, the elimination of the Disciplinary Review Board, which included a SPA member civilian association of two OPA inspectors, changing the triggering event for'",
        "'speaker_5': 'the start of the 180 day clock, simplifying classification notifications, adding flexibility around OPA transcription, due dates and initial complaint notification around timing requirements and finally implementing a rapid adjudication pilot pilot. These also, much like I identified the reforms that aren't moving forward.'",
        "'speaker_5': 'These also are actual things. They're actual things that have arisen as needs for change to our accountabilities accountability system because of justice. That was not done in other cases. But I have to say, those identified improvements against his concerns that expressed that reservations around elements of the agreement that deviate from the accountability ordinance, such as his concern'",
        "'speaker_5': 'that we we're limiting the EPA's authority to coordinate criminal investigations. His concern that we were placing screen constraints on options, ability to allocate staffing and resources as it sees fit, and further complications around the 180 day timeline. Even as we we we remove some complications in one area, we are adding additional complexity around the 180 day timeline'",
        "'speaker_5': 'that are actually more restrictive in the SPA contract that then are in the SPM contract. The Inspector General similarly noted that the agreement legitimizes the Inspector General's authority within the labor structure and solidified the ability to function effectively.'",
        "'speaker_5': 'But again, I have to weigh those identified improvements against her stated concern that expressed reservations about elements of the agreement compared to the accountability legislation regarding access to information, in particular restriction of subpoena power, and the standard burden of proof about which Judge Robert has also raised concerns.'",
        "'speaker_5': 'She also identified issues around the ADA calculation and changes in finding or discipline. Neither the EPA director nor the Office of Inspector General has said that they can't do their job with this contract, but they do not dispute the CPC observation that on some very key points the contract would actually set us back as compared to what'",
        "'speaker_5': 'was promised in our Historic Accountability Ordinance passed in 2017. So I'm left with the impression that OPA and OIG are looking at this contract as it relates specifically to accountability as a glass half full, not half empty. Secondly, I have expressed over and over again to my constituents who write to me daily about public safety, that I'",
        "'speaker_5': 'support the speedy hiring plan that seeks to add additional officers. And I feel today that if I were to vote no, I don't know how I could say with a straight face to my constituents. Understanding how dire the recruiting picture is for CPD right now.'",
        "'speaker_5': 'I don't know if how I could say with a straight face that I support adding to the size of our police department because recruiting is so necessary to hire both for separations related to lateral hires and retirement, as well as to add to the size of the force.'",
        "'speaker_5': 'Maybe many in our labor community have promised us today that they're in this for the long haul, in the long haul for labor conditions for our workforce, but also in the long haul for law enforcement oversight. And I'm really going to count on that, and I look forward to working with everybody in this room, including having the'",
        "'speaker_5': 'leadership of labor moving forward in the contract negotiations that will begin with the reopenings in this contract and then later in negotiations for a new contract in 2020. And I just want to, in closing, say I really appreciate that so many of the folks who are before us today who have been actually urging us to vote no'",
        "'speaker_5': ', have also said that they support our acting today to approve increased wages. Unfortunately, I feel like the negotiation process at this juncture does allow us to do both. It only allows us to act on the shared value as it relates to the economic package.'",
        "'speaker_5': 'It doesn't allow us to continue to work on the identified shortcomings, on the accountability. So consequently, I regretfully intend to vote yes today.'",
        "'speaker_2': 'Thank you. Herbold I think we've heard from most. I will say that every now and then, facts do matter. We've had 285 officers, police officers go through crisis intervention training and de-escalation training and and anti-bias training, all who have left the department.'",
        "'speaker_2': 'And we do concern ourselves with the department we were trying to build. I'd also say that the criticisms about the 180 disciplined timeline that seem to stimulate some applause because it seemed as though we didn't do anything, we actually improved that.'",
        "'speaker_2': 'The Wingate matter that Councilmember Swan mentioned.'",
        "'speaker_5': 'And others.'",
        "'speaker_2': 'I know very well, because he goes to my church and he's in my day right out in my office right after that unfortunate incident happened. We actually if there's material new evidence, it can trigger that day. So we did look at that and last I'd say that the OPI directors.'",
        "'speaker_2': 'Ability to, quote unquote, coordinate a criminal investigation that apparently we lost. The intent of that provision always to make sure that the director is not in the dark, that he or she knows what's going on in there. And so we look very closely at that and made sure that he continues or whoever is in that position continues'",
        "'speaker_2': 'to be in the loop. They can't affect the outcome of that investigation, but they are to be apprized of that process. So what's the bottom line there? The bottom line is there's that when we negotiated over years and looked at our negotiated and says we will not cave in on some very critical aspects of accountability.'",
        "'speaker_2': 'And the finance piece was, as in any union contract, was always leverage when we look at what we're willing to pay to to build, to find apartments, to make sure we get what we what we, what we needed to achieve.'",
        "'speaker_2': 'So. Councilmember Gonzalez, if you're prepared, maybe you can close debate and then we can vote.'",
        "'speaker_5': 'Great. I did want to, just in closing, highlight a couple of things. One is I will go through some of the key police accountability reforms that were achieved in this collective bargaining agreement. And then lastly, I just wanted to clarify that my reading of the Office of Police Accountability and Office of Inspector General Letters does not indicate'",
        "'speaker_5': 'that we are taking a step back from reform by virtue of the differences that are in the tentative agreement. And so I just wanted to clarify the record from my perspective in terms of what I thought I heard Councilmember Herbold say.'",
        "'speaker_5': 'And so the Office of Police Accountability, Andrew Meyer Berg wrote in his letter to the City Council that, quote, I recognize, however, that the conceptual argument surrounding the T.A. cannot be divorced from the reality that officers, detectives and sergeants have been working without a contract for the last four years.'",
        "'speaker_5': 'We have done so while implementing the reforms under the consent decree and acting as the engine to move the department to full and effective compliance. I firmly believe they deserve a contract. I share the concerns raised by many others that department morale is low and if the tape is rejected, it would it could undermine the oversight system'",
        "'speaker_5': 'and further erode the trust in mind that OPA has been working hard to undermine it has been working hard to undermine. To build. Sorry. These concerns must be balanced against the city's prerogative to negotiate lasting reforms that will ensure accountability and equitable policing moving forward.'",
        "'speaker_5': 'Labor contracts consist of a bargain of a bargain for exchange. Whether the trade offs included in the TO and the non inclusion of several provisions contained in the accountability ordinance are acceptable is not a question for you to answer.'",
        "'speaker_5': 'That is for City Council to decide. Similarly, I cannot speak to whether the TIA is consistent with the consent decree as this is a question for the parties to the decree and ultimately District Judge Roberto, regardless of the Council's decision.'",
        "'speaker_5': 'OPA will continue to carry out its mission and effectuate its purpose under both the accountability ordinance and the consent decree and the Office of Inspector General likewise issued in its its letter to us its conclusion, which provides that on balance, the Inspector General is empowered to perform accountability duties under the terms of the tentative agreement with with'",
        "'speaker_5': 'potential limitations. As highlighted above, OIG will have a role moving forward as the objective check on the system to review, audit and evaluate the systems as they play out under the tentative Agreement and Accountability Ordinance. OIG can use that information to help the city's oversight partners advance recommendations that improve the system and serve as guidance for what'",
        "'speaker_5': 'is needed to sustain public confidence. And then lastly, I just wanted to highlight some of the things. There's been a lot of talk in the room today and an email and otherwise about this concept that somehow we're rolling back police reform.'",
        "'speaker_5': 'And I think that because of those comments being stated in public, it's important for me to highlight what what I think we actually were able to achieve and move forward in terms of accountability reforms in agreement with the members of the Seattle Police Officers Guild and with the leadership of Chief Best.'",
        "'speaker_5': 'And so if you will just indulge me for another few moments, I would like to highlight those now. So Article 3.3 regarding indefinite suspensions expands the ability of the chief of police to impose an indefinite suspension. In addition to felonies, the chief can now suspend an officer without pay pending investigation for a gross misdemeanor involving moral turpitude'",
        "'speaker_5': 'or sex or sex or bias crime, where the allegation, if true, could lead to termination. Article 3.5. Due Process Hearings. The Office of Inspector General for Public Safety is now allowed to attend Article 3.5 Disciplinary Review Board abolishes the Disciplinary Review Board as an avenue for appealing a disciplinary action.'",
        "'speaker_5': 'Community members consistently express concerns about the fairness of Derby to those alleging this. Act. Article 3.6 B2 regarding criminal investigations modifies existing contract to clarify that the 180 day clock is told when a county prosecutor is reviewing a matter and not just a city, state or federal prosecutors.'",
        "'speaker_5': 'Article 3.6 F5 Interviews The Office of Inspector General for Public Safety is now allowed to attend all interviews. Article 3.6 Statute of limitations is extended from 3 to 4 years, with a relatively broad interpretation of what constitutes concealment of acts of misconduct.'",
        "'speaker_5': 'Article 3.6 Age related to open investigative file access allows the Office of Inspector General for Public Safety to access all open files. Article 3.6 AL Files Retention Sustain files will now be retained for the duration of an officer's employment plus six years.'",
        "'speaker_5': 'Not sustained files may be retained for three years plus the remainder of the current year. Article 3.7 related to criminal investigations establishes that the Office of Police Accountability may communicate with those conducting criminal investigations about the status and progress of the investigation, but but may not direct or influence the conduct of the criminal investigation.'",
        "'speaker_5': 'The current collective bargaining agreement prohibits any coordination between the Office of Police Accountability and the Criminal Investigators. Article 3.11 Rapid Adjudication. It establishes a new system allowing for the rapid adjudication for matters in which the officer agrees to waive formal investigation and accept discipline.'",
        "'speaker_5': 'While either the office or Office of Officer or Office of Police Accountability may initiate the process. Both the OPA and the officer must agree before the process is actually utilized. Article 4.2 A regarding personal files will allow the OIG to access personnel files.'",
        "'speaker_5': 'Article 4.2 C Written Reprimands. This deletes the requirement in the collective bargaining agreement that after three years, an employee may request that written reprimands be removed from an employee's personnel file. So I have just quickly went through 12 additional things that we have been able to achieve through this labor negotiations process that I think we should feel'",
        "'speaker_5': 'proud of. Does that mean that we can stop and that we can throw our ticker tape parade and say mission accomplished? Of course not. This process is iterative. We have to continue to be vigilant. We have to continue to test the systems.'",
        "'speaker_5': 'And let me tell you, we I feel very proud of the fact that we will have an office of inspector general who's going to be in a position to have full and unfettered access to help us monitor from a systemic perspective whether or not we are fulfilling our obligation to keep our officers safe and to keep the'",
        "'speaker_5': 'people that they are intended to keep safe, also safe. And so I just I want to make sure that folks understand that we have been able to accomplish a lot through this contract. That doesn't mean that our work is over.'",
        "'speaker_5': 'It does mean that I think this council can be proud in taking a vote today, in supporting this collective bargaining agreement and in taking the next step to making sure that the judge is also in agreement with some of the policy decisions that we have made today.'",
        "'speaker_2': 'Thank you. That's very bizarre. Okay. Having said that, and you see, I was being polite. I could have reminded you had.'",
        "'speaker_0': 'Translated transcripts out there like.'",
        "'speaker_2': 'That. So we're going to keep voting, if you can hear me. Thank you for that. Please call the roll on the passage. First of all, let me move to adopt counts bill 119368 as amended is removed. And second, please call the roll on the passage of the bill.'",
        "'speaker_3': 'By John Gonzalez.'",
        "'speaker_5': 'Herbold. By Johnson.'",
        "'speaker_3': 'Suarez Macheda. O'BRIEN All right. So I don't know. President Harrell I in favor one opposed.'",
        "'speaker_2': 'The bill passed.'",
        "'speaker_1': 'Chair assignment please read your clap back.'"
    ],
    "Recognition of Seattle Police Department and Request for Judicial Review of Collective Bargaining Agreement.": [
        "'speaker_2': 'And. We thank everyone for coming out, whether you got what you wanted or not. Thank you for your testimony and participation. Please read the next edition item into the record.'",
        "'speaker_3': 'From the amended agenda. Resolution 318 55. Recognizing the service and dedication of the Seattle Police Department's police officers, detectives.'",
        "'speaker_5': 'And sergeant are requested. The United States District.'",
        "'speaker_3': 'Court for the Western District of Washington to conduct a judicial review of the collective bargaining agreement reached between the city of Seattle and the Seattle Police Officers Guild.'",
        "'speaker_2': 'Councilmember Gonzalez.'",
        "'speaker_5': 'This is a resolution that would advance the tentative agreement that we just voted on it to the city attorney's office for a for consideration by and review of judge. In terms of making sure that there is compliance with the consent decree and the United States Constitution.'",
        "'speaker_2': 'Good. Very good. Any comments about the resolution? Council members who want. Council members.'",
        "'speaker_0': 'Have.'",
        "'speaker_6': 'Gotten worse.'",
        "'speaker_5': 'So I just want to speak that to the fact that I had concerns that though the resolution asked, the city attorney joined the city council in requesting judicial review. And I appreciate the city attorney's expression of his willingness to do so.'",
        "'speaker_5': 'I had concerns that the executive might have a separate interest in might want to argue in court that these items fall outside.'",
        "'speaker_3': 'The scope of the court.'",
        "'speaker_5': 'In opposition to their request in this resolution. Council central staff director has consulted with the Executive on my behalf and she has confirmed what Councilmember Gonzales has assured me this morning that the executive will not be arguing before the court that these six items are outside the scope of the judge.'",
        "'speaker_5': 'That said, though, I absolutely support us asking. I do have serious reservations that in short shrift Judge Roberts will be telling us that the six items in the resolution for which we are asking the court review for consistency with the consent decree are outside of the scope of the court, and we will be stuck with those terms'",
        "'speaker_5': 'until they are bargained out. And I hope that I'm wrong.'",
        "'speaker_2': 'Thank you. Concerning Herbold, council members who want.'",
        "'speaker_6': 'Thank you, President. Hope this resolution does nothing but deflect responsibility for the attack on police accountability in this contract that was just voted in. And councilmembers know that voting yes on the contract undermines police accountability, even though they say it doesn't, because this resolution lists six distinct restrictions on accountability in the contract.'",
        "'speaker_6': 'If council members know that these are problems, they should have voted no on the contract and sent it back to the mayor to renegotiate to fix these six problems. Instead, this resolution is an attempt to hide from their responsibility, asking Judge Robert to do the councilmembers job and to review the contract to see if it violates the'",
        "'speaker_6': 'consent decree. This is particularly absurd given that Judge Robert announced last week that he intends to do that review already. So this resolution literally does nothing, but it is being used as a clumsy attempt to direct the movement for police accountability into ignoring that they have just been betrayed.'",
        "'speaker_6': 'I also would like to point out a particularly imaginative whereas clause which describes the Seattle Police Officers Guild as quote, strong partners in ongoing efforts to implement lasting police reforms and accountability structures. And, quote, over 100 Seattle police officers sued to try to block the consent decree.'",
        "'speaker_6': 'The Seattle Police Officers Guild as a whole opposed I-9 40, the De-escalate Washington initiative that was just overwhelmingly passed by voters last week. And for the past months, they have been swarming the city to attempt to block elements of the accountability ordinance.'",
        "'speaker_6': 'And this resolution calls them, quote unquote, strong partners on accountability structures. I have no problem with Judge Robert reviewing this contract. He should and clearly will do so. However, I will not be party to this attempt to distract and disorient the movement for police accountability.'",
        "'speaker_6': 'So I will be voting no on this resolution.'",
        "'speaker_2': 'Thank you so much, Shaun. Okay. Any other comments before we vote? I see. No. Let's move forward. So I will move to adopt resolution 31855 their second. To those in favor of adopting the resolution, please vote i. I.'",
        "'speaker_2': 'Those oppose vote. No.'",
        "'speaker_6': 'No.'"
    ],
    "MOUs and MOAs for Collective Bargaining Agreement.": [
        "'speaker_2': 'The resolution is adopted and the chair will sign it. Please read the next agenda item.'",
        "'speaker_3': 'Please click 5314409 Memorandum of Understanding and Memorandum of Agreement Incorporated into the Collective Bargaining Agreement referenced in Council 119368. Appendix Appendix of Attachment one.'",
        "'speaker_2': 'Councilmember Herbold.'",
        "'speaker_5': 'Thank you. I want to give credit to my staff, to Aldrich for recognizing that this was legislation that was brought forward to us that referred to other agreements that were incorporated by merit of voting on this legislation but weren't actually included in the legislation.'",
        "'speaker_5': 'I don't recall seeing that before. And so I thought it was really important after checking with the law department, that those were actually public documents, that they be included as part of the legislative record. I believe that they are important not only for transparency, but for public understanding of everything that the contract entails.'",
        "'speaker_5': 'Some of those agreements, I think, date back to 1992. I asked for and received the agreements. It's very awkward that we're being asked to vote on legislation that doesn't include all the relevant items. And I think it's also important to note that the inspector general's letter noted that five of the milieux that could have potential impacts on'",
        "'speaker_5': 'inspector general operations and that the OIG will will track these issues. And so I request your support in approving this class clerk file.'",
        "'speaker_2': 'Thank you, Councilmember Herbold. Any comments from any of my colleagues on the Clark File? Thanks for sharing that with us this morning as well. Okay. I will move to file clerk file 314409. Second moved and seconded the clerk file be filed.'",
        "'speaker_2': 'Any further comments? Those in favor of filing the clerk file please vote i. I. Those oppose vote no. The clerk file is placed on file. Please read the next agenda item.'"
    ]
}