{
    "Acquisition of Real Property for Open Space and Park Purposes.": [
        "'speaker_4': 'The Report of the Civic Development to Public Assets and Native Communities Committee. Jan Item one Council. Bill one 1 to 582 related to the Department of Parks Recreation authorizing acquisition of real property property commonly known as 70/910 Avenue South.'",
        "'speaker_4': 'Authorizing acceptance of a recording of the deed for open space, park and recreation purposes. And ratifying confirming certain prior acts. The committee recommends the bill pass.'",
        "'speaker_0': 'That's was.'",
        "'speaker_1': 'Thank you. Today I think we have three items up and I'm really happy to say and thank Councilmember Gonzalez and Cashmere Bagshaw that the city actually can grow some property every now and then. And they the dual brush park requisition and I've been wanting to say this for a long time, what I've done speaking, I believe the'",
        "'speaker_1': 'good lady from District One, Councilmember Herbold, would like to say a few words. This ordinance authorizes the purchase of a parcel of land located within the Duwamish Waterway Park is currently owned by King County. The purchase price is about $1,000,000.'",
        "'speaker_1': 'The park will serve the South Park community. City staff performed due diligence, which included obtaining soil samples that revealed low level arsenic and soil below the grass and some discrete hotspots with higher concentrations in soil below the grass at the north end.'",
        "'speaker_1': 'The city will promptly perform a remedial action upon acquisition of the parcel to remove the contamination, even though the locations and concentrations currently do not present excuse me, do not present an immediate public hazard. King County was notified and they agreed to reduce the purchase price by $100,000 and sufficient funds.'",
        "'speaker_1': 'These are sufficient funds for the city to perform the remediation. This is compliant with the requirement to pay fair market value for the property. While the city remains responsible for any park remediation costs exceeding $100,000, the results of the due diligence investigation indicate that exceeding the cost estimate is very unlikely.'",
        "'speaker_1': 'In addition, city staff with the assistance of the law department, negotiated that King County retained all liability associated with contaminant releases from the property. They're being remediated through EPA's Lower Duwamish Waterway Superfund Sentiment Cleanup, The Civic Development, Public Asset and Native Communities Committee recommends full council pass this ordinance.'",
        "'speaker_0': 'Thank you, Councilmember. Whereas, Councilmember Herbold.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_1': 'I want to thank.'",
        "'speaker_4': 'King County for its consideration of.'",
        "'speaker_1': 'Reducing the.'",
        "'speaker_4': 'Price of the the property in consideration for the needs around site.'",
        "'speaker_1': 'Remediation. I also want to thank the Seattle Parks Foundation because of their effort.'",
        "'speaker_4': 'In leading a fundraising campaign.'",
        "'speaker_1': 'For future improvements at the park. I want to take this opportunity to flag a couple of.'",
        "'speaker_4': 'Issues.'",
        "'speaker_1': 'That we learned about at a recent South Park.'",
        "'speaker_4': 'Community safety walk and.'",
        "'speaker_1': 'Talk with the executive.'",
        "'speaker_4': 'Departments.'",
        "'speaker_1': 'Those two items that have been flagged is a request from the Danish Rowing Club to add some sand.'",
        "'speaker_4': 'And or rocks to the beachfront.'",
        "'speaker_1': 'Area. So it's easier for them to take the rowing equipment in and out of the park.'",
        "'speaker_4': 'And the.'",
        "'speaker_1': 'Executive.'",
        "'speaker_4': 'Is looking at use working with the Army Corps of Engineers to get a permit to do so. And it looks like we're making.'",
        "'speaker_1': 'Some good, good progress there. The other item that was flagged in the the executive walking talk in South Park in July.'",
        "'speaker_4': 'Relates.'",
        "'speaker_1': 'Specifically to.'",
        "'speaker_4': 'Ongoing graffiti tagging in the park and looking.'",
        "'speaker_1': 'For the fact that in the past, using murals to dissuade.'",
        "'speaker_4': 'Graffiti tagging has been very.'",
        "'speaker_1': 'Effective.'",
        "'speaker_4': 'In in South Park.'",
        "'speaker_1': 'So we're.'",
        "'speaker_4': 'Looking at more opportunities to work with youth and.'",
        "'speaker_1': 'Create art.'",
        "'speaker_4': 'On the surfaces around the park in order to discourage future graffiti. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Herbold, any other comments or questions? If not, please call the rule on the passage of the bill.'",
        "'speaker_1': 'Pacheco I so on i Bexar Gonzalez Herbold. I was Macheda O'Brien High Harrell. Hi nine in favor and unopposed.'"
    ],
    "Acceptance of Art Gift for Christie Park.": [
        "'speaker_0': 'The bill passed and chair of the Senate. Please read agenda item number two.'",
        "'speaker_4': 'Agenda item two accountable 119 587 relating to Seattle Parks and Recreation authorizing the acceptance of a gift of three art pieces and art tiles entitled Explorer Voyage from the Friends of Kristi Park to be installed in the Christy Park for Public Use Committee recommends the bill pass.'",
        "'speaker_0': 'Customer worries.'",
        "'speaker_1': 'Thank you. Council President This is a bill that authorizes the acceptance of a gift from friends of Christy Park. Friends of Christy Park are represented by a group of. Taiwanese Americans who value celebrating their culture, exploration and friendship between the people of Seattle and Taiwan.'",
        "'speaker_1': 'Donation. The donation, called the Explorer Voyage, includes three sculpture pieces made of fabricated steel with wood slated for bench seating. Friends of Kristi Park chose to donate art by Paul Art by Paul Sorey, an artist who was inspired by the Taiwanese boat culture.'",
        "'speaker_1': 'Specifically boats from Orchid Island. Donation includes a $6,000 endowment to maintain the pieces. Kristi Park is located in the heart of the University District. The Civic Development, Public Assets and Native Communities recommends for council passed this ordinance.'",
        "'speaker_0': 'Thank you very much. Any other questions or comments? If not, please call the rule on the passage of the bill. Of the bill. Of the Bill.'",
        "'speaker_1': 'Pacheco v. Bexar Gonzalez Herbold II. Whereas I Mesquita I O'Brien.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'President Harrell. Hi nine in favor and unopposed.'",
        "'speaker_0': 'The bill passed and Cheryl signed it. Please read. Agenda item number three. Let's go to the short title, please.'"
    ],
    "Donation of Real Property and Cash from Forterra NW to Seattle Parks and Recreation.": [
        "'speaker_4': 'Item three Constable 119588 relating to Seattle Parks and Recreation amending ordinance 125 724, which adopt the 2019 budget, including the 2019 through 2024 Capital Improvement Program authorized in the substance of a donation of real property in Seattle from Victoria Northwest.'",
        "'speaker_4': 'The Committee recommends that the bill pass.'",
        "'speaker_0': 'Customer whereas.'",
        "'speaker_1': 'Thank you. As you heard from our our individual that came if she's still here. Ah supporter there she is. She just raised her hand to thank her for coming and also coming to committee. So. Item three, as you know, is an ordinance that authorizes acceptance of a donation of real property and cash to the sale public.'",
        "'speaker_1': 'Seattle Parks and Recreation Department, the lawyers community and for tours northwest would like to donate the property located 4700 Northeast 47th Street and the donation is $100,000 for stewardship of the park as you heard for Tara is a north four Terry Northwest is a non has is a nonprofit since 1989 whose mission is land conservancy and bridging'",
        "'speaker_1': 'the gap between public and private entities. We've worked with Waitara Northwest in the past on many projects. Laurelhurst residents play an active role in stewardship of this park. They've established as a sun park in the ordinance also allow Sun Park to become part of the city's park system and family.'",
        "'speaker_1': 'And we welcome that. The Civic Development, Public Assets and Native Communities recommends full council pass this ordinance.'",
        "'speaker_0': 'Thank you. Councilman Waters, any other questions or comments? Councilmember Becky Shaw.'",
        "'speaker_1': 'Thank you, Councilmember Suarez, for shepherding this. And Miss McAleer, thanks for all the work that you and your neighbors have done. I also want to recognize the work that was done on. Yes. Yes. Slue, is that what you called it over the years?'",
        "'speaker_1': 'Just appreciate the work that you have done. So happy to support this.'",
        "'speaker_0': 'Very good cast member, Pacheco.'",
        "'speaker_2': 'I just first thank you calling for coming to speak on behalf of the lawyers committee and that we now have two additional.'",
        "'speaker_0': 'Treasures in District four. So thank you. All right. Excellent. That I think we're all ready to vote. So please call the roll on the passage of the bill Pacheco.'",
        "'speaker_1': 'I so aren't I beg shy Gonzalez I Herbold I was. I was Carter O'Brien, President Harrell.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Please read the next agenda item from the Finance and Neighborhoods Committee, the.'",
        "'speaker_4': 'Report of the Finance and Neighborhoods Committee Agenda and for Council Bill 119 579 relating to city employment, establishing new wage relationships for certain job titles. The committee recommends the bill pass.'"
    ],
    "Ordinance to Update the City's Criminal Code for Biological Sample Submission and Technical Corrections.": [
        "'speaker_0': 'Bill passed in Sherwood. Sign it. Please read the report of the Gender Equality Safe Communities, New Americans in Education Committee. Please read the short title The.'",
        "'speaker_4': 'Report of the Gender Equity Safe Communities New Americans in Education Committee Argentine five Cancer 4119539 relating to the city's Criminal Code, conforming the Mr. Code to state law for crimes that require the submission of biological samples to the state of Washington.'",
        "'speaker_4': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Castro and Gonzalez.'",
        "'speaker_4': 'Thank you, Council President. This council bill would conform the Seattle Municipal Code to state law for 11 serious or sex related crimes that require the submission of biological samples. In other words, DNA to the Washington State Patrol crime lab.'",
        "'speaker_4': 'A little bit of history here. Until 2014, the Washington State Patrol Crime Lab Lab had been processing and entering into the Federal Combined DNA Index System database. DNA from offenders convicted of misdemeanor crimes defined as defined in the Seattle Municipal Code.'",
        "'speaker_4': 'Officials from the Washington State Patrol discontinued this practice in 2014 because they believed that it was not legally required for the state to process those samples from offenders that are convicted of local crimes under local statutes. However, in this last legislative session, and thanks to the leadership of Representative or while she was able to solicit and receive'",
        "'speaker_4': 'a opinion from the Attorney General's Office that noted that the Washington State Patrol Crime Lab would be bound legally to process Seattle DNA samples and and results if the CMC and municipal code definitions conformed to state law. So the City Attorney's Office transmitted to council this particular bill council bill 119589 in order to bring the city's code'",
        "'speaker_4': 'into compliance with that Attorney General's office opinion. And then the city attorney's office has also spent much time with me in my office and also joined us at committee last week to walk us through the proposed legislation and made very clear that this legislation does not substantively change the elements of any of the underlying 11 crimes for'",
        "'speaker_4': 'which DNA samples are taken that would then be placed in the CODIS database. They also clarified that the DNA that would be captured in this instance would only be after conviction. So we're not talking about pre conviction before a conviction.'",
        "'speaker_4': 'All of this would occur after conviction consistent with the ordinance and with state law. It is really, I think, important for us to make sure that we continue to support these efforts in the advancement of general public safety.'",
        "'speaker_4': 'Staff from our Seattle Police Department have indicated that this recent change in the state law will shift responsibility from the Seattle assistant city prosecutors to the Seattle Police Department. This burden of collecting the DNA from out of custody offenders.'",
        "'speaker_4': 'And so this would be really necessary in order for them to continue that work. And Espey has indicated that they can absorb this additional burden within existing budget. So in total, we again have reached out to various stakeholders and who were involved pretty heavily in this issue over the last several years at the state legislature.'",
        "'speaker_4': 'And none of them have expressed concerns with the underlying components of this bill and feel that is consistent with what the intent was under the state law. So I feel pretty comfortable that we're not creating a dragnet here or taking other punitive action in these in this area.'",
        "'speaker_4': 'This is purely largely a technical bill to allow us to continue the efforts to deal with both backlog issues related to our DNA samples, which in large part are related to, again, sex crimes. And we've heard pretty clearly from a lot of survivors in this area that this is an incredibly important step to move this public safety'",
        "'speaker_4': 'issue forward. So implementing this legislation, in summary, will allow the police department and other law enforcement agencies to use DNA evidence to solve crimes, catch perpetrators, and bring justice to victims and their families in the future. So really happy and proud to advance this particular piece of legislation together with city attorney Pete Holmes, who.'",
        "'speaker_4': 'I'd like to thank for his advocacy in this space. I also want to thank John Choquette and Kelly Harris from the City Attorney's Office for their work on both drafting the bill, coming to committee to present on the bill and making sure that we had all the information necessary to walk some of our advocacy organizations and friends'",
        "'speaker_4': 'through the various components of this bill. I also want to thank Rebecca Johnson, who joined us at the table last week. She's been really she's represents the city on a variety of public safety related legislative priorities. This was one of the city's legislative priorities last session.'",
        "'speaker_4': 'And so she was able to join us and walk us through at the committee the varying degree of engagement with privacy concerns and with the public safety concerns at the committee table really appreciated her time and attention to that.'",
        "'speaker_4': 'And then lastly, just wanted to thank Greg Dodds from Council Central Staff for doing an analysis of the bill as submitted by the City Attorney's Office and to Brianna Thomas for my office for being the policy lead on this issue.'",
        "'speaker_4': 'So with that being said, the committee considered this last week in a special committee and we recommended the city council pass council bill 119589.'",
        "'speaker_0': 'Thank you very much, Councilman Gonzales. Comes from a skater.'",
        "'speaker_3': 'Thank you very much, Mr. President. I want to thank the committee chair for her leadership on this issue, not just in committee, but also with your advocacy at the state level to advance this legislation. In addition to the community partners that you mentioned.'",
        "'speaker_3': 'And I think that the clarification that you've offered today should help set the record straight. I also want to offer a few pieces to clarify and underscore some of the comments that you just made due to the concerns that the ACLU has continued to raise and have been covered on some of our local media channels, I think'",
        "'speaker_3': 'it's really important to hear the words that Councilmember Gonzalez just said and to clarify that this legislation creates a mechanism for the state patrol to be able to accept the DNA samples that have already been collected from people who have already been convicted of a serious or a sex related misdemeanor crime.'",
        "'speaker_3': 'So this bill does not lead to any new process or changes at the city level. And we all are mindful of the unintended consequences, the unintended impacts, especially on communities of color, as we think about individuals from communities of color being disproportionately represented in the criminal legal justice system and are mindful any time it comes to collecting'",
        "'speaker_3': 'information or DNA, how this information could potentially be misused. We address those questions. Thank you, Madam Chair, for your answer to those questions in committee and to the advocates at the table who addressed that head on. And in addition to the point that this is not seeking to create new changes in our current process, we are also'",
        "'speaker_3': 'wanting to underscore today that this sharing of information, that of data, DNA that has already been collected could help uplift and underscore our commitment to exonerate people who have been wrongly convicted. So to the extent that we are sharing information and can help free individuals who are wrongly being held and don't have the DNA evidence to yet'",
        "'speaker_3': 'prove that this DNA may be able to help exonerate some individuals who are wrongly being convicted. So I want to thank the chair again for making that RTI comments really heard last week and again today and to the sexual assault and survivor protection advocates, including Representative Orwoll and our city attorney, again for continuing to work on this'",
        "'speaker_3': '. But I think that's an important clarification to right the wrong narrative on this.'",
        "'speaker_0': 'Thank you, Catherine Mosquito. Any other questions or comments? Okay. Again, I want to thank you, Katherine, because Allison goes from a skater for asking all the right questions and getting to the to the heart of it all. So with that, please call the role on the passage of the bill Pacheco.'",
        "'speaker_1': 'So on. I sure. Gonzales I Herbold I was I was together I O'Brien President Harrell I known in favor and unopposed bill.'"
    ],
    "Police Chief Report on Ordinance 108333 Activities.": [
        "'speaker_0': 'Passed and chair of Senate please read agenda item number six.'",
        "'speaker_4': 'Agenda item six Clerk File 3144170 Police Chief 2018 Annual Report Concerning Activities Regulated by Ordinance 108333 Committee recommends that the file be placed on file.'",
        "'speaker_0': 'Concerning Gonzalez.'",
        "'speaker_4': 'Thank you. Council President Clerk File 314417 is a 2018 annual report from the Seattle police chief reporting a report concerning activities regulated by Ordinance 108333, which is commonly referred to as the investigations ordinance. If you look at the underlying bill, it's very simple.'",
        "'speaker_4': 'There's, I think, two pages worth of reports. This is in order to comply with Seattle Municipal Code 14.12 .380. That requires that the chief of the Seattle Police Department submit an annual report on the implementation of that chapter to the mayor, the city council and the city clerk for filing as a public record.'",
        "'speaker_4': 'And so really what this annual report does is that it lays out the type of information that the Seattle Police Department may have collected in the prior year for law enforcement purposes. There are requirements under the Seattle Municipal Code that that require destruction of that certain types of information, if it is gathered.'",
        "'speaker_4': 'And this is the chief's obligation to report to us and the general public as to the agency's compliance with those those retention and or destruction provisions within the ordinance and consistent with Council Central Staff's Report and the chief of police report, it appears that the ordinance has been complied with.'",
        "'speaker_4': 'So this is our due diligence in filing this report publicly consistent with the muni code. So the committee recommends that the clerk be that the clerk file be filed.'",
        "'speaker_0': 'Very good. Any questions or comments? If not those in favor of filing the clerk file please vote i. I. Those opposed vote no. The motion carries and the clerk file is placed on file. Please read agenda item number seven.'"
    ],
    "Audit Report on Confidential Information Files from LEIU and WSIN.": [
        "'speaker_4': 'Ten dead in seven. Clark five, three, one, four, four, two, three. Chief of Police Audit Report of Select Files obtained through the Police Department's membership in the Law Enforcement Diligence Unit and the Western States Information Network maintained exclusively for confidential information dated February 27, 2018.'",
        "'speaker_4': 'Accordance with Ordinance 108333. The committee recommends that the file be placed on file.'",
        "'speaker_0': 'That's from Gonzales.'",
        "'speaker_4': 'Thank you, counsel. Present. This is the last of my very heavy law enforcement public safety items on the agenda. So this is also related to the previous agenda. Agenda item six Clark file 314, four, two, two, two. Excuse me, three, one, four, four, two, three is also a report that seeks to ensure compliance with ordinance 108333, which'",
        "'speaker_4': 'is the investigations ordinance. That ordinance requires that the chief police audit select police files maintained exclusively for confidential information. This information would have been obtained through the Police Department's membership in the Law Enforcement Intelligence Unit and the Western States Information Network.'",
        "'speaker_4': 'The chief of Police Best has submitted her latest audit report as required by the ordinance, and that report indicates that she found no violations during the audit process, which she is required to do under the ordinance. So she has now filed a certification through this Clark file for the public record to certify the fact that the audit'",
        "'speaker_4': 'report was prepared by the chief and that she is certifying it as final. And and for those of you that didn't have time to go through the report, it appears that there were 30 administrative documents that were audited in the law enforcement section, and there were a lot more audited, about 230, 240 audited in the Western states'",
        "'speaker_4': 'information network files. And and only 176 audited items are currently being retained consistent with the ordinance under the confidentiality provisions. So with that being said, the committee considered this and was able to ask questions and received a briefing from council central staff and and voted to recommend that the city council file the Clark file.'",
        "'speaker_0': 'Thank you, Councilmember Gonzalez.'",
        "'speaker_4': 'I was trying to prolong it because you were gone. And so I can add a little bit more detail than I probably would have otherwise done.'",
        "'speaker_0': 'Any other questions or comments? Okay. Those in favor of filing the Clark file please vote i. I. Those opposed vote no. The motion carries and the Kirk file is placed on file. Please read the report of the Planning Land Use and Zoning Committee.'"
    ],
    "Clarification of Vessel Definition in the Shoreline Master Program.": [
        "'speaker_4': 'Report of the Planning Land Use and Zoning Committee Agenda Limit Constable 119471 relating to land use and zoning, clarifying the definition of vessel and consistently using the term vessel in the shoreline master program and amending sections 23.60 8.204. 916 and point 942.'",
        "'speaker_4': 'Sea out on a speaker. The committee recommends the bill passes amended.'",
        "'speaker_0': 'Councilmember Pacheco So this legislation clarifies the city's definition of a vessel to address a ruling from the hearing examiner in December of 2016.'",
        "'speaker_2': 'The clarification will.'",
        "'speaker_0': 'Return the vessel definition to its original.'",
        "'speaker_2': 'Intention and will close a loophole that has allowed non.'",
        "'speaker_0': 'Operable formerly recreational vessels to be verified by the.'",
        "'speaker_2': 'City as floating on water.'",
        "'speaker_0': 'Residences. This loophole has led to an uptick.'",
        "'speaker_2': 'In on honorable.'",
        "'speaker_0': 'Vessels being verified.'",
        "'speaker_2': 'And could lead to many more if we do.'",
        "'speaker_0': 'Not act today. As part of the.'",
        "'speaker_2': 'Consideration of this legislation, my.'",
        "'speaker_0': 'Office and others met with stakeholders, including the Lake Union Liveaboard Association, to better understand their concerns. The proposed.'",
        "'speaker_2': 'Changes do not affect any existing floating on water.'",
        "'speaker_0': 'Residences. I'd like to I'd like to thank Councilmember Herbal for bringing an amendment in committee which reaffirmed this fact. And so with that said.'",
        "'speaker_2': 'We also want to.'",
        "'speaker_0': 'Thank thank Central Staff Keo specifically for his assistance on this bill. Thank you very much. Are there any questions or comments? If not, please call the role on the passage of the bill.'",
        "'speaker_1': 'Pacheco. I want a big shot. Gonzalez, i. Herbold, i. Whereas mosquera i. O'Brien Hi. President Harrell, i. Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and Cheryl of it. Agenda items nine and ten. If there's no objection, I'd like to do by unanimous consent, I'd like to reverse the order of session. We can here agenda item number ten. Before nine, I've been told by the chair of the committee comes from Brian.'",
        "'speaker_0': 'It flows a little better that way. So if I don't hear any objection, I'm going to ask and direct the clerk to read agenda item number 10/1 and then we'll come back to nine after that. Okay? Okay. Please read it.'"
    ],
    "Easement and Maintenance Agreement with Seattle Children's Hospital for Street Vacation.": [
        "'speaker_0': 'You're not number ten.'",
        "'speaker_4': 'Agenda item ten, cancel 119 564 relating to the Department of Parks and Recreation, accepting the easement from and entering into a maintenance agreement with Seattle Children's Hospital in Washington nonprofit corporation as a condition of the public benefit requirement for the street vacation of portions of 41st Avenue Northeast and a portion of Northeast 46th Street petitioned approved contained'",
        "'speaker_4': 'in clerk filed 309690 committee recommended the bill pass.'",
        "'speaker_0': 'Thank you very much, Councilmember O'Brien.'",
        "'speaker_2': 'Thank you. So this is a portion of a trail adjacent to the Berkman Trail that connects the Burke Trail to the Seattle Children's Hospital campus. It's something that's been in place for a number of years, and it was part of the requirement for a street vacation approval.'",
        "'speaker_2': 'We did a number of years ago, and the ordinance today, they finally got all the legal pieces in line. And so this will accept the easement so the parks can take over operations of that connection. I will say this is the final piece to formally be completed from the street vacation that was conceptually approved by this council'",
        "'speaker_2': 'a number of years ago. And so the reason I asked to flip this is because once this is done, we will be in the clear and we can actually do the street vacation. And I don't know that a few minutes makes a huge difference, but doing them in order seemed like the prudent thing to do.'",
        "'speaker_0': 'Thank very much. Any questions or comments on this council bill? If not, please tell the role on the passage of the bill.'",
        "'speaker_1': 'Pacheco I so want I make sure. Gonzalez I Herbold I was mosquera I. O'Brien Hi, President. Harrell Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passed and chair of Senate. Please read agenda item number nine.'"
    ],
    "Ordinance on Commute Trip Reduction Program, Strategic Plan and Center City Designation.": [
        "'speaker_4': 'Constable 119521 really into Seattle commute troop reduction program adopting an updated strategic plan adopting a local designation of Seattle City Center, Center, City as a growth and transportation efficiency center. The committee recommends the bill pass.'",
        "'speaker_0': 'Cast Member O'Brien Thank you.'",
        "'speaker_2': 'This is an update to the troop reduction program in the city of Seattle. That's a program that's authorized by state legislature requires businesses with more than 100 employees to participate in a creative reduction program. Seattle is a partner with the county and downtown Seattle Association.'",
        "'speaker_2': 'Through the commute, Seattle does a lot of great work with that. This legislation does a lot of updating and setting some new targets. Some of the transportation modes that were in place just a few years ago were during the last update to the commuter troop reduction program, are in place today, I should say, didn't exist then specifically'",
        "'speaker_2': 'tenses. And so there's a number of clean up things to make that work better. I want to just applaud and commend the staff staff who continue to do great work on commuter production and also the team at commute Seattle.'",
        "'speaker_2': 'This legislation will help them continue to do their great work and I believe we need those teams to be doing even greater work in light of the climate crisis we're facing.'",
        "'speaker_0': 'Thank you very much. Any questions or comments that please call the role on the passage of the bill?'",
        "'speaker_2': 'Pacheco I.'",
        "'speaker_1': 'So want I SRA Gonzalez Herbold Suarez Mosquera.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'O'Brien.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'President Harrell nine in favor and unopposed.'"
    ],
    "Resolution on Navy's Northwest Testing and Training Proposal.": [
        "'speaker_0': 'The bill passed. Sure was. Sign it. Please read the 12th agenda item.'",
        "'speaker_4': 'Agenda item 12, resolution 318 and 82. Expressing concerns for the Northwest testing and training proposal of the United States Department of the Navy for Puget Sound, coastal waters from Northern California through Washington State and for Alaska. The committee recommends the resolution be adopted.'",
        "'speaker_0': 'Customer Brian.'",
        "'speaker_2': 'Thank you. So the Navy is considering additional tests of their sonar and explosive devices in the waters off Puget Sound and up and down the coast. As the bill describes as part of that proposal, they've been required to do a supplemental environmental impact statement.'",
        "'speaker_2': 'I believe no is actually conducted. And through that, what we've seen is that the work they're proposing to do would have significant impacts on marine mammals who use various methods for navigating and communicating, including the orca population in Puget Sound.'",
        "'speaker_2': 'We know that the massive amounts of sonar that can potentially be put in water or explosives have had sometimes debilitating and occasionally life threatening impacts on these marine mammals. And this resolution asks the Navy to reconsider their proposal in light of the science and come back with some ideas of how they can conduct their tests in a'",
        "'speaker_2': 'way that sensitive to the population, particularly highlighting the plight of the orcas in Puget Sound. The reality is that those three pods that make their home in Puget Sound waters and the Greater Salish Sea are on the brink of extinction, and the death of just one or two of them could jeopardize their ability to sustain those populations'",
        "'speaker_2': '. Also, we will be sharing this with our federal delegation as my colleagues and others, to highlight this for our federal delegation so that they can have a similar conversation with the Navy to try to adjust their proposal.'",
        "'speaker_0': 'Thank you, Councilmember O'Brien. Any other questions or comments on the resolution? Or the orchestra? No. No closing words. Okay. Thank you, customer Brian, for bringing this to everyone's attention. Those in favor of adopting the resolution. Please vote i.'",
        "'speaker_0': 'I those opposed vote no. The motion carries the resolutions adopted and the chair will sign it. Is there any further business to come before the council? Councilman Gonzalez.'",
        "'speaker_4': 'Thank you. Council President, I need to move to be excused on August 12th, 2018. That's next Monday. As I mentioned during council briefing this morning, I will be leaving on Friday evening to join a multidisciplinary cohort in Copenhagen, Denmark, for an immersion program around sustainability and planning public spaces and will need to be excused.'",
        "'speaker_4': 'But I do plan, as I mentioned during council briefing, to make accommodations, to have the rules suspended so that I can call in for the the revote on the sweetened beverage tax ordinance.'",
        "'speaker_0': 'Has been moved and second, that Councilwoman Gonzalez be excused on August 12th, but she will participate on at least one agenda item around midnight. As I understand it.'",
        "'speaker_4': 'It'll be midnight. It'll be midnight my time.'",
        "'speaker_0': 'Okay. Any other questions or comments on that before we vote? All those in favor say I. I opposed. The ayes have it. Councilman Gosar, excuse for any other business come for the council. If not, we stand adjourned. And I want to have a great rest of the day.'"
    ]
}