{
    "Organizational Changes for the Office for Civil Rights.": [
        "'speaker_0': 'The Report of the Community and Economic Development Committee Agenda Item one Council Bill 120000. An Ordinance relating to the Organization of the Office for Civil Rights amending Section 3.14.910 of the Seattle Municipal Code to change the end of the director's term and remove an outdated subsection requiring a racial equity toolkit.'",
        "'speaker_0': 'The committee recommends the bill pass.'",
        "'speaker_2': 'Like so much Councilman Morales, as chair of the committee, you are recognized in order to provide the committee report.'",
        "'speaker_3': 'Thank you, colleagues. So this is a bill that would, as the clerk mentioned, extend the term of the Office of Civil Rights Director from December 2021 to December 2022. And just by way of a little bit of background to try to give you some context here, in 2017, councilmembers heard a variety of concerns from stakeholders that the'",
        "'speaker_3': 'Office of Civil Rights Structure and authority within the executive branch could possibly limit its ability for the department to fulfill its mission. And so the council at that time passed an ordinance that provided that the next Office of Civil Rights Director would be confirmed by council with just cause removal protections and a limited term that would end'",
        "'speaker_3': 'in 2021. So the reason for this extension is kind of a twofold. The first, some of that work is still continuing, and so there is an interest in that transition that would be implemented by that legislation, having a consistent director, stable director leadership position for the next year until that work is complete.'",
        "'speaker_3': 'And the second reason is that extending the term is one of the measures that could provide greater independence. And by which I mean, it would allow for the directorship to have staggered terms with the appointing authority. So that's part of the two of the reasons why this extension for one year is being requested.'",
        "'speaker_3': 'The intent here is not to continue to extend the directorship, but to just extend for this one year. I also want to take a minute just to express my strong support for the implementation of Racial Equity Toolkit recommendations that came out of this work.'",
        "'speaker_3': 'As a former human rights commissioner, I participated in the extensive process that culminated in that report. And it did include input from community members, from workers, from other human rights commissioners at the time. So I'm eager for that work to get completed.'",
        "'speaker_3': 'And I do want to thank Councilmember Herbold for bringing forth the original slide in 2017 to examine how we can strengthen the Office of Civil Rights. And as I mentioned, this was passed out of committee with a recommendation that it do pass.'",
        "'speaker_2': 'Thank you. Councilmember Morales, are there any comments from council members on this bill? House members, what is your hand up? Oh, that might be a holdover. It looks like it was a holdover. So, yes. Councilman Morales, thank you for recognizing myself as the author of the slide that led to the work of recommendations from led by OCR'",
        "'speaker_2': 'and delivered to the Council. I think in late 2019 I was also the sponsor of the legislation that we are amending today and just mentioning that, just to let my colleagues know that as the sponsor of that legislation that created a term and created a requirement for a just cause reason for termination that I do in fact'",
        "'speaker_2': 'support this legislation. That there are no further comments. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_3': 'So why aren't? Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'LEWIS Yes.'",
        "'speaker_3': 'Morales As there are, I think.'",
        "'speaker_1': 'PETERSON Yes.'",
        "'speaker_3': 'Council president pro tempore vote yes. Seven in favor. Nine opposed.'",
        "'speaker_2': 'Thank you so much. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Item number two. Will the clerk please read item number two into the record?'"
    ],
    "Transfer of Positions from Seattle Police Department to Community Safety and Communications Center.": [
        "'speaker_0': 'The Report of the Public Safety and Human Services Committee. Agenda Item three Council Bill 120065 An ordinance relating to Emergency Communications amending Ordinance 126237, which adopted the 2021 budget. Transferring positions from the Seattle Police Department to the Community Safety and Communication Center and ratifying and confirming certain prior acts.'",
        "'speaker_0': 'The committee recommends the bill passed with a divided report with councilmembers Herbold and Lewis in favor. Councilmember Gonzalez opposed and councilmembers Morales and Sewell abstaining.'",
        "'speaker_2': 'Thank you so much. As chair of committee, I will address this item. This legislation itself moves both the PEOC and the 901 dispatch out of the police department and into the new Safety and Communications Center. As mentioned this morning, I am bringing an amendment to this bill which was posted with the agenda.'",
        "'speaker_2': 'And so what I will do first is I will move to amend Council Bill City Council Bill 12 0065 as presented on Amendment one of the agenda. And after I have a second, I will describe that amendment. Thank you.'",
        "'speaker_2': 'At this time. I'm calling for a second. There's a second. Thank you so much. So the amendment itself alters the bill as introduced and as heard in committee. Again, the bill, as heard in committee, moves both the post and the 911 dispatch out of the Seattle Police Department and moves both into the new community safety and communications'",
        "'speaker_2': 'venue. This amendment will ensure that we are only moving the 911 dispatch out of the police department and into the Community Safety and Communication Center. And we are maintaining the peals in speedy until a later date. I believe we're looking at bringing this up again sometime before September.'",
        "'speaker_2': 'And so with that can I will move Amendment one and if I could get a second to Amendment 1/2. Thank you so much. It's been moved and seconded to amend the bill as presented on Amendment One. Are there any comments or questions about this action?'",
        "'speaker_2': 'I am. Okay, Councilman Mosqueda.'",
        "'speaker_0': 'Oh, thank you, Madam President. Madam President, pro tem, I appreciate you doing this. And I just wanted to note the importance of you taking these steps today and look forward to the future conversations. But I think that this is a smart move for now, and I know there will be more conversations out, but I just wanted to'",
        "'speaker_0': 'thank you for the approach that you're taking with this topic in today's discussion and look forward to continuing to engage with you and various members of our city family and members of the public, as well as we all remain committed to that, to the goals that we talked about last year.'",
        "'speaker_0': 'And those details working out those details is really going to matter in the next few months here. So thanks for all of your work here and look forward to engaging in the next steps.'",
        "'speaker_2': 'Thank you so much. Any other comments on the amendment? Councilman Morales. Yes.'",
        "'speaker_3': 'Thank you. I do want to thank you as well for this approach. I am hoping to have additional conversations with folks. I think, you know, last week Councilmember Lewis indicated some real discomfort with trying to walk a line between or really get between two different unions in the city.'",
        "'speaker_3': 'And our I think it's really important that we have a clear understanding from the different perspectives of our city employees. You know, why they think one is preferred over the other. I have not been able to have those conversations yet.'",
        "'speaker_3': 'And so I appreciate the opportunity to move forward with the 911 call response and to get my questions answered. A little more time to get my questions answered about the the parking enforcement side of this equation. So thank you for pulling that piece out.'",
        "'speaker_2': 'Absolutely. Councilmember Lewis.'",
        "'speaker_1': 'Thank you. Madam President, pro tem, I made my comments this morning during a briefing, but I think for for the record, for the afternoon meeting, I should just briefly mention as well, similar to the sentiment Councilmember Morales expressed, that I think it is always hard for us as a as a progressive, pro-labor council when two members of'",
        "'speaker_1': 'our broader Labor family have different views on a policy, although I would say a common interest. Right. I mean, there's unanimity that this we want to move this work function out of speed. There is some dispute on exactly where we're going to send them.'",
        "'speaker_1': 'And I do think that this would benefit from some additional time where we can use our relationships and in our appreciation of service for both Protec and for the parking enforcement bill. To better understand a way to resolve this and equitably and in a way that doesn't divide the labor movement.'",
        "'speaker_1': 'So I do appreciate this approach. And and I think that this time between now and the fall will be productive and resolving this in a good way. So thank you so much.'",
        "'speaker_2': 'Thank you. Councilmember Lewis, I want to just take a moment to express my sincere appreciation for the efforts of those to engage with this council, both back in in September through November and sort of the development of of their worker led mission for how they can play a role in reimagining public safety in in the city.'",
        "'speaker_2': 'And as and as well their their continued engagement even today as we consider this legislation and look forward to ongoing conversations moving forward to see if we can reach some agreement on on these really important policy issues. With that not seeing any further questions, will the clerk please call the roll on the adoption of Amendment One.'",
        "'speaker_3': 'So on. Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'LEWIS Yes.'",
        "'speaker_3': 'Morales As was Sarah Peterson.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Council president, pro tem. Honorable. Yes. Seven in favor and unopposed.'",
        "'speaker_2': 'Thank you so much. The motion carries, the amendment is adopted and the amendment amended bill is now before the council. Are there any further questions or comments? Councilmember want.'",
        "'speaker_4': 'Thank you, President Pro-Tem Herbold. I will be voting yes on this bill, but I just wanted to make some comments about where I feel the things are. This bill moves the positions from the Seattle Police Department's employment roles to the employment roles of the new Community Safety and Communication Center.'",
        "'speaker_4': 'In the past, Seattle's political establishment have pretended that this is the demand of the Justice for George Floyd movement and conflating completed it with the real demand to defund the police. In reality, and this is overwhelmingly an accounting mechanism.'",
        "'speaker_4': 'As I said, I'm I support this, but I think we have to be accurate in characterizing what it is with parking enforcement. There is zero change in the function performed by the city staff who are engaged in it with the 911 911 call center.'",
        "'speaker_4': 'Some community members hope that this is the first step to creating a community safety structure where police are not always dispatched when there's situations like mental health emergencies. However, that continues to be an aspiration for the future, and this bill that the council is voting on today only changes the accounting lines.'",
        "'speaker_4': 'So as I said, I will continue to support this bill, but I do not agree with the attempts, ongoing attention conflated with defunding the police. In fact, there is a danger actually when it is described as something akin to the demands that the Black Lives Matter movement brought forward last year.'",
        "'speaker_4': 'The right wing pretends that police do not have the money to fight crime when in reality these accounting being changes. Although nothing about the number of police officers in Seattle and the amount of policing in Seattle, the only changes in the name of the department signing the paychecks for these some departments.'",
        "'speaker_4': 'I'm concerned that the mayor may try to increase the police budget for 2022, claiming that she is only returning it to its normal level when in reality that would be a massive expansion of the police budget because these accounting breaks have moved major expenses of formerly move them off the SBT box.'",
        "'speaker_4': 'I will vote yes on this legislation, but I urge Black Lives Matter activists to remain vigilant to stop the political establishment from misrepresenting what is done by these accounting transfers.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Swan. I'm not quite sure if Councilmember Lewis, you have your hand up again.'",
        "'speaker_1': 'Yes, Madam President. Pro tem. I did just want to come in and say, while I appreciate Councilmember Swan's characterization, that, you know, that this is going to change how these employees are paid, there are more significant structural changes that come with the transfer that we're doing under this provision.'",
        "'speaker_1': 'I mean, the 911 dispatchers will now be under civilian command and control in a new department that has an interim director in the new communications civilian department. I do want to take advantage of this opportunity to maybe just foreshadow Madam President pro tem, the work that our offices have been doing in collaboration with providers, with the Defender'",
        "'speaker_1': 'Association and with other jurisdictions and cities through the the Sprint team process that you discussed during your comments at council briefing this morning that those conversations have new life breathed into them in terms of the realm of possibilities by this transfer of the dispatchers being under civilian command and control and no longer being under the control of'",
        "'speaker_1': 'a sworn police captain, which was the previous arrangement that we are ending with this vote today. So I just want to indicate that while it is the case that a lot of it is a technical and accounting and administrative change, there are some real considerable changes in terms of who the dispatch is accountable to and what the'",
        "'speaker_1': 'incentives of that bureaucracy are and what the policy remedies can be on the future of how we do dispatch by the change we are making today. That does represent a very structural shift in our ability to re calibrate and re hook up our dispatch apparatus to things that are not police response systems.'",
        "'speaker_1': 'And we are taking that first step today and look forward to continuing that work over the course of this year.'",
        "'speaker_2': 'Thank you so much, Councilmember Lewis. Any other comments on the bill or. We request the. I'm calling it the roll. I'm not seeing any requests for comment or questions. So with that, with a part, please call the role on the passage of the amended bill.'",
        "'speaker_3': 'Sergeant. Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. S mosquera.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'PETERSON Yes.'",
        "'speaker_3': 'Council president, pro tem HERBOLD. Yes. Seven in favor, nine opposed.'",
        "'speaker_2': 'Thank you so much. The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Thank you so much. Item number 13, we've moved up from the amended agenda so that we can hear item number 13 directly following the related item that we just voted on'",
        "'speaker_2': '. Item number three. Clerk Will you please read the item 13 into the record?'"
    ],
    "Emergency Communications Proviso Modification.": [
        "'speaker_0': 'Agenda Item 13 Council Bill 120078 An ordinance relating to Emergency Communications Amending Ordinance 126237, which adopted the 2021 budget, modifying a proviso and ratifying and confirming certain prior acts.'",
        "'speaker_2': 'Thank you so much. I move to pass Council Bill 12 0078. Is there a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_2': 'Thank you. It's been moved and seconded to pass the bill as sponsor of the item. I will real quickly explain what it is and open the floor in case there are additional comments. As mentioned previously, part of the Council's action during the fall budget deliberations were to include a proviso in the legislation that directed the executive to'",
        "'speaker_2': 'move nine one dispatch and the PICOS into the new Community Safety and Communications Center. The proviso was a date by which we expected the move to occur and the impact of not authorizing the move by that time was is that simply that the folks in those those two units would would not be paid?'",
        "'speaker_2': 'Now, given that we don't have agreement around the moving of the PEOC from Speed to the Community Safety and Communications Center by the deadline that we imposed for the Executive, we now don't ourselves have an ability to to move that forward just now without additional conversation.'",
        "'speaker_2': 'It's really important that we extend the proviso until September in order for the unit to be paid. So with that, are there any additional comments or questions? About this item. I am not seeing any. So with that little part, please call the role on the passage of the bill.'",
        "'speaker_3': 'So on. Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'MORALES. Yes. To.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Council president, pro tem Herbold.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Seven in favor, nine opposed.'",
        "'speaker_2': 'Okay. Thank you so much. Moving on to the next committee report, Transportation and Utilities Committee item number four, will the clerk please read item number four into the record?'"
    ],
    "Interlocal Agreement and Property Transfer from Skagit County to City Light Department.": [
        "'speaker_2': 'Is much the motion carries and the appointment is confirmed. Item number five Will the clerk please read item number five into the agenda?'",
        "'speaker_0': 'Item five Council Bill 120052 An ordinance relating to the seat to the City Light Department authorizing the General Manager and Chief Executive Officer of City Light to execute an inner local agreement with Scotch County for the transfer of real property from Skagit County to the City of Seattle to execute conveyance documents and agreements deemed necessary for the'",
        "'speaker_0': 'transfer of the property on behalf of the City of Seattle and to accept a quick claim deed from sketch accounting for such property and placing the conveyed property under the jurisdiction of City Light as part of its Endangered Species Act.'",
        "'speaker_0': 'Land program. The committee recommends the bill pass.'",
        "'speaker_2': 'Thank you so much. Councilmember Peterson is chair of the committee. You are again recognized in order to address this item.'",
        "'speaker_1': 'Thank you. And colleagues, in 1999, Puget Sound Chinook salmon were listed as threatened under the Federal Endangered Species Act. The same year, the City Council directed Seattle Sea Light and Seattle Public Utilities to pursue acquisition of undeveloped land in the Skagit watersheds to protect important habitat for the etc. listed fish runs on those rivers.'",
        "'speaker_1': 'Today's action CB 120052 authorizes Seattle City Light to take title to a half acre lot near the Skagit River. R Utility has reached agreement with Skagit County Commission for title transfer to City Light at no cost. The lot is part of an old subdivision and City Light has previously acquired most of the other lots in the subdivision'",
        "'speaker_1': 'to protect. It is important for Berrien Habitat. Last week, our Transportation Utilities Committee unanimously recommended we accept the deed of this property in as City Lights ESA Habitat Conservation Portfolio. Thank you.'",
        "'speaker_2': 'Thank you so much. Looking to see if there are any comments from House members or questions or its member Peterson about this legislation, seeing none. Will the clerk please call the role on the passage of the bill?'",
        "'speaker_3': 'So on. Yes.'",
        "'speaker_5': 'Strauss Yeah.'",
        "'speaker_3': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. What's scary. I Peterson.'",
        "'speaker_1': 'High.'",
        "'speaker_3': 'Council president pro tempore vote yes. Seven in favor. Nine oppose.'",
        "'speaker_2': 'Thank you so much. Item number six is read. Item number six into the record.'"
    ],
    "Surveillance Technology Use and Impact Report for Seattle Police Department.": [
        "'speaker_0': 'High Council Bill Agenda Item six Council Bill 120053 An ordinance relating to surveillance technology implementation authorizing approval of uses and accepting the 2020 Surveillance Impact Report and 2020 Executive Overview for the Seattle Police Department's use of Forward Looking Infrared.'",
        "'speaker_0': 'Real Time Video. The committee recommends the bill pass as amended.'",
        "'speaker_2': 'Before we get to that on Council Bill 12 0052, I recognize that I did not mention that the bill passes and the chair will sign it and ask that the clerk either fix my signature to the legislation on my behalf.'",
        "'speaker_2': 'Thank you so much. So as it relates to Council Bill 12 0053, Councilmember Peterson is chair of the committee. You are recognized to address the item.'",
        "'speaker_1': 'Thank you. President Burton Herbold, colleagues. The next three items on this afternoon's agenda are surveillance impact reports that our committee amended and approved unanimously. This is pursuant to the very thorough underlying surveillance ordinance revised in 2018. That ordinance makes sure we review technologies that have the ability to surveil so that we protect civil liberties while enabling technology'",
        "'speaker_1': 'tools for more efficient government services. Colleagues, as you may recall, we are working our way through several groups of surveillance impact reports as required by that surveillance ordinance. And we recently amended and adopted the so called group to Surveillance Impact reports for some of the existing technologies already in use by Seattle City Light Fire Department and the'",
        "'speaker_1': 'Police Department. Today we vote on the so called Group three surveillance impact reports, which are three existing technologies from us. Thank you, Councilmember Herbold, for your thorough amendments, which our committee approved unanimously last week. So these three council bills are in good condition for our vote this afternoon.'",
        "'speaker_1': 'I also want to thank the professionals at Seattle Information Technology Department, as well as our several staff analysts, Lisa Kay, my legislative aide, Kara Valliere, as well as the Volunteers of the Surveillance Working Group for their many, many months of work on these reports.'",
        "'speaker_1': 'Again, these are three technologies going to vote on them separately. The first one counts 4120053 covers, what's called forward looking infrared, real time video for King County sheriff's helicopters. And the as with previous surveillance in back reports, the committee adopted my amendment on requiring a report on equity metrics for these technologies.'",
        "'speaker_1': 'Councilmember Herbold also had a number of amendments to further define policies and reporting from speed and use of these technologies. The committee unanimously recommended approval of all the amendments and the three surveillance impact reports, and the first vote today will be on Council 4120053.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Peterson, are there any questions or comments around around the passage of this bill related to the or word or looking infrared real time video? Not seeing any real raised hands or virtual raised hands. So we'll move on to the roll call with the clerk, please.'",
        "'speaker_4': 'I'm sorry, Representative Herbold. I raised.'",
        "'speaker_3': 'My hand.'",
        "'speaker_2': 'Sorry, I didn't see it there.'",
        "'speaker_4': 'No, no problem at all.'",
        "'speaker_2': 'Thank you. Also, members on the floor.'",
        "'speaker_4': 'Thank you. I will be voting against approving this surveillance impact report authorizing the Seattle Police Department to continue to use. Forward looking infrared real time video. This is an infrared video camera that that is mounted on an airplane or helicopter and it can zoom in to show details on the ground in terrifying detail.'",
        "'speaker_4': 'It is technology that was developed by contractors beginning in the 1950s on behalf of the U.S. military. The Surveillance Impact Report analyzed the hypothetical ways that a technology could be used productively or could be used to infringe on civil liberties.'",
        "'speaker_4': 'And that hypothetical analysis is important. But in this case, we have clear experience showing how this technology is actually used. Defense attorney Naseem Bhutia fought for and eventually received the public records that exposed how the Washington State Patrol used this infrared video technology to continuously monitor and spy on the Black Lives Matter movement in Seattle last summer'",
        "'speaker_4': '. The Capitol Hill Seattle blog published a video and images that seem unearthed in an April 6th article titled, quote, Remember that expletive plane flying over Capitol Hill during last summer's protest? Here's what it was up to, end quote.'",
        "'speaker_4': 'And I really recommend that members of the public review this important piece of journalism. The blog also showed the hours long flight path of the plane, seemingly hundreds of circuits around and around. Those of us protesting below in the first days of the Justice for George Floyd protests last June.'",
        "'speaker_4': 'Many of us in the streets or living on Capitol Hill remember that. Remember that incessant sound of a plane overhead day after day, just a few hundred feet above us. We now know that it was a Washington State patrol plane taking pictures with its special high resolution thermal camera and coordinating with Seattle police on the ground to'",
        "'speaker_4': 'compress the story, repress the Black Lives Matter movement. Compare that to what is written in this surveillance and bad report. Quote, A speedy policy mitigates against the potential for inappropriate use. A speedy policy 6.60 collection of information for law enforcement purposes defines the way information will be gathered and recorded in a manner that does not unreasonably infringe'",
        "'speaker_4': 'upon individual rights, liberties and freedoms guaranteed by the Constitution of the United States and the State of Washington, including freedom of speech, press, association and assembly, liberty of conscience, and the exercise of religion, end quote. The report further states that, quote, Additionally, officers must take care when photographing demonstrations or other lawful political activities if demonstrators are not'",
        "'speaker_4': 'acting unlawfully or at least cannot photograph them. Further, a speedy policy 5.1 for all forbids bias based policing and outlines processes for reporting and documenting any suspected bias based on behavior as well as accountability measures. And for. These assertions in this report are unfortunately the exact opposite of what actually happens in reality.'",
        "'speaker_4': 'The irony would be funny if it were not so dangerous. I want to be clear that there are socially responsible users of our looking for ad real time video. It is useful, for example, for tracking wildfires and for finding people lost in the wilderness.'",
        "'speaker_4': 'But in real life, that is not how the Seattle Police Department uses this technology. The speed does not drag forest fires or search wilderness areas for missing people. In real life, the Seattle police use this technology to spy on almost exclusively peaceful protests, people exercising their First Amendment rights.'",
        "'speaker_4': 'It is also sometimes used to drag prince fleeing suspects, but it has a mass negative impact on progressive protests. So on balance, the effect is negative. The police found protesters marching in the streets, milling around, gathering, talking with one another, leading the rally, things we do every day and exercising our free speech rights because of the high'",
        "'speaker_4': 'resolution thermal imaging. The camera captures a lot of detail in one video, which is linked on the Capitol Hill Seattle blog article. The plane's camera hones in on one group of onlookers who are observing the protest and the police reaction from on top of a building roof.'",
        "'speaker_4': 'The police were looking for someone who allegedly threw a rock. An officer in the plane says, quote, There's a group of 6 to 8 people on that roof. We'll keep an eye on them. End quote. And even though he admits there were, quote, no object scene at this point, unquote, he continues to train his recording camera on'",
        "'speaker_4': 'them. The plane camera indeed continues to spy on these peaceful onlookers. And a few seconds later, the plane camera operator says he thinks the rock throw rock thrower, quote, was that other person that was running on that building up there on that other side.'",
        "'speaker_4': 'That's what I think. And quote, another officer recollected quote, Oh, that's the rooftop of the Seattle PD. End quote. And around and around the airplane circles. This is exactly the type of indiscriminate surveillance of political protest that the Seattle surveillance ordinance claims to be addressing.'",
        "'speaker_4': 'If council members will not object to this surveillance, then what will they object to or do they see these votes as nothing more than a rubber stamp? It is shameful, but not a surprise that the Seattle Police Department and other police agencies saw their role in the wake of the murder of the George flight to be a'",
        "'speaker_4': 'militarized repression of the Black Lives Matter movement, including chemical weapons, flashbang grenades and blast balls guided into a peaceful protest by forward looking infrared real time video. It is outrageous that council members who spoke passionately about opposing that militarized police response are now considering giving permission to the city to continue using the data from this fight.'",
        "'speaker_4': 'Acknowledging owned by the King County Sheriff's Office against ordinary people who are merely exercising their First Amendment protest. Rights. Finally, I want to quote from some of the public comment that is included as an appendix to the surveillance and fact report.'",
        "'speaker_4': 'The question posed is, quote, What concerns, if any, do you have about the use of this technology and what? Here are some of the quotes. I mean, there are many quotes that I would invite council members to read, but here are just a few that my office picked from the public comment responses that this will be used'",
        "'speaker_4': 'to target black people and protesters. It's expensive, and that money is better used to feed and clothe people in our city. This is a creepy tool to put in the hands of people who have already proven they can't be trusted with the tools they use.'",
        "'speaker_4': 'They shouldn't be a surveillance state. Our police should not be able to monitor us from the air with technology that can see us. I am concerned that this technology is or will be used against protesters exercising their First Amendment rights to freedom of speech and assembly.'",
        "'speaker_4': 'And that will have a chilling effect on those rights and create safety issues for protesters. Thermal imaging will be abused to surveil, track, direct and disrupt legal protest movements. This technology will not be used to keep anyone safe.'",
        "'speaker_4': 'Rather, it will be used to surveil members of the public, specifically protesters, in order to arrest, attack and harm them, as media has already used tools at their disposal to brutalize protesters. Why does the Seattle Police Department feel they need feel the need to use military surveillance equipment on its domestic population?'",
        "'speaker_4': 'And the last comment I'll read is, no matter what you say in response to public comment, we know you're just using this to help oppressed citizens and protesters. Come on. So in closing, I will vote no on this.'",
        "'speaker_2': 'Thank you. Councilmember Swann. Any other comments? From Council members on this item. Councilmember Abbas. Haider, you come on camera to get some say?'",
        "'speaker_0': 'Yeah, I do have a few questions. I'm sorry to do that in full council. I know President Pro Tem that's not the desired place to do this. But obviously I'm concerned about the report that Councilmember Salonen just referenced.'",
        "'speaker_0': 'And I will also note that my team and I did ask central staff quite a few questions about this technology, because that is a concern of mine as well. And I do remember some of the reports and incidents.'",
        "'speaker_0': 'I know we don't typically have central staff on this call. So for the sake of maybe the sponsor and councilmember who raised the questions, I'll just point out that when I asked about the detailed images that this device, I believe, which is I believe currently you will project what I understood from the answers is that the way'",
        "'speaker_0': 'this camera works, those people don't show up. It's actually just red blobs and there's no defining images. So I'm really concerned about the state technology that was used. I'm obviously in alignment with what the concerns were that were used from that state technology, especially as it relates to last year's surveillance of protesters and the consequences of that'",
        "'speaker_0': 'and want to continue to fight against that type of technology. I do want to have a better understanding, though, about this specific technology and if it's slightly different, if it truly is just blobs versus defining or definitive images, because I would be very concerned and I continue to just sort of be skeptical about this technology in general'",
        "'speaker_0': '. But obviously in opposition to anything that would be defining for the purposes of future arrests or targeting of folks. So I wanted to get that out there because I thought I had done some research on this and had heard that it was no defining images and simply red big blobs.'",
        "'speaker_1': 'Councilmember Peterson Councilmember Mosquito, you are correct. Your research with central staff is sound. And that is, you know, the reference to an airplane was not the same technology as the King County sheriff's technology that we're voting on today.'",
        "'speaker_1': 'It's a different technology where it's just thermal imaging where you don't it doesn't show the details. That's what we're voting on today. So central step into the.'",
        "'speaker_0': 'Sorry for having not been in the benefit of the committee. May I ask a follow up question?'",
        "'speaker_2': 'Yes, absolutely. Go ahead.'",
        "'speaker_0': 'Is there any sort of signboards that are or could be put on the use of the technology so that it's not used in situations like hovering over expressions of First Amendment rights? I mean, I was understanding that this was more for a search function, and I'm not sure what the extent of that search function is, but that'",
        "'speaker_0': 'still is very different than a hovering over First Amendment right demonstration. So is there any sort of sideboards that we have currently that we could point to to how it can be used?'",
        "'speaker_2': 'So that's why this amendment that was passed in committee, we recognize that, you know, one of the things that they are required to include in these policies is a definition of the purpose in use, including circumstances where officers may request assistance from the county for these these forward looking infrared real time video content.'",
        "'speaker_2': 'So one of the amendments that passed in committee was was a recognition that that was something that was was missing and that we need to to receive is a is a is the definition of the purpose in use, even given that this is this is technology that is already being used.'",
        "'speaker_2': 'The council the committee thought it was really important to to get those sideboards in.'",
        "'speaker_0': 'Thank you very much for letting me use some time during full council asked those questions. I also understand Councilmember Herbold, I believe along comes Member Peterson. You offered a series of amendments to address a number of questions that I know I had, and I was told by central staff that some of those have been addressed.'",
        "'speaker_0': 'But I really appreciate the reminder on where those can be used. And I will continue to express concern about the state technology that was just referenced as well, and anything that would be honing in on anybody's ability to have identifying information.'",
        "'speaker_0': 'And perhaps I'll do a follow up with the Chair of Public Safety, just to make sure that we're continuing to monitor to make sure that this isn't being used inappropriately, even though we try to put some sideboards on a speedy before we know that there's been some ignoring of those rules and want to make sure that that's'",
        "'speaker_0': 'not the case with this so that it truly remains not identifiable and not used for First Amendment expression surveillance.'",
        "'speaker_2': 'Thank you. And I just want to also just very quickly want to highlight the additional amendments in case there are questions that councilmembers might have amendments included recognizing that we need to receive from a speedy policies that specifically define the timeline for deletion of images to protect the privacy of individuals not connected to any investigation.'",
        "'speaker_2': 'Policies that specifically describe how they're going to ensure that this technology is not used in a way to disproportionately surveil communities. And then lastly, an amendment that requires an annual report of the use of this technology and helicopter deployment.'",
        "'speaker_2': 'These are all areas that have been flagged for the committee by the the Technology Working Group. And council members like you who have your hand up, is that is that a hold over? You want to speak again?'",
        "'speaker_4': 'I would like to speak again just to respond.'",
        "'speaker_0': 'You have the floor.'",
        "'speaker_4': 'Thank you. I think it is important for council members who are asking these questions to look at the video themselves and see how defining the images are there before you zoom in. But once you zoom in there, that's stunning how much clarity there is.'",
        "'speaker_4': 'And if council members maintain that this is a different technology, as Governor Paterson has said, then you should hold off on this bill and show the video to the council and the members of the public and the committee meeting that is announced well in advance so that members of the public can judge for themselves whether this is'",
        "'speaker_4': 'whether or not this is a violation of their rights. And just to clarify the amendment of in committee. Obviously, I'm not a member of the committee, but the amendment that was mentioned from Councilor Herbold, what it does is, I mean, essentially it says that I approve this bill now and say that the problem, you know, that there's'",
        "'speaker_4': 'really nothing essentially to protect civil liberties. And that is a problem. We have to you know, we acknowledge that the problem exists, but it doesn't stop approval of the legislation. I don't understand how we as a legislative body can do that if we know that there is a problem and that and we know how this technology can'",
        "'speaker_4': 'be used because we have seen how it can be used. We have seen the absolutely abysmal track record of a police department that, as I quoted in briefing just a week or two ago, that in a study of 500 different police departments comes very, very close to the end in terms of its accountability and racial bias and'",
        "'speaker_4': 'so on and so forth, how it is that can justify, you know, giving this police department, this technology, I mean, to be very accurate or to be very specific. The Seattle Police Department ranked 477th out of 500 police departments that were studied.'",
        "'speaker_4': 'So it's not like it's some problems that this department is very much the epitome of things not working well in a police department. And so if councilmembers are concerned about a potential violation of civil rights by the SPD, then you should vote no on this bill today and let the committee hold hearings on the forward looking into'",
        "'speaker_4': 'real time video technology so that we can have transparency and public accountability. Thank you.'",
        "'speaker_2': 'Thank you. Want any additional comments? I am not seeing any. So with that, will the clerk please call the passage for the passage of the roll call on the passage of the bill. 12 0053.'",
        "'speaker_3': 'So, aunt? No.'",
        "'speaker_5': 'Strauss Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes. Mascara. I Peterson II Council President pro tem honorable yes. Six in favor one oppose.'",
        "'speaker_2': 'Thank you so much. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Thank you. Now, item seven. Will the clerk please read item seven into the record?'",
        "'speaker_0': 'Agenda item seven Council Bill 120054 An ordinance relating to surveillance technology implementation authorizing approval of uses and accepting the 2020 Surveillance Impact Report and 2020 Executive Overview for the Seattle Police Department's use of situational awareness cameras without recording.'",
        "'speaker_0': 'The committee recommends the bill passes amended.'",
        "'speaker_2': 'Thank you so much again, Claire Pearson. As chair of the committee, you are recognized in order to address this item.'",
        "'speaker_1': 'Thank you. Colleagues. This is Counselor 1200542 surveillance impact report covering an existing technology called Situational Cameras. Without recording, they do not record. These awareness cameras are used during crisis events, just a hostage situation. And after adopting the amendments, our committee unanimously recommended approval.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Peterson, are there any comments from councilmembers on this item?'",
        "'speaker_0': 'Thank you. Again, I feel like this is an area where I am relying on reports from the committee and also doing my research with central staff and stakeholders. I really appreciate that there is a central staff memo that's been circulated on these items and would ask for that to potentially be recirculated to the full council, especially as'",
        "'speaker_0': 'it relates to concerns that are being raised around surveillance of First Amendment rights. You know, for example, in the previous bill, my understanding was that it was not a King County helicopter. And the thermal images do not show that level of detail that was described.'",
        "'speaker_0': 'I just want to make sure that I fully understand that I was reading that correctly. That and that the verbal report back along with the central staff memo is is shared. That would be very helpful on this for having not been in committee.'",
        "'speaker_0': 'Mike, I would like to ask either the chair or the sponsor of the amendments, if you might want to just summarize a few of the amendments that you did incorporate as well to help put some sideboards on it for the benefit of full council.'",
        "'speaker_0': 'That would be really appreciated.'",
        "'speaker_2': 'Absolutely. Councilor Mosquito Comes Petition. Do you want to lead the way on on your amendment or you feel free to describe mine too, if you like?'",
        "'speaker_1': 'Actually, my amendments were the ones already approved by the existing previous technologies, and these that's just the equity metrics that are being used to report back to us on those. But I think it's it's more important for me to mention as part of this underlying surveillance ordinance, one of the requirements with all speed technologies, that is that'",
        "'speaker_1': 'the Office of Inspector General continues to monitor and report on these for us. So it's not done today. It's something we will continue to monitor for the council. And regarding Councilor Herbals amendments which do put their sideboards on the technology, look to Councilor Herbold to describe those which the committee unanimously approved.'",
        "'speaker_2': 'Or thank you. Again, this is an item that the technology workgroup identified as a priority gap in in the legislation. And it doesn't. The the bill, as it was originally drafted, did not specifically ensure that the purpose in use aligned with the limitations.'",
        "'speaker_2': 'And so in this case we wanted to make sure that there are policies that prohibit downloading or streaming images. The policy is again address retaining recorded images, but did not include the policies for retaining, downloaded or streaming images.'",
        "'speaker_2': 'So the this amendment requests that SPG enhance those policies to make sure that those those conditions are included. Any other comments or questions here? Seeing none with a clerk. Please call the role on the passage of the bill.'",
        "'speaker_3': 'The want? Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. As. Musgrave, i. Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Council president Pro-Tem Herbold. Yes. Seven in favor. None of those.'",
        "'speaker_2': 'Thank you. The bill passes and the chair will sign it. Well, the clerk please affix my signature to the legislation on my behalf. Moving on to item number eight on the agenda will be read item eight into the record.'"
    ],
    "Surveillance Technology Use and Impact Report for Seattle Police Department's Video Recording Systems.": [
        "'speaker_0': 'Agenda item eight Council Bill 120055 An ordinance relating to surveillance technology implementation authorizing approval of uses and accepting the 2020 Surveillance Impact Report in 2020. Executive Overview for the Seattle Police Department's use of Video Recording Systems. The committee recommends the bill passes amended.'",
        "'speaker_2': 'Thank you so much, Councilor Petersen. As chair of the committee, you are recognized in order to address this item.'",
        "'speaker_1': 'Thank you. Colleagues, this is the last of these Council 120055 as your surveillance impact report covering an existing camera system used only at speed facilities. After adopting amendments, our committee unanimously recommended approval. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Peterson, are there any comments or questions from council members on the presentation and passage of this bill? And I must get up.'",
        "'speaker_0': 'Thank you so much. I am again sorry to ask some questions and I'm sure you dealt with committee but council member Petersen as chair of the committee, perhaps this is for you or the President pro tem as chair of public safety.'",
        "'speaker_0': 'Did I understand correctly that this is an existing technology that we're now approving? How come SPV had approval to use it prior to today's authorization?'",
        "'speaker_2': 'That is the nature of the beast. Councilmember Petersen.'",
        "'speaker_1': 'Sure, sure. This surveillance ordinance that was originally adopted in 2017 and then refined by Council President Gonzalez in 2018 and others, this is the process where it goes first, goes through the surveillance working group, the volunteer surveillance working group.'",
        "'speaker_1': 'The department puts together report. It's reviewed by the Information Technology Department just to scope out exactly what the technology does and what the concerns, whether it is surveillance has surveillance capabilities, what concerns might be what the litigants are to those concerns.'",
        "'speaker_1': 'And it works its way through this process to get to us. And then, like I said, the Office of the Inspector General continues to monitor this going forward.'",
        "'speaker_2': 'But the thing that is at that is the case for all of the technology that all of the departments currently use at the time of the passage of the surveillance ordinance. So that's what we when we talk about the retrospective technologies, we're talking about surveillance technologies that were purchased before the passage of the surveillance ordinance.'",
        "'speaker_2': 'Our expectation is that correct me if I'm wrong, Councilmember Peterson, is that there are no future purchases of surveillance technology moving forward because we want to the expectation is that we will have three or four kinds of policies as a requirement to permit the purchase.'",
        "'speaker_2': 'But we don't have that opportunity with things that were already purchased.'",
        "'speaker_1': 'That's right.'",
        "'speaker_2': 'And as a.'",
        "'speaker_0': 'Follow up to that, maybe just to prompt or to confirm my my research as well, just because the department is using it doesn't necessarily mean that we have to authorize that. You've gone through the rigorous process in committee of evaluating the various questions and making sure that it conforms or that you have added the appropriate sideboards to'",
        "'speaker_0': 'make it align with the Council's the council's priorities. And thus it's not not just as a symptom of it being currently used and thus being authorized, but you have gone through this process with the robust input from the the committee whose name I'm forgetting right now to make sure that those questions have been answered.'",
        "'speaker_0': 'And then where there are additional side boards, you've worked on amendments and the Council also has the option to not authorize if we so deemed.'",
        "'speaker_3': 'Not.'",
        "'speaker_0': 'Necessary. Correct.'",
        "'speaker_1': 'Yeah, they were very thorough discussions at committee. We had at least two committee meetings on this.'",
        "'speaker_2': 'Thank you, Councilmember Peterson. Thank you, Councilmember Ms.. For your questions. Are there additional questions or comments on this item? Right. Seen done. Well, the clerk please call the role on the passage of the bill.'",
        "'speaker_3': 'Excellent. Yes. Strauss. Yes. Lewis.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_3': 'Morales is. Must get to. I. PETERSON.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'Council President Pro Tem Herbold. Yes. Seven in favor and unopposed.'",
        "'speaker_2': 'Thank you so much. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Moving on, will the clerk please read item nine into the record?'"
    ],
    "Pedestrian Tunnel Permit for Northwest Kidney Center.": [
        "'speaker_0': 'Agenda Item nine Council Bill 120061 An ordinance granting permission to North West Kidney Center to continue to operate and maintain a pedestrian tunnel under an across Broadway, north of Cherry Street. Repealing Section eight of Ordinance 123367 and providing for acceptance of the permit and conditions.'",
        "'speaker_0': 'The committee recommends the bill pass.'",
        "'speaker_2': 'Thank you so much. Councilmember Peterson is chair of the committee. You are recognized in order to address this item.'",
        "'speaker_1': 'Your colleagues, we have four items on our agenda today which simply renew time limited term permits that allow the continued use of a SkyBridge and three small tunnels. Each renewal is for 15 years with the ability to renew for another 15.'",
        "'speaker_1': 'This Council Bill 12 0061 renews the permit for a pedestrian tunnel between Northwest Kidney Center and Swedish Hospital. Our committee unanimously recommended approval.'",
        "'speaker_2': 'It is so much. Looking to see whether or not there are any. Council members with questions or comments on this item. Seeing none. Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Some want? Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales as. Musgrave, I.'",
        "'speaker_1': 'Peterson All right.'",
        "'speaker_3': 'Council president pro tem her vote? Yes. Seven in favor and unopposed.'",
        "'speaker_2': 'Thank you. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Moving on with the clerk he is read item ten into the record.'"
    ],
    "Continuation of Pedestrian Skybridge Permit for Grange Insurance Association.": [
        "'speaker_0': 'Gender item ten Council Bill 120074 An ordinance granting Grange Insurance Association permission to continue maintaining and operating a pedestrian skybridge over and across the alley between Second Avenue and Third Avenue, north of Cedar Street, repealing Section eight of Ordinance 123723 and providing for acceptance of the permit and conditions.'",
        "'speaker_0': 'The Committee recommends the bill pass.'",
        "'speaker_2': 'Thank you so much. Councilmember Peterson, as chair of the committee, you are again recognized in order to address this item.'",
        "'speaker_1': 'Thank you. Colleagues, this second item is a renewal of the permit for an existing SkyBridge, and it's described as described in the title of this council bill. It's self-explanatory. Our committee unanimously recommended approval.'",
        "'speaker_2': 'Thank you so much. Any questions or comments from council members on this item? Seeing none. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_3': 'So what? Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'LEWIS Yes.'",
        "'speaker_3': 'Morales Yes. Let's get to.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Peterson II Council President Pro Tem.'",
        "'speaker_0': 'Herbold Yes.'",
        "'speaker_3': 'Seven in favor and unopposed.'",
        "'speaker_2': 'Thank you. The bill passes and the chair will sign it. The clerk please affix my signature to the legislation on my behalf. Item 11 Will the clerk please read item 11 into the record?'"
    ],
    "Continuation of Tunnel Permit for BGO Plaza 600 JV LLC.": [
        "'speaker_0': 'Agenda Item 11 Council Bill 120075 An Ordinance granting Riggio Plaza 600. Permission to continue maintaining and operating a vehicular and pedestrian tunnel under the alley between Sixth Avenue and Seventh Avenue, north of Stuart Street. Repealing Section seven of Ordinance 119508 and providing for acceptance of the permit and conditions.'",
        "'speaker_0': 'The Committee recommends the bill pass.'",
        "'speaker_2': 'Thank you so much. Councilmember Peterson, as chair of the committee, you are again recognized in order to address this item.'",
        "'speaker_1': 'Thank you. This third item is renewal of the permit for a small existing vehicular and pedestrian tunnel downtown, as described in the title of the council bill. The committee unanimously recommended approval.'",
        "'speaker_2': 'Thank you so much. Were there any questions or comments on this item? Seeing none with a court. Please call the role on the passage of the bill.'",
        "'speaker_3': 'So on. Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Lewis. Yes. Morales.'",
        "'speaker_0': 'Skinner I.'",
        "'speaker_3': 'Peterson High Council President, Pro Tem Herbold. Yes. Seven and seven, unopposed.'",
        "'speaker_2': 'Thank you. The bill passes and the chair will sign it. Or please affix my signature to the legislation on my behalf. Okay. Item number. Well, for the part, please read item 12 into the record.'"
    ],
    "Continuation of Pedestrian Tunnel Permit for IC/RCDP Seattle Hotel.": [
        "'speaker_0': 'Agenda item 12 Council Bill 120076 An Ordinance granting i ici rc dp Seattle Hotel LLC permission to continue maintaining and operating a pedestrian tunnel under an across Seneca street between Fourth Avenue and Fifth Avenue, repealing section eight of Ordinance 123539 and providing for acceptance of the permit and conditions.'",
        "'speaker_0': 'The Committee recommends the bill pass.'",
        "'speaker_2': 'Thank you so much. Councilmember Peterson is chair of the committee. You are recognized to give the committee report.'",
        "'speaker_1': 'Thank you. Colleagues, this is the fourth and final item. It's a renewal of permit for an existing pedestrian tunnel as described in the title of the council bill. Our committee unanimously recommended approval.'",
        "'speaker_2': 'Thank you so much, Councilmember Peterson. Are there any comments or questions on this item? Not seeing any. Well, the clerk please call the role on the passage of the bill.'",
        "'speaker_3': 'So what? Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'LEWIS Yes.'",
        "'speaker_3': 'MORALES This was set up.'",
        "'speaker_0': 'By.'",
        "'speaker_3': 'Peterson.'",
        "'speaker_1': 'High.'",
        "'speaker_3': 'Council president pro tem vote yes. Seven in favor and unopposed.'",
        "'speaker_2': 'Thank you so much. Moving forward to item 14 on the agenda, can you please read item 14 into the record?'",
        "'speaker_0': 'President Pro-Tem, did we get your signature on the last council?'",
        "'speaker_2': 'Bill? You got me. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Thank you. So yes, moving forward to item 14, please read item 14 into the record.'"
    ],
    "Request to FAA for Property Transfer at Discovery Park.": [
        "'speaker_0': 'Agenda item 14. Resolution 32006. A resolution requesting the Federal Aviation Authority to transfer excess property around the air route surveillance radar facility at Discovery Park to the city of Seattle for Seattle Parks and Recreation Purposes.'",
        "'speaker_2': 'Thank you so much. I move to adopt resolution 32006 at second I. Thank you. It's been moved and seconded to adopt resolution 32006 member Lewis. As the sponsor of this item, you are recognized in order to address this item.'",
        "'speaker_1': 'Thank you, Madam President. Pro-Tem, as I mentioned during morning briefing, this is a project that started at the request of friends at Discovery Park, which is a citizen based organization in the Magnolia community. And beyond that advocates for Discovery Park and for enhancing the recreation opportunities at the park.'",
        "'speaker_1': 'Phil Goebel Sang, who is the president of Friends of Discovery Park, distributed a letter to the council and Parker Dawson on my staff distributed that letter just for about an suspenders to all the council offices this morning and I expressing the interest of friends of Discovery Park in this the acquisition of this parcel of property.'",
        "'speaker_1': 'In keeping with actions that other communities around the country have taken for some of the excess land around FAA towers that have been integrated for public uses and the enjoyment of the general public primarily into into parks and greenways.'",
        "'speaker_1': 'The area of Discovery Park where this current parcel sits will be well known to lots of frequent park goers. It occupies a space on top of a prominent vista near the field in the footprint of the old base where a lot of the old army buildings are located.'",
        "'speaker_1': 'With the removal of this fencing and the access of the parcel, it'll offer great views to general members of the public and will offer additional recreation activities and possibilities for the Seattle Department of Parks and Recreation to explore.'",
        "'speaker_1': 'And it should be noted that this resolution is the culmination of an extensive process of consulting with neighborhood organizations, with the Department of Parks and Recreation, and with the chair of the relevant committee, Councilmember Juarez, who was helpful in crafting the tone and scope of this resolution.'",
        "'speaker_1': 'It should also be noted that the Seattle Department of Parks and Recreation has confirmed that maintenance of this additional acquisition of land, should it be granted from the Federal Aviation Administration, would comment no increase to ongoing maintenance costs and could be absorbed within existing expenses.'",
        "'speaker_1': 'And I look forward to continuing to work with our congressional delegation, namely Senator Patty Murray and Congresswoman Pramila Jayapal, both of whom I have been in contact with my office through the pendency of creating this resolution over the past several months.'",
        "'speaker_1': 'I want to thank Parker Dodson for doing a lot of great work with the stakeholders to move this forward and look forward to eventually having this additional public space for visitors of Discovery Park to enjoy. So with that, I would urge the adoption of the resolution.'",
        "'speaker_2': 'Thank you. Councilmember Lewis, there any comments or questions for the sponsor of this resolution? I am not seeing any excited or what is being characterized as practically the most impactful change to Discovery Park in decades. So thank you, Councilmember Lewis, for moving this work forward.'",
        "'speaker_2': 'Will the clerk please call the roll on the adoption of the resolution?'",
        "'speaker_3': 'So on. Yes. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'MORALES Yes. Mosquito. I. Peterson, I. Council president pro tem her vote? Yes. Seven in favor, nine opposed.'",
        "'speaker_2': 'Thank you. The motion carries and the resolution is adopted and the chair will sign it. Please affix my signature to the legislation on my behalf. In moving through to the final items on the agenda items 15 through 19.'",
        "'speaker_2': 'Will the clerk please read items 15 through 19 into the record?'"
    ]
}