{
    "Street Name Change for East Denny Way Festival Street.": [
        "'speaker_10': 'The report of the City Council. Agenda Item one cancel 119558. Really into the city streets changes the name of the designated first street portion of east anyway between Broadway East and 10th avenue east to east Barbara Bailey way and superseding the prevalent portions of ordinance 404 for ordinance 889 ten Ordinance 102981 and other ordinances, to the extent'",
        "'speaker_10': 'and consistent.'",
        "'speaker_4': 'O'BRIEN Thank you, Counsel. Council President. I don't have much to add to the great public comment we heard in testimony from family members, friends, coworkers, co-owners and even charity cases like former Councilmember Clark. Barbara Bailey clearly is an icon in the city and in particular on Capitol Hill.'",
        "'speaker_4': 'And her loss was not just the loss to the family members and friends, but the whole city. And I'm proud to have been the sponsor of this legislation. But the credit really goes to Mayor Durkan and her team for doing the work to get this before us.'",
        "'speaker_4': 'And I'm grateful for Mayor Durkin's leadership on this. And colleagues, I think it'll be exciting when that sign goes up and we get to see that statue of East Barbara Bailey away.'",
        "'speaker_2': 'Any other comments? Please call their role on the passage of the Bill.'",
        "'speaker_3': 'Bagshaw and Zalis Herbold i. Whereas Sarah O'Brien. The Chico residents want ie eight in favor and unopposed.'"
    ],
    "Collective Bargaining Agreement between the City and the IBEW Local 77 Power Marketers Unit.": [
        "'speaker_2': 'The bill passes and the chair will sign it. Please read the report of the City Council.'",
        "'speaker_10': 'Agenda item to cancel 119553 relating to city employment. Authorizing execution of a collective bargaining agreement between the City of Seattle and the International Brotherhood of Electrical Workers. Local Union Number 77 Power Marketers Unit to be effective January 1st, 2017 to December 31st 2020 and ratifying confirming sergeant prior acts.'",
        "'speaker_1': 'Great.'",
        "'speaker_2': 'Guzman.'",
        "'speaker_1': 'Thank you very much. Thank you.'",
        "'speaker_6': 'Colleagues, for this. This legislation was referred directly to the full council. It's being proposed by our Seattle Department of Human Resources. And normally that particular department would legislation from there would be referred through my committee. But it's coming directly here today.'",
        "'speaker_6': 'The legislation authorizes the execution of a collective bargaining agreement between the city of Seattle and the International Brotherhood of Electrical Workers. That's local union number 77, called the Power Marketers Unit. It has 15 one five regular employees. And this contract will be effective January 1st through December 31st, 2020.'",
        "'speaker_6': 'And since it's already two and a half years behind, it will be effective retroactive. So the extended process of deliberation proposed a result of a three year process that began in 2016, and it reflects the extended negotiation, as I mentioned.'",
        "'speaker_6': 'So it will update wages from 2014 and it has no impact on the current budgets since it was included in our 2019 budget and funding in 2020 will be addressed by the executive first in the annual budgeting process and we recommend do pass.'",
        "'speaker_2': 'The comments I called myself before calling on the passage of the bill. This agenda item approves the union contract, as I said, negotiated with the city of the government and IBEW 77, who represent many Seattle City Light workers who maintain the power lines, substations and power plants to keep the lights on in Seattle on rainy, windy winter'",
        "'speaker_2': 'nights when a tree falls on the power lines and your power goes out. It is IBEW 77 members who go out in the storm and fix the problem. Without their work, we would have no street lights. Amazon would have no power to run their datacenters, and Nucor could not make this deal.'",
        "'speaker_2': 'These are really the ultimate green jobs providing carbon free power to Seattle and beyond under a good union contract. Seattle should add many more of these positions as part of a Green New Deal to add one generation to Seattle hydropower to export electricity outside the city, replacing the coal and natural gas power used in the region.'",
        "'speaker_2': 'These call the role of the passage of the Bill Bagshaw.'",
        "'speaker_3': 'Gonzalez Herbold II. Whereas.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_6': 'You we're calling roll on the passage of the bill.'",
        "'speaker_1': 'Oh, sorry.'",
        "'speaker_3': 'I. Mosquera I O'Brien high Pacheco I Presidents want to I in favor and oppose.'"
    ],
    "Land Use and Zoning Ordinance to Facilitate Accessory Dwelling Units.": [
        "'speaker_2': 'The bill passes and the chair will sign it. Please read the report of the Sustainability and Transportation Committee.'",
        "'speaker_10': 'Three point The Sustainability and Transportation Committee Agenda Item three Constable 119 544 Relating to land use and zoning in many sections 23.40 4.0, 11.0, 14.0, 17.0. 20.0 41. 23.40 5.5 4520 3.80 48.002.0 32.0 38 and 23.80 6.007. CNN Ms..'",
        "'speaker_10': 'Barcode to remove barriers to the creation of attached and detached accessory dwelling units and to add a floor area ratio requirement in certain single family zones. The committee recommends the bill passes amended.'",
        "'speaker_2': 'Thank you. And I know that there are amendments on this item. So if you want to make introductory comments and then take the amendments, great.'",
        "'speaker_4': 'Thank you. Helms President Yeah. So I'll make a few opening comments about this and then we can walk through maybe the amendments in order. First, I want to just give some highlights of what this legislation does do. The intent here is to make it easier for folks to build accessory dwelling units, whether those are attached or detached'",
        "'speaker_4': '. The legislation is based on well over four years of work now and receiving community feedback on what people in our communities would like to see and what kind of flexibility they would like to have or what kind of barriers they see today.'",
        "'speaker_4': 'The main changes are going to happen. One is that currently the restrictions are that you can only build an 800 square foot backyard cottage. This would allow them to be 1000 square feet. We allow them to be 1 to 2 feet taller because we heard from a lot of folks that that second floor of living space is'",
        "'speaker_4': 'very difficult to make it a habitable space, but 1 to 2 extra feet of height would make a big difference. We'd eliminate the parking requirement. We hear that the expense and the necessity of building an off street parking spot for these units is a barrier, and it goes against some of our climate values also.'",
        "'speaker_4': 'Currently, there's a limit. You can either build a backyard cottage or an accessory an in-law unit. This legislation would allow you to build both. And finally, the current requirement there is an owner occupancy requirement, meaning the owner has to live on site, will be heard from community members was often that they plan to live on site but'",
        "'speaker_4': 'making the investment necessary to add an accessory unit. And then the fear that that something might happened in their life, whether they get transferred for a job or have to move out of town to take care of a family member, they'd be required to either leave their main house vacant or kick their tenant out and lose that'",
        "'speaker_4': 'rent. That uncertainty that made it really challenging for them to make the type of investment they were hoping to make. Those are the main changes and obviously some other ones there. In addition, we heard today in comment that it would place a far limit of floor area ratio, limit of 0.5 square feet per square foot, a lot'",
        "'speaker_4': 'with an absolute minimum minimum of 2500, whichever is greater between that and lot size. Couple of things this doesn't do. I just want to clarify because we heard in public comment, current city law in the single family zone, you're only allowed to cover 35% of the lot.'",
        "'speaker_4': 'The other 65% of the lot needs to be open. This does not change that at all. So if someone commented that we could cover 65% of the law, that's not accurate. 65% of what has to be open. There's no change to what's currently allowed in the single family zone.'",
        "'speaker_4': 'Similarly, this doesn't loosen three regulations. It adds a modest regulation about adding an additional three in certain cases, but it largely leaves the existing three regulations in place, recognizing, at least for me, that I think we need to do some work to have a better tree code, but to not address it specifically exclusively in this backyard cottage'",
        "'speaker_4': 'legislation, to rather address that comprehensively. And as we heard in public comment, there's a request in energy to hopefully get something done this year, which I would fully support. With that colleagues, I'll save other comments and others questions and walk through the amendments if it's okay with you.'",
        "'speaker_4': 'Council President Starting with the proposed amendment number one on the agenda.'",
        "'speaker_2': 'Would you like to move the amendment?'",
        "'speaker_4': 'Yeah. So why don't I. I'll go ahead and move amendment number one, which is a technical amendment and just a substitute for the legislation to clean up a lot of the language, but doesn't change any of the policy issues.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'Do you speak to it?'",
        "'speaker_4': 'Do you know it? Just to clean things up, fixes typos and other drafting errors identified by central staff. So I'd move to substitute version D six for D five, which is amendment number one.'",
        "'speaker_6': 'And I think you've.'",
        "'speaker_2': 'Got to got a second already. Any comments on the amendment? Those in favor of amendment number one. Please vote and raise your hand.'",
        "'speaker_1': 'I had.'",
        "'speaker_2': 'Those opposed. Vote no. Raise your hands. The motion carries and the amendment is adopted.'",
        "'speaker_4': 'The Second Amendment is being proposed by Councilman Pacheco. So I defer to him to speak to this and make a.'",
        "'speaker_5': 'Motion.'",
        "'speaker_2': 'To reject.'",
        "'speaker_5': 'I am proposing this amendment to recognize that as we add more households and greater density to our single family neighborhoods, we should also be expanding opportunities for folks to get around by bike or other future mobility options in those areas.'",
        "'speaker_5': 'This amendment would incentivize building bike parking in dads by exempting up to 35 square feet of bike parking area from the maximum size of a dad to you. It would also request that start looking to opportunities for expanding bike public bike parking in single family zones, which I believe should be a priority as we add more density'",
        "'speaker_5': 'and as bike and scooter programs expand in our city. I hope I can count on your support for this amendment.'",
        "'speaker_2': 'We need a second for volume. It's been moved and seconded and introduced by Councilmember Pacheco. Any other comments?'",
        "'speaker_4': 'I'll just say, Councilman Pacheco, I really appreciate your work on this. To find a creative way to make this happen and your commitment to to not penalizing folks that are creating that extra space for alternative transportation modes. Thank you for your leadership on that.'",
        "'speaker_2': 'Any other comments? Those in favor of amendment number two, please vote and raise your hands.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Those opposed would know the motion carries and the amendment is adopted. Number three, Councilmember O'Brien, I believe you are moving this.'",
        "'speaker_4': 'I am moving this. We've had a lot of discussion throughout this process, including a committee about the impact that short term rentals may have on on the use of accessory dwelling units in backyard cottages. We did a pretty extensive body of work around short term rentals about a year and a half ago when we put those regulations'",
        "'speaker_4': 'in place. Just to be clear, what those regulations allow is that individuals in the city of Seattle may use their primary residence as a short term rental. So if that's a single family home, they can either rent out a guest room in that single family home, or they can rent out the entire home while they're away on'",
        "'speaker_4': 'vacation or traveling or whatever that might be. And they could have a second unit to use an accessory as a sorry, as a short term rental. So that would allow someone, in addition to their primary home, to own a second unit.'",
        "'speaker_4': 'It could be a single family home. It could be a townhouse. It could be a condo. It could be an accessory unit. But they could just have their primary. Plus one other unit is what the limits are. I think that there is a possibility as we look forward and if we think short term rentals is more broadly'",
        "'speaker_4': 'is a challenge to our our housing needs. I would certainly be open to considering changing that, but at the moment, I don't think it's fair to limit what people can do in an accessory unit beyond what's already defined versus what people could do by owning single family homes, townhomes, row houses, the like.'",
        "'speaker_4': 'But I do think it's important to watch what happens. And we have language in the bill already that directs the Office of the Finance Administrative Services, which authorized short term rental use to monitor the license. And we also request sale department of construction inspections to work with that fact, identify other recommendations as appropriate to modify the legislation'",
        "'speaker_4': 'with this thing. With this amendment would do with ADD the language that basically sets the council's intent and says if this report would reveal that a significant number of accessory dwelling units are being used solely as short term rentals, the City Council intends to impose additional restrictions or a prohibition on short term rental use and accessory dwelling'",
        "'speaker_4': 'units. So I would go ahead and move amendment number three.'",
        "'speaker_1': 'Second.'",
        "'speaker_2': 'It's been moved and seconded and described by Councilmember O'Brien. Any other comments on this amendment that the members get it?'",
        "'speaker_7': 'Thank you, Madam President. And I want to thank Councilmember O'Brien for your leadership on this effort overall and especially for this amendment. I think that many of us share the desire that you've just articulated and one that we've heard from council are in these council chambers before, which is to make sure that we are meeting our goals'",
        "'speaker_7': 'of creating greater long term rental housing options in Seattle. And what is clear from the data is that speculation has not materialized. In fact, we've seen in other similar cities like Portland that the units that are being created as backyard cottages are detached dwelling units, accessory dwelling units are in fact predominantly being used for long term housing'",
        "'speaker_7': 'rentals and not short term housing rentals or or vacation rentals. So the first line from the Seattle Times editorial board said data and research ought to guide the city council as they consider policies that would would address housing.'",
        "'speaker_7': 'In fact, we are exactly doing that. We're using data to drive the policy solutions. The data shows from the report that was presented in your committee just a few weeks ago shows that overwhelmingly, two thirds of those who currently have a backyard cottage in Portland, for example, have lived in their homes in the primary residence or own'",
        "'speaker_7': 'their home as the primary residence for longer than five years. And if you count those who own or are live in the primary residence for greater than one years, 95% of people actually have that owner occupancy self-imposed because they've owned it for a longer than one year.'",
        "'speaker_7': 'And when you ask the question, how are these rental units being used? Who is occupying them? 74%. So three quarters of the individuals that are renting these units that have been created because of the allowance of backyard cottages are long term rentals and also to friends and family.'",
        "'speaker_7': 'The vast majority are being used for long term rentals and for friends and family. This is exactly what we want to do. We're using data driven solutions to get to our our desire to create greater stability for rental units and for greater affordability.'",
        "'speaker_7': 'So I'm very excited that you've put forward this legislation. I think that it's rooted in what we've heard from community over the last few years, frankly, about how we can create access and fewer restrictions to these rental units.'",
        "'speaker_7': 'And community partners believe that the language that you've already worked on from my conversations with folks is going to help us get there. Looking forward to looking at the data that comes in from our own city. But I think it's important that we underscore we are absolutely using data driven solutions here, and the data has shown that'",
        "'speaker_7': 'the speculation has not occurred. Thank you for putting forward this amendment.'",
        "'speaker_2': 'Those in favor of amendment number three. Please vote I and raise your hands.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'There are no opposed. So the motion carries and the amendment is adopted. Are there any other amendments? God forbid? Horrible.'",
        "'speaker_8': 'Thank you. So I move to amend Council Bill 11 9544 by amending Section five as shown in Amendment four. And I will pass this out. This was distributed via email, but it is not attached to both agendas. It was distributed this morning before noon per our council rules.'",
        "'speaker_8': '1159 I think that might be right. This is the same amendment that was discussed in the committee. I think I'll wait for hopefully I might get a second.'",
        "'speaker_4': 'Sustainability Transportation Committee. I do not support the amendment, but I'll give you a courtesy.'",
        "'speaker_8': 'Secondly, appreciate the courtesy. Second, thank.'",
        "'speaker_1': 'You.'",
        "'speaker_8': 'Yes. So this was this amendment was discussed in the Sustainability and Transportation Committee and it we had a vote on it. It was voted on 2 to 2, not passing. I had two amendments in that particular meeting. The First Amendment was to focus on my desire for us to really make sure that this strategy of accessory dwelling'",
        "'speaker_8': 'units is really being focused on rental housing. And so it was the intention of the amendment was to as as we voted on it was to really drastically limit the conversion of these units to short term rentals. The I'm not bringing that amendment forward again because I've taken a look at sort of what the numbers are as'",
        "'speaker_8': 'relates to the residential housing market. And the Puget Sound Stage 2016 report indicated that at that time in the city of Seattle, there are about 2800 short term rental whole units of about 357,000 residential housing units in the city.'",
        "'speaker_8': 'So that works out to be less than 1% and 7/10 of a percent. So if you take a look at what's anticipated under the EGIS for ADU development over the next ten years, the the estimate is about 4400 units per year.'",
        "'speaker_8': 'I'm sorry, over ten years or 440 units per year. That works out to be about 35 of the units becoming short term rentals. So I have been I've been reassured that my concerns about that, I think it's good to put them on hold until we have more information.'",
        "'speaker_8': 'So I appreciate Councilmember O'Brien's amendment to study this issue. I am still concerned about the speculative market shifting to take advantage of these new regulations. And so the Second Amendment is one that is focused on trying to address a speculative market that will flip these units and in such a way that will have a displacement impact on'",
        "'speaker_8': 'on renters. So just for clarifications sake, this amendment would require one year ownership before permitting the second ADU. It is not a owner an owner occupancy requirement. It's not about whether or not renters make good, good neighbors at all.'",
        "'speaker_8': 'And it is not an additional year. So folks who who own a house and have done so for a year or more, which is the vast majority of homeowners in the city, could build to 80 use immediately. But what this this does is the study area showed that 80% of the study area for the new legislation was'",
        "'speaker_8': 'currently owner occupied and 20% of that study area was renter occupied. So it also fine found the EIA has found that there is a chance of of. Basically the properties being flipped and and that also aligned with the 20% number.'",
        "'speaker_8': 'So 20% of the use being built being built under these, again, speculative market conditions. And it's true that we don't know for sure about what's going to happen in this market, but we do know what's been happening in other cities.'",
        "'speaker_8': 'And there's no reason to believe that this isn't already happening here. We just haven't done an analysis of how has happened here. So Fortune magazine says single family home rentals have long been dominated by local entrepreneurs, mom and pop investors.'",
        "'speaker_8': 'And historically, when bigger fish such as head, foot, hedge funds and real estate investment trusts invested in real estate, historically, they focused on apartment buildings. But the historic housing crash of the 2000s changed the math. And over the past seven years, those investors have amassed a substantial portfolio, some 300,000 houses.'",
        "'speaker_8': 'And all these players include Imitation Home, a Reef that is the product of a merger of rental divisions of several investment firms, including Blackstone, Starwood Capital and Colony Capital, American Homes for Rent in Amherst. All of these landlords use automated house hunting to fuel their growth.'",
        "'speaker_8': 'The Wall Street Journal says big private equity firms, real estate speculators and others that buy properties can prize more than 11% of all home purchases in 2018. These investor purchases are the highest on record and nearly twice the levels before the 2008 housing crash.'",
        "'speaker_8': 'The New York Times writes Trends are being spurred by a fast growing industry that promotes an investment in single family homes, lenders who provide the capital, brokers who handle transactions, wholesalers who buy homes by the dozens and sell them before they even take possession.'",
        "'speaker_8': 'Finally, The Guardian writes that the UN's housing adviser has accused private equity firms and one of the world's largest corporate residential landlords, Blackstone Group, of exploiting tenants, wreaking havoc in communities and helping to fuel a new global housing crisis.'",
        "'speaker_8': 'Blackstone's business practices include massively inflating rents and imposing array of heavy fees and charges for ordinary repairs. So when you take this this 20% number, 20% of the the units that are currently renter occupied and you look at this that says that those are properties that that could be flipped and the renters displaced.'",
        "'speaker_8': 'I asked myself, how many families does that represent in a year? And again, using the the numbers in the egis of 440 new adus a year that could displace 80 families a year in our city. And so this amendment, again, we don't know what's necessarily going to happen in this housing market, and we can't prohibit speculative development'",
        "'speaker_8': '. But the amendment would create a speed bump as a disincentive for speculative development, creating a more cautious approach in case, you know, the assumptions that we have about development are wrong. This would provide a small disincentive.'",
        "'speaker_2': 'Thank you, guys.'",
        "'speaker_4': 'Thank you. Councilmember Herbold, I appreciate the concern and the intent of this, although my concern and the reason I oppose this is what I see is actually happening with backyard cottages and accessory units, is that it is typically who are the folks we heard from today are our neighbors who want to build this.'",
        "'speaker_4': 'And if someone is to buy a, you know, a new house or if they if someone buys a house in a neighborhood and they're moving in and they're doing a remodel at that point before they move in and they want to add two units at that point, because that would be the logical time when they're under construction'",
        "'speaker_4': 'to do it. I think that is a good thing. And I want to be clear that the I'm not sheepish about folks having two accessory units on a lot. The point of this legislation is I hope that we see two accessory units on a lot of single family lots because I think that's going to be good for'",
        "'speaker_4': 'our neighborhoods, but allowed new opportunities for people who can't afford to live in some of these neighborhoods, to live in those neighborhoods. And it might help the homeowner, too. And I think the logic of doing that all at once, as opposed to saying, I'm going to come in and remodel the house or whatever and that accessory.'",
        "'speaker_4': 'And then I have to pause for a year until I can add the second one will significantly add costs and disruption. And I think that that is the reason not to do this, to allow it to move forward.'",
        "'speaker_8': 'May I ask a clarifying question? The scenario that you're describing, though, that is not the that is a scenario for somebody newly by buying a property, correct? Not for people who currently own their homes and want to.'",
        "'speaker_2': 'As a member. Any other council members want to speak? That's why Pacheco.'",
        "'speaker_5': 'So I voted against this amendment in committee and will be voting no again today. We are voting on this legislation because we need more to use in Seattle to provide more people with housing options. And I'm concerned that this amendment would make it more difficult and costly to build a second adu.'",
        "'speaker_5': 'I do share Councilmember Herbals of concern about speculation, but between the rise and trends in other cities have not found compelling evidence that any reform will cause speculation without data supporting that concern. I don't think now is the time to restrict any development.'",
        "'speaker_5': 'That said, this legislation does include regular reports of the Council on Area Development Trends. So I am voting no today if a future council wishes to address any potential challenges. They can do so at that time.'",
        "'speaker_2': 'I wanted to add a couple of comments to this before earning it. De Guzman memorable to close it out because it's our amendment. I really appreciate Councilmember Herbals efforts on making sure that we really speak up against speculation against corporate developers.'",
        "'speaker_2': 'I am really strongly supportive of all of those points, but I also would echo the point that Councilmember O'Brien made. And in addition to that, I will be voting no as well on this amendment. But in addition to that, also say that absolutely we have to be pushing back against the for profit market.'",
        "'speaker_2': 'But again, as other council members have said, the data is not only showing that speculation is much more is very rampant in the building of towers of luxury units and row houses. I have not seen any speculative edu bubble anywhere.'",
        "'speaker_2': 'And so I think that what we should be doing instead is passing this bill through and then also fighting for rent control and a massive expansion of social housing, which is high quality, publicly owned housing. Duncan Burble.'",
        "'speaker_8': 'Sure. Yeah. The only closing remarks I have is again, the this showed that at at most with an amendment like this, perhaps 80 units a year might not get built. We also know that 20% of the study area represents rent for households, 80 units approximately.'",
        "'speaker_8': 'So again, this is about preserving the housing for 88 families a year who rely on that rental housing and trying to make sure that those properties aren't flipped over to a speculative market.'",
        "'speaker_2': 'Think you guys were bold? Those in favor of amendment number four. Please vote and raise your hands.'",
        "'speaker_8': 'I.'",
        "'speaker_2': 'Those opposed. Please vote no and raise your hands. No, no. The motion fails and the amendment is not adopted. Are there any other? So I think we're done with the amendments, as far as I understand such comments. Yes.'",
        "'speaker_2': 'Yes, I was about to say that. Yes, please. Do you want to just close it out? Sure.'",
        "'speaker_4': 'I like I love to say a few words and let my colleagues make some comments and then if I can wrap up, if that's okay, I want to I want to thank my colleagues. I want to thank folks here today.'",
        "'speaker_4': 'I know that we heard mixed comments today, as we have throughout the 3 to 4 year process. We've been working on this. And I know some people will feel like this is a win. Some will feel like it's a loss, some feel like it's mixed.'",
        "'speaker_4': 'But I think it's often asked. I often get asked, why did it take so many years to pass a piece of legislation that we're talking about, 4400 units, actually, like about 2400 units, additional units being built in the next ten years.'",
        "'speaker_4': 'And I think it's a fair question because there's a lot of work that people have done for a relatively modest shift in what we predict will happen in our neighborhoods. But I also think the reason folks have engaged at such a deep level is because there's a fundamental question about what are we going to do in our'",
        "'speaker_4': 'single family zones and what's appropriate. And I do think that that's why this has taken so long. That's why so many folks have been engaged. And I think it's been a really robust conversation and important conversation. It's an important conversation for Seattle to have.'",
        "'speaker_4': 'And frankly, it's a conversation that's happening in high cost communities around the country right now. And I believe that in a city where our single family zoning represents about three quarters of the residential zoning in the city of Seattle.'",
        "'speaker_4': 'And in a city that's been growing as fast as Seattle has, we've seen the population in our single family zones decline over years because there's really not capacity to add additional housing in the single family zones and because household sizes are continuing to shrink in our country and in our city.'",
        "'speaker_4': 'As a result, this big chunk of land that set aside for single family zoning is housing fewer and fewer people. And I think this is an opportunity to to to stem that trend, to allow additional units to allow smaller units that will be more affordable, as we've seen the evidence from other cities.'",
        "'speaker_4': 'And my colleague, Councilman ROSQUETA, pointed to so eloquently, these are often rented at or below market rate, often to friends, families and neighbors. And well, it is relatively modest. Modest both in terms that I don't think this is going to solve solve our housing crisis, nor do I think it's going to radically transform our neighborhoods.'",
        "'speaker_4': 'I do think it asks a big question of what are we going to do with our single family zones going forward and who gets access to those and who is locked out because of the pricing? There's a lot of comments we made.'",
        "'speaker_4': 'We don't know exactly how that's going to play out. We have a lot of evidence from what's happened in similar cities, and so I believe that that's probably what will happen here. But we will clearly be watching this closely as it moves forward.'",
        "'speaker_4': 'And I believe this is going to be an opportunity to invite so many more people into some of our most exclusive neighborhoods in a way that will really strengthen those neighborhoods, still make them more diverse from an economic, more diverse, racially, more richer, also not rich.'",
        "'speaker_4': 'And in terms of financial wealth rich, but in a rich of like richness of humanity. And those additional people will be supporting the businesses and make those businesses stronger. That means transit ridership will have be able to be served better by transit.'",
        "'speaker_4': 'And I think it will make our schools more mixed parks that are used. And I think it overall, it's a really beneficial thing for our community. I know that some folks are disappointed, some folks are thrilled by what I think will happen in a few minutes.'",
        "'speaker_4': 'But I really appreciate everyone's engagement on this and look forward for the conversation about our single family zone. So continue. I'd like to reserve a just a minute at the end, but I will step back and let my colleagues make some comments.'",
        "'speaker_6': 'Thank you. Councilmember O'Brien. Thank you so much for your words and your leadership on this. And I want to acknowledge the division that this particular legislation has had. The whole ADU complication and the discussions we have had over the last decade has been amazing to me, whether it's the owner occupancy rule or parking, whether or not we'",
        "'speaker_6': 'should deal with size of lots. And even among some of my favorite architects and designers, I have heard and received dozens of emails even this weekend and as early as 630 this morning, I'm still having debates with people about whether or not the legislation goes too far or doesn't go far enough.'",
        "'speaker_6': 'So I do recognize that there is a division and there is a concern about this. But frankly, I am a big fan of these ideas and to use in residential zones. I lived in a single family home for 20 years in Lake Forest Park.'",
        "'speaker_6': 'My husband and I now live in a condo downtown. But one of the things that was terrific about our place downtown is that we were able to move my father into a unit that was right next door to us.'",
        "'speaker_6': 'Now, had we had the single family home, we had looked at having a detached dwelling unit for him in Lake Forest Park. I think one of the most important things about expanding this legislation is that we can focus on the all ages and abilities part, and that's something I've been advocating for for years, making sure that seniors'",
        "'speaker_6': ', if they chose, could stay in their house, have a place they could rent out, or the reverse, which is something that we're hearing, particularly in some of the larger homes. Our seniors would like to stay in their neighborhood.'",
        "'speaker_6': 'They have their community, they want to stay there. But it's easier for them to have a nice, detached auxiliary accessory dwelling unit or even one that is attached where their family can move into the home. We've seen that happen in some of the other cities such as Portland, Los Angeles, Austin, that are daddy friendly.'",
        "'speaker_6': 'We're going to be taking another step forward. And once again, people will be looking at how is this impacting us? How does it impact our neighborhoods? And I really respect the Third Amendment, Councilmember O'Brien, where we're going to be looking at what actually happens, allowing space and some grace that if we need to change this again next'",
        "'speaker_6': 'year, that we can. I'm also believe a real believer that allowing for flexibility in what these designs look like so that somebody who has a disability can build something that is going to accommodate him or herself. And I believe this is going to be a real opportunity for us.'",
        "'speaker_6': 'And with regard to the no onsite parking requirements, I'll tell you, that's one that I scratched my head over and struggled with, talked to a lot of people about, ultimately believe that not everybody in the city does have a car, wants to drive a car, and where these neighborhoods are going to accommodate it, there is transit, there's'",
        "'speaker_6': 'Lyft. There's other opportunities for people to get around. As one young woman said earlier that she uses her feet to get around. That's a good thing for all of us. So I concluded that I can live with this no parking requirement for now.'",
        "'speaker_6': 'Again, I'd like to see what kind of an impact that has on the neighborhoods and if it has a negative impact. I'd like to look at our opportunities once again and see what we we can do or should be doing with those.'",
        "'speaker_6': 'So just in short, I'm an advocate for the cottages, for the in-law suites. I want to acknowledge what Rex Holbein has done with the BLOCK Project. Someone brought this up earlier. I want to say thank you to the air.'",
        "'speaker_6': 'Those of you that have contacted me over the years and it hasn't just been for the last year, we all went to Portland in 2011. It was the first time I had seen what could be accomplished for a relatively, I think, financially frugal amount of money in people's backyards.'",
        "'speaker_6': 'I also want to acknowledge the fact that what we're trying to do here is not discriminate against renters. Everybody who spoke today acknowledged that as well. But the next step, I think, is financial innovation. What we can do, what options are available to encourage emergence, emerging loan projects, or more available financing options around capital for construction.'",
        "'speaker_6': 'And we will just see what we can do, I think, in the city. I'd love to see if we couldn't be a leader in that front. So just in sum, I believe that this is a change that is important, as Councilmember Moscovici said.'",
        "'speaker_6': 'Thank you. It is data driven. I was quite surprised when I read the editorial from The Seattle Times suggesting that we weren't thinking about that. But I'm really glad that we are embracing and welcoming people who want to live in our beautiful neighborhoods.'",
        "'speaker_6': 'And I'm glad that we can help move this forward. So I'll be voting. Yes.'",
        "'speaker_2': 'Thank you. Any other comments?'",
        "'speaker_7': 'I'll go next. If I may.'",
        "'speaker_1': 'Please do. Okay.'",
        "'speaker_7': 'Thank you. So this legislation obviously has been a long time in the making. I want to give a special thanks to Councilmember Mike O'Brien for all of the years of work that you have been doing on this particular piece of legislation.'",
        "'speaker_7': 'Thank you so much for your steadfast commitment and dedication to making sure that we have a path forward for additional housing choice. And I just want to acknowledge and recognize all of the countless number of hours and days and weeks you have spent on really championing this.'",
        "'speaker_7': 'So thank you so much for all of that. So I really you know, I think it's important for us to acknowledge that what we're doing here today is is really, at its core, a modest change to existing law and the code as it exists.'",
        "'speaker_7': 'It is not a massive zoning change, despite what you may be reading in some of the print media. And frankly, I think that that recycled and reused rhetoric, rhetoric does not make it true just because you keep saying it.'",
        "'speaker_7': 'So currently, we already allow single family homes, three units on each lot. This legislation will address barriers to construction for many homeowners who want to see natural density in their neighborhood and welcome more neighbors in the course of doing so.'",
        "'speaker_7': 'Some of the same rhetoric out there that have led many to believe that Adu and Adus and Triplexes are the same thing as Oh Adu and Daddy you construction will lead to a three story structure next door to a single family home is simply just not true, nor is it the reality.'",
        "'speaker_7': 'Well, they can have the same number of units to use in in dad, who's by definition are auxiliary to the single family home already on the lot as basement apartments or backyard cat cottages. And I don't believe there is such a thing as too much housing in a city that is growing as quickly as the city of'",
        "'speaker_7': 'Seattle. And this bill will help to bring more housing to every single neighborhood. My support for this legislation is about creating more housing choice for everyone. We have a lot of work to do to build the amount of housing Seattle in this region needs now and in the future.'",
        "'speaker_7': 'We need more permanent supportive housing. We need more deeply affordable housing. And we also need this kind of housing. ADU And to use our housing options that can be affordable as well, as well as fill some of that need for the missile missing middle housing more than any of these options.'",
        "'speaker_7': 'What I've heard from more than any of these options, what I've heard from constituents about it, using the Ada's as that, is that this will be their plan to be able to age in place and still stay in the city or how their kids, now or soon to be young adults can find an affordable place to stay'",
        "'speaker_7': 'in an increasingly expensive, competitive housing market. Adu and ADAS can mean multigenerational housing for families to stay close but still have space and independence. And I had an opportunity to attend some of the charrette in community that were led by the Department of Neighborhoods and heard this theme over and over again from people who were interested, not'",
        "'speaker_7': 'speculators, not developers, ordinary single family home owners who are looking for that tool that way to continue to be able to stay in their house while also welcoming more people into the neighborhood. And I think that that is the intent that is driving my vote in favor of this legislation.'",
        "'speaker_7': 'We have a housing shortage. This is felt by many residents of Seattle, particularly for renters and for households who have zero or limited options when it comes to housing. Just last week, Harvard's Joint Center for Housing Studies joined the chorus of research and data.'",
        "'speaker_7': 'I said, research and data with their 2019 National State of Housing report adding to what we know about the state of housing in the Seattle area. One stark statistics show that the cost of land in King County has changed 86.4%, and housing construction overall has not kept pace with household growth in the last eight years.'",
        "'speaker_7': 'With expensive land costs, adding more ADAS and ADAS is one strategy to minimize land cost while building more housing on the footprint that currently exists. That same report showed that since 2011 there has been a 54% decline in housing units that are considered affordable units in this region.'",
        "'speaker_7': 'More and more households are becoming increasingly, increasingly cost burden, paying more of their income towards rent. We need more housing and we need more housing choice. For me, as a policymaker, I will not leave any policy tool off the table that will help bring more housing units to our growing city.'",
        "'speaker_7': 'This also means I will work with my current and future colleagues to identify ways to make this. A reality and accessible for every homeowner and neighborhood. In Seattle, for example, as Councilmember Bagshaw already referenced, there's exciting work being done in place in other places to help us in this space.'",
        "'speaker_7': 'In Portland, Oregon, for example, there are non-bank community lenders like Craft three that help homeowners finance ADU Construction. Our Office of Housing has an attitude Adu financing pilot for low income homeowners as well. So I would like to continue to develop those those creative financing options and also work with our state legislators, along with my colleagues on'",
        "'speaker_7': 'council, to have more of these tools available for Seattle homeowners to be able to access a financing, to be able to bring their Adu and Dadu plans to a reality. I also wanted to take an opportunity to to share a constituent perspective that I received over the many several last weeks that we've all been getting inundated with'",
        "'speaker_7': 'emails. And and I think this is important because there have been some comments during public testimony that somehow, as nine elected officials up on this dias who represent the city, that we have our heads stuck in the sand or that we don't quite get what's happening in the city.'",
        "'speaker_7': 'I, I take great pride in reading the emails that I received from constituents, and I also take great pride in just having conversations with my neighbors and moving about the city like an ordinary person would do, and engaging with folks about about their stories.'",
        "'speaker_7': 'And there's one constituent who shared a personal story with me in response to a newsletter that I recently sent out on this particular issue. And she shared with me that she had been a resident since 1959. And she has also seen how Seattle has changed over the decades to become an increasingly complex urban environment.'",
        "'speaker_7': 'But she also is the owner of a mother in law apartment in her home, as well as the owner of a short term rental. She tells of told me that without the income from these two units that she rents below market rate, but she's chosen to rent below market rate.'",
        "'speaker_7': 'She wouldn't be able to keep her home and she would no longer live in the city of Seattle. She shared with me that she feels a sense of security from having people come and go living their lives and looking out for each other along the way.'",
        "'speaker_7': 'Having an edu and short term rental to her humanizes the city. The diversity this has brought into her neighborhood and life is good for anyone. That is her belief. And she encouraged me today to take a bold step and vote in favor of this legislation, and I couldn't agree more with her sentiment.'",
        "'speaker_7': 'So today I will be voting in support of this legislation. And I want to again thank Councilmember O'Brien for years of dedication and seeing this code change through. Your leadership on this issue will help to eliminate some of these barriers to bring more ideas and ideas to every Seattle neighborhood.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'So it doesn't almost get him.'",
        "'speaker_7': 'Thank you very much, Madam President. And I'm really excited about today. I'm really excited to applaud Councilmember O'Brien and your entire staff. I see current and former staff back there. I know you've been working on this for a number of years.'",
        "'speaker_7': 'My staff has helped us get over the final finish line with your office, and I just can't thank you enough for your leadership on this effort. So thank you for shepherding this forward. Over the last four years, this is a really exciting day for us to put forward a piece of legislation and I think vote on it'",
        "'speaker_7': 'that includes the right balance to make sure that there is access to more housing options around the city and to make sure that we're mitigating against the speculation in the market that we've heard so much about and that we're concerned about, but doesn't seem to be playing out in other cities.'",
        "'speaker_7': 'We're also figuring out how to set the foundation for future rezoning to correct past historic wrongs. And this is one important key piece of the puzzle as we try to address the housing crisis across the city. And there's a few issues that have come up.'",
        "'speaker_7': 'And I want to thank the folks from the air who were here, the architects who have also raised some of the issues that we've heard from some of the people who are concerned about this legislation not going far enough regarding permitting.'",
        "'speaker_7': 'And we did see some of that as well in the Seattle Times editorial piece, and I'm going to address that. I think that we do have a lot to do to help improve permitting. That is something that we can do and also pass this legislation today.'",
        "'speaker_7': 'We are also concerned about some of the fees that we've heard about that our friends at the King County Council are also trying to address. Some folks have talked about a $10,000 hook up fee for sewer that could be too costly for many people.'",
        "'speaker_7': 'And we're working in partnership. And I just got great news that the King County Council is taking this issue up in the third quarter of 2019. These real issues that she brought to us are things that we've heard and we can address by working together.'",
        "'speaker_7': 'But we have got to pass this legislation today. So I'm going to commit to you to continue to work on this because I'm not lame and I'm really excited about action and I'm really excited about the foundation. I'm going to use that pun intended that is being set here in this legislation for future rezoning.'",
        "'speaker_7': 'Until 65 days ago, I was a renter and have been a renter my entire time in Seattle. I in that time that I was a renter and for example, in Queen Anne, when I lived at 10th and Olympic, had the chance to hold the door open for my neighbor who was leaving that day to go get married'",
        "'speaker_7': '. I had the chance to go visit my other neighbor who was in the hospital because he's a World War Two vet and was in home care and had just had surgery. I had the chance to hear from my husband about how he literally carried home our elderly neighbor, because she fell while walking her dog and carried her'",
        "'speaker_7': 'home to her house. We've walked our our neighbors dogs. We've been there to take care of our friends as as if they were family. Renters are good. And not only are they good, Seattle is already a rental city because 52% of our residents who make up Seattle, they are residents, they are renters, and they absolutely need more'",
        "'speaker_7': 'options around the city. So I'm excited about putting forward with you our leadership, the opportunity for more people to be able to afford to live in this city. Accessing the limited rental units that we have has continued to shrink over and over the years as we've seen a 20% increase in the population size in just the last'",
        "'speaker_7': '6 to 8 years. And as that population has increased, we have not been able to address the housing crisis that's in front of us, mostly because of litigation and delays. And today we're responding to that need that we see in our community for more affordable rental units, to address the increase in population and to address the fact'",
        "'speaker_7': 'that we need more folks to be able to afford to live in the city. And hopefully creating an accessory dwelling unit, a detached dwelling unit in their backyard helps more people also stay in place, agent place, and not be pushed out of the city.'",
        "'speaker_7': 'I think that this bill that you have in front of us helps to address the acute housing shortage that, frankly, has been exacerbated by an influx of the increased population. But the reason that it's exacerbated is we already had an insufficient housing supply that was rooted in exclusionary housing and zoning issues, that was rooted in redlining and'",
        "'speaker_7': 'racist policies of the past. And as we take bit by bit to address the policy changes that are needed. Again, we know that there's no one single policy solution, but we have got to have the political courage to pass the public policy to undo past wrongs and past public policy that left so many out of our city'",
        "'speaker_7': '. I'm really excited also that this legislation helps us create the ability for to get away from the owner occupancy requirements. I'm going to also flag that one day. I think we should change the size requirement so that maybe more people can afford to own that parcel and we can have smaller lot requirements so that more people could'",
        "'speaker_7': 'potentially have the ability for first time homebuyer options like I just had. I want to just the second thing that has come up, I think repeatedly over the last few weeks, you know, many of us sat up here just last week and we all signed a commitment to address the climate.'",
        "'speaker_7': 'Crisis. We all signed a commitment to address the Green New Deal, and as we put forward our solutions around it, we have got to recognize that the largest contributor to greenhouse emissions and pollutions is car emissions, and we are now the third largest mega commuter city in the entire country.'",
        "'speaker_7': 'Part of the reason that people are having to commute for such long distances is because we haven't created that affordable housing. So this is exactly how we live our values as a green city. This is exactly what we should be doing to address the impacts of environmental encroachment that is created by sprawl when we are not creating'",
        "'speaker_7': 'the ability for folks to build in our city. This is how we move forward with our commitment to, in part, address the Green New Deal that's so needed. So I'm really excited because the housing that we're now permitting will allow people to live near their schools, live closer to grocery stores, live closer to health centers.'",
        "'speaker_7': 'And this, coupled with additional housing and zoning changes and our commitments to bike lanes and scooters, legalizing scooters and more busses and more dedicated bike dedicated bus lanes, I think, helps to address the public health crisis that's been created by not having sufficient housing in our city.'",
        "'speaker_7': 'Again, this is an intersection of climate, public health and affordability goals. And I'm really excited because we know that also when we when we create smaller dwelling units, we can reduce our carbon footprint because they're more efficient and they consume half as much energy as these larger units.'",
        "'speaker_7': 'And I'll just wrap up by saying, you know, the other environmental component of this is we're protecting the land that is potentially getting encroached upon by sprawl like forests and parks and farms and wildlife habitat. That's the land we should be protecting, not past policies that have excluded folks from living in the city.'",
        "'speaker_7': 'And I do think that we have an opportunity in combination with the language that you have helped to champion with mandatory housing affordability that allowed for greener setbacks and tree protections and make this language that we've put in front of us today.'",
        "'speaker_7': 'Thank you for including my amendment a few weeks ago that allowed for rooftops to be created so people can have gardens and rooftop spaces as we think about denser living situations. I know that having access to a rooftop and allowing people to get some sunlight is really important.'",
        "'speaker_7': 'Allowing them to build or to grow in their own garden and things like that will be really beneficial. Add to the city. And thank you for helping to address the FAA requirements needed so that more people could have rooftops.'",
        "'speaker_7': 'I want to thank my friend Sam, who let me come over to his dad, who recently had a two bedroom tattoo in District five. And we had the chance to see how that the mother of the family that lived there was able to live near her kiddos, care for her grandkids, and to not have to commute 2'",
        "'speaker_7': 'hours to come see them in there helping to care for the family. This is about intergenerational commitments to create additional affordable housing throughout the city, helping more people stay in the city. And my hope is that we do more to address the the need for us to build on this.'",
        "'speaker_7': 'The headline from Sightline a few weeks ago said, A duplex, a triplex and a four plex can cut a single block's carbon emission by 20%. So today is a good first start. Really excited to work with you on the next efforts as this full council continues to address the housing crisis throughout this year.'",
        "'speaker_5': 'Let's hope.'",
        "'speaker_2': 'Councilmember Herbold was next and then Councilmember Pacheco. Okay.'",
        "'speaker_8': 'Good. Thank you. So, as I mentioned before, I definitely support the ability of existing owners to build two new units on their lot. But the EIA shows that it's more profitable under this ordinance to sell one's property than to build.'",
        "'speaker_8': 'And so a new owner, whether or not it's an investor or a resident who buys with the intention of immediately purchasing a property and immediately building to add to use as soon as they do so, as soon as they buy, the primary unit is likely to do so and displace that existing right to a family.'",
        "'speaker_8': 'I'm a little bit at a loss. Why we would not discourage this from occurring, all for the sake of maintaining the profit motive for a new owner to purchase property, displace a rental tenant. I just think that the amendment I offered earlier is a really useful safeguard.'",
        "'speaker_8': 'But nevertheless, I do strongly support this legislation and I just want to say a few words to the folks who too I hear with concerns that I mean, the rhetoric is that ideas are going to destroy their neighborhoods.'",
        "'speaker_8': 'And, you know, we've we've thrown around this 4400 over ten years number a bit. That works out to be 440 units a year over the study area, which is 35,000 acres. And if you convert that to that, that is one Adu.'",
        "'speaker_8': 'A year over 80 acres, which works out to be about one A.U. for every 30 to 50 square blocks in the city. So I just think it's really out of out of perspective to suggest that this legislation is going to destroy single family neighborhoods.'",
        "'speaker_8': 'And, you know, I support the.'",
        "'speaker_1': 'Overall goals.'",
        "'speaker_8': 'Of the legislation to increase opportunities and flexibility for both renters and existing homeowners. And I'm excited about being able to do more so that these units that are being built are actually affordable, both by reducing the permitting costs, the design costs, the construction costs, as well as further development of the Office of Housing's pilot program to support'",
        "'speaker_8': 'the development of affordable rental. So for those reasons, I will be voting in favor of the legislation.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'PACHECO So in September 2014, Councilmember O'Brien and the City Council adopted Resolution 31547. That's almost five years ago. And as my mother would always tell me, keep trying for five years on anything. She had a word for me, which was terrible.'",
        "'speaker_5': 'So thank you for just your willingness and your your willingness and your desire to keep going on this legislation over those five years because we are finally at a vote today. So when I first moved to Seattle a decade ago to attend grad school, you know, I first I found my first place to call home in a'",
        "'speaker_5': 'backyard cottage in Wedgewood, and I literally lived in another Adu in Wallingford. Without these ideas, I don't know if I would have been found an affordable place to live and if I would be calling Seattle home today. I'm excited that we have the opportunity to make sure that more people have the housing options that allowed me to'",
        "'speaker_5': 'make Seattle home. As someone who has watched my own parents struggle to stay in their own home, I also see this legislation as a valuable tool for homeowners who are struggling to hang on or who want to age in place, or who are watching their family and community members be pushed out of the city.'",
        "'speaker_5': 'The amendments that were offered in committee, well, allow us allow us to really continue to make this legislation better by having unpermitted ADAS come into compliance with reports back to the Council on the ADU Loan Pilot and reports back on demographics and rents charge for its use.'",
        "'speaker_5': 'Lastly, this conversation surrounding density. As this conversation surrounding density continues, I encourage folks not to demonize one another. I've heard today and during my office hours within the district that renters don't care about their neighborhoods. Surrender myself. I show up every day to work with a desire to make my community better.'",
        "'speaker_5': 'Let me be clear. We're all neighbors, and it's time that we show each other the respect that we each deserve. As our city grows, we should grow together and grow equitably. This legislation help us, just helps us do just that.'",
        "'speaker_5': 'And I'm proud to vote in support of this.'",
        "'speaker_6': 'Thank you. Thank you. I forgot to mention Ali Pantucci. Thank you. Thank you so much for all your good work on that. Suzie and Lakisha as well. Really appreciate all of the work that you have done. And when the question about the trees came up, I forgot to mention that the Urban Forestry Commission and I are working'",
        "'speaker_6': 'with the mayor's office to look for a work plan that we can lay out and make really clear what we're doing, how we're preserving and protecting the trees. And once again, Ali, potentially you'll be helping us work on that.'",
        "'speaker_6': 'So many thanks.'",
        "'speaker_2': 'Sure. I wanted to make a few comments myself, and then I handed over to Councilmember O'Brien to close it out before we take the vote. I am strongly in favor of this legislation and I will be voting yes.'",
        "'speaker_2': 'And I thank all the activists and community organizations that have advocated for this, not just this year, but for several years. And I do agree with many who have said that they should. This was a long time coming and it should have been done a long time ago, especially given the acute housing crisis that we're facing.'",
        "'speaker_2': 'I also think it is really bad for anybody to make any any create any context where there is negative rhetoric against renters. Renters are not only about half of our city. Renters are now more and more of the residents of metropolitan areas.'",
        "'speaker_2': 'Most working class and middle class people don't of cannot afford to buy homes and they are forced to rent. And there is nothing wrong with renting. It is, you know, regardless of whether you have ownership of your property or not, you are residents of the neighborhood.'",
        "'speaker_2': 'In fact, I would extend that even further and say that even if you are homeless, you are community members and it doesn't matter. And you not only have every right to your community and to your neighborhood and to your city, but nobody should question your commitment to society.'",
        "'speaker_2': 'In fact, if anybody's commitment should be questioned, it should be the for profit corporate developers and the property management corporations who are enriching themselves beyond belief at the expense of the renters in our city. I also wanted to add that, you know, again, I appreciate it.'",
        "'speaker_2': 'Councilmember O'Brien's sort of putting it in perspective and also Councilmember Herbold. I think this bill has been greatly exaggerated by its detractors right now, as the Urbanists article from October last year mentions, only 1% of single family lots in Seattle have an idea or did you?'",
        "'speaker_2': 'So I don't think this is in any way going to. To paraphrase what councilmember horrible said, destroy single family neighborhoods. I also think it is important to note, as Councilmember O'Brien did, and I appreciate that, that the bill's promoters have also greatly exaggerated the bill in terms of the effect it will have for affordable housing.'",
        "'speaker_2': 'I absolutely support it will have some positive effect, there is no question about it. And I support every single affordable home that we can generate through a, you know, series of comprehensive policies. But we should also have it in perspective that it is not going to address the housing crisis in the way that we want to address'",
        "'speaker_2': 'the housing crisis. And so we do need to get to work on far bigger public policies than than this one, although I strongly support this one and we need to go forward on this one. I also wanted to thank the working class and middle class homeowners like Ruby Holland, who is an African-American homeowner in District three, who'",
        "'speaker_2': 'have advocated for this bill as well, making the important point that for the homeowners who are able to build and a backyard cottage, it could potentially be a very urgently needed source of income, especially people who are hit with large health care costs and also the higher property taxes, because this the city does not have does not'",
        "'speaker_2': 'really have any progressive taxes. So I really appreciate the homeowners who have joined the renters in advocating for this bill. And it's a really good, positive example where homeowners and renters can come together and fight together for some of our affordable housing policies.'",
        "'speaker_2': 'I also wanted to reiterate a point that we've made repeatedly in Councilmember O'Brien's committee, which is that the the data also shows that the homeowners who can afford to build backyard cottages are the more well-off homeowners and the homeowners who need to build, you know, in order to get a source of income and rented out as affordable'",
        "'speaker_2': 'housing often cannot afford to build it. And so I do want to keep alive the question of how we will provide public sources of funds for the homeowners who want to build a backyard cottage but cannot afford to raise the capital expenses that they will need to in order to make that happen.'",
        "'speaker_2': 'I also wanted to add one other thing that again, from the Urbanist article in October of last year, where they report that in contrast to what we have in Seattle, in Vancouver, British Columbia, which has been a pioneer in ideal land use code liberalization, roughly 35% of single family, lots of ideas which they referred to as laneway'",
        "'speaker_2': 'housing, resulting in about 25,380 use and 1050 do use across the city. I think Vancouver, B.C., has led on this, and I think it should be our goal to really move forward in a big way in Seattle as well, because we have, you know, they are their sister cities in many different ways in terms of what the'",
        "'speaker_2': 'problems, the density and all of that. So I think that does provide a good guidance for us. Last but not least, I will say I hope all the activists and the community organizations who have been fighting for this correctly, but also join us in the struggle for much more far reaching public policies and not only join us'",
        "'speaker_2': 'in Seattle, but join the movement in New York, which are just one major historic victories. By forcing the New York state legislature to pass not only a closing of the loopholes on the rent control, existing rent control legislation in the city, in New York City, but also enabling a whole host of tenants rights to be passed and'",
        "'speaker_2': 'also enabling other municipalities in the state, in New York state to pass rent control. Because we have seen that when rent control does not have corporate loopholes, it has provided a lifeline to many people. In fact, I just met a constituent recently who said that her son and his wife used to live in the Bay Area.'",
        "'speaker_2': 'They lived in a rent controlled home as particularly at a time when they were young, when they had a young family and they needed rent control. And rent control enabled them to actually save up even on their middle class salaries, and they were able to come and buy a house here.'",
        "'speaker_2': 'So, you know, in reality, homeowners and renters have a joint incentive to fight for rent control together. And I really urge everybody who's watching this to join us at the rent control rally on July 20th, at 6 p.m. at the All Pilgrims Christian Church on Broadway.'",
        "'speaker_2': 'And I will now hand it over to Councilmember O'Brien. And I just wanted to point out, actually, that. The the petition for rent control with both my staff and many, many volunteers who are now volunteering with us, have gone throughout the city in different farmer's market, including Lake City Farmers Market and soldiers at the are all the'",
        "'speaker_2': 'three days of pride and we have collected 7500 signatures, which is a huge amount, especially given all the negative mythology about rent control. So I really urge everybody who's not joined the struggle yet to please join it with us.'",
        "'speaker_4': 'Thank you. Council president, colleagues, thank you so much again for your work on this. I appreciate the kind words you shared with me personally. You know better than anyone else that the work I do is a mere fraction of the actual work that's done, and I get a lot of credit for that.'",
        "'speaker_4': 'But we bounce around from from topic to topic and the staff behind us that support us make this possible. So I want to say thank some of those folks. I want to start with a couple of volunteers that are here.'",
        "'speaker_4': 'I know Laura and Matt, for example, who have been dedicating a lot of your unpaid time to making this work. So thank you. You know, you're your advocates and your voice matters, but you've been really good at helping me connect with community members and really understand what the need is in community.'",
        "'speaker_4': 'And I'm grateful for that. Allie, I want to thank you so much for your years of work on this, not just in the typical role as a central staff member, but spending multiple hours on the stand during the hearing examiner examination and all sorts of other roles.'",
        "'speaker_4': 'You're an amazing resource for the city. You've been an amazing resource for me on this particular piece of legislation. I'm very grateful to that. I want to thank Nick and the mayor, as you've worked for your work, has been your work has been amazing.'",
        "'speaker_4': 'And I'm really grateful to this mayor and past mayors who've allowed the city council to have access to your expertize and your team's expertize. Going back to the very first kind of community meetings when I first met you doing this over three years ago.'",
        "'speaker_4': 'You're just thoughtful. Approach has been really, really helpful to the guiding US policy along the way, and I really applaud your work for that, and we can all applaud Nick. As has been mentioned, this process has taken quite some time, both the long process during which babies have been born, including a baby that's in the back today'",
        "'speaker_4': '. So I want to thank my staff member, Susie, who has been working on this tirelessly for years. She's currently on parental leave. But Ezra's at, I believe, his first city council meeting today. So we gave we've got time for her to be here.'",
        "'speaker_4': 'And then in the very near term, we've taken enough time today, council colleagues, and we have managed to put Ezra to sleep. So that's also one of our strength up here. So way to go. But Susie, thanks for your work on that and and Susie's absence.'",
        "'speaker_4': 'Alisha, in my office has been the lead picking up this work. We've gone long enough that Alicia probably had to go to the meeting that I was supposed to be at 20 minutes ago. But I'm really grateful for her.'",
        "'speaker_4': 'HAYLEY So there you are. You're back. Thank you so much for you. My whole team has been a part of all this police. I really appreciate your leadership on this. That is all I have to say, colleagues. There's so many amazing folks throughout the community that have worked on this in other departments elsewhere.'",
        "'speaker_4': 'But it's a team effort here. And, you know, I look forward to this vote. We'll see how it goes.'",
        "'speaker_2': 'Thank you. Got some heavy rain. Please call the roll on the passage of the bill as amended.'",
        "'speaker_3': 'Make sure. Gonzalez I. Herbold I was just getting high. O'Brien Hi. Pacheco Hi, President Swan. I didn't favor and unopposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it.'",
        "'speaker_4': 'I. I know I've overlooked a few folks, but I'm looking at Sherry right now and I apologize. I didn't mention to you with the likes of Matt Lauer, have you been an amazing point person to work with? So thank you for all that.'",
        "'speaker_2': 'Thank you, everyone. Please read the report of the Civil Rights, Utilities, Economic Development and Arts Committee.'"
    ],
    "Yesler Crescent Improvements Ordinance and Budget Changes.": [
        "'speaker_2': 'Any other comments? Those in favor of confirming the appointment. Please vote. Those opposed would know the motion carries and the appointment is confirmed. Please read the report of the Finance and Neighborhoods Committee.'",
        "'speaker_10': 'The report at the Finance and Neighborhoods Committee to Indemnify Accountable 119552. Relating to the Yes, sir. Crescent Improvements. The committee recommends the bill pass inspection.'",
        "'speaker_6': 'Thank you very much. I know all of us have been here for 2 hours and 22 minutes. I'm going to try to shorten this. If you have any questions, let me know. Many of you are well aware that I have been supporting what we call the Essilor Crescent for years.'",
        "'speaker_6': 'We got 900,000 plus in the budget last year. So what we're doing is lifting a proviso. The Parks Department has been fabulous and we have worked very closely with our King County friends of the judges and the facilities, folks across the street in DC, the Pioneer Square Alliance down the street.'",
        "'speaker_6': 'Our people have come together. The money has been identified. We're going to be activating that park, adding more tables and chairs, a kiosk, better lighting, cleaning it up, continuing to limb. And I recommend that we proceed with this and lift the proviso.'",
        "'speaker_2': 'Any other comments? Please call our role on the passage of the bill.'",
        "'speaker_3': 'Thanks. Hi, Gonzales. Hi, Herbold.'",
        "'speaker_1': 'Why did you two get confused? She was just. I was jumping. Yeah. Jumping the gun here.'",
        "'speaker_3': 'Let's get to. O'Brien Pacheco.'",
        "'speaker_5': 'My.'",
        "'speaker_3': 'President silent I seven in favor and unopposed.'"
    ],
    "Historic Preservation Controls for Ainsworth & Dunn Warehouse.": [
        "'speaker_2': 'The bill passes and the chair will sign it. Please read the item of the Violence and Abuse Committee agenda.'",
        "'speaker_10': 'Item six Cancel 119 540 Willington Historic Preservation Poison Control is upon the Ainsworth and done warehouse committee recommends the bill pass.'",
        "'speaker_6': 'Thank you. And again, this is landmark legislation that unanimously passed out of the committee. The Aynesworth and Dunn warehouse, commonly known as the old Spaghetti Factory, will have controls on the outside, the exterior. They've actually done a fantastic job with cleaning up the bricks, the outside, and they've restored the old windows.'",
        "'speaker_6': 'So they've they're complying. They want to do this work. And the exposed interior structure, as well as these old, very old beams that they are restoring. To look like they did when they were new. It's really been an impressive part of the new waterfront, and we recommend that this be the landmark legislation be accepted.'",
        "'speaker_2': 'You got to remember any other comments. Please. Please call the role on the passage of the bill.'",
        "'speaker_3': 'Bakeshop. Hi, Gonzales. I herbold. I was. Mosquera I O'Brien Pacheco I president's what I seven and favorite on oppose.'"
    ],
    "Community Service Officer Program Proviso Lift and Ratification.": [
        "'speaker_2': 'The bill passes and the chair will sign it. Please read the a report of the Gender Equity Safe Communities New Americans and Education.'",
        "'speaker_10': 'Committee report at the Gender Equality Safe Communities, New Americas and Education Committee Agenda Item seven Constable 119 547 Relating to a Community Service Officer program amending ordinance 125 724, which adopted the 2019 budget, lifting a proviso inviting fire and confirming search prior acts committee recommends of El Paso.'",
        "'speaker_2': 'And Dallas.'",
        "'speaker_7': 'Thank you. Council presidents want council bill 119547. As I mentioned this morning during council briefing would lift a 2019 budget proviso to allow the Seattle Police Department to advance its implementation of the Community Service Officer program really quickly.'",
        "'speaker_7': 'By way of background, this program and this unit will be staffed by noncommissioned officers who are trained and work as liaisons between the community and the police department. Community service officers will not carry weapons nor enforce criminal laws.'",
        "'speaker_7': 'Instead, they will serve to bridge the service gap on non-criminal calls for service and perform a variety of public safety related community service and outreach work, therefore, freeing up sworn police officers to focus on more critical matters. They will receive training in police operations, social work, de-escalation, conflict resolution and mediation, crisis intervention, institutional racism and cultural competency'",
        "'speaker_7': 'using internal and external training channels. The Community Service Officers will also develop community partnerships to support increased collaboration between the Seattle Police Department and the community for the purpose of leveraging community strengths and identifying alternative strategies to various law enforcement and social issues.'",
        "'speaker_7': 'Community service officers will work assigned areas of the city on foot or in marked community service officer vehicles. Responding to radio dispatch calls for service largely at the direction of patrol officers. The Seattle Police Department plans to deploy initially ten community service officers and two community service officers.'",
        "'speaker_7': 'Supervisors across two shifts shifts up to six days a week, Monday through Saturday, excluding Sundays and holidays. That is subject to change depending on calls and demands of the program and of course, future funding in in the future.'",
        "'speaker_7': 'So I promise this morning during council briefing that I would bring and share with you all a copy of the job description and posting for the Community Service Officer Program. I've distributed that for you all to take a look at, but I think with all of this information, we are ready to lift the proviso and the committee'",
        "'speaker_7': 'recommends that we do so to allow the Seattle Police Department to advance the Community Service Officer program.'",
        "'speaker_2': 'Very good. Any other comments from her?'",
        "'speaker_6': 'Thank you.'",
        "'speaker_8': 'Real quickly, I truly believe that bringing back the Community Service Officer program will be a really valuable addition to policing in Seattle. In the Southwest Precinct, a top community concern is that the number of police officers are not sufficient to meet the staffing needs to adequately address public safety.'",
        "'speaker_8': 'I am a proud co-sponsor of legislation to bring back the CSOs, but recognize that Councilmember Councilmember O'Brien took the took the lead on proposing it in a couple of budget cycles back. And many, many thanks to Councilmember Gonzales for adeptly and expertly getting us to this.'",
        "'speaker_8': 'To this point, unsworn officers can prioritize non-emergency community services associated with law enforcement. And as we've heard, that frees up police officers to better respond to 911 calls and needs for.'",
        "'speaker_1': 'Proactive.'",
        "'speaker_8': 'Policing. Given our challenge in this city, as well as other large cities in hiring new officers, bringing back the CSO program is a really important step and also a shout out for two Assistant Chief Diaz for his work on this as well.'",
        "'speaker_7': 'He's done great.'",
        "'speaker_1': 'Work in the.'",
        "'speaker_2': 'Other comments.'",
        "'speaker_4': 'Yeah. Councilmember Gonzales, I really appreciate your leadership on this. I apologize for not being able to be at the community meeting last week. But as Councilmember Raul mentioned, it's been over a year and a half since we allocated the budget to this.'",
        "'speaker_4': 'And I'm it's a little disappointing it's taken this long. But setting that aside and how we move forward, I really appreciate your leadership and keeping an eye on how this means for. And so I'm grateful for that. Thank you.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_2': 'All right, please call the role on the passage of the Bill Bagshaw.'",
        "'speaker_3': 'Gonzalez I Herbold I was.'",
        "'speaker_8': 'I.'",
        "'speaker_3': 'Was going to. O'Brien high Pacheco I president's warrant seven in favor and unopposed.'",
        "'speaker_2': 'The bill passes and the judge will sign it. Is there any other further business to come before the council? Skater.'",
        "'speaker_7': 'Thank you, Madam President. I would like to be I would like to ask to be excused next Monday for the purposes of going to Washington, D.C., to meet with the folks from the National League of Cities on their housing task force revealing of the report.'",
        "'speaker_7': 'So I'll be a very short trip, but I won't have to miss next Monday if I can be excused.'",
        "'speaker_2': 'It's been moved and seconded. All in favor. I see, I. None of us. So that passes any other motions. Seeing none. Meeting is adjourned.'",
        "'speaker_1': 'Gave.'"
    ]
}