{
    "Memorandum of Understanding between The City of Seattle and City Unions.": [
        "'speaker_5': 'Record board of the City Council? Agenda Item one Council Bill 120242 An ordinance relating to City Employment authorizing the execution of a memorandum of understanding between the City of Seattle, certain city unions, and ratifying and confirming certain prior acts.'",
        "'speaker_0': 'Thank you so much. I move to pass Council Bill 120242. Is there a second?'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded to pass the bill as sponsor of the bill. I'll address it first and then I'll open up the floor to any additional comments. Colleagues Items one, two and three. On the agenda are council bills 120242120243 and 120244, which all stem from the work of the Labor Relations Policy Committee'",
        "'speaker_0': 'and related to 2022 wages for represented and non represented city employees. These three bills are interrelated and so some of my comments will apply to all of the three all three bills rather than each one individually. Specifically related to Council Bill 120242.'",
        "'speaker_0': 'This bill would authorize the execution of a memorandum of understanding between the City of Seattle and certain city unions, including the Coalition of City Unions, which modifies certain city employees terms and conditions of employment. The memorandum of understanding between the City and the Coalition would last from January 1st, 2022 through January 31st, 2022, and would cover approximately'",
        "'speaker_0': '6028, regularly appointed and temporary city employees represented by the Coalition. The key terms of the Memorandum of Understanding include a 4% area wage income increase for eligible employees, the establishment of two new paid city holidays, Juneteenth, which is June 19, and Indigenous Peoples Day, which is the second Monday in October.'",
        "'speaker_0': 'And the the additional term of the Memorandum of Understanding also includes an agreement on a collaborative effort to conduct a market wage study to review the city's approach to its compensation philosophy. Because the Budget Office estimates you.'",
        "'speaker_5': 'Guys feel like in year seven.'",
        "'speaker_0': 'Let's hold on, Judy. All right. That's okay. Go ahead and meet yourself and I'll continue. Thank you so much. Okay. The city budget office estimates that the aggregate cost of wages, including other wage related items authorized by separately by other legislation, would be about $37 million in 2022.'",
        "'speaker_0': 'This estimate would cover wage adjustments for about 10,500 employees, including represented employees in the coalition and coalition unions and most non represented employees, central staff funds that there are sufficient funds to cover the costs of the annual wage increases in planning reserves.'",
        "'speaker_0': 'As a matter of practice and the city's financial and labor relations policy, these funds are held in planning reserves so that when the city negotiates union contracts, there are funds available to pay for the changes within the parameters authorized by the Labor Relations Policy Committee, a committee in which five council members sit on in conjunction with representatives'",
        "'speaker_0': 'of the executive, including the director of the City Budget Office. The executive provides notice of the planning reserves in the six year financial plans included with the proposed budget that the City Council deliberates, analyzes, evaluates and votes on yearly.'",
        "'speaker_0': 'Again, all three of these Council bills that we are voting on today approve labor relations policies and fiscal impacts related to those policies that were established in the parameters set by the Labor Relations Policy Committee. And I urge my colleagues to support the passage of this legislation and the next two bills which we will vote on individually'",
        "'speaker_0': '. Are there any additional comments on agenda item one? Council Bill 120242. Hearing, no additional comments will occur. Please call the role and the passage of Council. Bill 120242. Agenda Item one.'",
        "'speaker_1': 'Lewis. Yes. Morales. US must get up. Hi, Petersen.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Strauss. Yes. Verbal? Yes. Whereas I council President Gonzales. I eight in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. Will the clerk please? If it's my signature to the legislation on my behalf. Will the court please read item two into the record?'"
    ],
    "Salary Increases for Non-Represented City Job Titles.": [
        "'speaker_5': 'Agenda Item two Council Bill 120243 An ordinance relating to city employment providing salary increases for 2022 for certain non represented city job titles and ratifying and confirming certain prior acts.'",
        "'speaker_0': 'Thank you so much. I moved to Council Bill 1 to 0 two for three. Is there a second?'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'It's been moved and seconded to pass the bill as sponsor of the bill, or address it first and then open the floor to any additional comments so called. In addition to the item to the comments I made and agenda item one I will add specifically related to Council Bill 120243.'",
        "'speaker_0': 'This bill would authorize, among other terms, an adjusted wage increase of 4% for most non represented job titles. This agreement would come into effect January 5th, 2022. The wage increase would apply to about 1806 non represented employees. The amount of the wage increase would be consistent with a Y in the memorandum of understanding with the Coalition of'",
        "'speaker_0': 'City Unions, which we just voted on and passed. That was Council Vote 120242. Historically, the city has provided the same wage increases, benefits and other conditions of employment for non represented employees. As for Coalition members. This is a matter of ensuring equity in the workplace, particularly for and for folks who work in a mixed represented non represented'",
        "'speaker_0': 'environment in their departments and agencies. With regard to the fiscal impact of this legislation, I will echo the comments that I just made. Those comments relating to the fiscal impact are equally true in the context of this Council bill.'",
        "'speaker_0': 'So as a result, I would urge my colleagues to support the passage of this Council bill. Are there any additional comments on Agenda Item two Council Bill 120243. Councilmember Peterson.'",
        "'speaker_2': 'Thank you. Council president. Appreciate the time to speak to this morning at council briefing these three bills actually for folks in the public interest. The money was set aside, as I understand from our city council, central staff set aside in a line item called planning reserves, which is at the bottom of page 687 of our budget.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'It so much consumer. Peterson. Are there any other comments on agenda item two Council Bill 120243. Hearing none. Will the court please call the role on the passage of Council? Bill 120243 Agenda item two.'",
        "'speaker_1': 'Lewis. Yeah. Morales. This was Skinner. I. Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss. Yes. Herbold. Yes. Whereas High Council President Gonzalez. I stayed in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign. It will please affix my signature to the legislation on my behalf. Will the clerk please read item three into the record?'"
    ],
    "2022 Pay Zone Ordinance for City's Discretionary Pay Programs.": [
        "'speaker_5': 'Agenda Item three Council Bill 120244 An ordinance relating to city employment to be known as the 2022 pay zone ordinance. Adjusting the pay zone structures for 2022 for the city's discretionary pay programs and ratifying and confirming certain prior acts.'",
        "'speaker_0': 'Thank you, Madam Clerk. I moved past Council Bill 120244. Is there a second second? Thank you so much. It's been moved and seconded to pass the bill. Again, I am the sponsor of this bill, so I'll address it first and then allow others to make comments, if any.'",
        "'speaker_0': 'Constable 120244 would adjust the pay bands for city discretionary pay programs by slightly more than 7%. Employees in these discretionary pay programs would be eligible for a salary increase within this payment, subject to the discretion of the appointing authority.'",
        "'speaker_0': 'The Seattle Department of Human Resources Director recommends adjustments to these pay bands every one or two years, depending on the particular program. SDH Hours Director Direct Excuse me. Director did make a recommendation, and the recommendation was to adjust the pay bands by 7.016% to reflect a compounded increase of 2.9%, plus an additional 4% that has been authorized'",
        "'speaker_0': 'with council bills. 120242 and 120244. The 2022 adopted budget appropriated funds for a 2.9% wage increase for certain non represented job titles in executive departments, in part because these job titles were excluded from the 2.9% wage increase in the 2021 adopted budget due to financial constraints stemming from the COVID 19 economic crisis.'",
        "'speaker_0': 'Again, I've already spoken to how the city has planned and budgeted for the fiscal impacts of these annual wage adjustments for city employees. And just like I did with the previous two bills, I recommend to my colleagues passage of this legislation.'",
        "'speaker_0': 'Are there any additional comments on Agenda Item three Council Bill 120244. Hearing none. Will the court please call the roll on the passage of Council Bill 120244. Agenda Item three.'",
        "'speaker_1': 'Lewis. Yes. Morales. Councilmember Morales. Yes. Thank you. Councilwoman Rosetta I.'",
        "'speaker_2': 'Peterson by.'",
        "'speaker_1': 'Strauss?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold? Yes. Whereas I council President Gonzalez. I am in favored and opposed.'",
        "'speaker_0': 'The bill passes and the terrible planet will please if it's my signature to the legislation on my behalf. Liquid Please read item four into the record.'"
    ],
    "Establishing Juneteenth as a Legal Holiday and Parking Holiday for the City.": [
        "'speaker_5': 'Jeff Horwich Council Bill 120184 An ordinance relating to city employee employment, establishing Juneteenth as a legal holiday for certain city employees and illegal parking holiday. Amending other provisions to implement Juneteenth as a legal holiday, conform with state law and make technical corrections and amending sections 4.20.190 and 11.1 4.277 of the Seattle Municipal Code.'",
        "'speaker_0': 'Thank you, Madam Clerk. I moved to pass Council Bill 120184. Is there a second.'",
        "'speaker_2': 'Second.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'Thank you so much. The bill has been moved and seconded. I am going to hand it over to Councilmember Morales, who's the sponsor of the bill to address the item.'",
        "'speaker_6': 'Thank you. Council President. The proposed legislation, as Judy just said, would establish Juneteenth as one of 11 legal holidays for city employees. It would automatically cover non-representative employees and cover represented employees subject to their unions agreement. It would not apply to uniformed police and fire employees as those employees establish their holidays by collective bargaining.'",
        "'speaker_6': 'It would also establish Juneteenth as one of ten parking holidays. I grew up in Texas. So Juneteenth, the Juneteenth celebration isn't new to me and was made a state holiday in Texas in 1980. And I knew as a kid that this day was really special for our black neighbors.'",
        "'speaker_6': 'I know that some believe making this a holiday diminishes the uniqueness of the celebration by offering it to everyone. But I think it's important that our country acknowledges slavery. This holiday, as we as we recognize it as a city, also allows us to acknowledge the legacy of trauma for generations of black Americans and to demonstrate an understanding'",
        "'speaker_6': 'of the need to actively pursue an anti-racist society. So establishing Juneteenth as an official city holiday gives us an opportunity to remark on our progress toward achieving that goal and bring awareness to the work that we still have to do.'",
        "'speaker_0': 'Thank you for those comments. Councilmember Morales, really appreciate your leadership in this area. Are there any additional comments? An agenda item for Council Bill 120184. Seeing any additional hands raised. Again, thank you so much, Councilman Morales, for your leadership in this area.'",
        "'speaker_0': 'Really appreciate you bringing us forward both in our budget process and in this trailer bill and through our Labor Relations Policy Committee work as well. Please call the roll on the passage of Council Bill 120184. Agenda Item four.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Sarah. Hi.'",
        "'speaker_2': 'Petersen I. Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Whereas I council President Gonzales. Right. Eight in favor. Nine opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the please affix my signature to the legislation on my behalf? Well, the Court please read the short title of item five into the record.'"
    ],
    "Ordinance to Update the City's Traffic Code in Compliance with State Law.": [
        "'speaker_5': 'Agenda Item five Council Bill 120246. An ordinance relating to the city's traffic code conforming the Seattle Municipal Code with changes in state law, amending sections of the Seattle MRGO Code and adding new sections of the Seattle Municipal to the Seattle Municipal Code.'",
        "'speaker_0': 'Thank you so much. I moved past Council Bill 120246. Is there a second second? Thank you so much. It's been moved and seconded to pass the Council bill. Colleagues, this is one of those rare and exceptional circumstances in which the legislation is listed on our agenda as not having a sponsor identified for the legislation before its introduction'",
        "'speaker_0': '. As a result, as Council President presiding over these proceedings, I'll go ahead and address the substance of the bill. This is this pro forma council bill would adopt a set of amendments to a traffic code in the Seattle Municipal Code to ensure that it conforms with changes to Washington state law.'",
        "'speaker_0': 'This represents an annual exercise undertaken by the City and the Council to update our local traffic codes to reflect changes made to the state's traffic code in each legislative session. State law prohibits local jurisdictions from enacting or enforcing any ordinance in conflict with the provisions of state traffic laws.'",
        "'speaker_0': 'And this legislation would ensure the cities, the city, remains in compliance with applicable traffic laws at the Washington state level. As a result, I do recommend that my colleagues support the passage of this legislation to ensure that we continue to have a municipal code that is in compliance and aligned with state law.'",
        "'speaker_0': 'Are there any additional comments? Agenda Item five Council Bill 120246. Councilmember Petersen, please.'",
        "'speaker_2': 'Thank you, council president. I concur with your remarks and thank you very much for for handling the remarks on this bill. Thank you.'",
        "'speaker_0': 'My pleasure. Thank you. PETERSON okay, colleagues, any other comments? I'm not hearing any. Will the court please call the rule on the passage of Council Bill 120246. Agenda Item five.'",
        "'speaker_1': 'Lewis. Yes. Morales Scary, I.'",
        "'speaker_2': 'Petersen All right. Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Whereas I council President Gonzalez. I am in favor, not opposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the terrible planet will appear. Please fix my signature to the legislation on my behalf. Please read item six into the record.'"
    ],
    "Hazard Pay Requirements for Seattle Employees.": [
        "'speaker_5': 'The Report of the Finance and Housing Committee Agenda Item seven Council Bill 120119 An Ordinance relating to Employment in Seattle amending sections 100.02025 and Section five of Ordinance 126274 to establish a new date for ending hazard pay requirements and automatically repealing the ordinance.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much, because we're our state. You are the chair of this committee. Someone to hand it over to you to provide the committee report.'",
        "'speaker_3': 'You very much council president colleagues, as you'll note on agenda item number seven, there is a substitute version noted on our agenda. I would like to move Council Bill 1 to 0 119 by substituting version two, which is link on today's agenda for version 1a6.'",
        "'speaker_0': 'Okay. It's been moved and seconded to adopt proposed substitute version two of Countable 120119. Would you like to address the substitute?'",
        "'speaker_3': 'Thank you, Madam President. Colleagues, as you'll remember at the beginning of this year, in 2021, one of our first acts as a council was to move and pass the legislation I sponsored to pass emergency legislation to provide hazard pay for grocery workers, requiring grocery stores to pay employees an additional $4 an hour to compensate them for the'",
        "'speaker_3': 'risks to their health and safety and the health and safety of their families, especially before any vaccines were available at the beginning of the pandemic. Many industries were able to go remote to reduced hours to reduce exposure and more.'",
        "'speaker_3': 'But essential workers, especially in grocery stores who helped to feed the families and to keep families safe, had no choice but to report to work. Many of these grocery workers called in to testify about the health and safety risks that they were facing, including facing unmasked customers, extra cleaning and frequency needed to clean surfaces throughout grocery stores'",
        "'speaker_3': '. These stories included examples of customers coughing or arguing about masks and more. We didn't just hear about this during public comment. We also had a panel to provide data and study after study to look at opportunities to protect grocery store workers.'",
        "'speaker_3': 'One study one study from Boston found that 20% of grocery store workers tested positive for COVID 19, despite 91% of those employees wearing a face mask. The positive rate of infection among grocery store workers was five times as likely for those who interacted with customers on the floor of grocery stores than those who did not.'",
        "'speaker_3': 'And while hazard pay cannot fix all of those situations, it certainly was one measure that this council wanted to make sure to advance to provide a small boost to workers who are taking these extra risks. We pride ourselves in Seattle being labor leaders on labor standards.'",
        "'speaker_3': 'And it wasn't just us who recognized these risks at the time of the bill's passage. Cities up and down the West Coast had passed or were beginning to announce legislative efforts to require hazard pay for grocery store workers.'",
        "'speaker_3': 'This included in California, Berkeley, Long Beach, Los Angeles, San Francisco, West Hollywood, Oakland, once a video, and Los Angeles County when Seattle City Council passed that we were also an impetus for cities in this region and our county to pass hazard pay as well.'",
        "'speaker_3': 'This legislation was always temporary before vaccinations could be widely available and before other safety measures could be secured and discussed with employers. This legislation was not intended to be permanent wage replacement, which of course I support and have been advocating for and will continue to work with members of CWA 21 and other workers who are on the'",
        "'speaker_3': 'front line to secure higher wages for our workforce, especially in low wage industries. In our passage of the hazard pay. We noted our intent was to consider modifying or eliminating the hazard pay requirements after four months of implementation and review, current health and safety and economic risks for frontline workers for the COVID emergency to help us with'",
        "'speaker_3': 'these considerations. On June 15, we had a panel discussion of representatives from grocery workers, the grocery industry representatives, as well as public health. Interim Director Worsham was present with us in that meeting. We celebrated the progress that we made since COVID 19 pandemic started.'",
        "'speaker_3': 'We had celebrated and acknowledged the work that had gone into making sure that vaccines were more available since the passage of hazard pay. And we also acknowledged some of the real racial disparities in vaccine rates and the need for ongoing measures, including improved protocols, PPE, access, clear mask guidelines and more.'",
        "'speaker_3': 'During the panel, as well as after, we got a good response from grocery store workers that they would continue to work with us on addressing those solutions. And that includes grocery store employers and employees who were interested in longer term solutions to addressing these disparities.'",
        "'speaker_3': 'During the panel, we also heard about partnerships with King County Public Health to host grocery store worker vaccination clinics. And I had the honor of volunteering at one of those clinics early on in the pandemic, when vaccines first became available and grocery store workers had access to those vaccinations based on emerging public health data.'",
        "'speaker_3': 'We held that. We held that the final passage of the amendment to repeal the grocery store worker and hazard pay requirement from July until now. Or they. Indefinitely is the language that we use for when a bill will not be brought up within a 60 day period.'",
        "'speaker_3': 'Although I am bringing this amendment forward today, I want to be clear about a few things. Number one, we will consider hazard pay again for grocery store workers and other workers if needed, on any new public health data that continues to make itself available.'",
        "'speaker_3': 'Number two, this hazard pay legislation is not a substitute for long term pay and benefits for workers. Those are conversations we will continue to engage in and encourage between the employer and worker and worker representatives. Number three, this legislation would not have been possible without the direct advocacy of S.W. 21 and grocery store workers calling me and'",
        "'speaker_3': 'asking for us to do this over the holiday break, which we quickly worked with those workers and all of you on council to pass the hazard pay requirements and work to implement it as soon as possible. This also wouldn't have been possible without the willingness of grocery store employers to advise us on administrative functions and without the'",
        "'speaker_3': 'collaboration of public health. Seattle, King County and the Mayor's Office. Finally, thanks to the deep engagement that we did with the UAW 21 and the grocers. I am proud that hazard pay has sparked a conversation between them around longer term wins and policy improvements.'",
        "'speaker_3': 'These will yield a longer lasting and higher level of investment in worker safety and respect beyond this temporary ordinance. This will continue to have beneficial impacts for those grocery store workers. Through the conversations that employers and worker representatives are engaged in.'",
        "'speaker_3': 'I will also note that of all the California jurisdictions that I noted when they passed their hazard pay legislation earlier this year, those California cities only kept their hazard pay in effect for 120 days. So already in the city of Seattle, we have hazard pay that has lasted twice as long as these California jurisdictions.'",
        "'speaker_3': 'A full year has been into a full year will be in effect given that the implementation date of this legislation in front of us will not be in effect until January. I am proud that Seattle workers have gone gotten this hazard pay for so much longer than these other cities and jurisdictions.'",
        "'speaker_3': 'And I'd like to thank all of you for your swift action and your support to pass this at the beginning of the year. And I'd like to continue to lift up the work that is going to have lasting impacts from the conversations that you have S.W. 21 and the grocers are having sparked by the need for additional'",
        "'speaker_3': 'safety, training and investments and workers that all of us can be proud of at this point. After talking with Public Health Seattle King County. We know that the best way to continue to prevent COVID, especially preventing crime, is to vaccinate, vaccinate, vaccinate and keep those masks on.'",
        "'speaker_3': 'I'm proud that Seattle workers have been able to keep this hazard pay for the full year. This was temporary in nature. And I am I am thankful that there is going to be a lasting benefit from these conversations beyond just the hazard pay that will result in improved protections and safety going forward.'",
        "'speaker_3': 'I want to thank such a fruit from my office who's been working on this legislation for the last year. Cory Annable from central staff was always at the ready to help provide additional information and legislative updates and her constant updates with public health as we work to make sure that there was a data informed discussion as we'",
        "'speaker_3': 'consider any update project to the legislation in front of us. Thank you, colleagues. And with that, I would encourage your support today as we look at longer term benefits that the employers and the workers will continue to work on to protect employees and the public.'",
        "'speaker_0': 'Councilmember Mosqueda are there any additional comments on the proposed substitutes? Councilmember Peterson, Please.'",
        "'speaker_2': 'Thank you. Council President I just wanted to thank Councilman Mesquita and CW for their commitment to workers and public health and for following through on this, not letting it. It was never meant to be permanent. But but we really I know a lot of people appreciate that there was a commitment to continue to look at indicators, continue'",
        "'speaker_2': 'to look at trends, and then decide when was an appropriate time and to appreciate this being brought forward and voted on today. Thanks you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. Any additional comments on a proposed substitute? The hearing, none will the Court please for the role on the adoption of the proposed substitute version two of Council Bill 120119. Again, we are voting on the substitute version of the bill before we vote on the bill as amended.'",
        "'speaker_1': 'Lewis. MORALES Yes. No. Sarah, I am.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Strauss Yes. Herbold Yes. Whereas I council President Gonzalez I aid in favor and oppose.'",
        "'speaker_0': 'The so much the motion carries a substitute is adopted and the amended bill is now before the council. Are there any further comments on Agenda Item seven? Council Bill 120119 as amended to be hearing no additional comments. Will the FERC please call the role and the passage of amended Council Bill 120119.'",
        "'speaker_0': 'Agenda Item seven.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. Mosquera. I. Petersen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Whereas I. Council President Gonzalez. I aid in favor and unopposed.'"
    ],
    "Amendment to the Annual Action Plan for Housing and Community Development and Grant Acceptance from HUD.": [
        "'speaker_0': 'The bill passes as amended and the church will sign it. Will the please affix my signature to the legislation on my behalf? Will the Court please read the short title of item eight into the record?'",
        "'speaker_5': 'Agenda Item eight Council Bill 120238 An ordinance relating to Funding for housing. Adopting a substantial amendment to the City of Seattle 2021 Annual Action Plan of the 2018 to 2022 Consolidated Plan for Housing and Community Development and authorizing its submission to the United States Department of Housing and Urban Development.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. Casper Mosquito. You are the sponsor on this one seven handed over to you to address the item.'",
        "'speaker_3': 'Thank you very much. Council President. Council president. I don't have any additional comments to say on this item. This is an ordinance that we were happy to have passed in council and recommend unanimous approval.'",
        "'speaker_0': 'Thank you so much. And this. Are there any additional comments on Agenda Item eight Council Bill 120238. I'm hearing none will please call the war on the passage of Council. Bill 120238. Agenda Item eight.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. Musharraf. I.'",
        "'speaker_2': 'Petersen I.'",
        "'speaker_1': 'Strauss Yes. Herbold Yes. Whereas I council President Gonzales I eight in favor and then opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Look, look, please read item nine into the record.'"
    ],
    "Street Vacation Compensation Exemption for Affordable Housing Projects.": [
        "'speaker_5': 'Gender Item nine Council Bill 120227 An ordinance related to street vacations amending Section 15.6 2.090 of the Seattle Municipal Code to exempt publicly funded affordable housing projects from compensating the city for vacations. The committee recommends the bill passed as amended.'",
        "'speaker_0': 'Thank you, Madam Quirk. I'm going to hand it back over to Councilmember Mesquita to address this item.'",
        "'speaker_3': 'Thank you very much, Council President. Colleagues, you've heard me talk about street vacations and the importance of us clearing any fees or hurdles needed to make sure that we can build more affordable housing in the city. Generally, this is now the legislation that helps us move forward this policy commitment into 2022 and beyond.'",
        "'speaker_3': 'I want to thank Councilmember Peterson, who also had this item up for a briefing discussion in his committee with an agreement that we would have a briefing, discussion and possible vote in mind. This also follows the conversation that we jointly had as a council related to one parcel earlier this year.'",
        "'speaker_3': 'And so I'm proud that we now have this legislation in front of us removing fees that, quite frankly, go right back to the city of Seattle so that we can clear a path for more affordable housing developers. To be able to build to build affordable housing helps us bring those housing units back on much faster.'",
        "'speaker_3': 'And I also know that that also comes with a tradeoff. So thank you, Councilmember Peterson, for the work that you've done with Seattle Department of Transportation and support of this legislation ultimately, so that we can help move forward and reduce the fees and thus the barriers to building more affordable housing units.'",
        "'speaker_3': 'I also want to thank Pastor Willie Seales, who's been working with Lee High, for example, on building this spirit and affordable housing project on church property in the Central District. And with the calls from Pastor Seales and others, we have been able to now move forward on a policy that helps us realize the goal and the desire'",
        "'speaker_3': 'to make sure that limited dollars, when we are building affordable housing, go directly into building those housing units. For example, without the street vacation that it would only be able to create 45 affordable units with the street vacation.'",
        "'speaker_3': 'We're now going to be able to see around 68 affordable units. So this has been a great example of how we as a city can work to reduce those barriers and reduce the sort of internal administrative hurdles and fiscal hurdles for community partners as we seek to create more affordable housing.'",
        "'speaker_3': 'Again, thanks to central staff, the Office of Housing for working with us and Erin House and my office along with Craig for their work on this legislation. I think that this is a win win for everyone as we seek to build more housing as fast as possible.'",
        "'speaker_0': 'Thank you so much, Councilmember Mosqueda. Appreciate it. Are there any additional comments on Agenda Item nine Council Bill 120227. Hearing no additional comments. Will the Court please call the roll on the passage of Council? Bill 120227 Agenda item nine.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. ROSQUETA. I. Petersen I. Strauss Yes. Herbold Yes. Whereas I council President Gonzalez I it in favor not oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign it will. This affects my signature to the legislation on my behalf. The Court Please read items ten and 11 into the record.'"
    ],
    "Adoption of General Rules and Procedures of the Seattle City Council.": [
        "'speaker_5': 'Report of the Governance and Education Committee Agenda Item 17 Resolution 32029a Resolution Adopting General Rules and procedures of the Seattle City Council superseding Resolution 31920. The committee recommends the resolution be adopted as amended.'",
        "'speaker_0': 'Thank you, Madam Clerk. As Chair of the committee and sponsor of the resolution, I'll go ahead and address this item first and then we have a handful of amendments to consider during today's afternoon session here. So really quickly, colleagues, Resolution 31920 would adopt the Seattle City Council general rules and procedures of the Seattle City Council, which govern'",
        "'speaker_0': 'both our internal management and the procedures available to the public in order to access our democratic process. The City Council typically conducts a bi annual review of its procedures and rules that guide and facilitate councilmember duties and meeting deliberations.'",
        "'speaker_0': 'This year has represented a much more robust process than usual, as emphasized by the 15 amendments that were proposed and the 14 changes that were included in the base legislation. So I want to thank you all for your engagement on making sure that we get the council rules set on the right track for the next two years'",
        "'speaker_0': '. There are many good policy changes in this resolution, but perhaps the most notable change to the council rules relates to the council meeting schedule. I'm very pleased that the committee adopted amendments to the council rules that will shift our regular council briefings to Mondays at 2:00 PM and change the date of our weekly full City Council meeting'",
        "'speaker_0': 'from Mondays at 2 p.m. to occur now on Tuesdays at 2:00 pm. I believe that this change will reduce the sometimes enormous amount of work that is required of council members and particularly staff on Saturdays and Sundays, including staff members in the city clerk's office and our I.T. department and other support staff, including our deputy city clerks'",
        "'speaker_0': '. It is critical for council briefings and city council meetings to occur effectively and efficiently as a year round governing body, and particularly following the last two incredibly challenging years in which we have done our work entirely remotely. We have to acknowledge the limits on our individual and collective capacity and remember that we are in a marathon, not'",
        "'speaker_0': 'a sprint. So I'm hopeful that this particular change, along with others in the package, including electronic participation, including voting on resolutions and and other really important amendments on the Council, will help create a more efficient, effective and sustainable legislative process within this this legislative body.'",
        "'speaker_0': 'There were a few proposed changes to the council rules. That committee decided to take back up the amendments today. Those are the amendments that we will be considering during this discussion now and do want to make sure that I am facilitating the process for folks to be able to consider these amendments.'",
        "'speaker_0': 'So I'm going to go ahead and ask folks to reserve comments on the rules as a whole until we've considered all the amendments. And we will just focus our comments now and our discussion now on on various amendments that are going to be discussed all, again, consistent with comments and the discussion and the deliberation that we had'",
        "'speaker_0': 'in the Governance and Education Committee meeting last week on December 8th. I'm not aware of any new amendments being proposed. So these are sort of modifications and revisions or enhancements to policy issues or choices that have already been discussed publicly and in in two committee hearings.'",
        "'speaker_0': 'So this is our opportunity to make a final policy decision on some of these proposed amendments related to how we how the council will do business over the next two years. So the First Amendment is going to be Amendment eight two.'",
        "'speaker_0': 'This is an amendment that I am sponsoring with Councilmember Peterson. So I'm going to move to amend Resolution 32029 by adopting Amendment eight to that was recently distributed. Is there a second?'",
        "'speaker_2': 'Second?'",
        "'speaker_0': 'It's been moved and seconded to adopt Amendment two as recently distributed again as sponsor of the amendment. I'll make sure to address it first and then I will provide council. In an opportunity as my co-sponsor, to address the item.'",
        "'speaker_0': 'And then. And then we'll go ahead and open it up for public comment from the rest of our colleagues. The Governance and Education Committee took action on December 8th, as I just mentioned, to adopt an amendment sponsored originally by Councilmember Peterson.'",
        "'speaker_0': 'I was actually he authored it and I was your official sponsor. Since Casmir Peterson was not a committee member, is not a committee member of the Governance Education Committee. This amendment, authored by Councilmember Peterson, would allow council members to abstain from council votes on resolutions that were referred either to the council directly or to most standing and'",
        "'speaker_0': 'select committees prior to the council vote. However, council members would not be allowed to abstain from council votes on resolutions that come to the Council with recommendations from the Select Budget Committee based on discussions of various options at the Governance and Education Committee.'",
        "'speaker_0': 'The amendment before us now, which is Amendment 82, would allow council members to abstain on any resolution that in the in the discretion of the Council President does not retain materially to the city of Seattle. As we discussed during the Governance and Education Committee meeting.'",
        "'speaker_0': 'This amendment in committee, this amendment would not preclude the placement of a resolution of a resolution on the introduction and referral calendar, but rather would simply signal to Council members that they may now that they now have three different ways that they can vote on a resolution at full council.'",
        "'speaker_0': 'They can either vote yes, vote no, or abstain. So that that is the effect of the resolution that would be before us. So again, we are switching from the base resolution that included Councilmember Peterson's language that identified that a councilmember may only abstain from a resolution that was coming from the Select Budget Committee to making it a'",
        "'speaker_0': 'little bit more broader. To say that a council member may abstain from a resolution at full council if the resolution, as determined by the Council President, does not materially pertain to the city to the city of Seattle business.'",
        "'speaker_0': 'So that is the proposed amendment before us. I'm happy to answer any questions about the substantive amendment, which is fairly simple, I think, and provides an opportunity to to again abstain on only those resolutions that the council president determines are not materially related to the City of Seattle business.'",
        "'speaker_0': 'Councilmember Peterson, would you like to make any additional comments?'",
        "'speaker_2': 'Thank you. Council President. Just just briefly, it was fun working with you in your office on this amendment and appreciate bringing this option forward to just give council members additional flexibility and choice to abstain on these types of resolutions.'",
        "'speaker_2': 'And this brings us closer to Robert's Rules Order Standard and what other Washington citizens are doing. So I appreciate collaborating with us.'",
        "'speaker_0': 'Thank you so much, Councilman Pearson. I appreciate the opportunity to work with you and your office as well. Any other comments or questions on a proposed amendment? A two. Oh. Can't remember her. Please.'",
        "'speaker_5': 'I'm so sorry to do this, but I. Even though I really like the direction that things were moving in, in committee, trying to define the types of resolutions that council members were seeking the opportunity to abstain on. And I feel more confident in, for instance, the ability to abstain on resolutions that really relate to international relations, like'",
        "'speaker_5': 'I that is language that I don't think there would be any unintended consequences with. I am concerned about the unintended consequences of saying of the Council taking an action to say that something isn't city business. And I am just recently working sort of through my thinking on on that with some assistance from the city the city light'",
        "'speaker_5': 'apartment. And given the concerns I have about the potential unintended consequences. I am not going to be able to vote in favor of this amendment, though I did really like the direction it was moving in.'",
        "'speaker_0': 'Thank you. Councilmember Herbold, any other comments or questions on amendment aid to. Right. Hearing none. Will the court please call the rule on the adoption of Amendment a22 Resolution 32029.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. Musgrave I. Petersen I. Strauss Yes.'",
        "'speaker_5': 'Herbold No.'",
        "'speaker_1': 'Whereas yes. Council President Gonzalez I. Seven in favor. One opposed.'",
        "'speaker_0': 'Thank you so much. The motion carries, the amendment is adopted and we now have a amended resolution before the council. I'm going to hand it over to Councilmember Herbold now, who has a motion to make related to Amendment The.'",
        "'speaker_5': 'Thank you so much. I would move of Amendment B in resolution 31920.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded to adopt Amendment B as recently distributed. I want to hand it back over to Councilmember Rebel to address her amendments.'",
        "'speaker_5': 'Thank you so much. Glad to have this opportunity to bring forward an amendment that speaks to the consideration of how we will be returning to our civic building in the coming year and doing the public's business. Thank you again, Council President Gonzales, for supporting and encouraging all council members to participate in this conversation.'",
        "'speaker_5': 'The Committee and for originally sponsoring the amendment that I authored regarding E participation. Also appreciate, of course, the collaboration with Councilmember Mesquita, who is a co-sponsor to this amendment and her office to retain to refine the E participation proposal.'",
        "'speaker_5': 'And please, we were able to come up with a revised amendment circulated this morning. And just the the intent of the of the amendment underscores that when we are returning to our civic building, it is important that we take advantage of some of the lessons that we learned during the pandemic and that robust electronic participation is possible'",
        "'speaker_5': '. Previously, council rules allowed for electronic participation in a very specific, very narrow set of circumstances. We have been able to do electronic participation throughout the pandemic only because of the governor's executive order related to the pandemic. So the current proposal states a preference for conducting business in person, but it also allows for electronic participation whenever technically feasible'",
        "'speaker_5': 'for any reason. And it asks council members to communicate well with the Council President's office and allow staff to plan ahead by providing 48 hours advance notice of electronic participation when they can do so. I think this threads the needle on broadly allowing for electronic participation, while also recognizing the additional burdens on staff for supporting this hybrid'",
        "'speaker_5': 'meeting model. Thanks to Customer Mosqueda for working with my office to strengthen the amendment, which will set the tone, I believe, for our return to City Hall, and I urge the full council's adoption. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Herbold. And I'm going to go ahead and recognize Councilman Christina as one of the co-sponsors of this amendment as well.'",
        "'speaker_3': 'Thank you, council president. I want to thank Councilmember Herb as well and echoed her sentiment. Appreciate the opportunity to work with you and your team. Christina has been great about working with us to ensure that we have equitable access to electronic participation.'",
        "'speaker_3': 'Thanks so much to Social Perri for spearheading those conversations and working with your team. And thanks to Dan Peter from central staff for his work on these amendments and all of the time that you all took over the last few days to really finalize this language, I think it's really important to get this right.'",
        "'speaker_3': 'With the COVID 19 pandemic, we see that there's so many times where public health and equity reasons might cause a councilmember to not be able to participate in person and really appreciate that this legislation and the amendment in front of us today really helps to make sure that no one is choosing between doing their job and ensuring'",
        "'speaker_3': 'broader participation in the public deliberations of our work and protecting the public's health as well. So thanks so much for all of the cooperation, customer support.'",
        "'speaker_0': 'It's so much councilmembers Herbold and Mosqueda for making comments on Amendment eight. Are there any additional comments on Amendment B? I'll just say thanks so much to both of you for working together. We had a really robust conversation about it during the Governance and Education Committee, and I'm glad that you all had an opportunity to work offline'",
        "'speaker_0': 'and thread the needle here in a manner that meets both the goals of flexibility, but also safety, and an opportunity to allow.'",
        "'speaker_2': 'Our.'",
        "'speaker_0': 'Technical staff to to really have the opportunity to facilitate the needs of council members who may want to or need to continue to meet in a hybrid fashion. Appreciate your your collective work on that, because remember anything else?'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'I think we're ready. Let's see here. Will the clerk please call the roll on the adoption of proposed Amendment B?'",
        "'speaker_2': 'LEWIS Yes.'",
        "'speaker_1': 'MORALES That's. Was it a i.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'Strauss Yes. Herbold Yes. Whereas I council President Gonzales I eight in favor and unopposed.'",
        "'speaker_0': 'The motion carries an amendment be is adopted. I'm going to hand it over now to Councilmember Strauss to make his motion on proposed amendment c.'",
        "'speaker_2': 'I think he council president I'm offering amendment C version two to this resolution. And I would like to move Amendment C, version two as distributed to colleagues earlier today and I believe is attached to the agenda as well.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you so much. Just maneuvered and seconded to adopt Amendment C, which was recently distributed as Strauss. Back to you to address your amendment.'",
        "'speaker_2': 'Thank you. Council President. This amendment was redistributed to add increased clarification regarding the amendment. What I'll say is top line. These rules are already in place because our council rules refer to Robert's Rules of Order as far as deliberations are concerned.'",
        "'speaker_2': 'This is just taking Robert's rules of order and putting them in our rules so that we know what we are supposed to be doing. This amendment was limited to me by council members to 10 minutes per speech promotion.'",
        "'speaker_2': 'The rules resolution already states that council members are limited to two speeches promotion. That limit does not include questions. So this ten minute limit is already stated within Robert's Rules of Order, which apply wherever council rules are silent.'",
        "'speaker_2': 'And this amendment would restate that the ten minute limit on council moves for clarity, for clarity and emphasis in committee are proposed to limit the same amendment, but to limit the debate to 5 minutes per council member promotion.'",
        "'speaker_2': 'Because I figured if we request the public to address us within 2 minutes, we can do it in five. But the amendment failed and so this amendment would set that limit at 10 minutes, as including Robert's Rules version two of the amendment, which was distributed just before this meeting, simply changes the word voice to unanimous consent at'",
        "'speaker_2': 'the request of the city clerk's office. Thank you, Councilperson.'",
        "'speaker_0': 'Thanks so much, Councilmember Strauss. Appreciate it. Are there any additional comments on this amendment? Cosmo Peterson, please. And then Councilman Mosquito.'",
        "'speaker_2': 'Thank you. Council president. I'd like to speak for 12 minutes in favor.'",
        "'speaker_1': 'As you all.'",
        "'speaker_0': 'Know, I have been timing you.'",
        "'speaker_2': 'I really appreciate this amendment. Thank you, Councilmember Strauss.'",
        "'speaker_0': 'All right. What about short and sweet? Okay. Any good? I'm sorry. Councilman Moscato, please go ahead.'",
        "'speaker_3': 'I'm still laughing. That was really funny. Councilman Strauss, thank you very much for your work on this amendment. Appreciate the clarifications that we've also received from central staff and the clerk's office about the ability to answer questions. If I have questions directed at a council member or those, the time that it takes to answer a direct question'",
        "'speaker_3': 'as amended by the Council President does not count towards the full ten minute to ten minute allotments. Also appreciate that there is work being done through this amendment which puts this Roberts rules recommendation in the affirmative. We will automatically assume that we're going to have these ten minute allotments versus having the body vote to support it.'",
        "'speaker_3': 'I think that will help with a number of items, and I appreciate that there's some flexibility if the body decides to vote otherwise. But thank you very much for the work that you've done here. And I'm happy to support this amendment in front of us today.'",
        "'speaker_0': 'All right. Because more stress. You will have the last word if no one else has anything to say, because I do try to enforce the Robert runs for order to the best of my ability. Colleagues, any other comments before we hear closing remarks from Councilmember Strauss?'",
        "'speaker_0': 'I'm not seeing any other hands raised. Councilmember strauss, you have the last word.'",
        "'speaker_2': 'I thank you. Council president noting this is my second time speaking in on this motion and both Councilmember Peterson and Councilmember Mosqueda clocked in at just a heckle, a freckle, past the hair as far as timing goes.'",
        "'speaker_0': 'All right.'",
        "'speaker_2': 'Back to you.'",
        "'speaker_0': 'Those 17, 17 seconds, Councilmember Strauss. All right. I'm hearing no additional comments on Amendment C. Will the clerk please call the roll on the adoption of Amendment C two Resolution 32029.'",
        "'speaker_1': 'Lewis. Yes. Morales. Let's get up. Hi, Petersen. Strauss Yes. Herbold. Yes. Whereas. Oh, yes. Council President Gonzalez. I paid in favor and opposed.'",
        "'speaker_0': 'The motion carries. Amendment C is adopted and the amended resolution is before the council. That is the last, the third and the last amendment that I am aware of related to resolution 32029. Are there any further comments on Agenda Item 17, Resolution 32029?'",
        "'speaker_5': 'Councilmember please just want to thank you, Council President Gonzalez, for guiding this discussion. At already mentioned, I appreciated the collaborative approach and allowing us all to come to your committee and provide comment and sponsoring amendments on our behalf if we weren't members.'",
        "'speaker_5': 'But I also really appreciated that we did this before the end of this year so that we could have the benefit of your wisdom, having been our Council President for the last last two years. And I think a lot of a lot of the input has been really well.'",
        "'speaker_2': 'Informed by.'",
        "'speaker_5': 'Your another set of your lived experiences.'",
        "'speaker_1': 'President Gonzalez Well, thank you.'",
        "'speaker_0': 'Thank you, Councilmember of all. Appreciate it. Okay. Any other comments? I'll just close out by saying a big thank you, colleagues, to all of you for all your engagement in the council's revision process. A lot of work has gone into briefing council members, analyzing proposals and preparing various amendments.'",
        "'speaker_0': 'And for that work, I especially want to thank the staff members on the Council Roles Working Group from the Office of City Clerk Monica martinez Simmons, Elizabeth Atkinson, Jody Schwinn, Linda Brown and Amelia Sanchez. Thank you. From central staff Esther Handy and Dan Heater.'",
        "'speaker_0': 'Thanks to both of you. When the city attorney's office, Brandon is leaving Gary Smith and finally, my very own deputy chief of staff writer from my office, who played a very significant role in making sure we all stayed on track and and were able to get this across the finish line in a way that was truly a'",
        "'speaker_0': 'consensus document. So much gratitude to all of them. We are, as I mentioned before, making a number of proposed changes to the Council rules via Resolution 32029. As always, this was an iterative process that will require feature, revision and refinement by the future council.'",
        "'speaker_0': 'So many of the things that we are implementing through these rule changes are new to both the Council's culture and the way we do business. And so it will be important for the next council president in two years from now to to have a look back process to make sure that there is an opportunity for all of'",
        "'speaker_0': 'those representative sections of the council rules. Working Group can give the next council the benefit of any any learning that was had that would necessitate an additional change to the Council. So thanks to everyone for your deep engagement.'",
        "'speaker_0': 'And with that, colleagues, we are at the place where I am recommending adoption of this resolution and I will ask that the clerk please call the role on the adoption of amended Resolution 32029 Agenda Item 17.'",
        "'speaker_1': 'Lewis. Yes. Morales. This was set up by Peterson I. Strauss. Yes. Verbal. Yes. Or as I counsel President Gonzales, I aid in favor and unopposed.'",
        "'speaker_0': 'The motion carries. The resolution is adopted as amended, and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? The Court Please read the short title of Item 18 into the record.'"
    ],
    "Land Use Review Procedures for Minor Expansions of Sewage Treatment Plants.": [
        "'speaker_5': 'The Report of the Land Use and Neighborhoods Committee Agenda Item 18 Council Bill 120215. An ordinance relating to Land Use Review Decision Procedures amending sections of the Seattle Missile Code. Authorized Director of the Seattle Department of Construction Inspection to administratively waive development standards.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Jodie. Appreciate it. I'm going to hand this over to Councilmember Strauss, who is the chair of the committee, so that he can walk us through this item.'",
        "'speaker_2': 'Thank you. Council President. In February of this year, the Washington State Department of Ecology issued an order to King County to take actions to address repeated unauthorized bypasses of untreated wastewater from the West Point treatment facility into Puget Sound.'",
        "'speaker_2': 'Otherwise, raw sewage to the order requires King County to comply by the end of 2025. And one component of this order requires the county install a battery based power supply system to prevent bypass events that could be caused by disruptions to the power flow to the facility.'",
        "'speaker_2': 'In layperson's term, the facility needs to have a consistent power supply and even just a quick lag that is not a power outage can shut down these systems. Typically, constructing this battery system would require a lengthy city permitting process, including asking the city council to approve conditional use decisions because the park is currently in single family zoning'",
        "'speaker_2': 'until later today, which will be in neighborhood residential zoning. All of this introduces significant schedule risks, which could impact the county's compliance with the state order. And as you recall, the mayor initially discussed declaring an emergency order to allow the county to bypass some of these permitting steps.'",
        "'speaker_2': 'After discussions between the mayoral and council central staff, including Kyle Freeman of New Jersey. This legislation, which was identified as a better path, this bill before us would waive the requirement for council conditional use permit and allow SDC director to waive some development standards for the proposed expansion that is necessary to meet the Department of Ecology corrective'",
        "'speaker_2': 'order. All of that said, this legislation would also exempt the project from secret requirements, and this bill contains safeguards to prevent this provision from being exploited, including maximum maximum size thresholds, a requirement for construction management plan, and only applying one exemption to projects necessary to comply with the Department of Ecology Order.'",
        "'speaker_2': 'In committee, we heard from the leadership of the County Wastewater Treatment Division who urged us to pass this legislation before the end of the year. And I concur. Urging a yes vote. Thank you, Council President.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. I do see that Councilmember Peterson has his hand up, please.'",
        "'speaker_2': 'Thank you. Council President. I just want to thank Councilmember Strauss for shepherding this through this committee. It's really important to see how the city lights your public utilities. King County Wastewater. Also, kudos to our central staff for coming up with a workable and rapid solution so that this issue can be put back into the court of King'",
        "'speaker_2': 'County Wastewater. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilman Peterson. Any other comments on agenda item 18 Council Bill 120215 hearing than will the Kirklees Council on the passage of the bill. 120215. Agenda Item 18.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Musharraf. I. Peterson. I. Strauss. Yes. Herbold. Yes. Whereas I. Council President Gonzales. I didn't favorite and opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will these affects my signature to the legislation on my behalf? Will the court please read Item 19 into the record?'"
    ],
    "Amendments to the 2018 Seattle Energy Code.": [
        "'speaker_5': 'Agenda Item 19 Council Bill 120239 An ordinance relating to Seattle's construction codes amending sections of the 2018 Seattle Energy Code adopted by ordinance 126279. The committee recommends the bill passed as amended.'",
        "'speaker_0': 'Thank you so much. I'm going to hand it back over to Councilmember Strauss to walk us through this item.'",
        "'speaker_2': 'Thank you. Council president. And I do believe that Councilmember Lewis will be speaking to this. So I'll just share that. At the start of 2021, we adopted the strong synergy code, my nation, which banned the use of gas or electric resistance for space or water heating in multi-family residential buildings and for space heating and commercial buildings.'",
        "'speaker_2': 'I'll pass it over to Councilmember Lewis and follow up with any further comments if needed.'",
        "'speaker_0': 'In summary, Councilmember Strauss, Councilmember Lewis, please.'",
        "'speaker_2': 'Thank you, Madam Chair. And just to follow along with Councilmember Strauss's remarks, this legislation extends the impacts of the legislation we passed last spring by encompassing most commercial construction, with a couple of exceptions that are itemized in the bill to be included under the requirements of that bill to include electric water heaters in new construction of commercial'",
        "'speaker_2': 'structures. As we've discussed extensively over the last two weeks, we expect this legislation to have a positive impact on our efforts to fight climate change. Appreciate the efforts of stakeholders in this legislation over the course of the last several months in order to answer a lot of questions that were left outstanding from the process in the spring'",
        "'speaker_2': ', necessitating a little bit more discussion and appreciate Councilmember Strauss making space for this and in his coveted committee spots during this month. Given the limited amount of work that we are putting through, I also appreciate the work of Noah on in Councilmember Strauss's office and his effective working with Parker Dotson and my office to shepherd this through'",
        "'speaker_2': ', as well as the work of Stsci and other external stakeholders who have been working on this over the course of the last six months plus. And with that, I have nothing else to add and look forward to.'",
        "'speaker_0': 'Thank you so much, Councilmember Lewis. Are there any additional comments on Agenda Item 19 Council Bill 120239 Strauss, please.'",
        "'speaker_2': 'Thanks. Just wrapping up Council President, this legislation includes several exemptions that did result from compromises made at the Construction Code Advisory Board, including existing upgrades to existing commercial buildings. And this type of exemption doesn't exist in other parts of the code.'",
        "'speaker_2': 'And I just want to note that as we transition in this type of work to addressing the climate crisis, we must ensure that our workers are also taken care of. And so this compromise does continue to move us forward, and we still need to do more to meet the needs of our workers who are earning family wage'",
        "'speaker_2': 'family wages. Thank you, Councilperson.'",
        "'speaker_0': 'Thank you, Councilmember Strauss and Councilmember Lewis, that does conclude the debate on this item. So will the first please call the roll on the passage of council bill 120239 Agenda Item 19 Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Warhol's house was set up by Peterson.'",
        "'speaker_2': 'I. Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Whereas I council President Gonzalez. I aid in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. Will the please to fix my signature to the legislation on my behalf? Will the Court please read the short title of item 20 into the record?'"
    ],
    "Establishment of a Mobile Home Park Overlay District and Related Amendments.": [
        "'speaker_5': 'Agenda Item 20 Council Bill 120206 An Ordinance relating to Land Use and Zoning. Adding a new Chapter 23.70 to the Seattle Municipal Code. Amending Chapter 23.32 of the Seattle Code at page 14 of the official land use map to establish a mobile home park overlay district, the committee recommends the bill passed as amended.'",
        "'speaker_0': 'Thank you so much. This is also under councilmember stresses committee responsibilities. I'm going to call on Councilmember Strauss to address the item.'",
        "'speaker_2': 'Thank you. Council President. This is a moment that I've been long waiting for in part, in large part, most part due to Councilmember Juarez's leadership. This legislation would implement long awaited long term protections for mobile home parks or many furniture, also known as manufactured home parks in Seattle.'",
        "'speaker_2': 'These protections are a result of a conversation that began over three years ago. Over those three years, we have adopted a moratorium on the redevelopment of mobile home parks and renewed that moratorium repeatedly to provide time for this long term protection that we are going to vote on to be crafted, negotiated.'",
        "'speaker_2': 'And thanks to Councilmember Warren's avoided court. Three different land use chairs have dealt with this issue since it was since it first arose. And Councilmember Suarez has provided steady leadership on behalf of her district, District five, throughout this entire process.'",
        "'speaker_2': 'A previous version of this legislation was appealed to a through Examiner over the summer, and we were able to reach a settlement agreement with the appellant to allow us to move forward today because we avoided court. And so this legislation would end the temporary moratoriums by establishing a mobile home park overlay district in the land use code'",
        "'speaker_2': '. The way overlay district would apply to the two remaining mobile home parks in the city, the Halcyon and Bellabeat, which are located next to each other in the Bitter Lake Urban Village. The overlay would impose more restrictive development standards to incentivize preservation of the mobile home parks.'",
        "'speaker_2': 'Specifically, the overlay would limit residential uses to mobile home parks no homes unless the property was sold for the development of affordable housing limit the size of any commercial uses, and establish a height and setback one that match the current mobile home park use of the site.'",
        "'speaker_2': 'This legislation, the legislation does allow for the possibility of future affordable housing development in the overlay. If that were to occur, there would be strong protections for existing residents. Residents would have the right of first offer, would be entitled to location assistance, and would be able to live in the new affordable housing for rent that is no'",
        "'speaker_2': 'more than a third of their monthly income. Finally, the overlay would expire after 30 years on January 1st, 2051. This timeframe creates predictability and stability for residents, while still allowing for the site to accommodate more dense housing for future generations.'",
        "'speaker_2': 'When I was growing up, my grandparents lived in a manufactured home park. I first saw that not how manufactured home parks can be naturally occurring, affordable housing options for many seniors to age in place. And they can also be a source of instability because residents, typically residents, while they own their manufactured home, do not own the land'",
        "'speaker_2': ', meet them. And for most manufactured homes out there, if they were ever to be moved, they would be destroyed in that process. And because they don't own the land underneath them, they have the stability and the manufactured home instability without owning that land.'",
        "'speaker_2': 'And so this legislation ensures that there will be an affordable place to call home for the residents of our last two home parks. Again, thank you to Councilman Juarez and thank you to councilmembers who want to bring this issue up initially in 2019.'",
        "'speaker_2': 'Thank you, council president. That is the committee report.'",
        "'speaker_0': 'It is so much.'",
        "'speaker_5': 'Councilmember Strauss.'",
        "'speaker_0': 'Casimir was. Are there any comments you'd like to make briefly?'",
        "'speaker_6': 'Yes, thank you. Council president, since we're saying thank you, we owe a huge thank you to Kittle, who's been working on this since December of 2008. And a huge thank you to our District five director, Dean Alsip, who has been working diligently and visiting and going out to Halcion and Bellerby.'",
        "'speaker_6': 'And of course, you all have heard from Lynda McCoy. I hope our friends at Bellerby and Halcyon are listening because this really means a lot to them. So thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss and Councilmember Wars. Are there any additional comments on Agenda Item 20 Council Bill 120206. Hearing nine. Will the clerk please for the roll on the passage of Council Bill 120206. Agenda Item 20.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales as Rosetta I. Petersen. Yes. Strauss. Yes. Herbold. Yes. Whereas I council. President Gonzalez. I aid in favor and oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Please read the short title of item 21 into the record.'"
    ],
    "Renaming Single-Family Zones and Amending Related Land Use Regulations.": [
        "'speaker_5': 'Agenda Item 21 Council Bill 120214 An ordinance relating to land use and zoning renaming single family zones two neighborhood residential zones. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. Councilmember Strauss, back to you.'",
        "'speaker_2': 'Thank you. Council President. In September, the city council passed an amendment to the sale, a comprehensive plan to change the name of single family zones to neighborhood residential zones to better reflect the reality of these zones, which already include many backyard cottages, detached houses that are home to multiple families and legacy duplexes and triplexes that pre-date our'",
        "'speaker_2': 'existing zoning laws. The name change was also a long standing request of both the Seattle Planning Commission, as well as the City Council from the mandatory housing affordability process. In September, we adopted that comprehensive plan amendment. The legislation before us today would implement that comprehensive plan amendment by amending the municipal code to effectuate the name change.'",
        "'speaker_2': 'Again, there are no changes to zoning within this bill. We are required to amend the comprehensive plan before we can change the land use code. So just like in September, the legislation does change the underlying. It does change the zoning name.'",
        "'speaker_2': 'It does not change what is allowed to be constructed in that zone. It just changes the name to neighborhood residential. I have to like I have to call out and shout out the leadership. Councilmember Mosqueda. Councilmember Mosqueda has led on this issue before I came to office as well as to Aaron House for her work and outreach'",
        "'speaker_2': 'and Alicia Whitson for his amazing work on all of these land use policies. Nor on my committee director has had an integral role. And thank you to Noah Councilmember Strauss.'",
        "'speaker_0': 'Appreciate it. Colleagues, any additional comments on this council? Bill Agenda Item 21 Council Bill 120214 Councilman Mosquito, please.'",
        "'speaker_3': 'Thank you very much. Council President. Thank you. Chair of Land Use of Members Trials. Thank you for sponsoring this follow up legislation to the legislation we co-sponsored this summer amending the Comprehensive Plan. I am very excited about this follow up.'",
        "'speaker_3': 'I think that, as you said, this will help us lay the ground, make sure that our language and code, as well as in a comprehensive plan, is reflective to the true character of South Africa's. As we embark on the much awaited and deeply engaging comprehensive plan, major updates that will start with community engagement next year and will'",
        "'speaker_3': 'hopefully work to address the exclusionary zoning still embedded in our statute. I really appreciate that the more inclusive, accurate names such as Negative Neighborhood Residential recognizes these neighborhoods are already home to that diversity that you outlined and helps to make sure that folks know how that diversity adds to our thriving neighborhoods across Seattle.'",
        "'speaker_3': 'And the name Single Family Designation solely does not yield the truly diverse nature of what our neighborhoods are as we seek to have robust discussion with community members going forward. I want to also thank Erin House and I know you did a tremendous amount of work.'",
        "'speaker_3': 'And as I mentioned in your committee last week, I want to extend our appreciation as well to our state legislative champions, who have also been embarking on similar efforts at the state level to try to create more inclusive and diverse cities across our state.'",
        "'speaker_3': 'And I want to thank our very own representative to represent Mary Fitzgibbon, Representative Chopp, along with community organizations such as the Housing Development Construction, South Seattle Chamber of Commerce and Sierra Club. 350 Seattle Share the Cities and API a Seattle chapter.'",
        "'speaker_3': 'I think this is a really exciting day. From a purely technical perspective, the term single family has been a misnomer since 1994, when the ADU legislation was passed so long overdue and greatly appreciated. Councilmembers very excited to vote for this.'",
        "'speaker_0': 'You so much. Councilor Mesquita, are there any additional comments on comfortable 120214. Agenda item 21 Hearing None. Will the clerk please call the roll on the passage of Council Bill 120214. Agenda Item 21.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Let's get up. Hi. Peterson. Hi. Strauss. Yes. For Bill? Yes. Whereas I council President Gonzalez I eight in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Please read item 22 into the record.'"
    ],
    "Historic Preservation Controls for 802 16th Avenue Landmark.": [
        "'speaker_5': 'Agenda Item 22 Council Bill 120235 An ordinance relating to Historic Preservation Imposing controls upon 802 16th Avenue and adding it to the table of historical landmarks contained in Chapter 25.32 of the Seattle Municipal Code. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. Madam Clerk has Member Strouse back to you.'",
        "'speaker_2': 'Thank you. Council President. This legislation imposes landmark controls on property located at zero 2/16 Avenue in the Central District, also known as the Immaculate Conception Convent. The home was constructed in the neoclassical style by architect Edwin Holton and includes several exterior stained glass windows.'",
        "'speaker_2': 'The house was constructed beginning, beginning in 1900 for the family of Thomas Constantine, then stage manager for the People's Theater. It was later purchased by Future City Council member and later by the Immaculate Conception Church for a as a convent for nuns.'",
        "'speaker_2': 'The house sat empty for much of the 1970s due to redlining. While vacant, the house became a space where children roller skated and local bands practiced and practiced, including Hometown Hero, Garfield Bulldog, Jimi Hendrix. How the home has since been divided into four apartments and is occupied by owner Sue Perry as well as daughter Amy.'",
        "'speaker_2': 'I hope I go pain. I'm so sorry, Amy. I know you are a leader in so many ways. You say one more time.'",
        "'speaker_0': 'Ago being.'",
        "'speaker_2': 'A gopi and thank you. Sincere apologies. Dr. Hagopian. The house is being designated under three of six standards for designation that it is associated with cultural, political or economic heritage of the community. It embodies characteristics of architect of an architectural style, and that it is an outstanding work of the designer or builder.'",
        "'speaker_2': 'Controls will apply to both the site and house exterior, including its stained glass windows council president. That's the committee report.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. Appreciate it. Are there any additional comments on agenda item 22 Council Bill 12023 Thank. Because we're asking to please.'",
        "'speaker_3': 'You very much. And Councilmember Strauss, I'm very glad that you mentioned Professor Hagopian as well. I appreciate the family's interest in this parcel. And as we talked about in your committee, I think this is a great example of what Professor BEAUBIEN talks about, which is public health and community health, centering on an ability for folks to have'",
        "'speaker_3': 'cultural spaces and places to gather. And housing and community spaces all accessible to our community is something I'm really excited about. And Amy noted that in her and her conversation about how this site has been used over the years, and I look forward to future opportunities to hear stories like that in the future and in the future'",
        "'speaker_3': 'with the use of this location. But that it was a great time to focus on community and public health. And I wanted to just thank Professor Hagopian and her family as well as the folks who made the the recommendation and passage possible.'",
        "'speaker_3': 'So thank you for coming. Councilmember Strauss is the chair of the committee for shepherding this through and looking forward to supporting it.'",
        "'speaker_0': 'Thank you so much. Any additional comments on agenda item 22? Harry Nunn will fill the role on the passage of Council Bill 120235 Agenda Item 22 Lewis.'",
        "'speaker_1': 'Yes. Morales. Yes. Mosquito. Hi, Petersen. Hi, Strauss. Yes. HERBOLD Yes. Whereas I council President Gonzalez I eight in favor and unopposed.'",
        "'speaker_0': 'Bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the Court please read Item 23 into the Record.'"
    ],
    "Agreement with Woodland Park Zoological Society for Zoo Operation and Management.": [
        "'speaker_5': 'Report of the Public Assets and Native Communities Committee? Agenda Item 23 Council Bill 120164 An ordinance relating to Seattle Parks and Recreation authorizing the Superintendent of Parks and Recreation to enter into an agreement with the Woodland Park Zoological Society for Operation and Management of the Woodland Park Zoo.'",
        "'speaker_5': 'The committee recommends a bill passed as amended.'",
        "'speaker_0': 'Thank you so much. Customer worries. This is your ordinance. I want to hand it over to you to provide the committee for report.'",
        "'speaker_6': 'If you're council president, as the clerk says, this is legislation relating to the Woodland Park Zoo contract. So this is legislation that would renew the operations and management agreement between the city of Seattle and the Woodland Park Zoo.'",
        "'speaker_6': 'I will highlight I won't go through all the highlights. I shared some of that this morning. So this is the current 20 year contract, which the current 20 year contract remains active until February 22 of this year. Both parties and the zoo and the city have negotiated agreement to renew and update policies related to the public benefits'",
        "'speaker_6': ', zoo operations, services and care of the animals. As I shared this morning, I want to thank my colleagues on the committee, and those of you who came, who were not part of the committee are Councilmember Strauss and submitted the 15 amendments by November 30th.'",
        "'speaker_6': 'And we got them all done and I think it's a better deal. And so with that, the committee recommends or I recommend that the Seattle City Council Pass Council Bill 12064 as amended.'",
        "'speaker_0': 'Council President thank you so much for your words of support. Are there any additional comments on Council Bill 120164 Agenda Item 23 as we're asking, please.'",
        "'speaker_3': 'Thank you very much. I also want to thank Councilmember Juarez as chair of the committee for the work that you've done on the various amendments. I think those 15 on just one piece of legislation and especially extend a thank you to unite here locally local eight for bringing the opportunity to include labor peace provision into this agreement'",
        "'speaker_3': 'and to our attention. And thank you Councilmember Juarez and to members of the zoo for working with us and for the committee's vote to include the Labor Harmony Amendment and to this agreement in front of us. Excited about that and thank you.'",
        "'speaker_1': 'For your work.'",
        "'speaker_0': 'Much conspiracy to consume a verbal.'",
        "'speaker_5': 'You so much want to also appreciate the leadership of my colleagues who represent the neighbors to the zoo. Councilmember Strauss and Councilmember Peterson and of course Council member Suarez for steering the committee through this really important complex oversight work on the agreement.'",
        "'speaker_5': 'Really many thanks to the passionate advocates who care so deeply about the zoo and the animals in its care. This was difficult because so many people care about the zoo and because the state of research and standards of care and community sentiment all can change so rapidly.'",
        "'speaker_5': 'In a 28 year agreement committing significant city resources, it was appropriate. I feel that we took the time to carefully consider what was proposed here from stakeholders and debate changes. I'm particularly glad and thankful that we supported requiring council oversight and approval of the long range plan, which will identify the capital and animal habitat changes that this'",
        "'speaker_5': 'zoo will pursue for years to come. By requiring approval of the long range plan we are building in a touchpoint where the public will have an opportunity to raise concerns and the Council will have an opportunity to exercise reasonable oversight of significant planned changes to the zoo that may impact its operations, animals or financial health.'",
        "'speaker_5': 'Over the course of the agreement, I know this was a challenging process, but with coordination required between council and central staff and enforced by Councilmember Juarez, I think the the outcome was was was a very good outcome. And I hope the public agrees and I hope that the zoo agrees.'",
        "'speaker_5': 'I really appreciate their collaboration on the effort. And I also want to just give a shout out to Brian Goodnight on council central staff who helped us sort through and make sense of a long but important document as well as the staffing of Christina because he was in my office as well.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember.'",
        "'speaker_6': 'For.'",
        "'speaker_0': 'Any additional comments. Councilman Juarez, any closing remarks.'",
        "'speaker_6': 'Now, my husband was trying to vote, but other than.'",
        "'speaker_4': 'That, no.'",
        "'speaker_0': 'Well, Don, you'd have to run against it if we wanted to.'",
        "'speaker_1': 'Yeah, I did.'",
        "'speaker_6': 'He's still in West Seattle, right?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'All right, well, hearing no additional comments will occur. He's got the role on the passage of Council Bill 120164. Agenda item 23.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. Mosquera. I. Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss. Yes. Herbold. Let's thank you, Councilmember Suarez by Council President Gonzalez. I aid in favor not oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign. It will affect my signature legislation on my behalf. Please read item 24 into the record.'"
    ],
    "Creation of an Indigenous Advisory Council.": [
        "'speaker_5': 'Agenda Item 24 Council Bill 120188 An ordinance creating an Indigenous Advisory Council for Tribal and Urban Indian Engagement. Adding a new Chapter 3.75 to the Seattle Missile Code and amending Section 3.35.050 of the Seattle Municipal Code. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much. I'm going to hand it back over to Councilmember Juarez to address this item.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'Council President. This is actually a great day, a big day for the city of Seattle for the creation of the Indigenous Advisory Council. We've never done this and we did it. Thank you, colleagues. This bill creates a nine member Indigenous Advisory Council for the important purpose of providing direction, guidance and subject matter expertize to advise Seattle elected'",
        "'speaker_6': 'officials and city departments on policy issues pertaining to urban native populations. Tribal communities. Tribal Government. The Advisory Council will not only work closely with the Public Assets and Native Communities Committee, but with other Seattle City Council members, the mayor and the city departments to coordinate overall policy development.'",
        "'speaker_6': 'This legislation is a long time coming and I'm very proud of this council for working with me to get it done. This legislation builds upon the work of this Council from two years ago when we created a new staffing position to support the work of the Council.'",
        "'speaker_6': 'Thank you, Madam Chair and Madam Budget Chair. This budget action passed and the position has since been filled under the Department of Neighborhoods. We engage with tribal councils, tribal leadership, community organizations, urban Indian organizations and subject matter experts in the drafting of this legislation.'",
        "'speaker_6': 'We researched what other jurisdictions had created, particularly by Portland and San Francisco. I envision a council structure to recruit and empower community leaders, elders, youth professionals and tribal council elected leaders to bring forward their perspective and direct public policy here at the city of Seattle.'",
        "'speaker_6': 'I'm also committed to empowering our Indigenous Advisory Council staff leaders on our new Stafford neighborhoods, Francesca Murnane, to allow this body to organically grow and expand as the community deems and sees fit. The city needs Indigenous knowledge at the table to allow accurate representation and greater ideas in our public policies and debate.'",
        "'speaker_6': 'The city is committed to building that trust with tribal governments and learning more. The passage of this bill would make this a reality, and I'm very proud of this historic moment. The Public Assets and Native Communities Committee recommends that City Council pass this bill.'",
        "'speaker_6': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you so much, consumers. Appreciate it. Are there any additional comments on Council Bill 120188? Agenda item 24. I'm Carlsberg Strauss, please.'",
        "'speaker_2': 'Thank you. And thank you, Councilmember Juarez. I know we've been tracking this from afar because I don't want to get in the way of your leadership just knowing that your your staff has been incredible on this work. So I just want to thank you and your staff for this work.'",
        "'speaker_0': 'Thank you. Right. Any other comments? Right. Hearing none. Will Kirk, let's go ahead and make history, shall we? Will the clerk please call the roll on the passage of Council Bill 120188 Agenda Item 24 Lewis.'",
        "'speaker_1': 'Denise Morales. As. Was it a? Yes. Petersen Yes.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'You're bold. Yes. Whereas I council President Gonzalez I didn't favor.'",
        "'speaker_0': 'And unopposed the bill passes and the chair will sign it. Will the person please affix my signature to the legislation on my behalf? Congratulations, Council, Lawrence.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'All right, let's keep going here. Will the clerk please read item 25 into the record?'"
    ],
    "Authorization for Superintendent of Parks and Recreation to Apply for State Grant Funding.": [
        "'speaker_5': 'Genda item 25 Resolution 32034a resolution relating to Seattle Parks and Recreation authorizing the Superintendent of Parks and Recreation to act as a authorized representative agent on behalf of the City of Seattle and to legally bind the City of Seattle with respect to certain projects for which the city seeks grant funding assistance managed through the State Recreation and'",
        "'speaker_5': 'Conservation Office Office. The committee recommends the resolution be adopted.'",
        "'speaker_0': 'Thank you, Madam Clerk. Coming handed back over to Councilmember Juarez.'",
        "'speaker_6': 'And Q Council President. As I shared with you before, this is a perennial issue. It comes through committee every year, and every year we go to the state and the state gives us money. That's pretty much it in a nutshell.'",
        "'speaker_6': 'So this bill would allow Seattle Parks Superintendent to accept grant.'",
        "'speaker_4': 'Funding from the Recreation and.'",
        "'speaker_6': 'Conservation Office. We do this every year and our committee, your committee, the city's committee, recommends that the city council adopt this resolution.'",
        "'speaker_0': 'Wonderful. Thank you so much, Councilmember Wise. Appreciate it. Are there any additional comments on Resolution 32034, item 25? Here in none will the police have a role on the adoption of Resolution 32034 Agenda Item 25 Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'MORALES Yes. Must get up high.'",
        "'speaker_2': 'Paterson High.'",
        "'speaker_1': 'Strauss Yes. Verbal Yes. Whereas High Council President Gonzalez High eight in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. The resolution is adopted and the chair will sign it. Lippert Please affix my signature to the legislation on my behalf. Hey, let's go ahead and have the first read item 26 into the Record.'"
    ],
    "Compensation Program for Fire Chief Position.": [
        "'speaker_5': 'Report of the Public Safety and Human Services Committee. Agenda Item 26 Council Bill 120248 An Ordinance relating to City Employment Creating a compensation program for the position of Fire Chief specifying provisions for the Administration of said compensation program and ratifying and confirming certain prior acts.'",
        "'speaker_5': 'The committee recommends bill passed as amended.'",
        "'speaker_0': 'Madam Sirkin They handed over to Councilmember Herbold, who is the chair of this committee, to address the item.'",
        "'speaker_5': 'Thank you so much. So the background on this is currently the fire chief is classified as what's called an executive for that's the same classification as exists for the deputy fire chiefs. The executive has identified salary compression issues in the department and that is created when the job top job is classified in the same way as other'",
        "'speaker_5': 'jobs. And that creates a outcome where there's little or no difference in pay, but large differences in responsibilities, skills or qualifications. The Human Resources Department connect. It conducted an analysis of comparable fire chief positions among what's referred to as the standard West Coast seven cities San Francisco, San Diego, Oakland, Long Beach, Sacramento.'",
        "'speaker_5': 'San Jose and Portland. To come up with a new salary rate for the position of fire chief and this legislation codifies that the. Thank you so much, Councilmember Herbold.'",
        "'speaker_0': 'Are there any additional comments? Hearing on what the police called the roll on the passage of the bill.'",
        "'speaker_1': 'LEWIS. Yes. Morales Yes. Mosquera i. Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Strauss Yes, for both. Yes. Whereas I council President Gonzalez, I didn't favor none of those.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Well, the clerk please read item 27 into the record.'"
    ],
    "Data Reporting Responsibilities for the City Attorneys Office.": [
        "'speaker_5': 'Agenda Item 27 Council Bill 120247 An ordinance relating to the Organization of City Government adding data reporting responsibilities to the City Attorney's Office and adding a new Chapter 3.46 to the Seattle Municipal Code. The committee recommends the bill passes amended.'",
        "'speaker_0': 'Thank you so much, Governor Herbold, you are the chair of this committee. Would you like to address the item first?'",
        "'speaker_5': 'Actually, I think I would like to hand it over to the sponsors to address. Thank you.'",
        "'speaker_0': 'Great customer. Lewis, would you like to go ahead and make some remarks about the base legislation? I know you have an amendment that you'd like to have us consider, but perhaps you can address the base legislation before we consider the amendment.'",
        "'speaker_2': 'Certainly, Madam President, I mean, this is the much discussed data reporting and transparency legislation that would require quarterly reporting of certain important metrics from the Seattle City Attorney's Office pursuant to certain funding decisions that we made during the budget cycle.'",
        "'speaker_2': 'I do think part of the confusion attached to this is that if we had been successful in having this legislating happen concurrent with the rest of the budget, maybe it wouldn't look strange.'",
        "'speaker_6': 'To be doing it now.'",
        "'speaker_2': 'But in any event, this legislation matches certain new funding additions in this recent budget, with certain reporting requirements similar to other sources that affect notice and reporting requirements. It is incorporated into the Seattle Municipal Code. I think I can leave it right there for now pending the discussion on the amendment and I can make further remarks later'",
        "'speaker_2': 'if that is helpful as well.'",
        "'speaker_0': 'Thank you so much, Councilmember Lewis. Appreciate it. Colleagues, we're going to go ahead now that we have the base legislation that to consider before us is described, Councilmember Lewis, I think it would be appropriate for us to consider the amendment and have a discussion about the amendment.'",
        "'speaker_0': 'And then once the amendment passes through or does not, we can then have a we can open up that conversation to the bill as amended or not. So consider, Lewis, when you go ahead and make your motion for us to consider the amendment, and then we can discuss that amendment and then and then open up the discussion'",
        "'speaker_0': 'to the broader bill after we consider the amendment.'",
        "'speaker_2': 'Thank you, councilmembers. I have an amendment I would like to propose. It did not meet the council rule of distribution prior to 12 noon and would request that the rules be suspended to allow consideration.'",
        "'speaker_0': 'Thank you, Councilman Lewis. If there's no objection, the council rules will be suspended to allow to allow an amendment that was not distributed by noon, as customarily was just. Mentioned. Carry no objection. The council rules are suspended and we cannot proceed with consideration of the amendment.'",
        "'speaker_0': 'Councilor Lewis. Now you have to move the move the actual amendment.'",
        "'speaker_2': 'Yes. Thank you, Madam President. I do move to amend Council Bill 1 to 0 247 as presented on Amendment 1/2.'",
        "'speaker_0': 'Thank you. It's been moved and seconded to amend the Council Bill as presented on Amendment one. I'm going to hand a back over to Councilmember Lewis to address the amendments.'",
        "'speaker_2': 'Thank you, Madam President. And this is an amendment that was recommended after consultation with law. I do apologize not distributing this amendment. Prior to noon, there was some confusion on whether I would be bringing it or whether Councilmember Peterson would be bringing it.'",
        "'speaker_2': 'But we did sort that out and I did so distributed. The impact of this amendment relates to a mandatory language that Council President Gonzalez passed into this legislation during the committee meeting last week, creating a 90 day notice requirement for material changes to the free file diversion program.'",
        "'speaker_2': 'This would alter the language to be notification to the Council of such changes within 90 days of implementation, rather than wording it as 90 days before implementation. This is the preferred language of the law department just to make sure that this legislation does not potentially run afoul of the charter requirements on giving full supervisory responsibility of pending'",
        "'speaker_2': 'legislation, including the possibility of of a diversion. Investing that in the city. Attorney I don't believe the practical effect of this amendment is going to be that significant, though it is possible that it could certainly create a looser notification requirement than the current language, though I think the important thing indicated here is that there be an expectation'",
        "'speaker_2': 'of notification and I am sure that that is going to be something that the Council will be very assertive about, making sure that there is close consultation on how these investments are being are being spent. So this is the preferred language from law just to make sure that we do not inadvertently run afoul of the charter.'",
        "'speaker_2': 'And I do believe just erring on the side of being cautious and staying within our oversight and due diligence. LANE This language is more appropriate, a more appropriate modification of the legislation. So with that, I don't have anything else to add.'",
        "'speaker_0': 'Thank you so much, Councilmember Lewis. Are there any additional comments on Amendment One? I haven't seen any other hands raised. So let's go ahead and pull this to a vote. Well, he's called the role on the adoption of Amendment One.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. Let's get up. I. Petersen I.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'For both, yes. Whereas I counsel President Gonzalez I it in favor and unopposed.'",
        "'speaker_0': 'The motion carries and the amendment is adopted and we now have an amended council bill before us. Are there any further comments on the amended council? I'm not seeing any hands raised. Do you want to say thank you so much to Councilmember Lewis and his staff for working with my office on this bill?'",
        "'speaker_0': 'It was a pleasure to co-sponsor this bill with you. That is really at the core a good governance transparency bill that requires some reporting that is transparent to members of the public on a set of programing that we have been consistently asked to fund and to expand.'",
        "'speaker_0': 'And as a result of those budget implications, I do think it's appropriate for us to request, regardless of who the city attorney is, information about the effectiveness of that program in a way that is transparent, consistent and where expectations are the same in this sort of cross branch setting.'",
        "'speaker_0': 'So appreciate an opportunity to work with you and with you in your office. And of course, thanks to Brianna Thomas, my chief of staff in my office, for all of her good work on this as well. And huge thanks to Councilmember Herbold for allowing us to have a hearing and and shepherding us through the legislative process.'",
        "'speaker_0': 'We appreciate your graciousness in allowing us an opportunity to have that conversation in your committee. Councilmember Lewis, any closing remarks?'",
        "'speaker_2': 'Thank you, Madam President. I do just want to briefly we've been discussing this a lot, and I made extensive statements in briefings. So I just want to cover some of the top line edits I alluded to in my remarks before the amendment.'",
        "'speaker_2': 'I do think that the timing has been somewhat unfortunate given that this legislation appears deep, coupled from our budget, which has invited all sorts of strange interpretations and strange bedfellows opposing more transparency, including a daily newspaper. I would say that I just want to emphasize the coupling of this legislation with the unprecedented additional investments in the city'",
        "'speaker_2': 'attorney's office. This incoming city attorney is going to have more resources available to her than any of her predecessors, including new positions to facilitate the collection and dissemination of data which this legislation is structured to complement. So this is not some new mandate on top of existing resources.'",
        "'speaker_2': 'This is new requirements for the office that is directly related to personnel increases and funding increases that we just put into this budget with something like this in mind at the time. So I think that that's just important emphasized.'",
        "'speaker_2': 'That is a $38.5 million budget that the city attorney's office is going to have for 2022. It's a 9% increase from the previous biennium and certainly warranted given the situation that we're in the city and the need to make sure that all of our officers that engage in public safety work can be successful.'",
        "'speaker_2': 'The implication that this council is being insufficiently supportive of that incoming office is frankly just not borne out by the statement made by the budget that we just passed earlier this month. So I do I just want to signify that despite the tension over the course of the last week regarding this legislation, I remain dedicated to working'",
        "'speaker_2': 'with the incoming city attorney to address a lot of chronic issues in the city. This data transparency is going to be a big part of allowing the council and the city attorney to work together to really refine and address the best strategies to address some of our public safety challenges.'",
        "'speaker_2': 'And it is my hope that we can move forward in that spirit despite this disagreement over this legislation this week. So with that, I don't have anything else to add.'",
        "'speaker_0': 'Anti-consumer Louis for closing out debate. Appreciate your leadership on this issue. Will the Court please call the roll on the adoption of Council Bill 120247 as amended?'",
        "'speaker_1': 'The words. Yes. Morales. Yes. Skinner I. Peterson No. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Verbal? Yes. Whereas I. Council President Gonzalez and seven in favor one opposed.'",
        "'speaker_0': 'The motion carries and I'm sorry yes the motion carries the council bill is adopted as amended and the chair will sign it will the first please to fix my signature. It's in the legislation on my behalf will please read item 28 into the record.'"
    ],
    "Seismic Retrofitting of Unreinforced Masonry Buildings.": [
        "'speaker_5': 'Agenda Item 28 Council Bill 32033a resolution declaring the City Council's and the mayor's intent to consider strategies to ensure that all unreinforced masonry buildings in Seattle are seismically retrofitted. The committee recommends the resolution be adopted as amended.'",
        "'speaker_0': 'Thank you so much for coming to hand it over to Councilmember Herbold to address this item.'",
        "'speaker_5': 'So much so little background on the issue first. In 2017, the city's unreinforced masonry policy committee released final recommendations, which note that there are over 1100 unreinforced masonry buildings in the city. And these buildings pose a risk because occupants of them are likely to be injured or killed in a major earthquake.'",
        "'speaker_5': 'The cost of seismic upgrades is a barrier for building owners. The report suggested that the city worked to focus first on the 77 buildings with critical vulnerability. Those include hospitals, schools and fire stations. The 2017 recommendations estimates a total cost to building owners for all 1100, you are rooms of over $1,000,000,000.'",
        "'speaker_5': 'So finding a way to finance this work is a really important component to developing a program to require seismic retrofits. In 2020, after city lobbying efforts, the state passed and the governor signed into law something called the Sea Pacer program.'",
        "'speaker_5': 'This is a program that provides a financing financing mechanism to help owners of commercial and multifamily buildings cover the costs associated with energy efficiency and seismic retrofit. The PACER program is is well, the state basically authorizes counties to create the C Pacer program.'",
        "'speaker_5': 'So King County has had to enact it because the funding mechanism is related to the function of property assessments. As we know, that's a function of county government. So King County has just recently done this, which is great news.'",
        "'speaker_5': 'And as a result, that program is anticipated to begin accepting applications in early 2022. Since early 2020, I've been working with stakeholders to craft a resolution that would provide guidance to city departments in their development of a phased mandatory retrofit program for you arms.'",
        "'speaker_5': 'I had hoped to pass the resolution last year. However, the work of the Office of Emergency Management and the Seattle Department of Construction is inspections necessary to fulfill the requirements that are contained in the resolution was not possible given the 2020 focus on addressing the emergency impacts of COVID 19.'",
        "'speaker_5': 'So today is a culmination of a year's worth of work with stakeholders and the executive to agree on the reporting parameters and timelines contained in the resolution. Additionally, included in Mayor Durkin's proposed budget and supported with the final passage of the Council was funding for a full time position to facilitate and coordinate the work necessary to develop'",
        "'speaker_5': 'a final program to address unreinforced masonry buildings. I just want to, before we call for the vote, I want to give thanks to a SAP, which is otherwise known as the Alliance for Safety, Affordability and Preservation. It's a broad spectrum of concerned stakeholders, including market rate, affordable housing developers, property owners, historic preservationists, engineers and neighborhood associations.'",
        "'speaker_5': 'It is they that have come together to develop these creative solutions to the threat to public safety and the rich legacy of our region's built environment posed by the impact of future seismic events on our unreinforced masonry buildings.'",
        "'speaker_5': 'Creating a pathway as contemplated in the resolution will require that we continue to work together. And I look forward to that work next year. Thanks.'",
        "'speaker_0': 'Thank you so much. Councilmember Herbold, are there any additional comments on Resolution 32033, agenda item 28? Hearing no additional comments. Will the clerk please call the role on the adoption of resolution 32033? Item 28.'",
        "'speaker_1': 'Lewis. Yes. Morales. Yes. Mesquita, I. Peterson. Hi. Strauss. Yes. You're both. Yes. Whereas I council President Gonzalez, I aid in favor and then oppose.'",
        "'speaker_0': 'The resolution is adopted and the chair will sign. It will please affixed my signature to the legislation on my back squished down.'",
        "'speaker_5': 'Will the. Sorry, Judy. You are.'",
        "'speaker_0': 'Unmuted still. Will the group please read item 29 into the record?'"
    ],
    "Human Rights Ordinance on Citizenship, Immigration and Race.": [
        "'speaker_5': 'The Report of the Community and Economic Development Committee Agenda Item 29 Council Bill 120241 An ordinance relating to human rights, including protections against discrimination based on citizenship and immigration status. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you so much. Customer morale as someone handed over to you to provide the committee report.'",
        "'speaker_6': 'Q Council President Yes. This legislation would align the city's discrimination protections with recent changes to the state's Washington law against discrimination to include discrimination based on citizenship and immigration status, and to provide a definition of race that is inclusive of traits historically associated or perceived to be associated with race.'",
        "'speaker_6': 'This includes, but is not limited to hair texture and protective hairstyles such as afros, braids, locks and twists. And because black women are disproportionately likely to be discriminated against because of their hair, including hairstyles in the city's definition of race can help protect illegal discrimination that is primarily faced by black women.'",
        "'speaker_6': 'So there's sort of too intense here to align us with the state's law and also to make sure that we are protecting this class.'",
        "'speaker_0': 'Thank you so much, Councilmember Morales. Are there any additional comments on Council Bill 1202 or one item 29? Harry Nunn will discuss the law on the passage of Council Bill 1 to 0 two for one item 29.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Mesquita I. Petersen, I. Strauss Yes. Verbal Yes. Whereas I council President Gonzalez I aid in favor and oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the please. If it's my signature to the legislation on my behalf, will the clerk please please read items 30 through 34 into the record?'",
        "'speaker_5': 'Agenda Items 3334. Appointments 20642065206720682078. The appointment of Alexander F Chang as member Seattle Human Rights Commission for a term two January 22nd, 2022 and the appointments of Rupali Dhingra, Amanda, Richard, Jacqui Schultz and Shyla Reid as members. Four Terms to January 22nd, 2023.'"
    ],
    "Recognition and Implementation of the Crown Hill Urban Village Action Plan.": [
        "'speaker_5': 'Agenda item 40 Resolution 32035. A resolution recognizing the efforts of the Crown Hill community to prepare an action plan for their community and identifying strategies and actions to implement the Crown Hill Urban Village Action Plan.'",
        "'speaker_0': 'Thank you, Madam Chair. I move to adopt Resolution 32035. Is there a second second? It's been moved and seconded to adopt the resolution. I'm going to hand this over to Councilmember Strauss was the sponsor of the resolution.'",
        "'speaker_2': 'Thank you, Council President. And I do need to note that it is a bittersweet and a humble honor to be the last to respond to your request as presiding officer for Council of the City Council in the City of Seattle.'",
        "'speaker_2': 'I'm glad that this is a three hour meeting, lest you forget the long meetings, and I hope that Cameron is in the background with a way to celebrate once we're done. Conduct business. To the resolution 3 to 0 three five, the Crown Hill Community Action Plan.'",
        "'speaker_2': 'This resolution recognizes the tremendous effort, a tremendous community effort that went into producing the Crown Hill Community Action Plan, which was finalized this last Friday. The community planning process that resulted in the Crown Hill Community Action Plan began in 2018.'",
        "'speaker_2': 'The Office of Planning Community Development launched a process to engage with neighborhood, ultimately connecting with around 300 community members through workshops, focus groups, door to door, canvasing, tabling at community events and much more. Those community conversations informed the Community Action Plan, which sets the vision for Crown Hill's future as a walkable, vibrant neighborhood as one of the'",
        "'speaker_2': 'fastest growing, changing neighborhoods in Seattle. It is one that lacks a light rail station. This Community Action Plan contains steps that the city and community members can take to make the neighborhoods vision a vision for a community light rail station into a reality, something that I support.'",
        "'speaker_2': 'The plan is broadly oriented around these three priorities a distinct neighborhood with great destinations and a vibrant public realm streets that encourage walking and making it easy to get around in connected, engaged, thriving communities. This Community Action Plan was delayed and put on pause because of COVID.'",
        "'speaker_2': 'I'm glad that this is another opportunity where the city of Seattle can build back better and bring this forward. Community members contacted me earlier this year with concerns that the plan would be forgotten in the mayoral transition. And so I worked to push the mayor's office to have OK'd complete this work on this plan before the end'",
        "'speaker_2': 'of the year. OPD took one final round of community feedback and made final changes to the plan last week to add more emphasis on affordable housing and encouraging new indoor meeting and gathering spaces. The next steps for this plan will require us to adopt new design guidelines for Crown Hill next year.'",
        "'speaker_2': 'And again, if Councilmember Juarez can get 130th Street Station, I'm going to get a Crown Hill station. I hope everyone heard that loud and clear. I would also like to thank Katie Hyman at OPIC for her fantastic work on this.'",
        "'speaker_2': 'And I would like to thank Karen LaBelle, president of the Crown Hill Village Association, and Selznick and Patty Arroyo for joining us at the Land Use and Neighborhoods Committee recently, as well as everyone else who shared their feedback to help shape this plan.'",
        "'speaker_2': 'With that Council President, you are nearly released and I that is my report.'",
        "'speaker_0': 'Thank you, councilmember strauss. Are there any additional comments on resolution 32035? NEARY None will the clerk please call the roll on the adoption of Resolution 32035. Agenda item 40.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. I must get to Paterson. Hi, Strauss. Yes. You're bold. That's. Whereas I council President Gonzales. I didn't favor none of.'",
        "'speaker_0': 'Thanks so much. The motion carries, the resolution is adopted and the chair will sign it for the very last time. Will the clerk please affix my signature to the legislation on my behalf? There is one other item of business.'",
        "'speaker_0': 'If there is no objection that Council members will be excused from today's meeting. Hearing no objection, Councilmember Solon is excused from today's meeting. Colleagues, is there any further business to come before the Council? Ellesmere Mosquito Police.'",
        "'speaker_3': 'I am so excited, council president, that we were able to surprise you. I do hope that you and your team really heard how much we appreciate you and look forward to continuing to work with you on the future.'",
        "'speaker_3': 'Thank you for having this marathon meeting and I just want to take a second to say thanks to VanMeter as well. I didn't get a chance to shout them out. Congratulations on their next chapter as well. With all of the work they've done on council for the last 13 years, it's been a really great honor to work'",
        "'speaker_3': 'with VanMeter as well, but wanted to just get that last thank you. And as council members, I just can't help myself. Council Member.'",
        "'speaker_1': 'Council.'",
        "'speaker_3': 'Members I again, thanks for the opportunity to surprise the council. President and president, congratulations again.'",
        "'speaker_0': 'Well, thank you so much. I did want to also, you know, it was publicly announced today that Dan Itr, our deputy director, is going to join mayors, the mayor's office as mayor elect Harrell's policy director. And we do want to wish him much luck and of course, express our deep and profound gratitude to him for his 13'",
        "'speaker_0': 'years of service to the city council in particular, and to council central staff. And so we again wish him much luck and we are deeply appreciative for everything that he is given to us. So colleagues, of course, I cannot adjourn a meeting of the city council that you guys been subjected to, my beautiful daughter.'",
        "'speaker_0': 'So I'm going to I'm going to.'",
        "'speaker_5': 'Have.'",
        "'speaker_0': 'Her come over here maybe for the last your last public appearance, except for now, she's being shy.'",
        "'speaker_1': 'Well, look, who wouldn't it say by here?'",
        "'speaker_0': 'Virtually adjourned. Thank you, colleagues. Your next meeting will be sometime in January. I want to thank you all for your your friendship and for all of your amazing work and look forward to seeing you all in New York.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_0': 'Share with many by Reserve Bank.'"
    ]
}