{
    "Right to Legal Counsel for Residential Renters Facing Eviction.": [
        "'speaker_1': 'A part of the Sustainability.'",
        "'speaker_0': 'And Interest Rates Committee agenda one comfortable 120007 relating to residential evictions, guaranteeing the right to legal counsel regardless of ability to pay for any residential renter. And Seattle responding to it unlawful detainer suit and adding a new section 22.20 6.1 95 to the shelter.'",
        "'speaker_0': 'Ms.. Code. The committee recommends the bill passes the Divided report with councilmembers Morales.'",
        "'speaker_5': 'And Lewis.'",
        "'speaker_0': 'Of favor and Councilmember Peterson.'",
        "'speaker_4': 'Opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. Consumer assignment. You are chair of the committee and are recognized in order to provide the committee's report.'",
        "'speaker_3': 'Thank you. Every eviction is an act of violence, an act of violence against the renters who are traumatized, displaced, suddenly forced into daily survival mode. Many evictions are a blow against children who are forced to move away from schools and friends and against the adults who are forced away from community and social support systems.'",
        "'speaker_3': 'Every eviction adds to our community's misery and suffering, and it accelerates racist gentrification. This bill would guarantee the right to counsel. That is a right to a lawyer, to any renter in Seattle facing eviction. In other words, if your landlord attempts to evict you, you have the right to a lawyer being with you, defending you in court'",
        "'speaker_3': ', just like people have the right to an attorney if they are accused of a crime. This bill commits the city of Seattle to contract for all the legal representation needed so that eviction defense attorneys can defend every renter without exception facing eviction.'",
        "'speaker_3': 'Who needs the help? Before the pandemic, about 1200 renters in Seattle faced eviction every year, even during the pandemic, with the moratorium in place. Landlords have filed more than 300 eviction cases with the court as they are exploiting loopholes in the moratorium.'",
        "'speaker_3': 'Many more tenants than can be officially measured on top of that are constantly evicted from their homes when landlords try to evict because tenants are understandably intimidated when they get an eviction notice because they know that the eviction system in Seattle is completely stacked against them and they just move out and undertake greater precariousness in housing in'",
        "'speaker_3': 'order to avoid the whole experience of going to court or not going to court and getting evicted. This is especially true for black community members who are given eviction notices at three times the rates for other tenants. Without this right to counsel legislation, we can expect a tsunami of elections once the city and state moratoriums expire as'",
        "'speaker_3': 'renters will still be struggling under the double blows of the recession and the global health crisis and will be burdened with debt. And this legislation will not be enough by itself. We will need a lot more. We know that eviction destroys communities, wrecks households, and even kills the 2018 report Losing Home.'",
        "'speaker_3': 'The Human Cost of Eviction in Seattle found that 87.5% nearly nine out of ten renters who are evicted end up homeless in their study of 2017 evictions. The authors of the report, the Seattle Women's Commission and the King County Bar Association, found that some tenants even died shortly after being evicted, according to the eviction lab at Princeton'",
        "'speaker_3': 'University. Despite the pandemic and the eviction moratoriums, landlords have filed 272,612 evictions since March last year in just 27 cities that the eviction lab has been tracking. Growing evidence, they say, shows that more and more evictions are not driven by so-called mom and pop landlords struggling to balance their personal checkbooks.'",
        "'speaker_3': 'Since the CDC eviction moratoriums took effect last September, evictions by corporate landlords have actually been steadily increasing. Research by the Private Equity Stakeholders Project, a research and advocacy organization, has tracked nearly 50,000 evictions by corporate landlords in select counties and six states since the beginning of September last year and found that corporate landlords are responsible for the'",
        "'speaker_3': 'majority and sometimes the overwhelming majority of evictions. Seattle is no exception to this. Major corporate landlords are the main actors in our city. The most evicting landlord in 2019 was Goodman Real Estate, a corporation with $2.5 billion. That is billion with a B worth of property holdings in the US and Canada.'",
        "'speaker_3': 'Other major victors include regional giant Epic Asset Management and National Landlord Corner Management Corp. The American Civil Liberties Union found that nationally, 90% of landlords are represented in eviction gold, while only 10% of tenants are. Can you imagine, as a struggling tenant facing eviction, perhaps because you just lost your low wage job?'",
        "'speaker_3': 'Going up against the likes of attorneys from Goodman real estate. Our right to counsel legislation will give these tenants at least a fighting chance in court when they have to go up against these greedy corporate landlords and their greedy lawyers and the impact on the right to counsel, as we have seen in cities around the country that'",
        "'speaker_3': 'have passed similar legislation, is absolutely astounding. With a lawyer, far fewer people are evicted. This is because unjust evictions are overturned in court, and it is because eviction defense attorneys can and do help connect people with social services when they are needed.'",
        "'speaker_3': 'The Housing Justice Project in Seattle, for example, works closely with Homebase, which administers rental assistance funds so that they can help people pay their back rent and then present that to a judge to prevent the eviction. Statistically, even for people who are ultimately evicted, having an attorney still improves the outcomes, with renters sites saddled with less crushing'",
        "'speaker_3': 'debts. But all of this is not the end of the story. It is also because when there is a universal right to work volunteers to have a trained attorney with them in court, that gives corporate landlords pause from issuing eviction notices in the first place.'",
        "'speaker_3': 'In New York, the rate of eviction filings dropped by a stunning 30% since their right to counsel legislation passed. Because landlords now know that they can no longer use the courts to bully renters who have no legal help.'",
        "'speaker_3': 'They are going to go up against a trained attorney. These are all the primary reasons to support the right to counsel because of the human impact of evictions on renters and the progressive outcome overall for our society by reducing housing instability and homelessness.'",
        "'speaker_3': 'Not to mention the racial component of this giving universal right to counsel is a Black Lives Matter issue. But even through the narrow lens of the city's finances, the right to counsel is sensible. The Housing Justice Project, for example, has estimated that guaranteeing the right to counsel will cost approximately $750,000 in a normal year.'",
        "'speaker_3': 'And by a normal year, I mean a year without an eviction moratorium. Compare that to the cost of the courts and the sheriff carrying out an eviction and the cost of homeless services because nine out of ten evicted people become homeless.'",
        "'speaker_3': 'It is orders of magnitude more expensive not to pass universal right to counsel. I appreciate the co-sponsorship of councilmembers Lewis and Morales, and I urge all councilmembers to support this legislation without watering it down with one loophole or another loophole.'",
        "'speaker_3': 'It is essential to defend the rights of renters in Seattle by offering universal right to counsel for all renters who need legal assistance. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Silence. Okay, so we are going to go ahead and consider several amendments. My suggestion is that we debate and vote on each amendment before we make comments on the legislation as a whole. If that's acceptable to folks, I'd like to go ahead and proceed in that manner.'",
        "'speaker_0': 'And then Councilor Salant as sponsor of the bill, you will have last the last word as is required under the council rules. You'll have the last word on the bill before we close out or in closing out debate.'",
        "'speaker_0': 'You'll have the last word on on the bill. So just let us sort of say that out front, as is customary. So let's go ahead and deal with the amendments if that's if that's okay with you councilors want.'",
        "'speaker_0': 'Okay. I'm getting ahead. Not so. I'm going to go ahead and go first. Let's go ahead and do them in order of the number of amendments listed on the agenda. So that means the First Amendment is Amendment One, which is being advanced by Council Member Herbold.'",
        "'speaker_0': 'So I'm going to go ahead and hand it over to Councilmember Herbold to make her motion for consideration and debate of Amendment One.'",
        "'speaker_4': 'Thank you. I move to amend Council Bill 12 007 as presented on Amendment one on the agenda.'",
        "'speaker_0': 'Okay. Is there a second and moved. And thank you so much, Councilor, whereas it's been moved and seconded to amend the bill is presented on Amendment one. Councilmember Herbold, you are recognized in order to address amendment.'",
        "'speaker_4': 'Thank you so much. So this amendment would specify that an attorney organization with that the the Department of constructions and inspections would contract with that. That organization should have experience providing legal representation to tenants. This amendment was suggested by an advocate who has deep experience working with tenants in the city of Seattle.'",
        "'speaker_4': 'In this individual's experience, they wrote that there are many legal aid organizations that might just provide advice about notices or on the other hand, might only represent tenants in some very narrow circumstances. This bill isn't a funding mechanism, but it is important, I think, that the Council include in our intention that this bill for future funding that'",
        "'speaker_4': 'would support this policy be made available only to those organizations willing to represent tenants in a courtroom in the broad circumstances that this this bill contemplates. Thank you.'",
        "'speaker_0': 'Thank you, councilmember rebels. Any comments or questions on Amendment one? Councilmember Salom, please.'",
        "'speaker_3': 'Thank you. Herbal This amendment provides clarifying language that is consistent with the intent of the legislation that I will be voting. Yes.'",
        "'speaker_0': 'Great. Thank you so much. Any other comments or questions on Amendment One? Hearing no additional comments on Amendment one. Will the clerk please call the role on the adoption of Amendment One?'",
        "'speaker_1': 'Mosquito I. Petersen. I saw one. Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Suarez. Yes. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. President Gonzalez. High nine, in favor and unopposed.'",
        "'speaker_0': 'Thank you. The motion carries, the amendment is adopted, and the amended bill is now before the council. Councilmember Herbold, I understand you are the sponsor of Amendment two, so I'm going to hand it back over to you to make that motion and to solicit a second and haptic.'",
        "'speaker_4': 'Thank you. I move to amend Council Bill 12 007 as presented on Amendment two on the agenda.'",
        "'speaker_0': 'Their second.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. For the second, it's been moved and seconded to amend the bill as presented on Amendment two. Councilmember Herbold, back to you to describe the amend.'",
        "'speaker_4': 'Thank you so much. This is an amendment regarding future reporting obligations. And as I said this morning in council briefings, meeting the amendment would require that the organization with whom the city contracts will provide reporting on numbers of cases for representation that occurs outside of the initial appearance or show cause hearing.'",
        "'speaker_4': 'Most cases, the vast majority of cases are resolved at the initial appearance or show cause hearing. In fact, the last year for which we have data in 2018, only 11 cases of a total of nearly 9000 cases actually went to trial.'",
        "'speaker_4': 'But we know that we had some really important and transformational statewide and local eviction law reforms. And it's quite possible, given that those reforms inherently give tenants and largely tenants who are subject to eviction for nonpayment of rent, get them out, give them a basis to to oppose their eviction in court for the first time.'",
        "'speaker_4': 'And so it's possible that there have been larger numbers of cases that are actually going to trial rather than being resolved in this initial show. Cause hearing in cases that go to trial are going to take more resources in order in order to continue the the funding of this really important right to counsel policy.'",
        "'speaker_4': 'And so this amendment would require that the providers providing the service include this information as report, as required by the contract, and inform the Council in the future about whether further legislative changes need to be made to address any issues that could be brought on by a future increase in the need for representation throughout the period of'",
        "'speaker_4': 'a longer trial. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Herbals, are there any additional comments on Amendment two? Seeing and hearing no additional comments on Amendment two. Will the clerk please call the roll on the adoption of Amendment two?'",
        "'speaker_1': 'Mesquita. I. Peterson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'So what?'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold Yes. Suarez Yes.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales Yes. President Gonzalez. High nine, in favor and unopposed.'",
        "'speaker_0': 'Thank you. The motion carries, the amendment is adopted, and the bill has now includes Amendment two as well. So I'm going to go ahead and move now to Amendment three, which is my amendment. Which is my amendment. I move to amend the Council Bill 1 to 0 007 as presented on Amendment three on the agenda.'",
        "'speaker_0': 'Is there a second? Second. Thank you so much. It's been moved and seconded to amend the bill as presented on Amendment three. I will, as sponsor of the amendment, address it and then we will open the floor for additional comments and discussion of the amendment.'",
        "'speaker_0': 'Colleagues, as I mentioned this morning during council briefing, I was interested in pursuing a amendment that accomplished two things one that made the bill legally defensible and a more workable bill that would actually bring to fruition the right to counsel to those tenants who need it the most.'",
        "'speaker_0': 'And secondarily, I have a strong interest in supporting this policy and ensuring access to legal aid for those tenants who who need it the most. And so my office pursued this particular amendment, which accomplishes a few simple things.'",
        "'speaker_0': 'So first of all, this bill adds a recital to acknowledge that the council's intent to minimize that the council has an intent to minimize as many barriers as possible to accessing counsel for those who need it. Second Amendment three establishes that any tenant residing in Seattle has the right to legal counsel free of charge if the tenant'",
        "'speaker_0': 'meets a simple indigency standard. This indigency standard is modeled on the same standard utilized in the Immigrant Legal Defense Fund, which was unanimously adopted by the City Council in 2006. The definition of indigency focuses on the inability to afford an attorney at any point during an unlawful detainer lawsuit.'",
        "'speaker_0': 'Third, this amendment allows the contracted legal service providers to establish the process and manner by which to verify indigency. This is a common practice that is similar to the steps taken by service providers in other circumstances, such as the self-certification process that was approved in the COVID 19 eviction defense bill last year.'",
        "'speaker_0': 'In that example, the tenant simply needs to sign a form at their appearance in eviction court. That could be as simple as saying, I cannot afford an attorney and then signing that form and being therefore immediately eligible for receiving free legal aid.'",
        "'speaker_0': 'So we are not talking about a process by which by which a tenant is going to have to present a mountain full of paperwork in order to prove that they're indigent. It is as simple as the process that we currently have in place for the Legal Defense Fund, which is a self attestation or certification that you indeed'",
        "'speaker_0': 'cannot pay for your own attorney in this unlawful detainer action. I believe this is very simple. I believe that most individuals who need the access to legal aid are going to be able to easily simply and in collaboration with legal service providers who have a strong interest in providing legal services to those individuals is going to be'",
        "'speaker_0': 'able to accomplish the council's underlying policy goals here of making sure that we have access to legal aid for those who need it the most. So again, I believe that this language is is going to minimize the risks of having this law survive a legal challenge, which, again, I believe is almost going to certainly happen while also'",
        "'speaker_0': 'providing access to a right to counsel to those that need it. This amendment, again, as a reminder, is modeled after the Immigrant Legal Defense Fund that the city council unanimously passed in 2016. In that case, we also included an indigent standard.'",
        "'speaker_0': 'And again, in the three years of existence, the deportation defense fund has helped hundreds of immigrants and refugees fighting deportation proceedings while have. No administrative burden or chilling effect on those seeking services as a result of the indigence standard and the self-certification process.'",
        "'speaker_0': 'In that context, again, this was unanimously supported by the City Council at the time in the Legal Defense Fund. So I would today ask for your support in voting in favor of Amendment three. All right. We have some comments here.'",
        "'speaker_0': 'So we're going to open up the floor. First up is Councilmember Herbold, followed by Councilmember Morales. Because my hurdle.'",
        "'speaker_4': 'You're not.'",
        "'speaker_0': 'Actually.'",
        "'speaker_5': 'Ready to.'",
        "'speaker_4': 'Go that win. All right. Well, thank you, Counsel President Gonzales, for bringing forward this amendment to make this bill stronger. This amendment is not an example of means testing. Legal services providers can simply ask renters to sign a statement that they are eligible for this service, and after doing so, they are immediately entitled to representation.'",
        "'speaker_4': 'There is no test for anyone to have to produce documents and wait for the test to be graded. It is not means testing. Means testing is a method for determining whether someone qualifies for financial assistance to obtain a service or good.'",
        "'speaker_4': 'And it looks at the means or monetary resources that that individual has available to them to pay for a particular service or good. Then it determines that the person's access to financial assistance is based on their ability to pay for it.'",
        "'speaker_4': 'Again, this amendment does not require means testing. This amendment will make the right for stronger, for eligible renters stronger to resist legal challenge from those who do not want anyone to have the right. Just one person receiving a free attorney when they have sufficient funds to pay for an attorney could bring the hard earned right to counsel'",
        "'speaker_4': 'law down. I do not want to take that risk. This amendment ensures that the greatest number and those most in need are eligible to receive assistance when facing eviction with the most minimal of requirements. I've seen data that means testing can be a barrier to services.'",
        "'speaker_4': 'I have not seen any data that a self attestation of poverty is a barrier to services. No one is caving to big landlords or creating loopholes to reduce the number of people who have access to the right to counsel that this policy serves.'",
        "'speaker_4': 'Nor are we watering anything down. We are trying to pass a bill to ensure that tenants can remain housed when they are unaware of their rights or don't have the resources to stand up for their rights. And that's why it's so important that we ensure that this legislation can stand up to legal challenges.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. Councilmember Morales is next and then Councilmember Salaam.'",
        "'speaker_4': 'Thank you. I don't have much more to add than what Councilmember Herbert just said. It is basically the case that right now legal service providers already ask a simple question about one's.'",
        "'speaker_3': 'Ability to pay.'",
        "'speaker_4': 'And this amendment doesn't add requirements for detailed income information. It is simply codifying what is actually happening in practice and leaves to the providers decisions about how to set parameters for how to determine that. So I don't think that it creates any additional barrier.'",
        "'speaker_4': 'It just clarify some of the things that are already happening, and I intend to.'",
        "'speaker_2': 'Support this amendment. Thank you.'",
        "'speaker_0': 'Thank you. Customer. Customers.'",
        "'speaker_3': 'I opposed this amendment to insert means testing or any other kind of requirement for people to have to qualify for the right to counsel. I believe the right to counsel should be universally available for those who need it.'",
        "'speaker_3': 'Just because it has been a standard used in a previous legislation is not a good enough reason to reproduce it in this legislation. Council members may not want to call it means testing. You can call it happy joy testing if you want, but it is still means testing.'",
        "'speaker_3': 'In reality, it is asking people to go through us as a, you know, some kind of hoop jump through some kind of hoop before they qualify. People should be able to have universal rights. I also do not agree with the idea that this amendment makes the legislation, quote unquote, legally defensible.'",
        "'speaker_3': 'Eviction. Defense attorneys themselves have made it very clear that such amendments are not needed to make this legislation legally defensible. At the end of the day, what makes any law passed strong progressive law passed strong against legal challenges by corporations, by the wealthy, by corporate landlords, is a fighting united movement of working people, renters and everyone who'",
        "'speaker_3': 'wants to have and live in an affordable and just city. The right to have a lawyer to prevent eviction should be available for every renter facing eviction. Just like all the best public services. There is no means test to use the public roads.'",
        "'speaker_3': 'They are available for everyone. There is no means test for public education or for the fire department. There is no means test to use the lights on the street lights federally. Social Security is available to everyone, rich and poor.'",
        "'speaker_3': 'And because of that, it has endured for 86 years, almost a century, despite repeated attempts to dismantle it by the ruling class. Both Republican and Democratic administrations. And because these crucial public services are not means tested, nobody is shamed or humiliated for using them across the spectrum of social services.'",
        "'speaker_3': 'Any means testing, even the least invasive aspects or types, has the effect of preventing some of the most vulnerable people from using the service. Let's be clear. The reason this means testing amendments from city council Democrats is not as bad or invasive or onerous as it could have been is because the renters rights and socialist activist movement'",
        "'speaker_3': 'who organized to win this legislation said loudly that we oppose means testing and we waste our position in a unified manner which made our collective voice so powerful. Order to say thank you to Seattle Tenants Union Socialist Alternative, the ACLU, The Housing Justice Project, Real Change, Transit Riders Union and many others for speaking out against any kind'",
        "'speaker_3': 'of means testing. We saw that organizing in public comment today, which has made it very clear the harm that means testing can do and is exposed to the light of day attempts by Democrats to bring far worse amendments.'",
        "'speaker_3': 'However, even when the process of applying is not onerous, people are hesitant about using any kind of means tested services because they feel humiliated or they're not sure they are eligible, or they have missed assumptions about how difficult the application will be.'",
        "'speaker_3': 'The Reality of Eviction. Gordon in town in King County, as 13 organizations have pointed out in their letter, shows that the eviction process in Washington makes the use of any kind of test unworkable. Unlike criminal proceedings, this is designed to be very quick and occur in as little as three weeks from the time it misses a rental'",
        "'speaker_3': 'payment. Unlike a criminal proceeding, which is much longer and involves multiple court dates, most have only one court date for that one court date. We should not, as a legislature, be putting any barriers, however less onerous. However, less invasive means testing has always been used politically by pro-business politicians, both Republican and Democrat, for over 40 years to'",
        "'speaker_3': 'divide and conquer and make it easy to dismantle the programs, or at least gut them in the future. One reason why Democratic former President Bill Clinton was able to destroy wealth vote in 1996 was because when it was set up in the first place, decades before then, it was set up with means testing in the first place'",
        "'speaker_3': '. Throughout the existence of these means tested programs, there have been wildly false rumors about people abusing them. These complete fabrications were used by Clinton, along with legislators of both political parties to guard the welfare programs. The most important reason to reject this means testing amendment is because of the missed opportunity to set a better precedent that has'",
        "'speaker_3': 'been set in the past. Council President Gonzalez referred to other means tested services in Seattle and the state. And we've seen this before, but we've heard this before. But the city council is populated by self-described progressive Democrats. There is one socialist rather than Seattle, watering down local renter protections to match the concessions that are being made elsewhere'",
        "'speaker_3': 'or were made in the past. My question is why aren't progressive Democrats supporting the legislation without any watering down, without any means testing? However, less invasive it may be, and then use that precedent to demand that legislators in Olympia, for example, follow through and pass a strong law.'",
        "'speaker_3': 'Finally, I want to also emphasize that all these allusions to legal concerns are not acceptable, because, as I said and I wanted to reiterate, renters rights attorneys themselves have roundly rejected it. Renters rights attorneys want a bill that stands up in court.'",
        "'speaker_3': 'They are not in the business of wanting the legislature, like the city council, to pass laws that won't stand up in court. They absolutely want a bill to stand up in court. It is not in their interest to create any legal vulnerabilities and they are strongly supported this legislation without any watering down the idea that means testing'",
        "'speaker_3': 'is necessary is an idea that is only ever foisted on the most vulnerable people in our society. Over the past couple of weeks, we have heard from community members many examples of programs to give handouts to the rich and powerful that have no means testing whatsoever.'",
        "'speaker_3': 'Whether onerous or not, there is none. There was no means test required for the Seattle Mariners to prove they needed financial support for their stadium. There was no means test for landlords to get compensation from the city through other legislation.'",
        "'speaker_3': 'There was no means test when the city paid tens of millions to the wealthy waterfront businesses to compensate the interruption of their sidewalk access during the seawall construction. There was no means test when the city invested almost half a billion rebuilding the streets around Mercer to accommodate Amazon's campus.'",
        "'speaker_3': 'There was no means testing when Washington State gave Boeing executives and major shareholders a $9 billion corporate tax handout in 2013. There is no means test for elected officials in Seattle to pay themselves exorbitant six six digit salaries.'",
        "'speaker_3': 'Means testing is not needed in this legislation because people in election code are already at the absolute end of their resources. If they had any money for attorneys. They would have paid their rent in the first place and not got.'",
        "'speaker_3': 'Eviction notices. Means testing is not legally necessary. Means testing can do real harm by creating obstacles for people in desperate need for help. And it opens the door to further weakening of the legislation in the future. And we have the opportunity to set a strong precedent against this today.'",
        "'speaker_3': 'So I urge council members to vote no on this amendment.'",
        "'speaker_0': 'Thank you, Councilmember. So once again. Next up is Councilmember Suarez and then Councilmember Tina Awards.'",
        "'speaker_4': 'Thank you very much. I want to, first of all, thank Councilman Harold and President Gonzalez for their comments. You've been hearing me say some of this since March 4th. So this ordinance, as originally written without eligibility criteria, is arguably a gift of public funds and therefore violates state law.'",
        "'speaker_4': 'So in order to remedy this legal flaw and this vulnerability, because we already know that preventing homelessness is a fundamental governmental purpose, which we all agree on today. We have eligibility criteria where someone can self attest that they are in fact indeed indigent, indigent, indigenous.'",
        "'speaker_4': 'So what we do is we looked at other programs where we have a right to counsel in the civil arena, not the criminal arena. And we looked at the Northwest Justice Project and the Tenant Law Center and Council President as she shared proposal, which we all voted on in 2016, the Immigrant Legal Defense Fund, which was passed'",
        "'speaker_4': 'the simple. Eligibility requirement. I'm kind of tired of going back and forth about means testing and eligibility, but I will state this just for the record. Everything customers want said about means testing is true. But that's not what we have in front of us.'",
        "'speaker_4': 'Means testing is a requirement that applicants for any type of government public assistance submit to an investigation of their funds and resources that they actually have to provide documentation to show that they're indigent. The means test originated as a method of limiting.'",
        "'speaker_5': 'Payment of public.'",
        "'speaker_4': 'Assistance to those truly in need in order to reduce the cost of such programs to taxpayers. Means testing was used as to limit payment of public assistance to those truly in need. More often than not, it is weaponized.'",
        "'speaker_4': 'As a former public defender and as a former person at Evergreen Legal Services that represented people in court for unlawful detainer, that is what we looked at. We did not have means testing. We made sure that you had legal counsel for unlawful detainer and for the issues that were in front of us today, the eligibility criteria.'",
        "'speaker_4': 'Thank you. Council president which she brought forward talks about are actually is very succinct and it addresses the issue of what anyone may qualify for by simply saying that they're indigent. They choose that they want to participate. And by choosing that they want to participate, they show that they're in fact.'",
        "'speaker_4': 'And then in saying that poor. So the eligibility criteria allows and permits government to provide a benefit that promotes the public good and determines that such criteria, such as indigency, is why we would move forward to make sure and I want to make another point that I agree with, Councilmember Rubio had raised my main concern about allowing'",
        "'speaker_4': 'everybody, anybody like the Oprah show to have a lawyer all the time, every time. Is that then those truly in need that don't have money, that are truly indigent are not going to get legal counsel because there's only so much money.'",
        "'speaker_4': 'And the last three years we have put in the budget and we have all passed which council like has always voted no on, I'd say almost to the tune of $1,000,000 in the last three years. Please correct me if I'm wrong.'",
        "'speaker_4': 'For people to have legal counsel during eviction, when we have put forward money in the budget to ensure that there's money there for people who are being wrongfully evicted, have legal counsel. So what I'm trying to say is that we are moving forward on an important piece of legislation that is going to be permanent in which people'",
        "'speaker_4': 'must just say that they are indeed in need of legal assistance and they can choose to participate in the program. You know, it's just kind of disheartening that sometimes when you just try to do good things, I don't think I'm in the back pocket of slumlords or big corporations.'",
        "'speaker_4': 'I still don't know what a progressive Democrat is to some degree. I'm not against the homelessness. I'm certainly not against the poor. As a former public defender as well and as a attorney for 35 years, I can say this is pretty straightforward.'",
        "'speaker_4': 'And what we're just trying to do a good thing.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_2': 'I'll leave it at that.'",
        "'speaker_0': 'Thank you. Consumer Awareness Council Member Mosquito. Thank you very much. Council President I just want to thank councilmembers a lot for bringing this forward. This is the first time I've had a chance to sort of talk about this legislation.'",
        "'speaker_0': 'Was looking forward to voting on it a few weeks ago, and I'm glad that this is moving forward today. So thank you for bringing this forward. I know cities across the country are also looking to do similar things, so I appreciate the work that's gone into this legislation.'",
        "'speaker_0': 'I think the outrage that has been expressed about means testing is absolutely right. I think the ire that we all feel that I've expressed before when we talked about this legislation about means testing and income testing is 100% accurate.'",
        "'speaker_0': 'And I have spent a long time fighting against means testing in the state legislature, especially when I worked to implement Apple Health, especially Apple health for kids about a dozen years ago. At that point means testing, as Councilmember Morales just said, was being weaponized to try to prevent immigrant kiddos from being added to the rolls for eligibility'",
        "'speaker_0': 'for Apple health at the time. And that is why I have and continue to fight against means testing. I think that it's important to me to have understood the discussion today and that the briefing from the Council President on this amendment in the context of the Immigrant Legal Defense Fund ordinance that it was based off of.'",
        "'speaker_0': 'As I understand, this amendment in front of us, the legal organizational well except self attestation simply saying an individual can simply say they don't have the means to form an attorney. I know a lot of folks who are struggling right now, working month to month, many people out of work or, you know, still trying to pay their'",
        "'speaker_0': 'own rent and childcare and the concept of having to pay an attorney. On top of that, a lot of people are going to say that they can't afford an attorney. So basically someone self-testing that they can't afford an attorney meets the criteria here that the organization, the Legal Assistance Organization, is not going to ask for income verification'",
        "'speaker_0': '. I'm not going to look at any monetary resources. And as I think Councilmember Herbold said, not comply with a test of any kind. So I think that this is a big distinction from the types of means testing that I have fought in the past.'",
        "'speaker_0': 'Self attestation is what we've actually fought for and many cases as an alternative to means testing so that people can get the services that they're eligible for. And in this case and this case that we determined a right to appreciate that there is clarification that there's no documentation required at the time of application or later.'",
        "'speaker_0': 'And as I checked in with a handful of legal assistance folks across the city who are currently helping and have previously helped, they noted that this is really important because it's been a long standing approval process by including federal entities like the Legal Services Corporation to avoid undermining attorney client privilege and that relationship.'",
        "'speaker_4': 'To.'",
        "'speaker_0': 'Make sure that they just accept from the client at the point of service that they are not able to pay for an attorney, that any additional type of barrier would be a barrier to the intake and could not be a functional process.'",
        "'speaker_0': 'So they are very much opposed to means testing but have been working under this existing model of self attestation and believe that it is the you know, that this is not an additional barrier. I understand that the standard is not a test now or an application later, and that's a very important clarification that I wanted to put'",
        "'speaker_0': 'out there because just like I think means testing can have a chilling effect on whether or not someone applies for services. I also don't want there to be any confusion out there when this bill passes the knock on way.'",
        "'speaker_0': 'When this bill passes, I don't want there to be any confusion out there about folks coming and signing up. There is no test. At the very least, it sounds like there's going to be a piece of paper that sign, and we want to make sure folks get access to those services.'",
        "'speaker_0': 'And I don't want there to be a chilling effect from any debate we can debate. But ultimately, this legislation is going to pass and I look forward to supporting the final legislation. And we'll be supporting this amendment to the.'",
        "'speaker_0': 'And you can smear a mosquito. Are there any other comments on Amendment three, Councilor Lewis.'",
        "'speaker_2': 'Thank you. Madam President, I couldn't figure out how to do the little digital raise hand today for some reason, so I did it the old fashioned way. So thank you for recognizing to me here for a moment. I will be supporting your amendment today.'",
        "'speaker_2': 'My colleagues have already made a lot of the comments that I would have, but I do want to emphasize a few more that I think are instructive and important. I do want to add that another distinction between the self attestation and means testing is that this will not incur procedural costs since we are not doing financial screenings'",
        "'speaker_2': 'and investigations into people's financial background to do a self attestation, which I think is a critical thing to note, that means testing. And one of the big arguments, in addition to what we've already discussed here today on the the the impact it can have on people seeking services, the deterrence effect you can have on people seeking services'",
        "'speaker_2': 'it also incurred would have incurred real cost to the city in buying the software for half million dollars, hiring an FTE at a cost of over $100,000. Our model of self attestation does not do that and also can kick in procedurally at the point when people will need this legal assistance and will not require a delay or'",
        "'speaker_2': 'a rescheduling of these Tenet related eviction proceedings. So it doesn't come with those logistical and financial costs. That means testing would have come with in addition to all the other horrible things about means testing that we have already discussed extensively in this session.'",
        "'speaker_2': 'I do also just want to acknowledge that my appreciation for the Council, President Gonzales, and bringing forward a proposal that is structured to to provide the very minimum of potential hurdle while addressing the very real substantive impacts. I don't want to violate the fight fight club rules of executive session, but I will just say all of us'",
        "'speaker_2': 'were in that executive session. You know, I think that it is important that we center the guidance and advice of the team that successfully defeated vigorous legal actions against just cause eviction, against first in time protections, against the various eviction moratoriums this council has enacted.'",
        "'speaker_2': 'And I believe that it was. I appreciate Council President's diligence in working with that team, working with us on the council to craft something that will still provide this vital service to everyone who will need it, while at the same time strengthening this law against the challenges that we know will come from deep pocketed and very well-resourced'",
        "'speaker_2': 'landlord interests that will sue to try to get rid of it. So with that, Madam President, I don't have any additional comments, and I appreciate your leadership in bringing this forward as well as the comments of my colleagues similarly speaking to this.'",
        "'speaker_0': 'Thank you, Councilor Lewis. Are there any additional comments on Amendment three? Okay. Councilmember Salant.'",
        "'speaker_3': 'Thank you. I just wanted to specifically address the question of self attestation. I do not agree that self attestation will not be a barrier because that's not what the data indicates at all. For example, according to Seattle City Light, the official enrollment number for the utility discount program, which is for low income people who cannot afford to'",
        "'speaker_3': 'pay their full utility bills as of the enrollment numbers as of the end of February is 42,094 and customers and they are currently estimating the department is currently estimating the number of eligible households that 90,000. So that means that Seattle's utility discount program has enrolled less than 50% of the estimated eligible households.'",
        "'speaker_3': 'It used to be even worse than that. It used to be under 20% when I first took office and became the chair of the Energy Committee, and we fought to improve it. And the city now, although endorse people who live in Seattle Housing Authority and other low income housing, this was part of our effort from our movement'",
        "'speaker_3': 'to make it an opt out and rather an opt in program. But that was not enough. Also, now the application process has been made simpler, which, of course, I support any, you know, making any obstacles simpler. But now there's a simple self-certification so that people can self-certify their income.'",
        "'speaker_3': 'But still, the enrollment remains at less than 50% years later. And there are many other examples. But I chose this one because it is close to ours. You know, it's right here in the city of Seattle. And so when the evidence does not show that the station will not be a barrier, I don't know how councilmembers can'",
        "'speaker_3': 'claim that it won't be a barrier because it will. Thank you.'",
        "'speaker_0': 'Hey, are there any additional comments or questions on Amendment three otherwise? Because I'm the sponsor, I get the last word on it. So just last call on Amendment three. Okay. I'm going to make some closing remarks here. I do want to thank you all for the conversation and the debate around Amendment three and your consideration of adopting'",
        "'speaker_0': 'Amendment three. There's a few things I want to clarify in response to some of Councilmember Silence comments on Amendment three that I do think are are not entirely accurate. One, I do not believe that lawyers representing tenants are going to humiliate tenants as a result of the passage of Amendment three.'",
        "'speaker_0': 'There were some comments made that somehow a sales attestation was going to result in humiliation. But let's remember that the people who are asking the questions about eligibility and about accessing legal services are the very the very people we're relying to represent those individuals.'",
        "'speaker_0': 'And I believe that they are going to put forward, consistent with their current processes, something that is compassionate, that is not embarrassing, and that will fulfill their mission of making sure that as many tenants as possible have access to free legal services when needed during eviction proceedings.'",
        "'speaker_0': 'Second, there has been a there has been a creation of comparisons between access to water, light and roadways, to legal aid services that pay for a lawyer. And I believe this is a false equivalency and should be rejected for that reason.'",
        "'speaker_0': 'Third, this is not a means test. We have a constitutional obligation to not engage in the gift of public funds. This applies to every single action and determination and decision we make as a city council. That obligation flows again from the Washington State Constitution.'",
        "'speaker_0': 'I believe that Amendment three focuses our limited resources on those who most need access to free legal services and eviction proceedings. And I believe that even with the inclusion of Amendment three, those individuals who need representation for free in eviction proceedings will in fact be able to receive those services.'",
        "'speaker_0': 'Fourth, there's been a lot of remarks by Councilmember Salant about this setting a precedent that would not otherwise be set if we pass the base bill without Amendment three. However, only an amendment to the Washington to the Washington states Constitution would allow for the state legislature to avoid the realities of the duties related to the gift of'",
        "'speaker_0': 'public funds. In other words, this obligation related to public to avoiding the gift of public funds applies equally to the Washington state legislature, as it does to us. There is no such effort at the state to amend the Constitution to allow for a different standard related to how we allocate and appropriate taxpayer dollars at the local, regional'",
        "'speaker_0': 'or state effort. That is exactly why Senate Bill 5160, which is specifically designed to address the eviction cliff that we are all facing, includes an emergency requirement to create a statewide right to counsel. And lastly, fifth, there has been an analogy created between the indigency standard that we're about to consider adopting an Amendment three to the provisions'",
        "'speaker_0': 'provided for in the utility discount program, a simple Google of utility discount program. Seattle request enrollment brings up the enrollment form that an individual would have to fill out in order to determine whether or not they're eligible. Unlike the UDP program, my amendment does not, for example, include the disclosure of what is the expected or estimated monthly'",
        "'speaker_0': 'income for your household before taxes. In fact, if you look at the UDP eligibility enrollment form, there is a question that requires disclosure of the expected or estimated monthly income for your household before taxes. That requirement is not included in Amendment three, only a self attestation that you cannot afford.'",
        "'speaker_0': 'An attorney will be asked in order to determine legal eligibility under this particular program. So, again, I think that there is there is not a clean comparison between the UDP. The UDP certainly requires much more than a self-certification and attestation of not being able to afford, for example, in that case, paying your bill.'",
        "'speaker_0': 'So I will close out debate there and appreciate again y'all's consideration of adopting Amendment three and am excited about voting on this bill to finally, once and for all, create a right to counsel for tenants in the city of Seattle and look forward to doing that, doing that very soon here.'",
        "'speaker_0': 'So without. Further ado, while the piece called a role on the adoption of Amendment three.'",
        "'speaker_1': 'Macheda I Pietersen.'",
        "'speaker_2': 'II.'",
        "'speaker_1': 'So what?'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'HERBOLD. Yes. Suarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales Yes. President Gonzalez. I. Eight in favor one opposed.'",
        "'speaker_0': 'The motion carries, the amendment is adopted, and the amended bill is now before the council. Councilmember Peterson, I'm going to hand it over to you to make your motion for, I believe, it's Amendment four.'",
        "'speaker_2': 'Thank you. Council President I move to amend Council Bill 1 to 0 007 as presented as Amendment four on today's agenda.'",
        "'speaker_0': 'Saddam is there. Okay. There's been a it's been moved and seconded. Thank you, Councilmember Juarez. It's been seconded to amend. The bill is presented on Amendment four. Councilmember Peters, I'm going to hand it back over to you to walk us through your remit.'",
        "'speaker_2': 'Thank you. Council President. I'll be brief. This amendment number four on today's agenda, as I mentioned in council briefing, would advise one of the recitals in the bill to clarify that the executive department should conduct an open request for proposals process for awarding these tax dollars rather than making a direct award to a single attorney organization without'",
        "'speaker_2': 'an open process. This amendment will provide a grace period of a year and a half to continue with the existing contract and the request for proposals. Process would occur and that comports with best practices in awarding ongoing contracts to provide additional opportunities to attorney organizations, which could include the existing one as well as others that would like'",
        "'speaker_2': 'consideration for providing these important legal services. Thank you.'",
        "'speaker_0': 'Thank you so much, Casmir Peterson. Any comments or questions on Amendment four? Councilmember Mosqueda, please. Thank you very much. Thank you. Councilmember Peterson. I always try to make sure that no one is surprised by my votes. And so I want to give a chance to let other folks know.'",
        "'speaker_0': 'I did have a chance to check in on Cosmo Peterson. And I apologize that I didn't ask some of the questions during morning briefing this morning. I am not in favor of this amendment simply because I think it might be more in the weeds than necessary for us.'",
        "'speaker_0': 'See, I think that while it's advisory, they certainly can take it under advisement, but it's not directing them. I feel like it is not necessary, given what I understand is that they go through a process for their hour of peace on a fairly regular basis.'",
        "'speaker_0': 'And I also think that there's a level of urgency around the relation, the trust relation that hopefully a contracting entity would have with referral entities or with folks who work with those who might need services. So I appreciate where you're coming from with this, because I do think it's important for those court contracts to go out.'",
        "'speaker_0': 'But I understand that CCI already has something similar in the works, and I'm going to be voting no on this today. But I appreciate the intent from where you came from. It seems they were silent.'",
        "'speaker_3': 'Thank you. I will be voting no on this amendment. As was explained, it is just an amendment to whereas clause does not change the substance of the legislation. However, I am voting no because it is overly prescriptive of how the department, the Department of Construction Inspections contracts out these services and does not reflect the reality of eviction'",
        "'speaker_3': '. In the bill that my office has proposed, the base bill, it says that the Seattle Department of Construction Inspection, or as DCI, which is the city department responsible for enforcing renters rights, is responsible for contracting with an organization to defend renters facing eviction.'",
        "'speaker_3': 'Our bill then gives parameters for what makes an organization a good choice to provide these services. We want attorneys with experience defending renters in court against eviction. We want an organization that works out of the King County Courthouse so that renters in eviction court can be met by an attorney when they show up.'",
        "'speaker_3': 'The reality is there is the the the the Housing Justice Project is the only organization like that right now in Seattle. And as they will themselves tell you, there aren't many private firms or any at all, perhaps, and very few around the country that provide this kind of service, which is defending renters against eviction.'",
        "'speaker_3': 'The Housing Justice Project attorneys are dedicated, and they do their best they can to support renters. That is why the various laws we propose states that as DCA should continue contracting with OJP unless another organization becomes better qualified.'",
        "'speaker_3': 'The legislation currently includes that language unless another organization becomes better qualified. We recognize that we do not know who will be defending Rangers in ten years. 20 years, maybe it will be. Maybe it will be some organization that doesn't exist.'",
        "'speaker_3': 'Right now, the department is empowered by the legislation to make that decision. We do not require that the department contractors be, but we do acknowledge the role that they are playing right now. Whether as ECI uses an RFP or an IQ are few or renews existing contracts.'",
        "'speaker_3': 'None of this needs to be prescribed in the legislation. I do want to stress again that because this amendment changes only awareness clause, it does not change any functional part of the legislation. However, I do think it's unnecessary and overly.'",
        "'speaker_2': 'Prescriptive, so I would be, you know.'",
        "'speaker_0': 'Thank you. Councilmember Herbold.'",
        "'speaker_4': 'You know, so I think the language in the existing recital about a future organization potentially becoming better qualified, that that determination could be made by an RFP. I don't know what other way a department would have to make that determination if it was not for an open, competitive process to determine who is most qualified.'",
        "'speaker_4': 'Given that this is only a recital, it's only providing the council's policy preference. I mean, given that it's important to Councilmember Peterson and given that, I would hope that with this amendment, we could get his support for for the bill.'",
        "'speaker_4': 'And I think that's important that the council speak with unanimity when there is unanimity and when there's disagreement about small recitals. I would say that let's let's let's not focus on where our differences are. Let's try to focus on where, where, where we have agreement.'",
        "'speaker_4': 'And I for all those reasons, I would definitely support the recital as proposed. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Herbold, any other comments on Amendment four? Okay. I'm going to hand it back to Councilmember Peterson in a minute. But I do want to signal that I intend to support this amendment as well. For many of the reasons stated by Councilmember Herbold, I don't think it creates a different rubric.'",
        "'speaker_0': 'It's a recital. It's not part of the law. I appreciate the intent with which it's brought forward, and I intend to support it for that reason. So. Peterson Anything else to add?'",
        "'speaker_2': 'No, thank you. I appreciate the ability to bring this forward and further down the road. Robust discussion.'",
        "'speaker_0': 'Thank you so much. All right. We're closing out debates now that the sponsor of the amendment has had the last word. So will the clerk please call the roll on the adoption of Amendment four MACHEDA?'",
        "'speaker_1': 'No. Paterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'HERBOLD Yes.'",
        "'speaker_1': 'SUAREZ Yep.'",
        "'speaker_2': 'LEWIS Yes.'",
        "'speaker_1': 'Morales No. President Gonzalez, I. Six in favor, three opposed.'",
        "'speaker_0': 'Thank you so much. The motion carries, the amendment is adopted and the amended bill is before the council. Okay, folks, that exhausts our amendments as we know them. And now we have a bill is in front of us and is amended again as a result.'",
        "'speaker_0': 'We'll have the last word on the bill as the prime sponsor of the bill. But I am asking for folks who might want to speak on the bill now. PETERSON Thank you.'",
        "'speaker_2': 'Thank you. Council President. I want to I want to thank the council president for her leadership on this, to help us to give us more time and to her substantive amendment that passed today to enact laws strong enough to survive scrutiny so that we can actually help our most vulnerable neighbors.'",
        "'speaker_2': 'Policymakers sometimes need the time to think through the various ramifications. And because we took the time in this case, we were able to consider and approve sensible amendments to make this legislation better. So I am able to update my vote to a yes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. Councilmember Morales.'",
        "'speaker_4': 'Oh, thank you. Sorry. Technology. Thanks, colleagues. I just want to reiterate, I'm proud to be a co-sponsor of this legislation to bring all tenants representation and eviction cases and really appreciate today's discussion. It's true that any renter can face eviction and a tenant should know that they have support during one of the hardest times in their life'",
        "'speaker_4': '. And that support shouldn't be contingent on a public health emergency or any other limitations. We know that prior to the pandemic, tenants were already facing tough odds in eviction court if they didn't have legal representation. And as eviction moratorium are lifted across the region and the public emergency is in our rearview mirror, we know that many of'",
        "'speaker_4': 'our neighbors will be in tough situations again. So at the moment, those lucky enough to know about programs like the Housing Justice Project or the Tenant Law Center know that legal representation can be the difference between remaining housed and creating a plan to have to live in your car.'",
        "'speaker_4': 'And folks shouldn't have to feel lucky to access limited, free legal representation. So as I said before, the landlord tenant relationship is unbalanced and the right to counsel goes a long way toward providing tenants with some protection and putting them on equal footing with landlords.'",
        "'speaker_4': 'And I'm proud to sponsor this legislation. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Morales. Are there any other comments? Councilman Moschino, please. Thank you very much. Thank you. Councilmember Peterson, again for bringing forward your amendment. I am very happy to hear your comments as well. And along with what Councilmember Herbold said, always do want to strive for where we can highlight the unanimous unanimity and the collaborative work'",
        "'speaker_0': 'on council. And I am very excited to be able to support this legislation today, including with the amendments that were passed today. I think that it puts us on more solid legal ground. I think that there's a tremendous amount to celebrate as Seattle, again, is going to be looked at as a national leader in this issue.'",
        "'speaker_0': 'I was trying to look up the statistic just to remind myself, but on this morning's news, I believe it's on Democracy Now! I heard that around 20% of renters are still struggling to be able to pay rent. And the cliff for when those eviction moratoriums go away is very real and threatening.'",
        "'speaker_0': 'We are working very hard to make sure that renters have dollars in hand. And I want to reiterate rental assistance bill that we're considering next week is also a small landlord assistance bill. Right, because it passes through and it's part of that support network that goes to our smallest landlords who are also being impacted by the consequences'",
        "'speaker_0': 'of COVID. So I see it as a both and conversation. Today's bill is truly something to be celebrated and for us to continue to reiterate to people that if you are facing eviction, you now have a right to counsel.'",
        "'speaker_0': 'And we can say that with incredible pride in the city of Seattle. Thank you all for all of your amendments that you brought forward today to make this legislation stronger. And thanks to customers a lot, and Morales and Lewis, who are the original co-sponsors as well, this legislation.'",
        "'speaker_0': 'I am looking forward to passing it and to showing that unanimity unanimously across council for our united support. And to do that not just for renters who are facing eviction, but truly to provide a more stable local economy as we recover.'",
        "'speaker_0': 'We cannot create a more equitable or stable economy if people continue to fall into homelessness. And this is this is quite literally at the foundation, a economic stimulus for our local economy, as well as a humanitarian piece of legislation to make sure that people have access to housing and prevent them from falling into homelessness.'",
        "'speaker_0': 'So very excited to support this and thank you all for your work on it. Coulson humbled.'",
        "'speaker_4': 'I just went to ground. I'll say that we're making today and some quick facts from the losing home report that was commissioned out of my office in collaboration with the Seattle Women's Commission, the Northwest Justice Project, and Washington can.'",
        "'speaker_4': 'And some of the findings include the fact that nearly 52% of tenants in eviction filings were people of color of 31.2% were black tenants. And this is an eviction rate of 4.5 times what would be expected based on their demographics.'",
        "'speaker_4': 'In Seattle, women were more likely to be evicted over small amounts of money of single tenant households where a tenant owed $100 or less. 81% of those being evicted were women. Tenants faced steep financial costs resulting from an eviction.'",
        "'speaker_4': 'The median court judgment was over $3,000, including rent owed non rent charges and legal costs. And nearly 86% of eviction filings were for nonpayment of rent. And of these, 52% were for one month or less in rent. Tenants were required to pay attorney's fees 91% of cases, with a median charge of about $416.'",
        "'speaker_4': 'And court costs 92% of cases with a medium charge, median charge of about $360. So, you know, this is this is really those stats are really focused, I think, on not just the basis for why we made changes to the eviction law, both in state law and in in our own local law, in eviction cases that are'",
        "'speaker_4': 'related to nonpayment of rent. Now, tenants have more of a right to make an argument about the conditions that lead to nonpayment of rent cases. But in order to make these arguments to address these these really heartbreaking findings from the losing home report, tenants need to have eviction prevention, legal advice from trained attorneys in order to make'",
        "'speaker_4': 'make the arguments that that that that for the for the for the application of the new rights that they have since since 2019 changes in the state legislature and in city law as well. So again, just really want to bring it back to the inequities that we see in our in our eviction court system.'",
        "'speaker_4': 'And, you know, we can't just always work on improving the the the laws and the rights, but we have to also address people's ability to stand up for them. And I want to thank Councilmember Sawant and all of the tenant advocacy groups who have made that loud that that call loud and clear.'",
        "'speaker_0': 'Thank you. Councilmember Herbold, are there any other comments on the bill as amended elsewhere in the. Lewis, please.'",
        "'speaker_2': 'Thank you, Madam President. I will just make a couple of additional remarks to build on what my colleagues have already said. And for me, a big thing that was instructive early on to sign on as a co-sponsor to this critical legislation was the statistic out of New York, which has a robust right to counsel law and has'",
        "'speaker_2': 'for some time that 86% of the people. Who were represented in an eviction proceeding, avoided an eviction, which suggests to me in the way that our eviction system is set up and the law around evictions and the courts and how these hearings are conducted and the traditional expectation of who does and does not have representation in those'",
        "'speaker_2': 'proceedings has led to thousands, hundreds of thousands nationally of illegal evictions. That when you have counsel in the courtroom and an advocate that can stand with you to address the merits of the case that your landlord is bringing.'",
        "'speaker_2': 'Tenants overwhelmingly have been able to stand up and hopefully this will have a deterrent effect as that countervailing power in the courtroom for tenants becomes well known that unmeritorious evictions will no longer be tolerated in Seattle and King County.'",
        "'speaker_2': 'And this legislation could end up having a really profound impact and certainly has in other parts of the country. And I really look forward to the impact that we're going to see in our neighbors who are tenants being able to live with a sense of security in reducing the number of our neighbors who fall into a state'",
        "'speaker_2': 'of homelessness and end up living in encampments and in vehicles. And I really look forward to the next phase here in making sure we have sufficient appropriation to sustain and build on this right going forward in a city that is majority renter and make sure that this right is vigorously well enforced.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilor Lewis. Any other comments on the bill? Key opens first trust, please.'",
        "'speaker_2': 'Thank you. Council President. Thank you to the sponsor of this bill. I'm very excited to vote yes. This is going to have incredible benefits to many people who need legal representation in eviction process proceedings. We're going to see a cascading impact of net benefits because when people are able to be legally represented in legal proceedings, their rights'",
        "'speaker_2': 'and they are able to receive the advice that they need to make the decisions to their benefit. So just want to thank the sponsor and thank you, colleagues. I'm excited to vote yes.'",
        "'speaker_0': 'Thank you so much. I don't see any other hands raised. I also wanted to say thanks for an opportunity to consider this legislation in spite of our disagreement as it relates to Amendment three. I still think that this is the right policy for the city.'",
        "'speaker_0': 'I have long advocated for expansion and establishing legal aid programs in a lot of other areas and have in fact been very supportive at the prime sponsors and others efforts to add additional resources for the express purpose of legal aid and prevention of other addictions in our community.'",
        "'speaker_0': 'And I think that that and that need related to evictions and the need to have access to a lawyer is that much more important in this period of time where we know that we are facing a tsunami of evictions after the moratoriums are lifted, but before people are able to get back on on foot, on good footing'",
        "'speaker_0': 'economically, to be able to catch up on their rent. This council has taken really important steps on other tenant protections that I think we are all proud of and appreciate the opportunity to have a bill that will be able to be implemented quickly and that will be legally defensible in a court of law.'",
        "'speaker_0': 'So with that being said, I'm going to hand it over to Councilmember Salant for closing remarks, and then we will call the roll on this bill.'",
        "'speaker_3': 'Thank you. I'm very happy from the comments that councilmembers have made that this bill is likely to pass unanimously. With this legislation, Seattle is about to become the first city in Washington state that guarantees the right to counsel for renters facing eviction.'",
        "'speaker_3': 'This victory belongs to the renters light and socialist movement, which my council office is proud to be a part of, and which understands that it takes a fighting strategy to overcome corporate landlords and politicians. Seattle now joined New York, San Francisco, Boulder, Colorado.'",
        "'speaker_3': 'Newark, New Jersey. Baltimore, Maryland, among others, in prescribing legal rights for renters facing eviction. Hundreds of community members and many community organizations deserve credit for this victory, particularly the Seattle Tenants Union of Washington State. UAW 4121 Socialist Alternative, the Book Workers Union.'",
        "'speaker_3': 'The Housing Justice Project, the American Civil Liberties Union. Both the Washington State affiliate and the National ACLU. Real Change, Transit Riders Union, Faith Action Network, and many others, including the dozens of activists, specifically socialist alternative members, virtually all of whom are struggling workers and renters who collected 468 signatures from working people in our city who strongly support'",
        "'speaker_3': 'this legislation. For the last seven years, our Council office has served as a center of organizing for the renters rights movement. We've built powerful movements, fought for and won breakthrough renters rights legislation like the law that bans rent increases in buildings where code violations exist, the ban on winter evictions, a cap on movement fees.'",
        "'speaker_3': 'We did all of this through collaboration and unity. Collaboration and unity among ordinary people, workers, rank and file members, community organizations, and individual community members who have no power or influenced by themselves but become strong when we organize together and fight back.'",
        "'speaker_3': 'We have won unanimous votes repeatedly by fighting back. As a movement, we celebrate this victory. But we also cannot become complacent because we know that the status quo is still heavily stacked against renters and in favor of corporate landlords.'",
        "'speaker_3': 'Landlords are immense power and in many cases power over whether people can afford to remain housed. That is why we still need a huge expansion of social housing by public revenues, that big business. So we need to increase the Amazon tax.'",
        "'speaker_3': 'We need to make sure that renters rights themselves are continue to be strengthened. That's why my office and our growing renters rights movement will not rest after today's passage of Labor Council. Our movement will claim today's win as a win for the grassroots movement and will go forward to advance legislation to protect renters from default evictions.'",
        "'speaker_3': 'Half of all evictions in Seattle happen by default, meaning the court automatically evict the renter because they did not fill out the paperwork to request a hearing or did not attend the hearing. And often it is the most vulnerable renters who are affected by default, the renters most in need of legal support.'",
        "'speaker_3': 'We have heard horror stories of people who are bedridden, who are in a coma or who have dementia being evicted by default without even knowing it is happening. My office is already also working on a moratorium on evictions of schoolchildren and their families during the months of the school year, as was suggested importantly by school board member'",
        "'speaker_3': ', we have also been working on legislation requiring landlords to have to meet a just standard for all evictions by closing the current loophole that allows landlords and tenants without cause. We are also preparing to develop legislation creating standardized dance for rental leases.'",
        "'speaker_3': 'The reality is the average renter in Seattle has no opportunity to negotiate or alter even the smallest part of their lives when they move into a house or apartment. As a result, many leases have outrageous terms, so we do need to continue to strengthen renters rights to have a full bill of renters rights.'",
        "'speaker_3': 'And even that will not be enough. We will need to fight for rent control. We will need to fight to cancel rent and mortgage and utility debt for those who are struggling because of income or job losses, because of the pandemic and the recession.'",
        "'speaker_3': 'I congratulate everybody who fought to win this. Let's keep going. When we fight, we want.'",
        "'speaker_0': 'Okay, colleagues, we're going to go ahead and call this vote now. Debate is officially closed and I'm going to ask that the clerk please call the roll on the passage of the amended bill.'",
        "'speaker_1': 'Most Jetta I.'",
        "'speaker_2': 'Peterson I.'",
        "'speaker_1': 'So want.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Suarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'Morales Yes. President Gonzalez. I line in favor. None opposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read items two through five into the record?'"
    ],
    "City Light Department Electricity Rates and Terms for 2021 and 2022.": [
        "'speaker_0': 'Motion carries in the appointments are confirmed. Well, the clerk please read the short title of item six into the record. Reporter The Transportation and Utilities Committee Agenda Item six Constable 1200154 way into the city department amending rates, terms and conditions for the use and sale of electricity supplied by the city like departments for 2021 and 2022.'",
        "'speaker_0': 'The committee recommends the bill pass. Thank you so much, Casper Peterson. You are chair of the committee. I'm going to hand it over to you for the committee.'",
        "'speaker_2': 'Thank you, Counsel, President, colleagues at our Transportation and Utilities Committee. On March 17, we unanimously accepted this Council bill 120015 to reaffirm electricity rates for Seattle City Light. Our city has become less affordable and utility bills are essentially regressive.'",
        "'speaker_2': 'So our goal is to keep costs down so we can keep rates low. Thankfully, during COVID, our city owned utilities both Seattle City Light and Seattle Public Utilities have managed to keep rates steady to increase enrollment in our utility discount program and to waive late fees.'",
        "'speaker_2': 'With this legislation, I'm pleased that City Light continues to prevent a net increase to electric bills this year. Each customer's bill is composed of various electricity rates, pass through power rates and surcharges, and through a combination of actions.'",
        "'speaker_2': 'We can continue to prevent an increase in bills this year. In addition, Seattle City Light will be keeping their promise for next year 2022, by sticking with the original rate path agreed to back in 2018 and possibly achieving a smaller increase if passed, the rates from Bonneville Power Administration come in lower.'",
        "'speaker_2': 'I appreciate both Seattle Satellite and Seattle Public Utilities focusing on affordability for our city residents. I want to thank my vice chair, Dan Strouse, for helping to provide more time for us to consider this bill. Again, this bill was recommended unanimously by committee.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Are there any additional comments on the Bill Strauss, please?'",
        "'speaker_2': 'I think it counts. President Thank you. Chair Peterson I want to also express my gratitude to the citywide team who took over two and a half hours to brief me on a long list of questions going into the strategic plan, understanding that while we are codifying the 2022 rates today, that those are they were already endorsed within'",
        "'speaker_2': 'the last strategic plan. So these have these were changes made long ago. And I just, again, want to thank City White for their amazing work, to be able to keep rates as low as possible and to actually not increase rates this last year.'",
        "'speaker_2': 'So thank you so much, council president. Thank you, Chair Peterson. Looking forward to voting yes.'",
        "'speaker_0': 'Thank you so much. Are there any other comments on the bill? Looks like there's no additional comment. So will the critics call the roll on the passage of the bill? I.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Yeah. It's just a free for all at this point. Madam Clerk, we are unable to hear you. So perhaps you can come off of me, or somebody can come off a mute and let me.'",
        "'speaker_1': 'Try this again.'",
        "'speaker_4': 'I'll be the clerk. I'll just get her. I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'So what? Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold asks Suarez. Yep. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. President Gonzalez. I resign in favor. None opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Okay. I promise we're going to get through this screen and do it together. So will the clerk please read item seven through 11 into the agenda item seven through 11 appointments 1832 through 1836.'"
    ],
    "Historic Preservation Controls for the Swedish Club Landmark.": [
        "'speaker_0': 'Motion carries and the appointments are confirmed. Will the clerk please read the short title of item 17 into the Record Report of the Land Use and Neighborhoods Committee Agenda Item 17 Constable 120021 Relating to historic preservation, imposing controls upon the Swedish Club, a landmark designated by the Landmarks Preservation Board.'",
        "'speaker_0': 'The committee recommends the bill pass. Thank you so much, Casimir Strauss. I'm going to hand this back over to you as the chair of the committee.'",
        "'speaker_2': 'Thank you. Council President, do I need to move for a second this bill before it? Thank you. I've seen. Such as?'",
        "'speaker_0': 'I know you can just speak. You can just speak to it. Go ahead.'",
        "'speaker_2': 'Wonderful custom, Bill. One to double, 0 to 1 is the controls and incentives agreement for the Swedish Club on Queen in which has been designated as a landmark. The agreement has been signed by the owner and approved by the Landmarks Preservation Board.'",
        "'speaker_2': 'Controls will be placed on the building exterior and a portion of the interior. The Landmarks designation applies to the building, which was constructed in 1959 in the surrounding alleyways, but not to either adjacent parking lot. In the interest of time, I will reserve the remainder of my comment, comments and if anyone is interested there, we had a'",
        "'speaker_2': 'very good robust discussion in committee. This it might seem as a non assuming building and it has an immense amount of history. And Christine Lederer. Leander also spoke to the history of the Swedish club, which the club being the social aspect, also had a civic aspect that began Swedish hospital here in Seattle.'",
        "'speaker_2': 'Again, I'll reserve the remainder of my comments just to say I urge a yes vote. And thank you to the Swedish Club of Seattle.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. Are there any additional comments on the bill? Hearing that will the clerk please call the roll on the passage of.'",
        "'speaker_1': 'Mosquito. Hi. Petersen.'",
        "'speaker_2': 'Yea. Yes.'",
        "'speaker_1': 'Sergeant.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Suarez. Yep. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. President Gonzalez. Nine in favor. None opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will these affix my signature to the legislation on my behalf? All right. Other Business Council of Australia. I understand you have a request to be excused, so I'm going to let you make the.'",
        "'speaker_2': 'Thank you. Council President I would like to be would like to request to be excused from the April 12th, 2021 City Council meeting and City Council briefing.'",
        "'speaker_0': 'Because so much of there's no objection from overstress will be excused from the April 12th 12th City Council meeting. In council briefing. All right. Hearing no objection that Councilor Strauss has excused from the April 12th city council meeting.'",
        "'speaker_0': 'Is there any other business to come before the council hearing? None, colleagues. This does include the items of business on today's agenda. Our next regularly scheduled city council meeting is on Monday, April 5th, 2021, at 2:00 PM. I hope that you all have a wonderful evening and we are adjourned.'",
        "'speaker_0': 'Thanks, everyone.'"
    ]
}