{
    "Ordinance to Amend the 2020 Budget and Capital Improvement Program.": [
        "'speaker_3': 'Every part of this select.'",
        "'speaker_0': 'Committee agenda item one cancel.'",
        "'speaker_3': '119818 and many.'",
        "'speaker_0': 'Audience 126000 which adopted a 2020 budget including the 2023 2025 capital improvement program.'",
        "'speaker_3': 'The committee recommends the bill passes.'",
        "'speaker_0': 'Meadows, Councilmembers Macheda Gonzalez, Lewis Morales. Peterson Strauss in favor with the councilmembers who want opposed. Thank you, Clark. Okay, folks, I am going to recognize, Councilmember, that as chair of the Select Budget Committee in order to provide the committee report.'",
        "'speaker_0': 'Please. Thank you, Madam President. And if it pleases the President, me, I make a quick statement to encompass all of the bills that are in front of us regarding the budget. We have only read the first agenda item into the record related to the capital improvement program.'",
        "'speaker_0': 'So we would need to read. All of the budget. I'll hold it. Okay. Thank you, Madam President. Well, that was not. That was not reflected. Your intent to do that was not reflected in my script. So I think I would prefer if we go through it bill by Bill in the first one is related strictly to capital'",
        "'speaker_0': 'improvement program budget actions for 2020. Thank you, Madam President. I don't have any additional comments on this just to say this is one of many bills in front of us to rebalance our 2020 budget so that we are recognizing the restricted reserves that are in our hands.'",
        "'speaker_0': 'And to do so with the values that this councilors put forward over the last few months as we've taken on this budget. Thank you. Comes Marie Musgrave for those comments. Are there any other comments on the first bill which again is Council Bill 119818 related to the 2020 budget, including the 20 2025 capital improvement program.'",
        "'speaker_0': 'Council members want.'",
        "'speaker_2': 'Thank you. This is the first of several votes the city council will take today to adopt the city's new budget as a whole. The People's Budget Summer 2020 campaign my office socialist alternative and certainly the hundreds of Black Lives Matter activists who have courageously marched on the streets and braved police violence have fought for and won many'",
        "'speaker_2': 'of the progressive amendments, including a very small reduction to the Seattle Police Department. And I will speak to that more on agenda item number ten when those issues come up for a vote. Unfortunately, as a whole, this city budget does not meet the needs of working class people or the communities specifically who have experienced disproportionately the violence'",
        "'speaker_2': 'of the police department. Unbalanced budget cuts, tens of millions of dollars from the essential work of the city across departments like parks, roads and libraries. Rather than increase the Amazon tax on the wealthiest in our city in order to illuminate the need for austerity.'",
        "'speaker_2': 'On balance, this budget continues to spend more of the city's discretionary funds on the police than on any other department. In fact, this bill includes $3 million in increases to the police budget as a result of grants from the United States Department of Homeland Security.'",
        "'speaker_2': 'That is more than all the so-called defunding of the police budget a department agreed to by the majority of the council combined. I will reserve most of my comments about the budget for agenda item ten. Before that, I will be voting yes on the budget bills that simply accept grants or do other things unrelated to austerity.'",
        "'speaker_2': 'But I will be voting no on this bill and several other bills coming up that implement austerity budget. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sawant, Councilmember Herbold.'",
        "'speaker_3': 'Thank you very much. I just wanted to make note that this bill includes attachment B. Attachment B is the creation of a new capital improvement page for the Seattle Department of Transportation's West Seattle Bridge. Immediate Response. Just thank you to my colleagues for supporting me and bringing this forward.'",
        "'speaker_3': 'It will be very useful to us as we discuss the the Interphone loan that's proposed for some of the 2021 and 2020 cost for the West Seattle Bridge that we'll be hearing in Councilmember Peterson's committee very soon, as well as our upcoming September through November budget discussions.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold, and thank you so much for your ongoing advocacy related to that important infrastructure project for District one and the entire region. Really appreciate it. Colleagues. Anyone else have any comments or questions on the bill?'",
        "'speaker_0': 'Looks like no one else does. So I will let Councilmember Mosqueda, as the prime sponsor have and the chair of the committee have the last word here, and then we'll go ahead and call the roll on this first Bill.'",
        "'speaker_0': 'Thank you very much, Madam President. And I recognize it's a long day, so I'll save my comments for the last bill as well. Look, I just want to set the record straight about what we're doing today. We have, as a council, come together as a collective to identify ways in which we can put our priorities, our values'",
        "'speaker_0': 'forward, and do so in a way that lifts up our commitment to being anti-austerity. Anti-austerity, and how we're responding to COVID in terms of caring for our most vulnerable and anti-austerity in terms of our commitment to raise progressive revenue.'",
        "'speaker_0': 'That's what we've done over the last few months with this entire council coming together. It's been a marathon. It has been an incredibly long few months as we've worked together to identify ways that we could reflect community priorities from spearheading conversations about new taxes and new strategies to right size up our upside down tax system.'",
        "'speaker_0': 'So thank you council members growth and so on to talking about making sure that there's additional funding for transportation. Thank you much to Councilmember Peterson to making sure that there's economic recovery for businesses. Cosmo Strauss You've been leading on that to ensuring meaningful disinvestment from police.'",
        "'speaker_0': 'Councilmember Herbold, thank you for helping to lead and get pen to paper on these amendments and that we've effectively transferred those dollars to the right places. Councilmember Lewis, you've been helping to ensure that we've been following through on where those dollars are going to making sure, finally that we are doing the right thing and we are taking'",
        "'speaker_0': 'our time. Councilmember Suarez has been critical in lifting up that voice and guiding us in each and every step of the way has been Council President Gonzalez. So I am proud of the packages in front of us today.'",
        "'speaker_0': 'We have not been asked often over the last few decades in this city to come together for a midyear 2020 rebalancing package. And as we've done so, we've tried to pull in your ideas to make sure that we're reflecting community priorities, but recognizing in just seven weeks our fall budget process starts with that.'",
        "'speaker_0': 'Thank you for all of the work that you've done, colleagues, that there is a series of amendments in front of us. But I just want to set the record straight on balance. We've rolled up our sleeves on balance.'",
        "'speaker_0': 'We've done some hard work. And on balance, we're not just wringing our hands were we're committing to actions here today. So thank you. Council President. Thank you, Councilmember Mosqueda, for that framing. Really appreciate it. With that being said, colleagues, I'm going to ask the clerk to please call the roll on the passage of the bill.'",
        "'speaker_3': 'Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Purple? Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Must get a.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'President Gonzalez Yes. Seven in favor. One opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes and the chair will sign it. And I would ask that the clerk please affix my signature to the legislation. Okay. Item number two Will the clerk please read the short title of agenda item to into the record?'"
    ],
    "Acceptance of Non-City Funding and Agreements in 2020.": [
        "'speaker_3': 'Agenda Item two Cancer Ball 119819.'",
        "'speaker_0': 'Authorizing and 2020 acceptance of funding from non city sources. The committee recommends that the bill pass. Thank you, Madam Clerk. Councilor Mosqueda, again as sponsor of the bill and chair of the Budget Committee. You are recognized in order to address this item.'",
        "'speaker_0': 'Thank you very much, Madam President. Nothing much to add besides the robust conversations that we had during the committee. I want to thank central staff for their robust analysis of where we could identify each and every dollar to help in this moment of crisis, both through the public health crisis and the economic crisis that's in front of'",
        "'speaker_0': 'them. I appreciate all the work they have put into it in addition to all of our council colleagues. Thank you. Thank you. Customer must get out. Any other comments on this bill? Hearing? None. I'd ask that the clerk please call the roll on the passage of the bill.'",
        "'speaker_3': 'Peterson.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Strauss Yes. Herbold Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Macheda.'"
    ],
    "Ordinance to Amend the 2020 Budget and CIP.": [
        "'speaker_0': 'Yes. President Gonzalez. Yes. Eight in favor, none opposed. Thank you, Madam Clerk. The bill passes and the chair will sign it. I'd ask that the clerk please affix my signature to the legislation. Item number three Will the clerk please read agenda item three into the record?'",
        "'speaker_3': 'Agenda item three Council Vote 119.'",
        "'speaker_0': '820 126000 which adopted the 2020 budget, including the 2025 2025 Capital Improvement Program. The committee recommends the bill pass. Thank you, Madam Clerk. Okay. Councilmember Mosqueda once again is sponsor of the bill and chair of the committee. You are recognized in order to address agenda item three.'",
        "'speaker_0': 'Thank you very much, Madam President. As with a number of these bills, this is another attempt for us to look at carry forward the 2019 carry forward ordinance and appropriate the unexpended non-capital appropriations. This is prudent for us to do in the time of crisis, appreciate the work of central staff and our teams.'",
        "'speaker_0': 'Thank you so much. Are there any other comments on the bill? Hearing on will the clerk please call the roll on the passage of the bill?'",
        "'speaker_3': 'Peterson. I so want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Verbal. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'Morales. Yes.'",
        "'speaker_0': 'Macheda. Yes. President Gonzalez? Yes. Agent seven Unopposed. Thank you, Madam Clerk. The bill passes and the chair will sign it and ask that the clerk please affix my signature to the legislation. Item number four Will the clerk please read agenda item four into the record?'"
    ],
    "Ordinance to Amend the 2019 Budget and CIP.": [
        "'speaker_0': 'Agenda item.'",
        "'speaker_3': 'For cancer.'",
        "'speaker_0': '119821. And many audits 125724, which adopted the 2019.'",
        "'speaker_3': 'Budget, including.'",
        "'speaker_0': '2019 through 2024 Capital Improvement Program. We recommend that the bill pass. Thank you, Madam Clerk. Councilmember, mosquito sponsor of the bill and chair of the committee. You are recognized in order to address this bill as well. Thank you, Madam President.'",
        "'speaker_0': 'Nothing to add in addition to the comments I made on the previous bill as well. Thank you so much. Are there any other comments on the bill? All right. Hearing that. And will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'PETERSON All right.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'STRAUSS Yes.'",
        "'speaker_3': 'HERBOLD Yes.'",
        "'speaker_1': 'LEWIS Guests.'",
        "'speaker_3': 'MORALES Yes. Let's get a. Yes. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Eight, Agent Faber. And unopposed.'"
    ],
    "Exception to General Fund Support for Seattle Parks and Recreation.": [
        "'speaker_0': 'Thank you, Madam Park. The bill passes and the chair will sign it. And as the clerk, please, to fix my signature to the legislation. Item number five Will the clerk please read agenda item five into the record? Agenda item five Resolution 31951 authorizing the exception to the level of general fund support to up park and recreation due'",
        "'speaker_0': 'to exigent economic circumstances. By 3/1 vote of the City Council, the committee recommends that the resolution be adopted. Thank you, Madam Park Councilmember Mosqueda as sponsor of the resolution. You are recognized in order to address this item. Thank you, Madam President.'",
        "'speaker_0': 'Nothing else to add to this one. Thank you so much. Are there any other comments on the on the resolution? Did I see your hand? Because first a lot. Customers silent, please.'",
        "'speaker_2': 'Sorry. This is agenda item five. This one and the next one. Agenda item six. Lift the legally required minimum investment in the Parks Department and the Department of Transportation. If this was being done purely as an accounting measure to swap different types of funds in order to allow the city to fund the best priorities, of course I'",
        "'speaker_2': 'would be supporting this. However, that is not the reality of this austerity budget. The reality is, this year, the mayor has chosen to cut parks and roads rather than supporting the Amazon tax, let alone urging that the Amazon tax be increased so that austerity is averted.'",
        "'speaker_2': 'When we were voting on the Amazon tax earlier this month, my office proposed an amendment to increase those big business taxes in a very small way to cover all budget shortfalls so that no austerity would be needed. As I said, this could have been done with a very small increase in the Amazon tax paid for by the'",
        "'speaker_2': 'wealthiest who have been enjoying a tax haven in our city for years. Unfortunately, no other council member supported that amendment, and as a result, we are now faced with this austerity budget, including these resolutions that are legally required to invest so little into roads and parks.'",
        "'speaker_2': 'I believe I will be voting no on this resolution, which allows austerity in parks and the next council bill, which allows austerity in the Department of Transportation. And my comments apply to both items. If the. Majority of council members agreed with me and instead wanted to avoid austerity by increasing the taxes on big business.'",
        "'speaker_2': 'And of course I would be open to that at any time and would be happy to bring that forward at any time. But at this moment, I will be voting no. And I don't think you.'",
        "'speaker_0': 'Thank you, Councilmember Swann. Any other comments on resolution 31951? Agenda item number five. Hearing and seeing none. I'd ask that the clerk. Please call the role on the adoption of the resolution.'",
        "'speaker_1': 'Petersen I.'",
        "'speaker_3': 'Don't know.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Verbal. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Macheda. Yes. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Seven in favor. One opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it. And as with the clerk, please affix my signature to the legislation on my behalf. Okay. Agenda item number six. Will the clerk please read item six into the record?'"
    ],
    "Suspension of Minimal Annual General Fund Appropriation to the Seattle Department of Transportation Budget.": [
        "'speaker_0': 'Agenda item six Council Bill 119822 relating to the 2020 budget spending, the minimal annual general fund appropriation to the Department of Transportation Budget as required in Ordinance 1247 9611 Levy to move Seattle ratifying confirming certain prior acts or by three fourths vote of the City Council Committee recommends that the bill pass with council members must gather for'",
        "'speaker_0': 'votes Gonzalez, Flores, Luis Morales, Peterson and Strauss in favor and council members to opposed. HQ. Madam Clerk, Councilmember Mosquera is sponsor of the bill and chair of the Committee. You are recognized in order to address agenda item number six.'",
        "'speaker_0': 'Thank you, Madam President. No comment. No additional comments on this. Thank you. Hey, thank you so much. Any other comments? Colleagues on this particular bill. Councilmember Peterson, please.'",
        "'speaker_1': 'It's just for the benefit of the viewing public. If it looks like we're moving through these budget items really fast, it's because we talked about them at length this morning, last Wednesday. And so I just want to take this moment to commend our budget chair, Teresa Mesquita, for her leadership in shepherding this massive legislative package through the'",
        "'speaker_1': 'Budget Committee. You know, there was a lot of work from lots of people in city government, from the executive, city budget office, city council, central staff. And I just it seems like we're moving fast, but there's lots of work that's been done so that folks want to see prior statements.'",
        "'speaker_1': 'They can look back to Wednesday or this morning. But right now, we're ready to vote. So thank you.'",
        "'speaker_0': 'I assure the viewing public that there will be many words shared by probably every single council member towards the end of this committee hearing. So where we're saving up our energy for the final big vote. Consistent with what Councilmember Peterson said, these are not non-controversial bills, relatively non-controversial bills that we have had almost 60 days worth of'",
        "'speaker_0': 'conversation about in the Budget Committee process. But thank you for that. That flag, Councilman Peterson. Okay. So we are now on agenda item sticks and seeing no additional comments from colleagues. I will ask the clerk, call the roll on the passage.'",
        "'speaker_0': 'Peterson.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'So what?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Herbold. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales got a lot together.'",
        "'speaker_0': 'Sorry, I. President Gonzalez.'",
        "'speaker_3': 'Yes. Seven in favor. One opposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. And I'd ask that the clerk please affix my signature to the legislation. Okay. Agenda item seven Will the clerk please read agenda item number seven into the record?'"
    ],
    "Amendment to the 2018 Families, Education, Preschool, and Promise Levy Plan.": [
        "'speaker_0': 'Agenda item seven Council Bill 119823 relating to the 2018 Families, Education, Preschool and Promise Levy amending the Levy Implementation and Evaluation Plan adopted by Ordinance 125807 and ratifying, confirming search and prayer acts. The Committee recommends the bill passed.'",
        "'speaker_0': 'Thank you so much, Madam Clerk. I will now recognize Councilmember Mesquita as sponsor of the bill and chair of the committee to address the item if necessary. Thank you very much, Madam President. Nothing to add at this point.'",
        "'speaker_0': 'Thank you, Councilor Mosqueda, are there any other comments on this bill? Seeing and hearing none. I'd ask that the clerk please call the role on the passage of the bill.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_0': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strouse Yes.'",
        "'speaker_3': 'Purple. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Mosquito.'",
        "'speaker_0': 'Yes. President Gonzalez.'",
        "'speaker_3': 'Yes. Eight in favor and unopposed.'"
    ],
    "Revised Financial Policies for the Cumulative Reserve Subfund.": [
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes and the chair will sign it. I'd ask to the OR please affect my signature to the legislation on my behalf. Okay, folks. Agenda item three eight. Will the clerk please read? Agenda item eight into the agenda item eight.'",
        "'speaker_0': 'Resolution 31952. Adopting revised financial policies for the Cumulative Reserves Fund of the General Fund and preceding Attachment B to Resolution 31848.'",
        "'speaker_3': 'The Committee recommends.'",
        "'speaker_0': 'That the resolution be adopted as amended. Thank you, Madam Clerk. Council member, state sponsor of the resolution and chair of the committee. You are recognized in order to address this item if necessary. Thank you very much. Madam President, I made it to Council Member Herbold, if that's a.'",
        "'speaker_0': 'That is quite all right. Councilmember Herbold, please.'",
        "'speaker_3': 'Well, thank you. I just wanted to lift up another important element related to the. What's the average of our budget actions today, specifically in this resolution? This particular resolution, among other things, adopts financial policies for the use of reach the real estate, a real estate excise tax, and specifies that rate can be used to fund the debt'",
        "'speaker_3': 'associated with repair or replacing the West Seattle Bridge.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. Any other comments or questions about the resolution, colleagues? Hearing and seeing. Not that we will go ahead and ask the clerk to call the roll on the adoption of the resolution.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_0': 'So want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strouse Yes.'",
        "'speaker_3': 'Purple? Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Mosquera.'",
        "'speaker_0': 'Yes. President Gonzalez.'",
        "'speaker_3': 'Yes. Eight in favor and unopposed.'"
    ],
    "Emergency Ordinance on COVID-19 Response Funding and Appropriations.": [
        "'speaker_0': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it. Please affix my signature to the legislation. Agenda Item nine. Will the clerk please read Agenda Item nine into the record? Agenda Item nine Council Bill 119824 Relating to the city's response to the 2020 COVID 19 crisis and venue ordinance 126000, which adopted the 2020'",
        "'speaker_0': 'budget. The committee recommends the bill pass as amended. Thank you, Madam Clerk. Jasmine Mesquita. As chair of the committee, you are recognized in order to address this item. Thank you, Madam President. Again, I'll be brief due to the time.'",
        "'speaker_0': 'I just want to thank our central staff and all of our council colleagues for their tremendous amount of work to make sure that the federal dollars were going appropriately to care for those in our community. We want to be good partners with the state and the feds as we try to collectively respond and provide not just good'",
        "'speaker_0': 'governance, but proactive governance, making sure that we're addressing the crisis that is presenting itself, helping prevent folks from falling into homelessness due to economic crisis, but also making sure that people have the appropriate housing and public health services.'",
        "'speaker_0': 'I appreciate our congressional delegation for all of their advocacy to make federal dollars available. Much, much more is needed. That is part of the reason that we stepped up at the city level and are trying to offer relief for COVID, but appreciate the dollars that have been made available, trying to stretch those as far as possible.'",
        "'speaker_0': 'And our colleagues today with your amendments. This these dollars will make a tremendous impact. So thank you. Thank you. Councilmember Mosqueda, are there any other comments on the bill? Seeing and hearing none that will the clerk please call the roll on a passage of the Peterson?'",
        "'speaker_0': 'I saw. What?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Herbal. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Morales.'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Macheda.'",
        "'speaker_0': 'Yes. President Gonzalez. Yes. Eight in favor, nine opposed. Thank you, Madam Clerk. The bill passed, as in the chair will sign it. I'd ask that the clerk please affix my signature to the legislation. Okay. Agenda item ten. Will the clerk please read agenda item ten into the record?'"
    ],
    "Budget Amendments for COVID-19 Response.": [
        "'speaker_3': 'Agenda Item ten Council Bill 119825.'",
        "'speaker_0': 'Relating to the city's response to a 2020 COVID 19 crisis. Audience 126000 which adopted.'",
        "'speaker_3': 'The 2020 budget. The committee recommends the bill passes, amended with council members must.'",
        "'speaker_0': 'Gather Herbold, Gonzalez, Lewis, Morales, Pierce and Strauss in favor with council members to launch opposed. Thank you, Madam Clerk. I will go ahead and recognize Councilmember Mosqueda as the chair of the of the Committee to address agenda item number ten.'",
        "'speaker_0': 'Thank you very much. Madam President, the bill in front of us is multi-dimensional in that we take attempts in many places to try to provide investments and community priorities, such as making sure that those who are living unsheltered have the housing and support that they need, making sure that fewer people fall into homelessness, and that there is'",
        "'speaker_0': 'truly support for working families in our most vulnerable in the city. And also that we that we take a significant step forward to trying to address the call from community to divest in our policing system and to reinvest in the community.'",
        "'speaker_0': 'I'll just say a few comments here and then I'll save some calls for the closing portion. I want to thank folks for all of their tremendous work, especially our central staff and our teams on each of our offices.'",
        "'speaker_0': 'There's been it's been a very long budget session and it's only august. I want to thank the folks in i.t. And clerks for your work to helping make sure that we can get through each of these meetings and that we had robust public comment from communications and our i.t.'",
        "'speaker_0': 'Folks. I want to thank our council colleagues for their staff and their tremendous hours. It's important to note that many of you, like the organizers in the streets, have been pulled from your families, have had to spend long hours, day and night working as we try to deliberately address the call for action in this civil rights uprising'",
        "'speaker_0': '. What we can't do everything in this summer rebalancing package. We have set the path forward for tremendous work in front of us as a council and as a city. And I think that all of that work should be really called out and appreciated because a lot of this work is happening around the clock.'",
        "'speaker_0': 'And that's true, again, for the folks in the street and the folks who have been working around the clock to provide the budget documents in front of us today. We started the city budget inquests in the first week of June and have had have had two sessions a week.'",
        "'speaker_0': 'At the minimum. Sometimes we've had more than one meeting with two sessions each week. We've had hearings. We've heard from central staff. We've heard from the Seattle Police Department. We've heard from elected leaders in other cities and national research entities.'",
        "'speaker_0': 'And importantly, we've heard from community coalitions who've been calling for change and who have been doing the research in this area for years. This inquest process has been helpful in us finally acknowledging and recognizing that there is massive changes that are needed, structural changes and continued investment in community for us to realize the changes that are being'",
        "'speaker_0': 'called for from community, this process and our deep analysis focus on a racial justice lens. Centering our work by lifting up and including the voice of folks who have been most affected is how we aim to make policy decisions.'",
        "'speaker_0': 'We aim to center politics policy decisions based on those who have the lived experience. And that is exactly what we've done in this speedy budget inquest over the last few months. And honestly, over the last two years, we have been aware that there have been many people who've been calling for structural change.'",
        "'speaker_0': 'And today, council colleagues, we are beginning to put ourselves on the path to righting the historic wrongs. Structural change. Institutional change is really the only option as we look at individuals who've been killed year after year, month after month, unarmed individuals in our community, black and brown community members who've been killed at the hands of the current'",
        "'speaker_0': 'status quo policing system. And we can make changes. We can make changes to make sure that folks who are showing up are those who are adequately trained, who are from our community, who have trusted partnerships and who are not showing up with arms.'",
        "'speaker_0': 'That is the conversation we set ourselves on the chart that are the path that we are charting for this conversation. That is coming up. And we're taking important, critical first steps today. I'll save my the rest of my comments for closing comments.'",
        "'speaker_0': 'But I just wanted to say how important it is that we have centered the policy changes and the budget decisions that are included in this bill, not just on speedy, but also as it relates to caring for our most vulnerable, vulnerable community partners based on what community has told us that they want.'",
        "'speaker_0': 'And that's a critical change as we think about inclusive budgeting and policy making. So thank you to everybody who has made this process possible, and I'll save some comments for later. Madam President. Thank you, Councilmember Mesquita, for those introductory remarks.'",
        "'speaker_0': 'I'm going to go ahead and call on council members who are interested in speaking on me on this bill before we pass it. I see that Councilmember Herbold has our hand up, and as others become inspired to also speak on this Council Bill, I'd ask that you raise your hand accordingly, and I will shut you down in'",
        "'speaker_0': 'the order that you raise your hand. Councilmember Herbold, please. You're on mute. And whoever's playing bingo probably just got a square because I reminded somebody that they were on mute.'",
        "'speaker_3': 'So before I moved to the speed related budget amendment, I do want to just flag my appreciation for some other important elements in this next bill. The pilot project funding the Stay Connected program for seniors is included in here.'",
        "'speaker_3': 'The proviso to remove the police department as the gatekeeper for co-lead referrals is included in here. The funding for the. Race Inequity Toolkit on expansion of choose 180 to begin to serve defendants over the age of 24. The pre filing diversion program is included in here and I'm I'm sorry that this is somebody else's somebody else led'",
        "'speaker_3': 'on this but I feel like it was maybe councilmember awards and I don't want to miss it. The restoration of funds for the AIDS Memorial Pathway is included in here as well. This package also, of course, includes much of the work that this council has been doing since June in the the Seattle Police Department budget inquest led'",
        "'speaker_3': 'by Councilmember Mosqueda, the package of amendments that we worked together on and came to a unanimous council decision on includes 38 full time employment reductions starting in November, with suggestions from specific units, including mounted patrol, school resource officers, the Navigation Team, Harbor Patrol, Public Affairs and a SWAT team.'",
        "'speaker_3': 'It includes us capturing the savings from an additional 30 FTE, from expected attrition through the officers voluntarily leaving or retiring from the police department. And it also includes an additional 32 FTE suggested general reduction in sworn officers. It's really important to understand that ultimately Chief Best holds the authority to make decisions about how and where these reductions'",
        "'speaker_3': 'may occur. The Council may determine the overall appropriate size of the police force and suggest specific specialty units where layoffs may be made. It's the chief of police who will make the determination as to where layoffs occur. In addition, all of the reductions take a very specific format in order to set the city up for the most'",
        "'speaker_3': 'positive labor bargaining outcomes. Instead of making cuts of positions, the amendments put a proviso on two months worth of salary for each position that is targeted for reduction. We have received expert advice that it may take between 2 to 4 months for each reduction to be bargained.'",
        "'speaker_3': 'If it takes longer than that officers so that officers can continue to be paid as the bargaining finishes up. But the proviso format means that the city will have those dollars on hand just in case they are needed.'",
        "'speaker_3': 'The actions, if approved, approved by the council in bargaining as described below, will result in a reduction of Spd's police force by about 100 officers. From the current level of about 1400 officers, that's about a 7% reduction in the sworn force and also a result in savings of about $2.9 million.'",
        "'speaker_3': 'The package also includes modest cuts to the Seattle Police Department's travel, training and recruitment budgets, which seemed appropriate given the current travel restrictions in the mayor's hiring freeze. Those cuts totaled less than $1 million. Finally, the budget actions, which we'll talk about later in the in the resolution, commits to a number of transfers of functions out of'",
        "'speaker_3': 'the police department. The other point I think is really important to make, as we are about to take this vote, is that, you know. I think that we as a as a council and the mayor's office are in a really unique position to seize upon a moment in this city and in this country.'",
        "'speaker_3': 'And I am hopeful that we are more aligned in our desire to do that. That has appeared in the last few weeks. The mayor has been saying that we should be realistic and that we've been irresponsible for committing to a goal before we have the details.'",
        "'speaker_3': 'And I really believe that big change like this, shaking things up, accomplished by limiting to action to what seems realistic is never has never been realized. We always have to think beyond what is normally considered realistic and possible.'",
        "'speaker_3': 'We have a we've we've through agreeing to try to work towards a 50% reduction. I hope with the kind of partnership with community that has brought us to this place where we're at now and has created a pathway and a plan for reductions in 2021.'",
        "'speaker_3': 'I think there was over the weekend there was an editorial that we took a swing and we missed. And I think. I think it's really important to look at what we've accomplished for the left for the next four and a half months of the budget, and understand that that's our starting point for deliberations for a whole year's'",
        "'speaker_3': 'worth of budget. So it's really important to annualize the value of these four months of cost. And I think when you do that and you take a paper and pencil up to do that math, our actions now are significant and noteworthy and also express a commitment to not.'",
        "'speaker_3': 'Disregard public safety, but to recognize that public safety means public safety for everyone in our community. And public safety must be we must recognize that by asking police officers to do too much. There are two things that go wrong.'",
        "'speaker_3': 'One, you send an armed response in some cases to a situation that doesn't require an armed response, which is an unsafe situation. And two, you're reducing the capacity for officers to respond to core law enforcement efforts. And so I'm really encouraged by the work that we've done, and I'm really hopeful for our efforts in implementing the council's'",
        "'speaker_3': 'interests, in working together with the Mayor's Office and the Chief to try to realize this this this pathway for reimagine public safety for our city. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. Appreciate hearing from you as our public safety chair on this issue. Colleagues, I apologize to Councilmember Morales and to all of you. I didn't realize that I had an updated script in my inbox reflecting two additional amendments that are being brought forward by Councilmember Morales, and so had inadvertently opened it up for general'",
        "'speaker_0': 'debate before we considered those amendments. And so I want to apologize and apologize for that oversight. Councilmember Morales did not mean to bypass your amendment. So again, I understand that Councilmember Morales has two proposed amendments to this bill that we are currently discussing that were distributed after 12 noon.'",
        "'speaker_0': 'And in order for the Council to be able to consider these amendments, the Council rules will need to be suspended. So if there is no objection, the council rule relating to circulation of amendments by 12 noon will be suspended to allow consideration of two amendments.'",
        "'speaker_0': 'Hearing no objection. The Council role is suspended and the Council will proceed with consideration of these two amendments. Councilmember Morales You are recognized in order to move version two of Amendment 59.'",
        "'speaker_4': 'Thank you. Council President. And no need to apologize. There was a lot happening this morning, so I want to thank you for letting me bring these. And thank you for all of your indulgence. As I mentioned this morning.'",
        "'speaker_4': 'We did have a couple of provisions ready to go last week. We learned over the weekend that we had to change them around a little. So we were just waiting to hear back from law. So you have received the new versions in your inbox?'",
        "'speaker_4': 'Amendments 59 and 60. As Councilmember Peterson said, there has been a lot of work happening over several weeks now. And this reflects the intent of amendments 33 and 34 that we passed last week. And those amendments were committing us to investing in organizations that are the intent of them, was to commit us to invest in organizations that'",
        "'speaker_4': 'are led by people of color, for communities of color, for organizations that work to improve community safety through restorative justice, mental health and wellness, youth mentoring programs. These are the kinds of organizations we want to invest in so that as we build up community safety infrastructure, we can do that while we are trying to dismantle our overreliance'",
        "'speaker_4': 'on policing. So the provisos that we have today are intended to hold each city to that standard in a way that hews as closely as possible to the preference for bipoc organizations. And as I said earlier, the issue is that because of our 200, we cannot directly express intent to contract with Bipoc communities.'",
        "'speaker_4': 'But that doesn't mean that we can't exercise our express express our intent to our departments, that our contracting process should be more inclusive in its criteria and selection process. So this Amendment 15, Amendment 59 amends the $4 million investment and clarifies that receiving organizations should have culturally relevant experience with holistic community safety efforts.'",
        "'speaker_4': 'And the amendment requests that the chair of the Community Economic Development Committee, who oversees civil rights, receive a report identifying the selected organizations.'",
        "'speaker_0': 'Thank you so much, Councilmember Morales. Are there any questions or comments on a proposed amendment 59? Okay. Hearing. I'm going to go ahead and. Actually, I think I'm not sure we've had a formal motion. And second. Yeah, so can you go ahead and move it and then we'll see if there's a second.'",
        "'speaker_4': 'Yes, I move Amendment 59 again.'",
        "'speaker_0': 'Okay. It's been moved and seconded to adopt version two of Amendment 59. Councilmember Morales has already addressed the proposed amendment. Are there any other comments on the amendment? Hearing none. I will ask that the clerk please call the roll on the adoption of version to of Amendment 59.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_0': 'Want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes.'",
        "'speaker_0': 'Mosquera Yes.'",
        "'speaker_3': 'President Gonzalez?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': '18 favored and opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The motion carries and the amendment is adopted. Councilmember Morales, you have a Second Amendment. So I am going to recognize you to move version two of Amendment 60.'",
        "'speaker_4': 'And move version two of Amendment 60.'",
        "'speaker_0': 'Excellent. Is there a second? Second? It's been moved and seconded to adopt version two of Amendment 60. Councilman Morales, the floor is yours to describe this proposed amendment.'",
        "'speaker_4': 'Thank you. Colleagues, I'll be brief. This amendment places a proviso on the $10 million investments that we made last week to require that HST submit a spending plan through the committee overseeing civil rights issues and that the plan be approved by ordinance.'",
        "'speaker_0': 'Thank you for that description, Councilman Morales. Any other comments on the proposed amendment? Hearing no additional comments on proposed Amendment 60, I will ask that the clerk please call the roll on the adoption of version two of Amendment 60.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_0': 'The one.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Strouse Yes.'",
        "'speaker_3': 'Purple? Yes. Lewis.'",
        "'speaker_1': 'I mean. Yes. Yes.'",
        "'speaker_0': 'Morales.'",
        "'speaker_3': 'Yes. Mesquita Yes. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Adrian Favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The motion carries and the amendment is adopted. All right, so that concludes all of the amendments that I'm aware of. So I will now open it back up to general comments about the bill as amended.'",
        "'speaker_0': 'So, colleagues, any other comments on the Council bill as amended? This will be your last shot to talk about this bill. Okay. Councilmember Strauss and then Councilmember Swan and then Councilman Lewis and Paterson.'",
        "'speaker_5': 'Okay.'",
        "'speaker_1': 'Thank you. Council President. As we all know, there is much more work to be done regarding improving our public safety, to provide public safety that works for everyone in Seattle so that when you call 911, you get the right response right away.'",
        "'speaker_1': 'We already know that 56% of Spd's 911 calls are non-criminal calls. These are parking violations, noise complaints, mental health crisis and welfare checks. And for these types of calls, we don't need a police officer with a gun to respond.'",
        "'speaker_1': 'And we absolutely need the appropriate first responder to respond quickly with the resources they need to be successful to resolve the reason for the call. And this means greater responsiveness across the board. We currently already have programs in place that we can scale up to meet these needs, such as Health One Mobile Crisis Unit, Law Enforcement Assisted'",
        "'speaker_1': 'Diversion, and our Community Service Officer Program. These are the same models that are already in place in Eugene, Oregon. And their program is called cahoots. The biggest difference between cahoots and our programs is that cahoots is hard. Why are these 911 responding to 20% of their nine calls?'",
        "'speaker_1': 'While Seattle's programs require an officer to respond to make a referral. If these programs were hardwired into 911, patrol officers would have more time to respond to and complete traditional police work. The results of this historic transition that we are in right now will enable us to deploy the proper professionals to respond quickly with the appropriate resources'",
        "'speaker_1': 'needed, whether it be crisis intervention, special victims assistance, medical care, social services, or with an armed response when necessary. Through this transition, you'll always be able to call 911 to receive a response. And at the end of this transition, if you have to call 911, you'll get the right response right away.'",
        "'speaker_1': 'Every day of this work, we have found additional ways that additional proven improvements that can be made to the Seattle Police Department's budget and how we deliver public safety. It is important for us to ensure that we are delivering the priorities of government in an efficient manner.'",
        "'speaker_1': 'And this 2020 rebalance is just the first step in that work. In this work. I look forward to receiving the real time speed. Reports about their spending every other week and the robust reporting ahead of the creating the 2021 budget in the next six weeks will have the opportunity to make additional improvements to make meaningful and lasting'",
        "'speaker_1': 'change. And again, throughout this transition, to always be able to call 911 and receive a response. And at the conclusion of this transition, if you have to call 911, you'll get the right response right away. And if your call merits the response of an armed officer, you'll receive that response.'",
        "'speaker_1': 'And for every other call, you'll receive the first the right first responder who will respond right away. There's much more to be said about this council bill. And I know that I wanted to focus my comments specifically on the Seattle Police Department's aspects, and I'll reserve comments for another time on the rest.'",
        "'speaker_1': 'Thank you, Council President.'",
        "'speaker_0': 'Thank you, Councilmember Strauss. Next up is council member so on. And then after customers what will be Councilmember Lewis.'",
        "'speaker_2': 'Thank you. This is the vote today to adopt the city's new budget as a whole. It is euphemistically called balancing package, but that is only because the political establishment does not want to call it what it is an austerity package.'",
        "'speaker_2': 'There is nothing balanced about this budget. It completely fails to defund the police by 50%. Six of the eight other council members are promised to support, and it carries out a major austerity program on behalf of big business, cutting tens of millions from the essential work of the city across departments like parks, roads and libraries.'",
        "'speaker_2': 'It is mind boggling to me how council members can claim they are anti-austerity when they are voting yes on an austerity budget. Where is the balance? When Amazon reported profits in the second quarter of 2020 of over $5 billion.'",
        "'speaker_2': 'Double their profits from a year earlier. Since January 1st of this year, Jeff Bezos's net worth has skyrocketed by 72 billion. That's billion with a B to an astounding $188 billion to date. At the same time, tens of thousands of Seattleites have lost their jobs and incomes, cannot pay rent and are struggling to put food on the'",
        "'speaker_2': 'table. Where is the balance when the Seattle Police Department continues to be funded more of the city's discretionary funds than any other department. My office fully supports and voted yes on. And in fact, the People's Budget Campaign and Black Lives Matter activists and Socialist Alternative have fought or every progressive budget amendment won by our movement.'",
        "'speaker_2': 'We won the funding for the Green New Deal Oversight Board, the end of funding for the euphemistically named Navigation Team, which carries out the inhumane and ineffective sweeps of homeless governments. Of course, I would caution that there are other ways that Mayor Durkan could allow sweeps, and we need to continue organizing to completely end them.'",
        "'speaker_2': 'We want a small reduction in the police department. We want millions in funding for community programs, funding research into alternatives to repressive policing, youth programing and restorative justice. Our movement succeeded in reducing the salaries of most of the top executives in the police department who teargassed peaceful protesters and then lied about it, saying that the protests were'",
        "'speaker_2': 'riots. We want a proviso to end the hiring freeze in the Office of Labor Standards. We want a proviso to protect the North Lake, tiny house village from being swept this year. But as I said, on balance, this budget does not prioritize or meet the needs of ordinary people.'",
        "'speaker_2': 'It is not a moral document. Seattle Times conservative columnist Danny West need is as opposed to my socialist politics, as you might imagine. But he looked at the budget committee's action last week and came to the same conclusion that we did.'",
        "'speaker_2': 'Quote For all the heated rhetoric about Seattle defunding the police, both from activists demanding it and the police union decrying it. The key takeaway right now is this Seattle is not defunding the police. Not by half. Not by a quarter.'",
        "'speaker_2': 'It's not even clear whether this first phase of proposed cuts to the city's police force would reduce the current number of officers out on the street at all. That's the headline. The city isn't defunding the police, unquote. A month ago, the city council voted on the Amazon tax, a historic victory for working people and the oppressed, and'",
        "'speaker_2': 'an a victory for the Black Lives Matter movement. At that time, my office and the Jackson Amazon movement proposed an amendment to increase the Amazon tax by a $293 million per year to eliminate the need for austerity, which no other council member supported.'",
        "'speaker_2': 'Now the police. Now the political establishment insults the intelligence of working people and acting like there is no alternative to budget cuts, as if our memory cannot stretch back a few weeks. City Council Democrats had an alternative. They had a choice, and they decided to side with Jeff Bezos.'",
        "'speaker_2': 'Many activists in the movement will be outraged at council members for reversing their pledges to defund the police by 50%. And they should be. This vote. Is going to reduce the police budget by less than 2%. That's not a defunding.'",
        "'speaker_2': 'Less than $3 million out of $170 million remaining in the city's budget this year, instead of the 50% demanded by the movement and promised by six of the eight Democratic Council members. It represents a total abdication of responsibility and abdication of responsibility in the context of the historic movement for Black Lives.'",
        "'speaker_2': 'The brutal attacks on protesters, the Seattle police's long record of racist and violent policing, and yet eight years of failed attempts at police reform, our people's budget movement gave council members every opportunity to follow through on their promises.'",
        "'speaker_2': 'We proposed defunding the police by 50% now, but every other council member voted no, falsely claiming that the budget cuts could not be done until November. In response to that, on Wednesday, my office proposed defunding the police by 50% starting on November 1st, even though I don't accept that logic but still.'",
        "'speaker_2': 'Okay, let's have it by November 1st and no other council member would even second that proposal. We just received a powerful letter signed by 25 rank and file leaders of UAW 4121, the Union of Student Employees and Postdocs at UW, as they wrote, quote, We are deeply disappointed that many of the same council members have tried to'",
        "'speaker_2': 'delay the 50% defunding by claiming it would interfere with the Seattle Police Officers Guild contract as a public sector union. We recognize this tactic for what it is management grasping for justification to maintain the status quo. These issues are not new and we have too long seen both the city and the Police Officers Guild use collective bargaining'",
        "'speaker_2': 'as political cover to evade responsibility rather than as it should be as any of the strongest tools available to fight for progressive change. We know that defunding SBT is possible, possible now. And we reject any attempts to prop up collective bargaining as a politically convenient way to evade responsibility.'",
        "'speaker_2': 'This hollow excuse is an insult to the labor movement, as our union wields our position at the bargaining table to protect workers and people of color, not our oppressors. We urge other council members to vote for someone's proposed cuts to SBT in the 2020 budget, unquote.'",
        "'speaker_2': 'That was just an extract of their letter. If our movement does not win defunding the police this summer, that does not mean that we cannot win. It means that we need to learn the lessons of the struggle. Recognize that what we win is a function of the strength of our movement and the balance of social and political'",
        "'speaker_2': 'forces. We will continue to organize and fight for defunding and the militarization of the police. We should learn the lessons from the Amazon tax fight, where in 2018 we saw the repeal of the tax and betrayal by Democrats on the Council.'",
        "'speaker_2': 'We learned that we can win if we build a stronger movement and never give up. We learned that our movement needed to be democratically organized by the hundreds who attended. Each of the Amazon action conferences, made key decisions democratically after public debate, and that the leadership of the movement was not going to make alliances with the Democratic'",
        "'speaker_2': 'establishment, but instead relied on independently organizing ordinary people, including the thousands upon thousands who eagerly signed our petitions of the George Floyd protests. How would today's Budget Committee discussions be different if there was a credible ballot initiative to cut 100 million or $200 million or $300 million from the police budget?'",
        "'speaker_2': 'That's a question our movement should ask ourselves throughout history. Progressive change has come from mass movements, not from friendly politicians and the political establishment. The history of our recent struggles also shows once again, working people need our own party, not one beholden to big business.'",
        "'speaker_2': 'Socialist alternative. And I celebrate the victories. We are one, but stand against this austerity budget and failure to address the ongoing epidemic of racist and violent policing. With my no vote today, I perform our movement's unchanging demands. Defund police by at least 50%.'",
        "'speaker_2': 'That's big business and their reach and not austerity on working people. Because we can't pay and we won't pay for this crisis. This crisis of the racist and bankrupt system of capitalism. Thank you.'",
        "'speaker_0': 'Thank you comes my response. Next up is Councilmember Lewis and then we will hear from Councilmember Peterson. Councilmember Lewis, please.'",
        "'speaker_1': 'Thank you, Madam President. I'll be brief. Given all the other comments that I have made throughout this morning and throughout our broader process, I really just want to say, you know, I didn't know when we were starting this out exactly what type of plan we would able to be able to create and to finally start taking shape'",
        "'speaker_1': 'and to lay the groundwork for much bigger. And coming up this fall in 2021, where we get to well, for the 2021 budget, where we're really going to be able to make final decisions on a lot of the things we're laying the groundwork for right now, given the limitations of the summer budget session.'",
        "'speaker_1': 'And I you know, I just really think it stands as a testament to the leadership of Councilmember Mosquito Councilmember Herbold and, you know, the president, in assembling a package that has united a lot of the factions on this council from the from the far left to the far center left.'",
        "'speaker_1': 'I think that we've really been able to reach a pretty good initial package that lays the groundwork for much bigger transformative change to come in short order. You know, I don't know if this counts as an obscure metaphor or an analogy, but I'll throw it out there and hopefully the judges in the in the competition will we'll'",
        "'speaker_1': 'let it ride. But, you know, if you if you want to go fast, go alone. But if you want to go far, go together. And I think that's really what we've been able to put together here is a process not just of this budget, but of the accompanying resolution later to make these final reforms and transformative changes'",
        "'speaker_1': 'that Councilmember Strauss alluded to earlier, too, in terms of the different types of first response. You know, I remain a very big advocate of building a community based low acuity. First response modeled on the crisis assistance helping Out in the Streets program.'",
        "'speaker_1': 'Who is from Eugene, Oregon? Following the lead of other cities from Denver to Oakland to Portland who have been doing the same thing and engaging in the same process. You know, we are not alone as a progressive city working to finally.'",
        "'speaker_1': 'Right, right size our first response. And I know many others will join based on the examples. So I won't take up any more of our time here. And I look forward to voting for this package.'",
        "'speaker_0': 'Councilmember Lewis for those comments. Next up is Councilmember Peterson, followed by Councilmember.'",
        "'speaker_1': 'Thank you. Council President. So in the middle of a persistent pandemic and ballooning budget deficits and even the cracking of our West Seattle bridge stranding a hundred thousand of our residents. In the middle of these crises, your elected officials are striving to seize this historic moment in the wake of the brutal and wrongful killing of George Floyd'",
        "'speaker_1': 'and countless other black, indigenous and people of color, so that we address systemic racism by rethinking policing and revitalizing community health and safety. It's not an easy process. It's it's messy, it's difficult, it's uncomfortable, but it's necessary. Even as I speak now, I'm getting emails and phone calls from constituents who want us to do more now and'",
        "'speaker_1': 'other constituents who want us to slow down and think it through more. Of course, we were elected not only to synthesize these various viewpoints and address the concerns of our constituents, but also to craft thoughtful plans on how to do things better.'",
        "'speaker_1': 'We need to apply our own critical thinking and plan ahead rather than just reacting. I'm cautiously optimistic that the legislation today is a prudent mix of all these goals. It leverages the few tools in the tool belt of this city council to make a down payment toward a bigger, broader discussion, bigger, bolder changes as part of a'",
        "'speaker_1': 'long, more thoughtful, small budget process. I thank my colleagues for incorporating my amendment earlier today to answer some basic questions with the reasonable initial reductions approved today. What will the impact be on the ground in every neighborhood? How will the chiefs of police choose to redeploy our resources?'",
        "'speaker_1': 'And what will the impact be on response times? According to the most recent data? Only 71% of the time spent by police officers is for priority one and priority two cars. That means 29% of the time is spent on non-priority cars.'",
        "'speaker_1': 'There is an opportunity there for community led solutions. These reports will also make sure we do not recklessly jettison the good work done by our Harbor Patrol throughout Lake Union. The reports we're asking for as part of this legislative package can be combined with the planning efforts of our mayor and our police chief as they craft their'",
        "'speaker_1': 'budget proposals for next year. These reports and planning documents are an opportunity, a second chance for the city council to work authentically and proactively with our mayor and our chief of police to rethink and revamp public safety and healthy communities.'",
        "'speaker_1': 'With the reductions we are making for 2020, that will likely carry on to 2021. I believe adjustments can be made so that response times do not get worse. As I talked about earlier today, the remaining officers could respond to fewer types of criminal calls.'",
        "'speaker_1': 'Fewer types of non-criminal calls. Elsewhere. Ms.. Strauss detailed this thoroughly earlier. We also need to recognize that we cannot do it all through the budget. We need to discuss what has not been discussed enough, and that's the need to redo the police union contract.'",
        "'speaker_1': 'This complex contract needs to be redone to encourage the good police officers to stay in Seattle, to reduce excessive salaries and costs to fix their disciplinary system so that it no longer impedes justice. We need a good contract more than good slogans, even as the city council partially defunds our police department.'",
        "'speaker_1': 'We still have a police department, and we'll still have a police department as part of a broader public safety strategy that involves more community led solutions. Are the police reforms implemented since the federal consent decree enough? No. Reforms are not enough when there are systemic and institutional racism.'",
        "'speaker_1': 'But should we toss aside the progress made by the Community Police Commission, the Office Police Accountability, the Office of Inspector General? No. We need both reforms, real reforms and reinvestment. And as we invest tens of millions of dollars, we need more black led organizations at the table from the everyday marchers to the Urban League.'",
        "'speaker_1': 'They all deserve a seat at the table. We need to make sure those investments are smart and effective and that we measure results to show the general public whether we are achieving the positive outcomes we all want. Now, today's legislative package is not perfect.'",
        "'speaker_1': 'I do not support ending the navigation team. That was a team created that had a coordinated response. A team of dedicated city government employees, public servants from our Human Services Department and Parks Department who have been engaging those experiencing homelessness and who work for the public health of all city residents.'",
        "'speaker_1': 'By a narrow 5 to 4 vote, a majority of this council took what I believe to be a hasty action without a full replacement plan. Business improvement areas across the city that represent hundreds of small businesses that employ thousands of our residents are disappointed and concerned.'",
        "'speaker_1': 'Even if the navigation team goes away, the challenges of homelessness will not. So I look forward to working with our Chair of the Committee on Homelessness Strategies to piece together a reasonable and responsive replacement strategy. I also do not support suddenly and with little to no analysis, cutting the salary of the first black police chief in Seattle's'",
        "'speaker_1': 'history and the diverse team that she hand-picked. Yes, we should take a hard look at excess pay throughout our city government, but I believe it should be more thoughtful and methodical. But we're here today facing a massive deficit.'",
        "'speaker_1': 'We must be balanced the budget. We're required by law to do this. Just like all appropriation bills at all levels of government. There are items in the bill that each of us might not prefer. But the big picture is we need to throw together both the executive and the legislative branches to give the general public confidence that'",
        "'speaker_1': 'we can function and move forward for their benefit. Let's approve the budget package today and resolve to work collaboratively with our mayor and police chiefs to solve problems and make progress for Seattle. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson, for those remarks. Next up is Council Member Morales. I think it's still with us. Yeah.'",
        "'speaker_4': 'Thank you. Thank you. Council president. I will be brief. I really just want to take an opportunity to thank a few folks. I want to start with the central staff who, as we all know, have responded tremendously over the last several weeks.'",
        "'speaker_4': 'From my perspective, they've responded with grace and wisdom to every single inquiry coming from this freshman office, and there have been a lot of them. So I want to thank Justin and Dan, each of your members for the work that you do.'",
        "'speaker_4': 'I also want to thank advocates for community safety, for black lives, for our homeless neighbors, young people, immigrants and workers. And I want to thank my staff, the Kiesha Farmer. And turns out that you led the effort with King County Equity, now with De Croix, Seattle and all of the other community safety advocates that we've been working'",
        "'speaker_4': 'with over the last several weeks. Devon Silver, who worked closely with homeless advocates and service providers. And Alexis Turley, who knows how to ask the right budget questions to get greater transparency in the information that we get, particularly the way it's transmitted from the executive branch.'",
        "'speaker_4': 'This team has worked countless hours to serve the people of District two and the people of Seattle, and I am very thankful to have them on my team. And that's all I have. Thank you.'",
        "'speaker_0': 'Thank you, councilmember moralists for those comments. Really appreciate it. Okay, folks, so I think we are coming close to an end here. I will just really quickly before I give the last word over to remember Muscat as the chair of the Select Budget Committee.'",
        "'speaker_0': 'Just say that I also like some of what I just really want to express my appreciation for all of the Legislative Department staff, our council central staff, our legislative department, I.T. and clerk's office. And, of course, every single member of our individual office's staff who've been working tirelessly on staffing all of us on these really important issues'",
        "'speaker_0': 'and engaging in thousands of hours of community engagement and conversations across the city as. And look at how.'",
        "'speaker_3': 'To.'",
        "'speaker_0': 'Rise to the occasion of this historic moment that really calls upon us to take a hard look at how we can reevaluate how we deliver public safety services. And over the last few months, many of us have had an opportunity to engage in conversations across the spectrum, because, remember, Peterson did a really fine job of describing where'",
        "'speaker_0': 'that spectrum is. Obviously, there are folks who believe and we heard it in public testimony even today, who we need, who believe fundamentally that we need to continue to expanding and growing law enforcement arms, law enforcement approaches. And then there are people on the opposite end of the spectrum who believe we need to abolish the police department'",
        "'speaker_0': 'as council members and pursue this as a city wide council member. I believe it's my responsibility to listen to a variety of different opinions in this space and to weigh what what the the the balanced approach might be in moving forward.'",
        "'speaker_0': 'And I recognize that the proposal that we're voting on today is isn't perfect. But it does put us on a pathway towards having additional community engagement to have conversations about how we can truly capture savings and additional investments that we can allocate towards communities who are negatively impacted by overpolicing and criminalization in our city.'",
        "'speaker_0': 'And and I think that that's an important endeavor for us to to to undertake. I think it's going to become harder before it becomes easier. It is clear to me that folks who who are nervous about having the council and the city undergo this effort are many of those folks, I think, are worried about what impact this'",
        "'speaker_0': 'will have on their public safety day in and day out. And, of course, there are also individuals who believe that continuing to invest in law enforcement also carries with it dangers for their public safety in terms of police violence against black community members in particular.'",
        "'speaker_0': 'And so our job here today is to and always is to take as much input as we can to synthesize that information into evaluate strategies and options that lay before us that we feel represent the broader will of the people that we represent.'",
        "'speaker_0': 'And I guess what folks are seeing now is their democracy at work. And I hope that we will be able to, in the coming weeks and months, continue to engage each other in these important conversations, and that we are able to to really develop a broad table of stakeholders who will come together to help us identify clear'",
        "'speaker_0': 'solutions and strategies for how to meet the public safety needs of the people of Seattle without the need to resort, always the need to resort first to an armed response with a gun. Even in those even in those instances in which the activity that is at hand is a nonviolent, noncriminal offense.'",
        "'speaker_0': 'And so I am hopeful that we will be able to have this conversation. I think this is an opportunity for us to continue to engage positively with people across the city and with the chief and with Mayor Durkan around those potential solutions.'",
        "'speaker_0': 'And I look forward to doing that work in collaboration with all of you colleagues in this really important moment in in a time in our history.'",
        "'speaker_1': 'Oh.'",
        "'speaker_0': 'I will go ahead and leave it there and just say thank you to my own staff. Cody, writer Brianna Thomas, The Nguyen and and to all of the staff and all of your offices as council president, we get to serve in the unique role of having to be able to have the opportunity to engage with each and'",
        "'speaker_0': 'every one of your officers on all of these issues and really have appreciated the opportunity to learn with you and to work with each of you. And I have a tremendous amount of. Respect for. For all of our staff who have been working really hard at serving the people of Seattle, they do that in the background and'",
        "'speaker_0': 'they do it extraordinarily well. And I just want to want to thank thank all of them, especially my staff, for all of the work that they've been doing to help me balance home life with with the work life.'",
        "'speaker_0': 'So with that being said, I am going to conclude my remarks and I'm going to hand it over to Councilmember Muscadet to close debate out on this bill, and we will then take a vote. Thank you very much, Madam President, and thanks to all of our colleagues for all of your comments.'",
        "'speaker_0': 'This council has done something truly extraordinary, something that hasn't been done, at least in recent memory. We have passed and we are on the verge of passing a mid-year budget revision while working remotely during overlapping health and homelessness and housing housing crises.'",
        "'speaker_0': 'It would have been easy for us to, instead of going through this robust process that we engaged in, it would have been easier for us to just rubberstamp the mayor's proposed budget. And conversely, it would have been easy to vote no and not do the work.'",
        "'speaker_0': 'But instead we're rolling up our sleeves. We've committed to doing the hard work, and we've put forward a comprehensive and robust proposal. We didn't do this over the series of a few hours or a few meetings. Instead, we worked over the past few months on several budget measures that centered equity, anti austerity, transparency and collaboration at the'",
        "'speaker_0': 'heart of what we've put forward as a comprehensive package to address the crises that are in front of us. And it started with passing Jump Start Seattle. $214 million a year in payroll tax coming in the form of immediate release for covenant and long term economic stability.'",
        "'speaker_0': 'We are replenishing the rainy day and emergency funds with a payroll tax on our largest companies and the highest income earners. We're doing this with the knowledge that this is a smart fiscal policy, a way to jumpstart our local economy, prevent flatlining our local economy, and support our community and family members.'",
        "'speaker_0': 'This is how we help stand up and respond to the crisis in front of us. This week, we're directing $14 million in community investments, including youth focused diversion programs and community led public safety programs. We'll be allocating 3 million for participatory budgeting process so that community can better engage with the city.'",
        "'speaker_0': 'Specifically, the black and brown community can engage with the city in a directed way to make sure that our future efforts will craft a 2021 2022 budget. Investments and investments. We've done this on the heels of adding tens of millions of dollars to the Seattle Transportation Benefit District package to focus on frequency and transit trips, recognizing that'",
        "'speaker_0': 'we want essential workers to be able to get to their jobs and that we provide essential services across our city. We have done all of these things in a way to help center our families and community members who've been calling in and asking us for an anti-austerity approach.'",
        "'speaker_0': 'We have been trying to invest back into the community to respond to this crisis. So to be very clear, all of the steps we have taken have been in alignment with community, our most vulnerable and working families. No one is signing with Jeff Bezos.'",
        "'speaker_0': 'We are increasing funding for our community, part of our community members, where possible, and recognizing that we will do much, much more when Jumpstart Progressive Revenue comes into play in just two years. At this moment, our city is identifying ways to fight back austerity budgeting.'",
        "'speaker_0': 'We have committed as a council that we will not succumb to an austerity budget and we will not allow programs to be pitted against each other. We knew that there was going to be tough choices, but ultimately we crafted a budget that addresses the economic impacts of the COVID crisis.'",
        "'speaker_0': 'We've made new investments in our social safety net programs. We've invested in homeless services and COVID relief for families. We've made meaningful down payments to following communities. Call to defund the SPD by raising investments in community safety programs and scaling down our current state budget.'",
        "'speaker_0': 'We came together collectively and put Seattle residents and workers priorities and their values at the forefront of our discussions. We crafted a mid-year budget that lifts up anti-austerity efforts as we respond to COVID and caring for our most vulnerable.'",
        "'speaker_0': 'As I mentioned at the beginning of today's budget deliberations, the speedy inquest that we started in June has been very helpful in finally reckoning that we have much more work to do to invest in community and divest from an over invested and expanded police budget.'",
        "'speaker_0': 'But this process and our deep analysis has always been centered on the fact that we cannot do it all in a summer budgeting process. We're using a deep racial equity analysis, and we are bringing folks to the table who are from community to help us look at the years upon years of community strategies and priorities and calls'",
        "'speaker_0': 'for action to put those into place, a path to be put into place to really lift up bipoc communities. Local governments have continued to double down on the disproportionate investments in police and jails and courts and prisons. And that is what the status quo has always been.'",
        "'speaker_0': 'The Black Lives Matter movement is not new. But what's new is the way in which we're responding to their calls for action. This is our beginning. This is our effort to show that we're taking first and important steps to right historic wrongs, to begin building that trust back with community, and to make it clear that today is'",
        "'speaker_0': 'only the first step in that process. We have to be real about what is possible in this summer 2020 rebalancing process, and our teams and our community members that we've been working with around the clock have helped to provide much of the much of the input on the package in front of us to do what is possible'",
        "'speaker_0': 'this cycle and sets us up for what must be done in the upcoming months and years. The speed package voted on today is one step of a larger plan that encompasses the 2021 budget cycle, which starts again in just a few weeks.'",
        "'speaker_0': 'We are ensuring that funding for community organizations is actually being allocated dollars out the door so that organizations can scale up and engage in the participatory budgeting process and community led research project that we know we need in order to make sure that our community remains safe and that especially black and brown communities are safer when we'",
        "'speaker_0': 'demilitarize and reduce the police presence in communities, especially communities of color around Seattle. We need time to scale up to make sure that those larger volumes of work that community organizations are going to take on occurs. And this is our process.'",
        "'speaker_0': 'This is our commitment to scaling it up by investing the money that we will pass on Wednesday. It is our effort to scale up the organizations that have been calling for community organizations to really be at the forefront of responding to what communities need to be safe.'",
        "'speaker_0': 'That's housing, food assistance, childcare assistance, and other strategies that have been led by black and brown communities that actually invest and create safety. So today, again, is one step in the process. It says it sets us up for the continuation in the 2021 process, which again just starts in just a few weeks.'",
        "'speaker_0': 'And we will truly be led by the Community led research project to help undo centuries of harm, harmful systems that have continued to be funded over years or years. It will take time for us to get there, but we are acting with urgency today and setting us on the right path to correct these historic wrongs.'",
        "'speaker_0': 'I hope folks continue to work with us as we are intentional in our efforts to build trust, to be honest about what is possible here today, and to build that process for a truly re-envision community safety program and services going forward.'",
        "'speaker_0': 'What's important today is that we haven't just said no. What's important is that we have said, we will walk with you. We will walk with you in community to recreate a truly community led public safety model. What's important is that we have not just stood in the way or blocked the road.'",
        "'speaker_0': 'We are walking with community. We are identifying barriers together. We are pointing to those barriers or blockades and collectively putting the blocks together to get around them, to get around what has previously been insurmountable by working collaboratively with community and with a sense of urgency.'",
        "'speaker_0': 'On Wednesday, you will see us take action on some final votes, including an on loan bill amending efforts to get out the $3 million to community led research project to desegregate SFPD precincts from patrol operations to. Pass the COVID relief bill that is jump start and to amend our efforts to make sure that there is community relief'",
        "'speaker_0': 'that is being provided and not just a veto that stands in our way. That will happen on Wednesday. Again, this is just the first step in a very long process that has been long overdue. So I want to thank the community organizations who've been working with us to really come up with the strategies and the individuals.'",
        "'speaker_0': 'Obviously, we've talked a lot about King County equity now and decriminalize Seattle everyday march, but I want to pull out some specific names and helicopters Shiseido, Jackie, Bang, Shawn Flats, Isaac, Joy and Kira, Oliver, Andrea Richie. From across the country, we have Councilmember Jeremiah Ellison from Minneapolis, New York, Councilmember Brad Lander.'",
        "'speaker_0': 'Awesome City Councilmember Greg Cassar We have folks from San Francisco who provided us with ideas and strategies. Supervisor Jason Walden. We have organizations within the city that have been working to lift up how we can identify non sworn individuals and really invest in making sure that community and the city servants have supports that they need that are'",
        "'speaker_0': 'not embedded within SPD. So I want to thank individuals like Allison Eisinger, Floyd Gayle and Lisa Dugard, who've been working with us on how to de-politicize or sorry the police or demilitarize our homelessness response system. We have Katie Garrow and Nicole Grant from MLK Labor, along with Sean Van Dike and Kenny Stewart, who work with the Coalition'",
        "'speaker_0': 'for City Unions, who constantly said that they would be willing to help think through these next steps and have provided tremendous feedback and especially want to thank the folks who've been shouldering much of this work. A lot of our colleagues have already commented on this, but thank you to the people who've been working day and night shouldering'",
        "'speaker_0': 'this work. And I mean physically their shoulders probably hurt from the amount of work that they have been doing over the last few months. Our central staff, the clerk's office, council communications, our legislative staff, and all of our council members.'",
        "'speaker_0': 'But I want to specifically call out our central staff team by name because we appreciate yourself. Allie Penalty, Tom Meisel, Lisa Kay, Ostrov, and then COG from. Brian Goodnight. Calvin Chao. Carina Bull Ring Dos Amy Gore. Jeff Sims.'",
        "'speaker_0': 'Tracey Ratcliffe. Yolanda Hull Whish-Wilson Eric McConaghy. Carlos Lugo Kettl from Carroll Freeman. Patti, we're in Deputy Director Dan Itr and director Eric Pearson said we appreciate you. We know that this was a ton of work and I will be looking forward to hearing your feedback along with all of our council colleagues, feedback about how we can continually'",
        "'speaker_0': 'improve our process going into the fall budget. And with that, just a huge amount of appreciation for our teams. Some of you have already mentioned all of your incredible staff, but I also want to say thank you to the folks that have possibly reached out as well, not just to my staff, but directly to me.'",
        "'speaker_0': 'Thanks to Cody, writer and Brown, Thomas and Casper Gonzalez, his office, Cristina and Alex and Customer Referrals Office, Lakeisha and Alexis and Councilman Morales. His office. Peter and Councilmember Strauss. His office and Jonathan and Councilmember. So once office was reaching out as well and especially want to thank Aretha Basu and our office.'",
        "'speaker_0': 'She has been part of the organizing efforts in the past years and deep roots in community with King County Equity now and decriminalize Seattle and was on the forefront of inviting community partners to our table so we could hear directly from those most impacted.'",
        "'speaker_0': 'Thank you for your leadership in this effort. Along with Sage, all three.'",
        "'speaker_1': 'Who are.'",
        "'speaker_0': 'Angel, who is always at the forefront of pulling together the analyzes and feedback. Thank you. Along with Buddy Cuevas, who led our committee discussions and is going to continue to be our shepherding us through the select budget efforts and Erin House for your ongoing feedback and helpful engagement, especially as it relates to the federal dollars.'",
        "'speaker_0': 'We greatly appreciate all of your work to all of our council offices, even the folks that I did not name, but just want to see how much I deeply appreciate you. And we have set a budget, a set of package budget in front of us that truly reflects our council values centered again on anti-austerity, equity, transparency and'",
        "'speaker_0': 'collaboration while there's two more votes to come. Just wanted to get those last thank you again and I will be short going forward. Thank you very much. As I mentioned previously, I promised the public that there would be many, many words and thoughts shared with them publicly, and I have fulfilled that promise.'",
        "'speaker_0': 'So with that being said, I want to thank you all for your ongoing patience and engagement on these important issues. I do think it's an important thing that the council is moving forward in a in a unified fashion on this issue.'",
        "'speaker_0': 'I think it gives us a clear place to start the conversation in the coming weeks and over the next several months and really do appreciate the that that opportunity to be unified in this effort. So thank you so much, Councilman Musketeer, for your leadership on the issues facing us through the Budget Committee.'",
        "'speaker_0': 'And we will we will be back at it in about seven weeks. So here here we go. Without further ado, folks, let's go ahead and take a vote. I'm going to go ahead and close out debate on this particular bill.'",
        "'speaker_0': 'So I am now going to ask that the clerk please call the vote on the passage of the bill as amended.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_3': 'So want. No. Strauss.'",
        "'speaker_1': 'Hi. Yes.'",
        "'speaker_3': 'HERBOLD. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Macheda. I. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Seven in favor, one opposed.'"
    ],
    "Resolution on One-Year Budget Proposal for 2021.": [
        "'speaker_0': 'Thank you, Madam Park. The bill passes as amended and the chair will sign it and assist the clerk. Please affects my signature to the legislation. Okay. Will the clerk please read agenda item 11 into the record? Agenda Item 11 Resolution.'",
        "'speaker_3': '31954 relating to the city's.'",
        "'speaker_0': 'Annual budget process, stating a 10th of the city will consider a one year budget proposal for 2021. Only answer preceding resolution 28885 to the extent inconsistent committee recommends the resolution be adopted as amended. Thank you, Madam Clerk. Casmir Muscovite, you are the sponsor of this resolution and are recognized to address this item.'",
        "'speaker_0': 'Thank you, Madam President. This resolution moves us towards a goal that I have been asking for since becoming budget chair. And I think it's really important that we look at the details in the proposal that was sent down.'",
        "'speaker_0': 'I want to thank Council Member Herbold for flagging this in our earlier conversations as well. One really important thing that you will see here is the amendments that we have made to Resolution 31954. Each year the council goes through a budget process, and even years like this one, we endorse a budget for the auditor.'",
        "'speaker_0': 'This provides some guidance, but no concrete stability to departments. I'm really looking forward to making sure that we provide concrete, transparent, accountable information that can go between branches of government and can be shared with the public to flesh out a process in the next few months here that I hope will work for long term planning and long'",
        "'speaker_0': 'term stability as we seek greater outyear forecasting to allow for the Council to deliberate on items in front of us so that we can make sound financing, sound financing decisions, in particular during this economic downturn that we're in.'",
        "'speaker_0': 'Moving towards a shorter budgeting process makes sense to be able to do a truly reflective two three to truly reflect economic conditions. But we also must continue to have biannual budgets and seek further analysis for outyear conversations around our budgeting to ensure stability and transparency with the public.'",
        "'speaker_0': 'Those are the amendments that we've included today. Appreciate all of your support on that and look forward to working with you as we finalize details on what that process will look like. Thank you so much, Councilmember Musketeer, for that description of this particular resolution.'",
        "'speaker_0': 'Are there any other comments on the resolution? Councilmember Verbal, please.'",
        "'speaker_3': 'Thank you. I really appreciate Jerry Mesquita for bringing forward her amendment. This amendment address my concerns about the diversion proposed by the mayor to not just establish a one year process for 2021, but also repeal the resolution that was adopted back in 1994 to establish a two year budget process.'",
        "'speaker_3': 'A two year budget process provides counsel and the public greater transparency, as well as a better opportunity to plan for four out years. So keeping that as the default process makes a lot of sense. I appreciate the focus on and Councilmember Morales I'm sorry, customer mosquitoes amendment on increasing transparency for both the council and the public.'",
        "'speaker_3': 'And I also want to give a shout out to central staffer Tom Meisel. I know the he wrote a budget a budget issue paper on this. And I definitely appreciated the analysis that he did that made me think twice about the the mayor's resolution.'",
        "'speaker_3': 'And I lost track of it. The good work that he had done in that in that budget issue paper. And again, really appreciate chair Ms.. Ada bringing it back before us.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Herbold, are there any other comments on the resolution? All right, hearing none. Will Leclerc please call the role on the adoption of the resolution.'",
        "'speaker_3': 'Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'So want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Macheda. Yes. President Gonzalez. Yes.'",
        "'speaker_3': 'Eight in favor and opposed.'"
    ],
    "Resolution on Creating a Civilian-led Department of Community Safety & Violence Prevention.": [
        "'speaker_0': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it. And as a Kirklees affixed my signature to the legislation OC committee reports of the City Council. We are going to continue now with new item 12.'",
        "'speaker_0': 'So I will move to adopt resolution 31962. Is there a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'It's been moved and seconded to adopt Resolution 31962. Councilmember Lewis, you are the prime sponsor and are recognized in order to address this item.'",
        "'speaker_1': 'Thank you, Madam Chair. Having discussed this extensively during a briefing and a little bit during the Budget Committee meeting, I'll just say that this is a. Critical part of the next actions this Council will take on the additive portion of our process of right sizing.'",
        "'speaker_1': 'Our first response that says this Department of Public Safety, which is envisioned to be created by this resolution and a lot of the other attended parts of this resolution are critical to really laying out a roadmap to show what a successor system can look like and how we can put some of these things that are currently done'",
        "'speaker_1': 'by sworn officers into the responsibility of different types of first responders. I look forward to continuing this work next year and getting a department like this underway. I really think it's at the crux of showing to the people of the city who we've been working with throughout this process and really what the future could look like and'",
        "'speaker_1': 'really challenging the imagination of people in the city to think about the impact of the successor system. So I want to thank Camille Brown in my office for all the work that she's done in putting this together. I want to thank I wish on central staff for I'm really doing a lot of work cobbling this together of'",
        "'speaker_1': 'the last couple of days and particularly over the weekend where there were a couple of last minute changes. I want to thank Councilmember Herbold and Councilmember Suarez for co-sponsoring and providing a lot of the context of this. And with that, I'll just leave it there.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'I thank you, Councilmember Lewis. And actually, before we move on, I just realized I didn't have the clear agenda. I knew agenda item 12 into the record. So I'm going to ask the court to read item 12 into the record and then we'll continue to take comments.'",
        "'speaker_0': 'Agenda item 12, Resolution 3196 to a resolution relating to.'",
        "'speaker_3': 'Policing and public safety.'",
        "'speaker_0': 'Establishing the Council's.'",
        "'speaker_3': 'Intent.'",
        "'speaker_0': 'To create a civilian led Department of Community Safety and Violence Prevention. Identifying actions in 2020 to remove certain functions from the Seattle Police Department and provide funding.'",
        "'speaker_3': 'For a community led.'",
        "'speaker_0': 'Process to inform the structure and function of the new department. Requesting modifications to policing practices, requesting reporting to the Council, providing guidance on layoff decisions, and establishing a work program and timeline for creating a new department. Thank you, Madam Clerk.'",
        "'speaker_0': 'Apologize for that procedural oversight. Okay. So this motion has been moved in, seconded. This resolution has been moved and seconded, and it is now subject to additional debate. Councilor Lewis, thank you so much for doing the initial comments and description of the resolution.'",
        "'speaker_0': 'Colleagues, are there any other comments on the resolution? Councilmember Herbert, please.'",
        "'speaker_3': 'Thank you. So we've talked a lot about this resolution over the last several weeks. I really appreciate Councilmember Lewis's leadership in proposing it and his willingness to work collaboratively, collaboratively on crafting a resolution that expresses council's intent around rebuilding community safety.'",
        "'speaker_3': 'And also, I appreciate the contributions by Councilmember Suarez, who was also a co-sponsor. And Councilmember Peterson. We've taken a large number of votes around the 2020 budget and the SPD budget in particular. In the last week or so, we've spent a lot of time hashing out the important details with the help of our central staff and our'",
        "'speaker_3': 'legislative staff. Sometimes it's easy to lose the forest for the trees, which is why this resolution is so important. This is our opportunity to begin to lay out Council's vision for what true community safety can look like in Seattle.'",
        "'speaker_3': 'With this resolution, Council is starting to define our ideas informed by our constituents, by community, by advocates and activists, and yes, even the mayor's office and the police department. This resolution itself does not transfer services to a civilian led department, but it says it's our goal and that really matters.'",
        "'speaker_3': 'It gives community members a way to hold us accountable for that continued progress that they are insisting on. And it invites the executive into further conversation with the Council on the best path forward to realize this vision. The resolution contains specific, actionable changes, and we've talked twice about the content of those changes already today.'",
        "'speaker_3': 'I'm not going to go over them again, but I'm going to say that they are profound changes. And that's not about congratulating ourselves, that we've accomplished a mission that is still way far off and there are many votes ahead of us.'",
        "'speaker_3': 'But to mark the moment at which the council begins the journey. A poll that was taken between July 22nd and July 27 found that 53% of likely voters supported the general idea of a plan that would permanently cut the police department's budget by 50% and shift that money to social services and community based programs.'",
        "'speaker_3': '32% expressed support for what was described as the council's approach. Ostensibly, that meant an immediate 50% cut. 43% expressed support for what was described as the mayor's approach, which was a cut with the plan we have before us today a budget and a resolution that when SPD cuts are annualized and transfers accomplished in 2021 represents a plan'",
        "'speaker_3': 'forward for our future decisions for a goal that a majority of Seattle residents support. Again, this is a starting point, and of course, there's much more work to be done to realize this visit, this vision. Starting in just a handful weeks, when the council begins its full budget process, looking at the 2021 budget, our work is far'",
        "'speaker_3': 'from done. But with our vote today, we start the journey. I want to thank the incredibly detailed and thoughtful work of decriminalize Seattle and King County Equity now, whose ideas have informed this resolution and much of my work on the 2020 balanced budget rebalancing.'",
        "'speaker_3': 'And I want to thank the tens of thousands of people who have written, called, provided comment and marched tireless tirelessly. And at times at great personal risk to keep the pressure on us. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Robles, for those remarks. Are there any other comments on the resolution? Councilor, Arsalan.'",
        "'speaker_2': 'Thank you. As I mentioned earlier today in the Budget Committee, I will be voting yes on this resolution stating the council's intent and hopes to defund the police in the future. However, our movement has to be clear that a non-binding resolution stating the intent to hope to study the defunding the police in the future is simply not'",
        "'speaker_2': 'a substitute for actually defunding the police. Our movement is clearly expected to accept these nice words about the future intentions as accomplished fact. But unfortunately, I believe that would be a serious mistake. As we have seen over and over again in Minneapolis, the Democratic Party led city council promised to change a city charter to totally reorganize their'",
        "'speaker_2': 'police department and a socialist alternative in Minnesota had predicted, rather than take any action as the city's highest legislative body. The Minneapolis City Council punted the question to the charter commission and again, as Socialist Alternative, I predicted the charter commission has said this is not possible.'",
        "'speaker_2': 'So after all the pomp and circumstance of defunding promises, the Minneapolis Democrats are not defunding the police. And yet in Seattle, three weeks ago, after my office had pledged to fight to defund the police by at least 50%, six Democrats on the council also promised 50% defund.'",
        "'speaker_2': 'What do they have voted to reduce the police budget by less than $3 million and then have added $3 million to the police budget through the second quarter supplemental budget. Last Wednesday, I proposed defunding the police by 50%.'",
        "'speaker_2': 'Now every other council member voted no, saying the budget cuts would not be done until November. And then I proposed defunding the police by 50% starting on November 1st, and no other council member would even second that proposal.'",
        "'speaker_2': 'To be clear, defunding the police cannot be an accounting trick. Moving traffic and parking enforcement out of the Seattle Police Department. But keeping its operations unchanged is not what our movement meant by defunding the police. By defunding the police, we need ending the repression of our communities.'",
        "'speaker_2': 'I want to point out that the resolution states, and I quote, quote, Section seven, the city council will not support any budget amendment to increase the city's budget to offset over time expenditures above the funds budgeted in 2020 or 2021.'",
        "'speaker_2': 'End quote. But in practice today, the same day this council is making this promise to this resolution, the majority, which is seven of the eight councilmembers present, also voted to pass agenda item number one. The second quarter supplemental budget, which adds in-line 1.11 $1.3 million to the police department for, among other things, overtime.'",
        "'speaker_2': 'This is a small thing and in large build that includes many other budget changes that are not objectionable. But it is also the only way that these fine words can be violated. That is also not the only way that these fine words can be violated.'",
        "'speaker_2': 'And I raise this example to illustrate the point that the City Council needs to be held accountable for what they actually do, not for the promises they make. And today, what the council has done is failed to defund the police.'",
        "'speaker_2': 'Again, as I said, I will vote yes because I fully support the intentions of this resolution. But at the end of the day, genuinely willing, defund the police and an end to police violence will require a sustained movement that is democratically organized and is independently organized of the political establishment.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, colleagues. Any other question? Excuse me. Any other comments on the resolution? Having no additional comments, will the clerk please call the role on the adoption of the resolution?'",
        "'speaker_3': 'Peterson I want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strouse Yes.'",
        "'speaker_3': 'Herbold Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yeah. Mosquera. Yes. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it with the clerk. Please affix my signature to the legislation on my behalf. Okay, colleagues, we're going to move along to other items of business here.'",
        "'speaker_0': 'We are now going to take up item number two. I think it's item number 30 teen. Item number 12 from the regular agenda. I'm sorry. You're correct. Thank you, Madam Clerk. The previous item was new item 12. We are now at old item 12.'"
    ],
    "Budget Amendments and Proviso Lifting for the Office for Civil Rights.": [
        "'speaker_0': 'So will the clerk please read item 12 into the record? Agenda Item 12 Council Bill 119839 Relating to Appropriations for the Office for Civil Rights amending Ordinance 126000, which adopted the 2020 budget and lifting provisos. Thank you, Madam Clerk.'",
        "'speaker_0': 'I will move to pass Council Bill 119839. Is there a second can? It's been moved and seconded to pass the bill. Considering what else, as the prime science sponsor of this bill, you are recognized in order to address the item.'",
        "'speaker_4': 'Thank you. Council President. This bill is lifting proviso for $170,000 to the Office of Civil Rights for work that's been done around the criminal legal system. The idea here is that we need much better coordination and alignment of efforts across various work groups and initiatives and different structures that have been set up over time by the city'",
        "'speaker_4': '. As I mentioned this morning, the goal here is to eliminate some of the duplicative work that is happening as these different initiatives seek to engage community to get input from community. There are certainly a lot of interest from community members in participating in engagement in surveys and sharing their expertize and knowledge about what community wants as it'",
        "'speaker_4': 'relates to how our criminal legal system works or doesn't work. But because there is there are so many different things happening, it is really burdensome on community to be asked to repeatedly. Participate in these so that so that's part of the goal is is to ensure that these multiple requests for engagement and serving are better aligned and'",
        "'speaker_4': 'better coordinated and just to move the work forward in a much more coordinated way as we think about how to make investments in our city and in the in the work that the Office of Civil Rights and other parts of the city are doing for community safety.'",
        "'speaker_0': 'Thank you. Councilmember Morales, are there any other comments on. Item 12 cheeseburger bill, please.'",
        "'speaker_3': 'Thank you. So this is a body of work that had been hosted in my former committee last year related to the civil rights work in my committee. I really appreciate that comes from Rawls as a lot of my co-sponsorship of the bill as a little bit of background.'",
        "'speaker_3': 'In the 2020 budget, the Council voted to allocate $170,000 from a proposed probation pilot program for high area individuals and to use those funds differently. The proposal was to use 140,000 for partnership, outreach and engagement related to the criminal legal system and 30,000 for community engagement sessions related to the criminal legal system realignment.'",
        "'speaker_3': 'And I just I want to lift up the history around this because on a weekly call that I and some other councilmembers have had with decriminalize Seattle and King County Equity. Now, the question came up, what happened to those funds that we worked to get cut from the probation pilot program?'",
        "'speaker_3': 'And serendipitously, we are talking about releasing them to the community now, given the heightened attention to the criminal justice system in the context of COVID. Office of Civil Rights is proposing this use of the $170,000, which central staff has access to meet the proviso language.'",
        "'speaker_3': 'The goal is $60 million for community mitigation of COVID 19 impacts on houseless communities that are part of the population identified by the High Barrier Work Group. $80,000 is for expanding economic opportunities for formerly incarcerated communities. Working Group in collaboration with the Office of Economic Development.'",
        "'speaker_3': 'And $30,000 will be for community engagement with regards to COVID 19 related changes in the criminal legal system done in collaboration with City Council central staff in order to move forward with this plan. CCR is requesting that council lift the proviso that's what this legislation does.'",
        "'speaker_3': 'And again, this is, I think, really the beginning of bringing community in to to lead us as policymakers around criminal justice reform and the creation of a high barrier working group to make sure that those voices are centered.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'If you can't remember her words. Are there any other comments on this item.'",
        "'speaker_1': 'Who.'",
        "'speaker_0': 'Keep hearing? None? I will ask the court to please call the role on the passage of the bill.'",
        "'speaker_3': 'Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes.'",
        "'speaker_0': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Guests.'",
        "'speaker_0': 'Let's get to. Thank you. Sorry for the delay.'",
        "'speaker_3': 'I am President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Eight in favor. None opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The time just.'",
        "'speaker_3': 'Before.'",
        "'speaker_0': 'The bill passes and the chair will sign it. And the Kirklees effects my signature. It's in the legislation. Item number 13, will the Kirklees read agenda item 13 into the record?'"
    ],
    "Premium Pay for Gig Workers Ordinance.": [
        "'speaker_3': 'That's an item.'",
        "'speaker_0': '13 counts for 119841 relating to gig workers in Seattle, establishing labor standards, requirements for premium pay for gig workers in Seattle, and adding sections.'",
        "'speaker_3': '100.0.'",
        "'speaker_0': '15.027 and point 200 of Ordinance 126094. To make technical corrections declaring an emergency and establishing an immediate effective date all by a three course vote of the City Council. Thank you, Madam Clerk. I move past council bill 119841.'",
        "'speaker_0': 'Is there a second? Second. Thank you. It's been we've been seconded to pass the bill. Councilmember Herbold, I believe you are going to speak to this bill. So if that's the case, I'm going to hand it over to you to address.'",
        "'speaker_0': 'That was going to be my resource.'",
        "'speaker_3': 'I'm going to hand it over to Councilmember Lewis.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_0': 'Yeah. Councilmember Lewis. Floor is yours.'",
        "'speaker_1': 'Thank you so much. You know, I don't know. We discussed this so much, I. I don't really have anything else to I had, quite honestly, in the interest of time, given how how late it is, I'll just I honestly just want to rest on my earlier comments, if that's okay.'",
        "'speaker_0': 'That's perfectly fine. We have been having conversations about this in council briefings, so totally appreciate that. Are there any other comments on the bill? Okay. Hearing and not it hasn't the clerk. Please call the roll on the passage of Peterson.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'The one?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Herbold. Yes.'",
        "'speaker_0': 'Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales. Yes. Yes. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Eight in favor and unopposed.'"
    ],
    "Paid Sick and Safe Time for Gig Workers Ordinance.": [
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes and the chair will sign it. And I guess the clerk please affix my signature to the legislation. Okay. Agenda item number 14. Will the clerk please read the agenda? Item 14 into the record.'",
        "'speaker_0': 'Agenda Item 14 Council Bill 119842 Relating to gig workers in Seattle establishing labor standards requirements for paid sick and paid safe time for.'",
        "'speaker_3': 'Gig workers working in.'",
        "'speaker_0': 'Seattle and amending Sections 100.0 15.0 80 of Ordinance 126091 to make technical corrections. Thank you, Madam Clerk. I moved to pass Council Bill 119842. Is there a second? Second? It's been moved and seconded to pass the bill. A state I believe you're you're going to take the lead on speaking on this bill, so I'm going to hand'",
        "'speaker_0': 'it over to you. Thank you, Madam President. Colleagues, this is a technical amendment that clarifies that this ordinance only applies to independent contractors and not individuals who are already covered by Seattle's paid sick and safe time ordinance. And this should be pretty self-explanatory.'",
        "'speaker_0': 'But we were told by the Office of Labor Standards it would be helpful to have this in code. So that is what we are doing today. Thank you, Councilmember Mesquita. Are there any other comments on the bill? Seeing and hearing none.'",
        "'speaker_0': 'Will the clerk please call the roll on the passage of the bill? Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Strauss Yes. Herbold Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes.'",
        "'speaker_0': 'Macheda Yes. President Gonzalez.'",
        "'speaker_3': 'Yes. Eight in favor. Nine opposed.'"
    ],
    "Affirmation of Rights for Press, Legal Observers, and Medical Personnel at Protests.": [
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it and ask the Burke. Please affix my signature to the legislation. Okay. Agenda item 15 Will the clerk please read agenda item 15 into the record? Agenda Item 15 Resolution 31961 affirming the rights of members of the press, legal observers and medical personnel covering the protests'",
        "'speaker_0': 'against police brutality. Thank you, Madam Burke. I will move to adopt resolution 31961. Is there a second second? It's been moved and seconded to adopt the resolution. Cameron will say that you are the prime sponsor of this resolution.'",
        "'speaker_0': 'I understand that you have a substitute version, so I'd like to suggest that before we make general comments that we get the substitute before us and then we can open up comments on the substitute version of resolution 31961.'",
        "'speaker_0': 'Thank you, Madam President. I move to amend Resolution 31961 by substituting version four for version to a second. Is there a second? Okay. It's been moved and seconded. Thank you. To substitute the resolution. Councilmember Mosquito, would you like us to just go ahead and take a vote on the substitute and then we can make we can make'",
        "'speaker_0': 'comments about the substitute version. Yes. And unless our colleagues is there, we did have a conversation about the contents of what is in the substitute version. Is there any need for additional description by the prime sponsor about what is in the substitute?'",
        "'speaker_0': 'A hearing nun will go ahead and ask the clerk to please call the roll on the adoption of the substitute. Peterson.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Let's get to. Okay. Yes. Yes.'",
        "'speaker_5': 'President Gonzalez?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you. The motion carries, the substitute is adopted, and version three of the resolution is before the council. I'm going to hand it back over to Councilmember Mosqueda to provide us with her remarks about the resolution as amended.'",
        "'speaker_0': 'And then I will open it up for general comment and debate, and we will then take a final rule on it, because we're just in you, Madam President. And just for the record, I believe we have version four in front of us, given the amendment that was circulated.'",
        "'speaker_0': 'Just want to double check that. That's what we voted on.'",
        "'speaker_3': 'Yes. Correct.'",
        "'speaker_0': 'That was an error on my my part of the script. I apologize. Okay. Thank you. Just wanted to make sure because President, I know it's been a long day, so I. I just thought I'd chime in there. Council calling the resolution in front of us affirms that the free press have the right to cover protests in our'",
        "'speaker_0': 'community. We know that during the last few months of the protests that we've seen here in Seattle and across the country, journalists have been subject to tactics that serve to intimidate or discourage reporters from performing their jobs, their responsibilities to observe these events and report them to the public.'",
        "'speaker_0': 'Local media outlets have said that the ruling that we have seen from the local court has and that would require them to turn over photos and videos taken at protests, threatens journalists role and prevents them from being seen as neutral.'",
        "'speaker_0': 'Observers could further erode trust between the public and the local media. This is a concern that we on city council want to make sure that we address head on. We want to make sure that those who are reporting in our streets are free from intimidation when covering protests.'",
        "'speaker_0': 'Increasingly, as we saw covered and crosscut recently, journalists have reason to fear for their physical safety. I'm quoting from Crosscut right now when they say that covering events like protests journalists have given I'm sorry, when covering events like protests, journalists have reason to fear for their physical safety.'",
        "'speaker_0': 'Forcing journalists to give their work to police would make them less welcome and increase those risks. Protests have constantly been some of the most dangerous on the site jobs for journalists working in the United States. And that has increased over the past three years, saying much of the violence comes sorry, much of the violence comes from police'",
        "'speaker_0': 'committing acts of violence against journalists, but sometimes protesters also lash out. This amendment addresses these issues no matter what our political opinions are. It's important that journalists have the ability to cover protests safely, to be safe, to feel safe, and that they're right to cover the protest is protected.'",
        "'speaker_0': 'And that's especially true when it comes to our police force. These are members who work for the city. We want to make sure that those who are covering these protests are not subject to the issues that we've seen repeatedly here in the city of Seattle, where reporters have been hit with flash bangs, experienced tear gas and have'",
        "'speaker_0': 'also been arrested in our city and incarcerated for hours as they awaited release. This resolution also applies to legal observers and medics who are at the protest to ensure that their legal rights and their safety is also protected at protests.'",
        "'speaker_0': 'These legal observers and medics have also been subject to gassing, flashbangs, arrests and intimidation. Reports from the past month include legal observers who have been targeted by the police and medics who've been trying to aid protesters being pepper sprayed and hit in the face and also experienced flash bangs hitting their bodies.'",
        "'speaker_0': 'It is embarrassing that the city of Seattle is highlighted in a more recent Amnesty International report. The report is entitled The World is Watching Mass Violations by US Police of Black Lives Matter protesters. It covers atrocities committed right here in Seattle in the chapter that is titled Human Rights Violations in the Policing of Protests.'",
        "'speaker_0': 'And Seattle is the first story that is highlighted in this report on page 22. And if I might briefly call your attention to one of the stories that has highlighted many of, you know, the story of Rihanna in that a 26 year old student who was struck in the chest by a flash grenade as she was kneeling'",
        "'speaker_0': 'down approximately 20 feet in front of the Seattle police line. She and her friends had been distributing food that evening at protests. She moved to the front to talk with police to de-escalate the tension. Shortly after talking with the officers, India was hit with a flash grenade.'",
        "'speaker_0': 'An intensive care nurse who is standing at the aid station behind the protesters said that she could smell the pepper spray and hear what that sounded like when the bombs exploded everywhere as people started rushing toward the aid station.'",
        "'speaker_0': 'She was treating four different people at the time, flushing chemical irritants from their eyes and trading welts on their arms and legs from being hit with flash grenades as she was treating them. Someone started screaming. She's been hit in the chest.'",
        "'speaker_0': 'She's been hit in the chest. Yet even as the medic and other medics scrambled to treat in there. Police continue to fired tear gas, flash grenades and rubber bullets at them and the aid station. Police then advanced on the aid station, firing flash grenades and pepper balls.'",
        "'speaker_0': 'Inside the station was clearly marked with identifying signs and red crosses and filled with tables stacked with water bottles and first aid supplies. This is why this resolution is important, both for members of the press or legal observers who we've seen on camera repeatedly being sprayed with pepper spray, and for medics who are trying to care for'",
        "'speaker_0': 'those who've experienced this type of trauma in our streets. We do have some positive news this morning, and that is why the resolution is amended in front of you to include a new Section five. The positive news is that according to a stipulated injunction from the Western District of Washington, SPV will be enjoined from using chemical irritants'",
        "'speaker_0': 'or projectiles against certain protesters. And the ruling says the federal judge in Oregon also stated that although the First Amendment does not enumerate special rights for observing government entities, the Supreme Court has recognized that newsgathering is an activity protected by the First Amendment without some protection for seeking out the news.'",
        "'speaker_0': 'Freedom of the press could be eviscerated. This is incredibly important that these decisions were made today. We want to make sure that we're doing everything we can to not only separate members of the press from being seen as an arm of the government or an extension of the police, but that we're constantly thinking about how we protect'",
        "'speaker_0': 'them in the moments that they're covering folks expressing their First Amendment rights, in addition to making sure that legal observers and medics are protected as well. I appreciate all of your work, council colleagues, as we raise up this resolution and recognize that this follows on the heels of the unanimous votes that we've taken to prevent these types'",
        "'speaker_0': 'of weapons from being used in our streets. Obviously, much more work to be done. And I know this council's committed to that. But I think that this resolution is an important step in reaffirming our commitment to protecting members of the press, legal observers and medics during this time.'",
        "'speaker_0': 'Thank you, Madam President. Thank you, Councilmember Mosqueda, for those remarks. The resolution looks like we have a I think a couple more folks who are interested in speaking. So I'm going to head over to Councilmember Peterson first as one of the co-sponsors, and then we'll hear from Councilmember Herbold.'",
        "'speaker_1': 'Thank you. Thank you, Council President and thank you, Councilwoman Mosqueda, for introducing Resolution 31961 and for welcoming me as a co-sponsor. This resolution is very important to me because I'm passionate about the crucial role that a free press plays in a healthy democracy.'",
        "'speaker_1': 'We must always protect journalists, including those who cover protests and demonstrations so they can shine a light on the truth by providing accurate and independent reports. Social media posts and government issued reports are not a substitute for professional journalists.'",
        "'speaker_1': 'As a highly respected journalist, Walter Cronkite said, freedom of the press is not just important to democracy. It is democracy. Thank you.'",
        "'speaker_0': 'Thank you. Peterson comes from rehearsal.'",
        "'speaker_3': 'Thank you. I want to thank Councilman Muscat for bringing this forward. Back on July 10th, I guess that is a month ago today, I wrote to the mayor in chief regarding the arrest of a journalist, Andrew Buncombe of the Independent and the threat of arrest of other journalists.'",
        "'speaker_3': 'I have not yet received a reply. And as a reminder, it's really important to recognize that the municipal code and the police department's policies, as it relates to orders to disperse, specifically exempts journalists. Nevertheless, since then, journalists are still reporting having chemical irritants or projectiles used on them and not just reporting it.'",
        "'speaker_3': 'I viewed it on live stream, including Omari Salisbury of Converge Media, and his threat of arrest was one of the reasons for that.'",
        "'speaker_0': 'The letter earlier.'",
        "'speaker_3': 'Using these devices on journalists has in effect the same impact as threat of arrest and arrest. It results in journalists being unable to cover the events that they are there to report on and thereby informing the public. The operation of the free press is a linchpin of American democracy.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember Harold, are there any other comments? Councilmember Swan.'",
        "'speaker_2': 'Thank you. I will, of course, be voting in favor of this resolution opposing police officers, targeting journalists, arresting and abusing them, and demanding that they turn over their video footage. And of course, the same goes for legal observers and medics.'",
        "'speaker_2': 'I would just add that this is a resolution, which means it does not have the force of the law. And even if it were an ordinance with the force of the law, we have seen what has happened with the police department and especially under Mayor Durkin's authority.'",
        "'speaker_2': 'We would need to remember the laws of Seattle have already prohibited police officers from targeting journalists in the way they have done, and it still goes on, which means that the resolution will be insufficient to defend the freedom of the press in Seattle.'",
        "'speaker_2': 'But it is still important for the Council to pass this resolution. And because this is our final police department related item this summer, I wanted to take this opportunity to thank the members of the City Council for their help in preparing the budget amendments from my office.'",
        "'speaker_2': 'As I mentioned at Wednesday's Budget Committee meeting, city council staff have been working on the agenda items, you know, almost round the clock that day. They were working until just before midnight at least, and that was far from the first time it happened for the Budget Committee was the case the night before.'",
        "'speaker_2': 'And, you know, that Budget Committee and so on. And I know there are several other examples of it. I want you to particularly thank the people who worked directly on the amendments proposed by my office, of course, Central Staff Director Garrison arrested than either Patty White.'",
        "'speaker_2': 'Green. Allie Banerjee. Lisa Gay. Aisha Bianca Drummond. Greg Doss. Karina Boyle. Yolanda Ho. Jeff Sims. Lesch Watson, Guido Freeman and Calvin Joe. My gratitude to each and every one of them. They have worked incredibly long hours in the budget in general and our movement has depended on them to write many versions of amendments, to respond to every'",
        "'speaker_2': 'criticism of the amendments that our communities need. And I know that others in the movement also appreciate their work. I also wanted to quickly also publicly thank all the socialist community organizers in my office Jonathan Rosenblum, Nick Jones and Adams and Koski, who have done exemplary and self-sacrificing work.'",
        "'speaker_2': 'And, needless to say, thanks to the hundreds, if not thousands of people who have given of themselves in this fight, the fight will go on. I look forward to seeing everyone during the People's Budget campaign in the autumn.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Cause there wasn't any other comments on the resolution. It looks like no other council members have comments on that because we're asking that you have the last word. If you could close out the debate and be great.'",
        "'speaker_0': 'Thank you. Council president. I want to thank Councilmember Peterson for his co-sponsorship of this resolution. I also want to thank Asha and Ali from central staff and several from my staff for working on this resolution and council members out of Portland, Oregon, who now, I think three weeks ago unanimously passed a similar resolution so that we could'",
        "'speaker_0': 'we could really build on that across this region. Unfortunately, we've seen very similar tactics used in other cities as well. One element that I'd like to lift from the ruling today, it says, as described by the Ninth Circuit, when wrongdoing is underway, officials have a great incentive to be blindfolded, to blindfold the watchful eyes of the fourth'",
        "'speaker_0': 'estate. When the government when the government announces it is excluding the press for reasons such as administrative convenience, preservation of evidence or protection of reporters safety, its real motive may be to prevent the gathering of information about government abuses or incompetence.'",
        "'speaker_0': 'This is a critical time that we're in. This is the tip of the iceberg in times of in terms of the type of accountability that I think our city demands, in terms of the images, livestreaming videos that we've seen.'",
        "'speaker_0': 'I'm proud of this council for taking this step today to pass this resolution. And I know that there will be more to come to provide safe avenues for journalists, for medics, for legal observers and for protesters. Thank you very much, Madam President.'",
        "'speaker_0': 'Thank you so much, Councilmember Skinner, for closing out debate on the resolution. So I am not going to ask that the clerk please call the roll on the adoption of the resolution as amended.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_0': 'Want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes. Mosqueda.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'President Gonzalez.'",
        "'speaker_0': 'Yes. Agent Favre.'",
        "'speaker_3': 'None opposed.'",
        "'speaker_0': 'Thank you, Madam Sident. The resolution is adopted as amended and the chair will sign it. And please affix my signature to the legislation. Okay, colleagues. Is there any further business to come before the council? Seeing no further business colleagues.'",
        "'speaker_0': 'This concludes the items of business on today's agenda at our next City Council meeting is scheduled for Monday, August 17, 2020 at 2 p.m.. That again concludes our meeting for today. I hope that you all have a wonderful evening and we are now adjourned.'",
        "'speaker_0': 'Thank you, everyone. Oh. Councilmember Herbold, I believe you are going to speak to this bill. So if that's the case, I'm going to hand it over to you to address. Things are going to be my rules.'",
        "'speaker_3': 'I'm going to hand it over to Councilmember Lewis.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Yeah. Councilmember Lewis. Floor is yours.'",
        "'speaker_1': 'Thank you so much. You know, I don't know. We discussed this so much, I. I don't really have anything else to had, quite honestly, in the interest of time, given how, how late it is, I'll just I honestly just want to rest on my earlier comments, if that's okay.'",
        "'speaker_0': 'That's perfectly fine. We have been having conversations about this in council briefings, so totally appreciate that. Are there any other comments on the bill? Okay hearing as he nodded at the clerk gave call the roll on the passage.'",
        "'speaker_3': 'Up the Peterson.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'The a. Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes. Yes. President Gonzalez. Yes. Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes and the chair will sign it. And I guess that the clerk please affix my signature to the legislation. Okay. Agenda item number 14. Will the clerk please read the agenda? Item 14 into the record.'",
        "'speaker_0': 'Agenda Item 14 Council Bill 119842 related to gig workers in Seattle establishing labor standards requirements for paid sick and paid safe time for gig.'",
        "'speaker_3': 'Workers.'",
        "'speaker_0': 'Working in Seattle and amending Sections 100.0 15.0 80 Ordinance 126091 to make technical corrections. Thank you, Madam Clerk. I moved to pass Council Bill 119842. Is there a second? Second? It's been moved and seconded to pass the bill comes from a state I believe you're you're going to take the lead on speaking on this bill, so I'm'",
        "'speaker_0': 'going to hand it over to you. Thank you, Madam President. Colleagues, this is a technical amendment that clarifies that this ordinance only applies to independent contractors and not individuals who are already covered by Seattle's paid sick and safe time ordinance.'",
        "'speaker_0': 'And this should be pretty self-explanatory. But we were told by the Office of Labor Standards it would be helpful to have this in code. So that is what we are doing today. Thank you, Councilmember Mosqueda. Are there any other comments on the bill?'",
        "'speaker_0': 'Seeing and hearing none. Will the clerk please call the roll on the passage of the bill? Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Strauss Yes. Herbold Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes.'",
        "'speaker_0': 'Macheda Yes. President Gonzalez.'",
        "'speaker_3': 'Yes. Eight in favor. Nine opposed.'",
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it and ask the court please affix my signature to the legislation. Okay. Agenda item 15 Will the clerk please read Agenda Item 15 into the record? Agenda Item 15 Resolution 31961 affirming the rights of members of the press, legal observers and medical personnel covering the protests'",
        "'speaker_0': 'against police brutality. Thank you, Madam Burke. I will move to adopt resolution 31961. Is there a second second? It's been moved and seconded to adopt the resolution. Cameron will say that you are the prime sponsor of this resolution.'",
        "'speaker_0': 'I understand that you have a substitute version, so I'd like to suggest that before we make general comments that we get the substitute before us and then we can open up comments on the substitute version of resolution 31961.'",
        "'speaker_0': 'Thank you, Madam President. I move to amend Resolution 31961 by substituting version four for version to a second. Is there a second? Okay. It's been moved and seconded. Thank you. To substitute the resolution. Councilmember Mosquito, would you like us to just go ahead and take a vote on the substitute and then we can make we can make'",
        "'speaker_0': 'comments about the substitute version. Yes. And unless our colleagues is there, we did have a conversation about the contents of what is in the substitute version. Is there any need for additional description by the prime sponsor about what is in the substitute?'",
        "'speaker_0': 'Eight hearing, none will go ahead and ask the clerk to please call the roll on the adoption of the substitute. Peterson.'",
        "'speaker_3': 'So what?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold. Yes. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Morales.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Let's get to. Okay. Yes. Yes.'",
        "'speaker_5': 'President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you. The motion carries, the substitute is adopted, and version three of the resolution is before the council. I'm going to hand it back over to Councilmember Mosqueda to provide us with her remarks about the resolution as amended.'",
        "'speaker_0': 'And then I will open it up for general comment and debate, and we will then take a final vote on it because it was great. Thank you, Madam President. And just for the record, I believe we have version four in front of us, given the amendment that was circulated.'",
        "'speaker_0': 'Just want to double check that. That's what we voted on.'",
        "'speaker_3': 'Yes. Correct.'",
        "'speaker_0': 'That was an error on my my part of the script. I apologize. Okay. Thank you. Just wanted to make sure because President, I know it's been a long day, so I. I just thought I'd chime in there. Council colleagues, the resolution in front of us affirms that the free press have the right to cover protests in our'",
        "'speaker_0': 'community. We know that during the last few months of the protests that we've seen here in Seattle and across the country, journalists have been subject to tactics that serve to intimidate or discourage reporters from performing their jobs, their responsibilities to observe these events and report them to the public.'",
        "'speaker_0': 'Local media outlets have said that the ruling that we have seen from the local court has and that would require them to turn over photos and videos taken at protests, threatens journalists role and prevents them from being seen as neutral.'",
        "'speaker_0': 'Observers could further erode trust between the public and the local media. This is a concern that we on city council want to make sure that we address head on. We want to make sure that those who are reporting in our streets are free from intimidation when covering protests.'",
        "'speaker_0': 'Increasingly, as we saw covered and crosscut recently, journalists have reason to fear for their physical safety. I'm quoting from Crosscut right now when they say that covering events like protests journalists have given I'm sorry, when covering events like protests, journalists have reason to fear for their physical safety.'",
        "'speaker_0': 'Forcing journalists to give their work to police would make them less welcome and increase those risks. Protests have constantly been some of the most dangerous on the site jobs for journalists working in the United States. And that has increased over the past three years, saying much of the violence comes sorry, much of the violence comes from police'",
        "'speaker_0': 'committing acts of violence against journalists, but sometimes protesters also lash out. This amendment addresses these issues no matter what our political opinions are. It's important that journalists have the ability to cover protests safely, to be safe, to feel safe, and that they're right to cover the protest is protected.'",
        "'speaker_0': 'And that's especially true when it comes to our police force. These are members who work for the city. We want to make sure that those who are covering these protests are not subject to the issues that we've seen repeatedly here in the city of Seattle, where reporters have been hit with flash bangs, experienced tear gas and have'",
        "'speaker_0': 'also been arrested in our city and incarcerated for hours as they awaited release. This resolution also applies to legal observers and medics who are at the protest to ensure that their legal rights and their safety is also protected at protests.'",
        "'speaker_0': 'These legal observers and medics have also been subject to gassing, flashbangs, arrests and intimidation. Reports from the past month include legal observers who have been targeted by the police and medics who've been trying to aid protesters being pepper sprayed and hit in the face and also experienced flash bangs hitting their bodies.'",
        "'speaker_0': 'It is embarrassing that the city of Seattle is highlighted in a more recent Amnesty International report. The report is entitled The World is Watching Mass Violations by US Police as Black Lives Matter Protesters. It covers atrocities committed right here in Seattle in the chapter that is titled Human Rights Violations in the Policing of Protests.'",
        "'speaker_0': 'And Seattle is the first story that is highlighted in this report on page 22. And if I might briefly call your attention to one of the stories that has highlighted many of, you know, the story of Rihanna in that a 26 year old student who was struck in the chest by a flash grenade as she was kneeling'",
        "'speaker_0': 'down approximately 20 feet in front of the Seattle police line. She and her friends had been distributing food that evening at protests. She moved to the front to talk with police to de-escalate the tension. Shortly after talking with the officers, the was hit with a flash grenade.'",
        "'speaker_0': 'An intensive care nurse who was standing at the aid station behind the protesters said that she could smell the pepper spray and hear what that sounded like when the bombs exploded everywhere as people started rushing toward the aid station.'",
        "'speaker_0': 'She was treating four different people at the time, flushing chemical irritants from their eyes and treating welts on their arms and legs from being hit with flash grenades as she was treating them. Someone started screaming. She's been hit in the chest.'",
        "'speaker_0': 'She's been hit in the chest. Yet even as the medic and other medics scrambled to treat in there. Police continue to fired tear gas, flash grenades and rubber bullets at them and the aid station. Police then advanced on the aid station, firing flash grenades and pepper balls.'",
        "'speaker_0': 'Inside the station was clearly marked with identifying signs and red crosses and filled with tables stacked with water bottles and first aid supplies. This is why this resolution is important, both for members of the press or legal observers who we've seen on camera repeatedly being sprayed with pepper spray, and for medics who are trying to care for'",
        "'speaker_0': 'those who've experienced this type of trauma in our streets. We do have some positive news this morning, and that is why the resolution is amended in front of you to include a new Section five. The positive news is that according to a stipulated injunction from the Western District of Washington, SPV will be enjoying from using chemical irritants'",
        "'speaker_0': 'or projectiles against certain protesters. And the ruling says the federal judge in Oregon also stated that although the First Amendment does not enumerate special rights for observing government entities, the Supreme Court has recognized that newsgathering is an activity protected by the First Amendment without some protection for seeking out the news.'",
        "'speaker_0': 'Freedom of the press could be eviscerated. This is incredibly important that these decisions were made today. We want to make sure that we're doing everything we can to not only separate members of the press from being seen as an arm of the government or an extension of the police, but that we're constantly thinking about how we protect'",
        "'speaker_0': 'them in the moments that they're covering folks expressing their First Amendment rights, in addition to making sure that legal observers and medics are protected as well. I appreciate all of your work, council colleagues, as we raise up this resolution and recognize that this follows on the heels of the unanimous votes that we've taken to prevent these types'",
        "'speaker_0': 'of weapons from being used in our street. Obviously, much more work to be done. And I know this council's committed to that. But I think that this resolution is an important step in reaffirming our commitment to protecting members of the press, legal observers and medics during this time.'",
        "'speaker_0': 'Thank you, Madam President. Thank you, Councilmember Mosqueda, for those remarks. The resolution looks like we have, I think, a couple more folks who are interested in speaking. So I'm going to head over to Councilmember Peterson first as one of the co-sponsors, and then we'll hear from Councilmember Herbold.'",
        "'speaker_1': 'Thank you. Thank you, Council President. And thank you, Councilwoman ROSQUETA, for introducing Resolution 31961 and for welcoming me as a co-sponsor. This resolution is very important to me because I'm passionate about the crucial role that a free press plays in a healthy democracy.'",
        "'speaker_1': 'We must always protect journalists, including those who cover protests and demonstrations so they can shine a light on the truth by providing accurate and independent reports. Social media posts and government issued reports are not a substitute for professional journalists.'",
        "'speaker_1': 'As a highly respected journalist, Walter Cronkite said, freedom of the press is not just important to democracy. It is democracy. Thank you.'",
        "'speaker_0': 'Thank you, Governor Peterson, from rehearsal.'",
        "'speaker_3': 'Thank you. I want to thank Councilman Muscat for bringing this forward. Back on July 10th, I guess that is a month ago today, I wrote to the mayor in chief regarding the arrest of a journalist, Andrew Buncombe of the Independent and the threat of arrest of other journalists.'",
        "'speaker_3': 'I have not yet received a reply. And as a reminder, it's really important to recognize that the municipal code and the police department's policies, as it relates to orders to disperse, specifically exempts journalists. Nevertheless, since then, journalists are still reporting having chemical irritants or projectiles used on them and not just reporting it.'",
        "'speaker_3': 'I viewed it on Livestream, including Omari Salisbury of Converge Media and his threat of arrest was one of the reasons for that. The letter earlier using these devices on journalists has in effect the same impact as threat of arrest and arrest.'",
        "'speaker_3': 'It results in journalists being unable to cover the events that they are there to report on and thereby informing the public. The operation of the free press is a linchpin of American democracy. Thank you.'",
        "'speaker_0': 'Thank you so much. Councilmember Herbert, are there any other comments? Councilmember Salaam.'",
        "'speaker_2': 'Thank you. I will, of course, be voting in favor of this resolution opposing police officers, targeting journalists, arresting and abusing them, and demanding that they turn over their video footage. And of course, the same goes for legal observers and medics.'",
        "'speaker_2': 'I would just add that this is a resolution, which means it does not have the force of the law. And even if it were an ordinance with the force of the law, we have seen what has happened with the police department and especially under Mayor Durkin's authority.'",
        "'speaker_2': 'We would need to remember the laws of Seattle have already prohibited police officers from targeting journalists in the way they have done, and it still goes on, which means that the resolution will be insufficient to defend the freedom of the press in Seattle.'",
        "'speaker_2': 'But it is still important for the Council, the resolution. And because this is our final police department related item this summer, I wanted to take this opportunity to thank the members of the City Council for their help in preparing the budget amendments from my office.'",
        "'speaker_2': 'As I mentioned at Wednesday's Budget Committee meeting, city council staff have been working on the agenda items, you know, almost around the clock that day. They were working until just before midnight at least, and that was far from the first time it happened for the Budget Committee.'",
        "'speaker_2': 'This was the case the night before. And, you know, that Budget Committee and so on. And I know there are several other examples of it. I want you to particularly thank the people who worked directly on the amendments proposed by my office.'",
        "'speaker_2': 'Of course, Central Staff Director Garrison arrested Dan Reader Barry White. Green. Allie Banerjee. Lisa Kay. Asha Venkatraman. Greg Doss. Carina Boyle. Yolanda Ho. Jeff Sims, Lesch Watson, Keith Freeman and Calvin Joe. My gratitude to each and every one of them.'",
        "'speaker_2': 'They worked incredibly long hours in the budget in general, and our movement has depended on them to write many versions of amendments, to respond to every criticism of the amendments that our communities need. And I know that others in the movement also appreciate their work.'",
        "'speaker_2': 'I also wanted to quickly also publicly thank all the socialist community organizers in my office Jonathan Rosenblum, Nick Jones and Adams and Koski, who have done exemplary and self-sacrificing work. And, needless to say, thanks to the hundreds, if not thousands of people who have given of themselves in this fight, the fight will go on.'",
        "'speaker_2': 'I look forward to seeing everyone during the People's Budget campaign in the autumn. Thank you.'",
        "'speaker_0': 'Thank you, because there wasn't any other comments on the resolution. It looks like no other council members have comments on that because we're. Muscala you have the last word. If you could close out the debate, I'd be great.'",
        "'speaker_0': 'Thank you. Council president. I want to thank councilmember peterson for his co-sponsorship of this resolution. I also want to thank Asha and Ali from central staff and several from my staff for working on this resolution and council members out of Portland, Oregon, who now, I think three weeks ago unanimously passed a similar resolution so that we could'",
        "'speaker_0': 'we could really build on that across this region. Unfortunately, we've seen very similar tactics used in other cities as well. One element that I'd like to lift from the ruling today, it says, as described by the Ninth Circuit, when wrongdoing is underway, officials have a great incentive to be blindfolded, to blindfold the watchful eyes of the fourth'",
        "'speaker_0': 'estate. When the government when the government announces it is excluding the press for reasons such as administrative convenience, preservation of evidence or protection of reporters safety. Its real motive may be to prevent the gathering of information about government abuses or incompetence.'",
        "'speaker_0': 'This is a critical time that we're in. This is the tip of the iceberg in times of in terms of the type of accountability that I think our city demands, in terms of the images by streaming videos that we've seen.'",
        "'speaker_0': 'I'm proud of this council for taking this step today to pass this resolution. And I know that there will be more to come to provide safe avenues for journalists, for medics, for legal observers and for protesters. Thank you very much, Madam President.'",
        "'speaker_0': 'Thank you so much, Councilmember Skinner, for closing out debate on the resolution. So I am not going to ask that. The Court Please call the roll on the adoption of the resolution as amended.'",
        "'speaker_1': 'Peterson I.'",
        "'speaker_0': 'So want.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_3': 'Herbold Yes.'",
        "'speaker_1': 'Lewis Yes.'",
        "'speaker_3': 'Morales Yes. Mosqueda.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'President Gonzalez.'",
        "'speaker_0': 'Yes. Agent Faber?'",
        "'speaker_3': 'None unopposed.'",
        "'speaker_0': 'Thank you, Madam Sident. The resolution is adopted as amended in the chair will sign it. Please affix my signature to the legislation. Okay, colleagues, is there any further business to come before the council? They seeing? No for their business colleagues.'",
        "'speaker_0': 'This concludes the items of business on today's agenda at our next City Council meeting is scheduled for Monday, August 17, 2020, at 2 p.m.. That again concludes our meeting for today. I hope you all have a wonderful evening and we are now adjourned.'",
        "'speaker_0': 'Thank you, everyone.'"
    ]
}