{
    "Public Hearing on the Petition of West Coast Self-Storage and General Steel Services for Street Vacation.": [
        "'speaker_1': 'With the report of the Full Council Agenda Item one Resolution 31758. A resolution setting the public hearing on the petition of West Coast Self-Storage and General Steel Services of Washington, LLC for the vacation of a portion of 29th Avenue Southwest and a portion of Southwest City View Street and the greater Duwamish Neighborhood Planning Area, according to Chapter'",
        "'speaker_1': '35.79 of the Revised Code of Washington, Chapter 15.62 of the Seattle Municipal Code and Clerk File 314357. Introduced June 19th, 2017.'",
        "'speaker_0': 'Councilmember O'Brien.'",
        "'speaker_4': 'I didn't realize this one was me.'",
        "'speaker_1': 'Oh, you want me to do it for you?'",
        "'speaker_4': 'You know it.'",
        "'speaker_1': 'Make enough to say yes.'",
        "'speaker_4': 'Let's see here.'",
        "'speaker_1': 'The strict one.'",
        "'speaker_3': 'Strip vacations in a day.'",
        "'speaker_0': 'Apologize my notes, said Councilmember O'Brien. And I just follow my notes. And you probably could just read the caption.'",
        "'speaker_4': 'But this is the type of legislation that it does require a resolution to notify the notice for public hearing. So this is exactly what that does.'",
        "'speaker_0': 'Yes, it's just a routine notice to set the public hearing on the petition from West Coast. It's what I heard you say. That's okay. Okay.'",
        "'speaker_4': 'Articulate.'",
        "'speaker_0': 'Thank you very much. Those in favor of adopting the resolution is so well articulated by Councilmember Bryant. Please vote i. I. Those opposed vote no emotion carries the resolution adopted the chair will sign it. Please read the report of the Gender Equity Safe Communities and New Americans Committee.'"
    ],
    "Ordinance on Bias-Free Policing Policies, Training, Enforcement, and Data Collection.": [
        "'speaker_1': 'The Report of the Gender Equity Safe Communities and New Americans Committee Agenda Item two Council Bill 119018 An ordinance related to the Bias Free Policing Adding a new Chapter 14.11 consisting of sections 14.11 .0101020.030.040.050.060. To the Seattle Municipal Code to codify Seattle's commitment to bias free policing, require the Seattle Police Department to have bias free policing policies'",
        "'speaker_1': 'and training. Create an enforcement mechanism against bias policing and collected and collect data to ensure help ensure that bias policing does not occur. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you very much. Concerned Gonzalez.'",
        "'speaker_1': 'Thank you. Before we begin substantive conversation, there is an amendment that I circulated consistent with the comments I made during council briefing this morning, circulated that before noon. So I'd like to move to amend Council Bill 119018 with Amendment 1/2.'",
        "'speaker_1': 'I listed in my email earlier today that the changes are largely technical. On page four, lane ten, there's a correction to reference Chapter 14.8 to 14.11. On page six, line one, there's a technical correction to grammar. Page six, lane three strikes including but not limited to a social contact.'",
        "'speaker_1': 'And Terry stop or a traffic stop so that the whole paragraph reads as follows, quote, Not later than three years when the occurrence of alleged bias policing persons who believe they are a victim of by bias policing based on any interaction with a Seattle police officer may file a civil complaint against the city of Seattle in a'",
        "'speaker_1': 'court of competent jurisdiction under Section 1411 050. And then the last edit that is made in this proposed amendment one is on page eight. Lane one striking the words in car. Out of out of that section. So. That's that's the amendment.'",
        "'speaker_1': 'Very technical, so very good.'",
        "'speaker_0': 'It's been moved in second. And we're going to see a vote just on the proposed amendment stated by Councilman Gosar. Any further questions on the amendment? All those in favor of the proposed amendment, number one to the legislation.'",
        "'speaker_0': 'Please vote i. I opposed. The ayes have it. So Councilman examines you shall the chair and we are now having a minute piece of legislation.'",
        "'speaker_1': 'Great. So I would move for the passage of Council Bill 11901 8 seconds.'",
        "'speaker_0': 'It's been moved in second it Catherine's unless she'd like to make some comment.'",
        "'speaker_1': 'Just really briefly this this particular bill codifies Seattle's commitment to bias free policing by requiring that the Seattle Police Department have an ongoing duty to have a bias free policing policy and related trainings. It creates an enforcement mechanism against bias policing, and it requires the ongoing collection of data related to terror and traffic stops to help the'",
        "'speaker_1': 'city assess and determine whether or not bias policing is occurring. And and I think that I'll just sort of end by saying that that this was in my committee, I think about three or four times. We had a lot of interesting conversations about this particular policy.'",
        "'speaker_1': 'But I think in in in some it is a clear reaction to what we hear from our members in the community about ongoing concerns of simply feeling like they continue to tell us and remind us that this is an issue within their communities, but that they are not seeing clear, concrete actions from their council as it relates'",
        "'speaker_1': 'to taking the issues of bias policing head on. And to me, this is a direct response to those community concerns and frustrations, and it's my hope that we will be able to more effectively track biased policing concerns and that we will be able to effectively provide people who have been subjected to bias policing a clear avenue by'",
        "'speaker_1': 'which they can access some justice in a civil court if for some reason our accountability system fails that person during the internal investigation. So I'm really excited about the passage of this bill. I think it's a good step forward as we continue to ensure that the public has clear mechanisms by which to hold us and the system'",
        "'speaker_1': 'accountable. And I'm very excited about having the support of the full council as we move to pass this bill.'",
        "'speaker_0': 'Very much. Any further comments from any of our colleagues? Councilmember Burgess.'",
        "'speaker_4': 'Thank you. I abstained in committee because of a couple of issues that were not yet resolved, and they have been in this version of the legislation. So I will be supporting the legislation.'",
        "'speaker_0': 'Thank very much. Any further comments? I have a few closing comments that I'd like to make. Again, Councilwoman Gonzalez, thank you for your leadership and for chairing this through the legislative process and for all of the improvements you've made to the legislation.'",
        "'speaker_0': 'We started began this conversation back in March 2015. Actually, Mark Barrett had prepared a memorandum for for us describing what was happening throughout this country in terms of racial profiling or biased policing and what we could sort of do about it.'",
        "'speaker_0': 'And I sort of asked then for sort of a best practices memo on how we can combat against the issue of unlawful bias policing. In July of 2016, at the Education, Equity and Governance Committee, the committee that I share, we had a discussion and then we followed that, of course, in August of 2016 on the Gender Equity'",
        "'speaker_0': 'Safe Communities New Americans Committee, chaired by Councilmember Gonzales. We presented the legislation at Councilmember Gonzalez Committee on February 8th, and of course, during this time there was a lot of moving parts, you know, that the police accountability and reform legislation that many council members and the executive and others have put a lot of, and the police department'",
        "'speaker_0': 'and community have put a lot of time. And I was I enacted on in May 22nd, 2017. And of course, this gets right to the heart of what, holding our police department accountable. And of course, we were ecstatic to have this voted out of committee on July 12th.'",
        "'speaker_0': 'And I mentioned that history to say this just didn't start just yesterday, that what we try to do is work with all communities on first recognizing that. Changing culture doesn't happen overnight, and to some extent you build building blocks.'",
        "'speaker_0': 'I think in order to change culture and that what this actually does, again, is after the monitor or the federal judge is no longer involved in the scrutiny of our police department, that this kind of commitment to bias free policing becomes part of our fabric here, part of our culture, and that we can monitor it and we'",
        "'speaker_0': 'can measure it and we can see what's happening out there in the field. It also does create a private cause of action for persons alleging that they are victims of bias policing because as an attorney, that did this kind of work.'",
        "'speaker_0': 'These are tough cases sometimes. And to simplify the process and even have a fee shifting or fee provision in there could possibly help many victims who have suffered nominal damage but still want some process by which to address the issue.'",
        "'speaker_0': 'Last the training piece. We can't say enough more about that. You know, I publicly said, I think all human beings are subject to some form of bias. And it's important, particularly for first responders and police officers, to understand their their bias.'",
        "'speaker_0': 'And together, we all learn as a city and learn as a department. And we make sure that we put practices in place to eliminate the kind of bias and the kind of bias a result, quite candidly, in not only unlawful steps, but unnecessary deaths.'",
        "'speaker_0': 'So I'm very pleased that we're passing this legislation, one of the few jurisdictions in the country to try to address this like this head on. And I'm very proud, again, that we have a city that has this kind of value.'",
        "'speaker_0': 'And I think that community advocates. I'd like to thank Asha, thank to Marion for her work on center staff and all of the people, Columbia Legal Services, ACLU, all the people that were involved in helping with this with this legislation.'",
        "'speaker_0': 'Your efforts are greatly appreciated. That any further comments from any of my colleagues before I call for the vote? If not, please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzales i. Herbold. I. JOHNSON Whereas I. O'Brien I. Bagshaw. Hi, Burgess. President Herrell. All right. Eight in favor, nine opposed.'",
        "'speaker_0': 'Thank you. The bill passed and chair of the Senate. Excellent. Please call the next agenda item. And I think we can go with three, four, three. I'm sorry. Just goal number three.'",
        "'speaker_1': 'Sure. The report of the Civil Rights, Utilities, Economic Development and Arts Committee Agenda Item three Appointment 0075 for the appointment of Carina Barragan as Member as Member Labor Standards Advisory Commission for a term to April 30th, 2019. The committee recommends the appointment be confirmed.'"
    ],
    "Ordinance on Arterial Asphalt and Concrete Program and Real Property Deeds for Street Purposes.": [
        "'speaker_1': 'The report of the Sustainability and Transportation Committee Agenda Item seven Council Bill 118958 an ordinance relating to the Arterial Asphalt and concrete program. The Committee recommends that both council pass the bill.'",
        "'speaker_4': 'Councilmember O'Brien ready this topic. It was my exciting moment. So this is a quick overview. We have nine pieces of legislation we're going to run through here in the next few minutes. These are all fairly straightforward administrative matters, although they're all of a slightly different nature.'",
        "'speaker_4': 'I spoke to these a bit at the briefing this morning, and I'll just give a high overview of each one. Colleagues, if you have any more clarifying questions, feel free to ask, and I'm happy to do my best to give you more details.'",
        "'speaker_4': 'This specific ordinance relates to a couple projects where the city installed curb ramps to install the curb ramp and meet our code and require the city to acquire small pieces of property because the sidewalk didn't go back far enough.'",
        "'speaker_4': 'So I believe a total of about nine square feet was acquired over two parcels. We paid for that land from the adjacent property owner and this is just the ordinance that has to come through city council for us to complete that transaction.'",
        "'speaker_0': 'Very good. Any further questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzalez I.'",
        "'speaker_1': 'Herbold, i.'",
        "'speaker_2': 'Johnson Whereas I.'",
        "'speaker_4': 'O'Brien I.'",
        "'speaker_2': 'Make sure. Burgess High President Harrell High eight in favor nine opposed.'"
    ],
    "Renewal of Pedestrian Skybridge Permit for Virginia Mason Medical Center.": [
        "'speaker_0': 'The bill passed in the Senate. Please read. Agenda item number eight in the short title, please.'",
        "'speaker_1': 'Agenda item eight Council Bill 11899991. An ordinance relating to a pedestrian skybridge over an across Seneca street west of Terry Avenue. The committee recommends the bill pass.'",
        "'speaker_0': 'That's wrong, Brian.'",
        "'speaker_4': 'So this is a renewal of a permit for Virginia Mason to operate a SkyBridge. So maybe where tunnels are SkyBridge is can operate in the city with permission, but they get a specific permit that needs to be renewed typically on a ten year period.'",
        "'speaker_4': 'Typically what we see is a 30 year, three, ten year permits before it has to come back to the full council to be reevaluated. So this is a renewal. It was actually up for renewal in 2015, but for a variety of reasons it didn't come to the council till this year.'",
        "'speaker_4': 'So we're a little two years behind. Was confirmed that Virginia mason continues to pay the appropriate fees for that based on the property value of the easement. I think that's about it on this one.'",
        "'speaker_0': 'Very good. Any further questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzalez i herbold i Johnson. Suarez All right. O'Brien High Bagshaw, Burgess High President Ara Adan favor and unopposed.'",
        "'speaker_0': 'Bill passed zero seven. Please read the next gen item in the short title.'"
    ],
    "Plaza Construction Permit for Bender Development LP and Bender Equities Inc.": [
        "'speaker_1': 'Agenda Item nine Council Bill 119006 An Ordinance Granting Binder Development, L.P. and Binder Equities Inc. Permission to construct, maintain and operate a plaza over and across East Howe Street, south of your place, east and west of Eastlake Avenue, east for a ten year term, renewable for two consecutive ten year terms.'",
        "'speaker_1': 'The committee recommends the bill pass.'",
        "'speaker_0': 'That's from Brian.'",
        "'speaker_4': 'This is related to a subterranean street vacation that the city granted in concept a few years ago to a project on Eastlake. The the property owner developed two buildings on adjacent sites but they crossed the the right away and would have been house street or that is how street subterranean they build one parking garage for both of'",
        "'speaker_4': 'those so they have they essentially have a vacation for the area below house street to allow the parking to function better than as opposed to building two separate parking structures. The project is now complete and has met the terms of our conditions.'",
        "'speaker_4': 'Just to remind folks what happened is that grade the the house right away maintains a is maintained is a 24 hour pass through between the two buildings. But it is kind of part of the plaza for those buildings.'",
        "'speaker_4': 'And so we are granting an easement to the property owner to maintain that property on behalf of the public on an ongoing basis. And so that's what this legislation does.'",
        "'speaker_0': 'Very good. Any questions? Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Gonzalez i. Herbold i. Johnson or s i.'",
        "'speaker_4': 'O'Brien II.'",
        "'speaker_2': 'Bagshaw Burgess, President Harrell. Eight In Favor nine oppose pasture senate.'"
    ],
    "Ordinance to Permit Bike Path 1, LLC to Use a Portion of Northeast 45th Street.": [
        "'speaker_0': 'Please read as an exigent item.'",
        "'speaker_1': 'Agenda item ten Council Bill 119007 An ordinance granting by Bike Path one LLC permission to operate and maintain a portion of an existing one storey commercial building on a portion of Northeast 45th Street, west of 38th Avenue, northeast.'",
        "'speaker_1': 'For a ten year term renewable for two successive ten year terms. The committee recommends the bill pass.'",
        "'speaker_0': 'Customer from Brian.'",
        "'speaker_4': 'Yes, this is an interesting one. This is a property situated somewhere between University Village and Children's Hospital on Northeast 45th Street. It's on the northeast sorry, the south side of Northeast 45th Street, essentially across from the Gilman Trail.'",
        "'speaker_4': 'This property was built, I believe, in the the building on there was constructed, I believe, in 1959, recently changed ownership hands. And somewhere in the process, I believe the new owner came in to the city and it was reviewed and it appears it was discovered that the original building was actually built in part over public right away'",
        "'speaker_4': '. And so there's a couple of options there. The city could require the building to be the portion that's on public right of way to be torn down. The city determined that it had no immediate need for that right away.'",
        "'speaker_4': 'So instead we agreed to lease the new building, honor the public right away where the property is and has been standing for over 50 years. As the title says, this could be up to 230 years to ten year terms, but the city does retain the right to terminate this.'",
        "'speaker_4': 'If at some point it finds it needs that right away. There's also a bond required with this so that that bond would cover the cost of reconstruction of the building to remove the portion that is in the public right away.'",
        "'speaker_4': 'If the city on short notice needed to reclaim that.'",
        "'speaker_0': 'Or get any further comments. These got the roll on the passage of the bill.'",
        "'speaker_2': 'Gonzalez i herbold i Johnson was i o'brien. I beg Sean Burgess, President Harrell I aid in favor and unopposed.'",
        "'speaker_0': 'Bill passed the chair will sign it. Please read the next agenda item short title.'"
    ],
    "Amendment of Legal Description for Fremont Dock Co. Permit.": [
        "'speaker_1': 'Agenda Item 11 Council Bill 119009 An ordinance relating to the permission granted to Fremont, accompanied by ordinance 121706 to use and occupy a portion of Fremont Avenue North under the Fremont Bridge North approach, lying north of the Lake Washington ship canal and south of the former Burlington Northern Main Line.'",
        "'speaker_1': 'Right of way. The committee recommends the bill pass.'",
        "'speaker_4': 'Brian Councilmember Biggs, I just come in there. We're having fun today. Yes. This is some of the exciting parts of the transportation work this relates to if you're familiar with where Adobe in. Google are adjacent to the Fremont Bridge on the north side of the bridge and where the Burkman Trail Press is under the Fremont Bridge.'",
        "'speaker_4': 'It's a parcel underneath the bridge approach there. As I mentioned earlier, this this same work came before the council a few years back. For some variety of reasons. The council approved it at the time, but the legislation was never or what we authorized never actually was filed in the appropriate way before it expired.'",
        "'speaker_4': 'I believe it had to do with an attorney that was working for Fremont Company that retired, and it got buried in a piece of paper, in a stack of paper that no one else picked up. What specifically is happening is the city owns the right of way under the approach there.'",
        "'speaker_4': 'If you go on the Berkman, you'll see that there's actually parking down there, which is operated by Fremont Bridge Company through my company. Fremont DOT Company owns properties adjacent to that and the city requires easement to get to its property.'",
        "'speaker_4': 'So there was a trade that was made where Fremont, our company, would allow the city to have access to our property through their property in exchange for Fremont, our company being allowed to operate the parking underneath that. As I mentioned, this was agreed to a number of years ago, but it was never finalized.'",
        "'speaker_4': 'And so this will take this up once again and hopefully will get finalized appropriately.'",
        "'speaker_0': 'Very good. Any questions, please? Got the roll on the passage of the bill.'",
        "'speaker_2': 'Gonzalez Herbold High Johnson whereas O'Brian High Bagshaw Burgess I President Harrell Aiden Favorite Unopposed.'",
        "'speaker_0': 'Person Chair Assignment. Please read the next gen item in the short title.'"
    ],
    "Acquisition of Real Property from Highpoint Natural Drainage Landscape for Transportation Purposes.": [
        "'speaker_1': 'Agenda Item 12 Council Bill 119011 An ordinance relating to the Department of Transportation. The committee recommends a bill pass this round.'",
        "'speaker_0': 'Brian.'",
        "'speaker_4': 'Thank you. So this is a property that we are is being granted back to the city from Seattle Housing Authority in 2000 for 2000 for the city owned stairway on Southwest Grand Street was vacated in connection with the Seattle Housing Authorities High Point Redevelopment Project.'",
        "'speaker_4': 'We basically handed over the parcel to Seattle Housing Authority for them to maintain and have responsibility for the they have done that through now through this through today. But FHA no longer has the funding to maintain that stairway.'",
        "'speaker_4': 'So they are granting it back to the city for it to be part of our portfolio. Councilmember Herbold mentioned the desire to go walk those stairs. I don't know if you managed to do that between then and now.'",
        "'speaker_1': 'My interest is primarily the sea acquisition. We convey it whether or not the stairs are still maintained to the the condition that there currently are.'",
        "'speaker_4': 'Yeah. And we asked that question at committee and we're told that the the condition of the facility is up to the standards of what the city would be maintaining it to. But I have not seen it personally.'",
        "'speaker_0': 'Triggered any further comments. Please call the rule on the passage of the Bill Gonzalez.'",
        "'speaker_2': 'I herbold. I. Johnson I was i.'",
        "'speaker_4': 'O'Brien High.'",
        "'speaker_2': 'Extra. Burgess President Herrell Rite Aid in favor and unopposed passage senate.'",
        "'speaker_0': 'Please read the next gen item in the short title.'"
    ],
    "Ordinance to Accept Deeds and Establish Rights-of-Way for Various Streets and Alleys.": [
        "'speaker_1': 'Agenda Item 13 Council Bill 119012 An ordinance accepting various deeds for street or alley purposes. The committee recommends the bill pass.'",
        "'speaker_0': 'Concerning O'Brien.'",
        "'speaker_4': 'Titled Read Please.'",
        "'speaker_0': 'See Catherine O'Brien.'",
        "'speaker_4': 'I was going to say that I am so glad that we have this whole short title thing that we didn't have when I started on the council because these next three would be so much fun for our clerks.'",
        "'speaker_4': 'These next three ordinances are quite perfunctory. They've come. It's a type of ordinance that has come before us a number of times. The process of construction in the city periodically, certain construction or projects either are required to grant the city property back so that we have access to right away as utilities or in some cases an easement'",
        "'speaker_4': '. This and then we all those actions require city council approval. Our policy is that once 20 of these projects have happened to bundle those in a single ordinance so that we're not doing one offs. This specific ordinance before us is agenda item is tow deeds for street or alley purposes that that are part of that that type'",
        "'speaker_4': 'of scenario. The next one is another tow deeds for the next batch and then the final one will be 20 easements.'",
        "'speaker_0': 'Thank you very much for the comments. Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzalez Herbold High. Johnson Suarez O'Brien High Bagshaw High. Burgess High. President Harrell eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed and Chair of Senate. Please read the next edition item in the short title.'",
        "'speaker_1': 'Agenda Item 13 Council Bill 119012 An ordinance exempting various deeds for street or alley purposes.'",
        "'speaker_0': 'Brian.'",
        "'speaker_4': 'I have nothing further to add to this, which is similar to the last audience.'",
        "'speaker_0': 'Any further questions? Please call the rule on the passage of the bill.'",
        "'speaker_1': 'Gonzalez I.'",
        "'speaker_2': 'Herbold. Johnson. Whereas I. O'Brien. I make sure. Burgess. President Harrell. Eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed the Senate. Please read the short title of the next agenda item.'",
        "'speaker_1': 'Agenda Item 14 Council Bill 119003 An ordinance exempting various deeds for street or alley purposes. The committee recommends the bill pass.'",
        "'speaker_0': 'As around Bryan.'",
        "'speaker_4': 'This is similar to the last two. The distinction being that these are easements as opposed to deeded land.'",
        "'speaker_0': 'Very good. Any comments? Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Gonzalez I herbold. Johnson was I. O'Brien Bagshaw.'",
        "'speaker_4': 'Burgess High.'",
        "'speaker_2': 'President. Harrell High eight in favor and unopposed.'",
        "'speaker_0': 'Bill Parson sure will sign it. Was that number 15? No, please. Religion item number 15. Short title.'",
        "'speaker_1': 'Agenda Item 15 Council Bill 119014 and or accepting 20 limited purpose easements for public sidewalks, street access, alley and alley turnaround purposes.'",
        "'speaker_0': 'Okay, just one moment, Madam Clerk. Councilman Brian thought, and I assume that last one was number 15 because that was the easements. I actually thought you might have called 13 twice, but. But let's. Okay. What are your notes say I should do right now?'",
        "'speaker_0': 'I need to make. Okay. Okay. So we're going to reread agenda item number 14, I think, is what you're saying.'",
        "'speaker_1': 'Yes. Okay.'",
        "'speaker_0': 'Very good.'",
        "'speaker_1': 'Agenda item 14 Council Bill 119013 and ordinance excepting various deeds for street or alley purposes.'",
        "'speaker_0': 'Councilmember Brian.'",
        "'speaker_4': 'Right. So this will be 20 needs we're accepting as part of construction that we talked about earlier. Okay.'",
        "'speaker_0': 'Any further comments. Please call the role on the parts of the bill.'",
        "'speaker_2': 'Gonzalez I Herbold High Johnson whereas O'Brien High Bagshaw Burgess High President Harrell eight in favor and unopposed.'",
        "'speaker_0': 'The bill passed in show sign it and should we do 15 over again just to make sure we're complete? So please read the short title of a united number 15.'",
        "'speaker_1': 'Agenda Item 15 Council Bill 119014. An ordinance accepting 20 limited purpose easements for public sidewalks, street access, alley and alley turnaround purposes. The committee recommends the bill pass.'",
        "'speaker_4': 'Catherine O'Brien Again, this is a similar ordinance to the previous two, but this is for easements as opposed to deeds owning the land.'",
        "'speaker_0': 'Very good. Any comments? Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Gonzalez.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herbold. Hi. Johnson. Suarez.'",
        "'speaker_4': 'O'Brien, I.'",
        "'speaker_2': 'Beg Sean Burgess. Hi. President Harrell. Eight in favor and oppose.'",
        "'speaker_0': 'The bill passed in the show. Sign it. Apologize for the confusion. I can imagine how we got those confused. Is there anything further business coming for the council that completes our agenda?'",
        "'speaker_4': 'Councilmember Burgess I move to be excused on Tuesday, September five.'",
        "'speaker_0': 'Session two moved in second and that Councilman Burgess be excused for September 5th. All those in favor say I. I oppose. The ayes have it. Any further business from the council? With that we stand and journey. Everyone, have a great afternoon.'",
        "'speaker_3': 'Thank you.'"
    ]
}