{
    "Lease Agreement with Africatown Community Land Trust for former Fire Station 6.": [
        "'speaker_0': 'Thank you. Bill passes and the chair will sign it. Will the court please affixed my signature to the legislation committee reports of the City Council. Item one Will the clerk please read item one into the record? And then one counts.'",
        "'speaker_0': 'About 119905 fell into the lease of city property authorizing the Director of Finance, Administrative Services or the directors designee to execute a 99 year lease agreement with Africa. Town Community Land Trust for Former Fire Station six, located at 101 23rd Avenue.'",
        "'speaker_0': 'Seattle, Washington. 981224. The use as the William GROSS Center for Cultural Innovation to provide for culturally responsive services, to support the African American community and the central area, to create pathways to self-determination and for future development and expanded activation of the property as described in the lease.'",
        "'speaker_0': 'Thank you, Madam Clerk. I need to pass Council Bill 119905. Is there a second? Second? It's been moved and seconded to pass the bill. Member must get it. You are the sponsor of this bill and are recognized in order to address this item.'",
        "'speaker_0': 'Thank you very much, Madam President. I really am excited about this and the next item on our agenda today. This legislation and the following one come to the Council after many years of advocacy from members in the community.'",
        "'speaker_0': 'We recognize the long wait that these organizations have gone through and their strong advocacy and their continued commitment to making sure that the plans for these two areas and these two sites continue to move forward. We both through this council and previous councils, have worked with them and and helped to advance this legislation in front of us'",
        "'speaker_0': ', recognizing the opportunity that this place provides for us to create a true community space. We do recognize that during budget deliberations, we don't often take up additional pieces of legislation. But given the long wait that these organizations have gone through, it's an incredible opportunity and privilege for us to be able to move this forward today.'",
        "'speaker_0': 'I want to thank the council president who's been working with us to carve out time during both the council briefing to make sure that both pieces of legislation had the time and the opportunity to provide the historical context to it, and also to make sure that we got these items added to the agenda.'",
        "'speaker_0': 'This is an incredibly important opportunity for us to both highlight the work that's gone into these efforts, but also to have public recognition for the long advocacy that it took to get here. Last week, we heard from representatives from Africa, town, community, land trusts one worry from flourish financial and please come again about what this site will'",
        "'speaker_0': 'mean, particularly for black youth in the neighborhood named after the entrepreneur, the building developer of the site of the Central District, William GROSS. This center would invest in education, skills and job opportunities for community members, particularly youth serving as a hub for innovation already taking place in the Central District.'",
        "'speaker_0': 'This community asset will help close the gap we are already seeing in Seattle where there is an astronomical economic growth that is not resulting in all communities benefiting. In fact, economic disparities have grown, particularly in Seattle's black, indigenous and people of color communities.'",
        "'speaker_0': 'The opportunity to provide support through Africa, town, community, land trust. And from this former site, which was Fire Station six for the use of William Grove Center for Cultural Innovation, couldn't come fast enough and really excited about the vote today.'",
        "'speaker_0': 'Thank you, Councilmember Muscat, for those comments. And I see that comes more. Salon also has her hands up. And colleagues, for those of you who may also want to make comments, please do let me know because first one, please.'",
        "'speaker_4': 'Thank you, President Gonzalez. I am, of course, very happy to be voting yes on this and finally voting on the legislation, leasing the former fire station six to Africa down. Community organizers have been demanding this for years and this legislation has long been overdue.'",
        "'speaker_4': 'In a sense, today we are celebrating the property transfers of the former fire station six and in the upcoming item, the central into community control. After years of organizing and the efforts of hundreds of community members. And at the same time, we have to ask why does it take years?'",
        "'speaker_4': 'And in the case of the central over a decade to get a central single building into. Permanent community needs. Why did the mayor said on this legislation for almost three years of our term and why did she finally agreed to move on it now?'",
        "'speaker_4': 'Ultimately, I believe that we would not have had this legislation in front of us had it not been for the tremendous impact of the Justice for George Floyd movement all around the world, tens of millions of people took to the streets in multiracial protests against police violence.'",
        "'speaker_4': 'In fact, just in the United States, we had over 26 million show up. But also in opposition to the crushing neglect and underinvestment in our black and brown communities by the political establishment in cities around the country and around the country, the political establishment have, under the pressure of that movement, conceded real community investment, which is a'",
        "'speaker_4': 'victory for the movement even, and however small they are very important nonetheless. But at the end of the day, the political establishment is not conceded. It's power in any real sense in city after city. The police have not been defunded by 50%.'",
        "'speaker_4': 'Or do you find it at all? In reality, although some small changes have been made in different cities, which is also important. But they but we have not seen the scale of affordable housing that our community needs, communities need.'",
        "'speaker_4': 'And what we see is political establishments making the smallest investments that they can get away with in the face of community pressure. It is excellent that these property transfers are going through. It's a testament to the organizing of Africa Down and the Black Lives Matter movement as a whole.'",
        "'speaker_4': 'And while welcoming this development, we also should remember that Africa donors proposed to develop a whole city block in the heart of the Central District, at the site of the former Cairo Center, to provide a full square block of affordable housing to help prevent and reverse the displacement of working class black people from the central area.'",
        "'speaker_4': 'And as of now, only Councilmember Morales has supported the amendment from my office to the budget amendment from my office to make sure that this project is fully funded by the city. And I really urge all council members to support this because it should not take another five, ten or 15 years for them to win that project'",
        "'speaker_4': 'as well, because we know that affordable housing is in dire crisis and whatever investments we can make this year, we should make them, especially in the face of the pandemic. So again, I'm happy to vote yes and will continue to support African Downs community development in the budget vote later this month.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_0': 'Thank you, Councilmember Salon. Any other comments on the bill? A hearing and seeing none. Will the court please call the role on the passage of the Bill Herbold. Yes.'",
        "'speaker_1': 'Juarez. Hi, Louis.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Morales. Yes. Mosquera.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'Sergeant. Strauss. Yes. President Gonzalez.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Nine in favor. None opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation? Item number two Will the court please read agenda item two into the record? Agenda Item two.'"
    ],
    "Property Transfer to Central Area Senior Center.": [
        "'speaker_1': 'Countable.'",
        "'speaker_0': '119906 relating to the transfer of city property located at 530th Avenue, South Seattle, Washington. Authorizing the conveyance of the property to Central Area Senior Center of Washington nonprofit corporation, consistent with the intent of Resolution 31856m to provide for the continued delivery of social services.'",
        "'speaker_0': 'Making findings of facts of the consideration for the transfer superseding resolution 31837. For the purposes of this ordinance of upgrading the Director of Finance, Administrative Services or designee to execute and deliver documents necessary to carry out the convenience of such property on the terms and conditions of this ordinance.'",
        "'speaker_0': 'That was a mouthful. Thank you, Amelia, for reading that title into the record. I will move to pass Council Bill 119906. Is there a second back up? Thank you. It's been moved and seconded to pass the bill. Councilmember said you are the sponsor of this bill as well and are recognized in order to address this item.'",
        "'speaker_0': 'Thank you. Thank you very much, Madam President. This ordinance, well, the short title is that it would authorize the transfer to the Central Area Senior Center, the property at 530th Avenue for the continued delivery of social services. So this is the senior center folks who have been for a long time advocating to have the ability to have'",
        "'speaker_0': 'the reins and be able to continue to invest in the community and provide the critical services that they offer. So a very diverse group of seniors, mostly in the black community, and really excited again about this piece of legislation.'",
        "'speaker_0': 'Council members will recall that last month we passed legislation transferring the birth of our place property to the organization. This transfer follows up on that as mutual offsetting benefits sites that have been occupied by community organizations for decades.'",
        "'speaker_0': 'And the city has been in the process of transferring to community organizations since the Nichols administration in late 2018. The council then passed a resolution asking the executive to ensure that the transfer of the properties that have a mutual and offsetting benefits lease to the organizations currently residing in those facilities be accomplished no later than March of'",
        "'speaker_0': '2019. And as we talked about last week, here we are October 2020. It's been a long process to get here, but we are here and we are celebrating. Over the last couple of years, the central area senior center has been in negotiations with an interdepartmental team and the mayor's office on this transfer.'",
        "'speaker_0': 'And we know that this process has not exactly went straight forward and the goalposts seem to have been moved at various points along the way. But we're excited to be able to join with them in applauding this effort today, applaud the organization for hanging in there and their continue to push to make sure that this transfer actually'",
        "'speaker_0': 'happens. The Central Area Senior Center has been providing vital services in the community for over 50 years, and their mission is to celebrate and serve all seniors, especially those of African-American and African immigrant backgrounds that live in King County.'",
        "'speaker_0': 'Last Monday, we heard about all of the great work of the organization and how this transfer one will ensure that they're able to continue this work into the future and this transfer of one able the senior center to modernize the building to accommodate for even more programs, redesign the interior, update the systems and parking, and reflect the'",
        "'speaker_0': 'rich, historical and cultural significant heritage associated with the central mission as associated with the center's mission, founding and vision. So we're excited about this legislation today. And congratulations again. Thank you. Council members get it? Are there any additional comments?'",
        "'speaker_0': 'Council members want, please.'",
        "'speaker_4': 'Thank you. President Gonzalez and I join Councilmember Mosquito in congratulating the community members who have for a decade, for over a decade, advocated for the central area senior center property to be transferred to the community organizations to be retained fully for public use.'",
        "'speaker_4': 'They have struggled through years of city hall inertia and opposition to make this happen. Just to add a few points about what the seniors did to achieve the success. On April 23rd, 2019, a nearly 100 seniors rallied at City Hall alongside Africa Town Community Land Trust and many other community members that were there supporting them.'",
        "'speaker_4': 'At a rally in City Hall, in the lobby and alongside my office, and many of them were enthusiastically chanting, no more delays in reference to Mayor Dawkins, stop continued stalling. And I wanted to also once again thank Diane Ferguson and others for their leadership of this community effort.'",
        "'speaker_4': 'Right after the rally, the day the seniors attended the Council Committee meeting, chaired by my office to hear our resolution calling on the mayor to move forward with the property transfers. And after that, the seniors along with. Staff from my office deliver dozens of letters directly to the mayor's office, calling for the transfer of the central and'",
        "'speaker_4': 'board place to community control so that the services can be run permanently for public benefit, run by the community and to everyone, regardless of income. Then in the week following, more than 250 other community members who also wrote letters to the mayor calling for the transparent preservation of the centers, it would it may seem like this property'",
        "'speaker_4': 'transfer would not make a material difference between a property owned by the city of Seattle, rented at no cost to the Central Area Senior Center, which has been the case in the past, and transferring ownership to the Seattle area Central Area Senior Center.'",
        "'speaker_4': 'However, it does make one important difference. This property transfer protects the central from the possibility of valuable land under their feet being sold out from under their feet whenever the political establishment might want to raise funds that way, rather than looking for raising progressive revenues.'",
        "'speaker_4': 'And this is very important, especially given the prime location that the central is located at. Anybody who has visited the central area senior center will know exactly what I'm talking about. It is an incredible location with unbelievable views.'",
        "'speaker_4': 'And no doubt many corporate developers have had their eye on it and must not forget that the Mercer Mega BLOCK sale at the end of 2019 was accepted by community organizations. Only because the block and generate I'm sorry, the money it generated was promised to go to affordable housing and to stop displacement, a promise that unfortunately the'",
        "'speaker_4': 'mayor has once again let down the community on in our proposed budget. The Central provides an incalculable service to the seniors in the Central District, which is my neighborhood, and I'm delighted to vote in favor of this legislation, transferring the senior center permanently to the community thinking.'",
        "'speaker_0': 'Thank you, Councilmember Solondz. Any other comments on the bill? Councilmember Herbold, please. Thank you so much. And thank you both to Councilmember Mascara and so on for sharing the. Not not not necessarily going all the way back on the history on this, but at least the recent history.'",
        "'speaker_0': 'I really appreciate reading into the record elements from the resolution that the Council passed in 2018. I worked with Councilmember O'Brien on that resolution, as I know many of us on the council did, and that was a resolution that we took action on because of the community frustration on on the lack of progress on the disposition of'",
        "'speaker_0': 'these properties over the years. I do have a question. I don't know if council member Muscat or you might know, given your role as chair of the committee or if the District Council member might know. But I'm wondering what the status of the Greenwood Senior Center that is one of the three properties that we lifted in the'",
        "'speaker_0': '2018 resolution as as properties that had gone through many iterations under many mayors. And those three properties of, I think, seven or eight different are mutually offsetting benefit. These properties had been identified as sort of ready to go, had been been reviewed extensively about whether or not they would be appropriate to to use as land to develop'",
        "'speaker_0': 'housing instead. And just just wondering what the status is on on that one, because it is the last one of the three that we identified in the 2018 resolution as priorities. Eagles council member Herbold for those comments and for the question related to their goal is at the Greenwood Community Center.'",
        "'speaker_0': 'Oak Greenwood Senior Center, a Greenwood Senior Center. Thank you so much. So I'm just going to open it up here for either the district representative or the good chair of our housing committee who might have some additional information on that related issue.'",
        "'speaker_0': 'So, Councilman Mosquito, do you have anything or does the district representative have anything on this? I am happy to defer to the district representative and also we'll be looking into it on our hands as well. And always, of course, the Greenwood area kind of depends on what side of Greenwood you're on is it determines your district rep'",
        "'speaker_0': '. But I think Councilmember Strauss is off mute, so perhaps he has some information or insight on this particular issue.'",
        "'speaker_3': 'I believe that is in District six. That would be right in my district. And I know having spoken with Miller on, we had resolved any outstanding questions at this time, although not having this on the docket for today, I did not prepare my notes and unfortunately, I did not get a response from him in these last 30'",
        "'speaker_3': 'seconds. So I believe that the issue is resolved. Councilmember Herbold, we will follow up if that is not the case.'",
        "'speaker_0': 'Really appreciate it. Thank you so much. That's great. Thank you so much. Of course, we are always looking for opportunities to identify additional, you know, additional projects where we can replicate some of this good work. And so look forward to getting an update from council central staff when they have the capacity to do so.'",
        "'speaker_0': 'And certainly from Councilmember Strauss, if he learned some information from consultation with the staff, really appreciate the question. Any other comments on this bill? K hearing? None. Will the clerk please call the role on the passage of the Bill Herbold.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Juarez. Yes. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Macheda.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Petersen.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Nine in favor. None opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes and the chair will sign it. Well, the clerk please affix my signature to the legislation. Okay. Items three through 21. Will the clerk please read items three through 21 into the record?'"
    ]
}