{
    "Collective Bargaining Agreement between the City and the Seattle Police Management Association.": [
        "'speaker_1': 'The report of the City Council Agenda Item one Council Bill 120332 An ordinance relating to city employment authorizing the execution of the collective bargaining agreement between the City of Seattle and the Seattle Police Management Association. This is active January 1st, 2020 through December 31st, 2023.'",
        "'speaker_0': 'Thank you. A move to pass Council Bill 120332. Is there a second? Okay. Thank you. It's been moved and seconded to pass the bill. Sponsor of this item. I will address it and then I'll open the floor to comments.'",
        "'speaker_0': 'Last week, at the request of our Public Safety Committee Chair, Councilmember Herbold, we delayed a vote on the Seattle Police Management Collective Bargaining Agreement by one week. Today, the SPM. The collective bargaining agreement will be considered for a vote.'",
        "'speaker_0': 'As you may recall, the SPM collective bargaining agreement was referred directly to full council. It was not considered at the committee level. The council received a one hour informational briefing presentation I'm sorry, on Council Bill 120332 by our Council central staff and lead negotiators an open public session on Monday, June six at Council Briefing.'",
        "'speaker_0': 'This collective bargaining agreement came to the Council at the conclusion of likely lengthy, focused negotiations between the Seattle Police Management Association and the City of Seattle. It's council president. I sponsored it to ensure it's timely consideration in full council and due respect for this lengthy negotiation process.'",
        "'speaker_0': 'The Council has the option to accept or reject, but not to amend the collective bargaining agreement, which is why per protocol they are they are sent they are sent straight to full council and not sent to committee for review.'",
        "'speaker_0': 'So basically we did not go to full council or I'm sorry, a committee came to full council because it's collective bargaining agreement. Council Bill 120332 would authorize the mayor to implement a collective bargaining agreement between the City of Seattle and the Seattle Police Management Association, the SPM.'",
        "'speaker_0': 'The collective bargaining agreement is a four year agreement on wages, benefits, hours and other working conditions covering the period January 1st, 2020 through December 31st, 2023, and affecting approximately 80 regularly appointed city employees. Greg Doss, The council's central staff, outlined key elements of the agreement in a memo provided to council members and was posted online and made'",
        "'speaker_0': 'obviously made available to the public on Friday, June 3rd. In summary analysis of SPM contract has been presented in writing and in a presentation publicly with the opportunity for council members to ask questions and receive answers. Before we move on, what I'll do is I'd like to hand it off to the chair, the Public Safety and Human'",
        "'speaker_0': 'Services Councilmember Herbold, if she'd like to provide some comments from her.'",
        "'speaker_1': 'So I really appreciate it and appreciate the delay last week and just a little bit more detail about that process. There are two labor unions that represent Seattle police officers, one in the Seattle Police Management Association and the other being the Seattle Police Officers Guild.'",
        "'speaker_1': 'Fogg represents officers and sergeants and subpoena represents captains and lieutenants contract. In addition to salary increases, increases includes several advances in accountability arising from each 2017 accountability legislation issues that in 2019 overseeing the consent decree highlighted as a basis for noncompliance regarding discipline and appeals issues identified by the CPC, the three Police Commission in their November 2019'",
        "'speaker_1': 'letter, including inclusion of the standard for Evidence in discipline review addressing the 180 day timeline problems. Removing the requirement that intentionality must be proven in dishonesty charges. Allowing OC to play a role in criminal investigations. Retaining personnel files six years after an officer is no longer employed by the city and new issues raised by Accountability Partners OC'",
        "'speaker_1': ', OIG and see the beginning of negotiations. APS The most important change covered in this in this particular agreement is in discipline review. Seattle's current arbitration system is broken. It's one of the main reasons a federal judge found the Seattle Police Department out of compliance with the consent decree in 2019 to a ruling an arbitrator regarding.'",
        "'speaker_1': 'In statement, an officer fired former chief for striking a woman who was handcuffed a currently 93 open appeals according to okay. Some of them involve complaints filed as far back as 2016. This new agreement creates a new discipline review system that marks a sea change in how disciplinary bills will operate.'",
        "'speaker_1': 'Help slow that backlog from growing even more by ensuring cases aren't being entirely relitigated during arbitration as they currently are. What's called De Novo.'",
        "'speaker_0': 'Review.'",
        "'speaker_1': 'Will also ensure that arbitrators who are generally not experts on saying don't substitute for judgment or the police chiefs undermining accountability, as happened in the Adly Shepherd case and recently with a parking enforcement officer who made a comment about lynching and was reinstated by an arbitrator.'",
        "'speaker_1': 'New system, as recommended by the CPC and the 2017 Accountability Legislation, establishes a standard for evidence rather than a higher standard of clear and convincing it is used. The new system will also prohibit hearing of new facts related to the Office of Accountability Investigation unless the new facts were not discoverable at time of chief decision and that'",
        "'speaker_1': 'reasonably expect expected to change that decision. Another important improvement is that the proposed ESTIM contract removes restrictions on the ability of OPA. Assign civilian investigators to certain tasks, allowing the okay to make assignments based on the skills and abilities of the investigator rather than whether or not they are civilian or a uniformed sergeant.'",
        "'speaker_1': 'Language in the contract limits the number of civilian investigators that can work at OPM. This change to the SPM agreement now might address that limitation in the contract. There are improvements include, as we heard in public comment, subpoenas.'",
        "'speaker_1': 'The 2017 Accountability Legislation Establish the Authority, the Office of Police Accountability and the Inspector General PMA and Smog Objective. Because there is no process identified. I proposed legislation in a council adopt a process last year. Consequently, the SPM contract is now silent on the top means that subpoena power, as passed by the Council in 2021, is unimpeded'",
        "'speaker_1': 'by the contract and goes to effect as PMA member's contract also removes the Commission on OPA from coordinating an investigation and states that he will not conduct a criminal investigation, a make communicate with criminal investigators and prosecutors about the status.'",
        "'speaker_0': 'Of.'",
        "'speaker_1': 'A criminal investigation as it relates to the 180 day clock. The contract, this is a pause on 188 a o'clock whenever a criminal investigation is contracted, regardless where the alleged criminal activity occurred, or what agency is conducting the investigation.'",
        "'speaker_1': 'And very importantly, the contract also means the definition of dishonesty. The intent of the definition is made clear by removing intentionally and injuring the facts that are material to the allegation, immaterial flat facts. And then lastly, I just want to note in response to Agnes governance question in public comment today, I just wanted to note that I'",
        "'speaker_1': 'don't Colleen responded, and we have an email from him saying that Otto is competent. The sentence in the Bill of Rights section of the agreement reference will not limit new discipline, review.'",
        "'speaker_0': 'Process.'",
        "'speaker_1': 'Or restrict disciplinary actions taken by the chief under the new process. Because again, that that sentence only is only tied to the Bill of Rights and not tied to the new re process. And so with that, that's my my attempt at a quick overview at the important reforms in this contract.'",
        "'speaker_1': 'And I do join me in supporting this contract with your vote. Thank you.'",
        "'speaker_0': 'Thank you. Councilor Herbold, I know that you're wrapping up months of not maybe over a year of negotiations, but I stand corrected if I'm wrong on that. But this has been going on quite a while. Council members to anyone, have any other comments before we move to go to a vote with any would like to say.'",
        "'speaker_0': 'Councilmember Morales please. Thank you. I will be relatively brief. I do think it's important to say that this negotiated agreement makes some important changes regarding the management of police misconduct proceedings. This agreement doesn't eliminate arbitration, which is something that the city has been working on for a while.'",
        "'speaker_0': 'And I personally would like to see us get there. But it does place greater restrictions on the arbitration process. It eliminates the ability of officers to bring new evidence or witnesses to a misconduct proceeding. As Councilmember Herbold said, it would have it would require an arbitrator to uphold chief's discipline rather than overturning it.'",
        "'speaker_0': 'And it lowers the bar for evidence of misconduct, which is a key change for reaching a disciplined decision. I think there are important elements in this agreement, even if it doesn't get us all the way to where I think we need to be.'",
        "'speaker_0': 'And perhaps most importantly, it sets a precedent for the entire department about discipline, review, officer liability and accountability for officer misconduct. All things that I know we will continue to talk about as we go into the smog contract negotiation.'",
        "'speaker_0': 'So for that, those reasons, I will be supporting this agreement. Thank you. Are there any other comments? All right. Not seeing any. Madam Clerk, will you please call the roll on the passage of the bill?'",
        "'speaker_1': 'That's a member monogamous council member must get that i. Councilmember Nelson, i. Councilmember Petersen.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilmember Strouse.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Council Member Herbold. Yes. Council member Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'And Council President Fortis.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'That is eight present and opposed to excuse me in favor of another post.'",
        "'speaker_0': 'Thank you. The bill passes. The chair will sign it. And then can you please affix my signature to the bill? Thank you. Moving on to the Finance and Housing Committee. I see Kessler ROSQUETA has something on the calendar today.'",
        "'speaker_0': 'Madam Clerk, will you please read item two into the record?'"
    ],
    "Grant Acceptance and Budget Amendments for Planning and Construction Departments.": [
        "'speaker_1': 'The Report of the Land Use Committee Agenda Item three Council Bill 120339. An ordinance relating to grant funds from non city sources authorizing the Directors of the Office of Planning and Community Development and the Seattle Department of Construction and Inspections.'",
        "'speaker_1': 'To accept a grant and execute related agreements, the committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. Jasper Strauss.'",
        "'speaker_2': 'I thank you, Council President and happy to switch back seats if you want and nothing else will. One 2339 As Trinidad accepts grant funding on behalf of both Seattle Department of Construction Inspections and Office of Planning and Community Development for over $250,000 accepted for the State of Washington.'",
        "'speaker_2': 'From the State of Washington for planning around transit oriented development around 1/30 and 1/30 stations. Nice working getting that 1/30 station in their council president. This grant is part of a $2.5 million legislative allocation in 2021 to help cities facilitate the first ECI of $50,730 7000 $30 grant is being accepted for showing match plan mitigation planning.'",
        "'speaker_2': 'This funding will be specifically allowing CCI to complete final modeling for the Habitat Evaluation Procedures Program. Thank you. Council President.'",
        "'speaker_0': 'Thank you. Councilmember Strauss. That's how they roll up the D5 two light rails, little mess around. Okay with that, does anyone have any other comments or remarks for Councilmember Strauss? Okay. So before we close out, is there anything else you want to add, Councilmember Strauss, before we go to a vote?'",
        "'speaker_2': 'No. Just hoping to have light on board one day.'",
        "'speaker_0': 'Yeah, well, rubber lamp. So let's move on. Will the. Well, the clerk plans to rule on the passage of the bill.'",
        "'speaker_1': 'Councilmember Morales.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember Mosqueda. Councilmember Nelson, I. Councilmember Peterson.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilmember Strouse.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'And Council President.'",
        "'speaker_0': 'Maurice High.'",
        "'speaker_1': 'Eight in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes. The chair will sign it. And Madam Clerk, will you please affix my signature to the legislation? Moving on to item number four. Councilmember Strauss, it's you again. But anyway. Clerk Will you please read the short title for the record?'"
    ],
    "Update Rooftop Feature Regulations in Land Use and Zoning Code.": [
        "'speaker_1': 'Agenda Item four Council Bill 120287 An ordinance relating to land use and zoning, updating regulations for rooftop features and amending sections of the Seattle Municipal Code. The committee recommends the bill passed as amended.'",
        "'speaker_0': 'Councilmember Strauss.'",
        "'speaker_2': 'Thank you. As Clerk, Schwinn stated, this is a comfortable one 2287 Updating Regulations for rooftop features. This legislation updates regulations for equipment and features on the rooftops of buildings. Last year, we adopted the strongest energy code in the nation for new buildings.'",
        "'speaker_2': 'And to comply with these new regulations, we do require new mechanical equipment, and these regulations make it easier to accomplish. So the new energy code requires more ASP aspects and features equipment on the roofs. The legislation before us today makes it easier to accommodate the needed equipment on rooftops.'",
        "'speaker_2': 'The legislation before us today also updates regulations specific to Pioneer Square in Chinatown International District to provide more flexibility for rooftop amenities, including rooftop bars, restaurants in certain circumstances in Pioneer Square and to allow for faster elevators because we're allowing folks to build higher.'",
        "'speaker_2': 'In committee, we adopted two amendments one technical corrections to the legislation and the other changes to rooftop requirements in certain zones in Chinatown International District to align with requirements for other high rise zones in the city. Elevators in which I just referenced Council president colleagues.'",
        "'speaker_2': 'That is the committee report.'",
        "'speaker_0': 'Thank you. Councilmember Strauss, are there any comments for my colleagues, for Councilmember Strauss before we move to a vote? Not seeing any councilmember strauss. I'm guessing you have said everything you need to say before we go to a vote or anything more.'",
        "'speaker_2': 'Yep. Video. Thank you, council president.'",
        "'speaker_0': 'Thank you. Well, the clerk please call the role on the passage of the bill.'",
        "'speaker_1': 'And some member Morales.'",
        "'speaker_2': 'S.'",
        "'speaker_1': 'Council member must gather. I. Councilmember Nelson. I. Councilmember Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis. Yes. And Councilor President Flores. I am in favor of then.'",
        "'speaker_0': 'Thank you. The bill passes. The chair will sign it, and I'm pleased it takes my signature to the legislation. Moving on to the Transportation and Seattle Public Utilities Committee. This is Councilmember Peterson. But Madam Clark, were you please read the short title of the item into the record.'"
    ],
    "Easement Acceptance for City-owned Sanitary Sewer Line in Shilshole Bay Waterway.": [
        "'speaker_1': 'The report of the Transportation and Seattle Public Utilities Committee, an ordinance relating to Seattle Public Utilities authorizing the general manager CEO of SPU to accept a non-exclusive easement within the schedule shall be waterway. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Casper Peterson.'",
        "'speaker_2': 'Thank you. Council President. U.S. Council Bill 120322 accepts an easement from the State Department of Natural Resources to install a replacement sanitary sewer line within the Salmon Day waterway. The legislation was unanimously recommended by our committee.'",
        "'speaker_0': 'There any comments or concerns for Councilmember Peterson? Not seeing any men. Please call the roll.'",
        "'speaker_1': 'Councilmember Moralez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilman Ramos. Gather i. Councilmember Nelson. I. Councilmember Peterson. Councilmember Strouse.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold. Yes. Councilmember Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'And Council President Hart is in favor and unopposed.'",
        "'speaker_0': 'Thank you. Bill passes and the chair will sign it. Madam Clerk, will you please affix my signature to the legislation? Moving on to item number six. This is also Councilmember Peterson. Will the clerk please read the short title of item six into the record?'"
    ],
    "Real Property Acquisition for Highline Well Field Project.": [
        "'speaker_1': 'Agenda Item six Council Bill 120323 An ordinance relating to S.P. you accepting two deeds for real property acquired for the purposes of installing and operating groundwater wells or water works to provide potable water in connection with the High Line.'",
        "'speaker_1': 'Well, Wellfield project the committee recommends the bill pass.'",
        "'speaker_2': 'Mr. Peterson to Council President Council 120323 implements what is essentially a technical correction by accepting two property deeds that perfect to use property rights for those two parcels originally acquired in 1986. The legislation was unanimously recommended by our committee.'",
        "'speaker_0': 'Thank you. Do not cause any comments or questions. Not seen any. Then we will go to a vote. Madam, click. Will you please call the roll on the passage of the bill?'",
        "'speaker_1': 'Let's remember this.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That's my room together. I can't remember Nelson. I can't remember Petersen. I can't remember Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Herbold? Yes. Councilmember Lewis?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'And Council President Juarez. I ain't in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passes. The chair will sign it. And please fix my signature to the legislation. On the agenda, we will move two items regarding the consent calendar and there were no items removed with the consent calendar moving to adoption of other resolutions.'",
        "'speaker_0': 'There are no other resolutions on today's agenda. Other business. Is there any other business? From my colleagues?'"
    ]
}