{
    "Resolution on Taxing Big Businesses and Opposing State Preemption.": [
        "'speaker_1': 'All right. The bill passes and the chair will sign it. Thank you. Okay. And they're back. So we're now that we have an amended agenda. We are going to go to our first item, which is the resolution that council members so want put forward.'",
        "'speaker_1': 'I'm sorry to amend the agenda. So we have an amended agenda. Please read the new item number one.'",
        "'speaker_9': 'Resolution 319 34 supporting the taxation of big business in Seattle to fund housing and essential services. Urging the Washington State Legislature to oppose any preemption and other ban on Seattle's ability to raise revenue through big businesses, taxes, or other progressive revenue sources, and requesting the Office of Intergovernmental Relations to communicate this resolution to Washington state lawmakers.'",
        "'speaker_1': 'Thank you, councilmember. So what you want to move?'",
        "'speaker_0': 'But it could be.'",
        "'speaker_7': 'I feel like I've made a real motivation for why it is important in terms of timing, just given the pace at which there's potentially a ban or option could appear in the bill. And so I would really urge my colleagues to vote yes on the resolution.'",
        "'speaker_7': 'And just one other thing I will mention is that, as I said earlier, most of us on the council have already signed a letter that was initiated by a council member mosquito in which we are taking a clear position against preemption.'",
        "'speaker_7': 'But as many of us have also said, we need all tools in the toolbox. And I dread to think of what message it will send the corporate Democrats if we if this resolution does not get voted through and get a majority.'",
        "'speaker_7': 'Yes. Vote today, I don't know what message it will send. The message it will send will be basically that the Seattle City Council is not actually standing against preemption or ban. So I think it is historically crucial that we take the correct position and vote yes on the resolution and be consistent with the letter that most of'",
        "'speaker_7': 'us have already signed. And I would like to hear my colleagues on this.'",
        "'speaker_1': 'So now please help me out here. I thought that council members haven't had to move to adopt Resolution 31934. And did you do that?'",
        "'speaker_7': 'I do have to.'",
        "'speaker_1': 'When you do adopt it, you have to make a.'",
        "'speaker_7': 'Move to adopt resolution 31934.'",
        "'speaker_1': 'Is there a second, second, second. Okay. So now we can go. It's been moved and seconded to adopt a resolution and we'll move to discussion. Are there any comments on the actual merits of the proposed resolution from any of my colleagues?'",
        "'speaker_1': 'Councilmember.'",
        "'speaker_0': 'LEWIS Oh.'",
        "'speaker_4': 'Yes, thanks.'",
        "'speaker_1': 'Peterson No. Lewis I'm sorry. I'm so sorry. No, no, no. I actually have it written down here. Thank you. CARLSON Remember, it's.'",
        "'speaker_4': 'Only February, so.'",
        "'speaker_0': 'Yeah, go.'",
        "'speaker_4': 'Ahead. Thank you so much, Madam Chair. Or Madam President, pro tem. So I just wanted to make a couple of comments before we formally vote on this resolution. I want to thank Councilmember Swan for bringing it forward and totally respect the spirit in which it was introduced in which we will discuss it here today.'",
        "'speaker_4': 'I did just want to reiterate that on February 10th, I was one of the council members who signed the letter that we did send down to Olympia, to Representative Macri, as well as the sponsor in the Senate, Senator Kizer, expressing four key concerns.'",
        "'speaker_4': 'First concern, the increasing of the total revenue, because we know that while the current proposal is a good start, it does not go far enough to fully and comprehensively respond to the scale of our crisis. Second, excluding the preemption.'",
        "'speaker_4': 'Third, making sure we're allocating those funds to essential services and housing in a in an equitable way. Fourth, clarifying how much revenue is going to go to the Regional Homelessness Authority versus the city and the county. We sent this letter.'",
        "'speaker_4': 'And since that time, we've been at the table as a stakeholder regionally and as in Olympia and in Olympia and discussions in this bill. From my conversations with my delegation in the 36th, from my conversations with Representative Macri, the concerns of this Council are being heard in the halls of Olympia, and we are active participants, not passive'",
        "'speaker_4': 'observers. And while I adamantly believe in the good intentions behind this resolution, I also believe that the framework of our engagement based in that letter of February 10th and our follow up conversations, both as individuals and an institution through our table discussions with the Office of Intergovernmental Relations on a weekly basis has been the better approach for'",
        "'speaker_4': 'working out this policy with our friends than this resolution would. And I want to be clear that I have complete confidence and trust in Representative Nicole Macri, and that's part of the reason why I'll be voting no on this resolution today.'",
        "'speaker_4': 'The sponsor of HB 29 or seven, Representative Macri, who has managed this difficult process with grace and fortitude so far, which has not been easy. Nicole Macri is a progressive hero as the deputy director for the Downtown Emergency Service Center.'",
        "'speaker_4': 'She takes a backseat to nobody in her dedication and commitment to helping our neighbors experiencing homelessness, and no local politician can match her direct experience as a service provider. I just want to say that her progressive credentials are beyond reproach, and my knowing her as a friend and knowing her as a colleague, as a local leader.'",
        "'speaker_4': 'Her work has advanced the rights of renters, students, commuters, people experiencing homelessness. And her work at DSC has unambiguously saved lives and provided respite to people who have suffered on our streets experiencing homelessness. She is the person in the room on this.'",
        "'speaker_4': 'I trust her. I have her back. I'll continue to actively engage in making tonight's 97 the strongest bill possible. I don't think this resolution will help that cause at this time.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember Lewis. So with that, is there any other comments before I turn it over to council members who want to make a closing statement? Okay. With that, customers who want. Closures.'",
        "'speaker_7': 'Well, if any other guns. I appreciate Councilmember Lewis stating what his opinion is, although I don't agree with his position. But if other council members are planning to vote no on this, I would prefer to hear your opinions.'",
        "'speaker_7': 'And I think you owe the public an explanation of why you will be voting no on the resolution.'",
        "'speaker_1': 'I think we're just going to take a vote.'",
        "'speaker_0': 'So I'd like you to.'",
        "'speaker_1': 'Have a few any closing comments, and then I'd like to go to the vote.'",
        "'speaker_7': 'So I, I don't agree with the council members who are planning to vote no on this resolution, because I don't think that any politician, including myself, any politician, has some sort of lifelong hold over any kind of progressive label.'",
        "'speaker_7': 'You get to be called progressive only if you're absolutely fighting for a progressive agenda. And I don't I would say the person who spoke I'm sorry, I don't remember your name, but when you said that only somebody who I mean, I'm adding some words here, but only somebody who is either being completely politically naive or politically disingenuous'",
        "'speaker_7': 'would say that we don't actually need to use all tools in our toolbox. And to say that a representative who has who is the prime sponsor of the bill and who has refused to say that she opposes preemption, which is which is something she needs to say, that that person is a progressive hero.'",
        "'speaker_7': 'I don't I want to clarify. This is not about individuals and certainly not about politicians. I have the greatest respect for every elected representative.'",
        "'speaker_0': 'Who at.'",
        "'speaker_7': 'Any time in any given day is fighting for progressive causes. And I will work with anybody who is willing to do so. But in our conversation with Representative McCrery in Olympia, when 50 of us were there, she said, she said to me, you know, you know, as a fellow progressive, our lives are hard.'",
        "'speaker_7': 'And the people who spoke there basically summed it up, which is that I don't think progressive politicians can complain that their lives are hard because the lives of ordinary people are a thousand times harder. And it is our duty.'",
        "'speaker_7': 'It is our duty to absolutely be fighting. And I've said this before, and I will say this again, if as a progressive, if somebody who claims as a progressive and your life is not hard as an elected official, then you are doing something wrong and you're feeling ordinary people.'",
        "'speaker_7': 'Your life better be hard because that's what it's like when you're actually fighting for ordinary people. And I don't think that anybody who vote no on this resolution can claim that they are doing everything in their power to prevent what will be if the ban passes.'",
        "'speaker_7': 'A historic betrayal of Seattle's and the state's working people.'",
        "'speaker_1': 'The ball. Thank you, Councilmember Sawant, for bringing this forward. Thank you, colleagues, for giving. Council members want the opportunity to amend the agenda and put this resolution in front of us. Thank you, Councilmember Lewis, for your comments regarding our representatives down in Olympia.'",
        "'speaker_1': 'And with that, I am going to take the vote those in favor of adopting the resolution. Please vote I and raise your hand.'",
        "'speaker_7': 'I. I.'",
        "'speaker_1': 'Those opposed. Vote no and raise your hand. No, no, no. Shame. The resolution fails. 225225225. And that's two thirds. That's less than okay. All right. Thank you. Okay. We will move on with the calendar.'",
        "'speaker_5': 'No, thank you. Yeah, no.'",
        "'speaker_0': 'Reaction. Joe's big band from Seattle to Spokane?'",
        "'speaker_6': 'No. Brandon. Dr. David Frost. Yeah. Spokane.'"
    ],
    "Ordinance to Allow Transitional Encampments for Homeless Individuals on Various Properties.": [
        "'speaker_1': 'So now we have a new item number two, which is a little bit different than what we have on the agenda that was published, the Select Committee on Homeless Strategies Investments, the report of the Committee on Homeless Strategies and Investments.'",
        "'speaker_1': 'Please read the short title.'",
        "'speaker_9': 'Agenda Item two Constable 119 656 Relating to land use and zoning provided that transitional encampments for homeless individuals are allowed on any property owned or controlled by religious organization without approval of a permit under the Shelter Land Use Code.'",
        "'speaker_9': 'The committee recommends the bill passes, amended with councilmembers Luis Herbert Morales once and Strauss in favor with an abstention from Councilmember Peterson.'",
        "'speaker_1': 'Okay. So before we begin, this is how we're going to do this. I'm going to allow Councilmember Lewis, since this came out of his committee and also council members who want to kick us off. And then I have a few comments to make about the nine amendments that we are going to have in front of us for'",
        "'speaker_1': 'discussion and vote. So with that, I'll hand it to you. Councilmember Lewis.'",
        "'speaker_4': 'Thank you so much, Madam President, pro tem. And I'll be brief on this so we can get into the meat of the matter and give council members who want the opportunity to talk more broadly about the bill. I'll just say I'm really grateful to my colleagues on the committee for the two great sessions that we had on'",
        "'speaker_4': 'this Council bill leading up to this. We had a really good presentation from folks in the community, as well as service providers and folks with learned experience about the need to protect and expand tiny house villages and the scope and scale of these changes.'",
        "'speaker_4': 'We had a really good session a week ago where we passed some essential amendments and moved it forward for the final council action today. And I just want to thank everyone for being diligent with those tight timelines and having very productive conversations during those meetings.'",
        "'speaker_4': 'I want to thank Councilmember Swan for bringing this ordinance forward. I think it's a testament to the strength of the ordinance that the changes that we did enact through amendment last week really did not go to changing the core of her ordinance, merely made a couple of cosmetic changes, cleaned a couple of things up and then clarified'",
        "'speaker_4': 'a few things that needed clarification. And we'll talk about the additional amendments in more depth after this. But I will at this point turn it over to council members who want.'",
        "'speaker_1': 'Thank you, Casper. Silent.'",
        "'speaker_7': 'Thank you. I wanted to start by thanking everybody who has advocated not only for this bill, but also has been fighting for our homeless neighbors and for housing justice as a whole all these years, many of them preceding my time in Seattle, a special thanks to Nichols Ville Community and to the Low Income Housing Institute for spearheading'",
        "'speaker_7': 'the work that eventually became tiny homes. As you all know, I hope you all know this bill expands options for and removes obstacles to establishing dining halls, villages and Seattle. But it also, as Jerome Lee from Lee, I pointed out, is relevant to safe parking spaces and other sanctioned homeless encampments.'",
        "'speaker_7': 'Daniels villages have been hands down one of the most successful homeless services that have been created in our city. They are decidedly the most humane, the most respectful and dignity offering to our homeless neighbors and have one of the best drag records in helping people find permanent housing.'",
        "'speaker_7': 'Their self-managed model helps homeless people form a community and really, you know, abandon the isolation and alienation of life on the streets. In the public hearing last fall. We are moving testimony after moving testimony of homeless people, courageously sharing personal stories about how Daniels villages helped them get safe, get clean and sober, get their dignity and begin'",
        "'speaker_7': 'to manage post-traumatic stress, help their neighbors in the village and ultimately find housing. This city council should be doing everything in our power to make it easier, not more difficult for people to set up tiny house villages. And this includes providing every assistance possible with this legislation to Danny House community providers who work on shoestring budgets and'",
        "'speaker_7': 'don't need any more obstacles in their path. They need it to be easier for them to do what they are doing. That means removing the red tape that has been associated, which this bill will do, minus some of the bad amendments that are being proposed and fight for funding to expand villages and provide them with services like'",
        "'speaker_7': 'case management. Just to be clear. This legislation does not provide the funding for additional dining villages. We will need to fight for that funding in the budget this fall. So we should not confuse the two things. And we know, we all know that a dining house is suddenly far better than having a tent.'",
        "'speaker_7': 'And we need to support every effort to replace tents with tiny homes. However, I do not agree with making that a condition to get a permit because it does not that, you know, putting that obstacle in the way does not help anyone from go to go from a tent or a tiny house.'",
        "'speaker_7': 'It only makes it harder because what homeless service providers, what homeless service provider will set up a tiny house in an unsanctioned encampment. You know, you need to make sure that we remove the obstacles. This bill addresses the land use laws that create the restrictions on dining halls, villages.'",
        "'speaker_7': 'They have proven beyond any doubt their effectiveness. And I don't think that any councilmember who adds more obstacles in the path of making sure that, you know, people are able to provide this service can claim to be serious about addressing the homelessness crisis.'",
        "'speaker_7': 'I urge council members to support this legislation and to oppose amendments that would constrain opportunities to establish tiny house villages first as a substitute bill. That is a technical amendment it corrects numbering of the amendments in committee, updates, the date on the signature line, and so on and so forth.'",
        "'speaker_7': 'The Second Amendment, though, that I'm bringing forward, would grandfathering the existing encampments, and I'll talk more about that. But there are also other amendments that would actually not help this bill and appreciate people speaking in public testimony about them.'",
        "'speaker_7': 'And I will reserve my comments for when the specific amendments come up.'",
        "'speaker_1': 'All right. Thank you, Councilor Sawant. So I believe we have nine proposed amendments on the agenda. And as chair, I will call on each council member in the proposed order, as outlined on the table at that time to sponsor will have the opportunity to move their amendment.'",
        "'speaker_1': 'And I'm hoping somebody will second their amendment or I will. So just let me just share this as follows. And then we have a we actually have it lined up online. So we'll start with I'm just going to list the council member and what amendment numbers they are.'",
        "'speaker_1': 'And then we'll start with the we'll just go down the way it's listed in the following order. But we'll start with this. Councilmember Peterson has amendment number one, number seven and number nine, councilperson has amendment number two and number four.'",
        "'speaker_1': 'Councilor Mesquita has amendment number three. And I understand that Councilmember Lewis will be presenting Councilor Mosquitoes amendment. And then Councilmember Lewis has amendment number five, six and eight. So with that, we're going to start with amendment number one for Councilmember Peterson.'",
        "'speaker_1': 'Mr. Peterson, you have the floor.'",
        "'speaker_4': 'Thank you. Council President Pro tem. So the purpose of this substitute would be to one of the reasons we're here is because the current ordinance is expiring. So this substitute would extend the ordinance for two more years. The idea is to honor the original homelessness authority that we just established, because that authority will be coming back to'",
        "'speaker_4': 'us with a five year plan. It will be informed by experts on this issue, including people with lived experience, and we set that up so that we can have a regional response to this regional crisis. So this substitute would extend the current law by two years.'",
        "'speaker_4': 'It would also allow greater flexibility with the one year extensions on interim use encampment permits. And then it would it would also increase the number of allowable interim use encampments from three, which is the current number under the current law to 15.'",
        "'speaker_4': 'As just a reminder to the public, there is no limit on the accessory permits, those that are accessory to a religious institution. This is just for the interim use, but again, it's increasing it from 3 to 15. Now, realistically, there are several that have a temporary use permit that would convert to an interim use.'",
        "'speaker_4': 'So it would be using up about, you know, we'd get to just under ten. So but this is still adding a greater number and I'm got feedback from that at our committee of the whole last week to look for a larger number.'",
        "'speaker_4': 'I'm I am fine going up to 15 again this is meant to extend the current law allow greater flexibility with the one year extensions and go from 3 to 15. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Peterson, did you move to amend the council bill?'",
        "'speaker_4': 'So this is a this is I would so my motion is to have this substitute my substitute bill with those three parameters.'",
        "'speaker_1': 'Tuition. I'm sorry. Is there a second? Okay. Seconded by counsel Herbold, is there any other comment? Okay. I'm sorry. It's been moved and seconded. Are there any comments on the substitution?'",
        "'speaker_8': 'Thank you. I just want to speak to appreciation to Councilmember Peterson in hearing, I think, some of the feedback that he heard last week about the fact that the sunsetting encampments are very likely to be roll rolling over to use this this this un sunset it authority.'",
        "'speaker_8': 'And the number of encampments that he proposed last week would essentially take up the new authority. I, I regret, though, that I think the number 15 is still too low and does not allow for enough growth because as we have learned, that safe parking projects also count as transitional encampments and they will count against this total.'",
        "'speaker_8': 'I we we received we all received a really welcome update from Human Services Department Director Johnson Acting Director Johnson about new safe parking lot locations that are in development. Some of them are hosted by by religious institutions, but some of them are not.'",
        "'speaker_8': 'And so I am concerned I would hate to just take this action today and not not realize any ability for significant growth to meet the need, particularly the need for moving people directly from the streets into safe shelter with a door, with a sense of community, the things with the key, the things that are making this intervention'",
        "'speaker_8': 'so successful in realizing outcomes to permanent housing.'",
        "'speaker_1': 'Thank you, Governor. All right. See no further. Oh, I'm sorry, Councilman. Of what? I apologize. Thank you.'",
        "'speaker_7': 'Thank you. I just want to be clear with members of the public that this is not really I don't consider this a substitute bill. I consider this is really a no vote disguised as a substitute. And since Councilmember Peterson obviously opposes expanding opportunities to build Chinese villages, I would have preferred if he was just honest about it'",
        "'speaker_7': 'and voted no on the bill rather than attempting to tell the public a story that is not actually accurate. I mean, just to give you an example, he just gave you an an impression that he's increasing the number of sanctioned Daniels villages or sanctioned governments to 15.'",
        "'speaker_7': 'But really, what what what his substitute would do is take away what is in my original bill, which is 40, and then reduce it to 15. So, you know, it's a sleight of hand that is is doing is engaging in.'",
        "'speaker_5': 'And.'",
        "'speaker_7': 'And in reality, this amendment remove would remove. If this if this passes, it would actually be really bad for the the whole the whole objective that we are trying to achieve here, which is that this is the tiny home project has been so successful know and it has been through so many evaluations of all kinds of metrics'",
        "'speaker_7': '. I mean, compare it to the sweeps of homeless people that continue year after year. And the city spends over $8 million every year and it has not proven to be effective in any way whatsoever. In fact, it creates drama in people's lives.'",
        "'speaker_7': 'And yet it is a program that very hardworking nonprofit providers have worked on, which actually is providing service. And the best assessment of this is from homeless people themselves who will tell you that this is the only thing that will actually help them get their lives together.'",
        "'speaker_7': 'And if this amendment passes, so-called amendment passes would be really bad for the underlying bill because it would take away many progressive measures that are contained in this bill, such as streamlining the permitting process for religious and temporary encampments, making tiny houses available in different zones, significantly increasing the number of permitted tiny homes.'",
        "'speaker_7': 'And as I said before, and then it would create another sunset clause expiring in two months. Do your sorry in 2022, which would mean that we have to go through another seven month period to extending the permit. And in reality, if you look at the timing, it would mean we would have to start the process of the'",
        "'speaker_7': 'next bill to extend it again in the next couple of months. I'll just say in closing, when my office earlier this year put forward resolutions taking a stand against the war with Iran and against religious persecution in India, issues that matter very deeply to our constituents.'",
        "'speaker_7': 'Councilmember Peters and said that there was a waste of council's time and that the council should be focused on addressing the homelessness crisis. But I brought now I brought forward a bill that will actually address the homelessness crisis, and we have the council member opposing it and attempting to really undermine it.'",
        "'speaker_7': 'So I will oppose this amendment. I will urge the public to be aware of what is going on.'",
        "'speaker_1': 'Thank you, Councilman. So. Okay, let's. Let's go forward with the vote.'",
        "'speaker_8': 'Point of order.'",
        "'speaker_1': 'Sorry. Point of order.'",
        "'speaker_8': 'I just want to speak to r r comments as individual council members and as a body in impugning the motives of our colleagues. You know, there was another there was another proposal before the committee last week by Councilmember Lewis.'",
        "'speaker_8': 'That was for 20. And so I believe that Councilmember Peterson has brought forward this amendment in good faith. Nobody accused Councilmember Lewis last week of acting in bad faith. I believe that Councilmember Peterson heard my concerns and tried to bring forward a proposal.'",
        "'speaker_8': 'I'm not supporting that proposal, but I would just like us to show a little grace for one another up here on this dais.'",
        "'speaker_1': 'Okay. I'm going to let councilors respond briefly and then we're going to go to a vote. Go ahead, Councilor. Silent.'",
        "'speaker_7': 'Well, my colleague, council member, well, is free to have whatever opinion she has. But I also am an elected representative and I was elected by the voters of my district. And my loyalty is to ordinary people, not to any elected official.'",
        "'speaker_7': 'And I don't believe that this kind of substitute is directed with good intentions. But it is not a question of intention. It's a question of what effect this substitute would have. And I am primarily focused on the effect it would have, and that is on debatable.'",
        "'speaker_1': 'Okay. Thank you. So, listen, we have nine amendments in front of us. And so I'm going to ask that you withhold your clapping. This isn't a rally. I two will agree. And second, what Councilmember Herbal said about impugning other people's other people's intentions.'",
        "'speaker_1': 'I think we're all here trying to do the right thing in a good way. So with that, I'm going to move forward with our vote. Those in favor of the amendments. Last substitution vote I and raise your hand.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Those opposed? Well, no, no, no. You know, at times like this, I would like to the public to know that most of the time, 90, 95%, we are in agreement. It's just how we get there. She's all right.'",
        "'speaker_1': 'So let's go on to the next one. The next two is have amendment number two, which is council members who want which is a substitution and councilor. So what do you want to go ahead and present it and move to amend or make a motion?'",
        "'speaker_7': 'Yes, this substitute bill is a technical amendment. It corrects numbering after the amendments that were made in the committee. It updates the date on the signature line to 2020 from 2019, and it corrects the language around the amendment that Councilmember Herbold, who just left the room bill passed in committee for geographic spread of villages.'",
        "'speaker_7': 'That connection with Councilmember Herbold agreement makes the language match how the amendment was verbally described at the committee table because the written language of the amendment was not the way she had intended. And so we we worked it out great, I think have to move this amendment.'",
        "'speaker_7': 'Yes. Move amendment to.'",
        "'speaker_4': 'Second.'",
        "'speaker_1': 'Thank you. Thank you, Councilmember Peterson, for providing a second to Councilmember Silence amendment slash substitution. Are there any other comments before we move to a vote? Okay so with that those in favor of councilmember members substitution vote I in raise your hand I suppose they know the ayes have it.'",
        "'speaker_1': 'It passes, the motion carries and the amended is adopted. All right. Let's go to amendment number three. This is Councilmember Mosquito, but I understand Councilmember Lewis will be presenting it. Councilman Lewis, please take the floor in the moment.'",
        "'speaker_1': 'Make the motion.'",
        "'speaker_4': 'Thank you, Madam President. Pro tem. That is correct. In councilmember skater's absence, I will be moving her amendment. Quite simply, this amendment modifies a recital in the ordinance proposed ordinance to reflect that the appropriation, subject to a council proviso in the 2020 budget for homelessness, could be expended on tiny house villages, enhanced shelters, or both.'",
        "'speaker_4': 'And then it references council budget actions home to dash deed one and H home dash three, dash b-3. So just a kind of technical change to the recital. All right. And I move that. We so amend the council bill.'",
        "'speaker_1': 'Okay. So we have the motion can have a second.'",
        "'speaker_4': 'Second.'",
        "'speaker_1': 'Great. And who said it? But somebody three people did. So we have a second as well. It's been moved and seconded to amend the bill. Are there any other comments? Okay, let's go to a vote. Those in favor of councilmember mosquito as presented by Councilmember Lewis's amendment.'",
        "'speaker_1': 'Those in favor vote I in raise your hand. I those opposed. No, the ayes have it and the motion carries and is adopted. So let's move on to amendment number four. Councilmember so want the floor because.'",
        "'speaker_0': 'No.'",
        "'speaker_7': 'Yes. The I don't expect this amendment to be controversial. It would be it would grandfathering the existing and government the setback requirements that were created in an amendment in the committee meeting, practically speaking. This would only impact one and campaign with your high heights in that in government the structures are three feet inside these new setback requirements'",
        "'speaker_7': '. On one side, the neighbors are supportive of the incumbent. It would be inefficient and unnecessary to remove them to move a number of their structures by three feet when they renew their permit. There would be no other impact of this amendment, so I assume it should be.'",
        "'speaker_7': 'Okay, great. And I need to move amendment for the second.'",
        "'speaker_1': 'Second. Great, we have a second. Are there any other comments for Councilmember Silence? Kessler Lewis And.'",
        "'speaker_4': 'Just really briefly, Madam Chair, I just want to state that this is a particularly personal amendment to me, given that it does impact the inner bay, tiny house village in District seven, which I am particularly proud of. I think they're great neighbors in District seven.'",
        "'speaker_4': 'I live just up the hill in the uptown neighborhood. The idea that we would pass something and it would accidentally not incorporate them is something that would would really grievously affect me if I found out about it later.'",
        "'speaker_4': 'So I appreciate that this was caught in time to incorporate in here. You know, I had the opportunity earlier today at the State of the City address to talk to a few Port of Seattle commissioners again. And Commissioner Steinberg did come to the committee meeting last month to talk about the port's commitment to that village as well'",
        "'speaker_4': '. It really is a great example of intergovernmental cooperation, and I really enthusiastically support this amendment and support the work that's being done at that inner bay village.'",
        "'speaker_1': 'Thank you. So with that, we it's been moved. It's been seconded. Are there any other comments before we move to a vote? Okay. Those in favor of the amendment vote I and raise your hand I those opposed vote no.'",
        "'speaker_1': 'The ayes have it and the motion carries and the amendment is adopted. Let's move on to amendment number five. Councilmember Lewis, you again? Sorry.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Yeah. Thank you, Madam President. Pro tem. So this amendment this was part of our discussion as a committee last week where we were discussing the requirements for case management and security at the encampment sites. I had previously proposed an amendment.'",
        "'speaker_4': 'The language and wording of that amendment had perhaps in practice would have been too prescriptive and could have impacted the current practices of some of the encampments. That was something I was concerned about, so I pulled back that amendment to work on it.'",
        "'speaker_4': 'Over the course of the last week, having consulted with service providers and central staff, it's my belief that this amendment more appropriately fits the kind of current standards HST uses when they are talking to providers to provide case management and security in accordance with an approved encampment management plan that allows for the flexibility to accommodate unique circumstances'",
        "'speaker_4': '. And so based on that, I move that we incorporate that amendment and that language into the Council bill.'",
        "'speaker_0': 'And.'",
        "'speaker_1': 'I just have a little sidebar here.'",
        "'speaker_0': 'So you may not actually second it.'",
        "'speaker_1': 'Oh, because remember, else I might.'",
        "'speaker_0': 'Be doing this too soon. It's okay. But I have a proposed amendment to this amendment.'",
        "'speaker_1': 'Oh, that's great.'",
        "'speaker_0': 'Is this. Is this the right time? Yeah. Okay, so I'll finish my statement. And it was not distributed before noon today, so I'm requesting that the rules be suspended to allow consideration of the amendment that did not meet the council rule.'",
        "'speaker_1': 'Okay. So I need to go back. I apologize. I didn't know that if you were going to come forward with that.'",
        "'speaker_0': 'Yes. So you did. That's okay.'",
        "'speaker_1': 'So this is actually your amendment to Council Member Lewis's amendment, correct? Yes.'",
        "'speaker_0': 'I have one right here and now. Yes. Are you passing it out? I can pass it out here. I don't know any different numbers.'",
        "'speaker_9': 'To suspend the council to allow consideration.'",
        "'speaker_1': 'So I move to suspend the Council rules to allow consideration of Council Member Morales's amendment to council Lewis's amendment number five.'",
        "'speaker_0': 'Now.'",
        "'speaker_1': 'Oh, there it is. I see it again.'",
        "'speaker_4': 'Second.'",
        "'speaker_1': 'Okay. So we haven't moved and we have it seconded and go ahead, Councilmember Morales.'",
        "'speaker_0': 'So I'm moving to amend Councilmember Lewis. I have it as Amendment one. So we should.'",
        "'speaker_1': 'That's what.'",
        "'speaker_9': 'We need to move to now.'",
        "'speaker_0': 'Suspend now we need to vote.'",
        "'speaker_1': 'So I need to now we need to vote on suspending to allow consideration of the amendment. Okay, all I think it's just a hearing. No objection, but okay. All those in favor of the Councilman Morales introducing an amendment to Mr. Lewis's amendment vote.'",
        "'speaker_1': 'I. I, i. I oppose. No, the ayes have it. Floor is yours.'",
        "'speaker_0': 'Thank you. And again, my apologies, especially after complaining last week about everybody bringing amendments at the last minutes. I appreciate your indulgence. I moved to amend Councilmember Lewis's amendment as presented on the distributed document. The amendment revises Section D .1.2 of the Municipal Code 23.4 2.056.'",
        "'speaker_0': 'By deleting and security after provide case management. And the reason that I'm doing this is because when I do think that the security requirement can can pose additional barriers and costs to beginning new communities. But also, I believe that.'",
        "'speaker_7': 'We shouldn't be.'",
        "'speaker_0': 'Codifying the security requirements when there are different circumstances for different kinds of encampments. And this the kind and whether security should be provided, can be determined based on the circumstance and really managed during the contracting process. So I so that is the rationale for removing it from for this amendment, removing that language from Councilmember Lewis's amendment.'",
        "'speaker_1': 'All right, Councilor Lewis, to go speak to this.'",
        "'speaker_4': 'Yes. Thank you, Madam President, pro tem. And I do appreciate Councilmember and Councilmember Morales bringing forward this amendment to the amendment, because I do think this is an important thing to to discuss and talk about. I appreciate the spirit in which this amendment has been introduced.'",
        "'speaker_4': 'I do think it's important first to mention that regardless of what we do here today as a council, that security requirement that is enumerated in my unamended amendment is in existence. So regardless of what our action is and Councilmember Morales did acknowledge that in her remarks just now, that requirement does exist.'",
        "'speaker_4': 'There does need to be an approved security plan. From my conversations over the last couple of weeks with service providers, you know, one of the things that I think has been the most inspiring is looking at a lot of the peer managed governance systems that exist in a lot of these camps, how effective they are at coming'",
        "'speaker_4': 'together as a community, at empowering folks to help manage and run the camps, including providing the security. And a lot of the security programs that have been approved by HST are significantly peer participated in or even peer run.'",
        "'speaker_4': 'And this amendment allows more flexibility for that in a way that the amendment last week might not have. The second consideration, and I think this is important, too, is I do think, you know, there has been a considerable amount of press and public scrutiny regarding the ordinance.'",
        "'speaker_4': 'You know, I think one of the criticisms that is often mistakenly levied in the public press against the tiny house villages is that there is no allotment for security or collaboration with neighborhood groups, which we all know is patently false.'",
        "'speaker_4': 'I think it helps to enhance this ordinance as a public facing law to be able to go to the public and say like, well, look, this is currently in the HST rule for good measure. We've also enumerated it, spelled it out and codified it in the final ordinance.'",
        "'speaker_4': 'I do think it's important that we acknowledge that that is a requirement. It is one that's enforced and that in many cases it is peer driven and cognizant of the specific needs of a specific camp. So I will be respectfully voting against Councilmember Morales amendment.'",
        "'speaker_1': 'Okay. So before we go, I need a second for Councilman Morales's amendment to council Lewis's amendment number five. Can I get a second? Thank you, counselor. So on. So we have a second. Is any more comments? Go ahead.'",
        "'speaker_7': 'Council members want I will I want to speak to both the amended version of the amendment and the original.'",
        "'speaker_1': 'Do it to me right here. Okay. I see how it is.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_7': 'I will be voting yes to the amendment. To the amendment, but I will be voting no on whatever the final result and resulting amendment. Is it whether it is an amended version or not?'",
        "'speaker_0': 'Sorry.'",
        "'speaker_7': 'But I would like my comment will explain both. So practically speaking, either version of the amendment, but it includes just case management or case management and security. I don't think it changes much because the requirements are already a condition of receiving funding from the Human Services Department.'",
        "'speaker_7': 'And because of that, if the if the if I'm abstaining were an option, then I would have abstained. But we have to vote yes or no. So given that I will be voting yes on Councilmember Morales's amended version of the amendment because it sort of mitigates it, but voting no on the final amendment, because if there was'",
        "'speaker_7': 'ever a scenario where the clauses could result in a tiny house village failing to receive a permit, then I think that would be a bad outcome, even though those conditions are already, you know, sort of contained in the requirements to receive a permit.'",
        "'speaker_7': 'But in the spirit of making, you know, the the whole spirit in which I brought this bill forward was to remove obstacles, not put them back in place. And so in that spirit, I would vote no on the final amendment, because it's largely even though it's largely academic in this case, because then government already have these requirements'",
        "'speaker_1': '. Thank you. Okay. So what we're going to do is first we it's been moved and seconded and we're going to vote on Councilmember Morales's motion to amend Councilmember Lewis's amended number 5/1. So those all in favor of Councilmember Morales's motion.'",
        "'speaker_1': 'Vote I and raise your hand, I. Okay. Those opposed. No, no, no. If it fails, the motion fails. Thank you, Councilmember Morales, for providing that for us. So we will go on and now we will vote on the Bass legislation, which is Councilmember Lewis's, which is amendment number five, all those in favor of amendment number five as'",
        "'speaker_1': 'presented by Councilmember Lewis and seconded vote a vote. Those in favor of the amendment. Vote yes and raise your hand. Well, if you want to vote. Yes.'",
        "'speaker_4': 'Yes, yes.'",
        "'speaker_1': 'Okay. All those opposed? No. If it passes. All right. Let's go to Amendment number six, which is council member Lewis again. Councilor Lewis.'",
        "'speaker_4': 'And so this amendment and I spun this amendment off from amendment number five. They used to be combined. The reason for that is currently it is theoretically possible, though it has not happened yet, that a a service provider not receive HST funding but still open a village.'",
        "'speaker_4': 'So this amendment would require that encampment operators who are not funded by HST still provide case management and security in accordance with the all home standards. Those are standards established in the Seattle King County Continuum of Care Community Standards.'",
        "'speaker_4': 'So this just gives some guidance to providers who might want to go ahead and get a permit without HST funding, how they would get security in case management requirements met. But I separated it from the other amendment because it is sort of a distinct category of potential tiny house village operators.'",
        "'speaker_1': 'Do you want to move?'",
        "'speaker_4': 'And I do move that it be adopted.'",
        "'speaker_1': 'Second. Thank you. Councilmember Strauss. Any other discussion, Councilor Herbert.'",
        "'speaker_8': 'Thank you. I just want to honor the many, many years, maybe decades at this point of transitional encampments that have functioned without city funding and recognize that onerous obligations such as case management for a more do it yourself approach of taking shelter and providing companionship and safety in numbers that has, you know, been able to do so'",
        "'speaker_8': 'for years and has gotten us to this point that we're talking about expanding sanctioned encampments. I don't think it's fair to have onerous requirements on the sponsors of of traditional encampments that don't receive city funding. I do feel it is absolutely 100% responsible for requiring it of encampments that do receive city funding.'",
        "'speaker_8': 'And for that reason, I will not be supporting this amendment.'",
        "'speaker_1': 'Thank you. Okay, so we have a motion. We've had it seconded and let's move to a vote. Oh, I'm sorry. I guess.'",
        "'speaker_7': 'One. Thank you. I do agree with Councilmember Robles points as were just made. And just to clarify, unlike the previous amendment that was put forward in this case, this amendment, if passed, could really result in Daniels villages failing to get a permit, unlike in the previous case, where there's a potential, but not really, because there are those'",
        "'speaker_7': 'requirements already in place. We know many Daniels villages start as groups of self-organized homeless people forming a village like a community, and then they request a permit and start to put together services like replacing tents with tiny homes and getting case management services.'",
        "'speaker_7': 'I mean, if if we want to be connected to the real world, that has been the process through which this has happened and many, many people have worked on as hard as going to, Mirabel said for years, if not decades, on these issues.'",
        "'speaker_7': 'And so, you know, I think we have to make it clear that that we don't want to increase obstacles in their power. So I would be voting no against this.'",
        "'speaker_1': 'Thank you. Councilman Swan. Okay, let's move to a vote. Those in favor of the amendment. Vote I and raise your hand.'",
        "'speaker_5': 'I and.'",
        "'speaker_1': 'Those opposed. Vote No.'",
        "'speaker_0': 'No. It fails.'",
        "'speaker_1': 'Else let's move on to amendment number seven, which is Councilmember. Councilmember Peterson.'",
        "'speaker_4': 'Thank you. The purpose of this amendment would be to memorialize the benefits of tiny home villages in that they are providing a physical structure. They are providing a roof for walls, a door. And this legislation, when it originally came out, it was called a tiny home village bill.'",
        "'speaker_4': 'But it was really just expanding the number of in the tent encampments and not providing the structure what we know of as tiny home villages. We we know that tiny home villages had a shaky start in terms of getting the outcomes we were seeking, in terms of getting people to exit to permanent housing.'",
        "'speaker_4': 'Tiny home villages made substantial strides. One of the reasons is because of the case management. And so I appreciate my colleagues amendment to add the case management. This amendment would, in addition to providing that physical structure, would have required case management as well as security.'",
        "'speaker_4': 'So the second part of this amendment is consistent with what just passed the. What I what I'd like to do is there was some discussion during the committee about vehicles and making sure that we were including vehicles in this.'",
        "'speaker_4': 'So I am I am open to removing the last sense that talk or the part that talks about sleeping areas shall not include recreational vehicles, but may include other owner occupied vehicles. Happy to accept friendly amendments to that.'",
        "'speaker_4': 'But again, the purpose of this is to provide the structure, the case management and the security. Thankfully, we just amended it to provide the case management security. So that's really leaving us with providing that structure that we know of.'",
        "'speaker_4': 'When we see when we visit tiny home villages and we see the structure, that's the attraction to have the roof, the four walls and the door. So that's what this amendment would do.'",
        "'speaker_1': 'So, Councilmember Peterson, for clarification, are you are doing is anywhere are you is someone proposing a friendly amendment to strike the language you're suggesting? Are we just moving forward? Nope. Okay. Is there any other comment?'",
        "'speaker_0': 'Moved on second in.'",
        "'speaker_1': 'Getting ready to ask if you need to move the.'",
        "'speaker_4': 'Yes. So I'd like to move this amendment number seven.'",
        "'speaker_1': 'Sort of second. Okay. So the motion fails for lack of a second. Let's move to Amendment Number eight and that would be council member.'",
        "'speaker_4': 'LEWIS Thank you, Madam President. Pro tem. So amendment number eight. This is a pretty technical change. One, it occurred to central staff that there were some modular developments, more modular encampments that perhaps would not fit into the definition that we had previously established.'",
        "'speaker_4': 'Specifically, there is a modular development that I'm very excited about coming online and Sodo that Chief Seattle Club will be the operator for that uses these kind of modular structures that are secure and good spaces. This just closes that loophole to make sure structures like that are included and camps like that could get permitted under this ordinance'",
        "'speaker_4': '. And so I move that. We incorporate that into the definition and move that this amendment be adopted.'",
        "'speaker_1': 'Thank you for any comments. Okay.'",
        "'speaker_0': 'So can I ask a question?'",
        "'speaker_1': 'Yes, go ahead.'",
        "'speaker_0': 'Um, so, um, the legislation would not preclude this kind of housing from being used in different contexts.'",
        "'speaker_4': 'Yeah. Good question, Councilmember Morales. So all this amendment would do is just add modular structures to our current definition of structures that can be included. It wouldn't it wouldn't preclude any of the other definitions that are in there now.'",
        "'speaker_4': 'And and it's strictly talking about this permitting authority, not talking about other buildings or other types of arrangements.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_1': 'So it's been moved?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Okay. And it's been seconded. Oh, commercial one. Oh, okay. Is there a second?'",
        "'speaker_0': 'Second?'",
        "'speaker_1': 'We have a second there. Okay. So with that, we have it moved and seconded. So let's go to a vote. Those in favor of the amendment. Vote I in. Raise your hand. I it was opposed. Vote no. Ayes have it.'",
        "'speaker_1': 'Amendment number eight passes. Is it.'",
        "'speaker_9': '7720?'",
        "'speaker_1': 'Let's go to amendment number nine, Councilmember Peterson.'",
        "'speaker_4': 'Thank you. This amendment would extend the sunset date by three years. So right now, the it's sunsetting unless we pass what we're aiming to pass today would sunset next month. This would extend it three years. The rationale here is that we've made some amendments to to strengthen the the proposal by adding case management, for example.'",
        "'speaker_4': 'I'm dismayed that we haven't actually created a tiny home village structure, that this is really a tent encampment expansion instead of tiny home villages as the as the bill was originally advertised. But because we passed the Regional Homelessness Authority, it's important that we allow those experts to come back to us with their five year plan and their'",
        "'speaker_4': 'evidence based strategies to reduce homelessness. And we we revisit this in three years. Three years is plenty of time for the regional homeless authority to get back to us with their recommendations and their five year plan.'",
        "'speaker_1': 'Thank you. Did you move to.'",
        "'speaker_4': 'And I'd like to move this this is Amendment nine.'",
        "'speaker_1': 'Is there a second?'",
        "'speaker_4': 'Second.'",
        "'speaker_1': 'Any other comments?'",
        "'speaker_8': 'Caspar Herbert I just want to say that I believe that the legislation before us is zoning and permitting legislation. It is not legislation that will be impacted by future decisions of the Regional Homelessness Authority. Decisions about how to support tiny home villages and transitional encampments with our budget might be impacted by those discussions in the future, but'",
        "'speaker_8': 'not zoning legislation that we had.'",
        "'speaker_1': 'Before us anyway. Councilor Strauss.'",
        "'speaker_5': 'Jones, Member Pro-Tem, thank.'",
        "'speaker_2': 'You for the opportunity to speak and thank you, Councilmember Peterson, for bringing all of these amendments forward. And to all my colleagues, speaking as the land use and Neighborhoods Chair, I do want to remind the body that this is a technical bill regarding our land use code.'",
        "'speaker_2': 'All of these tiny home villages have a two step process that they must go through to be stood up, and that includes funding and that includes a permitting process. So there is an additional regulatory process that every tiny home village will have or interim encampment or safe lot or any of these programs that we have discussed to'",
        "'speaker_2': 'go forward in that it is in the in our best interest in to align ourselves with the CPA analysis that has already occurred to not support this amendment and to use the maximum capacity that we have and to move the bill forward as the procedural.'",
        "'speaker_5': 'Bill that it is.'",
        "'speaker_1': 'So you're voting no? That's correct. Okay. And it's because you believe that it would be duplicative of what your committees are already doing.'",
        "'speaker_2': 'This is in accordance with the CPA analysis that was that was done even before the new.'",
        "'speaker_5': 'Council came to the came to the dais.'",
        "'speaker_1': 'Okay. Got it.'",
        "'speaker_4': 'Their response?'",
        "'speaker_1': 'Go ahead, Casperson.'",
        "'speaker_4': 'Thank you, Councilmember Strauss. I just want to go on the record to say when when there is a determination about CPA. That is that's very important for us to get that input. It's required to get that input. But that doesn't remove our policy decision as policymakers on on whether to proceed with a particular proposal.'",
        "'speaker_4': 'And again, this amendment would give us three years of runway to allow this ordinance to take root and to blossom, and then to take the input from the Regional Homelessness Authority, which will be coming to us with a five year plan that will include the entire menu of evidence based strategies.'",
        "'speaker_1': 'All right. All right. We have a motion in front of us and it's been seconded. And so now we're going to move to a vote. And this. I'm sorry. Oh, go ahead. Councilors one.'",
        "'speaker_7': 'Thank you. Presenter Adam. Whereas I will just add to the comments that have already been made by Councilmember Herbold and Strouse that. DANIELS Well, I just again, you know, just as a reminder of a proven track record of success and should not be forced to fight for their very existence every few years, that is the whole point'",
        "'speaker_7': 'of the what we're doing here, this exercise here. And I'd also say this is a thought exercise. Imagine if big business was treated that way. Imagine if corporate developers were told that they could get a master use permit only until 2023 if such a thing doesn't happen.'",
        "'speaker_7': 'But just think about it. Think about all the hoops they'd be forced nonprofit homeless service providers to jump through to provide the modicum of services for our most vulnerable neighbors.'",
        "'speaker_1': 'All right, we ready for a vote? Okay. So we have in front of us the amendment. And so those in favor of the amendment vote. And raise your hand. I think those opposed.'",
        "'speaker_0': 'No, no, no.'",
        "'speaker_1': 'That fails. All right. So we have gone through nine amendments. I want to thank all of my colleagues for all their conscientious comments, concerns. I know this has been a lot of work. I apologize for not being here the last two Mondays as president pro tem.'",
        "'speaker_1': 'I was out of town and particularly to Councilwoman Mosquito, who took my place for me. But I'm here today, so we're going to move forward on the final vote, vote on the bill as amended. So I believe before we go, that councilors who want wanted to make some comments before the final vote.'",
        "'speaker_1': 'Is that correct? All right. And then if there's anyone else. And then we will vote. Customers want you on the floor.'",
        "'speaker_7': 'Thank you. So I just want it to be harder to say. I start by saying there is no reason why a city like Seattle, it is one of the wealthiest cities in the history of humanity. Why a city like Seattle should be home to any homelessness, let alone the amount of homelessness that we see.'",
        "'speaker_7': 'This is a city that is home to so many millionaires and even billionaires, and still we have not succeeded in ending homelessness. In fact, the skyrocketing rents have created a pipeline into new homelessness. And to be sure, even after the passage of this bill, which I hope it passes in its current form, we will need to tax'",
        "'speaker_7': 'big business to fund a massive expansion in investments in publicly owned or controlled social housing. We will need rent control. We will need to shore up renters rights as a whole. We will need to make sure that middle class property owners, working people and small business owners are not facing the brunt of the funding, though addressing the'",
        "'speaker_7': 'crisis. But today, this will be an important victory for our movement to stand with our homeless neighbors and to make sure that we take steps toward making this a humane city. Reno dining houses are not a replacement for actual housing, but while homelessness exists, there is no reason why people should be left on the streets.'",
        "'speaker_7': 'There should be a tiny house available for anyone who has nowhere better to go to. While not an alternative to affordable housing. It is a powerful way to make homelessness less harmful and has been proven to help Hamlet homeless people get back on their feet.'",
        "'speaker_7': 'Passing this legislation will be a real triumph for homeless activists and advocates who have fought for years to establish their first encampments and then tiny house villages. It is really important to remember the history of this struggle because homeless people and their advocates and their house neighbors had to fight for it and they had to be united'",
        "'speaker_7': 'to fight for it. GAM second chance was first to be created when activists took bolt cutters to the chain lock blocking access to the unused mayor's red parcel.'",
        "'speaker_0': 'And set up an.'",
        "'speaker_7': 'Encampment. It's important to remember this history. They were threatened with a sweep and we had to organize to stop the then mayor from kicking them out at that early stage. Similarly, Sherrill and Nichols will have occupied city, county and state land to set up unpermitted encampments until they won permits.'",
        "'speaker_7': 'Over the last year, both the Georgetown and North Lake tiny house villages have been threatened with losing their permits, and North Lake is currently under threat. Our People's Budget Movement one the first funding for encampments in 2014. And I want to do again in terms of remembering ten councilmembers at that time, councilmembers Liccardo and O'Brien and also'",
        "'speaker_7': 'Councilmember Herbold, who worked and got some really good offers at that time to help win that funding and then when increases to that funding in subsequent years. Imagine what tiny house villages could accomplish if they were really supported by the by City Hall rather than having to fight constantly for their right to exist.'",
        "'speaker_7': 'Today we are passing this legislation to massively expand opportunities to build tiny house villages. But tomorrow we will have to fight for their funding in the budget. I don't mean literally tomorrow, but this year to make this expansion.'",
        "'speaker_0': 'To all.'",
        "'speaker_7': 'The homeless people who have fought for and won tiniest villages. Today's victory belongs to you because of your dedication and courage. And I also want to thank the churches and all the faith leaders of different faiths who have not only hosted dining halls, but they just are currently hosting.'",
        "'speaker_7': 'But I've spoken in favor of the dining halls, villages, the neighbors, the house, neighbors of the villagers who have shown that the majority of Seattle does not buy into the safe Seattle rhetoric, and that we care about our homeless neighbors deeply and that we care about ending homelessness.'",
        "'speaker_7': 'And I want to thank Chair Rachel Nichols. Well, Lee I Women in Black. Thank you for all your organizing. The history of the struggle of tiny houses in Seattle has shown that when we fight, we can win. And I thank members who voted against some of the worst amendments keeping this bill as it goes out strong.'",
        "'speaker_1': 'Thank you. I'm good. Oh, you good? Yeah. So before we go to a vote, I just briefly want to thank the public for coming here today and providing public comment. Believe it or not, we actually listen and appreciate we see some of the same faces and it means a lot.'",
        "'speaker_1': 'Some of us up here have experienced homelessness and we do know what that feels like, including myself. I think at the end of the day, though, all of us want to do one thing with you and all of us in this city is that we continue to make a commitment to be connected to each other's humanity, because'",
        "'speaker_1': 'at the end of the day, we do care about sheltering the unsheltered, and again, it's how we get there. So with that, I'm going to go and now that we've had in front of us, please call the roll on the passage of the bill as amended.'",
        "'speaker_5': 'Strauss, I.'",
        "'speaker_3': 'Herbold.'",
        "'speaker_0': 'Hi.'",
        "'speaker_4': 'Lewis Hi.'",
        "'speaker_3': 'Morales.'",
        "'speaker_0': 'I.'",
        "'speaker_4': 'Peterson No.'",
        "'speaker_3': 'So aren't.'",
        "'speaker_7': 'I.'",
        "'speaker_3': 'President Whereas.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Six in favor one.'",
        "'speaker_0': 'Opposed this.'",
        "'speaker_1': 'Okay. So.'",
        "'speaker_6': 'Okay. Hold on. Okay. Okay. Hey. Right now.'",
        "'speaker_1': 'And with that, the bill passes as amended, and the chair will sign it. Thank you.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_1': 'So moving along in our agenda, we're going to go to the Public Safety Human Services Committee. The report, please read those items, three and four, both appointments into the record.'"
    ]
}