{
    "Final Passage of Ordinance Amending Alameda Municipal Code Section 30-5.15 regarding Medical Marijuana Dispensaries to Define and Prohibit the Commercial Cultivation of Medical Marijuana in the City of Alameda to Protect the Citys Jurisdiction Regarding Cultivation, While Preserving the Opportunity to Have a Robust Discussion About Medical Marijuana Cultivation at a Later Date.  [The Proposed Amendment is Categorically Exempt from the California Environmental Quality Act (CEQA) Pursuant to CEQA Guidelines Section 15305, Minor Alternations to Land Use Limitations.]  (Community Development 2310)": [
        "'speaker_1': 'Final passage of ordinance amending Alameda Municipal Code Section 30, Dash 5.15 regarding medical marijuana dispensaries to define and prohibit the commercial cultivation of medical marijuana in the city of Alameda to protect the city's jurisdiction regarding cultivation while preserving the opportunity to have a discussion.'",
        "'speaker_0': 'Remember Brody.'",
        "'speaker_4': 'I don't really need a presentation on this. I voted no on this when it came to us at 355 in the morning a couple of weeks ago. And I don't think we've had adequate public discussion on that. So I just wanted to vote no this time.'",
        "'speaker_0': 'Any other comments member day?'",
        "'speaker_5': 'Yes. Thank you, Madam Chair. Just a question. Two points. One is my understanding is that we were asked to make a decision on this so as to Trump what is possibly the state making a decision for us? Because at a certain point in time, I believe in March, if we as a city don't make decisions regarding our'",
        "'speaker_5': 'American medical marijuana practices here in the city of Alameda and the state rules will, will. Super seat, and we know when that happens, problems arise. One example of that, for example, was the massage parlor issue where it was based upon state rules and a lot of local governments, you know, subsequently, you know, had to deal with that'",
        "'speaker_5': '. So so I don't disagree with the need to make a vote tonight. But I will say one thing, though, that we as a city need to. Well, I can only speak for I as a council member would like to say that.'",
        "'speaker_5': 'On the matter of medical marijuana, that it is an issue that cities ought to look at broadly, not just to say no outright. I mean, each council member and mayor has their own voice, but in some respects it could be good in terms of economic development, in terms of personal health.'",
        "'speaker_5': 'So I don't want my vote tonight to be construed as extending the possibility of medical marijuana coming down the pike into the city of Alameda. But I do want to respond to the issues raised by staff that we need to make a vote, because we if we're going to pursue medical marijuana, we need to pursue it on'",
        "'speaker_5': 'the terms of the city of Alameda. And at this point, if we don't make a decision, we're we'd be left with pursuing medical marijuana on the terms of the state. So so I'm going to agree with the staff on this.'",
        "'speaker_0': 'In short, I believe we can say that it is to protect local control. Madumere member ASHCROFT Thank you.'",
        "'speaker_6': 'So I'll agree in part with Councilmember Odie. I am, in retrospect, with the 2020 hindsight and through bleary eyes. We shouldn't have been transacting business at 355 in the morning, but we should have probably followed the advice of our city attorney to not go into our deliberations on the rent ordinance at whatever ungodly hour it already was'",
        "'speaker_6': '. I think that's a lesson that was well learned. We don't make our best decisions in the wee hours of the morning, and it's not fair to the public who like to follow our decisions in real time, either in the frigid auditorium or in the in front of a screen in the comfort of their home.'",
        "'speaker_6': 'So let's keep that in mind next time. However, the title of this particular ordinance does include the the phrase while preserving the opportunity to have a robust discussion about medical marijuana cultivation at a later date. So since this is the second reading of an ordinance, I would assume that we'll do just that after we get this housekeeping'",
        "'speaker_6': 'detail out of the way. Thank you.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_7': 'You have an if you don't have any comments, I'd like to make a motion to approve the final passage of this ordinance.'",
        "'speaker_0': 'But all those in favor, I. Pose. No motion carries 42 one. Nebraska. You voted?'",
        "'speaker_6': 'I voted yes. Yes.'",
        "'speaker_0': 'All right. That's I thought. All right. Motion carried four one. Thank you very much. All right. Regular agenda item six. And we have any speakers on six eight?'",
        "'speaker_1': 'No, we do not.'",
        "'speaker_0': 'All right. If possible, I'd like to have six E. Go next, then. There's just not any objection.'",
        "'speaker_7': 'I have no objection.'",
        "'speaker_0': 'So that I could proceed because six be required requires a vote and I may not be here for it otherwise. And the other one? I'll come back.'",
        "'speaker_1': 'Our final maps will come back. But there is the right items. Right. Okay. Yeah. Okay. Can we.'",
        "'speaker_0': 'Proceed with 6.'",
        "'speaker_1': 'P.m. recommendation to.'",
        "'speaker_0': 'What.'",
        "'speaker_7': 'I said? I had no objection.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'I have no objection.'",
        "'speaker_4': 'That's fine.'"
    ],
    "Recommendation to Award a Contract in the Amount of $395,000, Including Contingency, to CDM Smith to Prepare the Citywide Transit and Transportation Demand Management (TDM) Plans and to Amend the Measure B and Base Reuse Department Budgets for Fiscal Year 2015-16 by Appropriating $100,000 from Each of These Funds to Pay for the Citywide Transit and TDM Plans Contract. (City Manager 2110)": [
        "'speaker_1': 'Okay. Recommendation to award contract in the amount of 395,000, including contingencies to CDM Smith to prepare the citywide transit and transportation demand management plans and to amend the Measure B and base fees. Department budgets for fiscal year 20 1516 by appropriating 100,000 from each of these funds to pay for the citywide transit and TDM plan.'",
        "'speaker_0': 'Good evening, Madam Mayor and members of the City Council. I am Gayle Payne, the city's transportation coordinator. And this agenda item pertains to the transit and transportation demand management plans. And City staff is recommending the City Council to award a contract worth 395,000 for the CDM Smith team and also to amend the Measure B and base reuse'",
        "'speaker_0': 'department budgets for 100,000 from each fund. Keep in mind the City Council already partially funded this effort and up to 200,000 from the general fund. To recap, this time last year, the City Council approved Councilmember de Suggs referral on transportation planning.'",
        "'speaker_0': 'Then city staff took an initial approach to the Transportation Commission and the planning board and then returned a revised approach to you all in April that you approved and then you approved in September a request for proposal, including a work scope for the citywide transit plan and the TDM plan.'",
        "'speaker_0': 'So here we are today requesting your approval of the consultant team and fully funding this planning effort. And to step back. The reason why we're doing this is we're trying to sustain our high quality of life. We're going through an economic boom.'",
        "'speaker_0': 'We have more traffic congestion. We're seeing or expecting 2 million more people in the region by 2040. So we want to work on this issue and the key concepts are shown here. And the best way that we can see to tackle these issues is to create a shared vision on how to move forward.'",
        "'speaker_0': 'And this comprehensive planning effort is really the best way we see to do it. And to recap on the goals, we have two main mobility goals. One has to do with the island crossings, especially during the peak periods.'",
        "'speaker_0': 'And then the other key goal is has to do with our island community.'",
        "'speaker_6': 'Yes, it's a request. So we have folks in the audience and maybe watching who don't know what all those terms necessarily mean. So what are the island crossings that you're referring to?'",
        "'speaker_0': 'Yes. So being that island community, we have our bridges and our tubes. So trying to make it easier for people to get off the island in the morning and back on in the evening, since we basically more of a bedroom community, that's where the the peak direction of travel is.'",
        "'speaker_0': 'Yes. And then the work scopes of these two plans. We have the transit plan, a focus there will be on the transit related services and the infrastructure. Keep in mind that the city we own the public rights of way and so the key question will be asking is how can we make our streets more efficient for transit'",
        "'speaker_0': '? And for the transportation demand management plan, where it will be recommending how to best manage those transportation funds and how to standardize requirements on new developments. And then for community involvement. The. Main special part here is we are going to be doing a public opinion survey.'",
        "'speaker_0': 'It will be a statistically significant survey with about 400 responses expected. And another difference here with this community involvement effort is that we will be going back to the city council at four different times during the 18 month period, since it's a city council led effort.'",
        "'speaker_0': 'So that's more than we usually will go back to you with these types of planning efforts. So in the fall in October, the city received four different proposals from four different consulting teams. And then the selection committee in November interviewed the top three that you see here.'",
        "'speaker_0': 'That selection committee consisted of two city staff members, two staff members from transit transit operators, a planning board member, a transportation commissioner and a developer representative representing Alameda Landing. That's Catullus. And this selection committee picked CDs Smith team.'",
        "'speaker_0': 'They have excellent qualifications in traffic engineering, in transit planning and team planning. They are a global operation. Yet the key staff will be working with is in San Francisco and they're here tonight. We have the principal in charge as Bill Hurley and Brian Sutherland is the project manager and then Camille Salo is the transportation or transit expert'",
        "'speaker_0': '. So we look forward to working with them. They have great experience with our neighbors in the East Bay and also they've done innovative work in Silicon Valley and also worked on the Mission Bay development, which is very similar to L.A., made a point in several ways.'",
        "'speaker_0': 'CDM Smith is supported by three different sub consultants that are experts in their niche fields. Meg will lead the outreach effort. Kenji will lead the public opinion survey and Wendy Soltani will work on the team efforts and is already helping the city with the Alameda Point Premium Plan implementation.'",
        "'speaker_0': 'So it will be very helpful. So staff is requesting that the City Council award the contract to the CDM Smith team. We have seven tasks. One of the first task will be this Near Term Strategies Memo that will take back to you later this year.'",
        "'speaker_0': 'A schedule of 18 months as expected. The budget is expected is at 395 395,000, which is higher than the initial proposal because this one includes contingency as well as three additional tasks. One is pertaining to Councilmember Otis bike share feasibility study.'",
        "'speaker_0': 'We folded that one into this plan, the team plan part of it, and focus on data driven that you requested that we are going and using a vendor that works with GPS data. So making a more rigorous rigorous data.'",
        "'speaker_0': 'Emphasis. And then the last two tasks have to do with implementation, trying to make this an implementation focus, and that's an intersection analysis. And then also I guess that was the bike share that I had talked about. And like I had mentioned, city council already partially funded this effort with the general fund up to 200,000.'",
        "'speaker_0': 'And so we are requesting tonight to fully fund it with Measure B and base reuse department monies. So again, city staff is recommending City Council to award a contract for 385,000 to CDM Smith and also to amend the Measure B and base reuse department budgets for 100,000 from each fund.'",
        "'speaker_0': 'And we are here this like I said, this consulting team is here to take questions. I'm here and I'm working for Jennifer Ott on this project as well. So she is here to take questions. Thank you. Thank you.'",
        "'speaker_0': 'Any comments or questions? Nelson Remember?'",
        "'speaker_5': 'De Saag Well, thank you very much. I'll just start with the comments. First off, by saying thank you very much to my colleagues for allowing this to move forward. I mean, I think we in the city of Alameda, all of us recognize the difficulty of of traffic movement in the city of Alameda and the need, especially for'",
        "'speaker_5': 'some ability to tie together the various real estate projects that are going on in Alameda, whether they're at Alameda Point or the Northern Waterfront or other parts, to make sure that the separate traffic transit solutions that are coming out of each of the different real estate projects are somehow kind of combined so that we can coordinate better'",
        "'speaker_5': '. But I think in the presentation tonight, really the staff did a great job in laying out clearly the first, you know, what the real goal of all of this is, in addition to the, you know, tying things together, the goal is is ultimately to encourage people to get out of single occupancy mode of travel.'",
        "'speaker_5': 'And that was, goal number one, minimized, total net new single occupant vehicle trips at the island crossings. And then goal number two in an enhanced multimodal. So these are challenges that we as a city, whether we're residents, future residents at the new projects in Alameda Point or on the Northern Waterfront or even existing residents right now, who'",
        "'speaker_5': 'all of us who live here right now, these are challenges that all of us have to rise to because most of us, you know, we get up in the morning and we go through the tubes or we go over Park Street Bridge together.'",
        "'speaker_5': 'You know, it's completely possible that we could just say no to all development and and maybe that that that solves the traffic problem. But in a way, if you think about it, it doesn't. Because even if we said no to all future development.'",
        "'speaker_5': 'Right now. We still have problems going in and out of the tube in the morning. So. One of the things that we really need to do is we need to have some kind of strategy to get kind of a culture shift, to get people to to seek out alternative modes as transit, especially at the at the key'",
        "'speaker_5': 'point, at the key AM commute times. So through this process, what we're going to have is my hope is that is that this isn't just a research process, but it is the deliverables are going to be what are the actual implementable steps that are going to make not just a marginal difference, but an important difference in the'",
        "'speaker_5': 'lives of residents here when it comes to traffic and in alternative modes of transit. And for this reason, I eagerly look forward to this. And let's get to the key question. It is, you know, above $350,000. But at the end of the day, this is an issue of such magnitude that, you know, we need to do what's'",
        "'speaker_5': 'necessary to get the right answers or right strategies. And if it's 375,000 or $395,000, so be it. Then I'm I'm willing to put my name behind that, because I think we as a city, the only alternative of doing nothing is not an alternative right now.'",
        "'speaker_5': 'You just have to go through the tube right now. You know, I've been you know, people know that I've been doing these kind of funky videos of my trips through the to once you hit the tube at 7:45 a.m. or 7:50 a.m. your travel time because the tube degrades dramatically as opposed to if you get to the'",
        "'speaker_5': 'tube by 7:35 a.m.. So we need to move forward and we need to move forward in a coherent, articulate, intelligent manner. And I think what staff has outlined is going to get us there. Thank you.'",
        "'speaker_0': 'Remember Ashcroft.'",
        "'speaker_6': 'Thank you. I echoed the sentiments of Councilmember De. So, again, I just want to raise a couple of points. First of all, I really enjoyed reading the proposal that the CDM Smith Group put together, and I would recommend anybody.'",
        "'speaker_6': 'It's on the city's website, exhibit one to this item. Take a look at it. It's really interesting reading and traffic is certainly one of the most prominent issues that we as city council members hear about. And I call it the good news, bad news.'",
        "'speaker_6': 'The bad news is exactly what Councilmember De Saag alluded to. If you're trying to get off of the island in the morning or back on, it's not as bad coming back because our return times seem to be a little more staggered.'",
        "'speaker_6': 'But we do run into those problems of just getting stuck in traffic. On the other hand, last week I attended a forum in San Francisco that was sponsored by the Bay Area Council, and the topic was the direction of real estate development in the Greater Bay Area, and that was really the Bay Area as a bag looks'",
        "'speaker_6': 'at it, nine counties, 113 cities. But Alameda County is certainly a prominent part of that, a large part of the reason that we're experiencing these traffic problems and the housing problems, the rental crisis that we've also dealt are dealing with now is because the economy is so strong, because there are jobs, because employers are wanting to come'",
        "'speaker_6': 'here. But we can't. And I think most of us would agree that we want a strong economy and we want people to have jobs and not just any jobs, but good paying jobs. But the discussion also turned to the responsibility of transit.'",
        "'speaker_6': 'And we need help from the state and from the federal government. But also local governments have to do what they can to address their part in all of this. And what I was enthused about in reading the CDM Smith's proposal is they talk about getting to know, you know, the data and getting to know our patterns, but'",
        "'speaker_6': 'then also being able to apply their experience in other similar areas where they've worked to come up with innovative solutions to our problems and they will come up with solutions for the near term. So even before the end of this 18 month period of the study and all the public input process, there will be solutions that can'",
        "'speaker_6': 'be put into play and then there will be long term solutions recommended as well. And the the last thing I just want to leave my colleagues with to think about is that we then at the end of the 18 month period, need to muster the political will that it takes to actually say, okay, we're going to bite'",
        "'speaker_6': 'the bullet, we're going to follow these recommendations, we're going to adopt these innovative solutions. I think that we are going to be greatly aided by what this study is doing in pulling together the various transit providers and looking at different developments across the city to make sure that we're as coordinated and and funding as efficiently as possible'",
        "'speaker_6': '. But at the end of the day, this council will need to make some decisions about what we want to move forward with and support, and I'm confident we can do that.'",
        "'speaker_0': 'Thank you. And Brodie.'",
        "'speaker_4': 'Thank you, Madam Mayor. First of all, I want to thank my colleague, Councilmember de Song for bringing this to the council's attention. Back in January, I think we had one or two meetings discussing the concept and then we had another meeting on the budget and this was like the fourth time I think this has come before us'",
        "'speaker_4': '. So and I keep my comments brief. I have to kind of technical suggestions. If you look at exhibit five, the scope of work, I was glad to see that under 3.8 which is TDM plan the east. The memo contents will include reviewing recommendations of existing local and regional plans and policies.'",
        "'speaker_4': 'I hope that those also include, you know, the work done by Catullus at Alameda landing by Tim Lewis at Del Monte Alameda Point Partners. These are all relatively fresh TDM plans. One of the purposes of the councilmembers referral was, you know, we had these various developments and we had these various teams, but we had nothing bringing them'",
        "'speaker_4': 'together. So hopefully we can reuse and pull some of that existing research and be a little more efficient. And I also hope that, you know, as staff implements this, we do have a robust community involvement, a process, you know, possibly even some type of ad hoc committee made up of citizens that can help analyze the data and'",
        "'speaker_4': 'come up with recommendations. So just on the general thing now, has as we as council members either serve in our day to day office or we knock on doors and campaign to get here. You know, we make certain covenants with voters.'",
        "'speaker_4': 'And when voters come and tell us that traffic is a problem and that we make a commitment to address. Those issues. You know, we make a covenant with the voters to to address these problems. And I think if we ignore them and choose to do nothing, then we breach that covenant.'",
        "'speaker_4': 'And that's where negligent in our duty. So I'm really glad that we are taking this really strong, positive step towards looking at citywide traffic and the future impacts of all developments on citywide traffic and coming up with concrete solutions.'",
        "'speaker_4': 'So I applaud my colleague and I'm for bringing this to the council's attention, and I'm honored to keep my covenant with the voters and work on addressing the issue.'",
        "'speaker_7': 'I swear I'm ready to go on. This citywide approach is what we need.'",
        "'speaker_0': 'So I do I do not support this approach. When this had come just before I had wanted to do. But Oakland is doing in regards to hire a specific person. It is a staff member to work focused on her percent on Alameda.'",
        "'speaker_0': 'When it came to us before it was about $200,000 from the general fund. Now we're talking 400,000, including 100,000 for measure B and base reuse budgets to create a transit. Demand management plan. Just the plan part with the consult not to actually do any work.'",
        "'speaker_0': 'I want to respect the voters and I actually want to respect our staff. And I think if we want to really get it done as opposed to having it come back in 18 months and then longer, to get us to go through all the steps of voting on something, I prefer hiring someone, focusing on Alameda and moving'",
        "'speaker_0': 'forward similar to Oakland. I also have a concern that when we were looking at this at prior meetings, we actually do have one of these that was done years past. Then as exactly sit on a shelf, but pretty much dead.'",
        "'speaker_0': 'When I asked, had we achieved any of the benchmarks that were spoken that were supposed to have been reviewed during that time period? We did not have the data. We need more than another report. We actually could use the one that we already have, I think.'",
        "'speaker_0': 'And next and modified. I would prefer with an employee. And then and I do agree in regards to honoring our voters and getting something done. So I appreciate that part. That being said. Now. We're sorry. Just one.'",
        "'speaker_5': 'Quick point. You know, the the sewing a. I don't know how you sing the song. The saying about sewing applies here. Measured twice, cut once. So in putting together this comprehensive strategy, it's about measuring twice and cutting once.'",
        "'speaker_5': 'It might be altogether possible that one of the implementation solutions is to have a stand alone Transportation Department, ala. The City of Oakland. But I think we let's get the experts to help us kind of figure that out how best to approach that.'",
        "'speaker_5': 'So I'd like to make a motion to move staff's recommendation and move forward with this item.'",
        "'speaker_7': 'Also.'",
        "'speaker_1': 'Look, you.'",
        "'speaker_7': 'Know, I was.'",
        "'speaker_0': 'He was waiting for me to finish, but. Oh, right then.'",
        "'speaker_6': 'Okay, we have a second.'"
    ],
    "Public Hearing to Consider Adoption of Resolutions for the Alameda Point Adaptive Reuse Tentative Subdivision Map Applications:   (1) PLN15-0555 - West Tower Avenue Subdivision at Alameda Point - Applicant:  City of Alameda.  A Proposed Tentative Map Application for a 4-Parcel Subdivision for Conveyance Purposes Only on 31.8 Acres to Implement the Alameda Point Master Infrastructure Plan and Zoning District; and  (2) PLN15-0556 - Hangar Row Subdivision at Alameda Point - Applicant:  City of Alameda.  A Proposed Tentative Map Application for a 6-Parcel Subdivision for Conveyance Purposes Only on 38.9 Acres to Implement the Alameda Point Master Infrastructure Plan and Zoning District. (Base Reuse 819099)": [
        "'speaker_0': 'In a second of although some favor I oppose. I oppose motion carries for two one and. Next item. Okay. It's interesting. 6 a.m.. We do not have any speakers on the side of my other.'",
        "'speaker_1': 'Public hearing to consider adoption of resolutions for the Alameda Point, a tentative subdivision subdivision map applications for West Tower Avenue and hanger row.'",
        "'speaker_0': 'Good evening, Mayor. Councilmembers My name is Jennifer, our Chief Operating Officer. From your point, thank you for having me here tonight. Here to recommend approval of two subdivision maps, two separate resolutions, two separate. Tentative subdivision, tentative subdivision maps.'",
        "'speaker_0': 'I'm stuttering because I'm looking up here and it's hard to see where they see where they are. So let me see if I can.'",
        "'speaker_4': 'Be my glasses.'",
        "'speaker_0': 'I got a pointer. Okay, great. Sorry. So I wanted to show first before I kind of give the background what we're talking about. We're here. Staff is proactively the applicant on these. Typically you have private developers that are come forward with tentative maps in this particular case and I'll give all the background why in the city is'",
        "'speaker_0': 'proactively has hired a civil engineering firm Carlson Barbee Gibson representatives here in case you have any questions to prepare a tentative subdivision map for two areas. I want a point in the adaptive reuse area and it's hard to see, but one of them is here hang a row and then the other is the West Tower Avenue subdivision'",
        "'speaker_0': '. And so one of the actions the resolution will be to create a four parcel subdivision for about 32 acres here. And then the other is a six parcel subdivision for about 39 acres here. Now, I'm going to switch back to you.'",
        "'speaker_0': 'Is it possible for you to switch to other PDF? We want me to do it now.'",
        "'speaker_1': 'I can do it from here or.'",
        "'speaker_0': 'So that's what we hear the recommendation. But I wanted to show you just to go back a little bit and give you it'll be quick, I promise. But why we're doing this and why this city, we don't typically do this, but why in this particular case, we are.'",
        "'speaker_0': 'When we accept a conveyance of and this is intended to look busying, and then that's kind of the point of showing this map. But when we actually accept a conveyance about 510 acres from the Navy in 2013, we create a 66 parcels here.'",
        "'speaker_0': 'They all are. And the way that we created those parcels was not at all based on the buildings or the use of the property. It was all based on environmental condition of the property. And so we worked very closely with cities consultant and the Navy to make sure that we created parcels so that we'd have a very'",
        "'speaker_0': 'clear handle on what the environmental condition of different parcels and areas were with legal description. So as we went to dispose of the property.'",
        "'speaker_4': 'We could be.'",
        "'speaker_0': 'Very clear to any future developers and any future private property owners of what they were purchasing and be able to disclose those restrictions and not have the restrictions of one little piece of a larger parcel kind of essentially contaminate and unintended the larger parcel.'",
        "'speaker_0': 'So we actually created all these different parcels. But as you look at this map, obviously this does not make sense from a resource and development standpoint. And so what we're really here today to do is to start to fix that, to start to create some parcels that are really more in line with how you would see future'",
        "'speaker_0': 'reuse and develop redevelopment of the property occur. So LA can we switch back to the other. Yes, I.'",
        "'speaker_1': 'What's that? Oh, I think.'",
        "'speaker_0': 'So we are here tonight to recommend both of these. And I think the real reasons for a couple of things. This is for convenience purposes only. You can create subdivisions for convenience purposes. This is not for future development.'",
        "'speaker_0': 'I want to be clear about that. Whenever we if we were to ever have a future entitlement application or development proposal on either of these parcels or these areas that would go through the very rigorous planning process, and you'd have pretty significant conditions of approval that would be placed on those entitlement applications related to all the things'",
        "'speaker_0': 'that they'd have to do from a development standpoint. That's not what we're doing today. This is just for convenience purposes. So that really, as the city moves forward in its long term leases with options to purchase an adaptive reuse area, we have legal parcels that will allow us to convey those and that and that if they in'",
        "'speaker_0': 'the future ever come in with an entitlement application, then they'll go through that rigorous planning process that would have numerous conditions. So this is really this first step in creating legal parcels for the start to create a a logical map out there for re-use and development.'",
        "'speaker_0': 'The reasons we think this makes sense and that we think it's necessary, in fact, is obviously it creates legal parcels, but also to be able to have options to purchase. What we've heard time and time again is that in order to invest the amount of money that needs to be invested in these buildings, to be able to'",
        "'speaker_0': 'preserve them from a historic standpoint, really be able to reuse them for high intensity uses that really attracts a lot of jobs. They need significant investment. Some of these buildings, tens of millions of dollars of investment to make them usable or really good jobs for historic preservation.'",
        "'speaker_0': 'And in order to attract that type of investment, unfortunately, the city just doesn't have those funds available to make that level of investment in these buildings. And so we have to attract capital from the private market to be able to do that.'",
        "'speaker_0': 'And the private market essentially demands that there are legal parcels that come and that we can then convey those to them and into private ownership so that they can leverage the value of that property to be able to attract the kind of dollars that are necessary to preserve those buildings.'",
        "'speaker_0': 'So that's the really the larger policy context of why we're here tonight and why we think this makes sense so that we can start to transfer ownership of these put get them into long term leases with options to purchase so that we can attract the level of investment needed to preserve the buildings and to attract the jobs'",
        "'speaker_0': 'that we've heard, you know, in all of our plans from that point are really a priority from a community vision standpoint. That's my presentation. I'm happy to answer any questions that you may have.'",
        "'speaker_7': 'Thank you, Miss. Are there questions from the council?'",
        "'speaker_6': 'I'll move approval.'",
        "'speaker_7': 'I hear a motion for approval of the parcel maps as stated in the.'",
        "'speaker_6': 'Adoption of the resolution for the point adaptive reuse, tentative subdivision map applications for a West Tower Avenue and Hangar Road subdivisions.'",
        "'speaker_4': 'I'll second.'",
        "'speaker_7': 'It's been moved and seconded. All in favor. I opposed abstentions? No. Next agenda item. City Manager Communications. Communication with the city manager.'"
    ]
}