{
    "Message and order authorizing the City of Boston to accept and expend the amount of One Hundred Forty One Thousand Eight Hundred Sixty Five Dollars ($141,865.00) in the form of a grant for the Federal FY21 Title III: Expanding access to COVID-19 Vaccines via Aging Networks, awarded by the U.S. Department of Health and Human Services, passed through the MA Executive Office of Elder Affairs, to be administered by the Age Strong Commission. The grant will fund direct services to combat vaccine hesitancy, support vaccine equity efforts, and provide transportation stipends, vouchers and or other related services.": [
        "'speaker_3': 'Docket 1000. Message. In order authorizing the city of Boston to accept an extended amount of $141,865 in the form of a grant for the federal FBI Title three U.S. Department of Health and Human Services I'm sorry. Title three Expanding Access to COVID 19 Vaccines via aging networks awarded by the U.S. Department.'",
        "'speaker_3': 'Health and Human Services passed through the mass executive office of Elder appears to be administered by the Aged Drawn Commission. The grant will fund direct services to combat vaccine hesitancy, support vaccine equity efforts and provide transportation stipends, vouchers and other related services.'",
        "'speaker_2': 'Thank you. The Chair now recognizes Councilor Ricardo Arroyo, Chair of the Committee on Public Health. Chair Arroyo. The floor is yours. Thank you, Mr. Chair.'",
        "'speaker_4': 'This grant is a crucial part of ending the pandemic and protecting some of our most vulnerable populations. As a city, we need to be able to overcome vaccine hesitancy, encourage folks to get vaccinated, and ensure that we are doing so in an equitable way.'",
        "'speaker_4': 'For those reasons, I would like to ask to suspend the rules and vote on this docket today.'",
        "'speaker_2': 'Thank you very much. Counselor Arroyo seeks suspension of the rules and passage of docket number 1000. All those in favor, please indicate by saying I oppose. Nay, the ayes have it. Docket 1000 has passed. Madam Clerk, would you now please read Docket 1001?'",
        "'speaker_3': 'Thank you. Docket 1001 message in order authorizing City of Boston to accept an expanded amount of 140 South, $140,121 in the form of a grant of the American Rescue Plan Act. Titled Three D Water by the US Department of Human and Human Health and Services passed to the Mass Executive Office of Elder appears to be administered by'"
    ],
    "Message and order authorizing the City of Boston to accept and expend the amount of Eighty Four Thousand Nine Hundred Eighteen Dollars ($84,918.00) in the form of a grant for the FY21 Port Security, awarded by the United States Department of Homeland Security to be administered by the Police Department. The grant will fund BPD Harbor Patrol Unit vessels and equipment.": [
        "'speaker_3': 'Docket 1002 message in order authorizing City of Boston to accept and expand the amount of $84,918 in the form of a grant for the FBI. 21/4 security awarded by the United States Department of Homeland Security to be administered by the police department.'",
        "'speaker_3': 'The grant will fund Vpd Harbor Patrol Unit vessels and equipment.'",
        "'speaker_2': 'The Journal recognizes Councilor Andrea Campbell, chair of the Committee on Public Safety and Criminal Justice Chair. Campbell, the floor is yours.'",
        "'speaker_1': 'Thank you, President O'Malley. As a chair of the Committee on Public Safety and Criminal Justice. I am seeking suspension of the rules and passage of Docket 1002. It's pretty self-explanatory. It's in the amount of $84,918. It's a grant that we get consistently and continually.'",
        "'speaker_1': 'I think sometimes the department would like more resources, but it's of course to protect our ports, port security. But it's a relatively small amount to purchase certain types of vessels and equipment. We'd like to get it to the department as soon as possible.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you very much. Councilor Andre Campbell, chair of the Committee on Public Safety and Criminal Justice, seeks suspension of the rules and passage of Docket 1002. All those in favor, please indicate by saying I oppose. Now the ayes have it.'",
        "'speaker_2': 'Docket 1002 has passed. Madam Clerk, would you now please read Docket 1003.'"
    ],
    "Message and order authorizing the City of Boston to accept and expend the amount of Fifteen Thousand Seven Hundred Sixty Three Dollars ($15,763.00) in the form of a grant, for the Federal FY21 Title III: Expanding Access to COVID-19 Vaccines via Aging Networks, awarded by the U.S. Department of Health and Human Services, passed through the MA Executive Office of Elder Affairs, to the administered by the Age Strong Commission. The grant will fund staff time to implement expanded vaccine access services to older adults.": [
        "'speaker_3': 'Docket 1003 message in order authorizing the city of Boston to accept and extend in the amount of $15,763 in the form of a grant for the federal FOIA. Title three Expanding Access to COVID 19 Vaccines. The aging networks awarded by the U.S. Department of Health and Human Services passed to the MAX Executive Office of Elder appears to'",
        "'speaker_3': 'be administered by the H. Strong Commission. The grant will fund staff time to implement expanded vaccine access services to older adults.'",
        "'speaker_2': 'Thank you. The chair now recognizes Councilor Ricardo Arroyo, chair of the Committee on Public Health. Chair Arroyo, the floor is yours.'",
        "'speaker_4': 'Thank you, Mr. Chair. This grant funds for the vaccination efforts for our seniors and adults, older adults who are most vulnerable to COVID 19. For that reason, I would ask that we suspend and pass this docket today.'",
        "'speaker_2': 'Thank you. Counselor Ricardo Arroyo, chair of the Committee on Public Health, seeks suspension of the rules and passage of Docket 1003. All those in favor, please indicate by saying I oppose. Nay, the ayes have it. The docket has passed, moving right along to reports of public officers and others.'",
        "'speaker_2': 'Madam Clerk, would you please read Docket 1004?'",
        "'speaker_3': 'Docket 1004 communication was received from the City Clerk of the agreement between the City of Boston and 140 Clarendon. L l Limited Partnership pursuant to Chapter 121 is Section six eight of the Massachusetts General Law.'"
    ],
    "Ordinance Amending City of Boston Code, Ordinances, Chapter VII, Sections 7-2.1 and 7-2.2, Building Energy Reporting and Disclosure (BERDO).": [
        "'speaker_3': 'Docket 0775. The Committee on Government Operations, to which was referred on June 16th, 2021. Docket number 0775 An Ordinance Amending the City of Boston Code Ordinances. Chapter seven, Section seven, Dash 2.1 and seven. Dash 2.2. Building Energy Reporting and disclosure, known as Bourdeaux, submits a report recommending the audit ordinance ought to pass in a new draft.'",
        "'speaker_4': 'Thank you, Madam Chair. No, thank you, Madam Clerk. Chair recognizes Councilor Edwards, the chair of the Committee on Government Operations. Councilor, would you have the floor?'",
        "'speaker_1': 'In a moment. But before we get to the substance of the the ordinance, I'd like to substitute the committee report. There was one passed around earlier to all my colleagues. All the changes, all the amendments are just technical and slight grammatical and just for clarification purposes.'",
        "'speaker_1': 'So I move to have the new report submitted here.'",
        "'speaker_4': 'Hearing no objections, the substitution of language council. I would you may.'",
        "'speaker_0': 'You may proceed.'",
        "'speaker_1': 'Thank you all. I am excited to bring this this ordinance before the body for a vote. This ordinance has been years in the making, and it's the second version of expanding our building emissions reductions in the city of Boston.'",
        "'speaker_1': 'This this is after the result of a robust hearing with many, many people in two working sessions where we made sure that we had all of the feedback and the concerns addressed in each one of them. And I want to I want to thank again the advocates who came out.'",
        "'speaker_1': 'There's just too many organizations to to name. But they were instrumental in this in this moment and in the conversation, which I thought was incredibly respectful, informative and inclusive. It was in three languages, at least two, as all of us really recognize, that we are all stakeholders in our future and an agreement at that.'",
        "'speaker_1': 'I want to thank Councilor O'Malley for his leadership, and I'm going to go ahead and turn it over to him as a lead sponsor for any further remarks. That's okay with you.'",
        "'speaker_4': 'Thank you, Councilor Edwards. Chair now recognizes the original sponsor. Councilor O'Malley. Councilor O'Malley, you have the floor.'",
        "'speaker_2': 'Thank you. Chair, if you could just press. Thank you very much. You know you're good. I am good. One more time. There you go. Now get good. You got it. Thank you. Thank you, Mr. Chair. You got it.'",
        "'speaker_2': 'You know, fatherhood offers one hell of a perspective. Not only does it really make you or parenthood, I should say, offers one hell of a perspective. Yes, I really I just said hell of a twice on the council floor, because I'd be yelling at all of you for doing so.'",
        "'speaker_4': 'I you have a dispensation.'",
        "'speaker_2': 'Thank you. But it really has helped me sort of appreciate the important things in life and also take stock of of of what we should be grateful for. And I am incredibly grateful for standing in front of all of you and having this opportunity to bring this amendment.'",
        "'speaker_2': 'This we call it an ordinance that's actually technically an amendment. But to bring it to a vote and I'll tell you a little bit story that when I was first elected, 2010, November 30th, 2010 is when I was sworn in.'",
        "'speaker_2': 'I actually had a really good office for a month and then a month later, as the newest member, I was bumped down to what is now a niece's office and I was there languishing for many years. The other thing in those days, committee assignments were doled out strictly by seniority.'",
        "'speaker_2': 'Martin can tell you this like no matter how many years you had, if you weren't on the right side of a council presidency vote, you wouldn't get the it didn't matter. You'd get the committee based on your years of service.'",
        "'speaker_2': 'I mention this to say that the last committee that anyone wanted in 2011 was the Committee on the Environment. So it went to me the most junior member and joke's on all of my colleagues. At the time that was the committee I most wanted and have had every year for the last 11 years.'",
        "'speaker_2': 'And we've done some great things. We've done some great things together from the plastic bag ban and wetlands, community choice, energy composting, the paperless pay stuff. Did you know that there was no opportunity at the beginning when I was first elected to opt out of getting my biweekly pay stub, our our salary is set by statute.'",
        "'speaker_2': 'It's not like it's going to change. And I couldn't opt out of it in those days. And I was actually criticized when I said let's let's have an opt out feature like most banks in the 21st century. And I say that to say of everything I've worked on legislative say this is the most proud I've ever been'",
        "'speaker_2': 'and I am the one who's lucky enough to introduce this. But the fact of the matter is, it is the people behind me. It is the people to our left and to our right. It is the people who couldn't be in this room because I said we're going to limit the crowds because I'm still we're going to'",
        "'speaker_2': 'be focused on COVID and being safe. This is all of us. This is collectively the work of eight years. We did Burton 1.0 in 2013. Tom Menino deserves enormous credit. This guy had better political instincts than anyone I've ever met and never got the credit he deserves.'",
        "'speaker_2': 'But he saw this coming. We were the first city in the country to simply say, you have to manage and measure your greenhouse, get your utility usage. That's it. There was no there was a fine associated with not complying.'",
        "'speaker_2': 'But in eight years, Alison, we've we've assessed how much and fined $0 because people did it and people realized this was the important thing to do, that ordinance, by the way, it passed. But it was a it was a vote of 9 to 4.'",
        "'speaker_2': 'And it shows how far we've come as a city. It was so it seems quaint now that that there was debate over that. And I don't mean to count my chickens before they've hatched, but I feel pretty good because of the great conversations and leadership of all of you of how we're going to have this vote today'",
        "'speaker_2': '. But my point is, eight years ago we started this and this is the culmination. And it's because of the people in this room, the people who have put the blood, sweat and tears, recognizing the fact that climate change is an existential threat and it's up to cities and towns to lead.'",
        "'speaker_2': 'And we can do that. We have before us the most impactful decarbonization law that I would argue is anywhere in this country. We're going to lead on this. We've done we're not the first, but we are absolutely the best.'",
        "'speaker_2': 'We are going to decarbonize our large buildings over the next 25 years, full stop. And we're going to work to make sure that all of the work is centered around equity equality, addressing environmental justice communities and working with the institutions to get it right.'",
        "'speaker_2': 'And we had a question at that little presser earlier about the business community. It was a fair question. Business community has been largely supportive of this. Eight years ago, if you were here, Frank was here at the time.'",
        "'speaker_2': 'I think you're probably the only one here at the time. Eight years ago, when we were doing the first part of it, you had people actually lobbying councilors saying, you can't do this, you can't move ahead on this.'",
        "'speaker_2': 'You probably haven't heard from a lot of folks because people recognize the importance of what we're trying to do here. It will be absolutely ground breaking beginning in 2025 and following every five years thereafter. Through this ordinance, we'll be setting aggressive but achievable metrics.'",
        "'speaker_2': 'And that's the key point. We could have easily passed an ordinance saying we're going to decarbonize all of our buildings by 2030 and it would probably pass, you know, probably signed into law, but there'd be no blueprint to get us there.'",
        "'speaker_2': 'This actually does get us there. We're going to have aggressive but achievable metrics for buildings to reach a substantial cut in their greenhouse gas emissions. Obviously, we have different classifications and requirements for each building type from our hospitals to our commercial buildings, and we'll work with building owners to help them meet their goals and have already started'",
        "'speaker_2': 'those converts. With many, many stakeholders who are interested in getting a head start. Now, I'm hesitant to do this because I am sure I will leave someone out, so I apologize ahead of time. But I just needed to thank several individuals, starting with my chief of staff, Jessica morris, who has done such great work on my side'",
        "'speaker_2': 'on this and everything environmental for. To share. Lydia Edwards, who, you know, gave me high praise indeed, at the last working session, she said, this is the best working session I've done as government office chair, and it's largely because of her.'",
        "'speaker_2': 'She gets it. She understands it. She dives in the weeds and you facilitate an amazing process. Special shout out to Christine O'Donnell as well from central staff who has been.'",
        "'speaker_5': 'There for some. Thank you, Christine.'",
        "'speaker_2': 'Alison Breezes is our environment commissioner. She has been our quarterback this entire time on behalf of an incredible team. Brenda Pike, Kat Eshel, Hannah Payne, Stasia Shapira, Maurice Lodhi, Ben Silverman. Kathleen Hard, all working and supporting Alison. In this role, you have been marvelous.'",
        "'speaker_2': 'Thank you so.'",
        "'speaker_5': 'Much. Alison, this. Two, Chief Mariama White.'",
        "'speaker_2': 'Hammond, and before her chief Chris Cook, an unlikely duo as you will meet, but two of the most effective environment chiefs this city has ever said they helped get us here as well. Advocates. My God, many of whom are sitting behind me.'",
        "'speaker_2': 'Ricky Harvey. Andy Krasner. Anthony Camargo. Andy Wells Been. Dwayne Tindall. Sophia Owen. Michelle Brooks. Mark Lowe. Andrea Ad Carson Atkinson. And the team from one square world are off. Will, Emily, Tim and Larry from the DC special shout out for Tim Sullivan as well, who used to work here, who has been an amazing partner to me through'",
        "'speaker_2': 'this work as well, Mary Malta and so many stakeholders, especially those who are impacted by this ordinance. We've worked with all of you to achieve the best possible standards so we can all lead and achieve carbon neutrality goals.'",
        "'speaker_2': 'Our hospitals. Maskell This another instance about, you know, how the business community feeling. Maskell sent all of us a letter of support of this. That was a big gap. And if I may be a bit immodest, I will.'",
        "'speaker_2': 'I worked incredibly hard this summer working to try to find that common ground with folks without sacrificing what we set to do in this ordinance. And that wasn't always easy, but it was important and we want to get it right.'",
        "'speaker_2': 'And that's precisely what we are doing here. We're going to vote on this. The mayor is going to sign it, and we are going to cut begin cutting 37 million metric tons of greenhouse gas emissions over the next 30 years.'",
        "'speaker_2': 'This ordinance affects 4% of our total building stock. That's 3500 buildings. Yet those 4% of buildings account for nearly 60% of all building emissions. I'll be asking for a vote now on this transformative climate policy. I thank each and every one of you, my colleagues, all of you to a person.'",
        "'speaker_2': 'This is legacy stuff for all of us. This is stuff that we can say we voted on and we got it last time and I'm not going to do it again. But last time I cited all of our children's names.'",
        "'speaker_2': 'It's going to be these kids and their kids in generations to come that we are absolutely leading. I am enormously proud and grateful for each and every one of you. Now let's get this done. Thank you very much, Mr. Chairman.'",
        "'speaker_2': 'Thank.'",
        "'speaker_4': 'Thank you, Count O'Malley. Job well done. Is there anyone else looking to speak on this matter? Not seeing any. Chair Edwards and Counsel O'Malley seek acceptance of the committee report and passage of Docket.'",
        "'speaker_2': '0775 in.'",
        "'speaker_4': 'A new draft. All those in favor say i. I. All those opposed say nay.'",
        "'speaker_2': 'Doubt the vote. Yes.'",
        "'speaker_4': 'Madam Clerk, will you take a roll call?'",
        "'speaker_3': 'Please be my honor.'",
        "'speaker_4': 'Good job, man. And I had black hair when it was eight years. Well.'",
        "'speaker_3': 'I do. I get 0775. I'm sorry. Counsel Arroyo. Counselor Arroyo? Yes.'",
        "'speaker_1': 'Counselor Baker.'",
        "'speaker_3': 'Counselor Baker. Counselor Bach. Counselor Bach. I Counselor Brady. Counselor, bring Counselor Campbell. Counselor Campbell. Yes. Counselor Edwards. Counselor Edward Diaz. Counselor Sabi George. Counselor Savage. George has. Counsel Clarity. Counsel clarity is. Counsel Flynn. Counsel Flynn is. Counselor me here.'",
        "'speaker_3': 'Counselor Me here. Counselor O'Malley Yes, I was just wondering about that. Counsel Counselor. Well, yes, Mr. Chair, docket number 0775 just passed unanimously. Thank you.'",
        "'speaker_2': 'Thank you all. Thank you. This is this is incredibly special. Moving right along. That was our only report of committee. So matters recently heard for possible action. Madam Clerk, would you please read docket 0398?'"
    ],
    "Order for a hearing on the safety of construction sites in the City of Boston.": [
        "'speaker_3': 'Thank you. Docket 0398. Order for a hearing on the safety of construction sites and the city of Boston.'",
        "'speaker_2': 'Chair now recognizes Councilor Julia McTeer, chair of the Committee on Small Business and Workforce Development. Chair Here, the floor is yours.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you to the sponsors of this hearing order. On Monday, the Committee on Small Business and Workforce Development held a hearing on Docket 0398 order up for a hearing on the safety of construction sites.'",
        "'speaker_6': 'We were joined by two of the sponsors of this docket. Counselor Breeden and Counselor Flynn, who also spoke on behalf of our third sponsor, Counselor Flaherty. We were also joined by counsel, not from the administration. We were joined by IAC commissioner Sean Leon.'",
        "'speaker_6': 'I always. LYDEN Brian Doran, a building inspector with ESD, in addition to superintendents Gerald Bailey and Marcus adding from the Boston Police Department. From the Advocate's panel, we were joined by Myla Perez of the New England Regional Council of Carpenters.'",
        "'speaker_6': 'The hearing came about as a result of several reports of construction sites, accidents throughout the city, including a worker who was tragically struck and killed in 2019 while setting up our first night celebration. During the hearing. Commissioner. The Lion spelled out the current inspection process to ensure worker safety, which involves several stages of inspection during all phases'",
        "'speaker_6': 'of construction process. Contracts for contractors were also supposed to sign a marriage health Higgins affidavit, which requires the contractor to disclose any previous OSHA violations. This hearing was a great opportunity to learn about the current standards. But even one death of a construction worker is far too many, and there's a need to revisit the existing inspection process'",
        "'speaker_6': 'and make changes. For that reason, we are going to keep this hearing order in committee and hold a working session in the future to build upon our existing infrastructure. Thank you.'",
        "'speaker_2': 'Thank you very much, Councilman. Here, the chair now recognizes the lead sponsor, the district council from South Boston, Councilor Flynn. The floor is yours.'",
        "'speaker_0': 'Thank you. Thank you, Mr. President, and want to say thank you. Special thank you to council here for conducting an excellent hearing on this important topic. I also want to say I say thank you to my co-sponsors as well.'",
        "'speaker_0': 'Counsel of Clarity and counsel of Counsel Braden. And that counselor summed it up best. But one issue I did want to highlight. Was the issue of wage theft that continues to happen in our city. I know it's an issue that Councilor Edwards has worked on for many years.'",
        "'speaker_0': 'I know it's an issue that the attorney general, Maura Healey, continues to work on as well. But when we're exploiting workers by not paying them a fair wage, that also includes workers that don't have safety in the workplace as well.'",
        "'speaker_0': 'So not not only are we exploiting workers, but we're putting their health and welfare in danger and their families as well. We have a lot of work to do in this city. It's unconscionable for a construction company to come into Boston, to work in Boston, and to not pay their workers a decent wage.'",
        "'speaker_0': 'But it's also unconscionable to not provide workers a safe working conditions. So I want to say thank you to my friend Miner Perez from the Carpenters Union, but also the the Boston Building trades as well, who continue to focus on safety in the workplace.'",
        "'speaker_0': 'That's the number one critical issue, making sure. Workers are safe and protected. And that that also means that pedestrians and cyclists that happened to be in the area, as well as neighbors, are also safe from a construction site.'",
        "'speaker_0': 'So, again, wanted to say thank you to my colleague, council me here for conducting a very informative meeting. Thank you, Mr. President.'"
    ],
    "Petition for a Special Law re: An Act Providing Certain Retirement Benefits for the Widow of a Former Firefighter in the City of Boston.": [
        "'speaker_2': 'Thank you, Counselor Flynn. Docket number 0398 shall remain in the Committee on Small Business and Workforce Development. Moving right along, Madam Clerk, would you now please read docket 0562.'",
        "'speaker_3': 'Docket 056 to petition for a special law regarding an act providing certain retirement benefits for the widow of a former firefighter in the city of Boston.'",
        "'speaker_2': 'Journal recognizes that Councilor Lydia Edwards, chair of the Committee on Government Operations. Chair Edwards, the floor is yours.'",
        "'speaker_1': 'Thank you very much. We had a very good conversation and in that it was heartfelt that we understood the passing of anybody is a love of grief that you must go through. It is is intense. And the widow came and testified about the passing of her husband, a firefighter, after the surgery he had after he had rolled'",
        "'speaker_1': 'his ankle while coming down the fireplace. We heard from her. And I wanted and I as I explained, we wanted her to have her time, her space and her voice along with the Union of 718 to speak. There was a denial letter of certain death benefits to her.'",
        "'speaker_1': 'That letter was not part of the packet. And we are waiting for the retirement committee to explain what the denial was. I have committed to Counselor Arroyo that we will move this expediently as possible, and we're waiting for that letter to come in as the full, complete packet.'",
        "'speaker_1': 'An assessment is why why he was denied. I think it wasn't a misinterpretation of the law, but I would like to see that letter for that reason. I'd like to keep this in committee. And if the letter is delayed in any way, shape or form, we will move forward as soon as possible.'",
        "'speaker_2': 'Okay. Thank you. Thank you very much. Penny Communication from the Retirement Board. The chair of the Committee on Government Ops got this letter that Edwards is asking that docket 056 to remain in the Committee on Government Operations. And Clark, now, please read Docket.'"
    ],
    "On the message and order, referred September 15, 2021 Docket 0953, authorizing the City of Boston to accept and expend the amount of Twenty Five Million Dollars ($25,000,000.00) in the form of a grant for the Commonwealth Builder Program, awarded by the Massachusetts Housing Partnership to be administered by the Department of Neighborhood Development. The grant will fund the creation of workforce homeownership housing units and the long-term availability of those units to eligible moderate-income households, the committee submitted a report recommending the order ought to pass. The report was accepted; the order was passed.": [
        "'speaker_3': '0953.0953 message in order authorizing City of Boston to accept an expanded amount of $25 million in the form of a grant for the Commonwealth Builder program awarded by the Massachusetts Housing Partnership to be administered by the Department of Neighborhood Development.'",
        "'speaker_3': 'The grant will fund the creation of workforce homeownership, housing units and the long term availability of those units to eligible moderate income households.'",
        "'speaker_2': 'Thank you. The chair now recognizes Councilor Lydia Edwards, chair of the Committee on Housing and Community Development. Chair Edwards, the floor is yours.'",
        "'speaker_1': 'Thank you very much. We had a great hearing about this. The administration came through and explained both dockets, but that was a0953 was an incredible amount of money to help build workforce ownership. And so we they explained how many they expected to help out with that.'",
        "'speaker_1': 'We were talking tens of people or tens of families who will be able to do this and hopefully purchase their own home with this extra effort, this much needed money. So I submitted this committee report with the recommendation that all to pass.'"
    ],
    "On the message and order, referred on September 25, 2021 Docket #0955, authorizing the City of Boston to accept and expend the amount of Four Million Dollars ($4,000,000.00) in the form of a grant for the Allston-Brighton Homeowner Fund, awarded by the Boston Redevelopment Authority to be administered by the Department of Neighborhood Development. The grant will fund programming to foster affordable homeownership and homeowner stability in Allston Brighton, the committee submitted a report recommending the order ought to pass in a new draft.  \nThe report was accepted; the order was passed in a new draft.": [
        "'speaker_2': 'Councilor Lydia Edwards, chair of the Committee on Housing Community Development, seeks passage of Docket 0953. All those in favor, please indicate by saying I oppose nay. The ayes have it. Docket 0953 has passed. Madam Clerk, would you now please read docket 0955.'",
        "'speaker_3': 'Docket 0955 message in order authorizing the city of Boston to accept and expend an amount of $4 million in the form of a grant for the Allston Brighton Homeowner Fund awarded by the Boston Redevelopment Authority to be administered by the Department of Neighborhood Development.'",
        "'speaker_3': 'The grant will fund programing to foster affordable homeownership and homeowner stability in Allston. Brighton.'",
        "'speaker_2': 'Thank the chair now once again recognizes Councilor Lydia Edwards, chair of the Committee on Housing and Community Development. Chair Edwards, the floor is yours.'",
        "'speaker_1': 'Thank you very much. We had a again during the same hearing on 0953. We also discussed this docket and it was excited to see this money being dedicated, private dollars given to the city to help push for home ownership in Austin Brighton.'",
        "'speaker_1': 'Councilor Braden was there to discuss the much needed funds and how this would. This is an exciting opportunity for our community. Thank you.'",
        "'speaker_2': 'Great. Any further discussion on docket 0955? Seen none. Councilor Lydia Edwards, chair of the Housing and Community Development Committee, seeks passage of 0955 in a new draft. All of those in favor please indicate by saying I oppose nay.'",
        "'speaker_2': 'The ayes have it. i095 has passed now. Madam Clerk, please read docket 00859.'"
    ],
    "On the petition, referred on July 21, 2021 Docket #0859, a Special Law re: An Act directing the City of Boston Police Department to waive the maximum age requirement for police officers for Daniel Flores, the committee submitted a report recommending the petition ought to pass.\nThe report was accepted; the petition was passed.": [
        "'speaker_3': 'Thank you. Docket 0859 Petition for a special law regarding an act directing the City of Boston Police Department to waive the maximum age requirement for police officers. For police officers for Daniel Flores.'",
        "'speaker_2': 'Chair now recognizes Councilor Lydia Edwards, chair of the Committee on Government Operations. Chair Edwards, the floor is yours.'",
        "'speaker_1': 'Thank you very much. We had a incredible conversation with Mr. Flores about his aptitude, about his history, about his dedication and love of the city, his work with young people, and how he would like nothing more than the opportunity to try and serve the city as a Boston police officer.'",
        "'speaker_1': 'I recommend that we pass this docket. But I also wanted to give the floor to Councilor Arroyo, who is the lead sponsor.'",
        "'speaker_2': 'Thank you, Madam Chair. The chair now recognizes the original lead sponsor, Councilor Ricardo Arroyo. Councilor, the floor is yours.'",
        "'speaker_4': 'So Mr. Flores is a Roslindale resident who was born and raised in Jamaica Plain, has served on the Boston School Police for the last five years. And before that, I worked in a nonprofit dealing with gang involved youth and things of that nature.'",
        "'speaker_4': 'Over the last couple of years, he believes that there's a place for him in this work. He enjoys this work working directly with youth and minors. Mr. Flores has gone through the process prior to this for official, you know, to get into the cadet program and to get into the police academy.'",
        "'speaker_4': 'The furthest he has gone in was this time. However, he's coming up on the age requirement and he's I believe we passed it by three months. All this would do, which we've done this I think we did one of these just last year around the same time is give him an opportunity to go through the program.'",
        "'speaker_4': 'It doesn't make him it doesn't cut him in line, doesn't do anything like that. It just gives him an opportunity to continue to chase that dream. And so I would appreciate folks that votes on this today. Thank you, Mr. Chairman.'",
        "'speaker_2': 'Thank you. Councilor Arroyo. Any further discussion on docket 0859? Seeing none. Councilor Edwards, chair of the Committee on Government Operations, as well as the lead sponsor, Counsel Arroyo, seek acceptance of the committee report and passage of Docket 0859.'",
        "'speaker_2': 'All those in favor please indicate by saying I oppose. Nay, the ayes have it. The docket has passed motions, orders and resolutions. Madam Clerk, would you now please read Docket 1005?'"
    ],
    "Petition for a Special Law RE: An Act Relative to Boston and Non-Criminal Disposition of Fines.": [
        "'speaker_3': 'Thank you. Docket 1005. Councilors Edwards and Bullock offer the following petition for a special law regarding an act relative to Boston and non criminal disposition of fine.'",
        "'speaker_2': 'Thank you. The chair now recognizes the District Council from East Boston Councilor Lydia Edwards. The floor is yours.'",
        "'speaker_1': 'Thank you very much. I think every single one of my colleagues have heard it before. There's an abandoned building. The there's a absentee landlord. There's all of these things happening. They're not taking care of their property. It's become either a blight or an annoyance or things from that property is impacting them.'",
        "'speaker_1': 'What are you doing about it? And I goes out there and gives them ticket after ticket after ticket and still nothing changes. What we're finding and what I found in East Boston many times is that people just pay those tickets and they just pay them and move on and leave the blight there.'",
        "'speaker_1': 'And for us to all be frustrated or some of us to actually clean it up for them unless someone gets hurt. And that's the only time that people have come in and been forced to deal with it, at least in East Boston with a lot of.'",
        "'speaker_1': 'The issue that we are dealing with is that if punishment doesn't do anything, if the fines aren't impacting them, then we need to do something about the fines. And the way this works is we have to do a home repetition.'",
        "'speaker_1': 'Now, this is a formal petition that would that would allow for the city of Boston to consider a fine increase, up to $3,000 per violation. Currently, it's $300. And oftentimes, again, if you're a rich developer and you have or you're just waiting for someone to purchase your property, that's cheap.'",
        "'speaker_1': 'So I'm hoping that you will support me and say we again, Boston need to take control of this conversation and we as Boston, if you decide what is the appropriate sweet spot to encourage or force or demand of developers or whoever who refuses to take care of their property to, well, take care of their property, what's that'",
        "'speaker_1': 'sweet spot? So that's what this whole competition will do. I look forward to a robust conversation about that. Again, a lot of this is just bringing some of the local municipal concerns and issues in the hands of the people who have to deal with them every day.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Senator Edwards. The chair now recognizes the district councilor from Beacon Hill. Councilor Bach, the floor is yours.'",
        "'speaker_1': 'Thank you so much, Mr. President. And thank you to Councilor Edwards for her leadership of partnership on this. As she stated, this would give Boston the authority to increase municipal fines from $300 to $3000. And I think that that current low limit, as Councilor Edwards says, it really encourages certain actors to just blow off the municipal fine'",
        "'speaker_1': '. And and, you know, and we've all heard the frustration from our constituents. You know, many of these bad actors will go as far as to sort of just incorporate a certain number of fines into their financial planning and wait until it's actually until it can be judged to be profitable for them to make changes and fixes some'",
        "'speaker_1': 'things instead of improving conditions for Boston tenants and neighbors. And I just think that, you know, it's really important in a city where, frankly, there are larger and larger capital holders, right? Like you've got things that maybe it used to be that the property on the street was owned by an actual person.'",
        "'speaker_1': 'Now it gets swept up into some real estate trust. It's anonymous. It's hard to track. The reality is, the bigger those entities are, the more this low level fine means that it's just not meaningful to them. So this home rule petition would only raise that ceiling.'",
        "'speaker_1': 'It wouldn't, in fact raise any fines. In order for us to actually raise any municipal fines, there would be to be deliberation by this body and an amendment of an actual existing city ordinance. This is about asking the state to give us the permission to to raise certain fines to that level in order to better get the'",
        "'speaker_1': 'attention of some of these larger capital holders. And I think for quality of life in the city and being able to really induce people to change behavior when it's affecting a whole neighborhood, it's an important tweak. So I look forward to discussing it with colleagues and residents in a hearing.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilor Buck. I think before I can concentrate and the chair recognizes Councilor Edwards, the floor is yours.'",
        "'speaker_1': 'Thank you. I completely forgot to excuse me. I had unfortunately forgot to add Councilor Braden as a third party to ask to waive Rule 12 in order to add Council President as a third co-sponsor.'",
        "'speaker_2': 'My Councilor Edwards and Councilor Box seek suspension of the rules and the addition of Councilor Braden as original co-sponsor. Seeing no objection, she is hereby added and Councilor of the District Council from Brighton is hereby recognized.'",
        "'speaker_1': 'Thank you. Thank you, Mr. Chair, and thank you. Countries Edwards and Box for including me in this as an original co-sponsor, the current maximum fine of $300, which the city imposes for violations of ordinances, bylaws, rules and regulations is applied regardless of the size of the offender, whether they are an individual, a property or business owner, or'",
        "'speaker_1': 'a large corporate corporation. The current scale of fines may be significant enough to deter individuals from committing repeat offenses, but the current capital fines leaves big time chronic offenders undeterred from racking up and accumulating fines, rather than taking tangible action to remedy the violations to begin with, it's almost seen as the cost of doing business in Boston'",
        "'speaker_1': '. We must level the playing field between individual residents who may be one off offenders and the larger scale repeat offenders who chronically take advantage of the system.'",
        "'speaker_6': 'This proposal is.'",
        "'speaker_1': 'Crucial in that it would not increase current $300 fines. It would it would not increase current $300 fines to 3000 for allow the city through our body and public council hearings the ability to propose and consider specific increases in the future.'",
        "'speaker_1': 'This is an important and crucial step towards a more equitable system where we can better hold chronic offenders accountable to paying their fair share and leveling the playing field for all in our city. Thank you.'",
        "'speaker_2': 'Thank you. Councilor Braden. The chair now recognizes the District Council from South Boston. Councilor Flynn, the floor is yours.'",
        "'speaker_0': 'Thank you, Mr. President. And thank you to Councilor Edwards and our colleagues for the important work on this proposal. I had a discussion earlier with Councilor Edwards, and one issue that we've been dealing in South Boston and other locations around around the city of and partnering with the council clarity is the house parties that continue to take'",
        "'speaker_0': 'place throughout our neighborhood. And we want to see about increase in the fines so residents can sleep at night because these parties continue until 3:00 in the morning. So it's about quality of life, as is Councilor Balkan counsel Braden said.'",
        "'speaker_0': 'So maybe we can partner with Councilor Edwin Edwards with the Friendly Amendment to also discuss the same the same issue. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you very much. Councilor Flynn, is there any further discussion on docket 1005 saying none. One of the councilors wish to add their name. Madam Clerk, please add. Councilor Arroyo. Councilor Baker. Councilor Campbell. Councilor Fire City Councilor Flynn Councilor side B George Councilor me here please have a chair name and Councilor Will and Doc at 1005 shall'",
        "'speaker_2': 'be referred to the Committee on Government Operations. Madam Clerk, would you now please read Docket 1006?'"
    ],
    "Resolution Recognizing September as Suicide Prevention and Action Month in the City of Boston.\nOn motion of Councilors Arroyo and Mejia the rules were suspended; the resolution was adopted.": [
        "'speaker_3': 'Thank you. Docket 1006 Councilors Arroyo and Maria offered the following resolution recognizing September as suicide prevention and action month in the city of Boston.'",
        "'speaker_2': 'Thank you. The chair now recognizes the district council from Hyde Park Councilor Arroyo. The floor is yours.'",
        "'speaker_4': 'Thank you, Mr. Chair. September is Suicide Awareness and Prevention Month. Suicide is currently the 10th leading cause of death for adults. And when you go to the ages of 10 to 34 years old, it is actually the second leading cause of death, which is heartbreaking.'",
        "'speaker_4': 'As somebody myself who is struggling with suicidal ideation, as some members of this council shared their own struggles. We know that part of the problem is that mental health and concerns around mental health are stigmatized in a way that prevent people from seeking help and doing that.'",
        "'speaker_4': 'And so while I have the floor and if anybody is watching this, you can seek confidential emotional support by calling the National Suicide Prevention Lifeline at 28, which is 24 seven at one 800 273 talk and four for English.'",
        "'speaker_4': 'And it's actually 18818886289454 for Spanish. This is something that I'd like to. With with this pandemic, we're going to see sort of unseen levels of post traumatic stress disorder, unseen levels of trauma. And I don't think that we have adequately we didn't have the resources, frankly, on the ground to deal with trauma and things like that the'",
        "'speaker_4': 'way we needed to before this pandemic. And I think this is something that beyond just resolutions and things that we're going to do as we head into this next step of recovery, this is something that simply does just have to be a focus for us and for our city and for the country.'",
        "'speaker_4': 'And so I'd also like to thank my co-sponsor on this councilman here who has bravely shared her story time and time again. And so I hope to see real assets and real attention on this matter moving forward, because mental health is wildly important to the city and really is wildly important to everything else that anybody does on'",
        "'speaker_4': 'any given day. Thank you, Mr. Chair.'",
        "'speaker_2': 'Thank you, Counselor Arroyo. The chair now recognizes the at large council from Dorchester Councilor. Me here. The floor is yours.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you to Councilor Arroyo for co-sponsoring this resolution with us. I'm going to keep it together. Are you going to keep it together? I would also like to put out a trigger warning for folks listening in that we will be talking about a topic of suicide.'",
        "'speaker_6': 'And I think people need to acknowledge that that is triggering for a lot of folks. Last year, when we sponsored this resolution, I shared my own story as a survivor. I shared the story because I knew it was important to show.'",
        "'speaker_6': 'That that anyone could be living their lives with those dark thoughts in their head. And that is why I want to talk about today the fact that anyone could be living with suicide ideations or tendencies. A person experiencing these things may not look like what you expect.'",
        "'speaker_6': 'They may not resemble what you see in the movies or on TV. Depression and suicide. Suicidal ideation takes on many different shapes and forms that may look completely different from one person to another. That is why it's so important to check in on the important people in your life.'",
        "'speaker_6': 'To check in on yourself to. Remind the people in your life that no matter that they matter to you, even the people who may make it look like everything is fine in their lives. I also want to talk about what suicide prevention really looks like because contrary to what most people think.'",
        "'speaker_6': 'Suicide prevention is more than just sharing suicide prevention hotlines. Suicide prevention is food security. Suicide prevention is affordable housing. It's access to affordable health care, de-stigmatizing mental illness, family acceptance of the LGBTQ relatives, financial security and so much more.'",
        "'speaker_6': 'As an office, we have fought to uplift mental illness throughout COVID 19 pandemic. And all issues and sectors. And we know. That what we have, that what has been top of mind for everyone as well has been mental health and wellness, especially those who are experiencing social isolation.'",
        "'speaker_6': 'We need to continue that work beyond the pandemic and we look forward to committing ourselves to that work. I move that we suspend the rules and pass this resolution today. And think of all of those who are at home, sitting alone, feeling unloved, unseen, unheard.'",
        "'speaker_6': 'And for all of those who have lost loved ones by suicide, we send you lots of love. Thank you.'",
        "'speaker_2': 'Thank you very much, Councilman. Here, the chair now recognizes the At-Large Council from Dorchester Councilor Annie Society. George, the floor is yours.'",
        "'speaker_1': 'Thank you very much, Mr. President. And thank you to the makers, the lead sponsors on this resolution. I think it's so important that we continue to talk aloud about about suicide, about the necessary work that needs to be done to prevent suicide and to support those that have been directly impacted by this.'",
        "'speaker_1': 'Please add my name and look forward to this passage as well. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilor Sabi George. Madam Clerk, please add Councilor Ni Sabi George The chair now recognizes the District Councilor from Dorchester Councilor Frank Baker. The floor is yours. Thank you.'",
        "'speaker_4': 'Mr. Chair. First, add my name. December 7th, 1992. Michael Malone, Moldova. He called me on the phone. He was drinking that night. He had been sober for a while. He shot himself over the phone to me. I didn't even realize how much it was going to affect me till I was.'",
        "'speaker_4': 'Through what I did to to try to numb my pain for those however many years I was numb of my pain. But thank you for. I'm putting this forth when someone. Is in that position and takes themself out.'",
        "'speaker_4': 'We don't even know how bad it is. And and and also the families and the people that are around them also affected me for years. I still think of him every day. He was my best friend in grammar school and we kind of fell apart a little bit.'",
        "'speaker_4': 'He went heavy on to one side and I was trying to remain straight in my life. And so it's a way for me to honor a buddy of mine. And I appreciate it. Thank you. Counselor Roy on counseling being a very, very important.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_2': 'Thank you, Councilor Baker. And I'm quite pleased. Councilor Frank Baker. But any other councilors wish to speak on this. But any councilors wish to have their name. Madam Clerk, please add. Councilor. Councilor. Brain. Councilor Campbell. Councilor Edwards. Councilor Flaherty.'",
        "'speaker_2': 'Councilor Flynn. Councilor. Me here. Please add the chair and councilor to councilors. Arroyo and me and Baker are seeking suspension of the rules and adoption of Docket 1006. All those in favor, please indicate by saying I oppose. Nay, the ayes have it.'",
        "'speaker_2': 'The docket is passed. Thank you, Madam Clerk, would you now please read docket 1007.'"
    ],
    "Resolution Calling on Congress to Affirm Reproductive Freedom and Pass the Women's Health Protections Act.\nOn motion of Councilor Mejia, the rules were suspended; the resolution was adopted.": [
        "'speaker_3': 'Docket 1007 Councilors. Councilor may offer the following resolution calling on Congress to form of I'm sorry affirm reproductive freedom and pass the Women's Health Protection Act.'",
        "'speaker_2': 'Thank you. Excuse me. Thank you. The chair now recognizes the at large council from Dorchester Councilor Julie Amihere. The floor is yours. Season Ticket 1007.'",
        "'speaker_6': 'OC. Grandma I doing here today.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'So thank you, Mr. President. On the first of two December of this year, a bill was sponsored by the Texas state legislator titled SB eight took into effect. This bill restricts any and all abortions after a fetal heartbeat is detected, which may be as early as six weeks before most people even know that they are pregnant.'",
        "'speaker_6': 'This bill also states that anyone who is known to assist in an abortion, which may even include an Uber driver taking someone to a clinic will be fined $10,000 despite the 1973. Well, Roe versus Wade decision, essentially setting the questions of access to health and to abortion care.'",
        "'speaker_6': 'Challenges to the Supreme Court decision have been popping up across the country with the most recent anti abortion action in Texas. The Supreme Court refused to strike down the bill, allowing it to go into effect. This bill is already having devastating effects on people across the state, particularly people of color, low income individuals and trans non by'",
        "'speaker_6': 'binary people who all need access to abortion care. Because let's be clear, abortion will always be legal for people who can afford to travel out of the state or simply pay the $10,000 fine. But for the rest of us, people who are left without options and in the face of a newer and more restrictive abortion access law'",
        "'speaker_6': ', Congress has the opportunity and the obligation to protect the abortion care. That is why our congresswoman and colleague Ayanna Pressley filed the Woman's Health Protection Act, which would fight back against these attacks on abortion access and codify the right for doctors to provide abortion care free from unnecessary bans and restrictions.'",
        "'speaker_6': 'This bill needs our support not only because we need to send a message to cities and states across the country that we stand for a person's right to choose, but that we also. But but because we because also there are still deep inequities in accessing abortion care in Massachusetts that need to be addressed.'",
        "'speaker_6': 'I want to conclude on a final note. This bill is called the Woman's Health Protection Act. But it is important to remember that not just women access abortion care, trans men and gender non-conforming, non-binding individuals who also rely on access to this level of care.'",
        "'speaker_6': 'And we need to make space for them as well. This is this is what all means, all looks like. And this is why we are and this is why we were intentional about removing any gendered language from this resolution.'",
        "'speaker_6': 'It's important that we center everyone in this space. I move that we suspend the rules and pass this resolution. Thank you.'",
        "'speaker_2': 'Thank you. Counsel me here. Anyone else wishing to speak on docket zero 1007, but any councilors wish to add their name. Madam Clerk, please add. Councilor Arroyo. Councilor Baker. Councilor. Councilor Braden. Councilor Campbell. Councilor Edwards. Councilor Savage. George.'",
        "'speaker_2': 'Councilor Flaherty. Is that the Chair? Councilor Flynn, Councilor Wu and Councilor Julian here seeking suspension of the rules and adoption of Docket 1007. All those in favor please indicate by saying I oppose nay. The ayes have it. The docket has passed.'",
        "'speaker_2': 'That is all for, uh, what is before us on today's agenda. We do have one late files who are moving on to the late files. This is a one late file matter. It's a hearing order sponsored by Councilor Olivia Edwards.'",
        "'speaker_2': 'All those in favor of adding this late file matter to the agenda. Please indicate by saying I. I oppose name. Thank you. The late file matter has been added to the agenda and is before us. Madam Clerk, would you please read the first and last paragraph of the file and place it before us?'"
    ]
}