{
    "Adopts the Westwood Neighborhood Plan as a part of the Citys Comprehensive Plan in Council District 3. (NEIGHBORHOODS AND PLANNING) Adopts the Westwood Neighborhood Plan as a part of the Citys Comprehensive Plan in Council District 3. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 6-22-16.": [
        "'speaker_4': 'process. Any testimony in Spanish tonight will also be said in English to ensure those present and watching at home will be able to understand the comments. Speakers requesting language interpretation will have 6 minutes to complete their testimony to allow time for the interpretation.'",
        "'speaker_4': 'May we have the staff report?'",
        "'speaker_12': 'Thank you, Mr. President. Good evening, members of Council. My name is Steven Chester, senior city planner and project manager for the Westwood Neighborhood Plan. Also with me are two All-Star members of the planning team, Elise Hoke and Sara White.'",
        "'speaker_12': 'Here to help us answer any questions as well. So yeah, so I'm really thrilled to present the staff report for the West to the neighborhood plan. I want to start off with probably the most famous quote a planner has ever said, make no little plans.'",
        "'speaker_12': 'Daniel Burnham, who is the the master planner for Chicago and many other great cities, kind of the founder of the city, beautiful moment movement, said this quote, You know, and that's definitely something that resonated with the planning team with the community as we went through the planning process.'",
        "'speaker_12': 'You know, the need to think big, to think visionary. You know, this is our opportunity to really look into the future and and think about what's going to really help transform Westwood into one of the greatest neighborhoods in Denver.'",
        "'speaker_12': 'But at the same time adopted another phrase make many great little plans. Sometimes those really big ideas, those visionary things take a long time to implement. And so this plan kind of balances both those visionary items, along with lots of smaller, more tactical moves that we can start implementing right away.'",
        "'speaker_12': 'So, you know, all this hard work by the community can you know, they can start to see the fruits of their their work come to fruition. You know, once this plan is adopted. So just so we all know what we're talking about here.'",
        "'speaker_12': 'We're in Westwood Council District three. Westwood. It's boarding. The eastern boundary is federal. Northern boundary is Alameda. Western boundary Sheridan. And southern boundary is Mississippi. So we kicked off the planning process back in early 2015 on a really cold winter night, but we still had a phenomenal turnout by the community.'",
        "'speaker_12': 'So that's when I knew that this was going to be a really great planning process. We worked through the summer with the community, coming up with the vision, moving on to the recommendations, you know, what are the policy recommendations that can help see that vision?'",
        "'speaker_12': 'And we spent into the winter and into the spring with the plan draft, reviewing and collecting revisions from the community, getting to the plan draft in front of you today. And so the planning process was really led by the community.'",
        "'speaker_12': 'Our role as city planners is just really to be the facilitators of the planning process. But really all of the ideas, all the recommendations started with the community and everything. Every almost every word you read in that document is grounded in something that was brought up at a community meeting or an interview with a community stakeholder.'",
        "'speaker_12': 'We also had a planning team who introduced you to earlier. We said a larger technical team is made up of representatives from many different city departments. You know, they were the ones who are meeting regularly with us to make sure that some of these big ideas are able to actually be implemented by the city.'",
        "'speaker_12': 'You know, the experts, traffic engineers, water quality managers, all sorts of different members from the larger city staff. We had a tremendous steering committee made up of appointed members from the community, representatives of different neighborhood organizations, nonprofit organizations, community organizations.'",
        "'speaker_12': 'They were extremely dedicated to help guide the planning process, and they also are kind of eyes and ears into this tree. You know, whenever we had a meeting or some ideas, we want to go out into the community.'",
        "'speaker_12': 'They were the ones we really relied upon to spread the word throughout the community. Just to sum up some of that community outreach we had over, we had five actually actually six steering committee meetings. We received a number of online surveys.'",
        "'speaker_12': 'We also did hardcopy surveys in the neighborhood as well. We engaged the youth. A lot of them are here today. West was actually one of the youngest neighborhoods in all of Denver, so we felt like engaging youth was extremely important.'",
        "'speaker_12': 'We had we attended other people's meetings. You know, we had our own kind of planning specific meetings, but it was much easier to go to meetings already happening in the community. We attended a bunch of those over the the planning process.'",
        "'speaker_12': 'We had some focus groups along the commercial corridors in the neighborhood on Federal and Morrison Road, along with for just kind of larger community workshops. And we collected a lot of great feedback throughout the throughout the process. You know, just starting off from our first meeting, just asking the community, what is Westword to you?'",
        "'speaker_12': 'Just to kind of help set the set the stage for the planning process. And we heard a lot of great things like our home, our community, Westerners, opportunity Western is my mundo or my world. We tried a lot of different methods of community engagement, knowing that different people like to participate in different ways.'",
        "'speaker_12': 'You know, from your traditional town hall style meeting to a more, you know, engaging, interactive meeting or actually had the community come up with their ideal neighborhood using kind of like a game board. The kids particularly really loved this activity.'",
        "'speaker_12': 'We also want to mention that in concert with the neighborhood plan, the Department of Environmental Health and Gretchen Ami in the audience today led a health impact assessment which takes a look at the health impacts of the built environment and how the neighborhood plan could help improve the health outcomes of of the residents and the environment of'",
        "'speaker_12': 'the neighborhood. And so along the way, we, you know, really worked together to make sure those processes were in sync and, you know, collected feedback about, you know, for example, why is it hard to be healthy in Westwood?'",
        "'speaker_12': 'A lot of the things that we heard was is hard to to safely walk and bike throughout the neighborhood, to, you know, to get healthy food, for example. So all that community outreach led to this neighborhood plan in front of you today.'",
        "'speaker_12': 'I'm going to walk through some of the major recommendations. Don't have time to go into everything as much as I want to, but hopefully touch on all the high points and definitely be willing to answer any questions you may have about some of the details.'",
        "'speaker_12': 'So here we have Westwood. As I mentioned, those key corridors surrounding the neighborhood along with Morrison Road, kind of cutting diagonally through the neighborhood. And we want to make sure as we started with the, you know, the assets in the neighborhood, Westwood is already a fantastic neighborhood.'",
        "'speaker_12': 'And what we want to do is build off those existing assets. So we worked with the community, identify what are those destinations, those existing assets in the neighborhood. Which are oftentimes, you know, schools or cultural resources, but also open spaces.'",
        "'speaker_12': 'Westwood has a fair amount of open space, some more loved and more utilized than others. It also has these key commercial corridors surrounding the neighborhood. What we heard it pretty early in the process is that those corridors actually act as barriers rather than as kind of connectors to the neighborhood.'",
        "'speaker_12': 'Beyond looking at streets, something that community really wanted to focus on was alleys and taking a look at how we can use alleys in the neighborhood for more than what we kind of typically think of as more service oriented spaces.'",
        "'speaker_12': 'But opportunities for recreation and placemaking. We also push the envelope on it with green streets. So this is the combination of pedestrian infrastructure, bicycle infrastructure and stormwater infrastructure to really connect some of these neighborhood destinations in open spaces.'",
        "'speaker_12': 'Through this process, this idea of a neighborhood greenway started to kind of rise to the top as a transformative project for the neighborhood. The communities really embraced this, even come up with a new name for it, the Villa Verde, and we can go into little more details about that later.'",
        "'speaker_12': 'And lastly, making sure that all these, you know, the transportation network, the open space network really works well with the land use in the neighborhood. And so the plan really focuses on creating really stable residential neighborhoods within the greater Westwood neighborhood, but along with, you know, bolstering up some of these commercial and mixed use corridors.'",
        "'speaker_12': 'So the vision for Westwood really comes down to a connected Westwood, a celebrated Westwood and resilient Westwood. And underneath underneath each one of those vision elements are a number of different strategies, which I'll quickly walk through with you today.'",
        "'speaker_12': 'I do want to mention, though, that underneath each of these vision elements are health recommendations. Really, the the recommendations transcend all these different elements of the plan because it's through implementing all of these different strategies, we could start to see a truly healthy Westwood.'",
        "'speaker_12': 'What we do with all of our plans is also identify a number of transformative projects. And these are the projects are going to be kind of those big ideas, as we talked about before, these projects are going to, you know, probably take some time, take a lot of coordination through different stakeholders, but can really start to see'",
        "'speaker_12': 'transformative change for the neighborhood. So starting with the connected West, where there's three key strategies ensure safe, multi-modal mobility, creating green connections and enhancing key streets. Starting with that first recommendation, we took a deep dove look at the pedestrian network in the neighborhood, recognizing that, you know, funding for the pressure network is, you know, still working through'",
        "'speaker_12': 'some of those, you know, different funding mechanisms. But if funding were to come available, what we want to do is with the community, identify those sidewalks that are highest need for the neighborhood in terms of enhancement. Take a look at, you know, again, building off those open space assets and cultural assets.'",
        "'speaker_12': 'We also identified key intersections and provide some recommendations for those intersections, along with identifying key transit stops in the neighborhood and identified some potential improvements for those enhanced bus stops as well. Moving on to the Bicycle Network. This is the existing bicycle network today in Westwood, just bicycling along Morrison Road and into the future, building off of'",
        "'speaker_12': 'a lot of great work done with Denver moves, bicycles with public works, some slight modifications to that citywide plan given some new developments and new parks and open spaces in the neighborhood. What you see a lot on here is these neighborhood bikeways.'",
        "'speaker_12': 'Those are a new tool kind of in the bicycle toolbox for Denver. It's essentially a street that is still open to automobiles. However, it's designed in a way that prioritizes bicycle travel through a number of different design treatments, like different signage, different kind of traffic calming measures, public works as a whole guide kind of design guidelines for'",
        "'speaker_12': 'these bike bikeways. Actually, one is being built next court, I believe, later this year. Oop. And lastly, transit, you know, transit is also a really important transportation mode in the neighborhood. And so we're not only focused on identifying where enhanced transit corridors should exist, but also looking at the transit infrastructure.'",
        "'speaker_12': 'So the actual bus stops looking at those bus stops as opportunities for placemaking and kind of representing the unique culture of Westwood, along with embracing emerging forms of transit, we felt like that was something that was really important to highlight in the plan, not only relying on RTD, but there's some new kind of transit providers coming to'",
        "'speaker_12': 'the market that we feel like Westwood would be a great pilot neighborhood to test out some of those new providers. Moving on to creating green connections, this is the idea of creating a connected system of parks and open space.'",
        "'speaker_12': 'So this is utilizing those green streets as these connectors between the existing open spaces and also taking a look at how we can enhance the existing open space in the neighborhood. It has, as I said before, it has a fair amount of open space, but it's not really used well because it's not really designed well for the'",
        "'speaker_12': 'neighborhood. There are some spaces that are just kind of drainage ways, like we are Gulch or Excel utility easements. So we provide some recommendations from the community about how these spaces can be enhanced. It's really become well-used by the neighborhood here.'",
        "'speaker_12': 'We also have our alley priority map as well. So identifying which of the alleys are kind of the most prime for becoming enhanced alleys, given that their location in the neighborhood, maybe connecting schools or open spaces and providing a typology of different types of alleys and which alleys are kind of, you know, most primed for that type'",
        "'speaker_12': 'of enhancement, whether it's active transportation, placemaking, green infrastructure, recreation. And so Key Streets is where we take a look at some of those key corridors in the neighborhood and provide some recommendations about how these streets can really become true assets for the neighborhood.'",
        "'speaker_12': 'And so just too, for example, Morrison Road and Federal Boulevard, you see their current condition today and what the community came up with, a series of goals and what some design treatments would look like to help implement some of those goals, whether they are enhanced bicycle infrastructure along Morrison Road or enhance transit infrastructure on Federal Boulevard.'",
        "'speaker_12': 'These are just to show, you know, what a potential future would be for some of these goals that we, the community came up with for these key streets. Moving on to a celebrated Westwood Three Strategies Enhancing Neighborhood Culture, celebrating public space and promoting unity in diversity.'",
        "'speaker_12': 'Westwood is one of the most culturally rich neighborhoods, I think, in the entire city. And when you know it instantly, when you're in the neighborhood, you actually hear it. When you're in the neighborhood, you hear the pushcart peddlers with their, you know, ice cream or different food items.'",
        "'speaker_12': 'You hear that bell ringing and, you know, you're kind of in a different place. Something that's really unique to us do it. And so in this section of the plan is where we look at it, you know, what are those unique aspects of the culture in Westwood and what what can we do in a neighborhood plan to'",
        "'speaker_12': 'help to make sure that those elements are preserved and enhanced and celebrated moving into the future. So the kind of the first thing we do that, you know, being planners is, okay, let's let's map it. And so here's a map where we have all of the existing and potential future opportunities sites of cultural resources in the neighborhood'",
        "'speaker_12': '. Strategy second strategy is celebrating public space. Something that became very evident early on in the planning process is the need for more plazas, space, more spaces where the community and neighbors and family can come together to celebrate together.'",
        "'speaker_12': 'And so we have a number of different recommendations that speak to potentially where these plazas can go. And also what are the design elements of these plazas that would ensure a really successful plaza space. And also, the idea about cultivating opportunities for public life, something that's very unique in Westwood, is really celebration of the front yard in'",
        "'speaker_12': 'a lot of the homes in Westwood. And they have these really great kind of entry features. And so we're actually already working with development services to come up with some clear guidelines for these are really architecturally unique entryways with additional recommendations about street life and alley life and becoming places to really celebrate this unique culture in Westwood'",
        "'speaker_12': '. Here's an example of that. Those kind of design guidelines that we came up with for Plaza's in Westwood, this was a one along Morrison Road just to show how some of the angular parcels can be used as opportunities to create some of these really signature plazas for the neighborhood.'",
        "'speaker_12': 'The last recommendations in this section is promoting unity and diversity. So kind of sounds like an oxymoron, but it's actually the motto of the European Union. I found out. But so encouraging diversity. So we're not only talking about diversity when it comes to the residents in Westwood, but also diversity of different housing types, diversity of businesses, diversity'",
        "'speaker_12': 'of building forms. We want to ensure that Westwood is a place welcome to welcome to all along with creating a unified voice. Westwood does have a number of different, really fantastic neighborhood organizations, community organizations that are all kind of working on similar but different missions.'",
        "'speaker_12': 'And we feel it's important to come together, you know, enough to form one organization, but have a forum where you can come together and speak as one neighborhood to the city or to the federal government in order to help attract investment or attract grants to the neighborhood.'",
        "'speaker_12': 'Lastly, a resilient Western three strategies within the resilient US to promoting responsible development, enhancing the local economy and community ownership. This is where we have the bulk of our land use recommendations. Here we have the future blueprint. Denver Land Conceptual Land Use Map.'",
        "'speaker_12': 'Some things I do want to point out here that I think are really innovative for this neighborhood. First of all, is all of the single family zone districts in the neighborhood we're recommending move towards single family with accessory dwelling units.'",
        "'speaker_12': 'So that would allow for the granny flats or mother law apartments, essentially a second unit maybe in your basement or above your garage that can really kind of push the needle at a neighborhood scale for housing affordability. And also recognizing that what sort of some of the highest percentage of multi-generational families living together.'",
        "'speaker_12': 'So we feel as though this is, you know, a neighborhood primed to see a real growth of the accessory dwelling units. Also, a change from the the prior blueprint Denver map is an expansion of the pedestrian shopping corridor along Morrison Road.'",
        "'speaker_12': 'Morrison Road realize the opportunity to become a true main street for the neighborhood. But we feel as though that the existing kind of land use guidance was a little bit too restrictive to help see that kind of transformational change of Morrison Road into this true main street for the neighborhood.'",
        "'speaker_12': 'And so we've kind of, I guess, taken off the handcuffs a little bit in terms of potential parcel assemblages that can happen moving into the future. But recognizing that, you know, that's that's not quite enough. We also added Morrison road influence area it's this kind of red dashed area see along Morrison road.'",
        "'speaker_12': 'And so every you know, this Morrison road influence area has additional guidance about, you know, where commercial uses should go. What should the height transitions be from from Morrison Road down to the more stable residential neighborhoods. We worked with the community to come up to come up with the goals for Morrison Road in this influence area, recognizing'",
        "'speaker_12': 'that there probably will need to be a different regulatory tool moving into the future that would help implement this influence area that we can talk more in detail if you have questions about that. Another change here also is this slight expansion of the single family.'",
        "'speaker_12': 'So single family or such duplex land use along some of the more heavily trafficked corridors in the neighborhood and specifically in the south eastern part of the neighborhood. So moving on to maximum building heights. It's a pretty clear map when you see, you know, these really great stable residential neighborhoods at two and a half storeys, but allowing'",
        "'speaker_12': 'for increased density along Morrison Road. You know, again, working with the community, recognizing that this has the opportunity to become that real, true kind of heart beat Main Street for the neighborhood, you know, allowing for five storeys, you can have that vertical mix of uses with commercial on the ground story and some units of residential units above'",
        "'speaker_12': 'that. The five stories along Morrison Hotel is kind of most consistent with that, with that future vision. So moving on, cooking out to the transformative projects, starting with Transform Morrison Road. Here's this. The picture at Morrison Road looks today and with the community coming up with some goals for Morrison Road and what that could potentially look like'",
        "'speaker_12': 'moving into the future, those goals being improving mobility of all users, promoting neighborhoods, serving redevelopment and creating unique neighborhood, commercial and cultural district or a linear mercato along Morrison Road. The next transformer project reimagined where it gulch. This is primarily a flood control infrastructure in the northwestern part of the neighborhood actually reaches all the way to the'",
        "'speaker_12': 'South River. There's a longer, longer term study going on currently by the Army Corps of Engineers looking at the future enhancements to this corridor. So what we want to do is make sure that we captured the voice of the neighborhood in terms of what did they want to see as we goal is potentially that becomes enhanced moving'",
        "'speaker_12': 'into the future. And so those those three goals were creating an intuitive and safe, multi-use trail, providing additional open space amenities and being sure to create a thriving natural ecosystem that reduces flood risk. Because at the end of the day, that's the primary kind of role of this infrastructure in the neighborhood.'",
        "'speaker_12': 'Next creating a neighborhood greenway. As I mentioned before, on this map, we have the opportunity to link together Weird Gulch with Westwood Park, with Morrison Road, with this existing Excel utility easement all the way to this kind of node of cultural and educational resources in the southeastern part of the neighborhood.'",
        "'speaker_12': 'Here's a picture of that existing Excel easement. As you can see, it's not incredibly well utilized by the neighborhood. It's you know, it does have this trail that doesn't really link to anything, you know, a broader network. And so some recommendations and goals from the neighborhood create intuitive and memorable network.'",
        "'speaker_12': 'You know, enhance this Excel easement, encourage community use agreements with DPS because this could link together some existing open spaces with at parks or sorry, at schools in the neighborhood and also utilizing this idea of green streets to help create this via verde through the neighborhood.'",
        "'speaker_12': 'Another transformer, a project focusing on strengthening community resources. This was something that we heard loud and clear from day one in the neighborhood as the desire for a West Denver recreation center ideally placed in Westwood. And so, you know, that is front and center in this transformative project, along with recommendations that speak to some of the existing'",
        "'speaker_12': 'resources in the neighborhood and what are some steps and some recommendations that those existing resources could do to help kind of kind of fill the gaps in terms in terms of some of the existing services in the neighborhood.'",
        "'speaker_12': 'Improve healthy food access, another transformative project that's critical in the neighborhood. We have a great partner in the neighborhood where Vision is doing just absolutely fantastic work in terms of increasing opportunities for healthy food access and economic development in the neighborhood.'",
        "'speaker_12': 'So this there will be tremendous partners in helping us implement some of these recommendations that speak towards expanding opportunities for food production, providing opportunities for food processing, increasing accessibility for food access and distribution, diversifying the retail options of healthy food in the neighborhood, and developing potentially neighborhood scale pilot projects.'",
        "'speaker_12': 'You know, some ideas have already been discussed around composting and some other pilot projects. So that was the plan in a nutshell. I want to really quickly, so now I want to talk about some of the opportunities for feedback since we've had this plan kind of out for review.'",
        "'speaker_12': 'We held our last steering committee and also had a community workshop focused on the actual plan and collecting comments from the community. The plan was posted for a month. We had executive summaries translated into Spanish as well that were dispersed throughout the entire neighborhood.'",
        "'speaker_12': 'We had online survey along with hard surveys available, I think six or seven different community destinations sprinkled throughout the Westwood neighborhood. And we had a public hearing at planning board not too long ago. Some comments that we heard from the community that 100% have been addressed in the new and in the plan that you see today.'",
        "'speaker_12': 'This idea about the priority intersections and priority bus stops that I talked about that came out of the the community, some adding some additional transit recommendations, additional focus on plazas, some work with the community about where we could expand some of that single family duplex area, as I talked about earlier.'",
        "'speaker_12': 'The community really wanted some stronger language about the need for a rec center in the neighborhood. So we're happy that we were able to get that into the plan as well, along with just some, you know, continuing editing for clarity and correctness.'",
        "'speaker_12': 'So we had a hearing planning board on June 15th. The planning board voted unanimously to approve the plan. We had public comments and testimony from a number of really great community partners who spoke at the hearing or provided letters of support.'",
        "'speaker_12': 'I think some of them are here today as well. And so with that, I want to give this fantastic birthday present to Councilman Lopez and recommend adoption of the West of the neighborhood plan as a supplement of the Denver Comprehensive Plan.'",
        "'speaker_12': 'I think we have a number of speakers signed up, but I'll be here to answer questions as well.'",
        "'speaker_4': 'Thank you very much. We have 15 individuals signed up to speak this evening. I'm going to call the first five speakers. I'll do my best to correctly pronounce your names. If you could make your way up to the front bench by the microphone, that will help speed up our proceedings when I call your name.'",
        "'speaker_4': 'So the first five speakers will be Monique Lovato, Gabriela medina, Michael Juarez, David Lopez, and Luis Martinez and Monique Lovato. You can come right up to the microphone and begin.'",
        "'speaker_3': 'Thank you, Monique Lovato. 187 East 28th Place in Denver, Colorado. Also, I'm the CEO of Newcastle Resource Center. And on behalf of the Board of Directors in the staff of Newcastle Resource Center, we are here to support the Westwood Neighborhood Plan and its resident led process.'",
        "'speaker_3': 'We feel honored and privileged that this time next year our new home will be in Westwood at Alameda in federal. This new headquarters being completed during the 40th anniversary of Newcastle Resource Center, represents our future and sets us up for success for Newcastle second 40 years.'",
        "'speaker_3': 'We are looking forward to serving westward in all of southwest Denver and bringing resources that we hope will contribute to a vibrant and strong Westwood, including the Small Business Administration. We host the Women's Business Center of Colorado and the only SBA center providing all of our programing in English and Spanish.'",
        "'speaker_3': 'We bring the City of Denver's new workforce system with us as one of its key community partners. We bring the US Patent and Trademark Office hosting pro-bono pat that pairs low income inventors with pro-bono patent attorneys to help people through the process of establishing patents.'",
        "'speaker_3': 'We bring evidence based programing for youth and family development, career training, business start up and expansion support for underserved families without access to traditional resources. In 2015, along with our partners, we serve 6500 families. We helped 82 new businesses get started.'",
        "'speaker_3': 'We ensure that 95% of our career participants were still employees six months after they completed our training and secured a job. And more than 50% of the young people who attend who attended our after school enrichment increased their GPAs.'",
        "'speaker_3': 'Westwood has so many natural resources that you heard about today. They inspire our staff and our partners, including the youth of the neighborhood. Its entrepreneurial spirit. Its diversity. And its strong family foundations that we can build on. And support westward to become a prosperous and thriving part of Denver to attract the rest of the metro area for'",
        "'speaker_3': 'the culture and the vibrancy of the neighborhood. Finally, Latinos are the predominant culture in Westwood, and Latinos are the largest segment of the U.S. population that still really, really believes in the American dream. According to a 2015 study by the Aspen Institute, 80% of Latinos believe in the American dream of working hard to get ahead building today'",
        "'speaker_3': 'for our children tomorrow versus 50% of other communities. This belief in that spirit of entrepreneurial ism gives us that Makassar Research Center the hope and the inspiration to continue to do this work. It makes us excited and anxious to get to Westwood and begin our work shoulder to shoulder with you, our neighbors in Westwood.'",
        "'speaker_3': 'Thank you for being so welcoming to everyone from Newcastle Research Center. Thank you.'",
        "'speaker_4': 'Thank you. Next up, Gabriela medina.'",
        "'speaker_9': 'When I started this. Gabriela marina. You'll be one, and I will see those with much more strength. Denver, Colorado.'",
        "'speaker_3': 'Hello. Good evening. My name is Gabriela medina. My addresses 972 South Quitman, Denver, Colorado 80219.'",
        "'speaker_9': 'Gracias. Por el planned investing that in this presentation is my emotion and.'",
        "'speaker_3': 'I want to thank you for the neighborhood plan that was presented. It is very exciting.'",
        "'speaker_9': 'But at the minute to keep up with the on center the recreation paradise travel scenario establishing that is I say one Thomas Hoban yet Vietnam which NSC.'",
        "'speaker_3': 'That but I'm also here to ask for a recreation center for our neighborhood. We are the second youngest neighborhood and one that is that has a lot of needs.'",
        "'speaker_9': 'Just a reminder that those ninos one and then they are alone always see that union much sympathy that the system is more important than getting an activity that fisica is impressed with scandalous programs, better treatment for other members in that you know.'",
        "'speaker_3': 'I am a mother, I have two children. One of them is leaning towards obesity and another son that is very hyperactive. And I'm always looking for activities for them. And sadly, there is an activities and programing in our neighborhood, and I'm having to look elsewhere for them.'",
        "'speaker_9': 'And I've not been transported by that rajawadi I shouldn't be that good. Just continue unconscious activity that is to support us process important. Okay. So then the support in the city tomorrow center the recreation parent service in that.'",
        "'speaker_3': 'So sometimes transportation can be an issue. So that becomes hard for me to take them elsewhere. But that is why I'm here asking for you to support a recreation.'",
        "'speaker_9': 'Center as a moment in the city that is existent or transit that person that cannot in an opportunity that is that friend of status and mental care trailblazer just priorities as well as more important concerning your sustained activity as bandage as the LASCARIS of among some of the most kind of star scenario denim which has as the'",
        "'speaker_9': 'the drug addiction the vandalism.'",
        "'speaker_3': 'I'm here to speak on behalf of other mothers that aren't able to speak here today. And I'm just requesting this because our community has a lot of needs. We have to continue programing in our community. We have drug addiction problems, gang problems in our neighborhood.'",
        "'speaker_3': 'So this is why this is such a big need.'",
        "'speaker_9': 'So I must get the needless act. The evil sister is just concerned isn't the same important as incentive care programs. But I guess I'm just gonna play this Tyra's. I've been one which by the central pharmacy in which I need to get on Salas and Casa.'",
        "'speaker_3': 'So this is why programing is so important. To make sure that they. They stay active and they have activities on a regular basis. We know that there are a lot of parents that work and cannot be with their kids.'",
        "'speaker_9': 'But it's just an important thing that is the center of the recreation circle. But I can just put on Instructables, Amy.'",
        "'speaker_3': 'And that is why it's so important to have a recreation center close to that neighborhood so they can be active where they're at. When I say sports attention. Yes, better support. I hope. I hope for I hope to have your support.'",
        "'speaker_4': 'Thank you. Next up, Michael Chavez.'",
        "'speaker_11': 'Hi. And good afternoon. My name is Michael Kors, and I'm here to talk about why we need a recreation center in Westwood. I've been living in Westwood my whole life and it's been pretty hard to find extracurricular activities because school ends very late and in the weekends, there's not much.'",
        "'speaker_11': 'And. We have to spend a lot of time just driving to like the pools or a park that has a like pool. Sorry to hear this. We need it because there's not many resources around Westwood to help us, like, be active, be outside and invest.'",
        "'speaker_11': 'I just recently joined a group to help improve our community, to get kids to go outside and be part of nature. And I think it's going very well. But we are we've been striving to find a recreation center for our neighborhood on, but we just cannot find the funding or the place because not a lot of people'",
        "'speaker_11': 'know we need one because everyone thinks it's all right. But really, it's not because there's kids everywhere getting in trouble just because they want to have fun and they don't have fun the proper way because they don't have a place where they can have fun and they just go out on the streets, you know, and they join'",
        "'speaker_11': 'gangs, do drugs. But that's just reality because. People just they just leave them how they are because they don't want to go that extra footstep to find them a better place to be. And our community just. Not there yet.'",
        "'speaker_11': 'And I think the recreation center will help us be better and as a group and. I think it's going to help us. Come closer to each other and have our diversities. And yeah, that's all I had to say.'",
        "'speaker_4': 'Thank you. Next up, David Lopez.'",
        "'speaker_8': 'Good evening. My name is David Lopez. 973 Clearway Denver, Colorado. 80204. I come here as a youth organizer in Westwood. So I live in the Sun Valley neighborhood, but just working in Westwood made me more passionate to be a youth organizer and give more back to the community.'",
        "'speaker_8': 'And being a Latino myself, seeing that in this community, I want to do that as well. So I'm lucky enough, enough to have a board of 12 students from the Westwood neighborhood. And what we do is we're focusing right now on the Goku inspired grant, and we're working on bettering the community overall parks, you know, areas that'",
        "'speaker_8': 'they need, playgrounds and rec centers is really much needed not only for the recreation part of it, but the programing part of it. We're trying to focus on leadership skills, development skills for the youth civic engagement and just preparing them for the future.'",
        "'speaker_8': 'As my partner just mentioned, Latinos are very high here in Colorado and Westwood is an image of that. My students are great and I've never really seen a leadership type of program in Westwood. It's mostly development, so this is a brand new thing that we have in Westwood and it's been going great.'",
        "'speaker_8': 'They have a lot of input. They finally have a voice for their own community and that's what we need more of. And I believe a rec center can bring that. We can meet there. We have a meeting space.'",
        "'speaker_8': 'We would have more activities for them. So they're not in the streets and just getting out in nature and get them away, you know, from all that bad stuff. But just being a youth organizer in there has taught me a lot and I just want to show them that youth organizing and the rec centers and.'",
        "'speaker_1': 'These good programs.'",
        "'speaker_8': 'Are beneficial to youth in general. So I hope you support the rec center. They deserve it. They need it and hope we can get it there for Westwood. Thank you.'",
        "'speaker_4': 'Thank you. Next up, Luis Martinez and I'm going to call it the next five, if you can make your way to the front bench. So you're ready to reveal Kristine House, Norma Brambilla, Brandon L and Rachel Cleaves. And you can begin.'",
        "'speaker_9': 'Good evening. My name is Luis Martinez. I'm 14 years old and I've been a resident in Westwood for 14 years old since I was born. And, well, I'm here to talk about the recreation center that I want in Westwood that we all want in Westwood, because it's very important for us, like the kids, to have a recreation'",
        "'speaker_9': 'center, to like get off our phones, go to nature, and like also because mainly, mostly all the teenagers are now involving in gangs and drugs and everything. And with the recreation center, it would make us like go out to have fun and socialize with other people and also be like more creative and not be like stuck in'",
        "'speaker_9': 'our home watching TV, being on our phones and technology also because in my, in my, in my, in my, like, in my experience, like, I haven't had a vacation around me and I always have to go, like, to Barnham, which is very far from my house also to to at the MA, which is in federal and Colorado'",
        "'speaker_9': '. And it's very far from my house, too. And mostly I just don't get out of my house because it's my mom says it's dangerous because there's a lot of like teenagers and that are like in gangs and everything.'",
        "'speaker_9': 'And she thinks that they could get me involved in gangs, too. So pretty much want a recreation center around like my neighborhood in Westwood because I want like my teenagers to socialize and be more like likes to focus on school and not like on drugs because mostly every teenager is dropping out.'",
        "'speaker_9': 'Dropping out because they don't want they don't have like socializing with other people and. Yeah, that's all. Thank you.'",
        "'speaker_4': 'Thank you. Next up, Siri, Toribio.'",
        "'speaker_9': 'Oh, hi. My name's Say, you need to review 14 years old. I'm in Westwood, resident for seven years. I really like to be involved in my community. Um, I've seen the necessity of places or kids and teenagers like.'",
        "'speaker_9': 'They need a place to have fun and and be involved in activities. Uh, they don't really have a safe environment because they, there's a lot of kids just like outside on the streets, like, um, until late at night and like, they don't have anything educational when they could and.'",
        "'speaker_9': 'I know a lot of families that both parents work and like the kids don't have, like the full attention they need. And sometimes they can seek that in the recreation center because there is like there could be a friend that's close to them and like they have something that they need.'",
        "'speaker_9': 'They're like. Almost all of the kids stay inside to. To play on their phones or video games. Like, from my personal experience, I know I know a person who has depression and like, I think that caused it because he's he's always inside.'",
        "'speaker_9': 'Like, he doesn't really go out and he doesn't mean you people and like if they had a recreation center, maybe that could help him talk to more people and become more social. Mhm. Oh. Like Lou said, we don't really have recreations in our clothes, so we have to walk to, um, Barnum.'",
        "'speaker_9': 'And, like, sometimes it's really packed, and we have to wait when we're like, the ones in our community always helping, like, cleaning alleys and like we do, we just serve fun because we've really helped our community get cleaner and safer.'",
        "'speaker_9': 'And with the. A. Oh. Make our community really safe. Thank you.'",
        "'speaker_4': 'Thank you, Christine House.'",
        "'speaker_3': 'The evening. Christine has 4444 Morrison Road. And I'm going to look at a different aspect of this Westwood neighborhood plan. And it's for businesses. We've got a warehouse space in 4444 Morrison Road. We've got seven very active, very vibrant businesses in that building.'",
        "'speaker_3': 'And now in this new plan, it's suddenly off the map. It's not there. It's replaced by one of these plazas. I'm not sure how or why. All of a sudden our building is gone and you've decided to put some different things in there.'",
        "'speaker_3': 'But I guess I kind of resent that. We've been there for over 40 years and with having all these different little businesses that supposedly were embracing cultural diversity, I mean, we're actually a very go to shop for a lot of the needle workers and different stitching people in the city and county of Denver as well as the'",
        "'speaker_3': 'whole USA. So there's a lot of other little businesses. We've got a marble and granite tile company. We've actually got a gentleman that is working on composting that is trying to get a variance. Right now he's working with revision, but for some reason they're having difficulties getting the code change to help him get his business going.'",
        "'speaker_3': 'We've actually got another contracting business back there and a bicycle repair shop, so I'm just not sure. And I guess that's more of my question. I don't feel like the businesses along Morrison Road were very, really included in a lot of this planning, and I'm very disappointed with that.'",
        "'speaker_3': 'And it's only because of my digging that I happened to come across this Westwood neighborhood plan by accident. So we get a couple of notices, but it's like it's very sporadic and it was not really we did not feel inclusive.'",
        "'speaker_3': 'I mean, we probably have one of the nicer locations on Morrison Road that's not going to take a lot of money to revitalize. But I guess I just don't understand because down the road, if we look to try and sell our businesses and our building there, this new quote unquote neighborhood plan is going to put a lot'",
        "'speaker_3': 'of limitations on who we can sell to. But with it looking on the maps like there's nothing there for a building, we're very concerned about that. So I hope you kind of take a look at the plan and tell us what are we supposed to do?'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you. Next up, Norma Brambilla.'",
        "'speaker_3': 'Well, when I started. Norma Brambilla. Hello. Good evening. My name is not be left. So in a resident for 29 years I've been a resident at in Westwood for 20 years in San Jose now says cuatro cuatro on the street at 15 years and 644 South Newton Street.'",
        "'speaker_3': 'And the dome, which I said this skittle that perched on my wrist that the Emperor of London was in, that he was, look at this, put it and thought, well. And I want to before anything, I want to thank you for looking at this Westwood neighborhood plan that after so, so many years and so much time that'",
        "'speaker_3': 'we've been able to accomplish this. Well, look, is this trivial? I'm going to read this because I wanted to write it, but I'm also totally Graham is, you know, the grand ayatollah is the plan that instead uses DNA and as the momentum for us it's a great help this document this plan that you have in your hands'",
        "'speaker_3': 'right now. I use an established recommendation, this process by me not on all to divide on economy. I don't partizan on this issue that is consistent in the service industry. Those experts at walk through our neighborhood and we're able to see some of the needs that we're that we have in our neighborhood know unite anthocyanins espresso is'",
        "'speaker_3': 'companero from receiving this and so many concerns and so many needs that my friends and partners have also expressed at my solicitor's as well as one central regulation will not get carried symbols apart. This is Brussels. Where does one get the sanctions?'",
        "'speaker_3': 'When? When is Saddam? And one of the the greatest recommendations is a rec center. For our community because we are missing green spaces, we're missing a wider sidewalks or things that are sidewalks are not in good shape. And we're missing safety.'",
        "'speaker_3': 'We're like in safety. But I can assure you that most people support the do not give you that physical necessity almost as much as possible for us to be able to let our kids outside, let them go outside and play.'",
        "'speaker_3': 'We need these spaces. That is what is on the board. Almost establishing Masa to be that fisica e programmers or areas that we can establish a more physical activity or programs is over at looking at all the signals string socialization is now neon and a service that in most of our to be able to establish those relationships'",
        "'speaker_3': 'between neighbors but also trusts when necessary that one central direction for us this is a need. The rec center is a need for the important familia because we have to leave our neighborhood to be able to spend some time with their family.'",
        "'speaker_3': 'Yep. Southern Super LA Basket System. No grandmas. Even though we have these barriers, we're still able to do it. It's just another way that the transportation mediums, the empl, we have barriers of transit of of time, of of language that the input para nosotros is that law.'",
        "'speaker_3': 'But I familia the time that we have is a great value for us to be with families. But I said almost no slogan as obvious as I'll say this, but I thought it also showed us, like our youth express, sometimes we have to wait 2 hours yells we not as in through the regulations as yet, and poor'",
        "'speaker_3': 'quality, incidental. And at the end of the day, at the end, the rec center closes down for any reason. I must win the title cancel. Yet love is so we end up being frustrated and tired at the end of the day.'",
        "'speaker_3': 'Yeah. Love is another thing. It will not even for me. And at the same time, we're still lacking. We're still missing out that time that we could have spent with families. Esperamos. Esperamos. Approvazione. But I step blunderbuss in the latter.'",
        "'speaker_3': 'We wait for your approval for our neighborhood plan. You can see the Amber List rebellion in a society of necessity and at the next Bon for Denver that you would distribute the this in the areas that are most needed in Denver.'",
        "'speaker_3': 'But most of us in the area is not necessary. That's essential for our community, for our neighborhood. This is a need to have a recreation center. And it's almost the little kids that look at us for the saddest of.'",
        "'speaker_3': 'And I said, that is another of my small business elements of equal Amazon, things I do that gets you say our neighborhood is one of the youngest one of the ones with the highest rate of obesity and one with highest is lack of safety or insecurity.'",
        "'speaker_3': 'In looking at his demos as well as my recollection, my super programmer Sparano through scoring is what we need is more recreation, more programs for our youth because we're not here for Talisman talent. That their energy and their mental strength, love and wisdom that they can show this and in their schools and stuff.'",
        "'speaker_3': 'Los Ninos Catalan Masorti with their fisica. Some of those memories and that it is shown that those that have more physical activity, those students that have more physical activity, perform better academically as those go and see those are not what you have.'",
        "'speaker_3': 'Almost always in the middle Muslim people might say, these are Your Holiness, these youth. These students have helped our neighborhood by cleaning and volunteering and making all these changes and helping Representan go into them. Representing one of the youngest communities in Denver, young kids, and I've got a similar this past year as well as Hipparchus, even though'",
        "'speaker_3': 'we are lacking of green spaces in parks that most residents, although most candles are not for yellow Jamaicans but Marco wears well. We thank everyone who has supported us through grants to improve our Westwood Park. Yep. And out of this one, the one thing I don't see the perennial Washington park it even that even then we won't'",
        "'speaker_3': 'have a city park or a Washington park, get a muslim park, Masada, as well as by dinosaurs. We just want more green areas for our kids established. There must be that physical activity in that and to establish more physical activity and water in a safe space in Central Park, that would that would be a rec center for'",
        "'speaker_3': 'them. Westwood deserves this grass. And thank you.'",
        "'speaker_4': 'Thank you. Next up, Brandon ELL.'",
        "'speaker_9': 'Hi, my name is Brandon Loya and I've been a resident of Westwood for all my life. And I would like to talk about the recreation center idea.'",
        "'speaker_3': 'And how I like it because it.'",
        "'speaker_9': 'Can motivate like children to like, be doing like physical stuff and not be just in the house.'",
        "'speaker_3': 'Because if they stay like in the house, playing video games and eating.'",
        "'speaker_9': 'It could cause like obesity and health problems, which would be bad for the community. Also, I think that this is bad because our neighborhood is the youngest, which means that this shouldn't be happening and that like how the West, the former in Special Park has helped a lot because.'",
        "'speaker_3': 'It's like it's always park.'",
        "'speaker_9': 'There, which means that there's a lot of kids like doing physical stuff and which means that they're.'",
        "'speaker_3': 'Getting healthier and they're using like nature.'",
        "'speaker_9': 'And one of the problems is that, like, there's not, there's like, no, no, like, fun stuff to do for kids, which means that we have to, like, drive a long way to other pools. But that's a problem also because it's like super far away and we don't have nursing care.'",
        "'speaker_9': 'And also because like once we go to other pools and stuff like that and other recreation centers, it means that it's far away. And when there's a lot of when there's nothing and like there was one area which means that like when everybody goes to other recreation centers, it means that it's always packed, which means it doesn't'",
        "'speaker_9': 'give us space. And that's a bad thing. And. And I would like to talk also.'",
        "'speaker_3': 'About safety issues, which means that, like.'",
        "'speaker_9': 'If you want to take a walk in the night, like when it's like usually.'",
        "'speaker_3': 'Like.'",
        "'speaker_9': 'More colder.'",
        "'speaker_3': 'You can't because there's always like.'",
        "'speaker_9': 'Gangs walking around. There's always like something dangerous that you're scared of. And that's all I would like to talk about.'",
        "'speaker_4': 'Thank you. Next up, Rachel Cleveland also has the last five speakers to come up to the front. John Gomez and Claudia Marsala, Philip Hawes, Rachel Prestwich and Naomi Enriquez.'",
        "'speaker_3': 'Hello. My name is Rachel Cleaves and I am the executive director of West Virginia. Those and my address is 1243 Osceola Street. So I want to say a little bit about West Leonidas. We've been organizing in Southwest Denver for the last nine years in Westwood, and when we first started, Westwood was the neglected neighborhood.'",
        "'speaker_3': 'It was the neighborhood that felt like it had been forgotten by the city. And I want to be here today to thank all of you and the planners and Councilman Lopez for turning your attention to the Westwood neighborhood.'",
        "'speaker_3': 'And I think this plan took years to happen. A lot of advocacy from our city councilman. And it was that leadership that led us here today where we've been presented with a plan that I think reflects the the needs of this community.'",
        "'speaker_3': 'I think the plan is based on a very robust public process. Something I very much appreciate is that there was significant effort put into translation at all meetings and all of the presentations and even here today. And also that the planners didn't just ask the community to come to them, but rather that they went out into the'",
        "'speaker_3': 'community. They went and attended community meetings and they made sure that they were available and they worked with nonprofits and residents to get the word out about the process. Something else that was fantastic was that the neighborhood plan partnered with the Department of Environmental Health to do a health impact assessment.'",
        "'speaker_3': 'The data that was come out of that health impact assessment showed that Westwood is the most has the highest obesity rate among children in the city of Denver and really was able to link those high rates of obesity to the lack of access to recreation, walking and biking and healthy food.'",
        "'speaker_3': 'And we thank our city planners for putting so much effort into seeing how they could change the street's streetscape and make this neighborhood a place where people can truly be healthy. However, unfortunately, we haven't started the work yet, so what we are here to do today is to ask you to move forward with these recommendations, to access'",
        "'speaker_3': 'the resources of the 2017 bond in order to make sure that this most young neighborhood, most obese neighborhood in the city and most underserved for recreation receives those centers where kids can be positive and be active. We also want to encourage the city council to pilot many of the walking and biking projects that you hope to achieve'",
        "'speaker_3': 'in the city, in this neighborhood where there is so much need. And I think that's. Oh, no, how could I forget? No one thinks the community yet. The only reason that this this neighborhood plan is a success is because we had fantastic planners and because we had residents that were at the meetings and who were working in'",
        "'speaker_3': 'partnership with the government. And these are lives.'",
        "'speaker_4': 'I'm sorry about your time.'",
        "'speaker_3': 'That's okay. Thank you.'",
        "'speaker_4': 'Thank you. John Gomez.'",
        "'speaker_1': 'You're going to be that guy.'",
        "'speaker_9': 'Hello. My name is John Gomez, and I'm 15 years old. I live in Westwood. My whole.'",
        "'speaker_11': 'Life.'",
        "'speaker_9': 'And I think we should have a rec center and more. Yeah, I think we should have recorded because. I'm sorry. Because there's younger kids and some older kids that need more resources so they can stay in school and they could get help with their activities, activities at school.'",
        "'speaker_9': 'And so they don't have to be always on the streets. And like I have my two older brothers, they one just dropped out of school and one just had a baby and. I wouldn't want my son to grow up in the streets, too.'",
        "'speaker_9': 'I would want them to have more resources so that they. So that they can do better in life and that. They can stay in school and that they're yeah, there's the Boys and Girls Club and there's Garfield Park.'",
        "'speaker_9': 'But that's not really like a rec center. They only have a swimming pool and that's about it. And the boys in those club, it's mainly focused on little kids. What about older kids like myself and other youth that I work with?'",
        "'speaker_9': 'And I think it's best if we have opportunities to. Yeah, I know. Don't.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_4': 'Thank you. Next up, Ana Claudia Marsala. They get that kind of rate.'",
        "'speaker_9': 'Good evening. Not cloudy magallanes. I live in 1200 Vine Street, apartment four F in Denver, Colorado 2006 Bucharest has been part of the neighborhood planning process since the beginning, but has been heavily involved with the Morrison Road Streetscape mission and 14 of this plan.'",
        "'speaker_9': 'On behalf of Quest Board of Directors and Staff. I would like to express our support to most of the recommendation with a couple asks. We are very supportive of the mcaleny our vision of bring forth from the community to farmers who corridor their streets their streets streetscape plans is speaks to the implement of this vision.'",
        "'speaker_9': 'It is the miracle. The line now is pedestrian friendly. It's safe, it's welcoming. It is culturally sensitive to us with residents. Is it your community? Commercial core is the heart and soul of Westwood. We ask the the future of Morrison road depends always be straight with reclassification because who likes to ask morrison would reclassification from mixed use'",
        "'speaker_9': 'arterial to a mixed use collector. This is consistent with the current discussion is of the reclassification of Morrison Road to a collector base of CBD and public works. Functional functional classifications without a road reclassification. The record of lineal vision.'",
        "'speaker_9': 'Where prioritizes possession is cannot be implemented on page 24 and 25 of this plane recommends Morrison Road as an enhanced bikeways. Unfortunately because is not supportive of this recommendation because it conflicts direct with the direction from District three to bequest and the design team of this tree skate master plan.'",
        "'speaker_9': 'We are moving forward with a Mercado Linea vision that requires a complete street reconstruction of curb relocation. This will not allow bike lanes because there is not enough room for on street dedicated bike lanes. Why was it important to provide more multimodal alternatives that connect the neighborhood?'",
        "'speaker_9': 'Public facilities is also to provide priorities that commuters and stakeholders have prioritized. Pedestrians. Pedestrians should be prioritized more some road public right away all the time. But we know bike access along Morrison Road is important. WESTWOOD The streetscape masterplan, has identified alternative routes in the neighborhood that connect to existing proposed bike.'",
        "'speaker_9': 'Amenities and also the possessions and also prioritizes the possessions. The streetscape masterplans also provides an alternative if Berkshire or Morrison Road. We are very supportive of their recommendation. I'm sorry.'",
        "'speaker_4': 'I'm sorry, but your time is up.'",
        "'speaker_9': 'Thank you for your time.'",
        "'speaker_4': 'Thank you. Next up, Philip has.'",
        "'speaker_5': 'Thank you, Mr. President. City council members. My name is Philip Hawes. I own a business and I own the property on the Mawson Road. We've owned it since 1963. Just didn't move into the neighborhood. I've grown up there all my life.'",
        "'speaker_5': 'I'm and I'm wholeheartedly inclined to support a community rec district, but it doesn't say anything of how this is going to be paid for. How is this going to impact all of the business owners along Morrison Road? All the property owners along Morrison Road?'",
        "'speaker_5': 'This was just brought to our attention within the last month. It might have been going on since 15, but we feel that the business owners, the property owners are getting sold a build a good. I'd like to know more about it before you vote on it.'",
        "'speaker_5': 'I'd encourage the city council to table this to find out where the funding is going to come from. How are they going to treat the property owners and the businesses? Long Mawson Road to do this great community favor of a rec center is about all that I've heard.'",
        "'speaker_5': 'I haven't heard of any other property owners for this. It seems like it's just the people without. I hope that you table it and do a little more research on this before you shut it down the business owners throats.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Thank you. Next up, Rachel Prestwich.'",
        "'speaker_3': 'My name is Rachel Prestwich, and I'm here today to read a statement from Livewell, Colorado. Members of Denver City Council.'",
        "'speaker_9': 'On behalf of Livewell, Colorado.'",
        "'speaker_3': 'We are voicing our strong support for the Westwood Neighborhood Plan. We want to thank Councilman Lopez. Community Planning and Development and Denver Parks and Recreation for pushing inclusion of healthy living language in the plan, particularly the language regarding a future Denver rec center in the Westwood neighborhood.'",
        "'speaker_3': 'At Live well, colorado, our aim is to provide every Coloradan with access to healthy food and opportunities for physical activity. The Westwood neighborhood of Denver is desperately lacking in adequate access to physical activity, and as such, we are happy to see that the neighborhood plan reflects the need for a recreation center.'",
        "'speaker_3': 'Westwood is consistently ranked as one of the most obese neighborhoods in Colorado because of its lack of access to healthy food, preventative care and recreation. In order to combat obesity in Colorado, Live Well has set four strategic goals to be achieved by 2020.'",
        "'speaker_3': 'One such goal is for all children in Colorado to have access to safe and affordable recreational spaces for physical activity outside of the school day. With nearly half of the population of Westwood under the age of 18, this community is a priority for live well in removing barriers to healthy living opportunities, as well as in creating venues'",
        "'speaker_3': 'for physical activity. In order for Colorado to be a sustainably healthy state. All neighborhoods need systems in place through which each community member is able to afford and achieve healthy living. Walkable sidewalks, bikeable streets, access to healthy food and access to opportunities for recreation are all vital infrastructure for a healthy, happy and successful community.'",
        "'speaker_3': 'Live Well Colorado appreciates the inclusion of healthy living language in the Westwood Neighborhood Plan, asks council to vote in support of the plan and further urges the city to leverage dollars from the next Denver bond package towards a future Denver Westwood Recreation Center.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you. Next up, Naomi Enriquez.'",
        "'speaker_9': 'Hi. My name is Naomi. And because I'm 16 years old, I've been living in Westwood for seven years. My ages is 3465. West Walsh Place, Denver, Colorado, 80219. And I've been noticing in my community that there is not my name.'",
        "'speaker_9': 'David is close to where I live, and I would like having a recreation center in Westwood. I have three little brothers in during the summer. They're always at home with nothing to do. And I'm sure that there are other that there are other kids in the community that are also bored during the summer and after school as'",
        "'speaker_9': 'well. I would love having a recreation center in the community to have kids socialize and to meet new people. Thank you.'",
        "'speaker_4': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. Ask a couple of individuals to please approach the the podium. Steven, if you want to come up with an answer, Gloria from Boku, if you want to. Couple of questions. We have folks that. Say the businesses were not involved.'",
        "'speaker_8': 'And Claudia, you represent the business improvement or the local maintenance district, which is all property owners on Morrison Road. And Stephen, you led the effort for the the plan. Can you talk to me about outreach to businesses and participation, particularly the businesses and property owners on Long Morris and Road?'",
        "'speaker_9': 'Absolutely. Paula was in collaboration with Stephen Chester here, which has approached the Morrison Road Business Association early on in the process. We partner to do the community outreach for property owners and business owners. We have sent letters, we had gather volunteers to personally flier the businesses.'",
        "'speaker_9': 'We have distributed the meetings, notifications through a newsletter. We have sent information to social media and this is all just on book questions. CBD has done outstanding work, also letting the community and business owners and property owners know about the process.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_8': 'How many, if you don't mind? And Claudia, how many businesses painted the district? How many properties make up the local maintenance district and how many businesses?'",
        "'speaker_9': 'The properties. I don't have the number on top of my head, but active businesses, we have 82 at the moment. Okay.'",
        "'speaker_8': 'Thank you. Stephen, do you want to address the same questions?'",
        "'speaker_12': 'Sure. Well, in my experience, do neighborhood planning, oftentimes the business community is sometimes the hardest to engage with in terms of, you know, they they're busy. They were there other working during the day and then they oftentimes don't live in the neighborhood.'",
        "'speaker_12': 'And so we tried some innovative things with this planning effort to specifically outreach to the business owners in was sort of specific on Morrison Road we actually held a focus group with the help of Booker West. I believe they did a flier or a mailer to all the property owners along Morrison Road, also myself and planning team'",
        "'speaker_12': '. We walked the corridor and met a lot of business owners and put fliers up and kind of community meeting places, advertising this focus group. And we had pretty good attendance for that focus group. We got a nice core group of really engaged business owners that we then kind of leaned on to help us spread the word about'",
        "'speaker_12': 'the planning process.'",
        "'speaker_8': 'Yeah. Appreciate it. Sure. Thank you.'",
        "'speaker_4': 'Anything else, Councilman?'",
        "'speaker_8': 'I'll get to it in a bit, but other questions come.'",
        "'speaker_4': 'Okay. Guzman. Espinosa.'",
        "'speaker_1': 'These are all for CPD. So we just went through the Arapahoe Square design guidelines and standards and a whole bunch of other things. And one of the things that that was crucial to me and they did consider was the diagonal of Broadway is the Broadway and how that would influence design going forward.'",
        "'speaker_1': 'Was there any. There wasn't. There's the Emerson Road influence area sort of maybe alludes to this sort of notion that maybe the diagonals important, but there's really no any real strong language about how that should be capital that actually should be.'",
        "'speaker_1': 'But what is a liability can actually be converted into an asset to redevelopment. Do you have language or designs or towards design style guidelines and standards an emphasis on that or not? Did I miss it?'",
        "'speaker_9': 'So yes.'",
        "'speaker_3': 'The Morrison road overlay in this neighborhood.'",
        "'speaker_9': 'Plan is really a start. Obviously there's a lot of things. The scope of a neighborhood plan is very broad and design guidelines are much narrower focus. So the goal of the Morrison road overlay area was to identify that.'",
        "'speaker_9': 'We acknowledge that something needs to happen here and to acknowledge that we don't know the specific tools yet and that we know that further study needs to be done on what specific regulatory tools can go there.'",
        "'speaker_3': 'And to really put the.'",
        "'speaker_9': 'Framework in place of what the goals of that study would be. So acknowledging the commercial front along Morrison and the the transition into the neighborhood surrounding. So the language is there to start that. Obviously it would be a much heavier lift than just the neighborhood plan.'",
        "'speaker_9': 'So we're really teeing up that conversation with the plan.'",
        "'speaker_1': 'Perfect. Two things from that. You emphasize the broad nature of this plan. So for those members of the audience that are concerned about how prescriptive and what this really means to their plan, I mean, their property going forward, what I see here is actually a net increase in development potential along Morrison Road that would be supported by'",
        "'speaker_1': 'this plan that isn't there today. Is that correct? And is there anything binding about this? I mean, it's purely advisory, correct?'",
        "'speaker_9': 'Correct. This is a vision document. So for any of these things to be implemented, there would need to be regulatory changes, such as zone changes or for example, with the Morrison road overlay. When we get to that study, perhaps it's design overlay, perhaps it's a new zone.'",
        "'speaker_9': 'We don't.'",
        "'speaker_1': 'Know. And that also would then be a subsequent public process, correct? So then to that, the next steps, do we have we already short staff on neighborhood plans and whatnot? Do we already have a plan in place for how we're going to staff and pursue a more granular analysis of the study of these areas?'",
        "'speaker_12': 'Yeah. So this is definitely going to directly feed into our work plan for tax amendments. You know, we have the framework in place and the goals for the kind of next part of the study. So yeah, more staff would definitely help us speed it along.'",
        "'speaker_12': 'And I can really speak to where, you know, what the timing is going to be, but it's definitely something that we're committed to.'",
        "'speaker_1': 'Thank you for being the first person to really go on record right there. Hopefully you don't get in trouble language. So you had so you had shown a slide that talked about the cultural assets and you mentioned that it had future cultural assets, but I didn't see that.'",
        "'speaker_1': 'Is there is it in that plan? I mean, in that map where all those schools and things were the future ones or.'",
        "'speaker_12': 'Yeah, so it's a pretty broad definition that map just kind of opportunity sites. So it's called.'",
        "'speaker_1': 'So how do you distinguish one from the what an existing from an opportunity.'",
        "'speaker_12': 'Primarily you know potential redevelopment sites in the neighborhood along with some projects that we know are in the pipeline that are happening along Morrison Road and in other places in the neighborhood and along with some of the planned enhancements to some of the parks and open spaces, kind of opportunities to include, you know, public art into those'",
        "'speaker_12': 'open spaces.'",
        "'speaker_1': 'Okay. And then the last thing you mentioned correctness in in the last thing about the community outreach. And so I wanted to know that's sort of an ambiguous term for me. Was that demand for more prescriptive language in the code than the recommendations or what what do you mean by correctness.'",
        "'speaker_12': 'That was just purely fixing typos and.'",
        "'speaker_1': 'Okay, so they were calling you out for for grammar and spelling. Great. No, no further questions. Thank you.'",
        "'speaker_4': 'Councilman new. Yes. Stephen, on the the the food services section, they are looking at the challenge as you talk about a grocery store, lack of a grocery store. Did you do an inventory of that? I don't see that as being a major initiative for the future.'",
        "'speaker_4': 'Could you talk a little bit more about the grocery store situation?'",
        "'speaker_12': 'Be able to have on the lease who's on the Sustainable Food Policy Council? So yeah, it's best to answer that question.'",
        "'speaker_3': 'As an active member. So right now, there currently isn't a full service grocery store in the area. And what we know about the market is the neighborhood at this time probably wouldn't demand a.'",
        "'speaker_9': 'Full service grocery store in the area.'",
        "'speaker_3': 'What we do have is a vision which they're working.'",
        "'speaker_9': 'To.'",
        "'speaker_3': 'Open their first community.'",
        "'speaker_9': 'Operated grocery store.'",
        "'speaker_3': 'And it's really about taking a holistic.'",
        "'speaker_9': 'Systematic approach of improving food access within the area and then also improving regional access to where those larger stores are.'",
        "'speaker_4': 'In. And how far away are these regional stores?'",
        "'speaker_9': 'I believe the closest ones, about a half mile down off of Sheridan.'",
        "'speaker_3': 'But once again, those safe access points to access it any way other.'",
        "'speaker_9': 'Than vehicular doesn't exist currently.'",
        "'speaker_4': 'Okay. So it's a workable situation.'",
        "'speaker_9': 'Absolutely.'",
        "'speaker_4': 'Okay. Let me Stephen, on the one big issue, if I'm concerned about is our sidewalk situation, the infrastructure on the pedestrian way there. Can you talk a little bit about their condition of sidewalks as you evaluate that? And you do you invite the evaluate the pedestrian environment.'",
        "'speaker_4': 'The drawings about on Morrison Road look beautiful, but you talk more about that.'",
        "'speaker_12': 'Sure. So the neighborhood, you know, having been developed in the 1940 and 1950s, has a lot of those Hollywood kind of roll up curbs, sidewalks. That's kind of the most typical sidewalk conditions you see in the neighborhood. And that's not kind of.'",
        "'speaker_12': 'What we're talking about is a safe pedestrian environment, you know. Someone on a wheelchair, people walking next to each other won't be able to technically even fit on one of those sidewalks. And so with the community, what we did is, you know, recognizing that the you know, the opportunity to go in and replace every single sidewalk in'",
        "'speaker_12': 'the neighborhood is, you know, much of a long term vision. So that's why we worked with the community to come up with that kind of sidewalk priority map that looked at, you know, see, for us, the school is a major driver for that, where the kids walk, walk to school currently and making sure that those sidewalks are'",
        "'speaker_12': 'kind of first in line to be improved. Also looking at some of the the major commercial nodes and commercial corridors in the neighborhood like Morrison Road and Kentucky. And, you know, that's something that, you know, along with the rec center, just, you know, that safe pedestrian environment is something that is kind of the number one concern that'",
        "'speaker_12': 'we hear from the neighborhood.'",
        "'speaker_4': 'So there are priorities set up for those?'",
        "'speaker_12': 'Definitely.'",
        "'speaker_4': 'What about affordable housing? That's always another issue with that discussion.'",
        "'speaker_12': 'So, you know, as the council knows more than anyone. Affordable housing is definitely a citywide issue, you know, a regional issue, really. But what we what we did with the neighborhood plan is what could we do at a neighborhood scale to get at housing affordability?'",
        "'speaker_12': 'And so there's a couple of things that I want to make sure we highlighted in the plan. First off, being that idea of accessory dwelling units, I think that's a really great kind of neighborhood scale tool to help address affordable housing, not only providing affordable units in neighborhood, but also opportunities for, you know, additional income by some'",
        "'speaker_12': 'of the households in the neighborhood. Additionally, you know, what we could do to kind of attack affordability at the neighborhood scale was, you know, recognizing the stable nature of some of the single family neighborhoods. We were really conscious and pretty substantially increasing some of the density in the neighborhood, specifically along Morrison Road and some of those kind'",
        "'speaker_12': 'of, you know, heavier traffic corridors. Just providing more units would help us kind of address the affordability issue. And I would.'",
        "'speaker_4': 'All right. Thank you very much, Rose. Councilwoman Black.'",
        "'speaker_3': 'Thank you. Question for someone from CPD. So just to address the concerns that the houses have. Can you please explain what a neighborhood plan is, that it's aspirational. It's not an actual construction plan and it's not going to take away anyone's property.'",
        "'speaker_3': 'Right. So can you just sort of. Sure. Put it in context?'",
        "'speaker_12': 'Yeah. So a neighborhood plan is, you know, serves as that 20 year vision for the neighborhood that serves as a policy guidance document. So it's really the document that the city, a city council and city departments go to to help with specific policy decisions, specifically like rezonings.'",
        "'speaker_12': 'You know, that's the number one criteria that CPD and stuff uses when you're looking at a potential rezoning is what is the plan support for this rezoning, what are the adopted plans? And, you know, as I mentioned, this will become a supplement to the city's comprehensive plan.'",
        "'speaker_12': 'So this would be the kind of the guiding document for some of those policy decisions. Similarly with Parks and, you know, the Parks Department, they would then use this document. Okay. What are the priorities for the neighborhood? You know, if we have money to invest in some parks and open spaces, you know, this is the number one'",
        "'speaker_12': 'resource they'd go to to, you know, what are the resources, what are the different amenities that the parks need and Westwood. So it's really serves as a kind of advisory document for the neighborhood.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Councilman Flynn.'",
        "'speaker_5': 'I think, Mr. President. Steve, you're getting a lot of exercise tonight.'",
        "'speaker_4': 'You come back up here.'",
        "'speaker_5': 'One thing that I don't see addressed in here, maybe it's because of the lack of of resources. But was there an attempt made to survey any historical landmarks or any structures that are worthy of of of holding out for preservation as this plan moves along?'",
        "'speaker_5': 'Westwood is a very historic area, but not in a way we traditionally think of history in Denver. Right. It's it's a work, you know, grew up in the Depression. It was part of Arapahoe County. Most of it was already developed when Denver annexed it in 47.'",
        "'speaker_12': 'Exactly.'",
        "'speaker_5': 'And so I can't believe that there's nothing there that's worthy of of holding on to from from that standpoint. Can you tell us whether a historical survey was done?'",
        "'speaker_12': 'Yes, we actually have a separate process at CPD run by our kind of landmark division called Discover Denver. I'm sure you're very familiar with it, where they have a really scientific process outlined to go out into communities and kind of survey those historical landmarks and all the existing structures to see their historic significance.'",
        "'speaker_12': 'And so through the planning process, we did kind of identify some kind of unique buildings and kind of fed that to our landmark folks and with the hope that West would be soon on the cue to kind of have that really comprehensive historical survey.'",
        "'speaker_5': 'Okay. Are we going to go ahead and do that, do you think?'",
        "'speaker_12': 'I hope so. I can't speak to when exactly that would happen.'",
        "'speaker_5': 'Okay. I'd sure like to see that done. Thank you. That's. That's all, Mr. President.'",
        "'speaker_4': 'All right. Are there any other questions from members of council. Seeing none. The public hearing for comfortable for for three is closed comments by members of council. Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. I am very happy to get to this moment. And I have, I think, a million different words to say, but I'm kind of choked up now. I'm kind of a mess up here. The first thing I have to say is a great big thank you and ungracious that I mean, the lack of money'",
        "'speaker_8': ', the a lack of money either West where I was in 90 other west were en masse in that area. Sonya's not resident. This so is. And Pueblo. Ah, I see. And I said thank you to the community. First and foremost, the community is its people.'",
        "'speaker_8': 'When we talk about neighborhood, it is people, right? It's all the people in it. Business owners, residents, people who work in the community. It's everybody. The last time that we ever set foot out here with a neighborhood plan was 30 years ago, in 1986.'",
        "'speaker_8': 'And before that, this was the little guy that started it in 1975. It is kind of like it's just a few pages, talks about where to park your car or to drive to. Didn't really set the vision. And we had now, you know, Westwood is very unique in this city.'",
        "'speaker_8': 'It's it's diagonal is very unique. The parcels are unique. The fact that it wasn't Denver until 19 actually in the 1950s, because there's one holdout that try to sue the city because they didn't want to be part of Denver.'",
        "'speaker_8': 'So it's planted when it was planned and built. It wasn't Denver wasn't our code. So we ran, stumbled across different zoning. That was inadequate. Parcels are inadequate now with the zoning that we had before and serious, I think it was like a a B to b four zoned district, which meant you could put junkyards down and you'",
        "'speaker_8': 'could do pretty much anything with your property. And it really did not add to the community. All it did was create a pastoral. In Morrison Road for the longest time was a way for folks to get home. And as a shortcut to get to Southwest Denver instead of going to Sixth Avenue to Sheridan, take six to knock'",
        "'speaker_8': 'it off and you got a diagonal all the way into Southwest Denver via Morrison Road. What's more than just a diagonal? It's not the 1950s anymore. It's a neighborhood. It's a dense neighborhood. It's a rich neighborhood. This neighborhood needs a sense of identity and you know it.'",
        "'speaker_8': 'The zone districts that we even have in 2010 really constrict the site. And Councilman Espinoza, you're right on. Save that one. You're going to use that one later. Cherish the moment, brother. It is definitely in need of an overlay because you even give it the best known district that we have now.'",
        "'speaker_8': 'And in mix three that we looked at or or Main Street Zone District and so constrictive because you got to cover about 60% of the frontage it requires on a main street that you have glass frontage and these buildings are all concrete masonry.'",
        "'speaker_8': 'So anybody that wants to open up shops got to take out the whole front, right? So they're very challenging. What this plan does is set a vision and know it doesn't guarantee property rights. It doesn't take away your right to do anything with your property.'",
        "'speaker_8': 'Except. Creates a vision. And my God, if I'm not a business owner, but if I was a business owner on this strip, I was a property owner. And. You had a vision like this, you best bet I would take advantage of it.'",
        "'speaker_8': 'When you look at the culture of the neighborhood, look at the identity. The neighborhood is the neighborhood that buys salsa and tortillas. When I'd be selling white bread or I'd be selling SUVs and tortillas as a business owner.'",
        "'speaker_8': 'I get with it. This particular site. You look at Westwood and it just has so much potential there. The fact that we hadn't had this collective vision for such a long time and we didn't we didn't never formalize.'",
        "'speaker_8': 'The fact that we've had this Vietnamese population and businesses who had been land breaking with each other, building this community in South Federal Boulevard. The fact that we've never went in there and said, hey, let's create this sense of place.'",
        "'speaker_8': 'Let's build off of this vision. Now we have Little Saigon Business District. You know, the last time Denver had a business district like this, the proprietor was hung from a lamp post. And that was that seamy side of Denver.'",
        "'speaker_8': 'And that's the book I'm referring to. We didn't celebrate culture in neighborhoods, and when we did, the residents paid for it. Well, we are in 2016. The beauty of West with the beauty of Southwest Denver is in those bells from the pilot that it's a Liberty Bell of our body.'",
        "'speaker_8': 'It is the mom and pop shops of Federal Boulevard. It is the fact that someone like Grandpa Burger Haven just north on Byrd on on in Barnum can make burgers under the can put McDonald's under the table. They don't compete.'",
        "'speaker_8': 'And you go to Columbine Steak House. When you go to the businesses along federal Federal Boulevard, where do you go for Vietnamese food? You go to Federal Boulevard, where do you go for the best and you go to Federal Boulevard.'",
        "'speaker_8': 'Right. Where do you go for a mom and pop? Real original Denver. It's Denver. It's westward. It's west Denver. It's this corridor. And the fact that we've never had a collective vision or a plan that speaks directly to that.'",
        "'speaker_8': 'This is the first time it has done, let me think my predecessors, because they struggled to get this done. The honorable Ramona martinez, who worked on that plan, Sam Sanders, Ivan Rosenberg, who was the councilman for this one.'",
        "'speaker_8': 'CPD came in and did a tremendous job. My hat's off to you three. Sara On. Stephen They came in and did exactly what was needed to be done. Was the take in what they see taken, what they hear, apply their expertize to this city, to this cause.'",
        "'speaker_8': 'Right. My staff, Adriano and his suits were very hard on dates and meetings and organizing, getting people together. This is community and we can't third party staff from our neighborhood, from our city. It is ridiculous for us, the third party ourselves.'",
        "'speaker_8': 'And in this country and in. In this part of the world. It's ridiculous when we third party the citizenry from the government, because in this country the citizens are the government. And not just people who are U.S. citizens, but everybody who lives in it.'",
        "'speaker_8': 'And that's a reflection of what's in here. So, unfortunately, you know, we have had challenges. We've had resentment and contempt towards the community and, you know, the changing of the community. We've had, you know, folks that just don't want to move forward because of that and can accept the fact that the community has changed and changed in'",
        "'speaker_8': 'a way that is great and can change in a way that has protected a lot of its businesses. Now. I was born and raised in this neck of the woods. I lived a block off Morrison Road, 834 South Range Street.'",
        "'speaker_8': 'My entire life practically between there and barn. So being able to see this come to fruition is a personal for me. It was always hard crossing that street. You know, the first time we've had a stoplight, a morrison road in decades was on Perry and Morrison.'",
        "'speaker_8': 'You know why? Because these folks in the community applied for a grant to get that stoplight, and they had to pony up over $100,000 to do it just to get the city say, okay, we'll put it on the fast track when there are stoplights put in through this city left and right without having some grant.'",
        "'speaker_8': 'When we saw blighted land, we created pathways, when we saw living in substandard housing and nobody doing anything about it. Slumlords not even caring what's happening on the property come in, threatens to shut it down because of the the blight that exists and the fact that we cannot allow substandard housing like this in the community.'",
        "'speaker_8': 'We've had folks like Saint Charles Town commit community work together to move, not to replace it with some high end housing, but to create affordable units. Mi casa partner came in, said, we'd like to come and make a difference in this community.'",
        "'speaker_8': 'Not only they headquartered here, but have affordable housing up top commercial zones. Frontages. The fact that we need a grocery store in this community is paramount. The fact that we need a rec center, as you heard tonight, is paramount.'",
        "'speaker_8': 'And that is set in this plan. This plan calls for that. And in the meantime, we have folks that are making do that are doing some pretty innovative stuff. But that doesn't replace the need for closing food deserts in this in this community.'",
        "'speaker_8': 'So the linear mercado on Morrison Road, why not? You can look at cities like Chicago or New York and Los Angeles and yeah, I'm saying some pretty grown up cities, but that's who we are. In Denver, we had a very critical moment.'",
        "'speaker_8': 'We hate to be called cowtown. We hate to be called a county. But we also don't want to be called New York City. We're kind of like in the middle school stage of New York. We kind of want to hang out with little kids, but we're not cool enough to hang out the big kids.'",
        "'speaker_8': 'But we are at that stage and we have to determine how do we connect our neighborhoods to that central core. We can't look at Westworld or any one of our neighborhoods in our city and look at it as some island unto itself.'",
        "'speaker_8': 'Westwood is vital to the city. So the fact that we need to be able to move residents, not just cars, more people, connectivity, the light rail is just off about two miles away from Westwood. Right. Perry and Knox are arterials.'",
        "'speaker_8': 'The fact that we could bike from Morrison Road all the way to Knox Court and take that lightly. One day you're going to see kids from Westwood be able to. Go all the way to see Border, do you or Metro or heck, even N.Y.U. if they wanted to, or USC or Stanford and not even have to set'",
        "'speaker_8': 'foot in a villa in a car. That's the kind of connectivity we're talking about, the fact that people can walk up and down the streets. That calls for sidewalks. All right. So what's reflected here in this in this vision and in this plan is almost a microcosm of what we've been pushing for in the city in addition'",
        "'speaker_8': 'to the plan. I want to refer to this. We also have this health impact assessment that was made for the neighborhood. It's also released in this this does address those issues when it comes to health of a neighborhood in fighting obesity rates.'",
        "'speaker_8': 'The case for the rec center, which is about a 25 year old case for the rec center. It's not new. We've been asking for this for a very long time. And last but not least, you know, I think.'",
        "'speaker_8': 'With this plan. You know, we. In the city. We have to look at plans and not just something that are blueprints that get rolled up or put in a binder and sit on some shelf. This plan speaks to the soul of our neighborhood.'",
        "'speaker_8': 'It has a soul. It is a living. It is a breathing document. It is something that is intended to guide our decisions as a city. This vision sets, addresses so many different things. It is not intended to collect dust on a shelf in a city or to be found in a used book sale.'",
        "'speaker_8': 'Right. It's supposed to be implemented. And as we start moving it forward and yes, taxpayers, we all will pay for the implementation. Just like people in Lakewood pay for their own implementation or other municipalities that surround it. This is our city.'",
        "'speaker_8': 'It's a collective thing. And when neighborhoods improve, businesses improve. When cities improve, the economy improves. And what we are trying to do is build and start our local. And add to that. So without further ado, at the end of the day.'",
        "'speaker_8': 'Aside from, you know, the call for bricks and mortar and. Zoning overlays. The one thing that this really creates. And it changes the game and it changes this scenario. 20 years ago. If I were to walk around and say, I am from Westwood.'",
        "'speaker_8': 'I would have hung my head. It was typical for us to hang our heads. People sneered at us and they say, You are from Westwood. It makes funny. They point fingers. Well, that game is changed. Tina Grego, who wrote a great series she wrote for The Rocky.'",
        "'speaker_8': 'Called and highlighted a street, a random street in Westwood and called it Border Street. Because it looked like it was on the border. It was underserved. The streets hadn't been paved in a very long time. Yards were unmaintained and it just looked like it didn't even belong in the country.'",
        "'speaker_8': 'Well, she followed up with that article. With that series a few years later when we started this process in 2009 and 2008, and she wrote The West Side to write its own story. And we've had these headlines that our community leaders have created out the way.'",
        "'speaker_8': 'And what better of a headline to say new chapter for a neighborhood? Because indeed, a new chapter for this neighborhood. And that lives in every single one of our residents. And it is up to us to implement that new chapter.'",
        "'speaker_8': 'It is that new day where you no longer walk around. And I'm addressing the young people in the room. Right. Young man. Young lady, we don't walk around a westwood with our heads held low. From now on, you walk around Westwood with your heads held high and say, I'm from Westwood.'",
        "'speaker_8': 'That's right. I'm from Westwood. And that's the kind of spirit that we want to see. That's what this plan does and that's what makes it living. So I am happy to support and encourage my colleagues to pass this plan and adopt it into ordinance.'",
        "'speaker_8': 'Thank you, Mr. President.'",
        "'speaker_4': 'Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. Pro Tem. I want to lend my support to the neighborhood plan as well. The need for a grocery store and a rec center goes back to when I grew up in this neighborhood as a teenager.'",
        "'speaker_7': 'When I went to middle school and after school, we'd go over to Taylor Drugstore on Federal Boulevard and hang out because there wasn't a real place for for young people to go. So, you know, the voice of the youth who were here tonight speaking out for the need for a rec center.'",
        "'speaker_7': 'It's it's it just stuns me that it's been this long that we have not addressed that need in this neighborhood. Westwood has some really unique characteristics. Not many neighborhoods in the city can say they have Quonset hut. I think that's what they still call them, right?'",
        "'speaker_10': 'We have a couple.'",
        "'speaker_7': 'Do you all know what a Quonset hut is? This is this is where the home is kind of built into the ground. And that that's very unique to this neighborhood. I know there are a few of them still there.'",
        "'speaker_7': 'The trailer park that existed on Mawson in Kentucky. When I first get reelected back to the council, Councilman Lopez took me to walk through that trailer park. And when I saw that there were literally garden hoses connecting people's units to propane tanks that were exposed and kids were playing outside, you know, it was a safety hazard with'",
        "'speaker_7': 'a real bad accident waiting to happen. And I know Councilman Lopez has taken some real lumps for, you know, moving that project forward, but those residents are going to be much better off. They're going to be relocated. But the project will address a real safety hazard that existed, you know, in that immediate location.'",
        "'speaker_7': 'And, you know, I think the the work that he did in working with our Office of Economic Development to make sure that there was relocation funding to assist those families was a really important part of that project. The work that revision has done in the neighborhood, working with what is it like 400 households that now have neighborhood'",
        "'speaker_7': 'gardens. When I went and visited with them a couple of years ago and learned what they were doing with the drip system in everybody's backyard for their gardens, I immediately got jealous and said, I need one of those for my garden because I don't have one.'",
        "'speaker_7': 'And I know what a difference it makes in terms of, you know, your your produce being able to grow the way that it should and in the work they're going to be doing with the residents, with the new facility that was purchased, with the assistance of some city funding to be able to do some classes for how'",
        "'speaker_7': 'you can preserve that food product throughout the year and be able to sell your food out of that location. I mean, the opportunities I think are unlimited in terms of what that means for the neighborhood. And it's a small piece of creating some healthy food for the neighborhood.'",
        "'speaker_7': 'You know, the need for a grocery store still exists, but that is a really big deal that doesn't exist in other neighborhoods across the city. So that's very unique to the Westwood neighborhood, the Excel corridor that was talked about that we saw in one of the maps.'",
        "'speaker_7': 'That was the route I used to walk along to go to school. When I went to Kepner, I lived off of Kentucky and Peyton Court and would walk throughout this neighborhood to, you know, go visit with friends or we'd go to a movie and things like that.'",
        "'speaker_7': 'And the work that you all have done in laying out the priorities for this neighborhood, in putting together this neighborhood plan. Is a really big deal because by having an adopted neighborhood plan, it means now that it it positions your neighborhood to be able to access some of the city resources to address those priorities in your community'",
        "'speaker_7': '. And so the work that everyone from Steven and Gretchen and Sarah, Annie and Elise and all of the residents from the neighborhood Councilman Lopez and Adriana and HSUS, you know, it takes a lot of work to bring these to fruition, but in the end, it really pays off having a neighborhood plan because it means now that some'",
        "'speaker_7': 'of the things that have never been looked at or addressed by the city. Are now a priority for your community. And I just want to say thank you to all of the residents because having to show up to meetings on a regular basis, making sure that your voice is being heard, because that's what this document reflects.'",
        "'speaker_7': 'It's your voice. It's your priorities for your community that will take your neighborhood to that next level. To the businesses on Morrison Road. You know, by having that corridor and Alameda and Federal Boulevard identified as continuing to bring in more neighborhoods, serving businesses and opportunities that look into the future.'",
        "'speaker_7': 'And again, this is not the document that rezoning your property or any of that stuff, that's a whole separate process that has to take place later. But just knowing that the opportunities allow for more to happen in the neighborhood is is exciting.'",
        "'speaker_7': 'So I again, I just want to say thank you to everyone who is involved in bringing this forward and making it happen. And I'm a yes vote to make.'",
        "'speaker_4': 'Councilman Espinosa. All right, gentlemen, it's been.'",
        "'speaker_1': 'I'm sorry. I have three brief points, but I get the chair on my inner Kevin Flynn since we we talked about architecture a little bit. So while I have no doubt there are Quonset huts in Westwood. What you were describing was what's called a basement home, which Kevin might know better about.'",
        "'speaker_1': 'But that's the sort of postwar creation where we built basements only too, so that GIs and stuff could come back and eventually build houses on top of them. But so they're just basements. They're below grade, mostly below grade with a roof.'",
        "'speaker_1': 'So actually, if you want to get into the preservation may be a really odd form, but it does have historic context and they are there over in Garland Park. It's good to know that they have them in Westwood, too.'",
        "'speaker_1': 'So that's not the density you're looking for. But I did want to say that this is sort of a note to CPD and you guys. You three get it? You know what I'm talking about. But it's also a note to my colleagues that with this adoption, our work is not done here on this dais until all those'",
        "'speaker_1': 'other plans are, you know, other other standards and guidelines and rezonings take place. We will then adopt plan support for higher density. And what I don't want is, is for that inner city increase to just come in here and cite that plan support.'",
        "'speaker_1': 'Right. Because we have to be cognizant that there is much more in this plan. So in the interim, we must recognize that zoning, zoning are de facto blanket zone. Districts do not captured the entirety of this vision and that we need to CPD needs to support in the interim rezonings that that do support the community and this'",
        "'speaker_1': 'plan CPD has the the vision document. Now if we adopt this you'll have the vision document to support customized zoning in the interim, meaning that if you're talking in this zoning, in this adopted plan, some very, very specific notions about how we should be not there broad base sorry, very notion concepts about how we approach redevelopment along'",
        "'speaker_1': 'Mississippi, a blanket zoned as we're already cognizant that a blanket zone district doesn't necessarily do that. And so if we have a developer and a community coming together saying, okay, here's a redevelopment proposal that requires the uptick in density, but deviations in order to capture these ideas that really move forward.'",
        "'speaker_1': 'That is to me, you've got the plan document here that if it's supported by this plan, this vision, you have the justification you need to do customized zoning there. So I want you guys to support community and develop developers when they're coming together in the future.'",
        "'speaker_1': 'On Westword Until we have other design guidelines and standards in place that we need to as a as as a, as a department and as an agency, get into that, get into that gray area and support customized zoning so that the neighborhood is protected and the developer can, can, can has sort of valid metrics that they can'",
        "'speaker_1': 'move forward with that are above and beyond what our current zoning code and form based zoning allows. So there's also a note here to OED, just because you mentioned what the affordability component to as we're doing this affordable housing linkage, fees and creativity, negative percent loans for use with covenants.'",
        "'speaker_1': 'So if we're going to encourage to but we want them to capture affordability, maybe the city is a partner. You know, we're just paying a 1% back on interest or covering a down payment or something like that so that we capture that.'",
        "'speaker_1': 'But that's a whole different policy discussion. But it is an idea that I want to put out there just because it came to me here. And lastly, another idea that goes off the rails, but it's all you. Councilman Lopez, you won't see any resistance from me.'",
        "'speaker_1': 'If you want to use the Parker Sanchez money to start this rec center somewhere in Westwood because it's an asset that is clearly needed. We have a park, we have a good park. We do need some programing up there.'",
        "'speaker_1': 'But what I think we need we need the facilities where there where there aren't any. So you have it for me here right now. Things I'll be supporting the rezoning thing. I mean, the adoption. Sorry.'",
        "'speaker_4': 'Councilman. Do Thank you, Mr. President. In congratulations to the residents and CBD and special counsel Lopez on developing this fine plan. Your children are our future and imagine healthy. I know the need for healthy kids to be great leaders in our future and for health and the welfare welfare of our kids.'",
        "'speaker_4': 'We've got to have exercise. We've got to do so. A rec center just is so critical to me for them to help develop healthy kids, an environment in any kind of neighborhood and community, but also, you know, healthy foods.'",
        "'speaker_4': 'I still you know, I sure echo all the comments about the grocery store we've seen so many of our areas are see not having an active grocery store to provide affordable food, which is something that really, truly needs to be to be addressed.'",
        "'speaker_4': 'And yeah, I think well, the other thing is, is working with our business owners, I was I was touched by the the the long term business owners. We have an on Morrison Road and I think, you know, that we shouldn't just rest on this plan.'",
        "'speaker_4': 'You know, we need to support this plan, but we need to go ahead with the economic development of that area and trying to to say, how are you going to develop businesses along this whole community to provide even greater benefit to the community?'",
        "'speaker_4': 'So so I'm going to support this plan and it's asked us to look at the bond issue list if, if, if Councilman Espinosa's money didn't come through when he was on the capital improvement list. But, but for the rec center and what rec center plan we have for the city.'",
        "'speaker_4': 'So I support this and I congratulate everyone on this wildfire plan. Thank you. Councilman Cashman.'",
        "'speaker_5': 'Thank you, Mr. President. I'm really excited about this plan. Congratulations to the neighbors who spend so much time, the CPD to my brother, Councilman Lopez. I'm really excited about this because there's a growing awareness on this council that the West Side needs some love in this city.'",
        "'speaker_5': 'It needs grocery stores. It needs connectivity to the rest of the city. It needs recreation centers. And this plan is part of the path we need to go to make those things happen. And this this is not charity.'",
        "'speaker_5': 'This is an awareness that the city the city is strongest when all corners are healthy. And so we need to make this happen. And this is certainly a great start. But as has been said by several of my colleagues, this is only a guidebook.'",
        "'speaker_5': 'And I believe that stripped down along the diagonal along Morrison Road has a rather large area. I think that indicates five stories of development as recommended. That's all that is. There will very possibly in the future be developers come in that want to do eight stories or ten stories, and you're going to have to continue to come'",
        "'speaker_5': 'to the table when you'd rather be at home with your family, or you're going to find that those plans can change. So you need to keep your eye on this plan. You need to hold it dear and to fight for the things that you really think are important.'",
        "'speaker_5': 'I also want to say to the houses, you know, in my experience for the years before council that before I was on council, that I would watch these proceedings and look at community process around the city. Sometimes some how people do not get their voices heard in the conversation the way they want.'",
        "'speaker_5': 'The good news is you will have endless opportunity to have your voices heard. This is, like I say, this is a guideline for development. If anything comes up where uses are going to change, there will be a robust public process involved.'",
        "'speaker_5': 'There doesn't mean you're going to get your way, so you're going to have plenty of opportunity to be heard. So another reason I'm very excited is because there is now about somewhere around 25% of the city that has these small area plans.'",
        "'speaker_5': 'It's not most of the city. And my neighborhood, Virginia Village, has the oldest neighborhood plan in the city. Now, I think it's 1973. And our our little world has changed a great deal since 1973. So this the fact that you guys got yours means my neighborhood is just one step closer to getting ours.'",
        "'speaker_5': 'So it is a huge deal. It really is adds a great deal of legitimacy to to being from Westwood. And and I quote Councilman Lopez a lot. Your zip code should not determine the quality of your life experience.'",
        "'speaker_5': 'And we all, regardless of where we're from, need to be able to hold our head up and say, you know, I'm from Westwood, so thank you, Mr. President.'",
        "'speaker_8': 'Guzman-Lopez Thank you. As always, I forget to say something sorry very fast though, you know, and I want to address Councilman Espinoza, you know. Can't rob Peter to pay Paul. The first of all, we looked into the cost of a roads rec center.'",
        "'speaker_8': 'It would be roughly to the tune of about $30 million. The price of what the grants and you know the different grants and stuff that was we're were helping fund create because Sanchez is right now is probably about two you would need 15 Paco Sanchez.'",
        "'speaker_8': 'To pay for one rec center. And here's the thing. Great idea. A great start. But Villa Park is also in a pretty bad spot with access to open space and play area and things like that. So we looked at that spot over in West Colfax and Villa Park right by the projects.'",
        "'speaker_8': 'There was no place for those kids to go. This is it was a rundown ball field that only would get permitted once. And so my point is, it is not an either or is an end. And with this recommendation, it's not just sidewalks in Westwood.'",
        "'speaker_8': 'It's sidewalks in Westwood. And. Sidewalks on the east side. In Overland. It is grocery store in Westwood, in the grocery store on 20th and Chestnut. It is the park in Villa Park and the Westwood Rec Center. And in, if I may say so, this plan and this is the biggest point I wanted to make, Mr. President, and'",
        "'speaker_8': 'colleagues, is that. Although it is very meaningful and it, yes, has taken 30 years. It should not be the only plan in this city that has seen light. There are neighborhoods throughout our city like Westwood and some without even a neighborhood plan.'",
        "'speaker_8': 'And that means we got to get to work because those plans are those guides for every single neighborhood that makes up our city. And the last thing is, you know, I know. Well, there's I'm looking right at you.'",
        "'speaker_8': 'Our neighborhood inspection folks are the folks that are probably some of the folks that are the unsung heroes that go around making sure that these that these plans and these codes are enforced. And thank you and all of our city employees from Public Works, the planning to everybody else.'",
        "'speaker_8': 'They're the ones responsible for implementing it as well, too. So with that said, thank you, Mr. President. I just wanted to clarify those most pieces.'",
        "'speaker_4': 'All right. Thank you. And I'll just quickly add that, you know, my district shares a border with this community, with this neighborhood, and we need more plans like this on the west side. I want to thank all the community members who got involved in this and spent all of the time working on this.'",
        "'speaker_4': 'I want to thank all of our staff for all of their time and hard work on this. Thank Councilman Lopez for bringing just an amazing plan for us. And I really want to give a shout out to all the young people.'",
        "'speaker_4': 'And I know a lot of them have headed home, but it's so refreshing to see young people come and be passionate about being involved in their community. I hope that this is not the it may be the first time that we hear from them, but I sincerely hope that it is not the last.'",
        "'speaker_4': 'I'm also thrilled to see a focus on accessory dwelling units as a way to preserve affordability. It's a conversation that many of my neighborhoods on the West Side are having and exploring right now. And here it is in the flesh.'",
        "'speaker_4': 'We need to find ways to implement this plan and implement it quickly. So I'm so happy to add my support to this plan tonight, and thank you all for your hard work. So seeing no hope. Councilman Goodman Ortega.'",
        "'speaker_7': 'So last very quick thing. I just want to thank our translator also for translating for the residents tonight and for us.'",
        "'speaker_4': 'Thank you very much. All right. Seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_2': 'Lopez. I knew Ortega. I Sesan I Black.'",
        "'speaker_3': 'Eye.'"
    ]
}