{
    "Recommendation to name the park site located on Walnut Avenue at 20th Street \"Jenni Rivera Memorial Park.\"": [
        "'speaker_3': 'Okay. Thank you. Let's give them a round of applause. And three, a round of applause for her incredible work. Now we're moving on to the regular agenda I had mentioned earlier. Are we going to move up number nine and then continue on?'",
        "'speaker_3': 'So item number nine is up first, Councilmember Andrews.'",
        "'speaker_1': 'Thank you, Mayor. As you guys noticed, this has been denied. So this is one of the every night. But again, this is another important and very, very exciting award that we're going to, the proclamation we're giving out tonight.'",
        "'speaker_1': 'And this is for a young lady by the name of Jenni Rivera. I know every one of you individuals. I knew her. And like you say, she has been a icon to the city of Long Beach. You know, it's a great honor to bring this item.'",
        "'speaker_7': 'Councilman Landers, I think the item needs to be read first.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Let's try and have Adam read it.'",
        "'speaker_2': 'Item number nine is communication from Councilman Andrew. Councilwoman Gonzalez. Councilwoman Price and Councilmember your UNGA recommendation to refer to the Housing and Neighborhoods Committee and the Parks and Recreation Commission to consider naming the public right away. Park located on Wallet Avenue at 12th Street.'",
        "'speaker_2': 'Jenni Rivera Memorial Park.'",
        "'speaker_1': 'Yes. First of all, I'd just like to make this motion. Okay. Thank you. Okay. Right now, I'd like to add this before we get started. I just would like everyone to know that this is a great honor to bring this item forward tonight and to have had pleasure to know Ginny, as well as working with her family'",
        "'speaker_1': 'and on this item. Jenny was an amazing young lady and really gave her all. I don't think people really knew how much she gave back to the community. I'm donating Children Hospital to send in trucks full of gifts and clothing to Long Beach Mother and Children's that was victims of the domestic violence.'",
        "'speaker_1': 'And Jenny kept giving. I first met Jenny in July of 211 when I honored her with the start of probably, you know, offensive pain. Jenny was proud and she was truly a proud jackrabbit and proud to be from the city of Long Beach.'",
        "'speaker_1': 'This Long Beach Girl was truly an inspiration to us and all of her stars and the Walk of Fame and mind me of keeping reaching out for our dream, no matter where it comes from and what circumstances it might around you.'",
        "'speaker_1': 'To this day, millions of people mourn the tragedy and the loss of Mrs. Rivera's life. On December the ninth, 2012, by honoring Jenni Rivera with the Memorial Park, the city of Long Beach will be paying a tribute to the great citizens of her city and a remarkable entertainer, inspirational leader and amazing ambassador for all and the city'",
        "'speaker_1': 'of Long Beach. Now, I would like to show a short video in her memory. I will speak. Can I please call an assistant up here to the podium for you? Are they.'",
        "'speaker_4': 'Here?'",
        "'speaker_3': 'I think we'll get to the video first.'",
        "'speaker_1': 'We wait till after the video, please.'",
        "'speaker_4': 'She meant to the Latinos over. And.'",
        "'speaker_0': 'The style of music that she makes is so beautiful.'",
        "'speaker_1': 'When you listen to it, it makes you feel like it's.'",
        "'speaker_3': 'A better place in this world.'",
        "'speaker_5': 'I believe that when God.'",
        "'speaker_6': 'Gives you a lot, it's our responsibility to give back.'",
        "'speaker_5': 'I want the fans to know that with what they give me, I am able to give here and. And they love him so very much. Thank you, guys. My fans always tell me that when I visit them, it means so much.'",
        "'speaker_5': 'But what they don't know is that it means more to me.'",
        "'speaker_1': 'She really.'",
        "'speaker_0': 'Was a strength.'",
        "'speaker_1': 'Of humankind. She was a force of nature.'",
        "'speaker_8': 'She used to show up to hospitals, how people that are in their death beds and give them a boost.'",
        "'speaker_5': 'I said to them.'",
        "'speaker_2': 'Your body stay here, but I commit the illness in your general desire.'",
        "'speaker_5': 'Our relatability on this ill son. And you actually never seem to smile. They haven't seen you haven't seen her smile smiled at all. We made her smile. You know, there's always somebody going through more than you're going through.'",
        "'speaker_5': 'I needed them to see that. I had hope for them and I had faith for them as well. We were all in on this together.'",
        "'speaker_3': 'They are courage. People who didn't know Jenny River to go back and discover.'",
        "'speaker_0': 'What she.'",
        "'speaker_1': 'Was all about. Because you'll just discover what we're all missing so much. And that's how talented she was. I think people related to her music and her as a performer.'",
        "'speaker_8': 'Because her songs were about real stories and she went to in her life and what the everyday woman goes through. I don't understand any of the words she's saying, but at the same time it feels so good.'",
        "'speaker_1': 'That it captures your voice, is soothing to your ears. This young lady here has done things for our community. For your community? What matter? To let everyone know. Don't ever, ever give up on your hopes and dreams. And I want to thank you again for coming in today.'",
        "'speaker_1': 'So now I will take the time to honor this very, very special, such an Rivera.'",
        "'speaker_9': 'You had to get that. Okay, you guys. Yeah. All right, baby.'",
        "'speaker_5': 'Jenny and I love you back.'",
        "'speaker_6': 'I was the nerd that played.'",
        "'speaker_2': 'In the marching band.'",
        "'speaker_6': 'On this same.'",
        "'speaker_5': 'Field and haven't been here since, and it feels really good to be able to come back. And I would play my music then and I came back.'",
        "'speaker_6': 'Because of my music.'",
        "'speaker_5': 'And that feels really good. Thanks to all of you who have considered little old me from Long Beach, California.'",
        "'speaker_6': 'For a start here at Poly High School. And thanks for remembering that I came out of here. I don't forget it.'",
        "'speaker_5': 'I'm still a poly jackrabbit. Very emotional day. It's beautiful to go back.'",
        "'speaker_2': 'In a in a.'",
        "'speaker_5': 'Time machine to the past. And I remember everything I went through as a child and and the beautiful squad I came to where there was where they taught us that you are to learn and go forth and serve multiple.'",
        "'speaker_9': 'Sites and your look at the. Though. No. Too bad that I split my. So the London. Money for anything you give away. Like I love flowers. Oh.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_4': 'Withholding control.'",
        "'speaker_5': 'Better than anyone doing. Boy.'",
        "'speaker_9': 'Yang's not used.'",
        "'speaker_4': 'You come. You can come.'",
        "'speaker_3': 'Kay. Thank you. And as part of that, I do believe that we are going to have someone from the family that's going to come on up and say a few words as part of the councilmembers presentation. I think Rosie's coming up.'",
        "'speaker_3': 'Please come forward.'",
        "'speaker_5': 'Hello. It's an honor to meet you here and all these councilmen. Thank you so much. My sister received many awards in her life. Many nominations sold millions and millions and albums. And her music took her around the world.'",
        "'speaker_5': 'But she never forgot. She was just a girl from Long Beach. Due to a young pregnancy, she had to leave poly high school. But she mentioned that she'd come back one day and just seeing her smile. That's one of the most beautiful, genuine smiles I've ever seen.'",
        "'speaker_5': 'The honor that she received by poly high school was a true joy, and I'm thankful to Long Beach for doing that while she was here. And now that this park has been named after her is a huge honor.'",
        "'speaker_5': 'And like I said, she traveled the world. But to know that her her town has honored her is better than any Grammy or better than any award. I wanted to thank Long Beach and let you know that the family is ecstatic and we want to be completely involved in whatever we can.'",
        "'speaker_5': 'I have told the children they cannot be here today, but they will be there. The if if it's named after her, they will be there and they like to plant trees and do fundraisers, maybe have a community day just to be able to continue to support our community and not just have it named after her and be'",
        "'speaker_5': 'empty, but really do something for the community. We, our whole family will be completely involved to honor her and honor the city that made her. She became a great star, but it was Long Beach that built Jenni Rivera.'",
        "'speaker_5': 'So thank you very much.'",
        "'speaker_3': 'Thank you very much. Thank you very much for those words. And obviously, on behalf of on behalf of the city of Long Beach and to the whole family. Our hearts go out to the entire family and all the other friends.'",
        "'speaker_3': 'I do have a couple of councilmembers. I want to make some comments and there is a motion on the floor already. So Councilmember Arango.'",
        "'speaker_8': 'I want to, first of all, thank my colleague, the Andrews, for bringing this forward, because there's not that many opportunities that we haven't seen on which to name parks or important people. And certainly the iconic figure that Jenny Oropeza worked in, or better yet, if you read it, was that's another person that generated better words to this'",
        "'speaker_8': 'community. It really speaks volumes about what contributions she made not only here in Long Beach, but to the world of music as well. And her name will live not only in her music, but also in this park. And so I'm looking forward to that celebration.'",
        "'speaker_8': 'And we have this pilot program, this this kid with our mutual greatest prosthetic equinox voters easily register women to promote the McCain memorial that Jenni Rivera.'",
        "'speaker_3': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_6': 'Yes. I also want to thank Councilmember.'",
        "'speaker_5': 'De Andrews for bringing this forward. I had the pleasure of meeting Miss Rivera at Poly High School as well. And what I got from that was that she was a real person. She kind of told you from the heart what she was feeling.'",
        "'speaker_5': 'And she was very passionate as a mother, as an artist, as a Latina, but mostly as a Long Beach resident. And I always remember that.'",
        "'speaker_6': 'And so I think the Andrews, for bringing this forward.'",
        "'speaker_5': 'I know that she was also such a huge loss to the community, but a tireless advocate for victims of domestic violence. What I failed to mention earlier, you know, when we had the domestic violence presentation, is that all of her work, she was a spokesperson.'",
        "'speaker_6': 'For the National Coalition Against Domestic Violence in Los.'",
        "'speaker_5': 'Angeles, and she also founded a charitable organization, the Jenni Rivera Love Foundation, and all of those dedicated to women, children, especially here in Long Beach. So all of that put together is is reason enough to to certainly name a park after her.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_3': 'Thank you, Councilmember. Councilwoman Price.'",
        "'speaker_6': 'Thank you. Thank you to Councilmember Andrews for bringing this item forward and for asking us to cosign it with you. It's rare for us to be able to a name, a park or an area of the city after someone who is young.'",
        "'speaker_6': 'And it's always very tragic when that happens. But in this situation, the vibrancy and the energy and the youth that she brought forth is is a great representation. And to have that in the city of Long Beach, I think, inspires just the energy that she brought to the table, which was a lot of energy, a lot of'",
        "'speaker_6': 'service, a lot of goodwill and a genuine pride in this community. So thank you for bringing this forward. And I'm proud that we are doing this tonight.'",
        "'speaker_3': 'Thank you. And Councilmember Austin.'",
        "'speaker_8': 'Yes. I'd like to also join with my colleagues in thanking Councilmember Andrews for bringing this forward. This Rivera was an international star, but also an ambassador for the city of Long Beach. She represented our city across the around the world.'",
        "'speaker_8': 'And a little known fact is that, you know, she she recorded most of her music right here in Long Beach in eighth District, right here on Market Street, where the family still actually has a recording studio. And they sell a lot of her her music and family music there and opportunity to meet her father and her brothers'",
        "'speaker_8': 'about a year and a half ago. And, you know, like I said, I think this is an honor befitting of her her her great, great career and her representation of the city. So thank you again.'",
        "'speaker_3': 'Thank you, Councilman Richardson.'",
        "'speaker_0': 'Thank you. I just want to wanted to chime in and again, on the on the Andrews night, just say great job and what a beautiful tribute your staff put together in that video. And and also, I wanted to just say that, I mean, tonight we've heard about domestic violence.'",
        "'speaker_0': 'Tonight we've seen college educated women who are a great example. And we're rounding that out with another great example of really maintaining a commitment to the community. And so Jenni Rivera was a great example. I think she is exactly the type of people that we should name our parks after folks that that our young folks can who'",
        "'speaker_0': 'will play at this park will be able to aspire and look to as an example. So that said, I look forward to the Housing Neighborhoods Committee, you know, going ahead and improving that so that we can move forward.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_3': 'Thank you. With any public comment on the item.'",
        "'speaker_2': 'When is not.'",
        "'speaker_5': 'Good evening. Okay. I mean, I embrace a certain values, so the streets are safe. My name is this in? I'm from the sixth district.'",
        "'speaker_2': 'Is a promoter and promoter.'",
        "'speaker_5': 'And I'm a promoter of voting at this contract.'",
        "'speaker_2': 'You talk about I say, let me circle the Andrews bore awareness opportunity competition is to momentum to quintal a company.'",
        "'speaker_5': 'That first of all, I'd like to thank my Councilmember member Andrews, for giving us this opportunity and to be part of the community to study.'",
        "'speaker_2': 'Compartilhar see this, get the angle to comment.'",
        "'speaker_5': 'On me familiar. But I'd like to share some ideas with you that I've shared with my family.'",
        "'speaker_2': 'Jessica a lovely star, Jenni Rivera for years now that I contribute to a community.'",
        "'speaker_5': 'That I know that the artist Jenni Rivera was and is a great contributor in our community. But I mean, we are.'",
        "'speaker_2': 'K k number four we don't on control para podemos identificados conejo.'",
        "'speaker_5': 'But I would have liked for the name to be a bit more general for all of us could identify with her. But I have to say.'",
        "'speaker_2': 'Keppel yara mucho alos grupos. L.A. hit their. E l as Newcrest debuted in film sticker l as victims are willing to pay them a sticker.'",
        "'speaker_5': 'For example, I know she supported a lot of groups like LGBT T and the victims of domestic violence. Immigrant style.'",
        "'speaker_2': 'Gasoline umbrella park.'",
        "'speaker_5': 'For a helpless la senora.'",
        "'speaker_2': 'Or l parker tolerance here.'",
        "'speaker_5': 'And for example, I would have liked the park to have been named the Great Lady or Tolerance Park.'",
        "'speaker_2': 'Damien Bonner, Una placa con. We know that there are contenders Historia.'",
        "'speaker_5': 'And also put up a commemorative plaque that tells her story. Honorable or a tree.'",
        "'speaker_2': 'It's a song part is a mysterious but contributed commercial.'",
        "'speaker_5': 'But sonic beware.'",
        "'speaker_2': 'The intro witnesses you get them being reckoned. Moscow, Canada, La Comunidad de los Angeles.'",
        "'speaker_5': 'Les Gusta La La La Musica. The Wonder. And those are just some of my ideas that I would like to contribute as part of a person that lives in the sixth District. And I would also like to acknowledge that not all of the Long Beach residents like Banda Music.'",
        "'speaker_2': 'LLC, Inter Punto LLC and the Punto is the kind of market Castro Ricardo in Atlantic Helicopters. Katsuyama Peace.'",
        "'speaker_5': 'Park. It's time we the squid out.'",
        "'speaker_2': 'Of your window now.'",
        "'speaker_5': 'And the next point I'd like to make is that our park that's on Atlantic and 14th, that is called Peace Park is not well taken care of and it's been abandoned.'",
        "'speaker_2': 'This unfortunate mantra is the park lobby. Then all of a persona, skills and drogas. Okay, wind in progress.'",
        "'speaker_5': 'And unfortunately this park is either people are living or going there that use and sell drugs.'",
        "'speaker_2': 'In those years, this koala, let's call up poly and let's do this to the end.'",
        "'speaker_5': 'This is done exploited those.'",
        "'speaker_2': 'I city poly personas the lunacy.'",
        "'speaker_5': 'Weirdness and then on school days or students that go to poorly are exposed to these people Monday through Friday.'",
        "'speaker_2': 'You should those this list be the poor perverted bogan must have been children as a bargain item in his but okay let's see the asker. Your list blew the trial less dominant consideration.'",
        "'speaker_5': 'So I'd like to ask that you please pay more attention to that park. And I hope that you can pay attention and consider the ideas that I brought to you which are massive. Thank you very much.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'But again.'",
        "'speaker_4': 'When I noticed. As the council members.'",
        "'speaker_5': 'Good evening, council members.'",
        "'speaker_4': 'And the rest of it will not settle the streets.'",
        "'speaker_5': 'My name is Andres and I live in the 66th District.'",
        "'speaker_4': 'Is the crooked the main one of his family independently. If they gave for normally and are getting phone numbers on a mutual limit.'",
        "'speaker_5': 'And according to my independent point of view, I think it's a bad idea to name this park. Jenni Rivera I know she's helped Long Beach a lot.'",
        "'speaker_4': 'The settlement is improvement in all of we're not.'",
        "'speaker_5': 'Unfortunately, we always imitate what's bad and not what's good.'",
        "'speaker_4': 'Yeah, you know, mutuality, little or nothing can add up.'",
        "'speaker_5': 'She helped the city of Long Beach a lot and many people, but.'",
        "'speaker_4': 'I'm mentally there because at the end of the day is when a person get in to say Alzheimer's. I said, I'll call you.'",
        "'speaker_5': 'And unfortunately, the idea that people have of her is that she induces peop other people to be alcoholics.'",
        "'speaker_4': 'And it is another way to suppress that commando.'",
        "'speaker_5': 'On the stage. She's always drinking.'",
        "'speaker_4': 'Normally there but a person.'",
        "'speaker_5': 'And so it would be a bad idea for the rest of the people.'",
        "'speaker_4': 'This event. Nothing, nothing better but almost every other your mother. But again, it's not, say, police park or lumberjack beach, the Parks Department Park.'",
        "'speaker_5': 'And I don't know, I'm nobody. But I would like to see the park named something like Long Beach Police Park or Long Beach Fire Department Park.'",
        "'speaker_4': 'In Park City. I'm not saying the.'",
        "'speaker_5': 'Park of the Unknown hero. I don't know.'",
        "'speaker_4': 'If there was a minor unit, little jet then over the airport.'",
        "'speaker_5': 'And there's also an athlete from the New York Jets. I can't remember the name right now, but he gives a lot.'",
        "'speaker_4': 'He still may do a little commentary asking for the arrested okay capital and forget about it because there was some but I almost forget this was emperor. I'll call. Overseas.'",
        "'speaker_5': 'And I would recommend if it's possible that you watch the parks better because some of them are used for alcohol and some for drugs. Thank you.'",
        "'speaker_3': 'Thank you. Any other public comment on the item? CNN there is a motion on the floor. Members with Gordon Carter votes.'",
        "'speaker_4': 'Yeah. You.'",
        "'speaker_2': 'Motion carries eight zero.'",
        "'speaker_3': 'Thank you very much. We're going to go ahead now. Go back to the first hearing, Madam Clerk. Yes.'",
        "'speaker_7': 'We haven't taken concert calendar, have we.'",
        "'speaker_3': 'And now we will do hearing. I think.'",
        "'speaker_7': 'You can.'",
        "'speaker_3': 'Say yes. Hearing number one.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing and adopt resolution approving the Long Beach Tourism Business Improvement Area program and assessment for the period of October 1, 2014 through September 30, 2015, and authorize City Manager to execute an agreement with the Long Beach Area Convention and Visitors Bureau for a one-year term.  (Districts 1,2,4,5)": [
        "'speaker_2': 'Hearing number one is a report from the City Manager recommendation to receive supporting documentation into the record. Conclude the hearing and Adobe resolution approving the Long Beach Tourism Business Improvement Area Program and assessment for the period of October 1st, 2014 through September 30th, 2015, and authorize City Manager to execute an agreement with the Long Beach Area Convention'",
        "'speaker_2': 'and Visitor Bay Area for a one year term. Districts one, two, four and five.'",
        "'speaker_7': 'So moved.'",
        "'speaker_5': 'Back in.'",
        "'speaker_3': 'Case there's been a motion and a second by summer. Langford You wanna make some comments first?'",
        "'speaker_7': 'I do. I wanted to compliment the CDB. I know that Steve Goodling is out of town for work back East, but I do want to thank them for their tremendous work in keeping Long Beach at the forefront of the convention industry.'",
        "'speaker_7': 'And that's actually what he's doing back East right now. As we all know, conferences are a critical part of the downtown's economy, and I wholeheartedly support this item.'",
        "'speaker_3': 'Thank you. And Mr. West, did you have any any comments on this item?'",
        "'speaker_1': 'None. Although, Mike, can we start to ask answer any questions, if you might have any.'",
        "'speaker_3': 'Okay. I'm sorry if I submitted you with your motion on that. Okay. And the motion in a second on on that item, is there any public comment on the hearing? See, none of them, Gordon, come back and close the hearing and see no additional councilmember comments.'",
        "'speaker_3': 'Members, please go ahead and cast your votes.'",
        "'speaker_2': 'Councilman Andrews. Motion carries seven zero.'",
        "'speaker_3': 'Okay. We're going to go on to the second hearing. And this does not require an oath either. Madam Clerk.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and adopt resolution continuing the East Anaheim Street Parking and Business Improvement Area assessment for the period of October 1, 2014 through September 30, 2015; and authorize City Manager to extend the agreement with the East Anaheim Street Business Alliance for a one-year term.  (Districts 3,4)": [
        "'speaker_2': 'Item two is a report from the city manager. Recommendation to receive supporting documentation into the record. Conclude the hearing and Adobe resolution concerning the East Anaheim Street Parking and Business Improvement Area Assessment for the period of October 1st, 2014 through September 30th, 2015, and authorize City Manager to extend the agreement with East Anaheim Street Business Alliance for'",
        "'speaker_2': 'a one year term. District three and four.'",
        "'speaker_6': 'Councilman Price would like to make a motion at this time to approve this recommendation. I have a few comments.'",
        "'speaker_3': 'There's been a motion and a second. Councilwoman Price.'",
        "'speaker_6': 'Thank you. I want to take a moment. I'm not sure if there are any is the people here tonight, but I wanted to take a moment to welcome you and just acknowledge the great work that this group has been doing to revitalize the business, the businesses that.'",
        "'speaker_5': 'Operate.'",
        "'speaker_6': 'Along this corridor. I've had a chance to meet many of the leadership of the organization and attend some of their functions. And I believe they are doing a tremendous service to the community and to the business community in the area.'",
        "'speaker_6': 'And I'm happy to see that the the bid is working out well for the for the business community and want to support your efforts in any way that we can. So thank you.'",
        "'speaker_3': 'Thank you. The staff, any comment on that?'",
        "'speaker_1': 'No, just to recognize that the CEO, Rod Wilson, is in the audience. So thanks for being here, Rod. Well.'",
        "'speaker_3': 'Great. Thank you, Robert, for all the great work. Any public comment on the item? Seeing no public comment and no additional council comment. There's a motion on the floor, so please cast your votes.'",
        "'speaker_2': 'WEISS We are such a low income. Motion carry eight zero.'",
        "'speaker_3': 'Thank you. We're not going to go into public comment and therefore members of the public wishing to speak so all four can please come and line up. First is Dennis Dun, secondary Goodhew, then Larry Boland and then Scott believe it says Scott McCreery.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all necessary agreements, and any subsequent amendments, between the City of Long Beach and the State of California Health Benefits Exchange (also known as Covered California) to accept funding in the amount of $225,267 for a nine month period from October 1, 2014 to June 30, 2015, to facilitate outreach, enrollment, and retention into the insurance programs offered through Covered California, with an option for a one-year renewal and cash bonus contingent upon achieving enrollment goals (Bonus Pool = $7,500 per 100 effectuated); and increase appropriations in the Health Fund (SR 130) in the Department of Health and Human Services (HE) by $225,267.  (Citywide)": [
        "'speaker_2': 'Item 11 is a report from Health and Human Services recommendation to authorize city manager to execute an agreement with the State of California Health Benefits Exchange to accept funding in the amount of 225000 to 67, to facilitate outreach, enrollment and retention into the insurance programs offered through Calvert, California Citywide.'",
        "'speaker_7': 'So there's been a motion and a second. So any member of the public that wishes to address Council on item 11 seeing none. Are there any questions for staff? Would anyone like a staff report?'",
        "'speaker_8': 'Yeah, I'd like a quick staff report, please.'",
        "'speaker_7': 'Council member Austin Kelly Colby.'",
        "'speaker_5': 'We return the microphone to Cheryl Barrett, who's the, ah, director of Bureau of Policy Prevention. And I'm just going to learn that now about policy funding and prevention. And she is the one who is leading this grant. Thank you.'",
        "'speaker_7': 'Thank you for the opportunity to provide a brief staff report on this. So we're excited about this grant with Covered California. This strengthens our position as a certified enrollment entity in the city of Long Beach, but this actually provides us reimbursement for those enrollments under Covered California per say.'",
        "'speaker_7': 'So this is an effort of community as well as the Long Beach Health Department to work with the California Health Benefit Exchange to recognize local health departments as groups that should also get reimbursed for the work that we're doing.'",
        "'speaker_7': 'So in addition to the work that we're doing under Medi-Cal enrollment, we are now able to get recognized and also get reimbursed for the enrollment, retention and utilization work that we're doing for those eligible for subsidies. Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'Thank you. Councilmember Austin, is there any further discussion on item 11? Seeing nonmembers cast your vote, Madam Clerk. I'm a yes.'",
        "'speaker_2': 'Motion carry eight zero.'",
        "'speaker_7': 'Item 12.'"
    ],
    "Recommendation to adopt Specifications No. RFP PD14-029 and award a contract to Legacy Inmate Communications, of Cypress, CA, for providing inmate telephone and video visitation services at the Long Beach City Jail, for a period of two years, with the option to renew for two additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'Item 12 is a report from Police and Financial Management recommendation to award a contract to legacy inmate communications to provide inmate telephone and video visitation services at the Long Beach City Jail.'",
        "'speaker_1': 'City Summer.'",
        "'speaker_0': 'Thank.'",
        "'speaker_7': 'There's been a motion and a second set of staff report. There is not. So any member of the public that wishes to address Council on item 12. Is there. They don't see us.'",
        "'speaker_1': 'We certainly can have one. Deputy Chief Robert Luna can address it.'",
        "'speaker_7': 'Well, I have some council members that would like to address the issue, and perhaps there are questions for Deputy Chief. Councilmember Price.'",
        "'speaker_6': 'Thank you, Deputy Chief Luna. How many other local city jails are offering this service? I guess two inmates. It's kind of like a Skype. Is that what it is?'",
        "'speaker_3': 'We've provided the video services to vice mayor and members of the City Council. We've provided the video service for the last ten years, and I don't know exactly how many other cities offer this. We can definitely research.'",
        "'speaker_1': 'That for you and get back to you on that.'",
        "'speaker_6': 'And since I'm not familiar with what happens at our local jail, is this something that is a remote access or does the visitor have to be in the jail facility to have the contact via video?'",
        "'speaker_3': 'The current system that we have, you have to be in the facility to facilitate this. The new system that we're going to, which we're pretty excited about, you can remotely do this from other locations. That's one of the benefits that we get from the new system, other than I mean, there's different things that we're getting with this'",
        "'speaker_3': 'new system. Like I said, we're excited about our number one. The current system only offers two languages, and the new system will offer actually 20 languages, including Combi.'",
        "'speaker_6': 'So does this impact at all the inmates access to the telephone? Because I know that in some city jails, most facilities, they have limited access to being able to communicate with loved ones, which is part of the punishment.'",
        "'speaker_6': 'So how does this affect that?'",
        "'speaker_3': 'The current I'm sorry, the new system that we're going to will give more access to the prisoners because the you'll be able to get it in from different locations.'",
        "'speaker_6': 'I notice that it says in the in the staff report that 72% of all the revenue generated is going to go to the prisoner welfare fund account. What is that account?'",
        "'speaker_3': 'Are you talking specifically the prisoner welfare fund? What does that go to? Yes, that's used to purchase items or make repairs that benefits the inmates while they're in custody.'",
        "'speaker_6': 'And there's no it says there's no fiscal impact on the city's budget. How is that? Why is that?'",
        "'speaker_3': 'We currently do not.'",
        "'speaker_1': 'Pay for.'",
        "'speaker_3': 'The current system. As a matter of fact. The current system, as it sits now, ranges between zero and 42% of the funding that goes to the welfare fund. And that's exactly how the vendor draws the money for it.'",
        "'speaker_3': 'With the new system we're going to, 72%.'",
        "'speaker_1': 'Of that will.'",
        "'speaker_3': 'Will come to the prisoner welfare fund.'",
        "'speaker_6': 'And this is a service we provide so that we're user friendly for the inmates. I mean, what was the.'",
        "'speaker_5': 'What was the.'",
        "'speaker_6': 'Intent behind this to make it more accessible for them to talk to their loved ones?'",
        "'speaker_3': 'Ah, yes, absolutely.'",
        "'speaker_5': 'I have no further questions.'",
        "'speaker_7': 'So Councilmember Price raises a couple of questions for me. And I'm wondering in this might be helpful. There's no there's not very much background or explanation in the staff reports. So at this juncture, I'm curious, why is this service being considered?'",
        "'speaker_7': 'Not that it's not valuable or necessary just to understand why are we considering this right now or how did it come about?'",
        "'speaker_3': 'Okay. Well, the the new the current system, the new vendor provides similar services to the current vendor. So the basic operation will remain the same. But going to the new vendor, number one, the current vendor offers two languages.'",
        "'speaker_3': 'The new vendor offers 20 languages. We also the there will be an increased commission rate that will be paid to the prisoner welfare fund. Currently, the current vendor ranges between zero and 42%, depending on the service. The new vendor, 72%, will go to the prisoner welfare fund.'",
        "'speaker_3': 'Web based teleconferencing also is added. As stated earlier, the person doesn't have to come to the public safety building to talk to speak to their loved one. And the.'",
        "'speaker_0': 'Last is the.'",
        "'speaker_3': 'Ten new video stations, 36 new mounted jail cell phones, three which are free to inmates for their free calls, three phones mounted on wheels to allow inmates in isolation to make phone calls. So it does increase the accessibility to the inmates to use the the video teleconferencing.'",
        "'speaker_7': 'Thank you, Deputy Chief Councilmember Gonzalez.'",
        "'speaker_5': 'Thank you. I just had a couple of questions. So who who actually will be monitoring this site? I mean.'",
        "'speaker_3': 'Now, when a prisoner uses this system, there is no expectation of privacy. So the person in custody and the person out of custody who's talking to the to the prisoner understands that there's no level of privacy. The video is recorded for a limited time, 90 days, and our detectives have.'",
        "'speaker_1': 'Access to it, if so needed.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_7': 'Councilmember Mongo.'",
        "'speaker_5': 'Deputy Chief Luna. Sorry about my voice. Deputy Chief Luna. Would you say that this system actually increases the security and access for our prisoners so that there's less necessity to have the one on one face to face contact and all of the risks that come with bringing people in and out of the jails to talk with their'",
        "'speaker_5': 'loved ones.'",
        "'speaker_3': 'Yes, it does. And one of the reasons we've had this system for the last ten years is we were trying to prevent any contraband from entering the custody facility. And by doing this, it prevents any either weapons and or narcotics from entering.'",
        "'speaker_1': 'The Long Beach jail.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Councilmember Price.'",
        "'speaker_6': 'I guess the question I have and you've been doing it for ten years and apparently it's working, but is there any sort of limitation on the number of calls or access that a prisoner can have because that's inmate.'",
        "'speaker_6': 'That's actually considered a privilege. And so does the severity of the crime impact, how frequently they can, you know, videoconference with their loved one. Does everyone now get as much access as they want? Are there any limitations to their access to the outside world?'",
        "'speaker_6': 'Do we now? If we don't, that's okay. I'm just curious because I know that a lot of times you get court ordered phone calls or you get a certain number of phone calls a day. And so for increasing their access, you know, my question would be, you know, why are we doing that?'",
        "'speaker_6': 'Is that because we're trying to be more inmate friendly as a city?'",
        "'speaker_3': 'Yeah. I'm going to have our jail administrator come down and answer that specific question for you.'",
        "'speaker_6': 'It's inmates.'",
        "'speaker_3': 'Says Rollie Siebert, our jail administrator.'",
        "'speaker_6': 'Now. And this is for anyone that's serving time at the jail arrestees, as well as people who are sentenced under AB 109, correct?'",
        "'speaker_4': 'Yes.'",
        "'speaker_6': 'Right. So convicted folks, as well as people who are pending trial on open matters.'",
        "'speaker_3': 'We don't have.'",
        "'speaker_0': 'Convicted folks.'",
        "'speaker_3': 'In our jail. It's pre-sentencing or pre arraignment pre-sentencing.'",
        "'speaker_4': 'Yes.'",
        "'speaker_6': 'So that means they're convicted, they're awaiting sentencing.'",
        "'speaker_3': 'Go ahead and answer that.'",
        "'speaker_1': 'They're pretrial and the video conferencing is limited by our visiting hours. So the inmates will be allowed. Actually, the people from the outside will be allowed to set up the visits through the Internet to visit the inmates. The phone system is going to be virtually the same, except the city will get a higher percentage of the of'",
        "'speaker_1': 'the revenues in the prisoner welfare fund. The rates are going to remain exactly the same. And so it's no it's no real change other than video visitation for the parents, grandparents, etc.. They can't make it to the jail.'",
        "'speaker_1': 'And we only keep the people for up to 4 to 6 days, depending on when they're arrested.'",
        "'speaker_6': 'Okay. So that the amount of stay that they would have access to this is 4 to 6 days. Yes. Okay. Thank you.'",
        "'speaker_7': 'Councilmember Richardson.'",
        "'speaker_0': 'I think if the I think where the debate just ended. So I think we're good here.'",
        "'speaker_7': 'Councilmember Austin.'",
        "'speaker_8': 'Yeah, I agree. I just was wanting some clarification on terminology versus inmates versus arrestees and what that meant. And I think that was clarified. I'm ready to vote. Thank you.'",
        "'speaker_7': 'Thank you. Seeing no further discussion of the. I'm sorry, members, please cast your votes. I'm a yes.'",
        "'speaker_2': 'Motion carries eight zero.'"
    ],
    "Recommendation to respectfully request City Manager to work with President Obama's administration on providing a report within 90 days on the My Brother's Keeper (MBK) Community Challenge and methods on how the City of Long Beach can support the initiative to improve conditions for boys and men of color in Long Beach. This report should include the following components:   \tA thorough summary of the MBK Initiative, with specific focus on matters related to youth jobs and internships, living wages, violence prevention, and community-oriented policing;   \tA review of which current programs and policies within the City of Long Beach support the goals of the MBK Initiative;   \tAn evaluation of the ability for the City to accept the MBK Community Challenge;   \tA strategy of how to better connect City programs to community-based programs that align with the MBK Initiative;   \tA recommendation of how the City can collaborate with the Long Beach Unified School District (LBUSD) on their similar efforts and programs; and   \tRecommendations on potential next steps in accepting ": [
        "'speaker_2': 'Item 15 is communication from Councilmember Richardson, Councilwoman Gonzalez, Councilmember Arango and Councilman Austin. Recommendation to request the city manager to provide a report on President Obama's My Brother's Keeper Community Challenge and Methods on how the City of Long Beach can support the initiative to improve conditions for boys and men of color in Long Beach.'",
        "'speaker_3': 'I thank you, Councilmember Richardson.'",
        "'speaker_0': 'Thank you. Many of you know that in February of last year, President Obama announced the My Brother's Keeper initiative to address persistent opportunity gaps faced by boys and young men of color in our country, and to ensure that all young people can reach their full potential.'",
        "'speaker_0': 'This is an exciting program that brings attention to the population of youth who are oftentimes overlooked or don't have the equal opportunities or some of the same opportunities that others might. Most recently in September, President Obama issued the next step in the initiative and declared a community challenge, asking local communities to take action and become a part'",
        "'speaker_0': 'of My Brother's Keeper community by enacting sustainable change through policy programs and partnerships. The goals of those changes are to improve the life outcomes of all young people, regardless of who they are, where they come from, or the circumstances into which they're born.'",
        "'speaker_0': 'I feel that the Long City of Long Beach is well suited to meet this challenge. While we have areas of need in a large, diverse and complex population, we also have a history of working collaboratively to make positive changes that benefit our great city.'",
        "'speaker_0': 'We have a world class school system with Long Beach Unified, LBC, Cal State, Long Beach. We have a number of local, robust programs that center on improving outcomes for boys and young men of color like the NAACP XO program.'",
        "'speaker_0': 'The CC will be an elbow as the Urban Math Collaborative in Jordan High School and the Street Community Association. Our efforts for violence prevention, healthy Long Beach policy. We just we just passed tonight the great work that school board member Felton Williams is doing within school district.'",
        "'speaker_0': 'Most recently I had the opportunity to go to D.C. and hear President Obama speak on the My Brother's Keeper initiative, and I was deeply inspired by his words on the importance of this initiative. I want us to meet and exceed this challenge as a city and show that when we all work together collectively with a purpose to'",
        "'speaker_0': 'create better outcomes for our youth, we can be a model for other large urban cities throughout our country. There are a number of council members in. Our Mayor has also indicated they're willing to participate in this challenge. I hope that tonight we can talk about formally accepting it by investing our boys in young men of color.'",
        "'speaker_0': 'We're investing in our city's future. Our future prosperity depends on our young people having a fair chance to thrive and succeed. As outlined in the challenge, there are four key steps and accept a local community accepting the My Brother's Keeper.'",
        "'speaker_0': 'So that means one we are we formally accept the challenge to we begin to convene a local action summit. And three, we do some sort of a policy review and create recommendations. And then we put our plan in action.'",
        "'speaker_0': 'So that's that's my recommendation tonight. And I move the item.'",
        "'speaker_3': 'There's been a motion. And the second councilwoman Gonzalez.'",
        "'speaker_6': 'Just want to thank Councilmember Richardson for this.'",
        "'speaker_5': 'This is wonderful. I have a two young boys at.'",
        "'speaker_6': 'Home, another young boy on.'",
        "'speaker_5': 'The way. So it's you know, we.'",
        "'speaker_6': 'Often focus on young women and that's wonderful, but not a.'",
        "'speaker_5': 'Lot of focus on young men. And so.'",
        "'speaker_6': 'Knowing that as a mom and having that prevalent in our.'",
        "'speaker_5': 'City, I think this is so very important that we're mirroring something that the president has brought forth to us. And I think your leadership on this is really key. Thank you, Councilmember Richardson.'",
        "'speaker_3': 'Councilmember Andrews.'",
        "'speaker_1': 'Yes. Thank you. I mean, I also would like to. Thank you, Mayor. I also would like to thank, you know, Councilman Richardson for bringing this forward, because I think the initiative is great from President Obama because it does improve the future of Long Beach when we help our youth.'",
        "'speaker_1': 'I mean, we're investing in our future. And I think this is a wonderful, you know, item that you brought forth and congratulations.'",
        "'speaker_3': 'Councilmember Ringa.'",
        "'speaker_8': 'Thank you all. I, too, want to add my voice in thanking Councilmember Richardson for bringing this forward. We always hear to talk about how our young men are being misguided, misled and led astray by other sources around in the communities.'",
        "'speaker_8': 'And I think that getting this program together will be of great benefit to the city of Long Beach and to our community. I look forward to having those discussions in the future in terms of maybe a conference or a some kind of of a study session that might not not only be here in the council, but also'",
        "'speaker_8': 'on the committee, and to invite the community to participate and give them a broader perspective as to what we're trying to do with this with this initiative. Thank you.'",
        "'speaker_3': 'Thank you, Councilmember Austin.'",
        "'speaker_8': 'Thank you. And I, too, am very proud to sign on. And second, this this great agenda item. I want to congratulate and thank Councilmember Richardson for bringing it forward. Obviously, as a parent of two young boys and future young men of color, I am happy to accept this challenge.'",
        "'speaker_8': 'But I'd just like to say that, you know, I'm proud of the city of Long Beach, because I think we are we're cutting edge and and and moving in the right direction and have been moving in the right direction for some time.'",
        "'speaker_8': 'And so this challenge is going to be something that that I'm sure, like Councilmember Richardson said, that we will be able to exceed, meet and exceed in short order.'",
        "'speaker_3': 'Thank you. I also want to thank all the signers and Councilman Richardson for bringing this forward. And just as a small point of up here as well, we had a conversation with the White House possibly about two or three weeks ago about the My Brother's Keepers challenge.'",
        "'speaker_3': 'It's a great program, etc.. I think it's fantastic. The council is moving forward to support this really important program. The initiative has also asked mayors to sign on as a support and supportive of this important challenge from the President.'",
        "'speaker_3': 'And so I went ahead and signed about three weeks ago for myself, and I think that with the Council moving forward and putting this in place, I think it's a good opportunity for all of us to work together to address these incredibly important challenges.'",
        "'speaker_3': 'Oh. Any public comment?'",
        "'speaker_0': 'All right. My name is Howard Perry, along with 100 black men of Long Beach. And this is my associate, actual mentor and chairman, Lance Robert. As you guys know, the 100 black men is in relationship to the My Brother's Keepers.'",
        "'speaker_0': 'We've been doing that kind of work since 1963 in New York when we started. And as you know, we started here in Long Beach in 2008, and we have a mentoring program we started in 2008. We have it every Saturday at Cal State, Long Beach and every.'",
        "'speaker_1': 'Thursday of.'",
        "'speaker_0': 'The month. And we've been doing it since 2000 and we've never missed a Saturday. And we've had over a number of kids has gone on to graduate and go to college and they're doing real well. We got some exceptional stories that we can tell and so we want to be more involved in this process because we think'",
        "'speaker_0': 'we're touching the kids, the young men every day. So we kind of know the problems that they go through and and actually know how to help them through those issues. So we would like to be a part of the process.'",
        "'speaker_0': 'And I'm like a brother. Robert, speak a little.'",
        "'speaker_3': 'Bit more well-stated, Brother Perry and I'll just take the remaining minute and a few seconds here. But I am the chairman of the Mentoring Committee for the 100 Black Men of Long Beach and very proud of the work that we do and loving those young men and moving them to adulthood successfully from young men to adults, our'",
        "'speaker_3': 'boys, we tell them to manufacture strategies for success. We say boys make excuses for failure, but men manufacture strategies for success. So it's been our passion for the last six years. I'm even working on my dissertation and relevant to the work that we're doing with these young men, and we're making great strides in helping them to come'",
        "'speaker_3': 'up with a growth mindset with, with, with moral training that is beyond compare. These young men are doing it. And so I just wanted to say we're an exact match for what the President has called for. We've been we were on the front lines in the city of Long Beach doing this work in the community when our'",
        "'speaker_3': 'summer academies and we just want to be included in any conversation that goes on with the city council about boys of color in the community in the city of Long Beach. And that's why we're here this evening, that you would please include us in these types of conversations, because we're working hands on with them every day and'",
        "'speaker_3': 'we spend a lot of time. Everything is volunteer that we do. We don't charge for anything. We just give our service. We give our lives to the young people and we've been with them six years. We never charge for anything.'",
        "'speaker_3': 'So we're not here to sell anything. We're just here to uplift and and to support our young people. So thank you. Thank you. And thank you for for all the work you guys do. Any other public comment?'",
        "'speaker_5': 'Good evening. My name is Kim Evans and I am a resident of the city of Signal Hill, but I am a prior manager.'",
        "'speaker_7': 'Of Forest Lawn Memorial Parks and mortuaries here.'",
        "'speaker_5': 'In the city. And for the ten years that I served at the Vice President under my.'",
        "'speaker_7': 'Watch, we buried a multitude of young men of color.'",
        "'speaker_5': 'And I was so excited and thank you.'",
        "'speaker_7': 'Member Austin for the emails that I get on a continuous basis, letting me know what the topics that are going to be discussed here. Thank you.'",
        "'speaker_5': 'Member Richardson, for bringing this up. I was in D.C. two weeks ago sitting in the White.'",
        "'speaker_7': 'House discussing this.'",
        "'speaker_5': 'As a faith based member. So I want to thank you and I encourage all of you.'",
        "'speaker_7': 'To step forward. I looked at this one bullet point where it says that to evaluate.'",
        "'speaker_5': 'The ability for the city to.'",
        "'speaker_7': 'Accept the MBK community challenge. I don't know how we cannot not accept this challenge. We have a choice today, and I ask that you would please be favorable in making that choice. Thank you.'",
        "'speaker_3': 'Thank you. Any other public comment on the item? See? None. There's been a motion made on the floor in a second. So, members, all those in favor, please go and cast your vote.'",
        "'speaker_2': 'Motion carries a to.'",
        "'speaker_3': 'Thank you. Makes that in, please.'"
    ],
    "Recommendation to request that all youth under the age of seventeen (17) be admitted to Belmont Pool and other city pools for $1;  Request City Manager report back on the costs to expand the Summer Fun program to include youth from other community centers throughout the City if the demand is there, therefore, increasing the number of kids that can use the Belmont pool for free; and  Request further that City Manager explore with Long Beach Transit the possibility of a special bus or buses dedicated solely to taking people to and from Belmont pool similar to Los Angeles and Foothill Transit buses that take people to area beaches.": [
        "'speaker_2': 'Item 16 is a communication from Vice Mayor Sudhir Lowenthal, Councilwoman Susie Price and Councilman Andrews with three recommendation one to request that all youth under the age of 17 be admitted to Belmont Pool and other city pools for $1.'",
        "'speaker_2': 'Second requires city manager to report back on the cost to expand the summer fund program. And third, explore with the Long Beach Transit the possibility of a special bus or busses dedicated solely to taking people to and from Belmont Pool.'",
        "'speaker_3': 'Vice Mayor Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I'd like to make a few comments, but would also first like to make a motion to approve this item. Thank you. The Belmont Pool has been a city asset and symbol of our great cities regional aquatic stretch stature for more than 45 years, hosting local, regional and even Olympic competitions.'",
        "'speaker_7': 'With the closure of the plaza earlier this year, the temporary pool continues. This tradition of supporting community aquatics and the new pool will most assuredly reintroduce Long Beach to the national and international swimming community. However, to reinforce the pool's image, the Belmont Pools image, as a citywide asset that all of our residents feel connected to and proud'",
        "'speaker_7': 'of, we believe the city should make it easier for our youth to swim at Belmont and every pool, for that matter. As the so-called aquatic capital of America and a city committed to being a healthy community and certainly our brothers keepers, it is in our best interest to encourage our young residents to become lifelong swimmers no matter'",
        "'speaker_7': 'their economic, cultural or geographic status. And for these reasons, council members, I urge an eye vote from you. Thank you, Mr. Mayor.'",
        "'speaker_3': 'Thank you, Councilwoman Pryce.'",
        "'speaker_6': 'Thank you, Vice Mayor Lowenthal, for bringing this forward. I have said repeatedly in the Belmont Pool discussions that I started participating in in June and have been very actively involved in until today, that I want the Belmont Pool and of course, any other facility we have in the center but in the city, but especially the Belmont Pool'",
        "'speaker_6': ', to be a facility that every child in the city feels is theirs, regardless of it being in the third district, I want every child and family in this city to feel that this pool is their city pool and that they are welcome here and that there is no encumbrance to them being able to use the pool such'",
        "'speaker_6': 'as a financial one. So I think this is a wonderful item and I encourage my council colleagues to support it as well.'",
        "'speaker_3': 'Q Councilmember Andrews.'",
        "'speaker_1': 'Yes, thank you, Mayor. I want to thank our Councilwoman Lowenthal for bringing me in on this also, because as we find out, a lot of in our cities, a lot of times the dollar doesn't sound like a lot.'",
        "'speaker_1': 'But when you have a family for a dollar an awful lot and I know, you know a Kings Park, we have a problem, you know, just with the kids being able to afford to go to the pool there.'",
        "'speaker_1': 'So, you know, like I said, I think that this is one of the great things because it provides fun and challenging ways our children stay fit. You know, one is swimming is probably one of the most athletic, you know, challenges that you'll go through.'",
        "'speaker_1': 'So I always my favorite saying is my kids, they are tired, kid is a good kid. And that will definitely keep them in good shape and keep him out of trouble. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Mongo.'",
        "'speaker_5': 'I want to thank you for bringing forward this motion. I think involving our youth in our community and specifically in swimming at a young age is a great resource for our community. And I support this idea.'",
        "'speaker_3': 'Thank you. Members, please go ahead and cast your vote.'",
        "'speaker_2': 'Bush and Kerry eight term.'",
        "'speaker_3': 'Thank you. An extended plea.'"
    ],
    "Recommendation to respectfully request City Council to support Proposition 1 the Water Quality, Supply, and Infrastructure Improvement Act of 2014.": [
        "'speaker_2': 'Item 17 is communication from Councilman Austin Chair State Legislations Committee Recommendation to request City Council to support Proposition one. The Water Quality Supply and Infrastructure Improvement Act of 2014.'",
        "'speaker_3': 'Second, Councilmember Austin.'",
        "'speaker_8': 'Thank you. Yes, the state legislature committee met on October 7th and recommends this particular item for your consideration. I'd like to move to accept the recommendation of the committee, but don't get to say thank you and then get a quick staff report.'",
        "'speaker_3': 'Mr. West.'",
        "'speaker_1': 'Diana Tang.'",
        "'speaker_5': 'Mayor, members of the city council. In November, voters will have the option to vote on Proposition one. This is the statewide ballot measure for $7.5 billion in water bond funding. The city was instrumental in negotiating a couple of pieces of this this bond measure.'",
        "'speaker_5': 'First, we have 30 million to the arms. See, that is the Rivers and Mountains Conservancy, of which Long Beach is the member. There's also 200 million available for stormwater funding through integrated regional water management plans and Long Beach as a member of the Gateway Authority and can apply for that funding.'",
        "'speaker_5': 'So if this measure does pass, the city will have will as well positioned to apply for funding in the water bond and it is for 7.5 billion.'",
        "'speaker_3': 'McHugh comes from Boston.'",
        "'speaker_8': 'Yes. And I want to thank our staff, support Diana Tang for her great work, particularly in supporting the committee and giving us all the great information that we need to make a decision here. The supporters of this measure include the Beach Water Department, as well as the League of California Cities, Governor Jerry Brown, both Dianne Feinstein and'",
        "'speaker_8': 'Barbara Boxer and a host of other responsible organizations. And so I would encourage your support as well.'",
        "'speaker_3': 'Thank you. Any public comment on the item? CNN members, please cast your vote.'",
        "'speaker_2': 'Watching Kerry's eight zero.'",
        "'speaker_3': 'Thank you. Now, I believe we have announcements, so we're going to go ahead. I want to begin by just doing some adjournment in memory of a few folks here. First, I want to honor the passing of someone very close to our City Hall family, and that's Luann Lawanda Reynolds, who was known to all who loved her as'"
    ]
}