{
    "1. ROLL CALL": [
        "'CHAIR WHITE': ' Good afternoon, everyone, and welcome to the National Capital Planning Commission's January 6th, 2022 public meeting. Ms. Koster, would you please call the roll?'",
        "'MS. KOSTER': ' Certainly. Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Present.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Good afternoon.'",
        "'MS. KOSTER': ' Thank you. Commissioner May?'",
        "'COMMISSIONER MAY': ' Good afternoon. Thank you.'",
        "'MS. KOSTER': ' Okay. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Good afternoon.'",
        "'MS. KOSTER': ' Thank you. Chair White?'",
        "'CHAIR WHITE': ' Here.'",
        "'MS. KOSTER': ' Okay. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I'm here. Happy new year.'",
        "'MS. KOSTER': ' And the same to you. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Here. And as well, happy new year to all.'",
        "'MS. KOSTER': ' Thank you. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Present.'",
        "'MS. KOSTER': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Here.'",
        "'MS. KOSTER': ' And Commissioner Davenport?'",
        "'COMMISSIONER DAVENPORT': ' Present.'",
        "'MS. KOSTER': ' Thank you. I'll note that Marcel Acosta, the Executive Director, Anne Schuyler, General Counsel, and Diane Sullivan, Director of Urban Design and Plan Review, are also attending this meeting.'",
        "'CHAIR WHITE': 'Thank you. Well, noting the presence of a quorum, I'd like to call this meeting to order. Today's meeting is livestreamed and will be available in a few days as a video on NCPC's website. If there is no objection to the revised agenda, as posted, it is adopted as the order of business. And now, we will play a short video clip of the Pledge of Allegiance, please. (Pledge of Allegiance.) At this moment, I would like to pause for a moment of silence for all of those affected by COVID-19 in our nation and around the world. (Moment of Silence.) In response to the COVID-19 guidelines on public gatherings, NCPC will conduct its meetings online until circumstances change. I want to share how we will be conducting Commission business. Votes by the Commission will be conducted by roll call. When Commissioners wish to be recognized, they should unmute,'",
        "'CHAIR WHITE': 'turn on their web cams, and request to be recognized. During Commission deliberations, I will use a round-robin format to ask each Commissioner if they have any questions or comments. During deliberations, all Commissioners should be on video during that time, unless you are experiencing technical issues. When you wish to put forward a motion, a second, or an amendment, please unmute, identify yourself, and make the motion.'"
    ],
    "2. REPORT OF THE CHAIR": [
        "'CHAIR WHITE': 'Our next is Agenda Item No. 2, the Report of the Chair. And I want to say that I hope everyone had a safe and joyous holiday season, and that you're all looking forward to the many exciting projects and initiatives that NCPC will work on in 2022. And just to note that I have called a special Commission meeting on February 16th. This session will be used to familiarize the Commission in conducting meetings using the Zoom online platform. And we will also hear an important information presentation on the Pennsylvania Avenue Initiative at that time. Mr. Acosta will provide more details in his remarks. And that brings us to Agenda Item No. 3, the Report of our Executive Director, Mr. Acosta.'"
    ],
    "3. REPORT OF THE EXECUTIVE DIRECTOR": [
        "'MR. ACOSTA': 'Thank you, Madam Chair, and happy new year. As the Chair announced, we will move our online meeting platform at our March Commission meeting from Microsoft Teams to Zoom. This change will provide more flexibility and better security. We'll hold a special Commission meeting on February 16th to enable the Commission and staff to test this platform. Staff will contact Commissioners over the coming month to answer your questions and provide specific instructions for using Zoom at our Commission meeting. At the February 16th special meeting, staff will present three Pennsylvania Avenue concept alternatives we intend to release for public comment. The concept alternatives incorporate many of the ideas and recommendations made by our expert panel of last June's Pennsylvania Avenue Initiative public event. We hope that members of the Commission and the public can attend. Finally, on Thursday, January 27th, at noon, NCPC is pleased to host Dr. Elizabeth'",
        "'MR. ACOSTA': 'Rule, Assistant Professor of Race, Gender, and Culture Studies at American University, and a citizen of the Chickasaw Nation, for an online public presentation. Dr. Rule will discuss the history and presence of Native Americans in the Washington region to provide a broader understanding of tribal nations and how they interact with other modes of government. And you'll find this information on our website. So, that concludes my report for this month, and I'm happy to answer any questions that the Commission might have.'",
        "'CHAIR WHITE': ' Thank you, Mr. Acosta. Does the Commission have any questions for Mr. Acosta? (No response.) Hearing none, we will move to Agenda Item 4, which is the Legislative Update. Ms. Schuyler?'"
    ],
    "4. LEGISLATIVE UPDATE": [
        "'MS. SCHUYLER': 'Thank you, Madam Chair, and happy new year to you and all of the Commissioners. I do have two items that I would like to report today. The first is a provision of Section 6605 that was contained in Senate bill 1605, which is the National Defense Authorization Act for Fiscal Year 2022. The particular provision authorizes the location of the Global War on Terrorism Memorial to be located on the Reserve, as that term is defined in the Commemorative Works Act. And except for the provision prohibiting the location of memorials on the Reserve, it requires the memorial to comply with all remaining provisions of the CWA. The bill was passed by both Houses of Congress, signed by the President, and became public law on December 27th, 2021. The second is H.R. 1664, which is a bill to authorize the National Medal of Honor Museum Foundation to establish a'",
        "'MS. SCHUYLER': 'commemorative work in the District of Columbia and its environs. This was passed by both Houses of Congress, signed by the President, and became public law on December 27, 2021. It authorizes the National Medal of Honor Museum Foundation to establish a commemorative work on federal land in the District of Columbia and its environs to honor the extraordinary acts of valor, selfless service, and sacrifice displayed by Medal of Honor recipients. Establishment of the commemorative work shall be in accordance with requirements of the Commemorative Works Act. This concludes my presentation. If there are any questions, I'll be happy to answer them.'",
        "'CHAIR WHITE': ' Thank you, Ms. Schuyler. Does the Commission have any questions? (No response.)'"
    ],
    "4. ACTION ITEMS": [
        "'CHAIR WHITE': ' Hearing none, we will keep moving on. There are no Consent Items on our calendar this month, but we do want to get started on the open session, Agenda Item 5A, approval of preliminary and final site development plans for the National Arboretum Fence Replacement and Gate Improvement Project. And we will be hearing from Mr. Weil.'"
    ],
    "5A. UNITED STATES DEPARTMENT OF AGRICULTURE US NATIONAL ARBORETUM FENCE REPLACEMENT AND GATE IMPROVEMENTS": [
        "'MR. WEIL': ' Thank you very much. Can you see and hear my presentation?'",
        "'MS. KOSTER': ' Yes, we can. Thank you.'",
        "'MR. WEIL': 'Thank you very much. Good afternoon, Madam Chair White and Members of the Commission. The United States Department of Agriculture has submitted preliminary and final plans for a section of new replacement perimeter fence and gate improvements at the United States National Arboretum, which is located in Northeast Washington, D.C. The Commission previously reviewed the project as a concept proposal in May 2019, and since that time, the Arboretum has worked to refine its design and to complete the Section 106 process; concluding with a \"no adverse effect\" finding by the Arboretum and concurrence by the D.C. State Historic Preservation Office. As this is a final review by our Commission, we need to consider issues such as scale and context; the project's compatibility with future Arboretum and District plans, and the proposal's potential to impact the historic character of the Arboretum as a listed property on the National Register of'",
        "'MR. WEIL': 'Historic Places and D.C. Inventory of Historic Sites. Here's a satellite photo of the 446- acre Arboretum property, which is 2.3 miles to the northeast of the U.S. Capitol Building. That irregularly shaped property is situated between New York Avenue to the north, with adjacent sections of Bladensburg Road and R street to the west, and M Street to the south. The current main public gate to the Arboretum is located at the end of R Street. And here, you can see a variety of adjacent and nearby land uses, with Anacostia Park to the south and east; residential neighborhoods to the south, southwest, and west, and various commercial areas, shown here in yellow, to the northwest and north. The Arboretum mission is to enhance the economic, environmental, and aesthetic value of ornamental and landscape plants through long- term, mulitidisciplinary research, conservation of genetic resources, and interpretive gardens and exhibits.'",
        "'MR. WEIL': 'Early American leaders envisioned a national garden where science could be applied to the country's agricultural resources to advance national economic prosperity. In response, Congress passed the National Arboretum Act on March 4th, 1927, to establish the Arboretum for the purposes of research and education concerning tree and plant life. Currently, more than 600,000 people visit the Arboretum annually to appreciate its balance of cultivated gardens and natural landscapes; to enjoy the grounds as a recreational amenity, and to learn about horticulture. As part of the USDA's Agricultural Research Service, the Arboretum employs scientists who maintain a large and invaluable inventory of plants to support research for the nation and around the world. The current Arboretum Master Plan is from 2000, with a later 2007 modification, and the Arboretum is now updating its Master Plan to reinforce its campus core through future development; to improve interior circulation and perimeter accessibility,'",
        "'MR. WEIL': 'and to augment its ecological character, scientific mission, and historic assets. NCPC recently commented favorably on a concept of the plan in April 2021, and the Arboretum continues to refine the plan, which they will submit for future draft review by our Commission. The purpose of the project here today is to improve the appearance and security of the Arboretum by replacing 2.4 miles of perimeter fencing, realigning its fence line along New York Avenue, and modifying several perimeter gates. It's important to note that this project, which is much needed due to the deterioration of the existing fence, would not preclude any future projects or changes that are being considered through the new Master Plan Update. And there are no operational gate changes being proposed as part of this project at this time. The Arboretum's current perimeter fence is in poor condition with an inconsistent design, since the fence'",
        "'MR. WEIL': 'was installed in different sections over a period of 50-plus years. This graphic shows the more public-facing sides of the Arboretum with its current ornamental black picket fencing, highlighted here in red. The remainder of the perimeter, shown here in purple, adjacent to the National Park Service property, is protected by an 8-foot-high chainlink fence that meets the Arboretum's current fence height requirements. And so, there are no additional plans for any other fence improvements, once this project is complete. Here are several photos that give you a sense of what the perimeter fence currently looks like today. The Arboretum would install a new, similar style of black picket fencing along its perimeter, shown here in red, with a consistent 8-foot height and narrower 4-inch-on-center spacing. And the new fence specifications are meant to reduce the number of deer intrusions onto the property, which would better protect the Arboretum's valuable'",
        "'MR. WEIL': 'and unique specimen plantings. The new fence line would be adjusted along much the Arboretum's north side, as shown here, with one section pushed outward closer to New York Avenue along the Arboretum property line, and one section pulled back onto Arboretum property, out of public space. However, the fence line would remain in public space in two locations, as shown here on this slide. At the Conifer Road Gate location, the future fence line would remain in public space to tie into each of the gates' historic stone columns or stone piers, which are currently located several feet off of Arboretum property. The previous 2019 project proposal would have relocated and replaced this gate back onto Arboretum property. However, the Arboretum elected to preserve the gate, based on Section 106 consultations with the DC SHPO and NCPC. In the second location, near the Hickey Run Service Gate, the current'",
        "'MR. WEIL': 'fence line extends across the District Highway Dedication Area that encompasses a stormwater management facility, and the project would maintain the fence line and gate here, to continue to allow District access to maintain and monitor the facility, but with the new, taller, 8-foot-high fencing, and matching gates. And here, I would like to note that the Arboretum will have to submit these project locations to the District's Public Space Committee for a review and approval prior to construction. And we note this in our final review recommendation at the end of my presentation. Of the seven existing perimeter gates within the project area, three of the gates are currently abandoned and four gates are operational at this time. The project would remove two of the abandoned gates and improve two operational gates, all along New York Avenue. The other gates, shown here in yellow, would be preserved in their'",
        "'MR. WEIL': 'current condition. Besides the Hickey Run Gate, which would be replaced with new gates to match the new fence design, the Arboretum would replace the New York Avenue double swing gates and replace the existing paver access driveway with a new concrete driveway, as shown here in this rendering. However, all four of the gates' distinctive stone piers would be preserved, and the Arboretum would salvage the original swing gates for use elsewhere on its grounds in the future. The gate currently functions as a public entrance. However, the Arboretum may limit its future use to service delivery traffic only, as part of its Master Plan Update, which is considering broader accessibility and circulation changes around the property. Here is a rendering that shows the main public R Street Gate with new fencing that ties into the gate's concrete walls, and the Arboretum would continue to use R Street as'",
        "'MR. WEIL': 'its main gate until a new gate is constructed along Bladensburg Road, as shown here on this Concept Master Plan Update graphic. The main gate relocation was initially proposed as part of the Arboretum's 2000 Master Plan and remains in the 2020 update that is currently under development. Here is a ground view of the future gate site just to the north of Gate 7, with a chainlink fence section that would be replaced with new picket fencing as part of this project. The new gate access would reduce Arboretum-related traffic along R Street, which is a local residential roadway, and, also, give the Arboretum a greater visual presence along the higher-volume Bladensburg Road. Once the Bladensburg gate is operational, the R Street gate would be changed to permit staff use only, 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18'",
        "'MR. WEIL': '19 20 21 22 but the gate would still permit public pedestrian and bicycle access through the gate, as it does today. Another planned accessibility improvement would be to reopen the abandoned M Street gate to public bicycle and pedestrian access. The gate is located along an abandoned section of M Street right-of-way, as shown here on this slide, which is under DDOT jurisdiction. And DDOT would have to approve the right-of-way to allow safe pedestrian and bicycle access to reach the gate, as we noted previously in our 2019 review comments. One last project of note that is reflected in the 2020 Master Plan Update is the planned Anacostia River Walk Trail extension, which would improve connectivity between Kenilworth Park and the Arboretum with a new, 390-foot continuous span bridge across the river. NCPC previously reviewed concept plans for this back in 2017, and the National Park Service and'",
        "'MR. WEIL': 'DDOT continue to develop the project and plan to submit a more refined proposal to NCPC for a preliminary review in the future. The Arboretum will study these perimeter accessibility changes and other interior circulation improvements through their ongoing Master Plan Update, which is based on several objectives that include: enhancing the Arboretum scientific mission and unique ecological and cultural heritage; optimizing interior circulation and offsite connectivity, and reinforcing the campus core through new modernist development. As part of the Master Plan development process, which is ongoing, the Arboretum will need to coordinate its plans with federal, District, and local stakeholders that include NCPC, the National Park Service, DDOT, the District Office of Planning, the local ANC, and other community groups. And this will ensure that District community and Arboretum planning efforts successfully align. And we note these points in the final Executive Director's Recommendation before you here today. With'",
        "'MR. WEIL': 'that, that concludes my presentation. Dr. Richard Olsen, who serves as the Arboretum Director, as well as several of his project consultants and I, are now available for any questions by the Commission. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Mr. Weil. Before we start any public testimony, do any Commissioners have questions for Mr. Weil or the Arboretum representatives? Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes, I just wondered, in slide 31, I wasn't clear where the Langston Golf Course is on that other side. Does this enter into the Langston Golf Course at all? Or what's the relationship? Slide 31, I think it was.'",
        "'MR. WEIL': ' Okay.'",
        "'COMMISSIONER DIXON': ' I know you go across the river of whatever and --'",
        "'MR. WEIL': ' So, Dr. Olsen would be a better person to ask about exact kind of locations of entry with the Langston Golf Course.'",
        "'COMMISSIONER DIXON': ' I think it is further south of this or southeast, but I wasn't clear.'",
        "'MR. WEIL': ' Okay. Let me go back to that earlier kind of land use graphic.'",
        "'COMMISSIONER DIXON': ' Right here, yes.'",
        "'MR. WEIL': ' So, yes, I do know there is currently a perimeter fence that extends around the golf course.'",
        "'COMMISSIONER DIXON': ' Right.'",
        "'MR. WEIL': ' The golf course is here. You can kind of see one of the fairways right here. As to the exact gate locations, again, Dr. Olsen is available. Hopefully, he can chime in and comment on that.'",
        "'DR. OLSEN': ' Right. Yes. So, the Park Service has no fencing here. Every fence on our property or on the property line is our fence. We have no direct connections with Langston. And with regard to the perimeter fence project, we don't approach Langston. So, as Michael pointed out, the separation between Langston Golf Course and the National Arboretum to the south is the defunct M Street right-of-way that is part of'",
        "'COMMISSIONER DIXON': ' Right.'",
        "'DR. OLSEN': ' And then, it ends at the western boundary of Langston. So, I don't know if that answers your question, but the other gate --'",
        "'COMMISSIONER DIXON': ' Someone --'",
        "'DR. OLSEN': ' Go ahead.'",
        "'COMMISSIONER DIXON': ' Someone mentioned the fairway. I'm not sure I know where it is on the -- I think it's the fourth hole, but I'm not sure. It's a long par 5.'",
        "'DR. OLSEN': ' Yes, that tee box gets really close to our property. We get to see people when they need to take a mulligan. (Laughter.)'",
        "'COMMISSIONER DIXON': ' I've probably winged some balls across that into your property. I'm not sure, but I've got a feel for it now. Thank you for your comment and information. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon. Are there any other questions from the Commissioners. (No response.) Hearing none at the moment, we do have one person signed up to speak. Ms. Dombroski, you will have five minutes to provide your testimony, as you're representing the Anacostia Watershed Citizen Community Advisory Committee.'",
        "'MS. DOMBROSKI': ' I thank you very much. Thank you. Sorry, it's the Community Advisory Committee, not the citizens. We're trying to be a little more inclusive.'",
        "'CHAIR WHITE': ' I'm so sorry.'",
        "'MS. DOMBROSKI': 'Good afternoon. My name is Marian Dombroski, representing the Anacostia Watershed Community Advisory Committee. So, thank you for letting us represent the interests of our community and the watershed concerning this project. And we're grateful, also, to the District of Columbia, which is leading the way in the complex effort to transform the Anacostia River Corridor, of which the Arboretum is a part. First, I'd like to address the three main intentions stated in the project summary: Remove two abandoned New York Avenue gates and replace with a swing gate. We see this as an opportunity to communicate the Arboretum's mission physically and symbolically. Certain details communicate messages to the neighborhood. Some subtle changes can make this message positive and inclusive. We appreciate the Arboretum's sensitivity to the neighbors, and I'll go into specifics later on. Undertake limited shrub clearance. Invasive plants are a threat to the security of the'",
        "'MS. DOMBROSKI': 'collection, physical plant, and to visitors. It's our hope that the Arboretum will lead the way and inspire their neighbors to address the threat. Change of function of the remaining public New York Avenue gates. We urge the Arboretum to continue to remain flexible in response to local planning and development; continue to integrate the facility into the fabric of the neighborhood, and welcome pedestrian visitors to each of the four main cardinal gates. Our interest in this project stems from the prominence of the Arboretum as a unique natural area and crown jewel of the Upper Anacostia, a two-mile, free-flowing river reach, the shoreline of which it shares with five other unique natural areas. The New York Avenue gate is the face of the Arboretum for many. It's very prominent and the longest vista of any other gate. The proposed plan diminishes its appearance by removing the brick apron,'",
        "'MS. DOMBROSKI': 'downgrading the gate, replacing the curb fence. Replacement-in-kind will retain its appearance, despite any functional change in use. Enhanced planning and retention of the monumental logo sign would introduce the collection and provide identity at this prominent and highly visible location. Development of this corridor may prove attractive to pedestrians who might use this entrance without disturbing its other uses. I'm sorry -- the south gate. And if height of the new, decorative fence is adequate for security, redundant enclosures could be removed. The chainlink and Jersey barrier create an eyesore to the adjacent neighborhood and to the historic Langston Golf Course. It's understood that major improvements must await coordination with other projects, but failing to include this gate in a project aimed at improving the perimeter gives the appearance of neglect. Installing the ornamental gate fence at grade, providing a monumental logo sign, and modest planting at this location'",
        "'MS. DOMBROSKI': 'would be great improvements. The concrete rubble and other defunct security measures should also be removed. I'm sure that's part of the plan. Active transportation and visitor access. We request that planning for a bridge to the Arboretum be put on hold, pending resolution of important efforts, such as the Arboretum Master Plan, Kenilworth Park, and the Anacostia River Corridor assessment. The bridge proposal is damaging to the river; limits river use for water-dependent activities, and destroys the most expansive two- way, natural urban river reach in a major U.S. city. The proposed bridge and trail create a bypass or shortcut which neither connects adjacent neighborhoods to the Arboretum, nor does it create a monumental connection between two of the District's most unique and cherished parks. A river crossing could be co-located with existing bridges, thereby, preserving this unique natural area. To the extent possible, the natural area should be'",
        "'MS. DOMBROSKI': 'served by natural surface trails with as little disturbance as possible. The river gate. The National Park Service property between the Arboretum and river serve as a riverfront terrace for the Arboretum. Enhancing this area and upgrading access from the river is an opportunity which must not be squandered. Plants must be coordinated with, not driven by, transportation planning efforts. Development of this gate provides an opportunity to display riparian planting and provide a unique experience of the Anacostia River. The shoreline would be obliterated by such a massive element as the proposed bridge. Devoting the shoreline on both sides of the river to transportation is a misuse of waterfront property, subject to the Capper-Cramton Act. The Hickey Run and confluence --'",
        "'MR. ACOSTA': ' That's five minutes, Mrs. Dombroski.'",
        "'MS. DOMBROSKI': ' Oh, it is? Oh, geez. Okay. Okay. There was one sentence I'd like to include, if that's all right. One more?'",
        "'CHAIR WHITE': ' Yes, please go ahead. Uh-hum.'",
        "'MS. DOMBROSKI': ' Okay. Thank you. When Mayor Bowser recognized and invested in enhancing Kingman and Heritage Island for recreational and educational activities, and the DOE chose Kingman Lake as an early action area, a new vision for the Upper Anacostia was set in motion. This is not in planning; it is happening. We hope the Arboretum plan will, and all the plans for that particular part of the Anacostia, will be driven by this new vision. So, that's it. Thank you. Sorry. Sorry to go over --'",
        "'CHAIR WHITE': ' Thank you so much, Ms. Dombroski. Are there any questions for Ms. Dombroski from the Commissioners? (No response.) Hearing none, Ms. Dombroski, I just want to thank you. We really appreciate your thoughtful and very thoroughly written remarks as well. It really helps us understand better the context of the larger environment in which the Arboretum is located. And we really appreciate the efforts of the community to be engaged in this very precious resource. So, thank you very much. So, I'll now open it up to the Commission for discussion, starting with Commissioner May, and then, go in a round-robin format, using our normal seating order. So, please keep your web cams on during the discussion. And we will turn to Commissioner May.'",
        "'COMMISSIONER MAY': 'Yes. I don't think I have a lot to say that I haven't said before, particularly, most recently, in the Master Plan discussion back in the spring. I mean, certainly, we welcome the improvements that are being planned in the fences and the gates. It makes sense to move on what can be done, even if the bigger visions can't be realized at the moment. But I will just reiterate some disappointment that the M Street gate is not being addressed more aggressively at this stage. I agree with Ms. Dombroski that this is an important connection to the community, and it's one that I am personally familiar with from having used that. I think I've used that gate on the path. I don't know how long ago it closed. Maybe I'm just imaging it, but I remember being up there and being able to get to the community. It's'",
        "'COMMISSIONER MAY': 'just a real disappointment because it is not just an important connection to the community; it's an important connection to the rest of the city. For those folks who have not been to that part of the city, it is a real high point, and the view from there down Maryland Avenue I think draws a connection to the Capitol that you don't really experience in other ways from other locations. And I just feel like it's such an important sort of symbolic connection to the rest of the city, and it's disappointing that it's not being addressed now. I think I can understand why. I'm not really looking for an answer. You know, I understand the limitations that the Arboretum is operating under. I would just encourage that whatever can be done to do that, for its importance as a connection to the community, as a connection to the'",
        "'COMMISSIONER MAY': 'city, and ultimately, as a connection to the Anacostia Riverwalk Trail and Bridge, which is moving along ever so slowly, I just think that that's a very important thing to do right now. And, of course, I would love someday to see the new exit, or the new entrance, off of Bladensburg Avenue (sic) as well, because I've been driving by that \"curb cut to nowhere\" for, it seems like, (audio interference). But, yes, the M Street gate is, I think, most pressing for us. Otherwise, I'm very supportive of all of this moving ahead. I'd much like to see much more action, if we possibly can.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Thank you, Chairperson White. I have no additional comments, and I think what I would like to do is align myself with those made by Commissioner May at this time. Thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'I don't have much to add, either. I think the plan is well- conceived. I think most welcome to me is that there's more attention paid to the entrance, which you can quickly pass by and not realize that you've passed it, and that you're a welcome visitor. And now, I think they've gone a long way to remedying that and making it very clear that this is a public -- that the visitor experience is valued and that people are welcome to come in. I've been in a traffic jam on, I guess it's Bladensburg, many times. And so, I knew it was there. But I think if you were going 40 miles an hour, you'd be quickly faced with doing a U-turn when you got to New York Avenue, which is no easy feat. That sounds kind of silly to mention, but lots of times you want to'",
        "'COMMISSIONER WRIGHT': 'do something, and then, when it becomes inconvenient, you say, \"Oh, well, I'll just go get lunch instead.\" So, it's important to make it easy, and I think that plan addresses that.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Hi. Hi. I have no questions. Thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis? I'm sorry. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Thanks for that. No questions.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Also no questions for me. Thank you.'",
        "'CHAIR WHITE': ' Commissioner Davenport?'",
        "'COMMISSIONER DAVENPORT': ' I just had a question about the M Street issue and what the Arboretum has done to sort of monitor, update, mitigate any concerns that originally necessitated the closure of that gate, and how that sort of works into the long-term planning of the Arboretum.'",
        "'DR. OLSEN': 'Thank you. Yes, thank you for the question. The closure of that gate was due to crime and security issues, really, throughout the eighties and culminating in the 1990s. You can read about it in the newspaper, if you want to Google it. Also, cut-through traffic, police chases, and the fact that, at the end of the day, since the city never developed the way that it was supposed to along the original lines with access from Baltimore-Washington Parkway to Maryland -- and you would be received by the National Arboretum as you come into this glorious entrance to Washington, D.C. -- because that never happened, and yet, we built like it would, we've been trying to deal with that ever since: that our front door became our back door. So, flash forward now with the changes in the city and the neighborhoods, we recognize that access is important, but'",
        "'DR. OLSEN': 'that gate is not a simple just, you know, take the lock off and open it. It doesn't exist. It's been sealed over, closed-in in the fence line. And as you saw in the presentation, it's a little bit of a chicken-and-egg scenario. It is that the city has the responsibility outside of our gates that I have no control over. So, this is really an opportunity for really getting the parties together and say, \"Look, something's got to move first.\" And I would love to do it, but you're right, you would be asking me to incur costs that I can't currently cover. And if it hasn't happened, what's going to happen first, right? So, you see the issue with the Bladensburg road cut, that even though we planned for that, we can't even get funding for the gate there. So, we incorporate it into the new Master Plan.'",
        "'DR. OLSEN': 'Nothing that we're doing now would preclude that. But, as you can see, it's a big - -there's a lot of moving parts in the city, and I think NCPC has a great role in helping that. We are in communication with Congresswoman Eleanor Holmes Norton's office regarding this issue and DDOT. I have meetings planned. But, again, it's trying to put those pieces together, and a lot of it has to happen outside our gate.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davenport, did you have any additional questions?'",
        "'COMMISSIONER DAVENPORT': ' No. Thank you.'",
        "'CHAIR WHITE': ' Great. Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes, thank you, Chairman. I just want to align myself with all the comments we have heard, and especially about the disappointment of the M Street gates. Those are important, but I also appreciate all the coordination that has taken place so far. And I appreciate the comments that were provided in the staff report by Mr. Weil.'",
        "'CHAIR WHITE': ' Thank you. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes. Good afternoon. I really have nothing. I'll wave to the camera, but I have nothing else to add from what the other Commissioners have stated so far. Thank you.'",
        "'CHAIR WHITE': ' Thank you. Well, I would just like to add my appreciation for the staff and the Arboretum working closely and continuing to coordinate with the District and listening to the community, as we work through this process. And just reflecting on how I think it's very important and very smart to move forward with the fence. A fence says a lot, and just making that one change I think, especially in light of some of the comments from Commissioner Wright, that welcoming environment and showing that it's a place that people care for, will be a great step in the right direction. So, while a fence may seem to be a simple thing, I think it's going to have a positive impact. So, glad to see that that's moving forward. So, with that said, is there a motion to approve the preliminary and final site development plans?'",
        "'COMMISSIONER DIXON': ' So moved.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon. Is there a second?'",
        "'COMMISSIONER WRIGHT': ' Second. Commissioner Wright.'",
        "'CHAIR WHITE': ' Wright seconded. Ms. Koster, can you please confirm the motion and the second, and take the vote by roll call?'",
        "'MS. KOSTER': ' Certainly. The motion was by Commissioner Dixon. The second was by Commissioner Wright. And with that, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes.'",
        "'MS. KOSTER': ' Commissioner, thank you. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' And Commissioner Davenport?'",
        "'COMMISSIONER DAVENPORT': ' Abstain.'",
        "'MS. KOSTER': ' All right.'",
        "'CHAIR WHITE': ' Thank you. The motion is carried. Thank you, Mr. Weil.'",
        "'MR. WEIL': ' Thank you.'"
    ],
    " 6A. INFORMATION PRESENTATION METROPOLITAN WASHINGTON COUNCIL OF GOVERNMENTS METROPOLITAN UNIFIED PLANNING FRAMEWORK": [
        "'CHAIR WHITE': ' And the next item on our agenda is 6A, an information presentation regarding the Metropolitan Washington Council of Governments' recent activities. Ms. Koster, would you please set us up for the presentation?'",
        "'MS. KOSTER': ' Thank you. I'm delighted to introduce Chuck Bean, the Executive Director of the Metropolitan Washington Council of Governments -- or COG, as we like to call it here. NCPC and COG have a very long history of partnership and collaboration to advance shared planning goals across the National Capital Region. Today, Mr. Bean will discuss a number of recent policy goals and priorities that regional leaders at COG have established to shape initiatives both by COG and by local jurisdictions in our region. These interconnected goals address land use, transportation, climate change, energy -- all in the context of equity. I think this work is very exciting and it presents opportunities for NCPC and other federal agencies to advance our own federal interests and Administration priorities around these same topics. So, this is intended to be a timely presentation. And with that, I will turn it over to Mr. Bean.'",
        "'MR. BEAN': ' Well, thank you. Chair White and Commissioners, it's great to be here with you today. And, Mr. Acosta and Staff, it's been great partnering with you all over the years. So, I'm looking forward to a robust conversation today. Chair White, I've got about 30 slides. Sometimes I've done this in two hours. I may need to do it in 20 minutes. But I think, Chair White, if you want to interrupt at anytime to ask a clarifying question, I'm a pretty informal guy. So, I look forward to the dialog either throughout or the dialog after.'",
        "'CHAIR WHITE': ' Thank you so much.'",
        "'MR. BEAN': 'Thank you, Chair White. Our Metropolitan Washington Planning Framework consists of four pillars, and I'm going to go through those in a moment. And they relate to housing and equity, and transportation, and our climate goals. They're rooted in our 2010 Region Forward vision for the region, that I'm happy to say that NCPC was a supporter of and a partner of in the development of that vision -- founded on prosperity, accessibility, livability, sustainability. I remember that because the acronym is PALS. Well, in 2020, with a focus on equity, the Board added a fifth pillar. So, equity is intended to be woven through all of these plans. And, Julia, if you'd click one more? And I'll explain how we're looking to go about that. And so, let me bring you back to just the last two years of pretty furious work by the COG Board of Directors to'",
        "'MR. BEAN': 'develop this Framework. And next slide. 2019, we developed a set of housing targets. 2020, set a climate goal for the year 2030 for the Region. Been working on High Capacity Transit Station areas. Particularly, how do we get the best out of the robust transit system that we have, and then, Equity Emphasis Areas. And these go against the backdrop of the last decade of we've had some successes in the Region: Diversifying our regional economy. Winning the biggest economic development competition probably in history with HQ2 coming to the region. Some wins on dedicated funding for WMATA's Capital System, something that has alluded this region for 40 years, until it was realized a couple of years ago. Silver Line, Purple Line; improvements in air quality and walkability. Also, this decade, other challenges emerged, and housing I would put at the top of the list. Climate change and responding'",
        "'MR. BEAN': 'to climate change, and reducing the greenhouse gas emissions in the region, and our transportation, even while we made advances. We also brought in another 660,000 people to the region over the last decade. So, that population growth is always an opportunity and a challenge. So, that's against the backdrop of what the COG Board has focused on for the last two years. Now let's lay these Planning Frameworks back on the Region Forward diagram. So, we see prosperity is epitomized by Equity Emphasis Areas. In just a moment, I'll explain what that construct is. Accessibility. The High Capacity Transit Station areas, it sounds like transit, but it's really optimizing the land use to have access to that transit. Livability. How much housing do we need? How do we get there? And how do we get it in the right place? And then, the climate goal. So, the Region Forward'",
        "'MR. BEAN': 'overarching principles we've made concrete, can be made specific. So, if you're following along, when I get to numbers, it will be 350 for Equity Emphasis Areas. I'll explain that in a moment. High Capacity Stations, 225. Housing targets, the key number is 75, 75,000, and the sustainability of the climate goal reduced by 50 percent by 2030. So, actionable; a deep dive on all these four areas. So, let's start and go through each four. Advancing shared prosperity. So, while we have the word \"prosperity\" in Region Forward, when we weave in equity, the focus is on inclusive prosperity or shared prosperity. So, that gets us to Planning Framework No. 1 -- next slide, please -- and the aspiration to elevate 350 Equity Emphasis Areas. Now each of these 350 are census tracts. The Region has about 1200 census tracts in this footprint here, about 1200 footprints in a'",
        "'MR. BEAN': '3500-square-mile radius. We identified which of those 1200 have concentrations of low-income communities or concentrations of communities of color, or both. And it's these 350. So, from a regional planning organization perspective, if you want to work on equity, you have to be working on these 350 census tracts. Next slide, please. In part, why these are significant is there's about 30 percent of the Region's population that are in these census tracts, although they only occupy about 10 percent of the Region's land mass. So, they're a little bit more dense. And these Equity Emphasis Areas, these census tracts, are in every major jurisdiction of the Region. So, Loudoun has some; Fairfax has some; Montgomery. But you see there's a concentration in Maryland. Forty-seven percent of these 350 are in Maryland. And when you look at the data, the concentration in Maryland is Prince George's. And in Prince George's,'",
        "'MR. BEAN': 'it's inside the Beltway. So, the larger construct of the Region Divided -- this is that Brookings seminal document from 25 years ago -- is still important. It's still one of the strategic imperatives of the region. But here's a way to think about that really big challenge as 350 challenges. We need to work on the whole thing, but we need to have a plan for each of these 350 census tracts, if we're going to be working on equity. So, next slide, please. Now we started looking at these census tracts from a transportation perspective and modeling, what's the access to the number of jobs from each census tract? And if a new transportation project were implemented, or several, or a hundred, what would be the impact? Does this increase more economic mobility and the number of jobs? So, we started with transportation. Meanwhile, another part of our'",
        "'MR. BEAN': 'organization, the Chief Health Officers, were looking at social determinants of health. Well, it turns out they were looking at the same census tracts. So, transportation, health. Now we've made the commitment to look at all of our disciplines, all of our programmatic disciplines, from this equity lens. What are the disparities between the 1200 as a whole and these 350 as a whole? And we're now seeing that we're able to do this from an environmental lens, from a public safety lens, et cetera. We did this for roadway safety. Now they are disparities in fatalities and injuries between these 350 census tracts, 1200 as a whole. Statistically, yes, there are disparities. So, then, that leads to the inquiry: why? How? Is this engineering? Is this something else? I hope, Chair White, that this adequately explains how, when we say we're weaving in equity through a lot that we'",
        "'MR. BEAN': 'do, the equity emphasis here is our main point on this. Let's go to the second Framework, and this is about advancing accessibility. And the next slide. On the ground right now in the Region are 150 High Capacity Transit Station nodes, High Capacity Transit Station areas. Right now, that includes all of the WMATA stations, MARC, VRE, Streetcar. By 2030, we'll add another 75 High Capacity Transit Station areas, and that includes, really, the new innovation for the next decade, which would be bus rapid transit, epitomized by \"Embark Richmond Highway\" in Fairfax County, that I'll come back to in just a moment, and BRT Systems in Montgomery County. So, I think there are two \"acupuncture charts,\" is the term that I often use. If you want to make a difference on equity, look at these 350 census tracts. If you want to make the biggest difference on land'",
        "'MR. BEAN': 'use, housing, and economic development, focus on these 225 nodes. Next slide, please. These 225 nodes occupy just 10 percent of the Region's land mass. Let's see. Could we go to the next slide? These 225 High Capacity Transit Station areas occupy 10 percent of the Region's land mass. But, with just 10 percent of the Region's land mass -- I think we went back. So, let's go forward two more.'",
        "'MS. KOSTER': ' Yes. Sorry.'",
        "'MR. BEAN': ' That's all right.'",
        "'MS. KOSTER': ' Just trying to get this to advance.'",
        "'MR. BEAN': ' That's all right. I'll just keep talking.'",
        "'MS. KOSTER': ' Okay.'",
        "'MR. BEAN': 'I think Commissioners, hopefully, have that \"acupuncture chart,\" if you will, of the 225 High Capacity Transit Station areas in your minds. I'm saying that these areas occupy just 10 percent of the Region's land mass. Yet, they'll account for 42 percent of the Region's new household growth. And they'll account for 55 percent of the new job growth in the Region. So, 10 percent of the Region's land mass, the preponderance of household growth, and the majority of new job growth in these nodes. So, the next slide is a table. And, Chair White, I should have said at the beginning, yes, we'll send out the slide deck to the Commissioners. I'm happy to do that. And we'll follow up with Julia to provide a link to the COG website that you all can look at the Equity Emphasis Areas robust tool that we have, HCT maps, et cetera.'",
        "'MR. BEAN': 'But here's where the High Capacity Transit Stations are, a preponderance in the District, with a density at Metro Stations, for example, but, also, Montgomery County and Prince George's County. And part of the vision here is that we will optimize, not just the WMATA stations, but work to better leverage the land use around MARC and VRE, and evolve from a commuter rail system to a regional rail system. This might be epitomized by the Woodbridge Station, 2 million square feet of development going to go around that station. So, next slide. This is kind of conceptual. A term we often use to think about optimizing the land use around these High Capacity Transit Stations is \"TOC,\" or transit-oriented communities. So, we no longer say, \"TOD\"; we say, \"TOC\" for communities, because development is not the end goal of this planning; communities, community- building is the end goal of'",
        "'MR. BEAN': 'this planning. And while TOD, the hallmark has been mixed use, that residential and commercial can coexist in the same hub, we need to add something else, and that's mixed income. It's a struggle because land use appreciates around these nodes. But TOC means mixed use and mixed income, and that refers to the housing. So, next slide. A little visual around what optimizing around High Capacity Transit Stations means. Look at this bull's eye, if you will. The red is that half-mile. That's traditionally associated with TOD. But we're looking beyond the half-mile to a mile, to two miles. We need to optimize the land use all around these High Capacity Transit Station nodes. So, Chair White and Commissioners, when I think of these 225, I think we're thinking of 225 bull's eyes around the Region. And as it relates to your work, optimizing federal facilities, federal plans, means'",
        "'MR. BEAN': 'how do we optimize plans around the Purple Line, which connects so many federal facilities; the density of High Capacity Transit nodes in the Region, so there's walkability, bike-ability? As we go out into the next decade, autonomous shuttle going from the surrounding community to the High Capacity Transit node. Next slide. And, of course, all of this works together. And you'll find on our website maps that document the High Capacity Transit nodes and the Equity Emphasis Areas, as we think about maximizing the opportunity, such as around National Landing, where HQ2 is, but maximizing the opportunity of the Equity Emphasis Areas that might be a couple of miles away to take advantage of that opportunity. A hundred and sixty-eight of these High Capacity Transit areas overlap with an Equity Emphasis Area. If I were to be asked, well, where ought we start, it might start with the overlap'",
        "'MR. BEAN': 'of these two, as we think about the best opportunities, the best bang for the buck. And that might be the Blue Line Corridor in Prince George's County and several other examples. Let's go to the last of the four. Advancing livability is the next slide. And that pertains to a focus on housing. And why housing? The outgoing Director of Economic Development from Virginia -- and this is a super-smart guy; he was the brainiac around the HQ2 proposal to Amazon -- so, this is a true economic development guy recruiting companies, et cetera. What he says going out is, \"Northern Virginia's main constraint on economic development is housing.\" So, this is not a housing advocate. This is an economic development guy. Housing is the main constraint. All right. So, I'm going to share our perspective, our analysis. Well, how much more housing is needed? So, the blue line'",
        "'MR. BEAN': 'is what we forecast. In other words, we do forecasts for jobs, households, and population for the Region. The orange line above it is the housing that we actually need. And can you click? And the delta between the 245,000 that we forecast over the next decade -- click -- is about 75,000. So, about 75,000 more than is forecast, for a total of 320,000, is needed in the Region. What's important? Not just the gross number. If we can go to the next slide? Important about housing are three things. The next slide will show an orange bar: 75,000 units beyond forecast is what's needed. But not only the right amount, this housing, to meet many of our regional goals, has to be in the right place. And the right place here is defined as proximate to transit. So, we think about optimizing land use around High Capacity Transit,'",
        "'MR. BEAN': 'these 225 nodes. That's where more housing affordability needs to happen. Not just lower-income, but medium-income households. So, that comes to our third target, the volume of housing that's developed, as we look at the economic base, the employee base, 3.2 million jobs right now; by 2030, another 400,000. So, 3.6 million jobs, some of those very high-paying; some not-so-high-paying, but we've got to accommodate those jobs. For example, people are going to be having two-hour commutes, and we want to figure out ways to get the 30-minute commute, 40-minute commute, not just from an economic development perspective, but also to achieve some of our climate goals. So, I'm going to go to the next slide, please. Here's just a little bit of a drill- down. I just brought a one-minute case study here. This is Fairfax County. And you see on the left of your screen the nodes. Those'",
        "'MR. BEAN': 'are the High Capacity Transit nodes in Fairfax. And you see, on the righthand part, going down Route 1, Richmond Highway, a lot of maroon or red-colored dots. That's in \"Embark Richmond Highway.\" That's the BRT plan, the $750 million, billion- dollar plan for Route 1. You see on the righthand side, these are the Equity Emphasis Areas, the census tracts. And what's remarkable as you see, the census tracts in a row along Route 1 in kind of the northern part of Route 1. So, Fairfax is working on two things right now: transit equity and economic opportunity. So, we move in the example of Fort Belvoir here. And the biggest employer in Fairfax County is not in Tysons, as much of a juggernaut Tysons is, or Reston. The biggest employer in Fairfax County is Fort Belvoir. As you think about housing for Fort Belvoir or housing for the'",
        "'MR. BEAN': 'jobs at Fort Belvoir, it turns out that many more of the housing that's needed is outside the base, multiples. Someone even told me yesterday it's more like a ratio of jobs on the base compared to housing on the base of like 50, or even 100, to 1. So, even if that number is not quite right, much more of the housing is off-base. And that's why this transportation plan, this BRT plan, going from Alexandria right down Richmond Highway to Fort Belvoir, is just so important for the County, but it's also going to be so important for the base. And I think you all, if you're helping the facilities, federal facilities, with their housing plans, I think all these boards are going to have that situation where more of the jobs, more of the people that have the jobs on-base are living off the base. So, it's'",
        "'MR. BEAN': 'just so important to be working with the local jurisdictions on these housing plans. So, next slide, please. Now moving into the fourth of four, this is our climate goals. And next. Just as a little bit of background, as part of Region Forward, we set some greenhouse gas emission reduction goals. Part of one of it was reduction in the Region by 2020. Several of our jurisdictions will reach that 20 percent reduction by 2020, but now we're looking forward to 2030. In 2020, the COG Board set a 50 percent greenhouse gas emission reduction goal for the Region. We were elated when President Biden came in and set that same target of 50 percent reduction by 2030 for the nation. Next slide, please. And as all of you know, this needs to be a multi-sectoral approach. There needs to be \"bend the curve\" on clean energy on the'",
        "'MR. BEAN': 'built environment and on transportation. We exceeded our goals in the Region on developing renewables, but some of our challenges also relate to adding 660,000 people and the demand that puts on transportation, the demand that puts on commercial space. We are actively analyzing scenario planning. What would it take to get to those goals? Julia sits on TPB, and she can share with you some of that analysis that we're doing with Cadmus and ICF. So, wrapping up, a handful of slides, just putting some of these into action. And we'll send you links to our 2030 Climate and Energy Plan. And we're doing several Climate and Energy Plans for our member jurisdictions. Our member jurisdictions contract COG or contract COG along with a consultant. So, Fairfax and Prince George's, Charles County, for example. Sometimes it's plans for a government operation; sometimes it's communitywide. I'm happy to dialog with'",
        "'MR. BEAN': 'you more about that. Go to our next slide, please. So, our focus in 2022 is accelerating action in all these domains. So, I'll briefly talk about work on racial equity, on housing, on improving access to transit, climate and energy, and make sure that you have some handles on names of our plans, so that you'll be able to find them on our website. Next, please. On advancing racial equity, I think I'll just give one note. That third bullet called \"Regional Learning Cohort,\" COG has partnered with a national organization called GARE, Government Alliance on Race and Equity. And we developed a cohort of 11 jurisdictions that voluntarily participated, with about 10 people from each of their jurisdictions, to learn about racial equity as it's applied to government policy. A year-long program. So, it's a total of about 110 people from 11 jurisdictions. We've completed one cohort, year-long'",
        "'MR. BEAN': 'cohort. We're in the midst of the second cohort that will go on for a year. My hope is that we'll be able to start a third cohort of 100-some people maybe in the fall. And my hope is that we could open this up not just to our member jurisdictions, but to our key governmental/quasi-governmental partners. So, if that's of interest to NCPC, we'd love to talk with you about that. Next slide, please. We have some grant programs that accelerate best practices. One that we're going to announce next week at our Board meeting is funding to promote housing affordability plans. So, in the housing perspective, it's about $75,000 for feasibility studies, design work, et cetera. So, more information will be announced on that next week. Next. And climate and energy action planning. I mentioned that we're engaged at the regional level. We do the Greenhouse Gas Inventories'",
        "'MR. BEAN': 'for the Region, for our member jurisdictions, and then, we do plans with our members. Next slide, please. EV charging and EV charging infrastructure might be something that, if NCPC is interested, that we could follow up on. It seems like an amazing opportunity that needs to be seized this year, the opportunity for economies of scale in planning, in implementation; economies of scale, particularly, in procurement. So, as the President has given a mandate to electrify the federal fleet, we're in weekly dialog with our members and the contracts that Montgomery has to electrify its school bus system. So, this might be a unique opportunity for key federal partners from EPA, DOE, USDOT. Where are the point people from the federal government, working with NCPC? And we would bring Fairfax and Montgomery, the District, and others, to the table to find synergies, not only to develop a vision, but'",
        "'MR. BEAN': 'develop an action plan to accelerate charging infrastructure for the Region. The next one is National Capital Trail Network. So, building bicycle lanes is not just a nice amenity. Hopefully, you've seen it's woven into our transportation plans and our optimizing land use around High Capacity Transit that bikes, and more and more in the future electric bicycles, can be part of our transportation planning. It needs to be looked at through an equity perspective. So, how do we include Equity Emphasis Areas in future bike trails? The status now. There's a vision for 800 miles of bike lanes throughout the Region. The plan is on our website. The good news is almost half has been built. That means about another half needs to be built. And I think partnership with the National Park Service, NCPC, can be a big pull for the next decade. Hopefully, we have the wind'",
        "'MR. BEAN': 'at our back on a number of these things in the next couple of years. So, slide 32. And, of course, that's the bipartisan infrastructure bill. About $20 billion is a ballpark figure, $3 billion in the District, $7 billion in Maryland, $9 billion in Virginia. So, we'll be working in great detail through the Transportation Planning Board on transportation infrastructure. We convene all the water utilities in the Region, so water infrastructure, and another example. So, we'd be happy to work with NCPC and stay in dialog in order to take advantage of these opportunities for our Region and our shared interest for making this area all it can be. So, Chair White, I think I went on just a few more minutes that I had planned, but I am at your disposal until midnight, if we can talk, talk about any of this. (Laughter.) So, I'll turn it'",
        "'MR. BEAN': 'to you. And I think, Julia, unless Chair White wants to refer to any of the slides, I'm just as happy taking the slide deck down.'",
        "'CHAIR WHITE': ' Well, thank you so much for the presentation. And you did it in very short order, given the complexities of the issues and how you're putting them all together. And it's really great to hear such a holistic approach and, also, a refreshing look at the language that we use in how we describe what we're trying to achieve. So, I really appreciated that. And I have a couple of questions and comments, but I want to open it up to the Commissioners first, if that's all right. If anyone has any general questions of Mr. Bean, or we'll go round robin. Why don't we start it off with Commissioner Dixon?'",
        "'COMMISSIONER DIXON': 'I'm willing to go round robin, but I did put my camera on. First of all, there's always, with me, an excitement to hear presentations from COG, since I chaired it for multiple years when I was younger, and always felt that the wisdom was great. We were talking the talk always, but we were trying to get jurisdictions to walk the walk. That's the problem. (Laughter.) I've got a lot of things on my list, and I don't want to take up too much time. But the one thing here, we always used to talk about D.C. being the \"hole in the donut\" within the Region, which is an old concept. But I think we've gotten past that. But I think there's so many holes in the donut, which are areas like \"our\" -- I call Anacostia River East \"our\" -- and maybe even PG County areas that are'",
        "'COMMISSIONER DIXON': 'challenged, and how we can take on those and deal with them, and get them in the mix is important. The population is not always able to be as engaged, because of time constraints, as other areas. So, that makes it much more challenging. I also feel that we just had a project come before us, and the federal government passed on being able to put solar panels on a building because they couldn't afford it. I couldn't afford to put them on my house, either, but I did. And D.C. has a very aggressive program. Virginia does not; Maryland does not, as far as I know, not having felt the hand of the heavy electrical lobby. But I'm sure it's being felt and I hope we can get past that. Because I saw your photo panels and I got excited. NCPC knows that I get excited about solar panels.'",
        "'COMMISSIONER DIXON': 'It's like wine coming from the sky, and nobody is catching it to drink it. (Laughter.) But the point I make here is that we've got to find ways to get these governments, these state governments, to do like D.C. has one, encourage this and offer a benefit to get these panels in. It may not be that the panels will help the building it's on, but if it can be put back in the grid, it can do a lot to help others. I also feel like there is a population drop going on, as you know, in D.C., which surprised me -- and it didn't surprise me; it's been coming. Are you factoring that in? Are they leaving the Region or are they just leaving D.C.? Now I'm out of questions, after having that little statement. But are you aware of this?'",
        "'MR. BEAN': ' Yes, I understand that --what is it? -- 20,000-some --'",
        "'COMMISSIONER DIXON': ' Twenty thousand per month.'",
        "'MR. BEAN': ' Yes. From our perspective, they're not net leaving the region.'",
        "'COMMISSIONER DIXON': ' Right.'",
        "'MR. BEAN': ' So, it grew in the last Census by 660,000 people.'",
        "'COMMISSIONER DIXON': ' Right.'",
        "'MR. BEAN': ' That's about 10 percent growth. It's not as fast as -- I think, Chair White, you're in Houston -- not as fast as Houston or some of the \"sunshine cities,\" but that's a stronger growth than most northern metropolitan areas. A slight decline in the District. So, that probably has a whole conversation to it.'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MR. BEAN': ' But I think, once I start on that, it's going to take me 15 minutes to --'",
        "'COMMISSIONER DIXON': 'All these things require a lot of time, as you've already commented. You did wonderfully well to get what you presented so quickly, when there's so much involved here. I would be curious, I've always wondered whether or not we couldn't do a more focused look at the part of \"our\" Anacostia River East, and PG, those areas, because they don't always match up statistically to the regional statistics, and that sends a message which is not always as clear and useful to get the support we need from federal and other things, because it gets lost in the shuffle as a bright day, when we're really in shade in some areas. I'm making some comments. Maybe you can -- I'm not really going to try to get you to answer because maybe some of them require more than can be done now. But I also always kind of laugh'",
        "'COMMISSIONER DIXON': 'when I see these -- I have an electric car myself. At least it's a hybrid electric. And I'm of the opinion that, you know, that electric to charge those vehicles has to come from someplace. And if it's still fossil fuel providing the electricity, you haven't really gained much, I mean except for the exhaust and, you know, keeping the pollution down. So, you've got to find ways to be able to generate the non-fossil fuel, going back to solar, whatever we do to deal with that. So, it's not just another way to burn more gas -- more electric, I should say. I've got a lot of things written down. I don't want to go on because my colleagues deserve more time, some time. But, again, I'm excited by what you're doing; I always am. And as I said, we just have to not only let you guys'",
        "'COMMISSIONER DIXON': 'talk the talk and give the numbers, but we've got to get these jurisdictions to walk the walk and focus on areas where they need to make a big difference. And I'm not sure we always are able to direct it the way we should be able to. Thank you for what you're doing, though. Thank you very much.'",
        "'MR. BEAN': ' Thank you, Mr. Dixon.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon. As the former Chair of COG, it was so appropriate to start with you. Mr. Bean, did you want to say something else? I'm sorry.'",
        "'MR. BEAN': ' No, I'll take my cue from Mr. Dixon, and we'll have another conversation when we give others. But I want to come back to opportunities in Prince George's and opportunities to do climate action planning. Even five years ago, Mr. Dixon, with some of these jurisdictions, I would have thought it's science fiction we'd be doing this climate action planning with them, but now it's happening. So, it's really these next couple of years we have some big opportunities. But I'll stop there and we can have another go-round in a few minutes.'",
        "'COMMISSIONER DIXON': ' Thank you for your work.'",
        "'CHAIR WHITE': ' Thank you so much. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Sorry about that. No questions, but I just want to thank COG for all the work that it does. I mean, it's a really great partnership. And I think that regionalism is really important, and these items that you touch on I think are going to move the Region Forward together. So, I'll just thank you for all of COG's work.'",
        "'MR. BEAN': ' Thank you. We had a recent presentation on the ecosystem for EV infrastructure that I think the rest of the Region was, oh, that's what a master plan for EV charging looks like. So, I appreciate our partners there. Thanks.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Yes, thank you so much for the presentation. I really appreciate it. I just wanted to echo Commissioner Dixon. I'm really interested in hearing any additional details about the electrification space, in particular. But I appreciate the presentation.'",
        "'MR. BEAN': 'I think let me try to say the opportunity is, technically, it's possible to do a detailed master plan. We modeled 17 million trips that happen every day. That's a number pre-pandemic. So, we know where the trips are happening, whether it's in a car or it's a bike or it's a bus. So, technically, we can, then, know within each jurisdiction what's the need. We can work with that jurisdiction on where could that possibly be. The funding is not there to do that kind of master plan, but if the federal government is going to make some big leaps on electrifying the federal fleet, that would be the train, I think, that would get us going. I'm thinking about NIH and other major facilities in Montgomery County. Montgomery County is already there. So, let's link those together. So, I think, if there's one opportunity to make ground this'",
        "'MR. BEAN': 'year, that would be it. Thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davenport?'",
        "'COMMISSIONER DAVENPORT': 'Hi, Chuck. As someone who works for someone who is a former Chair of COG, and who's biggest award in his office is for the work he did at COG, I'm very familiar with the good work that you all do. And I wanted to drill down on that issue that I know Congressman Connolly worked on a lot at COG, and as Chairman of Fairfax County. And that was your housing presentation, and just get some maybe orders of scale. When you talk about certain trajectories for needing 75,000 more units, and a certain percentage of those needing to be near transit, and a certain percentage of those needing to be targeted toward moderate-to-low- income households, what is the scale of the trajectory change that we're talking here? Like do local housing programs need to double, triple, quadruple in size? What is, I guess, the amount of action that'",
        "'COMMISSIONER DAVENPORT': 'is going to be required for the current trajectory at the local level?'",
        "'MR. BEAN': 'Thank you. Just to level set, in the region right now there are about 2.1 million housing units on the ground. So, when we model the number of jobs going out the next year, the population to fill those jobs, and the households needed for that population, there's about an additional 320,000 needed on top of that 2.1 million. When we look at what are the forecasts, looking at the land use, the land plans, housing plans, about 245,000 is what we project. So, I think, Collin, the trajectory needs to change from 245 and it needs to change to 320. So, an additional 75,000 on top of the 240. So, I think, then, that can be brought down to each jurisdiction, depending on what's its population base, its forecast, its job growth. And then, there can be that same level of increase by each jurisdiction. Now some jurisdictions in'",
        "'MR. BEAN': 'the region have adopted very specific housing targets that are completely in line with that trajectory you're referring to. So, Alexandria's housing plan, Alexandria's targets are near that trajectory. Prince George's, County Executive Angela Alsobrooks -- I think it's an additional 26,000 housing units in Prince George's County. So, Prince George's targets echo that. Mayor Bowser, the additional housing that's in her plan, she identified a 2025 target, but it's really that line that she's identified is the line we need by 2030. So, I think that's one part of the answer, Collin, and that is the overall amount. The next important thing is where. All that additional housing really can't go in western Loudoun or southern Charles or northern Frederick County. Otherwise, we're not getting the quality-of-life goals; we're not getting the climate goals. It needs to be closer to the jobs. So, transit-oriented communities. So, 75 percent of'",
        "'MR. BEAN': 'the numbers that I just said, 75 percent of all that housing needs to be in that \"acupuncture chart\" that I talked about, the High Capacity Transit Station areas. And then, of all that housing, 75 percent needs to be priced at a point that's accessible to low- or moderate-income families. So, I think if I've said too much, Collin, I remember it as 75/75/75 -- 75,000 more than we forecast; 75 percent near High Capacity Transit or activity centers, and 75 percent of that housing needs to be accessible to low- and moderate-income people, in order to have a high- performing economy and shared prosperity.'",
        "'COMMISSIONER DAVENPORT': ' Thank you.'",
        "'CHAIR WHITE': ' That's a great formula to remember. Thank you, Commissioner Davenport. Any further questions or comments?'",
        "'COMMISSIONER DAVENPORT': ' No.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes, thank you. And that was a very good presentation. The D.C. Office of Planning has been working very closely with COG and supports all the work that we've done together, and through both COG and the Transportation Planning Board, and are very happy to see it all discussed under one envelope. As you know, as you were pointing out, the Mayor has put a great emphasis on housing and pushing all of her agencies to remove any kind of barriers and moving housing forward. So, I just wanted to thank you for your work.'",
        "'MR. BEAN': 'Thank you, Jennifer. I would say special shutouts to Andrew Trueblood and Polly Donaldson, who now have moved on from the District, but they were so active in COG. Andrew Trueblood chairing the Planning -- we have a Planning Director's Committee; Polly chairing the Housing Director's Committee. They were right at the hub when the COG Board developed the housing targets back in 2019. And just a little anecdote about Mayor Bowser and Senior Advisor Beverly Perry. We were at a COG retreat in 2018. And this is at the time that the Region had made the short list for HQ2 three times out of twenty. So, no other region was like that. So, we thought, oh, this really could happen. So, we brought in the former Director of Transportation from Seattle. \"What are the transportation impacts of an Amazon?\" And it turned out that he spoke at least 50'",
        "'MR. BEAN': 'percent of the time not on transportation, but on housing. So, transportation/housing, you've got to have the housing proximate to the jobs. Otherwise, you're going to have all kinds of transportation problems. So, it was from them that we really began, oh, we need to set these targets. And I think Beverly Perry was on the phone to Mayor Bowser that day, \"We need to get on this.\" And, boy, Mayor Bowser has just really epitomized rolling this out -- the number, in the right place, and in all the other Wards. So, thank you, Jennifer.'",
        "'CHAIR WHITE': ' Thank you. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Oh, thanks for the presentation. I appreciate it. Some good things to think about there, and I really appreciate the comments from the other Commissioners who continue to try to educate me. So, thanks for coming by today.'",
        "'CHAIR WHITE': ' Thank you. Commissioner May?'",
        "'COMMISSIONER MAY': 'Sure. Thank you, also, very much. Very glad to receive this presentation. I wasn't sure what we were going to see, when we started up, because sometimes planning on this scale can just be really mind- numbing. But I think you did a really good job explaining it, and explaining it in very direct terms. So, I really do appreciate not just the content, but, actually, the delivery. Just to add on a couple of things, one of the things I think that we are all going to be grappling with, if we're not already grappling with right now, is return-to-work scenarios, since we've all been working from home for so long, and what will mean for major employers. And certainly, within my office, I expect that in-office participation is going to drop substantially, I mean more than 50 percent will not be -- I mean, our office occupancy is'",
        "'COMMISSIONER MAY': 'going to probably drop by more than 50 percent just within my Division. Some of the other ones won't. But, certainly, in the parks, where we have to have people onsite, we're going to have people onsite. But I expect that there's going to be really substantial changes and that will make certain aspects of this planning easier in terms of reduced trips and perhaps less transportation infrastructure needed. But it also complicates other things, right? How do you make sure that you have the kind of vibrancy and livelihood, and so on, in major areas like downtown D.C., which is suffering from now a lack of people, right? The lack of people affects many businesses. And so, all those other things that I'm sure you're starting to think about, as we get out of our current mode, which really comes soon. I do want to emphasize one aspect of'",
        "'COMMISSIONER MAY': 'NCPC's work in relationship to all of the things that you describe, and that is this ongoing issue of where federal workplaces are sited. And it doesn't happen that often, right? There aren't that many new major facilities that are being sited in this area. But it does happen. We have encountered that in my time on the Commission. And it's clear that it's a major issue. There have been a few very stark examples of not really great decision-making about locating of the facilities. I won't go into great detail about the DHS headquarters, but I know Ms. Wright expects me to mention it. (Laughter.) That's just one, but there are other more recent ones, such as the Bureau of Engraving and Printing and their decision to locate where they have, which, I mean, it has benefits and it has disadvantages as well. But, really, it's they, basically, have'",
        "'COMMISSIONER MAY': 'created or established themselves in a location that requires -- I don't know -- a very large portion of their workers to commute by car. And it is one of those places where people actually have to be there all the time. So, I don't expect they're going to be significantly affected by work-from-home strategies, and things like that. And I think that's one area where NCPC has not been able to do as much with the agencies and (audio interference). So, I really am hopeful about some of the thinking that you're doing. Some of the planning that they're doing can lead into what NCPC staff are trying to do much more aggressively with federal agencies when it comes to the location of federal facilities. Because I think it's not just about where people are located, but it's also where the business is. And, of course, our business is'",
        "'COMMISSIONER MAY': 'the federal government. And I will mention one other, well, a couple of things. One is that, in all of this planning, the thing that I will always want to speak up for is the preservation of open space and parkland. And new developments require not only the development of buildings and infrastructure, and accommodation for vehicles and things like that, but they require the development of parkland, to be blunt. And this is something that is not really written. It's not ingrained in our planning and thinking in many areas. In some areas it is. But I think that it is something that is vitally important. If we're going to have more people in this area, it's certainly terrific that we are trying to concentrate those people in the transit-oriented communities, but I think it's equally important to make sure that we are taking steps to preserve open space'",
        "'COMMISSIONER MAY': 'and to establish parkland in proximity to these transit- oriented communities, right? Everybody wants to be able to go to the nearby park. You know, we want to be able to walk our dogs and ride our bikes and recreate. And so, I think that's a really important part of that. But, of course, that ties into the Trail Network, which we are thrilled to be working with you on, and really work with the COG on, as we develop a more expansive trail network. And then, the last thing I'll say is just sort of underscore what Commissioner Dixon mentioned with regard to solar and the importance of emphasizing that. And it really is remarkable. I mean, from my window, I can see three solar installations on housing here on Capitol Hill in the Historic District, right? We can still have them. And there are so many flat roofs'",
        "'COMMISSIONER MAY': 'in Washington that are begging for solar power installation, and the city has such great incentives for it. And it's way ahead, but still has much more potential. And I can't imagine. You know, areas where it's not incentivized the way it is in the District, how much more could be done, if it were? So, I think it's a critically important thing. I know that it saves me half my electric bill every month. It's paid for itself a couple of times over now in the seven or eight years that I've had it on my house. So, it's a vitally important thing. So, I did a lot of talking. I'm not really looking for a lot of response. I saw a lot of nodding. But, if you want to say something, sure, go ahead.'",
        "'MR. BEAN': 'Yes, yes. Everything you said is so interesting that I can't resist. (Laughter.) Maybe just taking it from the top, I appreciate your observation of looking at these big problems. You know, we're the sixth largest metro in the country. So, the scale of this is big. But I think we're trying to look at these in bite size, as well as look at the whole. So, yes, optimize National Landing in Arlington. But those census tracts around Arlington on Columbia Pike -- I was just so thrilled a couple of weeks ago when Amazon put in $150 million and Arlington put $150 million to preserve an affordable housing community on Columbia Pike. It's not in HQ2. But that's the kind of thing, you know, we need. And going back to Commissioner Dixon, you know, that's the kind of thinking we need for the Blue Line Corridor, going out from'",
        "'MR. BEAN': 'the District out to Largo. The return to office, we could spend days on this. This is probably the main thing that -- I am part of a group of major metro COGs. Commissioner White, one of my best pals, is the Director of the Houston COG. so, we're constantly asking, what's your modeling looking like? How's it going to change? Just talking here -- it's not a statement -- the scenario that you've outlined, Mr. May, where somebody, instead of commuting in five days a week, might be coming in two days a week, that might decrease the gravity of that center, but I don't think we would want the outcome of sprawl. We don't want that person three hours away. But if we can think of new ways about MARC and VRE, and create communities out of these 225 nodes, and think about -- we're not calling it'",
        "'MR. BEAN': 'yet, but we're very interested -- what Paris calls the \"15-Minute City\" or \"15-Minute Community.\" How do we do that in these 225 places? I think that has something to do with the implications of this, potentially, different gravity that a different return-to-office might look like. On the siting, would love to have a longer conversation. What's the saying? That, to a carpenter, everything looks like a nail. (Laughter.) So, to your question, siting criteria, from our perspective, the four elements of the Planning Framework also apply. So, near High Capacity Transit. We've got to optimize that land use. So, what does that look like? You know, that walkshed around that station should look like a beautiful full moon, 10 minutes from a half-mile all around it. A lot of our walksheds look like a crescent moon because there's a highway or there's some impediment there. So, they've got to'",
        "'MR. BEAN': 'optimize all those places. And I would think an analysis of the High Capacity Transit areas, with all of the facilities that you're looking at, or potentially looking at, what's the land use optimization, so we can get to that, whether it's WMATA, MARC, VRE, VRT? Equity Emphasis Areas, because all federal employees are not at that six-digit level, but might be at the $50,000 position. So, what's their commute shed look like? And how do we think about Equity Emphasis Areas being able to get to that? The highest proportion of the workforce, if we look at all of our jurisdictions and their proportion of federal workers out of the whole workforce, the largest is Charles County. So, when we had the federal shutdown, and we looked at what could be the impact on relatively low-income workers, it was the largest percentage of their workforce are federal workers. So,'",
        "'MR. BEAN': 'there's a lot of commuting from Charles County of federal workers. And then, climate and housing. A beautiful kind of -- this is planner excitement - -a beautiful cone. You know, absent or apart from the District's height limits, out of these 225 places, what will the market bear in that half-mile around all these places? And then, how do we taper into the mile and the mile and a half? I think all that has something to do with optimizing the places where these sitings might go. So, Chair White, Mr. May, happy to continue this at another time.'",
        "'COMMISSIONER MAY': ' Thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Argo?'",
        "'COMMISSIONER ARGO': 'I am here. I'm cognizant of the time; I don't want to take up much at all. I started thinking, when I was thinking about this and listening to all that's been said, one of the things that strikes me is - - oh, I'm trying to figure out the best way to put it -- kind of the generational shift that is happening here. And now, I may be on the -- how do I say it? -- older side of the equation that I'm talking about. But, you know, not very long ago -- like I'm talking about in the last five years --was I working in a place where there were still the kind of attitudes about what we used to call -- I'll use the polite term for it -- \"B in Cs,\" \"bottoms in chairs,\" workplaces where now it seems almost archaic with the things'",
        "'COMMISSIONER ARGO': 'that are happening of different perspectives, but shifting how you get into some of the more traditional, like in governments, attitudes about how do you measure productivity when you don't have \"a bottom in the chair\" in front of you. Anyway, it just occurred to me. The last place I worked -- I'm now retired -- where I worked for somebody that was really intolerant of the idea of not being where you could be summoned to a meeting, where you could be called on easily. And I'm fumbling a little bit, but I'm thinking about different -- I'll have to think about it more and maybe be more articulate about it, but thinking about ways in which we influence managerial perspectives and workplaces to accommodate some of the things that we're talking about. I have more to say, but I'm going to give my time to the next person'",
        "'COMMISSIONER ARGO': 'on the list. Thank you.'",
        "'CHAIR WHITE': ' Thanks.'",
        "'COMMISSIONER ARGO': ' This is really, really interesting.'",
        "'CHAIR WHITE': ' And it shows there's just so much rich conversation here. Mr. Bean, you wanted to say something in response to Commissioner Argo? Please.'",
        "'MR. BEAN': 'Three quick things. First is I think competition for a great workforce is going to have to be met with this kind of flexibility. The 20-somethings and 30-somethings, you know, they're going to need that flexibility. So, as employers, we're just going to need to get ready for it. My own telework regime, rather than everybody coming back when we come back, we changed it, and it's going to be two or three days per week when we come back. And we have some more loopholes for flexibility. Because some of our most productive folks -- I hope this sounds okay -- most productive folks are like a 30-something mom. Boy, we need to keep her. Sorry if the gender's not right. But we need to keep those young parents and we need to show some flexibility. So, I think that's going to be across government. In terms of generational,'",
        "'MR. BEAN': 'like who are we and who are we becoming? Going back to Mr. Dixon's points about growth, we've grown in the Region. Of course, you know, with babies, but we've growth primarily from foreign migration, from domestic migration. So, we're becoming more diverse. In the 70s, I think we were like 4 percent foreign-born; now we're like 20 percent and 27 percent of the Region foreign-born. So, we're going to need to keep adapting. And one other thing I meant to say to Mr. May, thinking about return to office and what does it mean for downtown DC, we're going to hear the \"C word\" a lot, conversion -- conversion of office to residential. And that could be a nice opportunity. I think the District, within the last 20 years, sought to be an 18-hour place, places, meaning live and work. It could be even more than that. So, there's'",
        "'MR. BEAN': 'challenges, but, through commercial-to-residential conversion done thoughtfully, this could be big opportunities for very livable places.'",
        "'CHAIR WHITE': 'Thank you. I understand Commissioner Wright had to leave the meeting. So, I think that concludes our round robin. If anyone has any additional questions, please let me know. Myself, I would like to really echo what Commissioner May spoke about in terms of public space and parkland, and that really struck me, particularly in your four pillars and on slide 14, where you have the transit-oriented communities. As I mentioned before, I think that's a really smart change from transit- oriented development. And in a former life, having worked on a set of guidelines for transit-oriented development, I think the word \"development\" has come to mean many negative things to communities in many ways. So, I think that's a really powerful move, a simple one, but very powerful. And in thinking about public space and parkland and transportation, when you use the word \"transit,\" having worked at the Chicago'",
        "'CHAIR WHITE': 'Transit Authority for many years, for me, it conjures up public transit or public transport. And I saw you noted pedestrian and bicycle projects underneath that. But I think if you could call out a little bit more, that when you say, \"transportation,\" it's all of it. It's public transit. It's cars. It's active transportation. So, public space and greenways, in particular, you know, that system is as powerful, maybe does not carry or move as many people, but it is a significant growing trend. And at the end, you shared the map about trails. That might be brought to the forefront a little bit more, because those systems are really important complements to not just the highways, but the public transit lines, and so forth. And I know you understand that, and just calling it out more I think would be really helpful because that public realm, and the'",
        "'CHAIR WHITE': 'ability to walk to public transit, is as important as the public transit itself. So, I loved the statistics that you shared about the goals for how many miles of trail. And we know the D.C. Region is leading in many ways around the country on parks and open space and access to parks, open space, and development of trails. And I think about the Urban Land Institute study. I think it was in 2016 they released trail-oriented development. And Mr. McMahon went around the country and came here, in fact. And we used that report a lot to advance the work that we're trying to do and greenways. So, the power behind that in the public space, not just for transportation, but also climate, economic development, health indicators. So, I just really want to echo what Commissioner May was saying, that that's a really powerful element to your plan'",
        "'CHAIR WHITE': 'that is important from an equity perspective across the board. But, that said, I just think you can tell by everyone staying on for this call that this is a really important conversation. And you bring an energy and passion to this that we really appreciate. And again, the way you convey the information is also really helpful, because there's so much to be considered. So, we really appreciate that, and the shared goals, and the tools, and your championing, I guess, being a champion of, regional thinking, and then, talking with your colleagues around the country. Keep that up. We really appreciate it. And as the at-large member, that means a lot to me. But if there's anything, in conclusion, you would like to say -- maybe we'll schedule regular conversations with you throughout the year, so we don't save it all up for one time -- but if'",
        "'CHAIR WHITE': 'you have any concluding remarks, we would love to hear them.'",
        "'MR. BEAN': ' Yes, of course, I'd be happy to have regular conversations. And we have about 122 staff that are subject matter experts in all these areas. So, staff-to-staff or bringing any of them in and working on some of these joint projects, we'd be happy to. I appreciated your constructive feedback on the park access. One way, newer way, that we might -- \"we,\" COG -- might be thinking about that is I mentioned these 350 census tracts allows us this analytical frame to look at, what's different between these 350 and the 1200 as a whole? I think it was only about nine months ago that someone brought to me, \"You know, Chuck, we can look at the tree canopy\" --'",
        "'CHAIR WHITE': ' Uh-hum.'",
        "'MR. BEAN': ' -- \"and look at disparity amongst all these census tracts.\"'",
        "'CHAIR WHITE': ' Absolutely.'",
        "'MR. BEAN': 'I had not thought of that. And tree canopy, as you know, not just as an aesthetic, but cooling the neighborhood and values to the community. So, statistically, we can look at what are the differences, and then, in those stark terms, what should be done about it? I think, similarly, what's the access to parks; what's the access to open space between these 350 census tracts and the 1200 as a whole? And any jurisdiction could do the same analysis. Just from an equity perspective, who has access to these open spaces? From an economic development perspective, quality of life? Of course, as we think about the bull's eye, think about the opportunity for that density of people; also, that opportunity for that open space. So, you've given me some good things to think about in that regard. I'll credit, also, Mr. May, who has given me some good'",
        "'MR. BEAN': 'things to think about in that regard.'",
        "'CHAIR WHITE': ' Well, thank you. And, you know, it's so interesting, particularly in this time of COVID, that I think people's heightened awareness of the value of parks and open space as a place to be healthy and seek respite, it's a time to elevate that role of parks as a building block of healthy communities. So, I am a park advocate; also, transit and comprehensive planning. So, this is all music to my ears. So, thank you, and we'll continue this dialog. Commissioner May, did you have other comments you would like to make? I know we could go on about this for the rest of the day. Oh, you're on -- there you go.'",
        "'COMMISSIONER MAY': ' Yes, very quickly, because we have an audience beyond the people who are on the call here. And one of my colleagues in another agency just pinged me and suggested that we not forget about water as a means of transportation.'",
        "'CHAIR WHITE': ' Absolutely.'",
        "'COMMISSIONER MAY': ' And I'm sure that's in your thinking, but maybe it needs to be called out.'",
        "'CHAIR WHITE': ' Yes, blueways and greenways. That is so true.'",
        "'COMMISSIONER MAY': ' Blueways and greenways. Of course, you know, be very careful because we control almost all the shoreline. So, it's pretty tempting to do much, but --(Laughter.)'",
        "'MR. BEAN': 'Thank you. Thank you, Mr. May. And to your colleague, it was President Johnson that called the Potomac River a national disgrace. And it was through a lot of collaboration, some federal regulation, that we were able in the Region create the Blue Plains Wastewater Treatment facility, which is the second largest in the world. And we helped, kind of as a referee, the budgeting and what's the amount of input, but that's a collaboration between the District and Fairfax, Montgomery, and Prince George's. And not just water for water's sake, but look at the economic development potential that's just bloomed in the last 10 years. National Harbor would not have been possible or The Wharf would not have been possible, the revitalization of the Town of Alexandria, and water taxis that are connecting all of them. Think about the cleanup of Anacostia. It seemed like science fiction to talk'",
        "'MR. BEAN': 'about that with Mayor Williams and others maybe 15 years ago. And, you know, so much progress, with more to do, in such little time. So, thank you. And I know Mr. Dixon has his hand raised.'",
        "'CHAIR WHITE': ' Yes, he does.'",
        "'MR. BEAN': ' And I also wanted to follow up on our previous conversation. I'm looking forward to attending the Price George's County Council Retreat in about a month. And it will be a similar presentation, a Prince George's version of this. So, I think, Mr. Dixon, as you talk about areas of particular opportunity, you know, Prince George's is at the top of our list.'",
        "'COMMISSIONER DIXON': 'Yes, I just wanted to make very quick points, because we could go on forever. But, moving from the macro -- that is, the regional macro -- to the micro -- that's the neighborhood area -- one of the things I tried to do many years ago was to make PG County and \"our\" Anacostia River East, a single hub zone, Enterprise Zone, because of the highly shared space and location. I'm not sure that will ever come back in play. But I also wanted to point out that we have an abundance of federal presence in \"our\" Anacostia River East, and there's a lot of new housing coming there. And what we, obviously, are wanting to do is to keep some of our current residents. I don't want to use the word \"gentrification.\" I think it's an economic phenomena that's going to happen. But we don't want them to'",
        "'COMMISSIONER DIXON': 'go overboard, and we want to find ways to get the local residents into some of these job opportunities. They don't have to ride buses; they can walk, and they can walk through the park to get to these places. But we've got a lot of federal presence there, and we are not really into that mix very much. I want to make one last thank you to our COG. Many years ago, when the D.C. Government, many governments, were doing their budget by hand -- and when you wanted to make a change, you went back for a couple of hours or days to change the statistics -- I asked COG, because I was with COG then as (audio interference), and I said, \"Can you let us use your spreadsheet system that you use\" -- simple Excel, right? -- \"to be able to put our budget on?\" And they'",
        "'COMMISSIONER DIXON': 'did that for us, and that was the first time that we had an automated budget. We got so good at the Council with it that the Mayor, Marion Barry, said, \"What are you guys doing? Can we get the same thing?\" I said, \"Absolutely. Talk to the COG.\" (Laughter.) Thank you, COG, for that many years ago.'",
        "'MR. BEAN': 'Well, thank you. Thank you, Mr. Dixon. I think our long-term staff members now that have retired the last few years remember -- oh, golly, what's the term about the paper cards that you flow through and have a mainframe computer? -- doing a model for the Region, and then, helping jurisdictions with that. If I could, just on that comment, particularly east of the river -- it connects back to a previous conversation about helping federal facilities, helping military facilities - -we are involved -- the acronym is MIRR, M-I-R- R, and I forget what it all stands for -- but the important word is \"resiliency.\" And it's resiliency of these federal facilities, these military bases, beyond their actual base. But how can it be more resilient as they work within the community? So, one aspect of resiliency is it's personnel being able to get there. So, that's transportation'",
        "'MR. BEAN': 'planning. In the District, Mr. Dixon, COG is working with Joint Base Anacostia- Bolling, also with McNair, and a couple of others. So, that might be another point of intersection and learning between NCPC and'",
        "'CHAIR WHITE': ' Well, thank you for that final comment on connection. And clearly, there are many more. And we want to continue the conversation. But thank you again so much for being here with us, and we look forward to continuing our work with you. And thank you to Ms. Koster for arranging the presentation. This was really fascinating. So, with that, this concludes our Open Session agenda. The Commission will meet again next months on Thursday, February 3rd, 2022, at 1:00 p.m. And if there is no other business, the Open Session is now adjourned, and I wish all of you a happy new year. Thank you.'"
    ]
}