{
    "1. AGENDA ADOPTED ": [
        "'nan': 'If there's no objection, the agenda as posted is adopted as the order of business. And now we will play a short video clip of the Pledge of Allegiance. (Pledge of Allegiance.)'",
        "'CHAIR WHITE': ' NCPC will continue to conduct its meetings online until renovations of the Commission chamber are complete. I want to share how we will be conducting Commission business. During Commission deliberations, I will use a round robin format to ask each Commissioner if they have any comments. As a reminder, during deliberations, all Commissioners should be on video at that time, unless you are experiencing technical difficulties. At other times when Commissioners wish to be recognized, they should ask to be recognized.'"
    ],
    "2. REPORT OF THE CHAIR ": [
        "'CHAIR WHITE': 'Next, Agenda Item 2 is the report of the Chair. And I am thrilled to announce that President Biden has appointed two new Commissioners, Bryan Green, representing the State of Virginia, and Elizabeth Hewlett, representing Maryland, are joining us today. I want to enthusiastically welcome you to the Commission. And Commissioner Green, it would be great if you would introduce yourself and share a bit about your background, and then I will ask Commissioner Hewlett to do the same. So, Commissioner Green, welcome.'",
        "'COMMISSIONER GREEN': ' Wonderful, thank you very much. It's a privilege to be here. I have so much respect for this institution and its contributions, and I'm very happy to be a part of it. I'm an architectural historian. I've spent my entire career working with historical buildings, either restoring, rehabilitating, or writing about them. And so this is a wonderful opportunity in maybe the greatest city in our country. So I thank you for the opportunity. And I know my predecessor, Preston Bryant, leaves some big shoes to fill, and I will do my very best. Thank you very much.'",
        "'CHAIR WHITE': ' Thank you so much. Commissioner Hewlett, would you like to provide some remarks?'",
        "'COMMISSIONER HEWLETT': ' I would indeed, thank you, Madam Chair. Like my new colleague, Commissioner Green, I'm very, very happy to be here, such a tremendous honor that I'm still filled with awe. I hail from New York City, but I've been a resident of Prince George's County, Maryland, for a little over 42 years and spent my whole professional career in Prince George's County. I am an attorney by trade and I recently retired from the Maryland-National Capital Park and Planning Commission, having chaired the Prince George's Planning Board for a total of 22 years. I've also been in private practice for many years and been very, very active in our community. And I'm just thrilled to be here and to join each and every one of you. Thank you.'",
        "'CHAIR WHITE': 'Well, thank you. We are all so delighted to have you both join us and add your incredible expertise and background to our work here at the Commission. Clearly you bring stellar planning and design experience and a deep understanding of the Capital Region. And I, and along with all of our Commissioners, look forward to working with you. I also want to take this opportunity to thank Commissioner Wendy Ginsberg for her contributions to the Commission, along with her colleague Collin Davenport, who have both represented the Chair of the House Committee on Oversight and Reform here on the Commission. And I also want to extent our thanks to Chair Carolyn Maloney. She has been an unfaltering advocate for establishing the National Women's Museum in the nation's capital. And for her continued interest and dedication to the region's vitality. We will miss working with you, Commissioner Ginsberg, but we'",
        "'CHAIR WHITE': 'wanted to thank you and your colleague for the tremendous work that you've done while you've been with us. So thank you so much, hope you stay in touch. I also wanted -- did you want to say a few words, Commissioner Ginsberg?'",
        "'COMMISSIONER GINSBERG': ' Just to say thank you. I've learned a lot. This is not my usual area of expertise and you guys have taught so much about what change management should look like, quite frankly, which not a lot of -- not all of government understands. So, thank you. You've been kind and thoughtful and funny, all the things I like very much. Thank you.'",
        "'CHAIR WHITE': ' Well, that's high praise. So, thank you on behalf of the Commission. I also wanted to report I had an opportunity to meet with National Park Service Director Charles Sams in November. We have regular meetings to discuss various initiatives that NCPC and NPS are working on together, and I wanted to share that with you.'"
    ],
    "3. REPORT OF THE EXECUTIVE DIRECTOR  ": [
        "'CHAIR WHITE': 'So Agenda Item 3 is the report of the Executive Director. Mr. Acosta.'",
        "'MR. ACOSTA': 'Well, thank you, Chair White, and happy holidays. First, on behalf of our staff I'd like to welcome Commissioner Green and Commissioner Hewlett to NCPC. We do look forward to working with you. And also special thanks to Commissioner Ginsberg. You've always been very helpful with your advice, and we will miss you on the Commission. On Wednesday, December 7, the Trust for the National Mall, the National Park Service, and NCPC will present a special exhibition preview of our Beyond Granite initiative at the Martin Luther King, Jr., Central Library. The event includes the announcement of six artists participating in the exhibition. More diverse and short-term approaches to commemoration will be explored on or near the National Mall and other locations. Secretary Koster sent Commission members invitations to this event. The program will also be publicly live-streamed, and information will be posted on our website. We also welcome Lori'",
        "'MR. ACOSTA': 'Abdin, our new Human Resources Specialist, who joins NCPC from the Administrative Office of the U.S. Courts. Lori also worked at the U.S. Department of Interior and the Woodrow Wilson International Center for Scholars. Unfortunately, Lori had a long-standing commitment and could not attend today's meeting, but we're glad that she is here. This concludes my report. You have my full report in your packets. I'm happy to answer any questions.'",
        "'CHAIR WHITE': ' Thank you, Mr. Acosta. Does the Commission have any questions for Mr. Acosta? Hearing none, I'd like to recognize that Commissioner Dixon has joined the meeting. Thank you, Commissioner Dixon. Agenda item four -- oh, sorry.'",
        "'COMMISSIONER DIXON': ' Good being with you.'",
        "'CHAIR WHITE': ' Great. I lost you on the screen for a second, I'm sorry.'"
    ],
    "4. LEGISLATIVE UPDATE ": [
        "'CHAIR WHITE': 'Agenda Item 4 is the legislative update. Ms. Schuyler.'",
        "'MS. SCHUYLER': 'Thank you, Chair White. I first thought there was not enough time to upload backgrounds, so I am showing you my office. First I'd like echo Executive Director Acosta's welcome to Commissioner Hewlett and Commissioner Green. We are all delighted to have you. It's been a long time since we had a full, seated Commission. Commissioner Ginsberg, we are sorry to see you go. And it is my hope and I'm sure that of others that our paths do cross again in the future. Thank you. I do have one congressional item which I'd like report. It's House of Representatives Bill 9268. This particular bill authorizes the location of a monument on the National Mall to commemorate and honor the women's suffrage movement and the passage of the Nineteenth Amendment to the Constitution. The bill was introduced on November 3rd, and it was referred to the House Committee on National'",
        "'MS. SCHUYLER': 'Resources. The bill specifies that the Women's Suffrage National Monument shall be located within the Reserve and that except for allowing the monument on the Reserve, all other provisions of the Commemorative Works Act shall apply. This concludes my report, and I'm happy to answer any questions.'",
        "'CHAIR WHITE': ' Thank you. Does the Commission have any questions for Ms. Schuyler? Hearing none, we'll move on.'"
    ],
    "5A. REVIEW OF FINAL SITE DEVELOPMENT PLANS FOR NATIONAL DESERT SHIELD AND DESERT STORM MEMORIAL": [
        "'CHAIR WHITE': 'There are no items on the consent calendar, so we will now begin our open session, starting with Agenda Item 5A, the review of final site development plans for the National Desert Shield and Desert Storm Memorial. And presenting today will be Ms. Free. Welcome, Ms. Free.'",
        "'MS. FREE': ' Hi, thank you. Can you see my screen?'",
        "'CHAIR WHITE': ' Yes, thank you.'",
        "'MS. FREE': 'Great. Well, good afternoon, Chair White and Commissioners. The National Park Service has submitted final site development plans for the National Desert Shield and Desert Storm Memorial, located at the southwest corner of 23rd Street and Constitution Avenue, Northwest, in Washington, D.C. Congress authorized the establishment of the memorial with Public Law 113-291. Through Public Law 115-18, Congress authorized the memorial to be located within Area 1, but not within the Reserve of the National Mall. The law also states that the Commemorative Works Act, or CWA, applies. The CWA is a federal law that guides the memorials process in Washington, D.C., and designates NCPC's approval authority over the site selection and design of the memorial. Today's review process -- or today's review focuses on the final design. The purpose of the final review is for the Commission to confirm the design details developed since the preliminary review and to'",
        "'MS. FREE': 'understand how the applicant has responded to the preliminary review comments. I will cover these topics in detail today and note that staff recommends approval of the final site development plans for the National Desert Shield and Desert Storm Memorial. With the comments today and also the comments received from the Commission of Fine Arts, the sponsor and the National Park Service will finalize documents and proceed with obtaining the required permits for construction. As a reminder, the memorial will be located near the intersection of Constitution Avenue and 23rd Street, Northwest, just north of Lincoln Memorial, outside of the Reserve. The Commission noted its support for the site, given its strong thematic connection to the Vietnam Veterans Memorial, proximity to other 20th century war memorials and nearby diplomatic agencies and organizations. The approximately one-acre memorial employs a landscape approach using sloped berms and tapered walls to enclose the memorial'",
        "'MS. FREE': 'and evoke the desert landscape. The memorial's clockwise circulation pattern serves as the primary organizer for the memorial's three commemorative elements: the storm wall, the inscription wall, and the Unity Shield, which represent service in the conflict, service and sacrifice, and service in the -- of the coalition, respectively. The clockwise pattern also recalls the left hook approach used by the U.S.-led armed forces to liberate Kuwait. The proposed design and materials are inspired by several characteristics of the war, including the unique environment and battle conditions of Kuwait, such as the dune formations and the oasis landscapes found in the desert. Overall, staff commends the memorial's landscape approach and thoughtful material selections that create a strong thematic framework and respect the surrounding context of the National Mall. At the preliminary review in March, the applicant presented a refined design that focused on the landscape elements and, per the Commission's'",
        "'MS. FREE': 'comments, eliminated statues that were previously considered in front of the inscription wall at the concept stage. During the preliminary review, the Commission requested more information about the memorial's wayfinding and signage, stormwater management, and strategies to deter unwanted activities, such as climbing. I will cover these topics in the latter half of this presentation. First I will discuss the final design of the commemorative elements. The details have events typical of design of development, and staff supports these refinements to the design, particularly the cinematic character and scale of the bas-relief on the storm wall, the hierarchy of writings on the inscription wall, and the natural character of the wreath, and the woven spiral pattern of the Unity Shield fountain and its sculpted perimeter. The primary commemorative elements include bas-relief carvings and raptors on the storm, the meaningful inscriptions, and a symbolic shield fountain. While the design has advanced'",
        "'MS. FREE': 'since the preliminary review stage, there are specific details, such as wall joint locations, font technologies, and the detailing of the bas-relief imagery that will be finalized as construction documents are completed. Therefore, staff notes the details of the commemorative elements, such as the depth and edge definition of the bas-relief, are still in progress and will be further refined prior to construction. The storm wall commemorates the service of the military in a cinematic progression from the buildup to the conflict and ultimately the liberation of Kuwait, framed by significant quotes 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 related to the conflict. The applicant continues to refine the cinematic character and scale of the bas-relief and study the various elements in different mediums, such as clay and plaster and granite. Specific techniques to show the'",
        "'MS. FREE': 'foreground objects that engage with the -- engage with and transition to the background are currently being tested. And methods for showing the relationship of equipment and hard edges are contrasted with how anatomy and clothing interacts with the background. As the end of the wall tapers, a mounted bald eagle and falcon sculptures symbolize the leadership of the United States in the liberation of Kuwait. Live falcons and eagles are being studied and measured to understand feather layout, how feathers overlap, and claw details. Physical models of the raptors are being developed, and they're checked against live falcons and eagles and then refined further. Inscription Wall in the preliminary plan proposed the name of the operations and a wreath at the top of the wall and the phrase to honor the service below with the names of the ten significant battles at the bottom. The hierarchy of the inscriptions'",
        "'MS. FREE': 'is revised in the final plans. \"To honor the service and sacrifice\" is now the heading of the wall and is supplemented by linked wreaths symbolizing the fallen. The official names of the operations and ten significant battle names are, respectively, organized around and listed below the wreaths. The inscriptions are two to five inches in size for easy readability by visitors who are standing or sitting. Abstract versions of the wreaths which include perfect leaf symmetry were first explored. The wreath design now has a more natural look that depicts leaf variation, texture, and berries. The more organic look of these wreaths reflects the realness of the service and the sacrifice. As seen during the preliminary review, the memorial's centerpiece is the Unity Shield and bronze cascading water feature situated within an open plaza under a grove of trees referred to as the Coalition Grove. The water feature is'",
        "'MS. FREE': 'designed as the circular battle shield, with the names of 35 countries cast in bronze around the edge to commemorate the service of the international coalition that acted together to liberate Kuwait. The final plans include additional detail on the design of the shield. The shield's pattern draws inspiration from Kuwait's cultural and natural history. The spiraling texture reflects the geometric patterning of Kuwaiti basket-weaving. At the shield's center, the spiral converges to a radial pattern, symbolizing the national flower of Kuwait. (Audio interference) bronze with the names of the 35 countries cast -- cast also in bronze protruding outward. When the water is turned off, the country names will read as part of the Unity Shield. The shield's texture and sequence of stepped rings creates a thin cascade of water with varying intensity over the surface of the shield. The shield's sculpted perimeter will divide the water into multiple'",
        "'MS. FREE': 'individual spouts. And the flow of the individual streams of water into a single collective pool below -- below the edge will create a sound and activate the pool basin. Water cascading down the shield's texture will have a lively and engaging effect when the water is turned on. When the water is turned off, the shield's subtle patterns will be more pronounced. It is anticipated that the water will be turned off up to six months out of the year. I will now briefly discuss the proposed materials. As mentioned earlier, the memorial evokes the desert landscape of Kuwait. This is also true of the materials, and staff finds the proposed wall, paving, and plant materials support the memorial's overarching concept and commemorative theme. A wide range of materials varying in color in texture were explored for the memorial's dune walls. The main dune walls, planter walls, and approximately'",
        "'MS. FREE': '40% of the memorial's paving will be composed of the selected stone, Gialla Antico, which is outlined here on the slide in orange. The selected stone was tested under dry, partially wet, and fully wet conditions to understand how the color of the stone changes under varying conditions. Through all conditions, the selected material retains the soft, peppery texture that is evocative of the Kuwaiti desert. The selected stone was also tested under full sun, full shade, canopy trees, and ground covers with fine textures, and also vertically to understand how the color of the stone varies depending on its orientation. With regard to paving, the proposed curving is intended to be evocative of the swirling desert sand. The paving pattern generates a subconscious flow, bringing visitors into the center of the memorial. The low contrast palette is subtle and creates a dynamic pattern the reinforces the energy and texture'",
        "'MS. FREE': 'of the swirling desert and left hook movement. The memorial's muted lighting is intended to be respectful of its context within the National Mall and the proximity to the Lincoln Memorial. The dune walls will be gently washed with light by discreet poles integrated into the many dunes. Accent lighting will help emphasize the memorial's commemorative elements. And the linear lighting will softly illuminate the flow of the memorial's left hook and the sculpted -- sculptural forms of the walls. The planting plan will reflect the memorial's dune land forms. Along the left hook progression of the memorial's interior the mini-dunes planting palette will transition from dark tones to yellow tones. The mini-dune plantings will consist of a series of textures that are geometric and desert-like. All plants are native or adapted to this region and also support a pollinator habitat. And staff notes that the applicant is working to'",
        "'MS. FREE': 'simplify the planting palette and incorporate milkweed species. A grove of seven yellowwood trees are proposed to emphasize the left hook movement, anchor the Coalition Grove, and provide shade for visitors. The tree's elegant form, upright branching, and leaf texture provides a dappled-light quality and allows for seating beneath. The project will remove approximately five understory trees, which will be replaced by the new yellowwood trees. In addition, the applicant proposes new trees around the memorial, including replacement of four declining elm trees along Constitution Avenue and 23rd Street, and new trees adjacent to the Lincoln Memorial consistent with the Lincoln Memorial's cultural landscape plan. A low-mow Carex grass on the outside of the dunes will provide visual compatibility with the surrounding long panels of the Mall, while also reinforcing the land forms and avoiding the need for regular maintenance. The Carex grass is also intended to deter pedestrian and'",
        "'MS. FREE': 'recreational activity. The drainage swales at the base of the berms will also help to discourage such uses. And staff finds the landscape approach with low-growing ornamental grass planted on the memorial berms is a thoughtful solution to deter climbing and other unwanted activities without the use of physical barriers. The final plans also include a wayfinding and signage strategy to direct visitors to the memorial primarily from the north and the west. The name of the memorial will be inscribed in a decorative curve that faces the intersection of the 23rd Street and Constitution Avenue, and a large directional pylon will also be placed near the intersection. Smaller pylons will be located near the entry and exit points. Both the large and small pylons will be the standard National Park Service pylons for the National Mall. And overall, staff finds the amount of signage and the sign locations appropriate'",
        "'MS. FREE': 'and effective for directing visitors to the memorial's entrance. In addition to directional signage, signage within the memorial will include a tactile representation of the memorial for visitors with visual impairment and a donor recognition plaque. The proposed donor sign is a rectangular plaque that will mounted independently of the memorial, about eight inches above the soil level. NPS has indicated that the donor sign will meet the criteria of the CWA, which includes displaying the signage for a period of up to ten years. And therefore staff finds that the proposed donor signage is consistent with the memorial's design and the Commemorative Works Act. The memorial's stormwater management approach includes collecting stormwater runoff through underground detention basins. Slot drains in the memorial's plaza and swales on the back side of the outer dunes will guide runoff into the basins. The collected runoff will then be used to irrigate the'",
        "'MS. FREE': 'memorial to meet DOEE's volume reduction requirement. The memorial site is located within the 500-year flood plain, and as a result the memorial is designed to be flood-resilient and to not have an impact on the flood plain. Further, the memorial's grading and location will not be affected by a potential future expansion of the Potomac Park Levee. And this concludes my presentation. The Executive Director's recommendations are listed here and have also been incorporated into my presentation. Myself, Skip Graffam with the landscape architecture team Olin, Alan Harwood with AECOM, and Scott Stump, the President and CEO of the Memorial Association are all available for your questions. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Ms. Free. Do the Commissioners have any questions?'",
        "'COMMISSIONER WRIGHT': 'I do. It's for Skip, if you're there. I have questions about the Carex grass. I am not a landscape architect. Does -- will it go brown at any time during the year? I'm following up on my comment from last time when I was nagging about the possibility of the berms sort of losing their symbolic content or their, some of their -- the illusion factor to the dunes. For those of us who have never been to Kuwait and -- or, well, on the way to Palm Springs is the closest I've ever been to a legit desert. But I think it has to be sort of quite literal for people to get it, and I'm still worried that it's -- the planting palette may be too green. And I get that the milkweed will probably mitigate some of that, but can you educate me about the Carex'",
        "'COMMISSIONER WRIGHT': 'grass?'",
        "'MR. GRAFFAM': 'Certainly. So, as you know, through the process we've been trying to be the good steward of the larger National Mall experience. And so the view from outside was seen as a landscape approach, the berms and the -- whatever the planting would be would be an extension of the, essentially the turf that you might see. So we did not want to make a dramatic change from green grass to something completely different. So the Carex was an idea that it is a challenge to walk through. It's pretty thick, it lays over. One of the reasons why we liked it was it actually will react to wind. And so the idea of seeing the rippling of the larger grass as it lays over gives somewhat of an impression of the wind patterns on the back of the dune form. It's meant to be lower in maintenance, so the'",
        "'MR. GRAFFAM': 'idea it's not something you would have people mowing it every week, which could be distracting as a kind of memorial environment. So we wanted to have kind of a once-a-year or twice-a-year mow-down and, you know, and kind of reassessment. So it's meant to be essentially that's not -- doesn't have to be fussed with, other than maybe removing litter, you know, on a weekly basis. So it will not go brown, but it will definitely kind of lose some of its color when it -- when it gets dry. But it's not a -- it doesn't go like Bermuda grass or something like that.'",
        "'COMMISSIONER WRIGHT': ' Yeah. So when you're -- so when you're -- I get -- you already answered my next question, which was will it respond to wind. So that's good. My next question is inside, when you're standing inside the memorial, is there more of a brown palette that you see while you're -- while you're standing next to the shield or somewhere inside the hook?'",
        "'MR. GRAFFAM': 'Yeah, so the idea was that the plants inside will definitely respond. Some will go brown in the winter. In addition, we are assuming that the ground, essentially the ground material, rather than being mulch will actually be crushed up granite to match the wall. So the idea is as you might see it in a desert setting growing out of kind of rocks or sand, the idea of essentially the texture as you look between the plants would match that kind of sand color. And the plants were really, again, we were, you know, we're not really going to push a lot of non-native species. So we're somewhat trying to create the idea of the more interesting sculptural forms that you might get in a desert setting. So we're trying to kind of imply without necessarily introducing a lot of non-native or invasive species. So there will definitely be'",
        "'MR. GRAFFAM': 'a rougher kind of more spiky, angular texture to the planting. It will, some of it will go brown in the winter, and then there's that larger base of kind of the granite aggregate, if you will, the forms the base of the two mini-dune planters.'",
        "'COMMISSIONER WRIGHT': ' Okay, last question.'",
        "'MR. GRAFFAM': ' Okay, does that -- hope that answered that.'",
        "'COMMISSIONER WRIGHT': ' Yes, it does, yeah, it does. I figured you thought of it, but I just wanted to make sure. And then the last question I have is probably for one of the sponsors, if Scott's here. And that is so there's -- there's a lot of conversation or has been all along, I mean, one of the -- well, I guess it's the parti, almost, of the left hook. But again, I'm not sure if -- is there an allusion to the left hook in the text somewhere in the memorial?'",
        "'MR. STUMP': ' Commissioner Wright, this is Scott.'",
        "'COMMISSIONER WRIGHT': ' Hi.'",
        "'MR. STUMP': ' Hey. I don't believe there is any direct reference to it. It's more of an implied. And the circulation pattern was specifically designed and evolved, you know, through that number of years to evoke that left hook movement, the sweeping through, you know, the actual visitor experience is how that's kind of implied. And Skip, if I'm leaving something out, you're the technician and I'm not, I'd be happy to turn it over --'",
        "'COMMISSIONER WRIGHT': ' No, I was -- I mean, I think the physical symbolism and iconography's very clear. But again, there are going to be lots of people who aren't all that --aren't that familiar with it. And if there's supplemental material on the web or you know, wherever you're going to have your interpretation, I don't think it's bad idea to make an overt reference to it. Because a lot of people, myself included before we -- I can't remember how long we've been looking at this, but it's been many years. And I remember learning that for the first time in the context of this memorial. So I hope it's referenced somewhere.'",
        "'MR. STUMP': ' Yes, ma'am. Yes, in fact we're working right now with how we deliver that message through technology, whether it be a physical kiosk on site, QR codes, which would have the supplemental information. Because the one thing that I always remember NCMAC, CFA was real strong about this. They kept saying this can't be a museum because, you know, at the initial stages of this many, many years ago, you know, my natural tendency, our team's natural tendency was to get all of this information out there. You can't do that within the memorial itself. It has to have the supplemental educational component, which is exactly what we're working. And yes, ma'am, it's a very important part of the story from the ground perspective that needs to be, you know, put out there educationally.'",
        "'COMMISSIONER WRIGHT': ' Okay, that's it, thank you.'",
        "'MR. STUMP': ' Thank you.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Wright. Are there other questions? Commissioner May.'",
        "'COMMISSIONER MAY': ' Madam Chair, I understand that Mr. Stump actually wanted to make some comments. This is a late-breaking development, but I'm wondering --'",
        "'CHAIR WHITE': ' Oh, that would be wonderful. Mr. Stump, please, we would love to hear from you.'",
        "'MR. STUMP': ' Thank you, Madam Chair. You're too kind. And I was told from the onset to limit this, I promise, 45 minutes is the most that I will -- that my comments will take.'",
        "'CHAIR WHITE': ' I might have to pull out a gavel, Mr. Stump.'",
        "'MR. STUMP': 'Wow, yeah, you might want to do that now. I just wanted to take a moment, as Commissioner Wright indicated, this has been a very long process. As a memorial sponsor, you never really know what you're getting into until you're already in it and you can't get out. But it has been very, very long, and I just wanted to thank you, Madam Chairman, as well as the Commissioners, the staff for your collaboration, for your input through the years. I know beyond a shadow of a doubt the end product will reflect that. You have made a difference. We have sincerely and honestly listened to you and incorporated those things that we can into this memorial. So thank you for the honor. It's been an honor for me. And on behalf of myself and our organization, I wanted to thank all of you. And I also would like'",
        "'MR. STUMP': 'to, you know, to give a big thanks to Mr. Matt Flis and Stephanie Free. Your thoroughness and your professionalism in presenting our project is greatly appreciated. You guys have done just a phenomenal job, and we greatly appreciate it. And it's been an honor working with all of you and the previous Commissioners who are no longer part of that. I guess that's one way you know that you've been at it a long time is when you start seeing new faces and your old one is still around, mine. And I'll -- so that tells you we've been at it a little bit of time. But thank you again, it really has been an honor.'",
        "'CHAIR WHITE': ' Thank you, Mr. Stump. And I particularly appreciate you calling out our very talented staff. Mr. Flis and Ms. Free have done a great job, and we appreciate the collaboration. I'll now open it up to the Commission for discussion. If everyone could turn on your cameras. I will start with Commissioner Dixon, and then go in a round robin format using our normal seating order. So please keep your webcams on for the discussion. And now we'll hear from Commissioner Dixon.'",
        "'COMMISSIONER DIXON': ' First of all, I appreciate the staff's work, as always. And I'm very pleased with where we are. I have nothing really to add at this time. Thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis.'",
        "'COMMISSIONER DAVIS': ' Yeah, thanks so much for the presentation. I don't have anything else to add as well.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Ginsberg.'",
        "'COMMISSIONER GINSBERG': ' I just Googled Bermuda grass. But other than that, I don't have any questions.'",
        "'CHAIR WHITE': ' We learn something new every day, Commissioner Ginsberg. Commissioner Cozart.'",
        "'COMMISSIONER COZART': ' Just kudos to the staff for their presentations. No questions or additional comments.'",
        "'CHAIR WHITE': ' Thank you. Commissioner McMahon. You're on mute, Commissioner.'",
        "'COMMISSIONER MCMAHON': ' No, no, not me. Appreciate the presentation from the staff and the work of the applicant to get this thing to a place where we're ready it looks like to actually start working on it. And I have no other comments.'",
        "'CHAIR WHITE': ' Thank you. Commissioner May.'",
        "'COMMISSIONER MAY': 'Well, I would just take a couple of minutes. Well, maybe not a couple minutes, maybe a minute to first of all to thank the staff and the Commission for all of their work on this memorial. So many of these memorials are such a long process and a difficult process to get to a point like this where we're getting the final approval that is a key component for us to give permission to start construction. And I mean, there are some other, you know, there are some loose ends to be tied up. There are -- but unfortunately some of the biggest loose ends that sometimes happen at this point, such as having full funding to start construction, has already been cleared. So we expect that, you know, once those other loose ends are done and the construction documents are done that we'll be able to issue a'",
        "'COMMISSIONER MAY': 'permit and we'll be able to get under construction. Sometimes memorials, you know, even after they go through a five, ten, 15-year process to get to this point, they still have to take extra time to get through the funding hurdles. And I think it's actually pretty remarkable that this memorial, which has had so many sort of, you know, one step forward, two steps back, or two steps forward, one step back throughout its process, that they've reached this point or they have full funding. That they really have a, I think a superior design. It's going to be beautiful memorial. And I think this whole commission should take some credit for that. I think also the design team has done an exceptional job to get it to this point. And I think that the last person who deserves gratitude for this is Scott Stump, who has been the'",
        "'COMMISSIONER MAY': 'champion all the way through, through many, many difficult times and has, you know, kept his nose to the grindstone and has worked through all of these challenges. And I mean, this commission knows all the sort of the twists and turns and site selection and design, but there's a lot more to it than that. And he has worked through all of that, and it's a testament to him that we are here today. So thank you.'",
        "'CHAIR WHITE': ' Thank you, Commissioner May. Commissioner Argo. You're on mute, Commissioner Argo.'",
        "'COMMISSIONER ARGO': ' Oh, that would be good to turn on my mic. I'm delighted to see where we are on all of this. I appreciate in particular also hearing that there will be -- and it would be interesting to hear more about this at some point, not necessarily a presentation to the Commission, but what the supplemental educational component will be that was mentioned in the discussion. So that, you know, the people that are sharing the experience of this memorial have, you know, have something tangible to, from an educational standpoint that accompanies it, other than just a few words on a plaque. I guess that's my only comment. And it's great to see that we're at this point and this can move forward. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Argo. I'm sure Mr. Stump would be happy to keep us informed about the future and the education components will be quite interesting. Commissioner Hewlett.'",
        "'COMMISSIONER HEWLETT': 'Thank you, Madam Chair. I haven't been around long enough to see all that you went through to bring this to fruition or almost to fruition, this design. But I have to tell you, I'm already awed by the majesty of it. It's just -- it's just beautiful. And I'm awed by the level of detail, from the measuring of the wings to make sure it's appropriate and true to life and the combat wall, and the testing of the granite to make sure -- to test it in the sunlight and the rain. Every bit to detail that went into this, no wonder it's coming out to be so beautiful. So I too would like to thank Ms. Free and the entire team, and of course Mr. Stump, for your work. Even though I didn't see it step by step by step, I sure see a magnificent design now.'",
        "'COMMISSIONER HEWLETT': 'Thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Green.'",
        "'COMMISSIONER GREEN': ' Thank you. Just wanted to thank the applicant, the design team staff and my fellow Commissioners for all their hard work. It's a terrific result. Thank you for your patience and hard work.'",
        "'CHAIR WHITE': 'Thank you. Well, I would just like to say in closing, Mr. Stump, as President of the Memorial Association, you have worked tirelessly to advance this project. You must be very proud of this design, you know, I want to commend you and the Association and your design team for creating what will be a very beautiful addition to the commemorative landscape in Washington. And I appreciate Commissioner Hewlett's word about the majesty, it really does capture what you intended to do. So congratulations. I think the landscape-oriented approach in the sculptural elements really speak to the themes of service, and particularly of unity, which is something that we need to think about in a very important way these days. So I just want to thank you again for your effort. And with that, if there are no further comments or questions from the Commission, is there a motion to'",
        "'CHAIR WHITE': 'approve the final site development plans for the Desert Shield and Desert Storm Memorial?'",
        "'COMMISSIONER WRIGHT': ' Madam Chair, you skipped me.'",
        "'CHAIR WHITE': ' Oh, my goodness. How did I do that, Commissioner Wright? I am so sorry. I check off my little boxes.'",
        "'COMMISSIONER WRIGHT': ' Well, it's because the seating -- the seating arrangement is new.'",
        "'CHAIR WHITE': ' It's true, and I am eager to hear from you.'",
        "'COMMISSIONER WRIGHT': ' Well, I did want to say something --'",
        "'CHAIR WHITE': ' So involved --'",
        "'COMMISSIONER WRIGHT': 'Because I've been a little -- I've been, at times, hard on the applicant. And I'm so glad we have this process. I mean, we are applicants, often, and it can be so painful. So I'm extremely empathetic. But I think this memorial really is standout as an example of why going through this design review gauntlet is worth all of the pain. I mean, it's not always the case where it's better --it's a better result because both parties are not iterating on the same wave -- on the same wavelength. Of particular note in this design, I think, which is so much better than it was and it's such a central component of the memorial is the shield. And I've been -- I think about it now, you know, if you think about, I think as we are intended to do, we think about the Mall as a'",
        "'COMMISSIONER WRIGHT': 'composition. It's -- this memorial has -- it has notes of the Jefferson Memorial. I mean, in the geometry of the shield, there are -- there are little grace notes of similar geometry throughout the Mall. And I never really thought about that before until we saw it this last time. It's been extremely responsive to criticism. There is --there are -- I can't help myself, I'm an art historian by training. And so, you know, they always put us through the compare and contrast drill. And if you -- if you think about it in those terms, it makes -- it's a beautiful addition to the composition. You know, for all of the guff that the Vietnam Memorial took for being, you know, a gash in the landscape and a discordant note and unlike anything else, and now has come to be so emblematic of the entire composition of'",
        "'COMMISSIONER WRIGHT': 'the Reserve, this memorial isn't -- is making a really important addition. Not by contrast, but by coalescing around some themes that we -- that we see all over the Mall. But not being repetitive and redundant. And that is not easy to do. So I just want to congratulate you, Mr. Stump. You have hung in there with your design team, who has expertly guided you. And you should be quite proud.'",
        "'MR. STUMP': ' Thank you, Commissioner Wright. Yeah, we have just, you know, working with Skip, Randy Schumacher, you know, the artist, we just -- we just have some very extremely talented people on this team. They have worked and honed this design throughout the process and they have been extremely collaborative and set aside their personal preferences for the good of the overall project. And that's why I think we're where we are today, one of the main reasons.'",
        "'CHAIR WHITE': ' Commissioner Wright, to make up for my faux pas, would you like to offer the motion?'",
        "'COMMISSIONER WRIGHT': ' Sorry, mute. Yes. Saying now that I'm muted. Am I muted?'",
        "'CHAIR WHITE': ' No, you're unmuted.'",
        "'COMMISSIONER WRIGHT': ' No, okay, yes, I would like to make a motion to approve the final design.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Wright. Is there a second? Did I hear Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'CHAIR WHITE': ' Thank you, Commissioner May. Ms. Koster, can you please confirm the motion and the second and take the vote by roll call.'",
        "'MS. KOSTER': ' Certainly. The motion was made by Commissioner Wright and seconded by Commissioner May. And with that, Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' And Commissioner Ginsberg?'",
        "'COMMISSIONER GINSBERG': ' Yes.'",
        "'CHAIR WHITE': ' Thank you, the motion has carried.'"
    ],
    "5B. APPROVAL OF COMMENTS ON DRAFT MASTER PLAN FOR ROWLEY TRAINING CENTER ": [
        "'CHAIR WHITE': 'So next we will move to Agenda Item 5B, which is calling for the approval of comments on the draft master plan for the Rowley Training Center. Today we will be hearing from Ms. Herr. Welcome.'",
        "'MS. HERR': 'Thank you. Good afternoon, Chair White and members of the Commission. The U.S. Secret Service has submitted their 2022 James J. Rowley Federal Training Center draft master plan for the Commission's review and comment. The Commission previously approved the master plan amendment in 2017 for the addition of the Defense Tactical Facility. The goals of the proposed master plan include improving the operational environment and training mission, consolidating facilities, and improving the functional -- improving the functional campus. The Rowley Training Center, or RTC, is a 439-acre campus in Prince George's County, Maryland, that serves primarily as the training facility for new and existing Secret Service employees. There are currently just over 351,000 square feet of facilities. That includes 11 training venues, interior and exterior firing ranges, 21 classrooms, and 1145 parking spaces spread throughout the campus. The secure mission of the campus means that the information that can be'",
        "'MS. HERR': 'shared is limited. The focus of the proposed master plan is to consolidate many uses in new facilities clustered in the central area noted here. The proposed construction includes new ranges, training venues, physical training, and tactical training. The proposed consolidation of uses into a walkable central area will allow staff and students to more easily access the campus on foot. The staff and students will be encouraged to park in one location or take a shuttle and walk to the different destinations on the campus. The proposed master plan pictured here shows the new facilities that will be constructed at the central area of the campus, in the reddish color. The new facilities will include shared green spaces and walking paths connecting the buildings. The applicant is proposing to relocate some uses from the western edge of the campus to the central area, such as high-noise firing ranges, and'",
        "'MS. HERR': 'reinforce the area as an additional buffer. New facilities are also planned in the eastern area of the campus, including new tactical training facilities and an expanded vehicle training area. Overall, the Secret Service is proposing to obtain 111,296 square feet, renovate the 52,696 square feet, and add over 75 -- 754,000 square feet of new facilities, including the previously approved Defense Tactical Facility. This will increase the classrooms to 45 and the training venues to 15. The approved Defense Tactical Facility will impact existing wetlands, and the applicant will need to continue to work with the local and state agencies on mitigation plans. The applicant will also need to ensure that the long-term plans can meet the NCPC tree preservation policy. The design of the central area proposes to use the construction of buildings to create new green spaces with clear walking connections, as seen here in this enlargement.'",
        "'MS. HERR': 'The applicant is also proposing a new redesigned main campus entry that will allow greater space for visitors and deliveries and reduce the impact on local roadways. With over 754,000 square feet of new facilities, the long-term population of the campus will increase from 722 to 1095. In addition, the master plan proposes to reduce the number of parking spaces on the campus from 1145 to 751. This will be accomplished by constructing new facilities on existing parking areas, limiting the addition of new parking, and eliminating ad hoc parking across the campus. Again, staff and students will be encouraged to park once and walk to all facilities on the campus. The applicant is also proposing the use of a shuttle for students not stationed locally to reduce private vehicle parking. These changes will result in a parking of one to two, or one space for every two staff and'",
        "'MS. HERR': 'students, meeting the federal Comprehensive Plan parking goal for this location. The proposed master plan includes visual preference results and design guidelines intended to create a cohesive campus design, especially given the clustered nature of the new construction. The design guidelines use some existing facilities as the design inspiration to insert -- ensure future buildings are coordinated. The consolidation of uses into a walkable central area that will allow staff and students to more easily access the campus on foot is a positive change, and staff recommend the Commission supports the James J. Rowley Training Center draft master plan, which envisions the campus, located in Prince George's County, Maryland, as a walkable campus with centralized training facilities. I will not read the additional recommendations as I have covered them generally in the presentation. They are included here for your reference. This concludes my presentation. I'm available to answer any questions'",
        "'MS. HERR': 'you may have. And Kibby Powell from the Secret Service and Paul Loomis from the Urban Collaborative are here to answer any additional questions as well. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Ms. Herr. Do Commissioners have any questions?'",
        "'COMMISSIONER DIXON': ' I do, Madam Chair.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon.'",
        "'COMMISSIONER DIXON': ' I'm just wondering whether any sustainable energy like solar will be used in this project.'",
        "'MS. FREE': ' I can answer that. The applicant has indicated in the master plan that they intend for new buildings to meet LEED Silver constructions standards. And we have a recommendation that they consider specifically adding solar to the roof of all new buildings.'",
        "'COMMISSIONER DIXON': ' Thank you very much.'",
        "'MS. LOOMIS': ' We're following the guiding principles as well.'",
        "'CHAIR WHITE': ' Thank you. Any other questions? Hearing none, I will now open to the Commission for discussion. If everyone could please turn on your cameras, I will start with Commissioner Cozart and then go in a round robin format using our normal seating order. So please keep your webcams on during the discussion. And now, Commissioner Cozart.'",
        "'COMMISSIONER COZART': ' Thank you, Chair White. Just my thanks to the staff for their presentation. And I don't have any additional questions.'",
        "'CHAIR WHITE': ' Thank you. Commissioner McMahon.'",
        "'COMMISSIONER MCMAHON': 'And I'm not on mute. Thanks, staff, for a presentation, thanks for the work. A fairly aggressive, I guess, and needed expansion of capacity up there at the training center, especially Secret Service. Two things, the first of which is what looks to be, just look at the map and looking at some of the other projects we've discussed up at BW Parkway in recent history, the challenge of being able to implement their commitment to get to a one to two parking ratio. Certainly, shuttle vans for bringing students in who don't live in the area is going to be a key part of that. So it will be interesting observing and seeing what lessons learned in the years that we can glean, the rest of us in the federal environment, from what the Secret Service learns up there. In addition to solar power, photovoltaic cells on rooftops, I'",
        "'COMMISSIONER MCMAHON': 'see a large parking area, so there's another opportunity there just to continue to reduce their carbon footprint while they build out this new facility. That's all I've got, thanks.'",
        "'CHAIR WHITE': ' Thank you, Commissioner McMahon. Commissioner May.'",
        "'COMMISSIONER MAY': 'Yeah, I think this master plan is pretty remarkable in a couple key ways. The Secret Service is doing all of the moves that I think that the staff would have been recommending to them all along. Maybe the staff helped push them in the right direction, maybe it was -- came in the door this way. In any case, the result is that they are trying to create a campus that encourages walking rather than driving around. And they are trying to meet greater parking -- or meet the parking objectives that we would normally apply in the circumstances without us having to get into a contentious discussion here at the Commission about how important that is. That's always a good thing. And I think that, you know, we will I'm sure see more in the way of sustainable features as the master plan is developed and as individual'",
        "'COMMISSIONER MAY': 'building plans are developed. And certainly some of it's sort of a no-brainer. Like the suggestion that there be -- that came from Commissioner McMahon about incorporating solar into the large parking lots which will still have to be there. I imagine there are -- there's more that can be done to make it an ever better project, and I expect the staff will keep pushing at. And I would also say that, boy, saying that the project, everything is going to meet LEED Silver, I mean, my reaction to that is like wow, isn't that quaint. Because it's -- that is not the standard, right? I mean, LEED is the minimum, that's the basement of sustainability. You have to be thinking in terms of Gold and above. And I just -- I'm sure that the staff will be pushing further in that direction, and hopefully we will see bigger'",
        "'COMMISSIONER MAY': 'sustainability aspirations in the future. So, thank you very much.'",
        "'CHAIR WHITE': ' Thank you, Commissioner May. Appreciate those high standards. Commissioner Argo.'",
        "'COMMISSIONER ARGO': ' Yeah, I was going to say I think that Commissioner May has put out there'",
        "'CHAIR WHITE': ' Run down the gauntlet.'",
        "'COMMISSIONER ARGO': ' Something to remind other applicants to, you know, kind of what the --what the standards are and when you are bragging about them at what level you start bragging about them. Very important. I think the overall -- I don't need to say anything more than that the overall attention to the sustainable features is I think impressive. There can always be more. But appreciate the work behind this and happy we've gotten to this point. And we can get some of these cars off the road and get that -- get it constructed. I appreciate the work that's -- all the work that's behind this project. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Argo. Commissioner Hewlett.'",
        "'COMMISSIONER HEWLETT': ' Yes, thank you. I appreciate the opportunity to speak. I would just say I agree to some extent with Commissioner May about the LEED standard. And I would also like to say that -- to reinforce what Ms. Herr said. Thank you very much, Ms. Herr, for your presentation, by the way. But to reinforce what you've said and what the Maryland-National Capital Park and Planning Commission said about working with the local jurisdictions as well. That's pretty important. And the electrical charging stations for the cars that you do have. Thank you.'",
        "'CHAIR WHITE': ' Great, thank you. Commissioner Green.'",
        "'COMMISSIONER GREEN': ' No comments at this time, thank you.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I don't have anything more to add. I was going to -- I was going to sort of hone in on the Silver thing too. I hadn't thought of the word quaint, though. I like it though. I'm not even sure there should be a Silver standard anymore, it seems kind of obsolete. But yeah, I mean, keep on trucking, because it's probably not quite green enough for 2022.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' No comment.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' I also have --thanks.'",
        "'CHAIR WHITE': ' And Commissioner Ginsberg?'",
        "'COMMISSIONER GINSBERG': ' No additional comments or concerns, thank you.'",
        "'CHAIR WHITE': ' Well, thank you. Well, I'd like to thank DHS for working so collaboratively with our staff on this draft master plan. And I agree with the previous comments and do really appreciate the focus on walkability that's built into the site plan and the steps you're taking to reduce single occupancy vehicles commuting to the staff -- to the site. So all of these improvements will lead to a much better campus and experience for the students, and we look forward to seeing the additional details at final review as we hold up these very high standards for making it even better. So are there any further comments or questions on this project? Hearing none, is there a motion to approve the comments on the draft master plan for the Rowley Training Center?'",
        "'COMMISSIONER MAY': ' So moved.'",
        "'COMMISSIONER HEWLETT': ' I second, Hewlett.'",
        "'CHAIR WHITE': ' I think that was Commissioner May who moved it, and Commissioner Hewlett seconded. Ms. Koster, can you please confirm the motion and the second and take the vote by roll call.'",
        "'MS. KOSTER': ' Certainly. The motion was made by Commissioner May, the second was offered by Commissioner Hewlett. And with that, Commissioner Cozart.'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon.'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner May.'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo.'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett.'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair White.'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green.'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Wright.'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon.'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Davis.'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' Okay, and Commissioner Ginsberg.'",
        "'COMMISSIONER GINSBERG': ' Yes.'",
        "'CHAIR WHITE': ' Thank you, the motion has carried.'",
        "'CHAIR WHITE': ' Well, this concludes our open session agenda. And I would like to again welcome our new Commissioners, Hewlett and Green. You joined us for a very celebratory meeting on these two great projects, so.'",
        "'COMMISSIONER WRIGHT': ' And a short one, wow, this has got to be a record.'",
        "'CHAIR WHITE': ' I think it is a record.'",
        "'COMMISSIONER WRIGHT': ' Not typical.'",
        "'COMMISSIONER MAY': ' Yeah, don't get spoiled. This is not the way it goes. Neal R. Gross and Co., Inc. (202) 234-4433 Washington DC www.nealrgross.com 70 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18'",
        "'CHAIR WHITE': ' Well, these were two wonderful projects to end the year on. And our next regular Commission meeting will be on Thursday, January 5, 2023 at one p.m. And I'd like to take this opportunity to wish everyone a safe, peaceful, and joyous holiday season. And rest up for next year. There's a lot of work coming our way. And I hope everyone can participate on December 7 for the Beyond Granite kickoff. I think it's going to be really exciting, and it's such an important initiative that I think will benefit from all of the Commissioners' input. So, again, if there's no other business to come before us today, this session is now adjourned.'"
    ]
}