{
    "1. COMMISSION ROLL CALL": [
        "'MS. KOSTER': ' Sure. Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Here.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' I'm here.'",
        "'MS. KOSTER': ' Commissioner May? Commissioner May?'",
        "'COMMISSIONER MAY': ' Here. Sorry about that.'",
        "'MS. KOSTER': ' That's okay. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Here.'",
        "'MS. KOSTER': ' Thank you. Chair White?'",
        "'CHAIR WHITE': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Present.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Here.'",
        "'MS. KOSTER': ' And Commissioner Ginsberg?'",
        "'COMMISSIONER GINSBERG': ' Here.'",
        "'MS. KOSTER': ' Thank you. Marcel Acosta, the Executive Director; Anne Schuyler, the General Counsel; and Diane Sullivan, the Director of the Urban Design and Plan Review Division are also in the meeting.'",
        "'CHAIR WHITE': ' Thank you. Noting the presence of a quorum, I'd like to call this meeting to order. Today's meeting is live-streamed and will be available in a few days as a video on NCPC's website. If there is no objection, the updated agenda as posted is adopted as the order of business. And at this time, we will play a short video clip of the Pledge of Allegiance. (Pledge of Allegiance.)'",
        "'CHAIR WHITE': ' In response to the COVID-19 guidance on public gatherings, NCPC will conduct its meetings online until circumstances change. I want to share how we will be conducting Commission business. When Commissioners wish to be recognized, they should unmute and request to be recognized. During Commission deliberations, I will use a round-robin to ask each Commissioner if they have any comments. During deliberations, all Commissioners should be on video during that time unless you are experiencing technical issues.'"
    ],
    "2. REPORT OF THE CHAIR": [
        "'CHAIR WHITE': 'Next is Agenda Item 2, a Report of the Chair. We have a very full agenda today, so I will keep my remarks brief. I do have one item to report. Pursuant to the delegations of authority adopted by the Commission, I approve the transfer of administrative jurisdiction for Tract B in Anacostia Park from the National Park Service to the U.S. Army Corps of Engineers.'"
    ],
    "3. REPORT OF THE EXECUTIVE DIRECTOR": [
        "'CHAIR WHITE': ' Agenda Item No. 3 is the Report of the Executive Director, Mr. Acosta.'",
        "'MR. ACOSTA': ' Thank you, Chair White, and good afternoon. Given today's agenda, I just have one item of public interest. The Commission authorized a draft monumental core streetscape guidelines for a 90-day public comment period at its February meeting. We're holding two virtual public meetings on the guidelines, on March 23rd at 12:30 p.m. and March 30th at 6:00 p.m. Further information about the meetings is available on our website. You do have your monthly report in your packets. And I would be happy to answer any questions.'",
        "'MS. WHITE': ' Thank you, Mr. Acosta. Does the Commission have any questions?'"
    ],
    "4. LEGISLATIVE UPDATE": [
        "'MS. WHITE': ' Hearing none, Agenda Item 4 is the legislative update. Ms. Schuyler.'",
        "'MS. SCHUYLER': 'Thank you, Madam Chair and members of the Commission. I do have a few things -- I do have a few things to report. The first is House of Representatives Bill 6720. This was introduced in the House on February 11th and it was referred to the Committee on Natural Resources. The bill authorizes the Thomas Paine Memorial Association to establish a commemorative work on federal land in the District of Columbia and its environs to honor the United States patriot, Thomas Paine. The act further requires that the establishment of the commemorative works must be in accordance with the requirements of the Commemorative Works Act. The second item I'd like to report is H.R. 6611. This was introduced in the House on February 4th and referred to the Committee on Natural Resources and the Committee on Budget. This authorizes the Embassy of France -- and, yes, I did say'",
        "'MS. SCHUYLER': 'the Embassy of France -- in Washington, D.C., to establish a commemorative work in the District of Columbia and its environs to honor the extraordinary contributions of Jean Monnet to restoring peace between the European nations and establishing the European Union. The establishment of this commemorative work must be in accordance with the commemorative works. There is also a companion bill to H.R. 6611 in the Senate and this is Senate Bill 3579, and it has the same requirements. This concludes my report.'",
        "'CHAIR WHITE': ' Thank you, Ms. Schuyler. Does the Commission have any questions for Ms. Schuyler?'",
        "'COMMISSIONER GINSBERG': ' I have a question. Do we know whether there's precedent in having a -- giving an Embassy authority to establish a monument in the District or in the area that we have oversight of?'",
        "'MS. SCHUYLER': ' That's an interesting question. I have not encountered that during my tenure with the Agency. I'd be perfectly willing to go back and do some research to see if I can flush that and answer out your question further.'",
        "'COMMISSIONER GINSBERG': ' I can also go to the CRS as well. I'll do the same. We'll both go back to our people and see what we find.'",
        "'MS. SCHUYLER': ' Okay, very good. And then we'll talk. Okay. It is unusual, I have to say. It did catch my attention.'",
        "'COMMISSIONER GINSBERG': ' I think Peter had something.'",
        "'COMMISSIONER MAY': ' There is a parallel for this. I've forgotten the exact memorial, but there is something that was similar. And they are looking -- they are talking about something very modest. It's not going to be, you know, a big memorial. It's more akin to a small plaque or something like that. And again, there's a precedent. I've forgotten which memorial it was, but we've had some discussions already with the Embassy about this. So as I said, not completely without precedent.'",
        "'COMMISSIONER GINSBERG': ' Got it. Thank you.'",
        "'CHAIR WHITE': ' Thank you. It will be interesting to see as you compare your notes. Thank you, Commissioner May for that additional information.'"
    ],
    "5. CONSENT CALENDAR": [
        "'CHAIR WHITE': 'Agenda Item 5 is the Consent Calendar. There are two items on this month's Consent Calendar. The first is to authorize the release of the Pennsylvania Avenue Vision and Concepts for public comment for 120 days, starting in March. And as Director Acosta noted, we heard a detailed presentation of this vision at our February 16th special session, which is available to the public on NCPC's website. And I want you to know that I was really delighted to see that the press picked up this story and was able to convey the enthusiasm that we have for this effort and the importance of this initiative since it is America's Avenue. The second item is for approval of preliminary and final site and building plans for the Perimeter Security Upgrade at the National Foreign Affairs Training Center in Arlington, Virginia. This was submitted by GSA. Are there any questions or'",
        "'CHAIR WHITE': 'discussion of the Consent Calendar items? Hearing none, is there a motion to approve the Consent Calendar?'",
        "'COMMISSIONER WRIGHT': ' So moved, Commissioner Wright.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Wright. Is there a second?'",
        "'COMMISSIONER MCMAHON': ' I will second.'",
        "'CHAIR WHITE': ' Thank you, Commissioner McMahon.'",
        "'CHAIR WHITE': ' Ms. Koster, can you please confirm the motion and the second and take the vote by roll call?'",
        "'MS. KOSTER': ' The motion was made by Commissioner Wright and seconded by Commissioner McMahon. With that, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' Commissioner Ginsberg?'",
        "'COMMISSIONER GINSBERG': ' Also abstain. Thank you.'",
        "'MS. KOSTER': ' Thank you.'",
        "'CHAIR WHITE': ' Thank you. The motion has carried. While we normally hear information and presentations later in the meeting, please note that we will have a presentation on a project followed by two information presentations, all provided by the Smithsonian.'"
    ],
    "6A. APPROVAL OF PRELIMINARY SITE AND BUILDING PLANS FOR THE SOUTH MALL CAMPUS HISTROIC CORE REVITALIZATION ": [
        "'CHAIR WHITE': ' Agenda Item 6A is for the approval of preliminary site and building plans for the South Mall Campus Historic Core Revitalization. And presenting will be Mr. Flis.'",
        "'MR. FLIS': ' Thank you. Good afternoon. If everybody would just confirm that you can see my presentation.'",
        "'CHAIR WHITE': ' Yes, we can.'",
        "'MR. FLIS': 'Okay, great. So, good afternoon, everybody. This Smithsonian Institution has submitted preliminary site and building plans for the project they call the Revitalization of the Historic Core, or RoHC. This project includes the Smithsonian Castle, the Arts and Industries Building, and a new central utility plant, along with other various improvements across the South Mall Campus. The Commission last reviewed this project as a concept review back in July of 2021. And since that time, the Applicant has continued to develop the project plans. So this is a preliminary review and the Commission is looking at the project's approach to the proposed building improvements, landscape and perimeter design, impacts to key views, and how the project has responded to the Commission's previous comments. So I think everybody's familiar with the South Mall Campus, but here for reference is a map showing the project area. It's highlighted here in blue. And'",
        "'MR. FLIS': 'it's located, again, just north of Independence Avenue and South Jefferson Drive. And here is an aerial view of the campus itself, with the Arts and Industries building here in the foreground and the Castle in the background. And you can see it would be the Mall lawn panels in the distance. Both of these buildings are National Historic Landmarks. So this is one of many projects that are being implemented pursuant to the South Mall Campus Master Plan. You've already reviewed projects from the Hirshhorn, from the Sculpture Garden, as well as the museum building itself, as well as other improvements to the Freer Gallery. So the biggest components of this project are the revitalization of the Castle and AIB, new underground work, including a new central utility plant. Other components include perimeter security, as well as cooling towers. And, again, these were all identified in the South Mall'",
        "'MR. FLIS': 'Campus Master Plan. The project also includes interior rehabilitation of the project. Through the Section 106 process, several consulting parties had inquired as to why the Smithsonian doesn't consult on interiors. And this issue has been referred to the Advisory Council on Historic Preservation. And just as you know, the NCPC does not review interiors. It's also important to note what's not included as part of this project. Specifically, the entry pavilions and Haupt Garden redesign, which you saw as part of the master plan. Those elements are not part of this undertaking. The Smithsonian has indicated in correspondence that they will undertake a separate planning effort for the revitalization of the Quadrangle Building, which is below the Haupt Garden, in approximately five years. At that time, they will update the master plan to match whatever the new proposed improvements might be. So, this is a large project, as you'",
        "'MR. FLIS': 'know, with a lot of components. I'm going to try to go through it relatively quickly and then focus on those areas where staff has highlighted comments in the EDR. I'll also note in the EDR that we are recommending preliminary approval with the exception of three elements; the perimeter security, the cooling towers, and the Castle elevator overrun, which we're recommending held over for further design development and/or coordination. So I'll highlight those through the presentation. So, first, I'm going to start with the Castle. And with both the Castle and the Arts and Industries building, the project's really focused on improvements to the envelope and the building systems' access and structure. The main goal is really to increase that public access, activating the basement level with public function, the new visitors center and providing in general, enhanced visitor services in the building. I'll also note that the Smithsonian'",
        "'MR. FLIS': 'administration will still remain in the Castle. So as part of this revitalization, the project includes repairs and improvements to the building masonry and envelope, the replacement of windows, many of which were replaced back in the 1980s and 1990s. Some critical historic windows will be retained. For mechanical systems, the project includes new intake and exhaust points, taking advantage of how some of the existing rooftop locations where they can be minimized at this building. And then also repairs and replacement of the roof. Here, the design has continued to evolve such that the roof profile is slightly deeper than what we talked at concept review. This is to accommodate insulation, which is necessary for the building envelope. However, it appears that the visibility of this change will be minimal. New seismic protection is also provided in the form of base isolation. This approach minimizes the need for that'",
        "'MR. FLIS': 'above-grade reinforcement to the Castle, resulting in less structural and interior changes to the building. This will also result in a new seismic joint around the building. And, essentially, this is a way to help us connect the building from the ground in the event of movement of the earth during an earthquake. So, as part of that, the existing areaways around the building will be expanded and made more regular. This will allow for new doors and windows into the expanded basement level. It will also allow for that seismic joint to be incorporated. The Applicant is proposing a tiered approach to the areaways to allow for plantings to really help soften the views and help them integrate with the surrounding gardens. So, here's just some examples of how the new doors will be incorporated -- doors and windows -- taking advantage of existing openings where possible. And this'",
        "'MR. FLIS': 'is consistent with what we saw at the concept review. The entries to the Castle will be improved for increased accessibility, really looking at the ramps and the grading around both the north and south entrances. This is, again, consistent with the concept review and appears relatively sensitive to the historic structures and the site. So, moving on to more significant changes, the Applicant proposes to add a new pedestrian walkway or connector at the roof of the east range. You saw this back at the concept review. Here the egress from the fourth floor of the east range of the Castle includes an interior stair, but also an emergency pathway also across the roof. This pathway is not -- doesn't meet code requirements, and so an additional egress path is necessary to help this space be occupiable. And so the Applicant originally proposed an enclosed connector on top of'",
        "'MR. FLIS': 'the roof. You can see that here. This is the existing condition. There's an existing mild historic monitor here that would be removed. And they would have had an enclosed connector with a clasp component here. And this is what you saw at concept review. And the Commission found that this position had the potential to cause both 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 physical and visual adverse effects to the Castle, and asked the Applicant to take a look at this proposal and also provide additional renderings analysis to understand what those visual impacts could be. So in response to those comments, and also those from the consulting parties, the design of the fourth floor egress has been revised. Now what is proposed is an open air walkway here on top of the'",
        "'MR. FLIS': 'roof, with metal guardrails. So there would be a formal pathway and protection would be provided through guardrails. And here you can see what that would mean in terms of visual impact. So it appears that this connector, without that enclosure, would be much less visible from locations around the National Mall and around the Castle itself. And here's just a rendering. Again, you can just pick out the line of railings that would be included. So, as a result, staff does find that this revised design has responded to the Commission's request to develop an egress approach that minimizes those visual impacts. The Applicant also proposes to relocate an elevator overrun as part of these improvements. There is an existing elevator penthouse here, colored in red, which was built in the 1970s. This will be removed and replaced in a new location as part of these upgrades. The new'",
        "'MR. FLIS': 'overrun will be added here. It's a different location. It's highlighted here in blue. We do understand the need for the elevator; however, the current submission provides only a general massing and size and scale for this proposed addition, which could potentially alter the roof line of the Castle. And, as such, we do think additional information is necessary to really evaluate the impacts to the proposed elevator overrun. We request the Applicant provide additional details, including material selections, renderings, and perspectives of this proposed addition to understand what's going to change on the roof line, but also the attempts to minimize the height and profile, if possible. And we understand the Applicant is already working on this issue. So, moving on to the Arts and Industries building. Again, these changes are primarily focused on increasing public use of the building and public access while respecting its historic character. There'",
        "'MR. FLIS': 'is a basement level excavation proposed, as well, as part of the project. And, as at the Castle, the intention is to accommodate those back-of-house systems below- grade so that the historic interiors can remain free for public access and programming. So the components of this project include, like the Castle, new louvers and ventilation in the roof line, taking advantage of existing openings where possible. New egress doors to meet code requirements. Again, taking advantage of either existing openings or trying to align with historic windows. New areaways around the building, both for access, to access the interiors of the building, as well as to provide areas for venting and the chemical systems. And then also new ramps and accessibility improvements at both the north and south sides of the building. Here you can see the north side with the accessible ramps on either side. And then here at'",
        "'MR. FLIS': 'the south side, which is facing Independence Avenue. You saw a version of this at concept review. So I'll note that this ramp and stair do extend into the sidewalk of Independence Avenue. However, it has been refined to simplify and minimize the extent, and minimize the overall footprint, while still providing that ADA -- that accessible entrance because there are stairs there currently. Just quickly, some other changes include expansion of the Ripley Garden. This is accommodated through the removal of parking. And then, as I mentioned, a new basement level within the building. So, at concept review, the Commission requested the Applicant provide further information about the amount of excavation proposed underneath the Arts and Industries Building. The submission does detail that the excavation for the basement level will include much of the building footprint. Again, as I mentioned, this is to accommodate mechanical and support spaces for'",
        "'MR. FLIS': 'the building while maximizing the use of the historic spaces. I'll note that there are some existing basement spaces, primarily at the corners of the building. And those will be expanded as part of this project. So, moving on, the project includes a new central utility plant. This is going to be located below-grade, between the Quadrangle Building and the Arts and Industries Building. This will allow for this connection from the GSA system, which, according to Smithsonian, will allow them to have cost savings, but also reduce the footprint. So, as was initially proposed in the South Mall Campus Master Plan, the central utility plant would initially serve the Castle and Arts and Industries Building, but it will be designed to accommodate all buildings within South Mall Campus. It will have two levels below-grade. And then a third level would accommodate stormwater as a cistern. The total area of'",
        "'MR. FLIS': 'excavation has actually been reduced since concept review. Here you can see in purple the B2 level footprint. At concept review, it's been reduced, particularly against the Castle. This is consistent with the Commission's previous request to reduce that excavation where possible. So at concept review the Commission also requested information about how the plant would meet sustainability goals. The Smithsonian responded that they use their climate change adaptation plan, as well as their strategic sustainability performance plan, to identify strategies to get incorporated into the projects. This project will pursue certification under LEED, with separate scorecards for the Castle and Arts and Industries Building. The central utility plant, the plant itself, is proposed to be LEED Silver. So, given the underground location of the central utility plant, at concept review the Commission requested the Applicant clarify some information about the potential impacts of that underground infrastructure project on the'",
        "'MR. FLIS': 'garden above, particularly related to soil depth and some of the projections that might come up in the garden itself. The intention here is to help preserve the character and siting of the garden space. So, in response, the Smithsonian has indicated that there will be sufficient soil depth. The roof of the plant itself will match the Quadrangle Building, which is below the garden today. So that depth does allow for plantings and other trees and other materials that will be planted on top. In addition, the Applicant has confirmed that most of the venting will actually be accommodated through those areaways that I mentioned along the Arts and Industries Building, so that will minimize any projections or alterations in the garden itself. So, related to this, there are cooling towers proposed as part of the central utility plant. These help exhaust heat into the outside environment. The Applicant'",
        "'MR. FLIS': 'has identified that their preferred location for these towers is the National Museum of Natural History. The site is located here. This is the museum building itself. This is again on the north side of the mall, across from the South Mall Campus. And these new cooling towers will be connected to the South Mall Campus underground. Currently, the Applicant has indicated that their preferred approach is the direct bore underneath the Mall to the towers themselves. They have indicated that they are continuing discussions with the National Park Service regarding this tunnel and how to evaluate the depth and alignment that would be necessary to make that connection. So the cooling towers are proposed to be located beneath -- are proposed to be located at the southwest corner of the Natural History site. Here's an image today. That is a parking area. It is depressed below the adjacent streets'",
        "'MR. FLIS': 'and sidewalks, so you can see that view here. And this is a section through the cooling towers, as proposed. So you can see this is, I think, Madison Drive here, taking advantage of the depressed nature of the existing site. However, due to the height and the scale of the equipment, it would still project up above grade, approximately nine foot or so. And the Applicant is looking at, you know, strategies to help screen this enclosure. So, for reference, there are existing cooling towers on the east side of the campus. You can see some images of those here. And then, per the Commission's request at concept review, the Applicant did provide a series of massing studies to show what those cooling towers and their enclosure would look like as viewed from the National Mall and some other locations. You can see here some existing conditions and then'",
        "'MR. FLIS': 'the proposed view. Essentially, you're seeing kind of a white massing where the cooling towers would be located. And then here's just some additional images showing what that would look like. We've also provided some detailed sections with both the cooling towers themselves and then the potential landscape strategy to help, you know, screen this new element. The massing studies have been helpful for review. However, further details of the actual design of this enclosure would be necessary for preliminary review. So, again, while the massings are helpful, we do recommend the Applicant actually submit a more detailed architectural design for the enclosures, considering strategies, again, to help reduce those visual impacts, in coordination with the landscape approach, to help reduce, you know, the views of the towers from the National Mall and around the site. So, at this point, we're not quite sure what the material section might be'",
        "'MR. FLIS': 'or fenestration, and these are kinds of things that could be provided as part of the next review. Finally, I'll note that the submission does indicate that the cooling towers are proposed to be within the flood hazard area, like the existing towers. And while this doesn't necessarily preclude their location here, the Applicant should further explain what the implications of the siting of this infrastructure in this location might be. And related to that, the Applicant should also be coordinating further with the District Department of Energy and Environment on this particular topic. So, moving on to our last section, which includes the landscape and the perimeter security. Changes to the landscape are generally just to support the project, intended to be mostly minimum, with emphasis on rehabilitating the site while accommodating some of those changes around the base of each building. They will accommodate the new program elements,'",
        "'MR. FLIS': 'but the intention is to replace the existing vegetation in the spirit of the existing character. I'll also note that there are several objects and elements in the garden. Those will be coordinated as well, in particular the Downing Urn, which is located in the Haupt Garden now. The Smithsonian has indicated they'll be coordinating with the Park Service on the, you know, future location of that post-construction. So, one of the more significant changes to the setting of the campus is the addition of new perimeter security. And this is the last big component. Perimeter security has been contemplated for this site going back to the Mall-wide concept design, which was developed in 2004. The Master Plan also indicated the need for such improvements, with the focus really on blast and vehicle protection for the two National Historic Landmarks. The measures would also provide, you know, protection for the'",
        "'MR. FLIS': 'gathering areas around both buildings, particularly where visitors are entering buildings. So the goal is to enhance perimeter security along both Jefferson Drive and Independence Avenue. You can see those areas highlighted here in red. This is Jefferson Drive and this is Independence Avenue. And the project proposes to use a contextual and unified approach. This is similar to what was recommended in the 2004 concept design. A variety of security measures are proposed, including both bollards and garden walls, with a variety of materials that are intended to be sympathetic to the existing site conditions. And here you can just see a range of those materials that are proposed. So, along Jefferson Drive, the perimeter security will extend about 900 feet, perhaps a little bit longer, going from just west of the Castle, all the way to just east of the Arts and Industries Building. The Applicant has prepared'",
        "'MR. FLIS': 'three alternative designs for the section that's in front of the Castle here, and then just one single design for the section in front of the Arts and Industries Building. I'll walk you through those here. So, Alternative 1 is the Applicant's preferred approach. And this is for the section in front of the Castle. This includes a combination of bollards and raised planters. This is just a plan view. And I'll show you the rendering, which probably gives you more information. Here, you can see bollards located along the curb. And then returning to garden walls, which would be incorporated into the existing lawn areas. These would become planted, and then additional bollards and additional raised walls. Alternative 2 is just essentially a single line of bollards at the curb, following along in front of the Castle. And here's just a rendering of that. So this is, again, in'",
        "'MR. FLIS': 'front of the Castle. This line would extend further down in front of the Arts and Industries Building, as well. And then, finally, Alternative 3 includes primarily bollards, but the location is somewhat different. In this instance, the bollards would follow along the curb, but then move to be located also within the planting areas. And here you can see a rendered view of that, again, following the curb, and then bollards and plantings, and then coming back here. The Applicant has indicated that one of the challenges with this approach is the structure necessary and the foundations that are required for the bollards themselves. This does, according to them, pose challenges for plantings once you install them here. You would perhaps not have the level and, you know, lushness of plantings here. It also does create maintenance issues when you have these objects within the planting area. So those'",
        "'MR. FLIS': 'were the alternatives for the Castle component. For the section that extends further east in front of the Arts and Industries Building, a single line of bollards is proposed. So this is about 400 feet. It would connect the front of the Castle to the perimeter security there, and then essentially just follow along in front of the Arts and Industries Building, and then connect to the Ripley Garden walls, which would be reinforced as security walls. We don't have any renderings for this section, but I do have just a view of what this area looks like today. So we do appreciate that the Applicant has considered some alternative designs for particularly the section in front of the Castle. And it's clear from the different renderings, that there are tradeoffs between each approach, especially when you think about impacts to the character and the functional public spaces, the views'",
        "'MR. FLIS': 'and setting of the landmarks themselves, and then just in regards to the landscape in the gardens as well. So, on one hand, you can keep all this security along the curb line here, which has significant visual impacts and impacts the public space. You could, as shown, integrate it into the landscape which has impacts on the gardens and the plantings and potential grade. And we recognize that all of these, you know, create challenges for, you know, how to resolve this question about perimeter security. So, as a result, we do recommend the Applicant evaluate a holistic approach that considers the entire length of Jefferson Drive in front of the Castle and AIB. There's a few things -- things about minimizing those long stretches of bollards, minimizing the number of locations where bollards are crossing sidewalks, minimizes the changes in grade adjacent to the National Historic Landmarks, and'",
        "'MR. FLIS': 'also considers using existing building yards where possible. So related to this and supporting it for a future review, provide additional plans and renderings of any new alternative approaches so we can understand the potential visual impacts. And we do request using renderings for both the Castle, as well as the Arts and Industries Building. It would also be helpful to understand what are the potential options for the section in front of the Freer Gallery. This is further west. It's not part of this project, but there are still kind of things to think about and what are the implications that this perimeter security extends further to the west. And, finally, I'll note that we do request further coordination with the National Park Service. Jefferson Drive is maintained by the National Park Service. And so further discussions about potential impacts of any perimeter security should occur there. And moving'",
        "'MR. FLIS': 'to the south side of the campus now, this is Independence Avenue. The Applicant does propose a line of bollards to be located along the curb in front of the Arts and Industries Building. This would connect to the Ripley Garden walls and then also the existing Quadrangle garden walls on the west end. And no changes would happen to the Quadrangle garden walls. So I'll note -- you can see in this image that the Arts and Industries Building does have minimal building yards along Independence Avenue, particularly the entry and corner pavilions are right up against the sidewalk, which is only about 17-feet wide. It does have some small tree boxes. In the future, if the cross-section of Independence Avenue changes, it may allow for additional public space and other security approaches. But we do recommend that currently this area is somewhat restrained. So, given that, as part'",
        "'MR. FLIS': 'of the next review, we do request that the Applicant provide perspectives of the proposed bollards and perimeter security along Independence Avenue to understand what those visual impacts are in construction, with the accessibility improvements, which I mentioned earlier in the project. And it also shows further details about how bollards would cross the sidewalks, so we can understand what those potential impacts will be. Further, we do request that the Applicant coordinate further with DDOT regarding any proposed installations, which would require their public space review and permitting. So, in conclusion, as I stated early in the presentation, the staff recommends the Commission approve the preliminary site and building plans for the project with the exception of those three elements; the perimeter security, cooling towers, and the Castle elevator overrun, each of which does require additional design development and coordination. In the interest of time, I'm not going to'",
        "'MR. FLIS': 'go through the rest of the recommendations, which are included here, but they will be available for your review and discussion. And with that, I will now turn it over to Kevin Gover, who is the Undersecretary for Museums and Culture with the Smithsonian for a few remarks. The design team is also available and here to help answer any questions. Thank you.'",
        "'MR. GOVER': 'Thank you, Mr. Flis. Madam Chair, Commissioners, the Revitalization of the Smithsonian's Historic Core, along with the creation of two new museums, the National Museum of American Latino and the Smithsonian American Women's History Museum, are priority undertakings for the Smithsonian over the next decade. As the Undersecretary for Museums and Culture, I'm working with Secretary Bunch to help guide these projects, which promised to transform our architectural legacy and how we achieve our mission to increase and diffuse knowledge in new and inclusive ways. The Smithsonian appreciates the recommendations in the preliminary design staff report presented by Mr. Flis, as well as the Commission's previous comments on the original concept design we presented in July. Before the Commission goes into more detail on the design, I would like to note our responses to two of the report's recommendations. The first regards the recommendation on developing the design of the'",
        "'MR. GOVER': 'perimeter security around the Historic Core. We found that the proximity of the Castle and the Arts and Industries Building to streets and public sidewalks presents design challenges. We remain committed to a final design that both meets the federal security requirements and creates a welcoming and functional streetscape appropriate for the National Mall. We concur with the recommendation that this process will benefit from further coordination with the National Park Service, National Mall and Memorial Parks, and the District of Columbia Department of Transportation, and we are planning to conduct an interagency workshop with them soon. We also agree with the recommendation for more thought on the central utility plant and its associated cooling towers. We are currently examining alternative energy sources and the design needs and impacts for each. The Smithsonian is committed to exploring the best energy generation technology and management methods as part of this project.'",
        "'MR. GOVER': 'As you know, energy generation technologies are rapidly changing. And as they do, the Smithsonian will continue to consider their promise and impact throughout the design process. On behalf of the Smithsonian, we thank the Commission for providing us the opportunity to share the preliminary design for your review and approval. Our project team, our team from EYP Loring are here today and are prepared to address any questions you might have. Smithsonian Historic Preservation Specialist Carly Bond will address and field questions for additional members of our Smithsonian team or for EYP Loring as needed. Thank you so much for your consideration of these projects.'",
        "'CHAIR WHITE': ' Thank you, Mr. Flis and Undersecretary Gover. We really appreciate you being here with us today. And now I'd like to ask the Commissioners: do you have any questions for staff or our Applicants and their consultant team? If not, we do have one person signed up to speak, Judy Scott Feldman. Please let us know when you're ready, Ms. Feldman. You're testifying on behalf of the National Mall Coalition and you will have five minutes for your comments. Thank you and welcome. MS. SCOTT-'",
        "'FELDMAN': 'Thank you. Thank you. Good afternoon, Chair White and Commissioners. I'm Judy Scott Feldman, Chair of the nonprofit National Mall Coalition. The Coalition founded in 2000 is dedicated to advancing comprehensive visionary planning for the Mall to ensure the vitality of this historic national treasure for future generations. I urge you to read my full testimony. Today I will read an abridged version. The National Mall Coalition supports the Smithsonian's now more modest efforts to revitalize the Smithsonian Castle and Arts and Industries Building. We would like to take this opportunity however to express our disappointment at a serious missed opportunity. And to ask this Commission to take action to remedy the unmet need. In short, the Smithsonian has failed to frame this project in the larger context of the entire National Mall, a historic and cultural resource of national importance of which it is a part. The Mall has'",
        "'FELDMAN': 'two urgent, unmet needs. One is flood mitigation, the other is creating clean, renewable energy sources for the museums and government buildings on and surrounding the Mall. The Smithsonian plan could have been an opportunity to bring all Mall stewards together to create a comprehensive program for flood and clean energy needs. Instead, the Smithsonian plan calls for new heating and cooling facilities to serve its buildings, but not the larger Mall itself. Its proposed flood water cistern beneath the Castle takes no account of the existential threat of flooding across the entire Mall and Federal Triangle area. The Smithsonian will say it can only plan for Mall lands under its control. Regrettably, no plan review authority, including this Planning Commission has required the Smithsonian to take a comprehensive approach or to insist on collaboration among mall stewards. As a consequence in coming here, this Commission can expect to be'",
        "'FELDMAN': 'asked to approve other piecemeal solutions for clean energy and flooding problems by GSA, National Gallery of Art, USDA, and other mall stewards with all the associated threats to the integrity of the Mall. The Coalition has advocated creation by Congress of a new McMillan type Commission to update the historic 1791 L'Enfant plan and 1901 McMillan plan for the Mall for the 21st Century. This Commission, as well as other Mall stewards have opposed this idea. But the evidence to support a new commission and a new comprehensive plan is now more compelling than ever. The Park Service's National Mall Plan released in 2010 was not the new visionary plan promised to Congress. But instead only a maintenance plan limited to lands under Park Service control. The DC Silver Jackets Interagency Flood Response Team, which includes this Commission, spend three years studying Mall area flooding. And ended up recommending'",
        "'FELDMAN': 'a pumping station at 14th and Constitution Avenue. Many of us are scratching our heads. How can this be a solution when it would pump toxic storm water runoff directly into the Tidal Basin? And likely make the existing flooding problem at the Tidal Basin even worse. The Commission's seven year work on its new Pennsylvania Avenue proposal seems to ignore all together the urgent flooding and clean energy needs. Certain conclusions are hard to deny. Each agency plans for its own needs, not for the good of the Mall as a whole. When agencies do try to work together to agree on a more comprehensive solution, they end up either falling back on agency by agency priorities or compromising on solutions that are not solutions at all or they ignore the problems all together. But ignoring the problem is not a solution. The Coalition urges this Commission to support'",
        "'FELDMAN': 'creation of a MacMillan type commission that can update the 120-year-old MacMillan Plan to solve the flooding and clean energy problems. And also to provide new sites for the inevitable future memorials and museums. Finally, the Coalition asks this Commission to give the Coalition an opportunity to brief this Commission on our National Mall Underground Concept. The Underground could solve both the flooding and clean energy needs in one massive infrastructure facility. When the National Mall Coalition presented the concept to this Commission in 2013, there was considerable enthusiasm by both federal and DC Commission members. But in 2021 to our surprise, the concept was rejected outright by this Commission, the Smithsonian, and the National Park Service. Only the Commission of Fine Arts invited us to present --'",
        "'MR. JUTTON': ' That's five minutes. MS. SCOTT-'",
        "'FELDMAN': ' -- which we did last October. I have one more minute. They told Congress -- the Commission did -- that they thought the project deserves further review. The Coalition is alarmed at the ongoing flood threat to our national monuments and museums and urges Commission action to use its planning authority to ask Congress to take corrective action. The Coalition welcomes the opportunity to provide our expertise in any such action. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Ms. Feldman. Does the Commission have any questions? We appreciate you sharing your concern for addressing flood risk in the Monumental Core. Clearly NCPC has been engaged in the conversation for quite some time -- since 2006. And we recently expressed significant concerns as you noted, along with other federal agencies, regarding the safety, security, and historic research impacts to the Coalition's proposal. The proposal is one of many possible solutions. And in the future, we will ask NCPC staff to provide the Commission with an update on flood risk management activities and proposed solutions to the Monumental Core. So thank you again for joining us today and bringing forward your comments. We really appreciate it. MS. SCOTT-'",
        "'FELDMAN': ' May we provide them to you please?'",
        "'CHAIR WHITE': ' So we'll get back to you when we get the information presentation set up and figure out how we'll have all of the different proposals reviewed. So thank you again for being --(Simultaneous speaking.) MS. SCOTT-'",
        "'FELDMAN': ' Yeah, the one thing I would say is --'",
        "'CHAIR WHITE': ' I'm sorry? MS. SCOTT-'",
        "'FELDMAN': ' The one thing I was going to say is that the tunnels proposed by the Smithsonian have a direct impact on the future potential of the underground. So that's why we ask. There's a certain urgency to having you all review something you have never been able to see from the Coalition and our architect, Arthur Cotton Moore. We'd appreciate that opportunity. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Ms. Feldman. I will now open up to the Commission for discussion on the proposal at hand today. I will start with Commissioner Cash and then go in a round-robin format using our normal seating order. Please keep your web cams on during the discussion. So Commissioner Cash, thank you.'",
        "'COMMISSIONER CASH': 'Thanks so much for the presentation. There's a lot going on here. There's a lot of stuff that I would say if we were moving to approve all of these plans. But considering that we are not looking at the cooling towers, the bollards, and the controversial things here, I don't want to take up the time going through a lot of those concerns, because I'm sure that they will be back before us and there will be a better time to do it. But I will just emphasize, I think some of what the witness just said, that I think the holistic planning efforts are really important. And as the work continues, especially on things like the bollards, I think that when it comes back to us, it would be very helpful to see some plans that take into account what the rest of the Mall is going to'",
        "'COMMISSIONER CASH': 'look like. Because this is kind of like a little enclave where we're looking at a lot of bollards on both the Independence and the interior Mall side. And I just want to make sure that the planning efforts long-term for Smithsonian properties, the National Gallery of Art, for Department of Agriculture, there needs to be some kind of cohesiveness there when we're looking at this. So I don't have a lot else to say because we're not -- we're only approving the -- everything but the three pieces. But thanks so much for the presentation. It's a lot to take in, but we're sure to be back to this soon.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis.'",
        "'COMMISSIONER DAVIS': ' Yeah, thank you so much for the presentation. I just wanted to echo Commissioner Cash and the witness. I'd be interested to hear more about the holistic planning efforts of the mall in general. But I appreciate the presentation today. That's it for me. Thanks.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Ginsberg.'",
        "'COMMISSIONER GINSBERG': ' Sorry. Thanks for the presentation. I also have no questions.'",
        "'CHAIR WHITE': ' Commissioner McMahon.'",
        "'COMMISSIONER MCMAHON': ' Thanks. Good presentation. I appreciate it. The only question I've got that I guess will be discussed in further reviews revolves -- I guess we're all going to hear about the bollards -- to take a look. And I certainly share the concerns that the other Commissioners spoke of so far of the visual appearance that bollards would do, you know, both for within this project area and how we actually present them in massing, but also tie them with the rest. But also just as a question for me from a design perspective -- and I can't tell whether we're trying to protect just the buildings or also protect pedestrians. And I think that will affect some of the design portions going forward. That's all I have. Thanks.'",
        "'CHAIR WHITE': ' Thank you. Commissioner May.'",
        "'COMMISSIONER MAY': 'Yes, thank you. The first thing I'll say is that we support the Executive Director's recommendation. Our staff has been involved in a number of ways, including consultations on the National Historic Landmarks, and the National Park Service, and NHL -- all projects reflecting NHLs in Washington. I think the staff is correct to hold off on the approvals of the most problematic components of security, the elevator overrun and the cooling towers. I have to say the perimeter security thing is really very obviously problematic. And it's not -- it's a whole range of things, right? I mean, it's the choice of materials for bollards. I think I would have to question the use of any sort of stone-clad bars in this circumstance given the setting for it, and the fact that it's introducing sort of a new architectural component that's much more pronounced than, say, just a metal'",
        "'COMMISSIONER MAY': 'bollard. And I think that, you know, things like -- their preferred strategy with the raised planter walls and bollards in combination, I mean, wow. Maybe some of it is just the quality of the rendering, but I could not have pictured a worse rendering of that kind of concept than what they have in that image. The stone is just a complete mismatch. I understand what the intent is, but the intent is not coming across in those renderings. So, I mean, I think they really need to look very seriously at that. And I do think that we need to have some significant conversation between the Park Service and the Smithsonian on how this is treated. And I do like the idea of having a more holistic approach. But I will say that, for the most part, the Smithsonian museums across the Mall have developed sort of customized'",
        "'COMMISSIONER MAY': 'approaches for each of those buildings. And in some cases, they're very specific and architecturally tuned to the building that is being protected. Like the Air and Space Museum and their approach with that particular form of bollard. And then, for American History, the use of stone, large stones, in addition to, you know, other security measures. I mean, it's always been a very customized thing. And I don't know that there is really a need for sort of the uniformity, because you don't even have uniformity of architecture amongst the buildings or uniformity of landscape designs. It's all very different when you get down into the details of the Smithsonian buildings. You know, that being said, I think that there are certain ways in which the consistency of approach is critically important, particularly when it comes to understanding exactly what the perimeter security is designed to protect against. I'",
        "'COMMISSIONER MAY': 'think Commissioner McMahon raised the issue of, are we protecting people or are we protecting buildings? It's very hard to be thinking about protecting buildings and sidewalks when we have people all over the place and, you know, crossing the streets in large crowds just to cross the street. But I think understanding and making clear what the intention is, I think is very important. So, you know, I support that at least in terms of the approach to the threat. Let's see. You know, back in July I did have some questions about base isolation and that approach. And I remain very concerned about all of that excavation under these historic buildings. It's tremendously expensive. And, you know, I won't repeat on the comments I made back then, but I'm not raising this because I think that the Smithsonian should take a different approach, but just that the utmost'",
        "'COMMISSIONER MAY': 'care is necessary in undertaking something like this. It's just that it's fraught. Digging large holes next to buildings is bad enough. Digging in under buildings is just really, really, really fraught. So I've said that word too many times. So I'm going to stop talking now and turn things over to, I guess, Mr. Argo.'",
        "'CHAIR WHITE': ' Thank you. Thank you, Commissioner May. I inadvertently skipped over Commissioner Steingasser. So if we could come back to you, Commissioner. And do you want to share any comments or questions?'",
        "'COMMISSIONER STEINGASSER': ' Yes, I do. Thank you. I definitely want to associate myself with all the comments stated so far, especially about the security elements. And I appreciate Undersecretary Gover's concurrence with the staff report and the level of detail. And I appreciate the struggle and strain of these buildings and their location right up against the public ways. So I do look forward to additional study and review of those elements coming back. Yeah, that's all. Thank you.'",
        "'CHAIR WHITE': ' Thank you. And again, apologies for skipping you.'",
        "'COMMISSIONER STEINGASSER': ' One other thing --'",
        "'CHAIR WHITE': ' Sure.'",
        "'COMMISSIONER STEINGASSER': ' -- hadn't the -- There was a study that was being led by NCPC for Independence Avenue. And I just wondered if we could get an update on where that study is -- I think it was being done -- It was being led by NCPC, but I think DDOT -- District's Department of Transportation was also involved. Is that --'",
        "'CHAIR WHITE': ' Director Acosta or Mr. Flis, do you want to speak to that and just give us a brief update on where that is?'",
        "'MR. FLIS': ' Sure. Sure, I can provide some update. Yes, that study has started and NCPC is collaborating with the District, looking at Independence Avenue. My understanding is that the District, along with the Smithsonian also as a partner, has applied for a grant with the COG to take a look at the avenue's traffic capacity because if definitely does have implications for what their right of way needs to be and potential opportunities for that public space. So hopefully we will hear back on that grant sometime later this Spring. And hopefully kick off sometime in the fall. So it seems like an exciting opportunity to collaborate on this opportunity.'",
        "'COMMISSIONER STEINGASSER': ' Thank you. That's exactly what I was thinking of when I was talking to my colleagues at the District's Department of Transportation. Had the same feeling that the timing was right to be in coordination with the security elements of this particular plan. Thank you.'",
        "'CHAIR WHITE': ' Thank you for raising that because I do think it is an opportunity and we need to take a look at that street holistically to figure this out. So thank you for bringing that to everyone's attention. We'll go now to Commissioner Argo.'",
        "'COMMISSIONER ARGO': 'Hi, thank you. I'm a little just -- I'm trying to think about how to organize my thoughts. I've had time, but obviously haven't done a good job of that. I'm thinking about what everybody else had to say. I'm struck by, you know -- by what's almost -- I think the word I would use would be sort of tension between the -- you know, the need for the kind of security that we clearly need at this iconic locations. And for, you know, the critical element of design. And how -- how we, you know, I don't want to say fumbled, but how we fumbled around trying to figure out those -- you know, the best strategies for accommodating, you know, those two important things. So I think -- I think the importance of a holistic approach that we've heard along Jefferson Drive and a consistency of approach'",
        "'COMMISSIONER ARGO': 'is probably one of the most important things that we need to pay attention to. And bollards are just -- How many times since I've been on this Commission, which is a short time, have we had -- have we had conversations about bollards, which are -- you know, are not -- for those of us who have actually been involved, you know, in the design field, are not something that are really fun to talk about. So I really appreciate the work that the staff has done in putting together what was a thorough and informative presentation. And this is -- this is one that we're going to struggle with, I think. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Commissioner. Commissioner Wright.'",
        "'COMMISSIONER WRIGHT': 'Well yeah, sometimes bollards are a necessary evil. But I'm not going to spend a lot of time talking about it because Commissioner May has covered all of my comments and then some. And all the areas of concern that I have are reflected in the EDR. But I do -- this is going to surprise a lot of people -- I would like to come to the Smithsonian's defense for a moment here when it comes to holistic planning for the Mall and the flooding and energy issues. I don't think it's accurate to state that -- certainly as individual agency representatives, our agencies have all been asked by Congress to review the National Coalition for the Mall's plan for the underground garage and flood protection scheme and found it wanting. So I don't think it's accurate to suggest that the plan has not had a fair and full'",
        "'COMMISSIONER WRIGHT': 'hearing. A formal hearing at NCPC, I'm not sure is going to yield the results that are hoped for. And moreover, I think it's also inaccurate to suggest that there has been no holistic planning. There has been an interagency working group that has looked at these issues. I know GSA was very much involved because it was our IRS Building that took the hit in 2006. So I just want to correct the record here, that's not exactly accurate. And I don't think that the Smithsonian should be -- should be used as an example of the federal failure to plan. I don't think that's quite fair. I think they've done a pretty good job here. I also share Mr. May's concern with digging under the Castle. I have many times raised the issue. I'm not going to raise it again. I'm still not convince that it's a 100'",
        "'COMMISSIONER WRIGHT': 'percent necessary, but that ship has sailed. So I'll stop there.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Wright. Commissioner Dixon.'",
        "'COMMISSIONER DIXON': ' Yes, I just have maybe two comments. First, I have to talk about bollards. People know me on the Commission for many years. I keep asking where they can be functional -- something functional, rather than just the bollard approach. I'm not sure this would be the place this could be done. But if possible, something that's useful, rather than just a bollard. Secondly, I would like to get clarification from the witness as to what her last point was if I can ask, Madam Chair.'",
        "'CHAIR WHITE': ' Sure. Is Ms. Feldman still available?'",
        "'MS. KOSTER': ' It may just take us a moment. We will --'",
        "'MR. STAUDIGL': ' Actually, she's no longer on the call. She must have left.'",
        "'CHAIR WHITE': ' So Commissioner Dixon, we can always follow up.'",
        "'COMMISSIONER DIXON': ' Yes, I want to be clear as when she asked when we can work with that. Thank you very much. Thank you.'",
        "'CHAIR WHITE': 'You're welcome. Thank you, all for the thoughtful comments and nothing this healthy tension if you will between finding a balance for historic preservation of these very iconic sites and having public space function. In particularly, the balance of protecting buildings and pedestrians and achieving design works. And I really appreciate the work that the staff has done with the Smithsonian. And it is exciting to see things being implemented and the function of restoring these historic landmarks is really so important. So I appreciate the recommendations that highlight the importance of getting the perimeter security right as you all have expressed very eloquently. We know that the layer of perimeter security is going to change this public change and will have impacts on the preservation. And I appreciate that we're all in concurrence that we want to continue to look at this holistically. As Commissioner Wright says, there is'",
        "'CHAIR WHITE': 'a great effort to look and weigh all of these issues in a holistic fashion. So I appreciate those comments. Is there any further comment or question from the Commission?'",
        "'MS. KOSTER': ' Chair White, I just note that Carly Bond with the Smithsonian has her hand up. She's one of the Applicant architects.'",
        "'CHAIR WHITE': ' Oh, thank you. Thank you. Ms. Bond, I apologize.'",
        "'MS. BOND': ' Yes.'",
        "'CHAIR WHITE': ' I didn't see your hand raised.'",
        "'MS. BOND': 'Thank you, Madam Chair and Commission members. I would just like to offer an answer to some of the Commission members questions about the purpose of the perimeter security and its intent to protect both pedestrians on the sidewalk and visitors to our buildings. So, as was noted today in our presentation, both of these buildings are so close to the public right of way. For example, the porte cochere on the north side of the Castle is less than five feet from the curb. So the purpose of the perimeter security is to protect our buildings, but also people coming to visit our buildings and standing inside a secure zone as they line up to queue and go through security and then enter our facilities. And we look forward to coordinating in an interagency working group to discuss this issue further and to continue Section 106 consultation on additional'",
        "'MS. BOND': 'alternatives. So thank you.'",
        "'CHAIR WHITE': ' Thank you so much, Ms. Bond. Is there a motion to approve the preliminary site and building plans?'",
        "'CHAIR WHITE': ' Is there a motion to approve the preliminary site and building plans?'",
        "'COMMISSIONER STEINGASSER': ' I move the'",
        "'CHAIR WHITE': ' Thank you, Ms. Steingasser. Is there a second?'",
        "'COMMISSIONER DIXON': ' Second.'",
        "'CHAIR WHITE': ' Commissioner Dixon, thank you. Ms. Koster, can you please confirm the motion and second and then take the roll?'",
        "'MS. KOSTER': ' Yes. The motion was made by Commissioner Steingasser and seconded by Commissioner Dixon. And with that, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes. Sorry, couldn't find my button.'",
        "'MS. KOSTER': ' There we go. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' And Commissioner Ginsberg?'",
        "'COMMISSIONER GINSBERG': ' Also abstain.'",
        "'CHAIR WHITE': ' The motion is approved. Thank you, everyone.'"
    ],
    "7A. SMITHSONIAN MUSEUMS SITE EVALUATION STUDY ": [
        "'CHAIR WHITE': ' Now we will turn to Agenda Item 7A, an information presentation on the new Smithsonian Museum's Site Evaluation Study. Commissioners will recall that we heard an information several months ago as the study was starting. And I know we're eager to hear an update on this very important effort, so Mr. Flis.'",
        "'MR. FLIS': ' Okay, hopefully everybody can see that.'",
        "'CHAIR WHITE': ' Yes, thank you.'",
        "'MR. FLIS': 'Great. Thank you again. So this, again is an information presentation to provide an update on the Smithsonian site evaluation process for two new museums: the National Museum of the American Latino and the American Women's History Museum. The study will cover both museums and will occur concurrently through the rest of this year. As the Chair mentioned, the Smithsonian provided an introduction and overview of this process back in December. And this presentation review proposed site evaluation criteria, sites under consideration, as well as an overview of stakeholder feedback received thus far. So, just a reminder, the legislation provides that the Smithsonian Institution Board of Regents designate the sites for the museums within two years, which is by December of this year. And that the Smithsonian consult with various agencies and entities, among which includes the Chair of National Capital Planning Commission. The Board of Regents, as I mentioned,'",
        "'MR. FLIS': 'will consult. As a result, NCPC has an advisory role of this process. Following the site selection and transfer, if applicable, of any lands to the Smithsonian, NCPC will have approval authority over the site and building plans for the museums. So, based on the first information presentation and our continued coordination with the Smithsonian staff, we have identified a few initial comments for consideration as this process moves forward. First, it's likely that the study will be relevant for the siting of future museums. Even though it's not yet contemplated, we're under consideration today. As such, we support fully evaluating all the sites on the short list. Some sites may not be viable for these two museums, but they may be contenders in the future. So it may be helpful to think about the feasibility of these sites in terms of the short and medium term versus the long'",
        "'MR. FLIS': 'term. Second, we've found that the evaluation criteria are generally appropriate and thorough. They do capture the range of factors that should be considered. Though we do have -- one suggestion that the environmental considerations be reflected in the potential for building reuse, particularly in thinking about issues like environment carbon and energy efficiency. And then, finally, we do appreciate that the compatibility with NCPC plans is reflected in the criteria. NCPC plans can help guide the placement of museums and help frame the future vision of areas around the National Mall. And while we acknowledge that existing conditions are important, the transformative opportunities of sites around the Monumental Core should also be considered. So, related to this, many of the potential sites that you saw back in December are identified in NCPC plans, ranging from the Legacy Plan to the Museums and Memorials Master Plan, as well as the'",
        "'MR. FLIS': 'Monumental Core Framework Plan. These documents work to create a vision and a setting for new memorials and museums, you know, around the National Mall, transform the federal precinct, and provide opportunities for vibrant and sustainable places to visit, live, and work, all while creating connections between the National Mall, Downtown, and the Waterfront. Most recently, the SW Ecodistrict Plan and the Pennsylvania Avenue Initiative, which you're well familiar with, highlight the transformative opportunities underway in two areas adjacent to the National Mall. And I've highlighted them here on this plan. These areas capture, again, many of the sites that you saw in December. And these sites could serve as catalysts for future change. As you know, Pennsylvania Avenue is symbolic and has a strong civic identity. And the SW Ecodistrict has already seen significant change, including the new Spy Museum, the Museum of the Bible, and the Wharf redevelopment.'",
        "'MR. FLIS': 'As such, all these areas should continue to be evaluated for future museums. So, with that as our background, I will now turn it over again to Mr. Kevin Gover with the Smithsonian for some introductory remarks before they turn it over to the consultant team. Thank you.'",
        "'MR. GOVER': ' Thank you, Mr. Flis. Madam Chair, Commissioners, it's my pleasure to introduce Ronald Cortez, the Smithsonian's new Undersecretary for Administration. In his role, he oversees over 2,000 employees working in human and financial resources, IT, procurement, planning, facilities operations, maintenance and capital programs, health and safety, security, and more. Ron comes to us from the University of California, Irvine, where he served as the Chief Financial Officer and Vice Chancellor of Finance and Administration. Ron brings over 26 years of experience in academia and government administration. Ron?'",
        "'MR. CORTEZ': 'Thank you, Kevin and Mr. Flis. Good afternoon, Madam Chair White and members of the Commission. It is an honor to be here today to update you on our progress in evaluating sites for the new National Museum of the American Latino and the new Smithsonian American Women's History Museum. I'm joined here today by the architects and planners, Luanne Greene and Doug Satteson, of Ayers Saint Gross. New slide. We basically have two phases to the project, and we're coming to the end of our first phase. So far we have brought together stakeholders from each of the museums, held nine focus groups sessions to gain early insights from our constituents as to -- as to the constituents about what their priorities of the criteria and the programming for each of the museums. We've also gathered information and evaluated all 26 sites and identified two tiers of sites. Tier'",
        "'MR. CORTEZ': '1 sites require more -- are more promising and require more evaluation. Tier 2 sites are those that are less likely to meet the museums' needs, having fatal flaws, including some of those that are now undergoing development, are no longer available, and similar types of issues. We've also been able to refine our evaluation criteria, begin weighting of these criteria in order to begin a soft type of break- in of these different sites. And we've advanced our study to look at the feasibility of the Smithsonian Arts and Industries Building, looking at the feasibility and some options and having it be a future museum site. Next slide. Now we're kind of turning more of -- in-between phase one and phase two. We'll be reaching out to leadership of agencies with jurisdictions over the site to discuss apposition potential. Those findings will assist us in ranking of our sites'",
        "'MR. CORTEZ': 'and determining the difficulty of opposition, et cetera. We'll be identifying the smaller group of sites to analyze at greater depth. We continue our stakeholder outreach for each museum with our national surveys, which should begin this month. And we will refine the planning level program for use in tests and studies to refine our site evaluation. It is now my pleasure to introduce Luanne Greene, architect and planner and president of Ayers Saint Gross, and her colleague, Doug Satteson, to present our progress to-date. Luanne.'",
        "'MS. GREENE': 'Great, wonderful. Thank you, Ron. Good afternoon, everyone. Last fall, our team worked closely with the interim directors of both museums and the key Smithsonian staff to develop a series of virtual stakeholder engagement sessions. The findings of this engagement will inform the overall site selection process. As Ron mentioned, there were nine total sessions held over three days between November 30th and December 2nd of last year. In total, about 140 people from all over the United States participated. We discussed a range of issues and used an interactive poll during the meetings to gather data. So, what did we find? Let's start with the National Museum of the American Latino. So, next slide. When we talked about issues such as site amenities, we heard about the overall importance of the visitor experience. In particular, indoor and outdoor gathering spaces. Next slide. When we tossed around the physical location,'",
        "'MS. GREENE': 'our conversations reinforced the importance of a National Mall location. The western end of the National Mall was of particular interest to these groups. Next slide. When we looked at the site potential and talked about those issues, we discussed both new construction and the re-use of an existing building. Next slide. So when we look at the high level themes, in the summer, we heard clearly the importance of the National Mall location. The group was generally open to reusing an existing building if the location was superior. The museum should be welcoming to all. And there's a desire to be experience-driven in combining both collections and programming. Next slide. Let's do the same analysis for Women's History. Next slide. There is a desire to have good visibility to and from the museum with Capitol views if possible. Next slide. Again, our conversations reinforced the importance of the National'",
        "'MS. GREENE': 'Mall locations. In this case, the east of the National Mall is of particular interest. Next slide. New construction is preferred, but if adapted for use is considered, the history of the building needs to be taken into consideration. Next slide. And so in summary again, we heard clearly the importance of the National Mall location. The group was generally open to reusing an existing building if the location was superior. The museum should be welcoming to all. And there's a desire to be experience-driven in combining both collections and programming. That's a quick overview of our early engagement results. Our constituent engagement process is ongoing as Ron mentioned and will include a national survey in the coming month. Next slide. As Ron mentioned, our process groups are sites under consideration into two tiers. Next slide. A total of 26 sites were identified for consideration. Next slide. The tier 2'",
        "'MS. GREENE': 'sites map -- 13 sites were initially identified as tier two sites, meaning that they are unlikely to meet the site criteria established in the legislation. Therefore we evaluated them early in the process. Eleven of the sites are north and south of the National Mall. Next slide. Two of the sites are further out away from the National Mall. Next slide. The evaluation criteria is obviously critical. We have six high level criteria. Each of the six has additional sub-criteria. The sub- criteria are weighted to reflect critical, important, or desirable characteristics. Doug, can you walk us through the evaluation?'",
        "'MR. SATTESON': 'Sure. Thanks, Luanne, and good afternoon, everyone. Next slide, please. So, we have five criteria that we have defined sub-criteria for, currently, and one criteria that will be further evaluated as the project moves forward as Smithsonian engages agencies with jurisdiction of other sites. So, with the local location criteria, we looked at the proximity to the National Mall, prominence of site location -- is the site visible and can it represent the constituent group of the museum? The significance to constituent groups, visitation potential and proximity to outside museums, and preservation of key views and sight-lines. As you can see on this slide, there are sub-criteria that relate -- or definitions of those sub-criteria that relate to good, moderate, or poor, and how we were considering the criterias. Next slide, please. Cost factors. At this level, we've looked at site preparation and demolition, construction and complexity. What factors may'",
        "'MR. SATTESON': 'add to the complexity of construction? Does the site have existing infrastructure that can be a cost benefit? And then timeframe and escalation. So the transfer or purchase of sites, if need be, which impacts the design and construction schedule. Next slide, please. And existing site conditions. So, the total and buildable acreage of the site, the building area on that site to fit the required program, the opportunity for outdoor program capacity. Can the site accommodate outdoor programming at Smithsonian Gardens that supports the museum's missions? And then security and risk assessment. Conditions that require the museum to increase the level of security above other sites. Next slide, please. Continuing on with existing site conditions. Opportunity for architectural expression. Can the architecture express the museum's identity or mission? Potential for interior design flexibility --'",
        "'MS. KOSTER': ' Excuse me just a minute. Commissioner -- I think Commissioner Dixon is having a technical issue and is trying to fix it. But I would ask our IT representative, Tony Champ, to please turn off Mr. Dixon's screen. If you don't mind holding. And I apologize for the technical difficulty here. And Mr. Flis, if you could screenshare again. And again, I apologize, Mr. Satteson.'",
        "'MR. SATTESON': 'Oh, thank you. The opportunity for sustainable design and climate resiliency was also started to be considered. And this was also starting to take into account things such as climate, carbon impact, and such. And is the site compatible with NCPC, DC, and National Park Service plans? Next slide, please. And then transportation. So, service access and loading. Can the site accommodate Smithsonian or District of Columbia requirements? Access to public transit infrastructure and the proximity to the site. The walkability. Is the site nearby other Smithsonian museums, landmarks, and amenities? Tour bus drop-off potential for large groups. Next slide, please. Other vehicle access, such as rideshare or personal vehicles, Capital Bikeshare, and then the proximity to public parking. And then environmental criteria. We'll evaluate subsurface conditions, one of those being the water table and such, and flood vulnerability and is it in the flood plain, or susceptible to flooding'",
        "'MR. SATTESON': 'after periods of short intensive rainfall. And then air quality and noise levels, whether the site is susceptible to a poorer air quality or higher decibel levels compared to the other sites. Next slide, please. And then as I mentioned previously, acquisition potential, which will be studied further in the upcoming meetings between the Smithsonian and existing agencies with jurisdiction. Thank you.'",
        "'MS. GREENE': 'Great. So the criteria was applied to the Tier 2 sites. Next slide. The summary analysis affirmed that the sites are not able to meet the site criteria established in the legislation; therefore, we are recommending that they be dropped for consideration. Next slide. Many of these sites are unable to accommodate the museum program. In some cases, ownership has changed since the initial identification of the site. Agencies with jurisdiction have plans or have reinvested in the sites. One of the original 13 Tier 2 sites was recently moved up to Tier 1 status during the process, so you will see a reference to the Bureau of Printing and Engraving Print Annex, which is returning to the GSA surplus status in the future. Next slide. That was a summary of our findings on the Tier 2 sites. Our work on the Tier 1 sites continues. These are the sites'",
        "'MS. GREENE': 'considered most likely to meet the site criteria. We have advanced our work on one site in particular -- surprise, surprise -- the Arts and Industries Building. Next slide. Obviously, we just talked about it in great detail, but suffice it to say the Arts and Industries Building is an amazing building with a premiere location directly on the National Mall. The Smithsonian controls it, owns it; therefore, it has an obvious advantage of availability as a museum site. The AIB is a historic treasure, but it has limitations as a museum. And we'd like to walk through the why of that, why is that a challenge? Next slide. I think I'm off one; could you go back one? Thank you. The first issue is the size and the shape of the space. The AIB is a great location but is not large enough to house the museum program currently'",
        "'MS. GREENE': 'identified. The second issue is the program size and environmental conditions. For all the sites evaluated, we're thinking about how the programs of a museum would be accommodated. For AIB this is critical, because the environmental controls within the building are limited. That means in order to appropriately house public collection spaces we need to create some areas with precision humidity and temperature control. Next slide. So, what options exist to overcome that limitation? We looked at three options. The first option is to simply accept the limitations of the existing building and reduce the size and makeup of the museum program to fit the building. The result would be the smaller facility with limited public collection space but a great location. Next slide. The next two options explore the ways to expand the building. In this option we looked at going down within the existing footprint by adding an'",
        "'MS. GREENE': 'additional basement level, in addition to the one you just talked about. This is an expensive option but not impossible. This would increase the public collection space but still fall short of our benchmark program. Next slide. Not surprisingly, excavating an additional basement pushes the building into the water table. So, again, going down is not impossible but it comes with cost and risk from the water table and it still doesn't satisfy the benchmark program. Next slide. The last option looks at expansion to the south. It creates a scenario that takes advantage of the AIB's front door on the Mall, uses the existing main floor space for non- collections programs, expands via a tunnel under Independence Avenue, and locates additional program space in a new building on the existing forestall building The new space could include public collections and other spaces needed to meet the benchmark program. Of'",
        "'MS. GREENE': 'course, this means the acquisition of the Forrestal building would be required, which would mean additional costs and time. Next slide. So, that was a high-level summary of the types of test fits and scenario planning we are incorporating into our analysis. Our work is ongoing for AIB and the other Tier 1 sites. Next slide. As that ongoing work continues and comes into focus, we will compile site ratings for comparison. Next slide. Let's take a look at the Tier 1 sites. These 14 sites are primarily south of the National Mall. The FBI and Northwest Capitol sites are north of Pennsylvania Avenue. A few sites do not have existing buildings. Other sites would be cleared through demolition of existing structures, and others have historic buildings that would remain and require exploration as to the level of modification needed to house a museum program within them. These sites represent'",
        "'MS. GREENE': 'a wide range of sizes, conditions, and capacities. And as we saw in our AIB example, it's easy to see that some sites may benefit from being combined. Next slide. As we apply the evaluation criteria and crunch the numbers, we are currently able to consistently evaluate five of the six criteria that Doug just walked through. The sixth high-level criteria, acquisition potential, is not yet fully defined. It will be further developed next month through discussions between the Smithsonian and the external agencies with jurisdiction so you can see only AIB has a score under acquisition because it already has a site. Next slide. Here's an early detailed review of the Arts and Industries Building, just as an example of what we'll be working on next, what we're up against next. Next slide. So, our next steps are to finalize our Phase 1 report in Phase 2 to incorporate'",
        "'MS. GREENE': 'some leadership input on acquisition potential and strategy to address feedback from external stakeholders, to reduce the number of sites further to focus on the best options, further develop architectural programming and site evaluation, and to continue the constituent engagement including a national survey and site tours. And I think that wraps us up, I think the next slide is questions, thank you very much.'",
        "'CHAIR WHITE': ' Thank you, Mr. Flis, Undersecretary Gover, Undersecretary Cortez and Mr. Green and Mr. Satis for such a comprehensive presentation. Do the Commissioners have any questions? Hearing no questions, I will open it up. Excuse me, is there a question?'",
        "'COMMISSIONER MAY': ' Sorry, there was a really quickly reference to the Bureau of Engraving and Printing, and I was wondering what was said about that one and why it was eliminated. Could it have been repeated? Because it seemed like a pretty promising site.'",
        "'MS. TROWBRIDGE': ' I can address that, Mr. May. I'm Ann Trowbridge, Associate Director for Planning. We are including the Bureau of Engraving and Printing facility, the Print Annex, I believe it's called, moving it up from Tier 2 to Tier 1 for further study in our next door phase.'",
        "'COMMISSIONER MAY': ' That's a little confusing but I'm glad to hear it.'",
        "'MS. TROWBRIDGE': ' Thank you.'",
        "'COMMISSIONER MAY': ' Thank you.'",
        "'CHAIR WHITE': ' Any other questions for our presenters? If there are none, I will now open it up to the Commission for discussion starting with --'",
        "'COMMISSIONER WRIGHT': ' I had a question, I'm sorry.'",
        "'CHAIR WHITE': ' Commissioner Wright, I was going to call on you first so why don't you go ahead and ask a question and start us off on the discussion?'",
        "'COMMISSIONER WRIGHT': ' You might have answered this and I missed it. I'm sort of unclear on the weight of the criteria, but of course I have to ask this as a GSA person. Several of the buildings on the list are subject to very recent significant investment. Is that a criteria? And how much weight does it have? For example, I see the regional office building has been bumped off the list or bumped down on the list and I suspect that's in part because it's the subject of a great deal of investment currently for occupancy by another federal agency. How much does this matter?'",
        "'MS. TROWBRIDGE': ' I can speak to that. We will, Commissioner Wright, be taking that into account and discussing in conversations with the senior leadership of the Smithsonian and agencies with jurisdiction. We've learned a bit from the staff we've contacted that you've helped us connect with regarding which ones are consolidating and renovating. Certainly, in terms of the total cost to the Smithsonian and to the taxpayer, relocating an agency that's just renovated its space is an added cost the needs to be --'",
        "'COMMISSIONER WRIGHT': ' You're going to that on a number of sites, the Yates building included was a total building renovation for the first service -- oh, gosh, I've lost track of time but it's been in my tenure. Maybe 2014-ish. The whole building. So, obviously, relocation of an occupied facility isn't going to be cheap but compounding that by recent significant investment I hope will be weighed in the process, just for the total cost, because that's not insignificant. Some of it is on the books and hasn't been. So, an investment in design is one thing, investment in design and construction and complete renovation that's already been done is another. And I just wanted to raise that as an issue.'",
        "'CHAIR WHITE': ' Undersecretary Cortez, I see you have your hand raised.'",
        "'MR. CORTEZ': ' Yes, and Commissioner Wright, actually the only debt, as Anne mentioned, is in the area of cost. And also there's another criteria there that you may see as acquisition potential, which is also another factor which gives us the flexibility to look at those kinds of issues. So, for example, the AIB would be a much easier one to acquire since we already own that one. And the levels of difficulty, that impacts the site as well. So, the site could be really good with the difficulty of the acquisition. And what you just mentioned is a very important point that would impact that criteria.'",
        "'CHAIR WHITE': ' And Ms. Trowbridge, I didn't mean to cut you off. Did you have something more you wanted to add?'",
        "'MS. TROWBRIDGE': ' No, Undersecretary Cortez covered our information there.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Wright, any further comments you want to share on the presentation?'",
        "'COMMISSIONER WRIGHT': ' No, I've been paying attention to this as we go so I won't take up the Commission's time.'",
        "'CHAIR WHITE': ' Commissioner Dixon? It seems Commissioner Dixon may still be having technical issues. We'll go to Commissioner Cash? Commissioner Dixon, you're back.'",
        "'COMMISSIONER DIXON': ' I am, no questions at this time.'",
        "'CHAIR WHITE': ' Commissioner Cash?'",
        "'MS. KOSTER': ' I believe Commissioner Cash had to step away momentarily, he will return to the meeting.'",
        "'CHAIR WHITE': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Yes, thanks for this presentation and important topic. I look forward to hearing more about the constituent engagement into the future but I appreciate the conversation, thanks.'",
        "'CHAIR WHITE': ' Commissioner Ginsburg?'",
        "'COMMISSIONER GINSBERG': ' We're also very interested in a lot of those properties so great presentation. It's great to see how we'll move forward with these decisions.'",
        "'CHAIR WHITE': ' Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' I also want to acknowledge a great presentation that was very helpful. I think there's a lot of excitement in having two museums moving at the same time. There's the ability to create some real -- not synergy but critical mass in creating a new expansion area. Thank you, that's all I have.'",
        "'CHAIR WHITE': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Great presentation, I've got no comments at this time, thank you.'",
        "'CHAIR WHITE': ' Commissioner May?'",
        "'COMMISSIONER MAY': 'Thank you, I will have a lot to say about this as we get further along the process, because we're just getting a little taste of it now. We're understanding what the process will be and certainly, many of the sites that are under consideration I think will provoke a lot of discussion within NCPC and any other agencies who will be involved, including the National Capital Memorial Commission, which is chaired by the Director of the Park Service and actually is represented by me. So, that will happen on March 21st so we will have another look at this at that point. As I said before, I'm very encouraged to know that the Bureau of Engraving and Printing might be back under consideration, because I think that's a site that has tremendous potential. I know that some of you aware of this but there are some complications with some'",
        "'COMMISSIONER MAY': 'of the site selections because of the odd language in the authorization that encourages Mall locations but also is keeping in the Reserve and some of those sites are undesirable. But we don't need to go into details of that, it's exciting to have this going and I agree with Mr. Steingasser that the potential of two museums is very different from I think the last time we went through this. And there's this potential to create a new critical mass, perhaps in a new location, and certainly approximate to the Mall, but also right into some nearby areas that maybe need a little bit of energy. So, I'm excited about that, and now I have to stop myself because I could just keep going on. But thank you so much, I appreciate it, and I'll save my other comments for the NCMAC meeting on the 21st.'",
        "'CHAIR WHITE': ' Thank you, Commissioner May. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' It was a lot to take in, and it's exciting, and I don't think, since my term on the Commission, we've seen anything quite like this. So, I'm excited about the -- you know, as we move forward, about the potential, and some of the other things we'll be looking at on the Commission as the site comes before us. So, I appreciate all the work everybody is doing on this. There's a lot of different folks involved and I appreciate it. That's it for today. Thanks.'",
        "'CHAIR WHITE': 'Thank you. I echo everyone's comments. I continue to be impressed by the scale of this analysis and the task that's in front of the Smithsonian and the museum sponsors. And I imagine this will not be the last two museums approved by Congress, so I do encourage the Smithsonian to continue their thoughtful analysis and dig deep in the evaluation of the short list of sites. Some of these sites, as folks have notes, may not work this time around but they could be good contenders for the future and we appreciate that you're thinking about that. And it's likely that, by the time these museums are built, Pennsylvania Avenue's transformation will be underway and additional development and public space improvements will have occurred along Tenth Street, to Banneker, and the Wharf. As Commissioner May said, museums can be great catalysts for these types of activities as well and'",
        "'CHAIR WHITE': 'we know there are some areas that could be wonderful locations so we appreciate that you're taking a look at that. So, thank you for the briefing, I look forward to seeing your analysis and recommendations at the next briefing and I really appreciate you joining us today.'",
        "'MR. CORTEZ': ' And on behalf of the Smithsonian, thank you very much for your time and review.'",
        "'CHAIR WHITE': ' Thank you. And now we will move on to Agenda Item 7B, which is an information presentation on the Bezos Learning Center at the Smithsonian National Air and Space Museum. And with us again is Mr. Flis.'",
        "'MR. FLIS': 'Thank you, this is the last information presentation for today. This is another presentation from the Smithsonian regarding an upcoming project called Bezos Learning Center, which will be located at the Smithsonian National Air and Space Museum. The Smithsonian did receive a donation from Jeff Bezos to establish the Center within the Smithsonian and it will be housed in a new facility to be constructed on the east side of the museum. For future programs and activities related to innovation and careers and science, technology, engineering, arts, and mathematics. The purpose of today's presentation is to provide the Commission with an overview of the project. So, just for reference, and I think everybody is familiar with the Air and Space Museum located on the National Mall just north of Independence Avenue, you can see the main building highlighted here. And then this is the site of the proposed center. This'",
        "'MR. FLIS': 'is a restaurant addition which was constructed separately from the main building. And then here you can see an addition and a foreground, the main museum building in the background just for context. So, the Smithsonian is going to be advancing the demolition of the restaurant addition prior to replacement and NCPC doesn't review demolitions but will review the new structure when it's designed. The Smithsonian started a consultation on a project for the site back in 2020, initially looking at whether this addition could be repurposed. They also have completed a study and determined that the structure was not historically eligible. I'll note we have received some correspondence regarding the Section 106 process, which is in your package today. With that, I'm going to turn it over to Carly Bond, who is a preservation specialist with the Smithsonian who is going to kick off their presentation. Thank you.'",
        "'MS. BOND': 'Thank you, Mr. Flis, and good afternoon again Madam Chair and Commission Members. My name is Carly Bond, I'm a historic preservation specialist with Smithsonian facilities. We're sharing with you today an exciting update on the plans for the east end of the National Air and Space Museum, the National Mall building. While this part of the site is not part of the current construction project, our long-range plan for Air and Space that we briefed the Commission on many years ago will be realized by the space project, which includes the demolition of the restaurant initiatives, as Matt just said, and the design and future construction of the Bezos Learning Center. Next slide, please. I'm here today with Rick Flansburg, Associate Director of Collections, Archives, and Logistics at the Smithsonian Air and Space Museum to provide background information on the projects, an overview of the Bezos Learning Center, and'",
        "'MS. BOND': 'to review the Section 106 process and agreement document that will address the phases of the East End project. Next slide, please. The National Air and Space Museum opened to the public in 1976 as part of the nation's bicentennial celebrations with an important connection for this project to be completed in 2026, the nation's 250th anniversary. Air and Space is a modernist-style building but designed by Gyo Obata of Hellmuth & Kassabaum. Air and Space is considered a significant historic building designed without precedent to house a nationally important collection of artifacts documenting the history of flight and space travel. Air and Space is a contributing element of the National Mall Historic District and is eligible for individual listing in the National Register of Historic Places. Next slide, please. A glass-enclosed restaurant, pavilion addition, was also designed by Obata and constructed in 1988 at the East End of Air'",
        "'MS. BOND': 'and Space. The restaurant addition replaced the original interior public dining facility that was on the museum's third floor and the restaurant ceased operation in 2017. Next slide, please. Air and Space is currently under construction for a project titled Air and Space Revitalization, which replaces the building's exterior stone and glass cladding and constructs a security vestibule addition on the north side of the museum. This project was approved by NCPC in April 2018, and the Smithsonian is conducting construction in two phases. The first phase, the west end, will open to the public in fall of this year and the second phase, the east end, will start construction this year and will close to the public in the spring of 2022. So, the entire museum will reopen to the public in 2025. The revitalization project did not include changes to the restaurant addition, aside from recladding its vestibule'",
        "'MS. BOND': 'connection to the museum building. The revitalization project does include alterations to the east terrace, including installation of concrete pavers, recladding the planter site walls, and landscaping. Next slide, please. So, these images depict the east end of the Air and Space building and the restaurant addition, which is elevated above the grade of Fourth Street, Southwest. After careful evaluation, the restaurant addition was determined non-contributing to the historic significance of Air and Space, and we'll discuss these findings in detail later in today's presentation. Now I'd like to introduce Rick Flansburg for an overview of the Bezos Learning Center. Next slide, please.'",
        "'MR. FLANSBURG': 'Thank you, Carly, and thank you, Madam Chair, the Commission, Mr. Flis, for time today in your busy agenda. As noted, my name is Rick Flansburg and I'm an Associate Director at National Air and Space Museum. I'm pleased to provide a brief introduction to the Bezos Learning Center this afternoon. We have conceived of the Bezos Learning Center as a nexus for creativity, problem-solving, and innovation to take place, making learners and educators to the unparalleled collection of the National Air and Space Museum and its unique location on the National Mall. As we proceed with our programming and design, we will pursue a building that will imbue the sense of wonder, curiosity, discovery, and energy that are the foundational elements of the program's plan to take within and around it. Next slide, please. In July 14, 2021, the Smithsonian announced that it would be receiving the largest philanthropic'",
        "'MR. FLANSBURG': 'gift since its founding from Mr. Jeff Bezos. A portion of the gift supports the new exhibits within the museum which we referred to as transformation. The bulk of the gift provides for the construction, staff, and operations of a world-class center for education-based air and space. The next few slides outline the pioneering design for the building, which is planned to be located at the side of the current restaurant, as was noted. Additionally, the Smithsonian expects to include some complementary item on the east terrace which I will expand on shortly. Next slide, please? We had initially conceived of an education center in our 2013 Air and Space Master Plan. This visionary addition was beyond our ability to pursue at the time. We plan to take this opportunity to make some improvements to our loading dock in the basement, replace the aging and problematic restaurant, and pursue a'",
        "'MR. FLANSBURG': 'permanent solution to our popular observatory. Next slide, please. This list captures the major projects that we plan to pursue in support of the Learning Center. Carly will provide some additional information regarding the restaurant demolition in Section 106 in a few minutes. The loading dock challenges are listed here, which will be studied, how best to optimize the associated basement spaces. The Learning Center itself is expected to be located with the main entrance from the second floor of the museum. We believe the functions of the Center will provide two floors and will include a terrace. Lastly, we plan to replace our popular temporary observatory and support that within a stronger new port. Next slide, please. Over the next few months, we will begin a thorough review and refinement of the spaces needed to support the programs and the Learning Center, their adjacencies and integration with the Museums'",
        "'MR. FLANSBURG': 'and various supporting functions. We have begun that process of identifying an architectural design team. A full and open solicitation was open in January and we recently received the initial submissions for review. We will identify a short list of the highly qualified firms and invite them to submit a design concept and participate in the second phase of the selection process. We will concurrently select for restaurant vendors. We intend for them to participate with us in the design process. Lastly, we plan to utilize a construction methodology to allow the contractor to participate in finalizing the design, and to pursue some early construction packages such as site utilities and the like. As I turn the presentation back over to Carly, I note in closing that the new Bezos Learning Center will be a pan-institutional resource that will be overseen by the Associate Director for Education during the experience.'",
        "'MR. FLANSBURG': 'A priority focus of its programs will be to reach traditionally underserved communities in Washington D.C. and across the nation both at the site of the new facility and virtually, as the Center will employ the latest technological resources and developments available for student and educator engagement. Thanks again for your time. Next slide, please. So, we would now like to present the Commission an overview of Section 106 consultation for the National Air and Space Museum East End Project. The Smithsonian conducted Section 106 Consultation in accordance with the National Historic Preservation Act evaluating the historic significance of Air and Space. The restaurant addition and other later changes in how Air and Space contributes to and how this project affects the National Mall Historic District, which resulted in a programmatic agreement that oversees the demolition of the addition and the design and construction of the Bezos Learning Center. Next'",
        "'MR. FLANSBURG': 'slide, please. As we've discussed, Air and Space is a contributing element of the National Mall Historic District listed in the National Register of Historic Places. The National Register documentation for the Mall Historic District places Air and Space's significant dates as 1972 to 1976, which means that the 1988 restaurant addition does not contribute to the significance of the building. Concurrent with the planning and design for the Revitalization Project that is currently under construction, the Smithsonian evaluated Air and Space's individual eligibility for listing in the National Register and it was determined eligible. As part of Section 106 process for this project, the Smithsonian reevaluated the determination of eligibility and the significance of the restaurant addition, seeking input from consulting parties, which are members of the public with a demonstrated interest in the project. Next slide, please. For an overview of our consultation on the East End project'",
        "'MR. FLANSBURG': 'to date, we initiated one of six consultations in May 2020 at which time this project consisted of the demolition and replacement of the restaurant addition with a new dining facility. We held our first public consultation meeting in September of 2020 where we provided an overview of the project purpose in need and presented the findings from that determination of eligibility. And after a public comment period and revisions to the document, it was finalized. And this project was placed on hold in early 2021 and dining facility concept designs were not developed. And in July of 2021, the philanthropic gift was received and the project changed scope to the demolition of the addition and the design and construction of the Bezos Learning Center. We held our second public consultation meeting on October 19, 2021 to review the new direction of the project and a draft assessment of effects'",
        "'MR. FLANSBURG': 'on historic resources report with the determination that the demolition of the restaurant addition has an adverse effect on historic properties and we'll review this determination later in today's presentation. And then in December of 2021, the Smithsonian Institution, the D.C. State Historic Preservation Office, and the National Capital Planning Commission drafted a programmatic agreement for this project, which was reviewed by consulting parties in February of 2022. We expect for the programmatic agreement to be executed this month. Next slide, please. The purpose of the determination of eligibility is to evaluate Air and Space's individual eligibility for listing in the National Register. Air and Space is eligible under National Register Criteria A, C, and Criteria consideration G with a period of significance of 1976, which was the year the museum was completed. The restaurant addition and other later site and building changes post-1976 are compatible with the character of'",
        "'MR. FLANSBURG': 'the building and site but do not contribute to Air and Space's eligibility for the National Register. Air and Space is individually eligible under Criterion A, which is for properties that are associated or linked to events that have made significant contributions to broad patterns of American history. Air and Space reflects the evolution of the Smithsonian Institution in the second half of the twentieth century in which the institution rapidly expanded and diversified and modernized its collections. So, Air and Space is nationally significant for its collection relating to the history of Air and Space technology. Air and Space is individually eligible under Criterion C for properties that embody the distinctive characteristics of a type, period, method of construction, or that represent work of a master or possess high artistic values. Air and Space is considered an outstanding example of modernist architecture by a recognized master in the field,'",
        "'MR. FLANSBURG': 'Gyo Obata. The design of Air and Space successfully integrates contemporary architectural and engineering technologies with the cross influences of the National Mall, accommodating the museum program without precedent in a highly regulated setting. Air and Space meets Criteria Consideration G, which is for properties that have achieved significance within the last 50 years, which is a benchmark generally observed for the evaluation of historic properties. Now, the determination concluded that unlike the museum building, the 1988 restaurant addition has not yet obtained the level of significance needed to meet exceptional importance under Criteria Consideration G. This is due to the recent date of the addition and similarities in the design of the addition with other major Hellmuth, Obata & Kassabaum commissions of the 1980s, which also feature widespread use of glazing, space reconstruction, and step through step elevations which make it difficult to argue that the restaurant addition is'",
        "'MR. FLANSBURG': 'a singular exceptional example of Obata's work. And finally, circling back to Criterion A, Air and Space is nationally significant for the development of its museum program, for the conservation, display, and interpretation of collections relating to the history of Air and Space technology. It's important to consider the purpose of the restaurant addition under this criterion. The restaurant addition has a separate function outside the mission of the museum and the Smithsonian for the increasing diffusion of knowledge and its development is not an expansion of the exhibitions and programs for which Air and Space is eligible. Now, that was a lot of information for one slide but there is an important distinction to make for the National Mall Historic District. I will talk about that next and so Air and Space is a contributing element of the Mall, but only under Criterion A for the period 1791 to'",
        "'MR. FLANSBURG': 'the present. Next slide, please. It's important to note that during Section 106 consultation, consideration was given to the retention of the restaurant addition and the alterations that would be needed to correct building deficiencies. The restaurant addition does not meet required last criteria or structural codes and it has deficient mechanical systems that harm collections with functional inefficiencies resulting from excessive solar heat gain inside the structure that make its museum level unusable. The existing restaurant addition is also undersized and cannot accommodate the required program square footage of the Bezos Learning Center without major modifications which have to house the Bezos Empowering Educators Program and the Bezos Science and Technology Innovation Challenges. Next slide, please. During consultation, the Smithsonian completed an assessment of effects on historic resources which analyzes the effects of the projects on historic properties. The National Mall is nationally 1 2 3 4 5 6'",
        "'MR. FLANSBURG': '7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 significant under Criterion A, which is for properties associated with broad patterns of American history in the areas of entertainment and recreation, ethnic heritage, politics and government, education and social history for the period 1791 to the present. The National Mall is the location of the Legislative and Executive Branches of government, the location of political and social demonstrations and presidential inaugurations, and the location of continuing recreation through museum and memorial visitation. The contributing buildings, site structures, and objects within add to the historic associations and values for which the National Mall Historic District is significant. The Smithsonian buildings, National Gallery buildings, and other federal buildings form the boundaries of the main gathering space of the National Mall with roof lines on the monumental building masses forming the backdrop for the Mall's associations'",
        "'MR. FLANSBURG': 'with Criterion A. The demolition of the restaurant addition changes the National Mall setting and results in adverse effect on historic resources. This unique period of significance, 1791 to the present, means that new structures such as the Bezos Learning Center have to be designed and constructed to immediately contribute to the Historic District and the National Mall setting. Next slide, please. The National Mall Historic District contains views and visual relationships that contribute to the significance of the National Mall. The location of Air and Space is noted with the blue rectangle on this aerial image and the significant views and vistas are noted with yellow arrows and these include reciprocal views east and west between the Washington Monument and the Capitol and north south vistas. The 6th and 4th Street vistas are connected with Air and Space. The restaurant addition is directly visible within the 4th Street vista,'",
        "'MR. FLANSBURG': 'as shown in the photograph on the lower right of this slide. And the demolition of the addition has an adverse effect on the vista setting. Next slide, please. A programmatic agreement, or a PA, is a type of Section 106 document that governs the resolution of adverse effects from a complex project like the East End and governs the implementation of the entire project from the demolition of the restaurant addition through the design and construction of the Bezos Learning Center. The PA notes the design and construction of the Learning Center has the potential to result in adverse effects in the National Mall Historic District and other historic properties, and in current stipulations that the Smithsonian will ensure are carried out. The PA identified mitigation measures for the demolition of the restaurant addition which include record documentation, the maintenance of the East End project webpage, and an interpretive'",
        "'MR. FLANSBURG': 'signage panel on the history of Air and Space and East End installed somewhere in the East Terrace. That interpretive signage location will be developed concurrent with the design of the Learning Center. Other PA stipulations describe the Bezos Learning Center future consultation with information on program on the learning center design framework, Section 106 consultation and procedures and schedule. Next slide, please. We'd like to talk a little bit about some of the more important stipulations in the programmatic agreement, starting with the Bezos Learning Center parameters including that the Bezos Learning Center will be housed in a new building addition at the East End of Air and Space. The Learning Center addition will propose a comparable footprint to the existing restaurant addition which is based on site limitations from the loading dock, grade changes, and other items on the East Terrace. The Learning Center program requires a total'",
        "'MR. FLANSBURG': 'of 50,000 square feet anticipated to be housed on two levels above a ground floor restaurant space. The restaurant space will be accessed through the ground floor of the museum and the Learning Center will be accessed through a connection at the second floor of the museum. There will be a small event space on the addition roof to accommodate 100 to 150 people for educational programming and events. Section 106 consultation on the Bezos Learning Center will establish a permanent location for the Phoebe Waterman Hass Public Observatory in the southeast area of the site and an exterior astronomy park on the East Terrace. The outside astronomy park is intended to feature interactive exhibits to connect visitors to astronomy and planetary science. The overall project will consider the design of the Learning Center addition, observatory, astronomy park as a cohesive system considering site features on the East Terrace and'",
        "'MR. FLANSBURG': 'the Revitalization Project's comprehensive landscape design. The programmatic agreement also contains stipulation language on the Learning Center design framework requiring the following to be considered in the development of design concepts. Design concepts must respect the formal setting of the National Mall and the neighboring museums. Design concepts must respect the Air and Space building and respond to its architecture and massing. Design concepts shall meet the Secretary of the Interior's standards for the treatment of historic properties for rehabilitation. Design concepts must carefully consider the Learning Center's addition's physical connection to Air and Space and materials. And finally, design concepts must consider and respect contributing vistas of the Mall Historic District including the 4th Street north-south vista, the east-west view shed, and the building line established by the Plan of the City of Washington. Next slide, please. The PA contains stipulation language regarding Section 106 consultation processes and procedures'",
        "'MR. FLANSBURG': 'or next steps. So, after the Smithsonian has completed the development of schematic design alternatives, the Smithsonian will formally re- initiate the next phase of Section 106 consultation. Consulting parties and the public will continue to have opportunities to participate in the project with an established schedule of critical dates and identify opportunities for consultation and office and we will maintain a project-specific website. The Smithsonian shall consider the adverse effects from design alternatives and use this analysis to inform the selection of the preferred alternative. The Smithsonian will consult to identify ways to avoid, minimize, or mitigate adverse effects with agreed upon measures formalized in a separate memorandum of agreement. And finally, the programmatic agreement contains stipulation language regarding the project schedule, the demolition of the Air and Space restaurant addition will begin in the Spring of this year. Section 106 consultation on design of the Bezos Learning Center'",
        "'MR. FLANSBURG': 'is expected to begin early 2023. The target construction start is 2024 with a target completion date of 2026. The programmatic agreement is in effect for eight years and should the Smithsonian not initiate construction activities for the Learning Center within a six-year period from the date of execution of the document, the Smithsonian will pursue an alternative project that restores public use of the East Terrace. This schedule is subject to change with notification. Next slide, please. This brings us to the end of our presentation and we appreciate the opportunity to speak with the Commission today regarding the National Air and Space Museum East End Project and we are available for any questions that you might have. Thank you very much.'",
        "'CHAIR WHITE': ' Thank you, Ms. Bond. Mr. Flis and Mr. Flansburg, we really appreciate the thorough presentation and walking us through the nuances of the 106, that was really very helpful. I'll now open it up to the Commission for discussion. I will start with Commission Argo and then go in a round robin format. Please keep your webcams on and if there are any questions, maybe I should ask that first before I start with Commissioner Argo. Hearing no questions, Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I don't have any questions at this time. I'm sitting here taking mad notes and it's a lot of information to take in, but it's very exciting. The Air and Space Museum is one of the first places I visited when I moved to this wonderful Washington D.C. many, many years ago. It's exciting to see the opportunity this presents. I can't think of anything better than the Learning Center to make this available, the museum available, in an educational way. So, it's exciting, it's really exciting. Thank you.'",
        "'CHAIR WHITE': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I guess I do have a question because this is a consultation process that I have not been following and now I wonder if I should have because that was the pretty thorough, long presentation. And I have to ask so I can infer, I think we can infer, from that there was some pushback. And just to ask, could you give us a very quick dirty summary of what the resistance was about? It never occurred to me to follow the consultation because I didn't anticipate a big brouhaha about this.'",
        "'CHAIR WHITE': ' Commissioner Wright, would you like Mr. Flis to take a stab at that?'",
        "'COMMISSIONER WRIGHT': ' Whoever can stab it is fine with me. I just want a direct answer. Instead of being super diplomatic, let's just get right to it because it seems like a long presentation, and the Smithsonian went to a lot of effort to outline the process. So, that says to me there was some friction about this and it never occurred to me that would be.'",
        "'MR. FLIS': ' Yes, there was some discussion about the contents of the determination of eligibility, some of the nuances. I'll actually defer to Ms. Bond to talk about it more since she's been more involved in that.'",
        "'MS. BOND': 'We wanted to spend the time today to really explain to the Commission the efforts that went into analyzing the historic significance of both Air and Space but also how Air and Space contributes to the National Mall under Criterion A, but isn't something that gets a lot of attention. I think consultations often really focus around Criterion C, which is really not up for discussion here because of the National Mall documentation and how Air and Space contributes. That's why I wanted to spend a lot of time talking about it today. This project actually did not result in a significant amount of comments from consulting parties. There was one consulting party in particular, it's the organization Docomomo, which is involved with the documentation and conservation of the Modern Movement. And some of their concerns about the determination of eligibility were that they didn't agree with our interpretation of'",
        "'MS. BOND': 'the restaurant addition being separate and how -- sorry I'm fumbling a little bit, it's hard to explain in some ways -- how Air and Space is eligible for the National Register. So, it's nationally significant for its collection and for the expansion of the Smithsonian Institution, not because it has a restaurant attached to it.'",
        "'COMMISSIONER WRIGHT': ' Got that, that seems very clear to me, that's why I'm asking, because it seems like the issues are not difficult to slice and dice.'",
        "'MS. BOND': ' There is one other issue I'd like to just point out that they've raised with the Commission and also with the Smithsonian. Air and Space had a very long development history. It took many, many decades of planning and various designs that were shelved and not developed, a lot of different architects and important figures in the modern movement that were associated with Air and Space. The Smithsonian doesn't find them compelling reasons and in accordance with National Register criteria to change that period of significance date.'",
        "'COMMISSIONER WRIGHT': ' Right.'",
        "'MS. TROWBRIDGE': ' Commissioner Wright, I would add also that we were surprised to learn that NCPC did not approve demolition of projects such as the restaurant wing. And so in consultation with Diane Sullivan, we felt we had to give the public and your Commission thorough accounting of what we're doing before that happens. Chair White: And Ms. Trowbridge, I recognize your voice, I saw your camera went off but I wanted to make sure folks knew who was speaking, so thank you for that.'",
        "'CHAIR WHITE': ' Ms. Wright, does that answer your question?'",
        "'COMMISSIONER WRIGHT': ' Yes, it does, thank you.'",
        "'CHAIR WHITE': ' Any other comments? Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' The presentation sounds great and I'm looking forward to having a meal in a restaurant at some point.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Great presentation, I guess we'll all be missing that McDonald's that we all think of so fondly from having to get through the lines and sit with massive groups of children, but it looks like this new addition will be something that will serve them even more than fries and burgers. So, thank you for the information and I look forward to the project.'",
        "'CHAIR WHITE': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Thanks for the presentation, I don't have any additional comments.'",
        "'CHAIR WHITE': ' Commissioner Ginsburg?'",
        "'COMMISSIONER GINSBERG': ' Thanks for the presentation, I look forward to visiting the facility.'",
        "'CHAIR WHITE': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Got to figure out the right unmute button to click. Great presentation, no comments, thank you.'",
        "'CHAIR WHITE': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Thank you very much, I don't have any comments either and I look forward to seeing more about this project as it develops.'",
        "'CHAIR WHITE': ' Thank you, everyone, and thank you for the great presentation, now we will move on to Agenda Item 6B, considering the Fort Belvoir North Area final area development plan, and we will be hearing from Mr. Hart.'",
        "'MR. HART': ' Yes, just give me a second, I will have to share this screen. It should be on now hopefully. I'm assuming you can hear and see me?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MR. HART': 'I was like don't do that to me. Good afternoon, Chair White and Members of the Commission. The Department of the Army has submitted a final area development plan at the Fort Belvoir North Area for the Commission's approval. This installation is located in Springfield, Virginia. As a reminder, the Fort Belvoir North Area, or FBNA, is an 804-acre parcel located approximately two miles north of the main Fort Belvoir installation. And just outside of the capital beltway, it's circled here and it's located in Fairfax County. The location is just west of I- 95 and it's north of the Fairfax County Park which I'm indicating here. A closer look at the FBNA shows that several adjacent land uses including residential to the north and west and commercial and light industrial to the south and east. Within the installation is Accokeek Creek, which is shown here in blue. It bisects'",
        "'MR. HART': 'the property, with the western half consisting primarily of the creek's tributaries and wooded areas and the eastern half of the installation consisting of previously developed land, including the National Geospatial Intelligence Agency Headquarters. The Commission approved the NGIA Headquarters in 2008 and it opened in 2011. The draft ADP, area development plan, was reviewed by the Commission in September of last year and the Army has worked diligently along with the NCPC staff to develop the final ADP that is before you today. During the final review of a master plan, or in this case an ADP, the Commission should be focused on issues such as addressing the Commission's previous comments on the draft, any unrelated issues with the final plan, and if the transportation management plan is complete. I'll cover these topics throughout the presentation and we'll first briefly summarize the existing conditions and the issues identified in'",
        "'MR. HART': 'the draft ADP, then discuss the final ADP and the transportation management plan proposals. So, in addition to the NGA Headquarters, existing development at the FBNA includes other support facilities such as a child development center and fire station on the northeastern portion of the site and a remote inspection facility to the south. As I noted earlier, Accokeek Creek and its tributaries are the main natural features and the ADP identifies them as special natural areas needing protection. You see the draft ADP here which proposed a purely quantitative approach to development. For example, it identified the forested areas on the west as highly suitable for development, seeking to maximize capacity of future development at the FBNA. The primary issues raised by the Commission during the draft review focused on the proposed capacity development framework, the associated environmental impacts and transportation management and parking. This is the draft ADP'",
        "'MR. HART': 'capacity development that you probably remember from September. In a response, the Commission encouraged the Army to focus the future development within previously disturbed areas in the campus core on the east side, reduce the proposed development footprint outside of the core, thereby reducing environmental impacts, particularly those to trees, and develop a TMP for the entire FBNA campus and reduce single occupancy vehicle trips to meet the comprehensive plan's parking ratios over time. I'll now review the elements of the final ADP. The plan envisions the FBNA as a world-class installation with an intelligence community campus centered on the existing NGA Headquarters and a future Defense Intelligence Agency Headquarters Annex. The campus intends to consolidate some remissions from leased space onto the FBNA. Through its expansion, the plan intends to improve multi-modal connectivity, achieve environmental sustainability, and strengthen community partnerships among other goals. All of the development of the'",
        "'MR. HART': 'eastern portion of the installation has remained the same and to reorient you I'll point out the known development included in the final ADP. In this slide, we have the near-term projects, which are the DIA or the Defense Intelligence Agency headquarters, which is located here. And this is a funded project that will include the Headquarters building, a parking garage, a utility plant, and a visitor's center. And a second project in the near term is the distribution center, which is located on the western half in this portion of the site. However, the facility has not yet been funded and a specific site within this area has yet to be identified. Now we move to the midterm projects and this is the site for the Joint Intelligence Logistics Center, it's circled here. And other midterm facilities include an unnamed tenant facility in the south portion of the site'",
        "'MR. HART': 'here, a fire station addition and a parking structure on the north. The plan no longer includes site- specific plans with building footprints, road networks, and parking areas. While staff finds this level of detail appropriate for the ADP, it requires the Army to seek early consultation with NCPC staff and include proposed road and development configurations for the respective growth boundaries with future site and building plans divisions. As you can see with this comparison between the draft and the final, the final ADP seeks a more balanced approach to future expansion with the natural environment by establishing a dense, walkable campus within the campus core, which largely consists of previously disturbed land. Overall, the Army responds to the Commission's comments on the draft master plan by reducing disturbance to undeveloped areas, defining tree preservation areas, eliminating new surface parking, and incorporating low-impact development storm water management techniques. I'll'",
        "'MR. HART': 'describe these revisions in more detail throughout the presentation. The final plan looks at the site through a qualitative lens and identifies forested areas as potentially developable with limitations or mitigations. One significant change that the final master plan proposes is to prioritize development of the campus core again on the eastern side and identifies the forest and western campus as developable only for potential missions that are not compatible with missions in the campus core, such as the distribution center. In the next series of slides, I'll break down the development growth areas that have evolved since the draft ADP. As a reminder, the draft plan that you saw in September proposed approximately 289 acres of development in four areas, identified as areas A through D, which are outlined in red on this slide. Through a qualitative analysis, the final ADP reduced the development growth boundaries by 51 acres'",
        "'MR. HART': 'in total from 289 acres in the draft master plan to 238 acres, which is currently proposed. These new proposed boundaries are shown here in yellow. I'll step through the areas so that you can see the change from the draft to the final. Area A did not change. The new development will be focused here first for missions that are compatible with the intelligence community campus. Area B is reduced from 32 acres, what you see here in red, to 15 acres, and includes the extension of Heather Road across Accokeek Creek to connect the east and west sides, and it's outlined here in yellow. Area C previously measured 11 acres in the final ADP. Area C has been eliminated completely so the trees here will be preserved. And finally, Area D is reduced by 24 acres from the 50 acres that was shown here in red at the'",
        "'MR. HART': 'draft level to 26 acres, which is the current proposal shown here in yellow. Focusing in on Area D a little because the Commission had a few comments about this area, as a reminder, the draft plan envisioned this area for capacity development. It included a maximum height of one story for each of these buildings and only proposed surface parking lots and did not prioritize tree protection. In addition to shrinking the growth area boundary, the final plan changes the building height for future development from a maximum of one story in the draft plan to a maximum of eight stories in this proposal. There is also a minimum building height that is being proposed, which is three stories. As I mentioned, the final ADP also identifies the site for development of a potential distribution center in the near term. The Army explained that this facility is unable to'",
        "'MR. HART': 'be co-located near any other FBNA facilities for safety and security reasons, while specific plans for the configuration of future development in Area D are undetermined, staff is recommending the distribution center within Area D be located on previously disturbed land to the greatest extent possible. So, moving on to tree protection, the final ADP proposes to preserve approximately 76 acres of trees. This figure reflects the 51 acre reduction to the growth boundaries, plus an additional 25 acres of preservation within Area A. 14 acres of trees are also identified for preservation outside of the growth boundaries. Overall, the development framework has improved and now preserves 90 more acres of trees compared to the draft submission. However, significant environmental impacts are still anticipated with full build-out of the plan. Now we move to tree removal. Previously, the draft ADP proposed approximately 154 acres of tree clearing to fully implement'",
        "'MR. HART': 'the plan. In total, the final plan proposes approximately 78 acres of potential tree removal with full development of the growth area boundaries, and there is limited space for added planting on site. Moving to Area A, with regards to the DIA Headquarters site, in the near term, the Army has identified approximately 4 acres of onsite tree planting in addition to offsite stream restoration to mitigate impacts from the DIA Headquarters and parking garage, which is generally consistent with the intent of NCPC policies and will be further refined during project review. Since space for onsite replanting of trees is limited to mitigation for the DIA Headquarters, the Army has committed to the following to mitigate tree loss as a result of future development at the FBA. Up first is evaluate locations off site to replant trees at a 2:1 ratio. Next is considered solar and/or wind power generation'",
        "'MR. HART': 'installations on and off post. Third is implement stream restoration along tributaries affecting Fort Belvoir. And lastly is integrate storm water restoration and mitigation measures throughout the post. Staff sees that additional detail is necessary in the project site and building plan submissions to determine if these alternative computation measures are comparable mitigation for the remaining amount of tree removal and requires that for future project submissions the Army should complete an existing tree survey, prioritize on and off site tree replanting, incorporate any alternative environmental compensation measures early in the design process, demonstrate that the alternative measures are comparable to the benefits provided to the trees and provide any alternative measures in addition to the applicable regulations already required. Further evaluation of potential adverse environmental impacts and mitigation strategies will be analyzed through the NEPA process and the Army intends to complete the NEPA process for each individual project'",
        "'MR. HART': 'at the FBNA as funding becomes available. As such, staff requires the NEPA process for each future project including existing and unplanned built projects in the evaluation of cumulative impacts and includes NCPC in the NEPA scoping process. Where does this all leave us? In summary of the provided analysis regarding the development and environmental impacts, the staff recommends the Commission approves the following components of the Fort Belvoir final master plan. The planning principles for determining the location of new missions, defining the growth area boundaries for Areas A and B. The location of the future DIA Headquarters, visitor center, utility plant, and near-term parking garage within the Area A growth boundary. The proposed midterm fire station addition and joint intelligence logistics center located in Area A and an undisclosed tenant facility located in Area B. And the proposed distribution center use within growth boundary labeled Area D. However,'",
        "'MR. HART': 'we also recommend that the Commission defer review of the following until more is known about future development. These are the midterm parking garage in Area A and additional development of Area D other than the distribution center. The following comments in future requirements of the remainder of my presentation will address renewable energy and transportation. So, at the draft ADP review stage the Commissioner requested a summary of FBNA's approach to onsite renewable energy such as the use of solar panels or geothermal facilities. In response, the final master plan indicates that solar panels may be installed on parking structure rooftops, existing surface parking lots, covered walkways, and new facilities evaluated through the lead design process. Under the current proposal new facilities would be constructed to a standard of LEED silver. While this is comprehensive, the LEED rating system does not currently incorporate renewable energy as a pre-requisite and'",
        "'MR. HART': 'a project can achieve a high level of certification without earning the renewable energy credit points available. Therefore, the staff recommends the FBNA prioritize LEED's renewable energy credit points to achieve green building certifications of its facilities. The Commission also requested additional information from the Department of Defense about how it is addressing the Administration's executive order on climate change, which is EO 14008, and when renewable energy is considered in the planning process. The Department of Defense's climate action plan creates a strategic framework to meet the directives of the EO 14008 and is also acting on requirements in several other executive orders with a commitment to achieving carbon-free electricity and net zero installations. While staff finds that DoD's larger goals seek to achieve both the Administration's climate change directives and renewable energy policies of the comprehensive plan, it also finds a disconnect between these larger goals and the'",
        "'MR. HART': 'implementation at the master plan and project review levels with renewable energy installations frequently excluded from project budgets. Therefore, additional effort is needed for individual projects to meet the larger goals of the DoD's climate action plan and goals related to carbon-free electricity and net zero installations at the FBNA. Further, staff requests renewable energy as a priority for future FBNA projects, including the DIA Headquarters and the future distribution center. Now I'll move on to the elements of the proposed FBNA transportation management plan. There are a number of guiding transportation documents applicable to the FBNA and they are shown here on the left portion of this table. It's worthwhile to summarize the current successes and challenges of the NGA transportation management plan because similar circumstances would apply to the future DIA Headquarters and other potential development that's located here. NGA's current parking ratio is a 1:1.7 and at'",
        "'MR. HART': 'the time of NGA's last TFD approval in 2015, it committed to a parking ratio of 1:1.5 with the intent to meet a 1:2 parking ratio for additional transportation infrastructure was constructed. Following these approvals NCPC revised the parking ratio for this area in 2017 to 1:2 as part of the 2017 National Capital Region Federal Parking Study. The proposed FBNA TMP incorporates the NGA transportation demand management strategies as previously requested by the Commission. The successes of the NGA TBM strategies are listed here, including having a transportation manager, including locker and shower facilities in new buildings, a shuttle service to the VRE Backlick station, and participation in the NCR transit subsidy program. The Army also stated there are several constraints that stress the NGA parking ratio and prevent a commitment to a 1:2 parking ratio in the near and mid-term, and support a deviation from the 1:2 parking'",
        "'MR. HART': 'ratio at this time including the near-zero ability to telework among all employees because of the highest security requirements and overlapping working shifts. Overall, compared to other installations of similar distances to Metro, NGA has done well in meeting NCPC's earlier parking ratio goal and has implemented many of the TDM strategies outlined in the existing NGA Headquarters TMP. In summary, the NGA supports a government and contractor employee population of 10,700 personnel and employees currently park in three places, a 4900-space structured parking garage, a 900-space overflow surface parking lot and a 205-space unpaid gravel lot. As noted previously, the original NGA Headquarters TMP was approved with a parking ratio of 1:1.5 in 2015 and the current parking ratio is approximately 1:1.7 due to an increase in employees and visitor events at the campus. Under the previously approved 1:1.5 parking ratio, NGA currently has a short fall of 2211'",
        "'MR. HART': 'unbuilt employee parking spaces. In addition, the NGA Headquarters has a robust visitor population. The peak visitor demand is estimated at about 2650 people with 460 parking spaces currently available to visitors. When the DIA Headquarters and parking garage is constructed, the peak demand is anticipated to remain the same, however, the existing 900-space employee surface lot would convert to a dedicated visitor parking lot. Therefore, the 1380 visitor parking spaces dedicated for an anticipated 2650 visitor population is supported by 120 special events per month that occur at the conference center in NGA's college. At the draft ADP review stage, the Commission recommended the FBNA meet a parking ratio of at least 1:1.5 in the near term. We have learned since the draft submission that the proposed DAA garage will provide a total of 1547 spaces to serve the NGA employees, DIA employees, and visitors. This garage will maintain'",
        "'MR. HART': 'the current parking ratio of 1:1.7 for the campus core, however, the Army has indicated that the total number of proposed spaces that the DIA provides is currently limited by funding and additional funding becomes available, the Army would like to increase the number of spaces in the DIA garage so that the near-term campus parking ratio would decrease to a 1:1.5 ratio. The Commission is only approving the DIA garage size for the 1:1.7 campus parking ratio at this time and staff finds more specific TMP data would be needed for the Commission to consider a decrease to the current campus parking ratio. If the Commission were to find a decrease to the near-term parking ratio justified, mid and long-term parking projects would need to bring the overall campus to a 1:2 parking ratio. The final ADP also proposed to construct a parking garage in the midterm on a'",
        "'MR. HART': 'portion of the existing overflow parking lot shown here. The size of this garage and the number of parking spaces is undetermined at this time and will be driven by future programming. As noted previously, the Commission is only approving the DIA garage for the 1:1.7 parking ratio at this time and is deferring action on this proposed midterm garage. The midterm garage will be sized in accordance with the future TMP and that will be reviewed by the Commission. The Army intends to work towards a 1:2 parking ratio goal over the long term but the stated constraints will prevent near and midterm projects from reaching this goal. Further, the Applicant intends to prepare a more robust TMP for the FBNA but additional time is necessary to seek funding, coordinate with various missions, understand post-pandemic transportation, and realize the potential campus population associated with future development. As such, staff'",
        "'MR. HART': 'requests the Applicant return to the Commission in approximately two years or when early planning begins for the next master planning project after the DIA Headquarters with an update to the FBNA TMP. The update showed identified a few things, specific mode split data, existing parking utilization rates, additional information about the need for and the amount of overlapping shifts, TDM strategies to incrementally improve the campus parking ratio and achieve a long-term parking ratio of 1:2, reinstating the FBNA shuttle service between the metro station and campus, and finally, understanding capabilities to bus visitors to and from the FBNA during special events such as conferences. Now I'll move to inter-jurisdictional coordination. Fairfax County provided additional comments on the final ADP. Overall, the County finds the proposed revisions in the final ADP are an improvement over the draft ADP submission and encourages the Army to pursue LEED goal certifications for'",
        "'MR. HART': 'future buildings, consistent with the LEED certification of the NGA Headquarters. In addition, Fairfax County would support a partnership with the FBNA to address tree mitigation needs including tree replanting areas within the County near FBNA. Therefore, staff recommends the Commission request the Army continue coordination with Fairfax County as individual project implementation proceeds. Coordination should include but not be limited to the NEPA scoping process. And that leads me to the Executive Director's recommendation, which I have actually incorporated into my presentation and can be found in the staff report so I will not read them here again. I'll also note that Dr. John Bellamy, the NGA program manager at FBNA is here to provide some brief remarks and Coronel Tammie Harris, who is the Deputy Director of Real Property with the Office of Deputy Assistant Secretary of Defense, is here also to respond to the Commission's comments from'",
        "'MR. HART': 'the September meeting regarding larger DoD issues. Those written responses to the Commission's questions can be found in Appendix A of the staff report. And with that, I conclude my presentation and am available along with the representatives from Fort Belvoir and the Office of the Secretary of Defense to respond to your questions. Thank you.'",
        "'MR. BELLAMY': ' Thank you, Mr. Hart. This is John Bellamy, and I really appreciate the thorough and very articulate summary of the project. And so we also wanted to thank Ms. Sullivan and Ms. Free, we've worked diligently to make sure that we fully understand the NCPC's positions and their values and make sure they have a common value as we go forward with this process. So, again, thank you very much.'",
        "'MR. HART': ' Coronel Harris? We can hear you now.'",
        "'COL. HARRIS': 'Okay. Thank you. Good afternoon. As mentioned, I'm Colonel Tammie Harris, I'm from the Office of the Department Assistant Secretary of Defense, or DASD, for Real Property. And I am joined by my boss, Mr. Ron Tickle, the lead for real property, Mr. Mike McGee, from the Office of Property for Energy and Environment Resilience, as well as representatives from our Office of DASD Construction, as well as our respective teams. Together we fall under the larger umbrella of the Office of the Assistant Secretary of Defense for Energy, Installations, and Environment, or EI&E. That office is responsible for operational facilities and energy, energy management, and resilience; installation maintenance, management, and resilience; basing; construction; acquisition management and disposal of real property; housing and environmental planning compliance cleanup resilience; and natural and cultural resource protection. To summarize the information previously provided on Department basing decision-making, DoD, through its military departments, has'",
        "'COL. HARRIS': 'well-established formal processes and policies to consider all pertinent factors regarding basing actions and follows all executive orders, policies, and governances in the decision-making process. The Department's installations, including lease spaces, operate under the jurisdiction of the military departments, and it is the Secretaries of the military departments who acquire, manage, and dispose of the Department's real property, subject to the policies issued by, and the oversight of, the Assistant Secretary of Defense for EI&E. DoD understands the importance of sustainability and resilience with respect to basing actions and incorporates such considerations during various levels of the planning and decision-making process. Additionally, DoD, through Washington Headquarters Service, is applying the lessons learned through the past two years of alternative work practices as they undertake three space reduction initiatives within the NCR with the ultimate goal of consolidating lease space across the region by 2029 as vacant space on military installations'",
        "'COL. HARRIS': 'is identified. That concludes my summary.'",
        "'CHAIR WHITE': ' Thank you, Colonel Harris, and thank you, Mr. Bellamy and Mr. Hart. Do Commissioners have any questions for the team? If not, I will open it up for discussion and start with Commissioner McMahon.'",
        "'COMMISSIONER MCMAHON': 'Thank you, Commissioner White. I appreciate the hard work on the part of the NCPC staff, along with especially Fort Belvoir and NGA, to really take a hard look at their requirements coming out of their September review. And I will presume that most of my fellow Commissioners will note that while still questions will come up, there's significant improvement in what you've seen today as compared to before to address Department needs for space and space management as we take a look at how we co-locate common functions in places that make sense. We do them on installation properties that allow us to co-locate and reduce costs to the issues such as shared security costs, while we focus on issues such as environment, transportation, and those types. So, I think what we see here today is a major improvement and I think overarching that with the departmental view you'",
        "'COMMISSIONER MCMAHON': 'saw -- obviously, Colonel Harris, as we discussed, gave you an overview but you all have the specific questions and answers coming out of our request and suggestions with the staff. And we did work with the staff to meet with them and talk about some of those broad departmental policies to drive what we're doing today. Lastly, Colonel Harris talks about the work that my organization, Washington Headquarter Services, is engaging with right now that looks to take advantage of lessons learned from the last two years of our COVID-19 response and what that means in terms of desires and requirements for the current workforce and how they work. This is certainly for all this has accelerated that effort, especially in the use of telework appropriately as reflected by the security classification requirements at specific jobs. What's that leading to is a tiered effort to take a look at'",
        "'COMMISSIONER MCMAHON': 'utilization of space at the Pentagon, followed by utilization of space at the Mark Center, both current governmental facilities that will continue to support the Department's mission to collapse into those spaces by taking advantage of telework, shared office spaces, shared desktops like we've seen in other places. I think it was really led by GSA so many years ago. That will then lead us to reduce our square footage in lease spaces, reduce those costs, reduce that square footage, and then for GSA return that space to current owners for better uses there while we reduce our cost. But overall, I think what we see here is a much better product than what you saw before. I think it accurately reflects the requirements that Fort Belvoir and their tenants have to actually get their missions and reflects what is required for us to do within our uniform facility criteria'",
        "'COMMISSIONER MCMAHON': 'for master planning to support the President's executive orders on energy usage and to meet the goals of the NCPC. So, again, thank you for your time and allowing me to kick off.'",
        "'CHAIR WHITE': ' Thank you, Commissioner McMahon. Commissioner May?'",
        "'COMMISSIONER MAY': 'Thank you. I appreciate the thorough report and the work that has gone into this project since we last discussed it. And certainly, the changes that have been made are a significant improvement over the areas where we had major concern before, notably the reduction in the acreage of forest clearing that will be involved and the common sense approach to density of buildings and moving from one to three story buildings to three to eight story buildings. That seems like a pretty basic common- sense thing to do so I appreciate those steps. I do think it is important to underscore the larger-scale master-planning questions and I mean on a scale that goes well beyond this particular facility. And I think Commissioner McMahon emphasized that himself that in remarks, the importance of thinking about how the workplace has changed over the last couple of years, but also just being'",
        "'COMMISSIONER MAY': 'sensible about the allocation of space from office space in use of space in more urbanized areas as opposed to creating new office parks or quasi-urban areas, meaning areas that are currently natural. I think that's where the real payoff is, more so than NCPC, and I mean that collectively. I don't mean staff, I mean all of us engaging in trying to push to save more trees and park fewer cars. And so I think that really is the most important thing at this moment. I will say there is one odd aspect of this, which is that the prospect that if there's money to build another parking garage that the ratio is going to get worse before it gets better, and that's just really hard to understand. And I don't really need to dwell on it at this moment, but I think the focus should be on improving'",
        "'COMMISSIONER MAY': 'those parking ratios and addressing the many questions that were raised in the EDR about the information that we need for future evaluations. I also think I'm fairly optimistic that that will never come to pass because by the time we get the money for it, meaning some of these broader master-plan questions, allocation of space questions, where people work questions, there will be more light shed on those. And either the new parking garage will not be necessary or the new parking garage will be offset by the loss of parking elsewhere so that the facility can get in line in terms of its parking ratios. So, I appreciate all the thorough work and the effort of staff and the NCPC to try to get this into better shape. I think it's getting into better shape, I think there's still more to be done and I think development needs'",
        "'COMMISSIONER MAY': 'to be done. Thank you.'",
        "'CHAIR WHITE': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Hi, I don't have any additional questions or concerns. I echo a number of the comments that Commissioner May just made, especially the ones regarding the attention paid to transportation issues and parking ratios. So, comprehensive piece of work and thank you for all the work and the attention that was paid to the comments that we all made at the last presentation.'",
        "'CHAIR WHITE': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'By comparison I'm going to be downright effusive, because we really roughed you up last time and I'm not going to say I feel bad about it but I am going to say I feel really good about the extent to which you responded to those comments. So often on this Commission I feel like we're barking at the moon and no one is listening to us, or they're grudgingly listening to us. And this really feels different and I want to say I appreciate what seems -- this is so corny -- an earnest attempt to really listen and work with the staff to respond to our concern. Yes, there are things that aren't worked out yet but I am a mad optimist and even though COVID-19 has been a horror show, there are things that I believe will emerge from it over time. I don't think that parking'",
        "'COMMISSIONER WRIGHT': 'garage will be necessary so I'm not worried about it. I think work has changed forever. We don't know what it's going to look like yet. The next key to the next several years, it's not going to be solved in the next six months, because people who have the latitude, who aren't working in very high-security jobs that need to be onsite, I think we need to pay attention to their behaviors. And it's going to take a bit to figure out the right balance, but I do believe the days of five days a week in the office are over and that's good for our workforce I think, it's good for the environment. There is a silver lining come out of all this. So, I'm not worried about the parking garage and I'm not too worried about the parking ratio moving forward. Mostly, I want to just underscore'",
        "'COMMISSIONER WRIGHT': 'that I'm very happy to see the office park gone on those low-rise buildings, they were what I remember most, and your efforts to save trees. Again, I sound like a cornball but all this stuff is very important and I am very appreciative that you listened.'",
        "'CHAIR WHITE': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': 'Thank you, Madam Chair. I had to compose myself here to not take up too much but my thrust, first of all, I appreciate particularly what Commissioner Wright just said about the automobiles. I think that is going to become a changing issue for us very soon. And I do appreciate the focus that was in the presentation on renewable energy and the clear effort to speak to solar in particular. But I'm just not comfortable with the commitment to this solar. I kind of think about it like if everybody was at the gas pump and just open them up and let the gas flow onto the streets all over the country, that's what happens when the sun comes up. Energy is there and we're letting it get away from us, we need it, we've got our situation, a war going on now, and the major thrust, the major'",
        "'COMMISSIONER DIXON': 'key to it is energy, oil and energy. And we have a chance with our work in the military, all those plans, they need to begin to really try to put solar in and do whatever they can. That should be more important than how many cars, how many trees. We need to include that and fund it. The funding that we've got now at the federal level for infrastructure, the Government should not have to ever worry about money to pay for solar. We just need it. So, I don't know how to say it any louder or any stronger but we take it off and we integrate it in a lot of words but we've got to start putting in panels in solar to capture the energy that's being given to us every day, every day. The other point I want to make is somewhat related. I just'",
        "'COMMISSIONER DIXON': 'got back from a bit of a road trip and I've been hearing about the roll- out of all these charging stations. There's a problem. When you pull into a charging station -- I have an electric car -- they have three or four different plugs that you can get into your car. Now, if I had that problem in my home and I couldn't put a lamp in because the plug in one house didn't match the one in the other house, that would be craziness, it's almost like going to other countries. There needs to be some effort nationally to standardize the plug systems. There were three stations in this particular parking area where I went to charge in, I had enough gas to have a PHEV that has both gas and electric. But one of them, about five or six, was more Tesla plug-ins, they didn't fit'",
        "'COMMISSIONER DIXON': 'my car. There were another 10, maybe if your plug-ins had two outlets that were for some other provider. They didn't fit my car. The only one that had a plug that fit my car was a single station that was in a handicapped zone space with a $500 fine for parking in it and that was the only one I could park my car in to get a plug in to get power. So, all this roll-out, we can't roll out this technology and have it incompatible from car to car to car. So, thank you for all you have done and I hope you will start capturing the sun and don't let the gasoline just spill into the streets, but make sure we get the fuel from the sun captured and stored for us to use, we need to it. Thank you, Madam Chair.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Thank you so much, I also want to echo that I'm pleased with especially getting rid of those low-rise buildings, the office park, I think Commissioner Wright called it. You've been able to preserve a lot more trees, which is always a good thing, but I also appreciate that the team is able to go back and really listen and hear what we had to say like the time before us. So, no plans are perfect, there's still going to be a lot of cars but I think there's been substantial improvement and it just speaks to some of the changes we can hopefully effectuate as a Commission here moving forward on similar projects. So, thanks to everyone.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Thank you for the presentation, I don't have any additional questions.'",
        "'CHAIR WHITE': ' Commissioner Ginsberg?'",
        "'MS. KOSTER': ' I believe Commissioner Ginsburg has had to step away.'",
        "'CHAIR WHITE': ' Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' I don't have any additional comments, thank you.'",
        "'CHAIR WHITE': 'Are there any further comments or questions that people want to raise? I also want to thank everyone on the Army team for taking a step back and reevaluating your approach to the master plan. Clearly, you have a lot of grateful Commissioners, the way you approached this and made significant changes and working with us to achieve common goals. I think it's greatly improved and it's great to see it prioritized using the previously disturbed land first. And I recognize there will still be significant impacts as the intelligence community consolidates its function to this campus, but we also understand the benefits of consolidation, especially out of lease space. So, we look forward to working with you on that, and now the focus turns on how new projects are designed with appropriate mitigation in mind, again we want to work with you towards our common goals of sustainability, which'",
        "'CHAIR WHITE': 'we take very seriously. So, we look forward to future projects meeting a high bar that you all are hoping to achieve by what you've done to date. Obviously, the loss of trees and vegetation will need to be mitigated and we appreciate your commitment to working that out. Lastly, I appreciate that you are working hard to meet NCPC's parking ratio and we're going to very interested in seeing an update transportation management plan, of course, in the next couple of years. I strongly encourage you to continue working with Fairfax County to improve public transit from metro or to determine how you could bring back your own shuttle to and from metro. I understand it's a challenging situation but we appreciate your attention to that. And thank you again, Commissioner McMahon, for putting everything in perspective for us. This is a really important effort and we've been following'",
        "'CHAIR WHITE': 'this for a while and I appreciate the early site visits. I look forward to getting back out there when we can do that again. So, with that, is there a motion to approve the final master plan for Fort Belvoir North?'",
        "'COMMISSIONER WRIGHT': ' So moved.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Wright. Is there a second?'",
        "'COMMISSIONER DIXON': ' I second it.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Dixon. Can you please confirm the motion and the second and then take the vote by roll call?'",
        "'MS. KOSTER': ' The motion was made by Commissioner Wright, the second was by Commissioner Dixon, and with that, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes, solar.'",
        "'MS. KOSTER': ' Thank you for that sunny thought. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' Commissioner Ginsburg I believe has left the meeting.'",
        "'CHAIR WHITE': ' The motion is approved, thank you, everyone, and I do want to thank Commissioner Dixon as well. The picture of opening up our gas station tanks and letting them run and thinking about the sun and the energy is a really great way to get everyone's attention focused on solar energy, so thank you for that. Next is agenda item 6C, approval of preliminary site development plans for the National Desert Storm and Desert Shield memorial, and we will be hearing from Ms. Herr. Welcome.'",
        "'MS. HERR': ' Thank you. Can you see the screen?'",
        "'CHAIR WHITE': ' Yes, we can.'",
        "'MS. HERR': 'Good afternoon, Madam Chair and Members of the Commission. The National Park Service in collaboration with the National Desert Storm War Memorial Association has submitted preliminary site plans for the proposed Desert Storm/Desert Shield memorial for Commission review and approval. The concept plan for the memorial was previously approved for the Commission with comments in January of 2020. As a quick reminder, Congress authorized the establishment of the memorial in Public Law 113-291, which states the National Desert Storm War Memorial Association may create the memorial as a commemorative work on federal land in the District of Columbia to honor those who served as the member of the Armed Forces on active duty in support of Operation Desert Storm or Operation Desert Shield. Through Public Law 115-18, Congress authorized the memorial to be located in Area 1 but not within the Reserve of the National Mall. The law also stated'",
        "'MS. HERR': 'the Commemorative Works Act applies to the site selection and design of the memorial. The Commemorative Works Act is a federal law that guides the memorial process in Washington D.C. Consistent with the criteria for new commemorative works, this review focuses on the preliminary review at the preferred site. The focus of the preliminary review is to determine if the design meets the Commemorative Works Act, if design elements are appropriate for the site and do not impact views, if the design addresses visitors, circulation, landscape, and storm water management and generally how the design elements relate to each other. With the comments today and also the comments received from the Commission of Fine Arts, the sponsor and the National Park Service will further refine the design for the preferred site and continue Section 106 coordination and return with a memorial design for final approval. As a reminder, the memorial'",
        "'MS. HERR': 'is located near the intersection of Constitution Avenue and 23rd Street NW. The U.S. Institute of Peace is located to the north of the site and the Lincoln Memorial is located to the south. To the west are sand volleyball courts and to the east is the National Mall. The Commission noted its support for the memorial at this site given its strong thematic connection to the Vietnam Veteran's memorial and proximity to other 20th-century war memorials and nearby diplomatic agencies and organizations. As you can see, the site is generally an open lawn with multi-purpose recreation fields, allowing views of the Lincoln Memorial and National Mall. Additional site photos demonstrate the site is visible from adjacent streets, however, the site is primarily concealed from view when looking north from the Lincoln Memorial due to existing vegetation. An existing line of trees on 23rd Street and Constitution Avenue border the'",
        "'MS. HERR': 'site to the east and to the north. The site is partially within the 500-year floodplain. A future Potomac Park levee system would be at approximate elevation 20. In development of the preliminary design for the site, the Commissioners requested the Applicant further evaluate the pedestrian queues at the entry, study the angle of the walls to deter unwanted activities, consult with an arborist on the impact to existing trees, provide details on the central water feature and Falcon and Eagle cast sculptures. The Commission also recommended the Applicant consider alternatives to the proposed statues. In its analysis, staff found the Applicant has generally addressed the Commission's previous requests and staff recommends the Commission approve preliminary site and building plans for the National Desert Shield and Desert Storm memorial at the intersection of Constitution Avenue and 23rd Street NW. The remainder of the presentation will summarize the site plan, design'",
        "'MS. HERR': 'inspiration, and commemorative elements to support this and other recommendations. The overall design of the proposed memorial is inspired by several characteristics of the war, including the unique environmental and battle conditions of Kuwait, such as the dune formations and oasis landscapes found in the desert. Staff recommends the Commission commends the landscape-oriented design that minimizes the use of vertical elements and respects the open setting and views to the Lincoln Memorial and National Mall. The proposed memorial is sited nearest the intersection of 23rd Street NW and Constitution Avenue. It is anticipated that the proposed Desert Storm/Desert Shield war memorial on this site may be a catalyst for future memorials along the Constitution Avenue corridor west of 23rd Street. This approach is consistent with the vision to restore the original Constitution Avenue alignment that terminated at the belvedere overlooking the Potomac River. In addition to replacing the trees that'",
        "'MS. HERR': 'are lost, the Applicant proposes new trees within and around the memorial, including new trees adjacent to the Lincoln Memorial Circle consistent with the Lincoln Memorial cultural landscape plan. The memorial is primarily circular in form and has a generally compact footprint measuring approximately one half of an acre, leaving more than three acres of the existing lawn area intact for other purposes. A commemorative space is generally set back from the adjacent streets and buffered by existing vegetation and proposed berm formations that enclose the memorial. The memorial is enclosed by two asymmetrical berms offset to the northeast and southwest that provide enclosure and buffer noise from surrounding uses. The asymmetry and offset of the berms is intentional to preserve views from the memorial towards the Lincoln Memorial and National Mall. The design of the berms is inspired by the dune formations of the desert leadership for the war'",
        "'MS. HERR': 'spot. It is proposed that the berms will be planted with low-growing vegetation to optimize the views around the memorial and recall a dune- like appearance. Staff still has questions about the treatment of the berms and recommends the Commission request the Applicant determine if the angle of the walls and berm treatment are designed to sufficiently deter unwanted climbing and similar activities. The Applicant has updated the memorial to focus the commemorative framework on service. This is expressed using landscape walls in a central water feature to collectively convey the sacrifice and leadership, hardship, and success of American service members. In addition to the commemorative theme, the overall design of the proposed memorial is inspired by similar characteristics of the war, including the unique environment and battle conditions. Staff recommends the Commission note the Applicant simplify the commemorative framework of the memorial design to ensure that visitors clearly understand'",
        "'MS. HERR': 'the purpose of the memorial. The Applicant proposes visitors experience the memorial from reverse clockwise in a left hook circulation pattern, which emulates the famed circuitous attack conceived by General H. Norman Schwarzkopf. The primary path rises subtly in elevation along its curving trajectory through the memorial allowing the visitor to ascend through the space to the central feature, a place of solemn appreciation and reflection. Between the two walls, a central water feature commemorates the unique global coalition that came together in service and sacrifice to liberate Kuwait. The commemorative narrative is revealed slowly and sequentially from left to right. The proposed memorial enclosed by the two symmetrical berms, the storm wall approximately 240 feet in length and an average height of 4.5 feet, displays service and the conflict, how they served and changed the nation. The bas relief for this wall depicts the buildup of the operation, the'",
        "'MS. HERR': 'troops on the ground, and the dawn of a new day. The central figures highlight the humanity of the ground effort. Visitors are confronted with this personalized moment as a direct reflection of the individual sacrifice and shared experience throughout the conflict. The canvas of the storm wall is revealed as one wall is revealed as one walks along the ascending left hook path clockwise through the memorial. Shaded seating provides a central spot for visitors to view the wall and textures. Laminated stainless steel sculptures of raptors in flight pull the movement up and along the wall flying out of a sunrise. Beyond the raptors, the movement of the wall reflects a calmer tone leading to the inscription wall. In the inscription wall, approximately 165 feet in length and an average height of 4 feet, displays service and how they sacrificed. The inscription honors those who volunteered to serve'",
        "'MS. HERR': 'and those who lost their lives in service. As you can see, the previously proposed statues have been removed addressing the Commission's request from the concept review. Linked reeds signify Operation Desert Storm and Desert Shield and recall the Kuwait liberation medal. The ten significant battles are noted across the length of the wall. Pictured here are additional inscription wall details. The memorial centerpiece is a cascading water feature situated within an open plaza and sheltered by a grove of trees. The fountain washes over a circular battle shield. Around the edge of the unity shield the names of 35 countries are engraved to commemorate the international coalition that acted together to enforce UN Resolution 660 and liberate the country of Kuwait. The complete ring of countries highlights the significance of this moment in history, a new cooperative approach to resolving conflict that united the world and marked the end'",
        "'MS. HERR': 'of the Cold War. This commemorative element is designed as a low circular table with water flowing in the center. The wash of the water has various modes of intensity. As a high flow, it emphasizes the turbulence and upheaval of battle, in a gentler flow water becomes a cleaner, more reflective surface. When the shield is dry, the detailed patterning and battering of the shield are visible. These are additional details of the unity shield. Included here are rendered views of the proposed memorial. Both access points lead to sweeping pathways configured around a central feature and then to express the left-hook strategy used by the U.S.-led armed forces. Since the memorial is designed for visitors to circulate in a clockwise ascension from the primary access point on 23rd Street NW, the Commission had previously suggested the Applicant explore visual cues to direct eastbound pedestrians on Constitution Avenue NW'",
        "'MS. HERR': 'and southbound pedestrians on 23rd Street NW to enter the site from the 23rd Street NW access point.The Applicant has included a title on a low wall facing the entries on 23rd Street NW and Constitution Avenue as pictured here. Staff recommends the Commission request the Applicant determine whether way finding from the south and west is necessary to better navigate to the memorial entry. The proposed memorial has a disturbance footprint larger than 5000 square feet and will need to comply with focal storm water management requirements. The Applicant has previously coordinated with the District Department of Energy and Environment on the design requirements but further coordination is needed and staff recommends the Commission request the Applicant continue to coordinate the District Department of Energy and Environment on the storm water requirements to ensure they do not negatively impact the memorial design. This is a rendered view of the'",
        "'MS. HERR': 'center oasis of the memorial. This is an additional rendered view of the memorial from Constitution Avenue. This is an aerial rendered view of the memorial. Since I've already read the recommendations and they are included in the Executive Director's report, I will not repeat them again but I'm happy to answer any questions that you have. Scott Stump, President of the National Desert Storm War Memorial Association, is here as well to give a brief statement and answer any questions you may have. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Ms. Herr. Does Mr. Stump want to make any remarks at this time?'",
        "'MR. STUMP': 'Sure, I'd be happy to do so. Good afternoon, Chairman White, NCPC Commissioners, and staff, I sincerely can say it's very nice to see you all and to reconvene after this unplanned hiatus over the last two years. And although there have been a number of unanticipated disruptions since 2020, I can assure you that one constant has been our design team's ongoing commitment and actually uninterrupted work on developing the design of the National Desert Storm and Desert Shield memorial. Our goal over the last five years -- hard to believe, five years -- has been to make sure that the memorial design rises to the level of the site at 23rd and Constitution, which will literally have billions of future visitors. Our design team has also listened and responded to your guidance, particularly in respect to simplifying the narrative and simplifying the commemorative features. Commissioners, I hope you'll'",
        "'MR. STUMP': 'agree we have accomplished the lofty goal of creating an iconic memorial that's respectful of its setting and that we are on track to receive final design approval. And at this juncture, I'd just like to take 20 seconds again to introduce or re-introduce, I can't remember which one I'm doing, the artistic team who is at the heart of these commemorative expressions. Ms. Emily Bedard is tasked with all of the work on the bas relief on the walls and the carvings. It's a, pardon the pun, a monumental task but she is extremely talented and we are very fortunate to have her on the team, as we are also for Rob Eccleston, who is in charge of the raptors, the eagle, and the falcon sculptures, which my prediction, and of course, I'm a little bit biased but I think those raptors are going to become an iconic part'",
        "'MR. STUMP': 'of this memorial. And while design work has been going on, so has our fundraising and I'm very happy to report that we are extremely close to having in hand all the funds necessary to break ground. We hope to commence construction by the end of this year. Thank you again for the opportunity to stand before, I guess sit before, you again this afternoon, everyone, and I along with the rest of the entire team eagerly look forward to continued work with the Commission and staff as we move ahead into the home stretch of this commemorative work. Thank you so much.'",
        "'CHAIR WHITE': ' Thank you, Mr. Stump and Ms. Herr. Do any of our Commissioners have questions? Hearing no questions, we do have one person signed up to speak today, Bernard Berne. Mr. Berne, please make sure you are on camera and audio and we will wait to hear from you. I see you there. You have three minutes to provide remarks, and I note your testimony was also sent to the Commission. So, Mr. Berne, thank you.'",
        "'MR. BERNE': 'Yes, my written testimony has more information than I'll tell you now. Page 9 of the submission states, in the section entitled \"Landscape Approach,\" the plantings within the core commemorative area will be selected for their foliage, form and texture rather than flowering colors. These plantings will be native or adaptive to the area with an emphasis on species that are drought-tolerant and require little maintenance. Monarch butterfly populations are declining throughout the United States. To help reverse this decline, President Obama issued, in 2014, a memorandum titled Creating a Federal Strategy to Promote the Health of Honey Bees and Other Pollinators. A memorandum by a taskforce created by the memorandum stated the number of migrating monarch butterflies sank to the lowest recorded population level in 2013 to 2014, and there's an imminent risk of failed migration. In 2015, a taskforce memorandum stated: increase the eastern population of monarch butterflies'",
        "'MR. BERNE': 'through domestic and international actions and public-private partnerships by 2020. Monarch butterflies feed only on milkweed. To help restore monarch butterflies and comply with this memorandum, the Park Service, the National Park Service, needs to include appropriate species of milkweed in every landscape plan, so in plantings of ground cover and perennials such as this one. Common milkweed, Asclepias syriaca, is the only milkweed species that thrives in natural areas in the Washington area and that monarch butterflies prefer when laying eggs. It's the only one. The Smithsonian Museum of Natural History's Pollinator Garden contains much of this milkweed, common milkweed. As this milkweed grows in spaces that are drought-tolerant and require little maintenance, it fulfils the criteria for plantings in the core commemorative area. Planting this milkweed species in appropriate areas within this memorial will help achieve the goals set forth in President Obama's memorandum and related federal documents.'",
        "'MR. BERNE': 'I therefore ask you to recommend that the National Park Service plant common milkweed in all appropriate areas within this memorial, including the core commemorative area and in addition, the berm. It looks like now the berm is just grass. That really doesn't help pollinators or anything. It would be far better if that berm contains milkweeds and other pollinator plants. Thank you.'",
        "'CHAIR WHITE': ' Thank you, Mr. Berne. Are there any questions for Mr. Berne? Hearing no questions, I will open it up to the Commission for discussion starting with Commissioner May and go in round-robin format. Please keep your webcams on during the discussion. Commissioner May?'",
        "'COMMISSIONER MAY': ' Thank you very much. I don't have much to say about this because I've had so much to say about this in so many other meetings with Mr. Stump and the whole design team. So, I'm just very pleased that we are at this point and the Commission staff has recommended approval of this preliminary design and we welcome all the suggestions that have come with it. I look forward to hearing what my fellow Commissioners have to say.'",
        "'CHAIR WHITE': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I appreciate the presentation and the work that's done on it. I think the design is lovely. That's all I have to say.'",
        "'CHAIR WHITE': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'I'm on a roll today. I think the design is so much improved. It's really hard to believe we're only at preliminary, I feel like this thing has been going on forever. And I have commented at length too before but I think it's important to acknowledge that I forget, it's some renaissance master, that the artist's job is to simplify. And I think you've done a really good job of listening, again, and you've given up some things that were I think important to the memorial sponsors in the process. I don't know what color milkweed is, my recollection is that it's a taupe-y brown color. And maybe that's not a bad idea because my one worry is that the berms do an important job. They do some noise cancellation from the traffic around the site and they evoke this idea of the dunes. But I would caution, although'",
        "'COMMISSIONER WRIGHT': 'I've got some nerve cautioning Olin, not to go too lush. Because then you'll lose the allusion to the desert. The memorial composition I think does a really good job of threading the needle between the abstract and the literal, which is always the trick in memorial design I think. The better memorials are more abstract. I think the less successful ones are like reading a book on a wall in a museum. And so the design team has done a really good job of that so far. And I get, yes, there are always oases in the desert but I think if you go too lush, you'll lose something about the very subtle but abstract illusion to the dune setting. So, the plant pallet will be very important. I'm not a landscape architect but I know you've got a good one so I would listen to them. And then'",
        "'COMMISSIONER WRIGHT': 'I can't help myself, Scott, I know you love the raptors and they are beautiful as sculpture. I can't help myself, even though, again, this ship has sailed and they're going to be there, but they are disruptive to the composition in a way that is too bad. Not ruinous but I wish that they could have been integrated in a different way into the composition. And then finally, I think the most improved part of the whole shooting match is the shield in the middle. When the idea was first introduced I kind of looked at it like my dog, like what is that, a table, what is that? Is it going to be a map? What are they trying to do here? And I think now it's very clear what the references are and I think a lot about this because I took my college roommate last summer'",
        "'COMMISSIONER WRIGHT': 'in one of the breaks during COVID-19 to see Eisenhower. And I ask her, okay, what do you think is going on here with all the memorial elements? And she couldn't tell me, unfortunately. I don't think that's the case with this one, I think all of the elements hang together from a narrative standpoint, and also, from a design perspective they are beautifully woven together. So, even the raptors can't wreck it for me, I think you've done a beautiful job and the key will be the plant pallet.'",
        "'CHAIR WHITE': ' And now we go to Commissioner Dixon.'",
        "'COMMISSIONER DIXON': ' First of all, I absolutely support comments made by others and I do hope that we will consider the bees when we do this in terms of the plant. Thank you and I'm looking for to seeing it moving forward.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Cash?'",
        "'COMMISSIONER CASH': 'Thanks, I really do love the design, I think it's inviting, it is designed well enough where it invokes just a little bit of that desert landscape we talked about. So, I think the design really is great. Maybe I'm biased because here at the Wilson Building we are across the street from a de facto skate park, but I do look at this and worry that I know this is the National Park Service or whatever, but just making sure you don't have some kind of improper uses here. Because I think that same swirling thing could just maybe be a magnet for folks riding their bikes and everything there, and I know that is an issue down at the FDR. So, that's kind of just the one thing that pops out at me because then I get worried that you have to put those things in place to'",
        "'COMMISSIONER CASH': 'discourage that and I hate to break up this great design. The only other comment, because I always have a comment on a water feature, is I think the water feature looks great. I hope the water feature will be in use because that's an integrated part of the design and why it was designed that way. And just a word to really double-check on the materials that you're using with the shields, so one issue that's popped up over here on World War I is that the lettering on the back of the wall that has the water cascading down, the patina of it is all fading and it's shiny bits and bits that just are fading away. So, being very thoughtful in the design and materials because we want this to last for hundreds of years. But I don't have anything really negative to say about the project,'",
        "'COMMISSIONER CASH': 'great work and I think the simplification, I echo the best things are to just simplify it a little bit.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Thank you for the presentation, I really appreciated hearing everything and seeing the design here, no additional comments from me.'",
        "'CHAIR WHITE': ' Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' I also echo my appreciation of the design and I have no additional comments.'",
        "'CHAIR WHITE': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Thank you, I don't have a whole lot of more to add following the thoughtful comments from the rest of the Commissioners except I do agree with them. The only thing I would point out for myself and Commissioner May is in terms of a bicycle usage neither one of us rides BMX bikes so we look forward to the new design and its implementation. That's all I have, over.'",
        "'CHAIR WHITE': 'Thank you. If there are no other comments or questions, I would also offer that sometimes less is more and this certainly bears true in this case. I think the simplification of the commemorative elements has really made this design more elegant and brought focus to the story of the international effort portrayed here. I love the design of the water feature, as many others have also stated. With or without the water I think it's a really beautiful element and I think this will really be appreciated as an oasis in the city. And in response to Mr. Berne's testimony, I so appreciate the continued effort to think about butterflies and bees and how important our pollinators are. I understand the design of a memorial or cultural landscape necessitates a specific vegetation. But I do encourage National Parks Service and all of our Applicants and colleagues to incorporate native'",
        "'CHAIR WHITE': 'pollinator plants wherever possible. I know you work hard to do that and there is a way to think about that as you finish up the project that would be great. At this point, Mr. Stump, congratulations to you and your entire team for getting the project to this phase, it really is quite elegant. And with that, I would ask, is there a motion to approve the preliminary site development plan?'",
        "'COMMISSIONER ARGO': ' So moved.'",
        "'COMMISSIONER MAY': ' Second.'",
        "'CHAIR WHITE': ' Thank you, Commissioner Argo. I'm sorry, who seconded, Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'CHAIR WHITE': ' Thank you very much. Can you please confirm the motion and second and take the vote by roll call?'",
        "'MS. KOSTER': ' Thank you. The motion was made by Commissioner Argo, the second by Commissioner May, and with that, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Sorry, rookie move, I was on mute. Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'CHAIR WHITE': ' The motion is approved, thank you, everyone. Our next agenda item is 6D, requested approval of preliminary and final site development plans for Reservation 378, Park design revisions and reconstruction. We will hear from Mr. Weil.'",
        "'MR. WEIL': ' Thank you, Madam Chair, let me share my screen here. Can you see my presentation?'",
        "'CHAIR WHITE': ' I can.'",
        "'MR. WEIL': 'Great, thank you. Good afternoon, Madam Chair and members of the Commission. The National Park Service in coordination with the Federal Reserve Board has submitted preliminary and final site and building plans for the redesign and reconstruction of the park at Reservation 378, which is located along Virginia Avenue NW in Washington D.C. The project proposal would remove the park which was necessary to access and repair the parking garages beneath the site and then reconstruct the park to maintain its historic design qualities along with improvements to establish a more useable public space. Previously, the Commission provided comments on the project's concept plans in March 2020 and since then, the National Park Service in coordination with the DC SHPO have determined the park site to be eligible for the National Register of Historic Places. And as a result, the Applicants have scaled back some of the previous design features'",
        "'MR. WEIL': 'in order to maintain the park's existing character as much as possible. Through the DOE nomination process and planned revisions, staff finds the Applicant has addressed the Commission's previous concept comments, particularly those relating to the central lawn area curving, tree soil volume and replacement, and views into the park from Virginia Avenue. I will summarize these revisions and other proposed park improvements over the next few slides. Here is the project site location in Reservation 378, situated immediately to the north of the Federal Reserve's Martin Building, and above the two below breed Department of Interior and Federal Reserve employees parking garages that require refurbishment. Here you can see the below-grade garage footprints outlined here by the white dotted lines along with Reservation 378 and the smaller reservation 105 which abuts the project site to the northwest. And both of these reservations are owned by the National Park Service'",
        "'MR. WEIL': 'and maintained by the Federal Reserve pursuant to an agreement between the two agencies. The existing park is a well-used public space characterized by its open views from surrounding streets, with planting beds and seeding areas that surround a relatively flat central lawn area. In addition, there is an existing tree kiosk adjacent to the Martin Building on the bottom left used by Federal Reserve and Interior employees to enter below-grade parking. The park was designed by prominent landscape architects, Oehme Van Sweden, with a rich pallet of ornamental grasses and perennials that emphasize seasonal interest, diversity of species, and a variety of texture and light. This design was later coined the birth of the New American Garden. So, here's the current park design proposal with a number of notable features including a consolidated entry kiosk near the tennis courts, a raised south plaza to provide more headroom over the'",
        "'MR. WEIL': 'garage ramp below, additional seat walls around the east and west planting areas. Slightly shifted tennis courts approximately 10 feet to the northwest, reinstalled east fountain with new infrastructure and lighting, widened sidewalks down Virginia Avenue and 21st Street that comply with DDOT's standards, slightly shifted widened internal pathways and replacement of onsite trees and understory plantings. There is a superimposed layout overlay with the existing park configuration outlined here in orange and as you can see, the existing and final park layouts are very similar. Reconstructed primary, secondary and tertiary paths would have similar widths to the existing interior pathways today. The previous 2020 concept plans included 8 to 18-inch tall garden walls and curves along Virginia Avenue and 21st Street park parameters as well as surrounding the parameter of the interior planting beds. And in an effort to minimize partially adverse effects to the central lawn space, the'",
        "'MR. WEIL': 'Applicants have removed these curving seat walls to result in the flush condition between the lawn and adjacent walkways as intended in the original design. Here is a rendering from the 2020 concept submission over which the Commission expressed concern with the berm and plantings on top of an 18-inch wall along Virginia Avenue, which limited views into the park from the adjacent sidewalk and street space. And here would be the new design with the walls removed so that views into the park are preserved much as they exist today. These park sections show comparison between the proposed and existing grades, which would not change significantly under the current design, with the exception of new seat walls around the east and west planting niches in order to provide more soil volume for the trees. This is consistent with a District Department of Energy and Environment Standards. The project would'",
        "'MR. WEIL': 'remove 58 trees on site and replant 89 new trees with most of the new trees planted in existing tree locations. But with new tree canopy adjacent to the east and west shading shifts to strengthen the balance between the gardens being lawn and adjacent seating areas. All of the proposed tree species and understory plantings, which would include a mix of perennials and ornamental grasses, would be suitable for today's climate and appropriate to the site conditions above the underground parking structures, adaptable to the park's urban setting, with a similar visual appearance as the historic vegetation. New site lighting would be installed within the east fountain under benches and on the steps leading up to the raised south plaza area. Final plans show new ADA accessible benches along the east and west seat walls, which would increase the park's total seating capacity to 214 seats, which is an'",
        "'MR. WEIL': 'increase from its current 64-seat capacity that exists today. And as previously noted, the proposed design and location for the new consolidated entry kiosk remains largely unchanged from the earlier 2020 proposal, which was commented on favorably by the Commission. Here you will note the simplified kiosk design, which is intended to distinguish its appearance from the Martin Building and to help the kiosk proceed into the future park landscape. We note this in our final Executive Director recommendation. In conclusion, based on scaled-back changes that the Applicants have made to the previous 2020 concept and in response to the previous Commission comments, staff is recommending final approval for the park design based on its balance between preserving the original design intent with current programmatic needs and environmental constraints. And we noted these points in the final Executive Director's recommendation. Here is the final recommendation and I will forego rereading'",
        "'MR. WEIL': 'these as I have already covered each of these points in my presentation. However, I would like to note that we have several representatives here from the Federal Reserve team and project design team who are available for any questions the Commission 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 may have. Thank you.'",
        "'CHAIR WHITE': ' Do the Commissioners have any questions for Mr. Weil or the representatives that are here with us today? If there are no questions, we do have one person signed up to speak today, Mr. Berne. Please make sure you are on camera and audio and we will wait to hear from you. You'll have three minutes to provide your remarks and I note that your testimony was also posted along with the Executive Director's recommendation. Thank you and welcome again, Mr. Berne.'",
        "'MR. BERNE': 'Yes. Thank you. This is on a similar subject, but a little more specific, project-specific. The planting plan on sheet LA 601 contains a plant schedule, plant schedule south, that lists 18 species of perennials. Sheet number 21LA 601 provides further information about these species. As I stated earlier, President Obama issued a 2014 presidential memorandum entitled Creating a Federal Strategy to Promote the Health of Honey Bees and Other Pollinators. A task force stated, increase the eastern population of monarch butterflies to 225 million through domestic and international action and public partnerships by 2020. Monarch butterflies feed only on milkweed, however, neither of those two sheets lists any species of milkweed. The park will therefore do nothing to help restore monarch butterfly populations in accordance with the memorandum unless the National Park Service revises those sheets to enable them to list milkweeds. Common milkweed, as I stated previously, Asclepias'",
        "'MR. BERNE': 'syriaca, is the only milkweed species that thrives in natural areas in the immediate Washington, D.C. area that monarch butterflies prefer when laying eggs. The species grows best in sunny areas. Monarch females also prefer poke milkweed, A. exaltata, when laying eggs, although not to the same extent as A. syriaca. Poke milkweed thrives in partially shaded areas in Northern Virginia where A. syriaca does not grow well. NCPC staff members informed me that the National Park Service revised its plan to add A. tuberosa, butterfly weed -- that's a milkweed. However, studies have shown that monarchs lay few eggs on this milkweed, probably because it does not contain the toxins that caterpillars incorporate into their bodies to help protect them from predators. Therefore, this is not a good one to add. So please, add common milkweed to the planting schedule, a species planted in sunny areas, and add poke'",
        "'MR. BERNE': 'milkweed to the shady areas. And don't add A. tuberosa or butterfly weed, because it's just wrong to attract monarchs. It's a pretty milkweed, monarchs will come and visit it, but they won't lay eggs on it, very few will. Okay, thank you.'",
        "'CHAIR WHITE': ' Thank you so much, Mr. Berne. Are there any questions for Mr. Berne? Hearing no questions, I will -- Commissioner May, did you have a question? I will open it up to the Commission for discussion starting with Commissioner Dixon and then going in round robin format and I would ask that you keep your webcams on during the discussion. So, Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' I have no questions but I am pleased to get the information about the milkweed and other plants, that's very helpful, thank you.'",
        "'CHAIR WHITE': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Actually, I should have asked this earlier but I did have a question on Page 6 of the EDR in the third to last paragraph that's talking about soil volume in the trees. In two places it says that, essentially, are the trees that have to come out and have to be replaced one for one, that's just because there's not enough volume there right now to let them keep growing into the future given the ceiling of the garage? Is that the purpose of them being pulled out? They're not dying or anything?'",
        "'MR. WEIL': ' I can tell you that there are some trees that are in poor health. As to the exact trees and the replacement volumes, I would defer to one of the designers, maybe Eric Groft or Melissa Cohen, for that question.'",
        "'CHAIR WHITE': ' Are the designers still with us?'",
        "'COMMISSIONER MAY': ' Eric Groft is here. We can't hear you.'",
        "'CHAIR WHITE': ' Thank you, Mr. Groft?'",
        "'COMMISSIONER MAY': ' Still can't hear you.'",
        "'COMMISSIONER CASH': ' You're unmuted but your microphone might not be working.'",
        "'MR. GROFT': ' Is that better? Sorry about that. I'm Eric Groft with Oehme Van Sweden, a principal. I've been working on this project for going on 30 years now and all of the trees have to come out because all the soil has to be removed to repair and waterproof the garage. And we are actually increasing the number of trees that are going in. And while we're doing this, we thought it would be a good idea to increase the soil volume as much as possible. It also gives us some built-in seating, those low seat walls as well.'",
        "'COMMISSIONER CASH': 'I'll just say, maybe I'm a broken record on the trees sometimes because my walk to work happens to be down 14th Street past the World War I and Franklin Park. But it's always a shame when we have to take out trees that have been there a while because we lose that growth. It's going to take years for these canopies I think to really develop and to the extent the trees aren't actually sick or dying, if there's any way to at least preserve a few of them where you pull them out, do the work that needs to be done, see if you can get an arborist to keep them alive long enough to put them back in. I know that could be tough, especially on our project here where we're not just dealing with the soil, there's the infrastructure on the earth. But I'm always very'",
        "'COMMISSIONER CASH': 'disheartened to see these old trees have to go away but if it's just the details of this project, especially with the garage, I understand I would be remiss if I didn't put these trees on the table.'",
        "'MR. GROFT': ' We love our trees as well, they were planted by our founding partners and we'd love to keep them. We did work with an arborist and it was determined that not only is it extremely expensive but you're talking about less than 50 percent survival rate. So, it had been considered but given the parameters, it seemed to be extreme. Because several of these trees, the ones that are healthy, are extremely large.'",
        "'COMMISSIONER CASH': 'And I'll just close with saying that maybe one thing that we as a Commission should do, and maybe I will start doing more when we're looking at some of these new projects, like the previous project we just looked at that had landscaping, maybe we should start asking questions about the memorials and landscapes that are going up now. Making sure those kinds of issues have been taken into account, that in 30, 40 years from now we're not going to need to come back and address something because we've got the soil evolving or something like that where we're pulling the trees out again. I think the design overall is great. I really like that we've gotten rid of the 18- inch -- that we've been able to bring the wall back down to the side walk level. I think that looks much more inviting, it's good to'",
        "'COMMISSIONER CASH': 'use it in the parks. So, I definitely appreciate the improvements that have been since we last saw this.'",
        "'CHAIR WHITE': ' Mr. Groft, I'm going to take Chairman's prerogative with a follow-up question. When you replace the trees, given the consideration of moving the existing ones, and it sounds like you've determined that would not be the smart way to go, are you maximizing the size of trees that are going in as replacements to the extent possible?'",
        "'MR. GROFT': ' Yes, we're not putting in small trees but we're not putting all consistently large trees either, we're trying to vary the size so it doesn't look like they were all planted at the same time.'",
        "'CHAIR WHITE': ' That makes sense.'",
        "'MR. GROFT': ' But given the volume that we have, these trees should flourish.'",
        "'CHAIR WHITE': ' Thank you. With that, I want to turn to Commissioner Davis.'",
        "'COMMISSIONER DAVIS': ' Thanks for the presentation, I don't have any additional comments.'",
        "'CHAIR WHITE': ' Thank you. Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' I just want to thank Mr. Berne for his comments and repeated comments in each case. As we work on other private projects in the District and we deal with a lot of the landscaping, this is something I'm going to now take back and incorporate into our discussions with developers as well. So, I thank him for his contribution.'",
        "'CHAIR WHITE': ' Thank you. I was impressed with the specificity of the recommendations. It was very helpful. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Great presentation, I have no comments.'",
        "'CHAIR WHITE': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Thank you very much. No, I don't really have comments, thanks to the staff who worked with us and of course, the FRB, this is really their project and we are doing our best to facilitate it because it's a joint operation. We really appreciate it and it's really been great working with the Federal Reserve Board, I have to say. I don't have anything else to say. Thank you.'",
        "'CHAIR WHITE': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I don't have any additional comments. I'm pleased to see where we are on this. That's it, thank you.'",
        "'CHAIR WHITE': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I'm commented out. I don't have any comments. You all can be glad I have nothing to say.'",
        "'CHAIR WHITE': 'We will give you a pass. Are there any other comments from the Commission or staff? Hearing none, I'd like to thank National Park Service, Oehme Van Sweden, and the Federal Reserve for listening to our recommendations throughout the process and making the changes to maintain the feeling of openness this park has today. I appreciate, Commissioner May, your reminding us that this is part of a larger effort with the Federal Reserve and it has been a very thoughtful process to think about this entire area as part of their design. I think this is significantly improved from the one we saw a couple of years ago and I do appreciate the National Park Service making a commitment around milkweed. It does demonstrate that preservation and sustainable design can co-exist so we appreciate that. I'm also glad that while the monumental core streetscape framework is still in draft form,'",
        "'CHAIR WHITE': 'it's really heartening to see that Applicants are already using it inform the streetscape design and we're very appreciative for that. With that comment, is there a motion to approve the preliminary and final site and building plans?'",
        "'COMMISSIONER MAY': ' So moved.'",
        "'COMMISSIONER STEINGASSER': ' Second.'",
        "'CHAIR WHITE': ' Thank you, Commissioner May. Thank you, Commissioner Steingasser for the second. Can you please confirm the motion and the second and then take the vote by roll call?'",
        "'MS. KOSTER': ' The motion was made by Commissioner May, the second was by Commissioner Steingasser, and with that, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Chair White?'",
        "'CHAIR WHITE': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'CHAIR WHITE': ' The motion is approved, thank you, everyone. And with that agenda item, we are concluding our open session agenda. We've had a very full meeting and I appreciate everyone's participation and engagement as we reviewed all of these items with great enthusiasm. Our next regular Commission meeting will be on Thursday April 7, 2022 at 1:00 p.m. If there is no other business, the session is now adjourned.'",
        "'COMMISSIONER DIXON': ' Madam Chair?'",
        "'CHAIR WHITE': ' Yes, sir.'",
        "'COMMISSIONER DIXON': ' I'd like to take a personal privilege here, I get a chance to speak to the federal members of our Commission and please, take back some indication to your leaders there that we need to standardize these plugs for these electric cars. They're all excited about the roll-out but if you roll out multiple connections, it's going to be a bit of a problem. So, please, you all have that power and we don't.'",
        "'CHAIR WHITE': ' Thank you so much, Commissioner Dixon, for that recommendation. The system has to work and those details really important so thank you very much for that. Any other items, Commissioner Steingasser?'",
        "'COMMISSIONER STEINGASSER': ' I just want to compliment on the staff on their agenda. They said we would adjourn at 5:00 p.m. and they have hit it almost on the minute.'",
        "'CHAIR WHITE': ' It is impressive that we can plan our day around their predictions, well Neal R. Gross and Co., Inc. (202) 234-4433 Washington DC www.nealrgross.com 237 1  noted. Commissioner Argo, did you want to add 2  something? 3'",
        "'COMMISSIONER ARGO': ' No, sorry, having 4  a little trouble with my buttons. 5'",
        "'CHAIR WHITE': ' Thank you, everyone. 6  And with that, we stand adjourned. Great work. 7'"
    ]
}