{
    "1. COMMISSION ROLL CALL ": [
        "'MS. KOSTER': ' Certainly. Commissioner Cozart?'",
        "'MEMBER COZART': ' Here.'",
        "'MS. KOSTER': ' Commissioner McMahan?'",
        "'MEMBER MCMAHON': ' Good afternoon.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'MEMBER STIDHAM': ' Here.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'MEMBER ARGO': ' I'm here.'",
        "'MS. KOSTER': ' Okay, got you. Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Present.'",
        "'MS. KOSTER': ' Thank you. Chair Goodman?'",
        "'CHAIR GOODMANN': ' Present.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'MEMBER GREEN': ' Here.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'MEMBER WRIGHT': ' Here.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'MEMBER DIXON': ' Here.'",
        "'MS. KOSTER': ' Commissioner Cash? Commissioner Davis? And Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' Here.'",
        "'MS. KOSTER': ' I'll note that Marcel Acosta, the Executive Director; Anne Schuyler, the General Counsel; Diane Sullivan, Urban Design and Plan Review; and Mike Sherman with the Policy and Planning Group are also attending the meeting.'",
        "'CHAIR GOODMANN': ' Thank you, Madam Secretary. Noting the presence of a quorum, I'd like to call this meeting to order. And today's meeting is being live streamed and will be available in a few days as a video on the NCPC website, and if there's no objection, the agenda as posted will be adopted as the order of business. And now we will play a short clip of the Pledge of Allegiance. Please join me. (Pledge of Allegiance.)'",
        "'CHAIR GOODMANN': ' NCPC will continue to conduct meetings online until the renovations in the Commission chambers are complete. I want to share how we will be conducting the Commission's business. Following staff presentations and any other testimony, I will ask for a motion and a second as appropriate. During Commission deliberations, I will use the round robin format to ask each Commissioner if they have any comments. During deliberations, I ask that Commissioners be on video unless you are experiencing some technical difficulties and other times if the Commissioners would be so kind to ask if they'd like to be recognized. And so today our agenda item number two is the report of the chair.'"
    ],
    "2. REPORT OF THE CHAIR ": [
        "'CHAIR GOODMANN': ' And I would just like to say that I am very delighted to be here today. It's the holiday season and we had a wonderful Commission retreat held on November 3rd and this gave us an opportunity as a Commission to review the Agency's past and present work initiatives and a discussion regarding the future directions for our work together as the National Capital Planning Commission. I really appreciate that our Commissioners brought their unique perspectives and individual opinions and were fully engaged throughout the retreat. I thought it was very refreshing to be able to meet in person and I look forward to the Commission chambers being completed so that we can do that on a regular basis. Agenda item number three is the Report of the Executive Director, Mr. Acosta.'"
    ],
    "3. REPORT OF THE EXECUTIVE DIRECTOR ": [
        "'MR. ACOSTA': 'Thank you, Chair Goodmann, and good afternoon. As part of the Commission's upcoming centennial celebration in 2024, NCPC, with the D.C. Office of Planning, soft-launched an online library of D.C.'s significant urban planning documents. I want to thank our Centennial staff team, Julia Koster, Kael Anderson, Bsrat Mezghebe, Stephen Staudigl, Steve Morgan, and Paul Jutton for their fine work on this. At your January meeting, we'll provide an information briefing on our Centennial efforts to the Commission. You'll also find a link to the online library on our website. And thanks to the Office of Planning for collaborating with us on this library. We also want to thank Paul Medvetsky who completed his fall internship. Paul authored blog posts on various topics related to Pennsylvania Avenue and supported other divisions on their various database work as well as their Centennial planning activities. We wish Paul all the best as he'",
        "'MR. ACOSTA': 'graduates from Georgetown University. That concludes my report. I'm happy to answer any questions that you might have. You do have copies of my written report in your packet.'",
        "'CHAIR GOODMANN': ' Thank you, Mr. Acosta. Does the Commission have any questions? Any questions from the Commission? Hearing none, agenda item number four is a legislative update from Ms. Schuyler.'"
    ],
    "4. LEGISLATIVE UPDATE ": [
        "'MS. SCHUYLER': 'Thank you, Madam Chairman. I do have something -- several things to report today. The first is H.R. 6101 and H.R. 6102. Both bills address the establishment of a national museum of American LGBTQI+ history and culture. The difference between the two bills lies in the approach outlined for establishing the museum. H.R. 6101 established the museum within the Smithsonian Institution and establishes a council to make recommendations to the Board of Regents concerning the planning, decision, and construction of the museum. H.R. 6102 establishes a commission to study the potential creation of the museum and requires the commission to submit a report 18 months after enactment of the subject legislation with recommendations on the feasibility of establishing a museum. Both bills were introduced in late October and both have been referred to committee. The second item I'd like to report on is H.R. 2712, the Hershel \"Woody\" Williams National'",
        "'MS. SCHUYLER': 'Medal of Honor Museum Location Act. This bill requires the authorized commemorative work honoring the National Medal of History Museum to be attached to, but not more than 1,000 feet from the Lincoln Memorial. And just by way of background, I think as I advised you when I initially reported on this, the relationship between the monument and the Lincoln Memorial results because President Lincoln established the Medal of Honor which is the United States military's highest decoration of valor. Hershel \"Woody\" Williams, for whom the bill was named, received the Medal of Honor for heroism above and beyond the call of duty during the Battle of Iwo Jima in World War II and he was the last living Medal of Honor recipient from World War II. The bill passed the House on November 8th and it was received in the Senate and referred to committee. The last item I'",
        "'MS. SCHUYLER': 'have is H.R. 1318, the Women's Suffrage National Monument Location Act. This bill authorizes the location on the Reserve, as that term is defined in the Commemorative Works Act, to commemorate the women's suffrage movement and the passage of the 19th Amendment to the Constitution which granted women the right to vote. The bill passed the House in November, on November 6th, 2023, and was received in the Senate on November 7th. Other than allowing the monument on the reserve, all other provisions of the CWA apply. There is also a separate companion bill in the Senate, S.886, which mirrors the House bill exactly. This concludes my report and I'd be happy to answer any questions Commissioners might have.'",
        "'CHAIR GOODMANN': ' Thank you, Ms. Schuyler. Do any of the Commissioners have questions regarding Ms. Schuyler's report? Hearing no questions, thank you very much, Ms. Schuyler. And I want to move on and note that there are no items on the consent calendar this month. So agenda item number 5A is to approve the final site and building plans for the Browne Education Campus Modernization. Mr. Flis, are you prepared to make the presentation?'"
    ],
    "5A.  BROWNE EDUCATION CAMPUS MODERNIZATION ": [
        "'MR. FLIS': ' Yes, good afternoon, everybody. Hopefully, you can see the screen.'",
        "'CHAIR GOODMANN': ' Good afternoon. afternoon, Department'",
        "'MR. FLIS': 'Okay, great. So yes, good Commissioners. The District of General Services has submitted final site and building plans for the modernization of the Browne Education campus which is a school complex located in Northeast Washington, D.C. The project primarily includes interior renovations and the construction of a new gym, as well as some surrounding site and landscape improvements for the school. So the project was previously given preliminary approval on October as a delegated action and then during this final review, we are looking at further details on the project, particularly the landscape and stormwater management plans, as well as if there were any changes since the last review. NCPC has an advisory review of this project. It is a District project outside the central area and based on staff's review does not have any impacts on federal interests. As such, we are recommending final approval of the site and'",
        "'MR. FLIS': 'building plans. And I'll give you just a brief overview of the project in the next few slides. So for context, as I mentioned, the campus is located in Northeast Washington, D.C., circled here on the screen. It's located near the Langston Golf Course, which is managed by the National Park Service and located just south of the National Arboretum. So just zooming in a little bit here, you can see the school at a larger scale. Just in terms of context again, the Langston Golf Course is just to the east. This is a residential neighborhood, the Langston neighborhood. There are other schools located in the vicinity which are part of a larger historic district and this school itself is also historic, built in the 1930s. So here in yellow is highlighted the larger historic district. This is informally called Education Hill. It includes the Browne Education Campus here'",
        "'MR. FLIS': 'in the Northeast, as well as Phelps High School and the Charles Young School or also called the Two Rivers School, as well as Spingarn High School. And so just in terms of background on the school, of the seven colonial revival-styled junior high schools which were built in the District in the 1930s, only Browne Junior High and Banneker Junior High were actually constructed for African American students. And so this is just an image from the school, actually a student play in 1935. And then here are some images of the school today. As I mentioned, the original building was actually constructed in 1932. This is kind of the front formal entrance to the school which you can see here. There have been several additions to the school over the years as the campus population expanded. The first was in 1935. Another one occurred in 1953. From an'",
        "'MR. FLIS': 'architectural perspective, both of these additions have been considered sympathetic to the original building design, although they were somewhat simpler. They use the same kind of window patterns and materials, brick, for example. In addition, there was a final expansion in 1971. This included a full-size gym, as well as an additional classroom space. In general, this addition was not considered sympathetic to the original historic school design and you'll see some additional images, but here you can see it here in the bottom. As part of this project, the proposal is to restore the 1930's and 1950's wings of the school with the intention of kind of respecting the existing historic architecture, but also creating a high performance learning environment. And the project will also remove and replace the existing gym, so you can see that here. It is quite a significant footprint. It's out of scale and doesn't'",
        "'MR. FLIS': 'meet the school's current needs. So the new proposal will actually significantly reduce the footprint and allow for additional landscaping and also for additional play spaces and recreational areas for students. So here's the proposed site plan. North is actually to the right, so this is kind of rotated so that the image can fit on the screen, but basically you can see the new gym footprint here which is again significantly smaller than the existing gym. It is more efficient and it's also connected directly to the school, the main school building itself. As I mentioned, there's going to be some additional recreational spaces included, so there's a playground, some athletic courts, and then a small kind of half-sized soccer field here. In addition, there will be some additional landscaping which I'll describe in a second. Further, you saw the image of the main kind of historic front of'",
        "'MR. FLIS': 'the school. This is all lawn today with a lot of existing trees. This is not intended to be altered as part of this project scope, so it will remain as it is today. So here's a view of the new gym addition, as well as some of the analysis that was undertaken to understand the relationship of the existing building to the new addition. This was developed in close coordination with the Commission of Fine Arts, as well as the State Historic Preservation Office because the building is historic. And I'll also note that the new addition will be constructed of the same brick material or similar brick material as the exiting school. And so I mentioned that the primary focus of this project is really interior renovations, so these are just some floor plans to show you what is happening. They are proposing to increase the efficiency of'",
        "'MR. FLIS': 'the existing space. A lot of the kind of changes here are to move classroom spaces to the kind of exterior areas so that they can get more daylight and that creates a better kind of learning environment for students. And so this is the proposed planting plan. The site plan is proposed to provide 100 percent native plantings for the new plant installations. This pallet does include bioretention areas for stormwater management. And these also include a variety of plantings that are appropriate to the Anacostia watershed. This also includes pollinator-friendly species such as milkweed. I will mention that not every plant is considered a pollinator, but the plantings still provide important ecological benefits such as habitat for wildlife and also educational opportunities for students within the school. As I had mentioned, the remainder of the site will either be untouched, remain as is, such as kind of the'",
        "'MR. FLIS': 'front, formal entrance. However, I mentioned also that there will be some additional play courts, play grounds, sport courts, as well as the stormwater management. I'll note that next month, you're going to receive an information presentation on staff's new pollinator resource guide. So you're going to hear more about our efforts to increase pollinator habitat. Several of our recent projects have obviously started to touch on this issue, so staff has been doing a lot of work to pull that resource guide together and so you'll hear more about that at next month's Commission meeting. And so then just finally, the stormwater management approach was developed in coordination with DOEE. This does include primarily bioretention areas at the front corner of the site. And again, these will all be planted with appropriate native species, including those pollinators. And again, the existing trees in the front of the campus are'",
        "'MR. FLIS': 'not going to be disturbed. So, in conclusion, staff does recommend approval of the final site and building plans. As I mentioned, there are no impacts to federal interests so that does include my presentation. I'm happy to answer any questions. We also do have the applicant team and their consultants available to answer any questions. So, thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much, Mr. Flis. We appreciate it and thank the team for coming today as well. Are there any questions for Mr. Flis or the team on this project? Any Commissioners have questions?'",
        "'MEMBER WRIGHT': ' I do, actually, but it's more of a process one. I'm not clear why we're looking at this. If there's no impact on federal interest and it's a D.C. project, how --I understand that it's advisory, but why are we doing this?'",
        "'MR. FLIS': ' Sure. We had somebody signed up to testify on the project, so giving them the opportunity to speak.'",
        "'MEMBER WRIGHT': ' Okay. But I guess my question is more fundamental. I mean, why are we looking at a D.C. project that has no impact on federal interest, speaker or not? I don't --1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 I just -- I'm curious. I don't understand.'",
        "'MR. FLIS': ' Oh, like in general?'",
        "'MEMBER WRIGHT': ' Yes.'",
        "'MR. FLIS': ' You know, it is part of the Planning Act authority for NCPC to look at all District projects. In most cases, these don't have, you know, significant federal interest, and so they become delegated actions, smaller reviews --'",
        "'MEMBER WRIGHT': ' Right.'",
        "'MR. FLIS': ' -- but they don't necessarily come to the full Commissioner for presentation.'",
        "'MEMBER WRIGHT': ' Okay. So it would have remained -- since the preliminary site and building plans were delegated, it would have remained so, had it not been for somebody signing up to testify?'",
        "'MR. FLIS': ' Correct. That would have been our recommendation, yes.'",
        "'MEMBER WRIGHT': ' Okay. Got it. Thank you.'",
        "'MR. FLIS': ' Sure.'",
        "'CHAIR GOODMANN': ' Thanks. Great question, Commissioner Wright. It clarifies it because I'm sure this is going to happen again. We do have one person signed up to speak, and I want to welcome Mr. Berne to the NCPC. I know you have come before and we appreciate you coming to comment on these important matters. So you have three minutes to provide your testimony, and just let us know when you're ready. Ms. Koster, is Mr. Berne present?'",
        "'MR. BERNE': ' Hello? Yes. Can you hear me?'",
        "'CHAIR GOODMANN': ' Yes. We can hear you.'",
        "'MR. BERNE': 'In response to a request in my original testimony, the applicant's landscape architect has provided a copy of its plant list for this project which was briefly shown on the screen. The architect stated that the list is, quote, rich in site specific appropriate native plants for the Anacostia watershed. However, the D.C. government's list of native pollinator plants does not show most of these. Further, 20 percent of the plants are wind-pollinated grasses that do not produce nectar. Such adult pollinators as butterflies, moths, hummingbirds and many species of flies feed only on nectar. Additionally, common milkweed, on which over 450 insect species feed and which is the most important food plant for monarch butterfly caterpillars in this area, will be only 5 percent of the listed plants. Only 10 percent of the plants should be grasses. More than 10 percent should be common milkweed. Please, I would like'",
        "'MR. BERNE': 'the applicant to understand this. Some of the plants are cultivars. However, many cultivars do not produce pollen or nectar. The applicant should therefore replace all cultivars with native plants. The Browne Campus contains large areas of mowed turf grass that children rarely, if ever, use for recreation. You saw this on the slides. However, most turf grasses, including Kentucky bluegrass and tall fescue, are not native to the United States and are actually highly invasive. The applicant, therefore, should replace these with nectar plants even though it's not part of this project. The landscape architect stated that the applicant is, quote, currently not equipped to maintain complex native plant matrixes in lieu of turf grass. However, the applicant can simply replace turf grass with a mix of native nectar that thrive on the types of environment, sunny or shaded, moist or dry, that turf grass presently covers, and there's'",
        "'MR. BERNE': 'a lot of this. The applicant would only need to clear those areas once each year outside of the growing season, preferably during late winter or early spring. This will permit the nectar plants to distribute their seeds during the winter, while preventing the spread of invasive shrubs and vines that would otherwise cover the areas. It would also reduce mowing costs. Other plants may replace some of those in the original mix. However, most replacements will be nectar plants. Many of the plants in the original mix, such as common milkweed, will be so persistent that they will thrive and spread in areas that are cleared only once each year. I have informed the applicant and the landscape architect of all of the above but have received no response. Please, therefore, ask the applicant to conform with my recommendations. My recommendation to replace turf grass with native species --'",
        "'MR. BERNE': 'nectar plants is especially important, because that's really a large area of the campus. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Mr. Berne. Thank you for coming and for providing testimony today. Are there questions from the Commissioners for Mr. Berne? Hearing no questions, did staff have any comment on his question?'",
        "'MR. FLIS': ' No comment from staff, but I understand the applicant's team is here if the Commission would like to hear from them as well.'",
        "'CHAIR GOODMANN': ' Well, does the team have any comment on his questions?'",
        "'MS. VIDAL': ' This is Kristina Vidal from Perkins Eastman D.C. I believe my colleague, Lauren Wheeler, who is our landscape architect for Browne Education Campus, is prepared to speak to Mr. Berne's comments.'",
        "'CHAIR GOODMANN': ' Thank you.'",
        "'MS. WHEELER': 'Thank you, Kristina. My name is Lauren Wheeler with Natural Resources Design, and I'm extremely sympathetic to Mr. Berne's comments and his approach to how we consider and plant our educational facilities throughout the District of Columbia. I will be first and foremost in saying that: when we approach the design for any public school and private school or charter school in the District, we have many criteria by which we're looking at in the design process. First and foremost, is it functional; are the plantings situated in a way that really provides substantial functionality to the school and to the District. The second is -- and in this case, most of the new plantings are on storm water management facilities, and so it has a specific function of treating storm water so that storm water can then be cleaned and put into the Anacostia River at a later date.'",
        "'MS. WHEELER': 'Second in my mind is educational. Since these are educational facilities, it's critical that these plantings provide the opportunity for greater educational opportunities for students and staff on the campus. And a third, of course, is always ecosystem services. And I think Mr. Berne has specifically focused on how does the -- how do these plantings provide ecosystem services or pollinating services to our local native and non-native bees or other pollinators. So, as per Mr. Berne's comments and his request, we have shifted the planting materials for areas that were already going to be planted so that we see over 40 to 50 percent of -- over 40 percent of common milkweed versus swamp milkweed, which is what we had originally spaced before we increased numbers. I'm happy to speak to or answer any other specific questions that the Commissioners may have that I can address in this case.'",
        "'MS. WHEELER': 'But we feel very strongly that the balance oftentimes is what survives, what does well, and what will be easily-maintained for the District, which has a fairly limited maintenance budget for the public schools. So I'm happy to answer any further questions detail as needed. or get into any more'",
        "'CHAIR GOODMANN': ' Thank you, Wheeler. We really appreciate that. Do the Commissioners have any further questions? Ms.'",
        "'MEMBER DIXON': ' Madam Chair?'",
        "'CHAIR GOODMANN': ' Yes, sir.'",
        "'MEMBER DIXON': ' I'd just like to know whether Mr. Berne is appreciative of the comments made by the -- regarding what they're doing. How is his reaction to this? Mr. Berne?'",
        "'MR. BERNE': ' Excuse me?'",
        "'MEMBER DIXON': ' I want to know what your take is? Do you feel like there has been proper consideration of your inputs, your concern?'",
        "'MR. BERNE': 'Well, partially, but remember my biggest comment is that most of that area, as you see on the pictures, is mowed grass. This is not part of the project, but you see it on the slopes, and it's unlikely that children use this for recreation. As part of this project, as a follow-up, it would really be not appropriate to have to remove that turf grass and replace it with pollinator plants. And, you know, because basically, as many people do not recognize, turf species are invasive. Very few of them are native to the United States, practically none are. Kentucky bluegrass is not from Kentucky, and they are highly invasive. In the Midwest, they're replacing some of their berries. It's important whenever possible, get rid of those, to replace those with pollinator plants such as common milkweed and others. They didn't address this and perhaps because it's outside the'",
        "'MR. BERNE': 'project area, but they really need to work on this, not just this one but all over the area. I mean --'",
        "'CHAIR GOODMANN': ' Thank you --'",
        "'MR. BERNE': ' -- when you think of the National Mall, think of turf grass and invasive species, because that's what it is.'",
        "'CHAIR GOODMANN': ' Okay. Thank you, Mr. Berne. We do appreciate your input and your thoughtfulness about these projects. Thank you very much. Any further questions from the Commissioners on the project? Hearing none --'",
        "'MEMBER DIXON': ' I'd like to know how Ms. Wheeler reacts to his comment. I just want to get a feel for that?'",
        "'CHAIR GOODMANN': ' Okay. Ms. Wheeler?'",
        "'MS. WHEELER': 'Sure, certainly. And I'm really happy to answer his question, and it may become too technical for many folks that don't have a horticulturist focus. But what I would like to say is that I've installed, and been involved as I've installed over 50 schools throughout the District over the last 10 to 15 years. My experience, time and time again, is that the approach that you have to take when you're planting full native plant materials is, that it's a very specific approach, meaning that whether you're doing a bioretention zone, whether or not you're doing it for an intentional pollinator garden, it has to be very intentional so that maintenance facilities has the capacity to get out there and remove invasive plant weeds, which will show up no matter what, because it takes two to three to five years to establish the basic plant matrix undercoat. And you'",
        "'MS. WHEELER': 'know, even when you use living mulches, which are green plants that are at the very base level, invasive plants will come into those spaces. So you have to have educated gardeners or caretakers -- garden taker -- caretakers to know the difference between an invasive plant in the early spring versus a non- native plant. So those two things require a fairly high level of education to maintain that those bioretention cells or plantings don't become overrun with invasive plants. I have over 15 years of experience planting these sort of spaces, and the places that are taking care of well and are planted with very robust thriving plant materials will take over in and of themselves. On the question of lawns, I agree 100 percent in terms of lawns should be converted to native plant materials and not non-native warm season grasses; okay? But on a hillside, the'",
        "'MS. WHEELER': 'second that you don't have full establishment of native plant, and so you all of a sudden end up with an erosion issue. And that's not even addressing the fact that most planting areas -- and I've been on record for planting numerous meadows, native meadows in independent schools, residential settings, and commercial settings, but they need special care to get established. There's -- the biggest benefit that we can do is to plant plants that will thrive, do well, survive over time, and then provide the idea of a long-term succession so that they're always available to the pollinators and wildlife that come through those specific project areas. I hope that answers the question. I'm happy to go on but I don't want anybody's -- you know, anybody-- for it to go too far in that regard. But I have a lot of experience in this, and my goal'",
        "'MS. WHEELER': 'is to provide good solid ecosystems that are educational, beneficial, and attractive for the school environments. Many of our D.C. students don't have the opportunity to go out into the woods or out to local meadows, so I'm bringing that experience into the schoolyards with the idea that they can then have a more scintillating and educational experience with their own campus that brings a little bit of nature to them. And as I said, I'm extremely sympathetic to Mr. Berne's perspective, but we have to choose the right places and the right times to do it, so that they are a success and not a failure.'",
        "'MEMBER DIXON': ' Madam Chair, I thank --I appreciate the comments. I think we're in good hands with Ms. Wheeler, but I really respect Mr. Berne's constant appearances, speaking to us about these issues. I mean it's kind of fascinating and I think we could get too much into the weeds here, but I think it's very interesting and meaningful. Thank you very much, Ms. Wheeler and Mr. Berne.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Dixon. And I would just second that. Thank you very much, Ms. Wheeler and Mr. Berne, for the robust discussion. It is educational and it's helpful with all the work that we have to do and all the work ahead of us. And with that, I would entertain a motion to approve the final site and building plans for the Browne Education Campus Modernization. Is there a motion?'",
        "'MEMBER DIXON': ' I move, so moved.'",
        "'VICE CHAIR HEWLETT': ' Second.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner and Vice Chair Hewlett. Thank you very much. We have a motion and a second right now. So. Ms. Koster, can you please confirm the motion and the second and take a roll?'",
        "'MS. KOSTER': ' Sure. The motion was by Commissioner Dixon, seconded by Vice Chair Hewlett. And with that, Commissioner Cozart?'",
        "'MEMBER COZART': ' Yes.'",
        "'MS. KOSTER': ' Whoops, sorry. I just --this is for you to do your deliberations. I just went right into it.'",
        "'CHAIR GOODMANN': ' Thank you very much. No. The motion -- well, we have a motion and a second, so now we're going to open this up for the Commission discussion so all the Commissioners can comment on this. Could you please turn on your cameras, Commissioners, and I'll start the deliberations with Commissioner Dixon whom we've heard from you already, but we'll hear from you again. If you have anything further, just --'",
        "'MEMBER DIXON': ' I'm very pleased at this point and thanks for the presentation. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner. Commissioner Cash?'",
        "'MEMBER CASH': ' No comments. Thanks for the presentation.'",
        "'CHAIR GOODMANN': ' Thank you. Commissioner Davis? Commissioner --(Simultaneous speaking.)'",
        "'CHAIR GOODMANN': ' Okay. Very good. Thank you. Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' No comments. Thank you very much.'",
        "'CHAIR GOODMANN': ' Thank you. Commissioner Cozart?'",
        "'MEMBER COZART': ' No comments. Thank you to the staff for your presentation.'",
        "'CHAIR GOODMANN': ' Thank you. Commissioner McMahon?'",
        "'MEMBER MCMAHON': ' Thanks. I would just second Commissioner Dixon's comments about any comments about critical issues including, you know, landscaping and the importance to maintaining the natural environment in D.C. and environs. I appreciate the efforts of the staff, and I really appreciated the additional background information in the applicant's presentation talking about the history of the Browne School. Other than that, no comments.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner McMahon. Commissioner Stidham?'",
        "'MEMBER STIDHAM': ' Thank you very much for the presentation. I really appreciate seeing the fine work and no other questions or comments from me.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'MEMBER ARGO': ' Yes. I echo comments from Commissioner McMahon and with that, no further questions. Appreciate very much --really appreciate the presentation and, you know, a robust discussion.'",
        "'CHAIR GOODMANN': ' Yes. Thank you, Commissioner Argo. Commissioner Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes. I actually agree with all of the comments from our Commissioners today thus far. And as particularly, it is important to have that history, and I think the plan is really good. The fact that we're using a smaller footprint for the gym and the materials are going to be more consistent with 1932 is very, very good. Thanks. And also, when you talked about the emphasis on more daylight, it reminds me of the Rosenwald Schools, and I think that's really important as well. And I appreciate the robust discussion on pollinators and the fact that we're going to have a pollinator plant, I think that's fun, so thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett, very much. Commissioner Green?'",
        "'MEMBER GREEN': ' I appreciate the presentation and particularly the clarifying comments. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Green. Commissioner Wright?'",
        "'MEMBER WRIGHT': ' I have no comments. I bureally siness. don't think this is any of our'",
        "'CHAIR GOODMANN': ' Thank you, thank you, Commissioner Wright. I would just like to thank the staff today for their presentation and thank Mr. Berne for his insights and that he's willing to share with us is appreciated very much. And we do appreciate the Commissioners' comments. I would endorse all of them. I appreciate the history of the site, and I do appreciate the robust discussion on landscape, because it is consistent with all of the projects that we review, that we're always going to be dealing in some manner or form with landscaping. And so it was educational for me. Thank you very much. Are there any further questions or comments? Hearing none, Ms. Koster, will you please confirm the motion and take the roll?'",
        "'MS. KOSTER': ' Certainly. The motion was made by Commissioner Dixon, seconded by Vice Chair Hewlett, and now we'll take the roll call. Commissioner Cozart?'",
        "'MEMBER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'MEMBER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham? You're on mute but I can see you.'",
        "'MEMBER STIDHAM': ' Yes. Sorry, slow to get off mute today.'",
        "'MS. KOSTER': ' That's all right. Commissioner Argo?'",
        "'MEMBER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodman?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'MEMBER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'MEMBER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'MEMBER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Cash?'",
        "'MEMBER CASH': ' Yes.'",
        "'MS. KOSTER': ' And Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' I abstain.'",
        "'CHAIR GOODMANN': ' Thank you. The motion has carried.'"
    ],
    "5B. NATIONAL CAPITAL PLANNING COMISSION COMPREHENSIVE PLAN INTRODUCTION CHAPTER UPDATE AND 5C NATIONAL CAPITAL PLANNING COMISSION SUBMISSION GUIDELINES EQUITY UPDATES": [
        "'CHAIR GOODMANN': ' Moving on to Agenda Item 5B, it's to authorize the release of updates to the Federal Elements of the Comprehensive Plan for public comment. And I just want to note that Agenda Item 5C is for authorization to release draft equity updates to the submission guidelines for public comment. So these two items actually share a common period and are intended to work in tandem in regards to the equity issues. And for that reason, the staff will provide a joint presentation now. The Commission will make motions and vote on each agenda item separately following the questions and deliberations. I hope that's clear. So Mr. Smith and Ms. Drakeford are prepared to make a presentation, and please feel free to begin. Thank you.'",
        "'MR. SMITH': ' We good to go?'",
        "'CHAIR GOODMANN': ' Yes. Are you able to see -- we can see the presentation, yes.'",
        "'MR. SMITH': ' Okay. Good afternoon, Chair Goodmann and Commissioners. My name is Chrishaun Smith, Urban Planner with the Policy and Research Division. I am here with Brittney Drakeford to present to you our agency's efforts to update the introduction chapter of the Comprehensive Plan with a request to authorize release of the draft updates for a 90-day public review and comment period. Next slide. As you all are aware, the Comprehensive Plan is NCPC's blueprint for the long-term development of the National Capital region and the decision-making framework of for the Commission's actions on plans, proposals, and policies submitted for its review. The information presentation this March outlined proposed updates to the Comprehensive Plan Introduction chapter following some initial research and outreach. Based on your guidance and additional outreach, staff is proposing updates that attempt to address critical planning challenges across the National Capital region.'",
        "'MS. KOSTER': ' Excuse me, Chrishaun.'",
        "'MR. SMITH': ' Yes.'",
        "'MS. KOSTER': ' Would you mind holding for just a minute?'",
        "'MR. SMITH': ' Sure.'",
        "'MS. KOSTER': ' I think the screen sharing is showing the presentation mode and not the -- thank you. I think we're good to go now.'",
        "'MR. SMITH': ' Okay. We're good?'",
        "'MS. KOSTER': ' Yes.'",
        "'MR. SMITH': ' Okay.'",
        "'MS. KOSTER': ' Just wanted to make sure everyone was seeing the big picture, so to speak. Thank you.'",
        "'MR. SMITH': 'Thank you. So I'll reiterate the slides. So the Comprehensive Plan is NCPC's blueprint for the long-term development of the National Capital region and the decision-making framework for the Commission's actions on plans, proposals, and policies submitted for its review. The information presentation this past March outlined proposed updates to the Comprehensive Plan's introduction chapter following some initial research and outreach. Based on your guidance and additional outreach that we have conducted, staff is proposing updates that attempt to address critical planning challenges across the National Capital region. The aim is to create guiding principles, any framework that can be used to address a broad and updated set of critical planning challenges, and future updates to the Federal Elements. One effort to invent these new planning efforts into our work at NCPC is the equity updates to the submission guidelines that will be discussed later during this public hearing by'",
        "'MR. SMITH': 'my colleague, Laura. Next slide. I wish to note that the proposed changes to the introduction chapter were catalyzed by guidance from this Administration that seek to address equity, which includes Executive Order 13985, Advancing Racial Equity and Support for Underserved Communities through the Federal Government, which was signed in February of 2021, and Executive Order 14091, Further Advancing Racial Equity and Support for Underserved Communities through the Federal Government, which was signed in February of 2023, both of which directs the federal government and its agencies to pursue a comprehensive approach to advancing equity for all including people of color and others who have been historically underserved, marginalized, and adversely affected by persistent poverty and inequality. In response to these Executive Orders, NCPC prepared an equity action plan in 2021 which was amended this year and identified five action items that would help the agency address and incorporate equity'",
        "'MR. SMITH': 'consideration. As identified in action item number 2 of the equity action plan, NCPC will develop a comprehensive framework and guiding principles within the introduction chapter to address equity across the plan, guide subsequent updates, and inform agency review and planning initiatives. Additionally NCPC's efforts also respond to Executive Order 14008, Tackling the Climate Crisis at Home and Abroad, which was signed in February of 2021, and Executive 14096, Revitalizing Our Nation's Commitment to Environmental Justice for All, which was signed in April of this year, that attempt to address adverse environmental and health impacts as a result of climate change. In response to these Executive Orders, NCPC prepared a climate action plan in 2021 and identified five priority adaptation actions. As identified in one of the priority adaptation actions, NCPC will update the Federal Elements to incorporate climate adaptation strategies into guidance for decision-making and planning and increase awareness'",
        "'MR. SMITH': 'of current climate change risk. Next slide. The draft Introduction chapter update is intended to modernize the chapter to address critical planning challenges identified within the National Capital Region. This includes incorporating equity and climate resiliency considerations in the Comprehensive Plan as identified by NCPC's equity and climate action plans as well as planning for the changing workplace environment within the region as the federal government shrinks its office footprint. The draft update provides the historical context of underserved communities in the region, unjust planning impacts that may have affected these communities as well as a new principle guiding the agency's equitable planning policies. The draft document proposes to incorporate new policy guidance addressing the changing economic and environmental landscape because of the COVID-19 pandemic and a rapidly changing climate. Specifically, through this revision, staff is seeking to one, engage with stakeholders in underserved communities to identify and develop and'",
        "'MR. SMITH': 'equity framework; two, update statistics and data points to reflect current trends and critical planning challenges; three, incorporate a historical context and reflection of NCPC practices and impact on underserved communities; four, expand upon existing smart growth principles to address sustainability, climate change and resiliency and last, but certainly not least, to establish a comprehensive framework to address equity. Next slide. To better engage underserved communities and the broader public in the National Capital Region, staff took a series of steps to create a planning process and framework that incorporates equity. This process included conducting an analysis on different policies and programs that impacted underserved communities throughout the NCR, identifying the contemporary impacts of these policies, and clarifying NCPC's role and scope to address these impacts in the present day. Our team presented this framework to you during the March 2023 information presentation on the introduction chapter update. Since that'",
        "'MR. SMITH': 'time, we have met with the following stakeholders who provided feedback and insights on our processes, met with local community organizations in January of this year. We met with local planning agencies representing jurisdictions across the National Capital Region in May of this year. We also met with local university representatives that are engaged with the intersectionality between equity and land use in May of 2023. We met with a Committee of 100 based on advice and advisement from you as the Commission in July of 2023, and we met with federal agency stakeholders in November of 2023. During this entire time, the NCPC Equity Task Force has -- we've engaged with them internally with the changes to the introduction chapter. During these meetings, staff discussed the history of NCPC, the purpose of the Comprehensive Plan, and identified NCPC's administered policies in the past that may have had adverse impacts,'",
        "'MR. SMITH': 'reviewed the process for revising the introduction chapter with an equity-based focus, and reviewed the draft equity principle and corresponding key objectives. Across all of our focus group discussion, community engagement with underrepresented groups was looked upon as the primary consideration that NCPC should focus its efforts to more clearly develop policies and regulations on to address equity in the Comprehensive Plan. There was consensus that NCPC is removed from most of the federal development discussions at the local level and would value collaborative discussions across stakeholder group and jurisdictions. Focus group participants recommended that NCPC focus on crafting additional tools to outreach with the local communities for them to better understand NCPC's authorities and the differences between NCPC, including what can be defined as the federal interest, the District, and other local governments' involvement in the development review process. Another opportunity recommended by the focus group attendees would be'",
        "'MR. SMITH': 'to strengthen NCPC's role as a liaison between federal agencies and the local communities by conducting or requiring federal agencies doing earlier planning stages of their capital developments, additional workshops and town halls with local community members as well as local government representatives. Information from these discussion sessions was used to modify the proposed equity principle and key objectives. Staff will continue to collaborate with these stakeholders during the 90-day public review period. From here, I will turn it over to my colleague, Brittney Drakeford, to discuss in more detail the proposed updates.'",
        "'MS. DRAKEFORD': 'Thank you, Chrishaun, and good afternoon, Chair Goodmann and Commissioners. I am Brittney Drakeford, Urban Planner in the Policy and Research Division, and I will now walk you through the substantial revisions that we made to the introduction chapter of the Comprehensive Plan and identify how it aligns with the objectives that Chrishaun mentioned earlier. The first major revision of the introduction chapter involves updating statistical information to reflect current trends and address pressing land use and development challenges. The current Introduction chapter was last updated in 2016 and does not include some of the most recent scientific data and existing conditions covering land use, environmental, and workplace challenges such as climate change and resiliency, and the changing nature and location of work. Staff have incorporated updated data on visitor information, workplace trends, and economic statistics throughout the document. Additionally, the 2016 introduction chapter does not include information pertaining to'",
        "'MS. DRAKEFORD': 'the devastating impacts on the local, population health, and social cohesion because of the COVID-19 pandemic. To respond to this, staff created a new section titled, \"Critical Planning Challenges.\" This section describes the existing conditions for five issues that federal planners and policy makers must address with urgency in the 21st Century and highlights previous and ongoing actions implemented through the NCPC's work programs that address these topics. The five critical planning challenges are: environmental sustainability and resilience; social health and racial equity; commemoration diversity; urban space and security; and the changing federal footprint. The second major revision involves providing a broader context of urban planning history in the National Capital Region that acknowledges the presence of indigenous and underserved communities and direct and contemporary impacts of planning policies, practices, and programs on these groups. Today's Washington, D.C. is the result of a confluence of cultures dating back nearly 4,000'",
        "'MS. DRAKEFORD': 'years prior to the development of Washington, D.C. as the Nation's Capital. The 2016 introduction chapter, as adopted, largely excludes the influence of indigenous planning and colonial development practices that predate the 1791 L'Enfant Plan. To reflect this history, two new paragraphs were added to the beginning of the L'Enfant Plan Era section. These new paragraphs briefly highlight the legacy of land dispossession, enslavement, and the history citing of the Nation's Capital along the Potomac River. These paragraphs provide additional context to the development of Washington, D.C. prior to 1791 and identify the presence of indigenous people in the National Capital Region prior to European settlement, acknowledge the importance of Irish and Scottish immigrants in shaping Georgetown as a merchant port, and highlights the work of Benjamin Banneker, a free Black man, in finalizing L'Enfant's plan with Brothers Andrew and Benjamin Ellicott. Additionally, a new section was created called, \"Confronting'",
        "'MS. DRAKEFORD': 'the Legacy: Examining the Impacts of NCPC's Past.\" This section delves into present day equity implications of planning projects or policies that were prepared, reviewed, or adopted by NCPC. It is important to note that prior to the Congressional enactment of the District of Columbia Home Rule Act in December of 1973, NCPC and its predecessor, the National Capital Park and Planning Commission, served as the planning agency for the District of Columbia. The agency was responsible for a variety of local planning initiatives including housing, transportation, parks and recreation planning, and school planning. Many of these initiatives are now currently within the purview of the District's Office of Planning. And so these three legacy policies that staff analyzed were presented to the Commission during a March 2023 information presentation, and I will briefly summarize the policies and their impacts. So through the 1940's, NCPPC planned for a segregated parks'",
        "'MS. DRAKEFORD': 'and recreation system throughout the District. This practice disproportionately allocated recreational spaces for residents based on race and prohibited non-White residents from accessing prominent public spaces. The second initiative or second policy that we looked at focuses on urban renewal, and beginning in 1945, NCPPC began the process of planning, preparing, and adopting 12 urban renewal plans to restore blighted areas that posed a danger to the health, safety, and welfare of residents. These programs displaced thousands of residents and businesses, most notably, nearly 23,000 residents were displaced who were primarily African American, were displaced when the first and pilot project of urban renewal was implemented in Washington, D.C. in the Southwest neighborhood. The final major policy that we explored was the expansion of federal campuses and buildings into long-established communities that had contributed to a restricted access or physical access and open space and existing amenities to existing community'",
        "'MS. DRAKEFORD': 'members. This section concludes with a re-commitment of NCPC's work to consider and advance equity through our planning, projects, and policies. Our third major revision focuses on expanding smart growth principles to address sustainability, climate change, and resiliency. The federal government owns approximately 85 percent of the shorelines in Washington, D.C. and has many properties located within the 100- year and 500-year flood plains. Federal properties are thus vulnerable to flooding that results from heavy rains, snow melt, tropical storms, hurricanes, and flash flood events. The adopted 2016 version of the guiding principle 2 states that it is to reinforce smart growth and sustainable development planning principles. This principle seeks to encourage development with smart growth practices advocating for compact mixed use and pedestrian-oriented development near high capacity transit routes. The updated principle is revised to read as follows: Reinforce resilient and sustainable development planning principles. This provision aligns with'",
        "'MS. DRAKEFORD': 'the urgency to plan federal buildings, lands, and campuses considering the unpredictability of climate change and encompasses traditional smart growth planning while emphasizing planning for ecological compatibility and resilience in the face of climate change. The final major revision establishes a comprehensive framework for equity. Informed by stakeholder meetings, discussions with the Equity Task Force, and the Executive Orders, a new equity-focused guiding principle was created. Similar to the structure for the existing guiding principle, the new equity principle incorporates key objectives to inform future amendments to Federal Elements within consideration to equity. The new equity-focused principle referenced in the introduction chapter as guiding principle number 4 and the corresponding key objectives read as follows. The equity principle is, incorporates planning objectives that promote equitable development and opportunity for underserved communities. The corresponding key objectives highlight important components of equity thematic framework. in an organized and a And so I'",
        "'MS. DRAKEFORD': 'will just read the themes of those key objectives which include community engagement; cultural affirmation and key diversity; data analysis; economic development; physical access; and sustainability, resilience and health. The new guiding principle and key objectives will be used to provide the framework for changes to the Submission Guidelines which Laura will discuss later. So since the summer of 2022, our staff has been working diligently to embed equity in the Introduction chapter and the Comprehensive Plan. This includes meeting with representatives from nearly 20 different community organizations, universities, and local and federal government agencies in the region. Moving forward, we plan to continue our community engagement effort to solicit feedback from the public and government stakeholders. A virtual public meeting will be held on the draft introduction chapter on Thursday, January 25th at 12:00 p.m., and an in-person meeting will be held at the NCPC offices on February 20th'",
        "'MS. DRAKEFORD': 'at 6:00 p.m. We will receive written comments from the public via the project's website or by mail, and then those comments that we receive during the public comment period will be incorporated as appropriate into additional staff revisions of the document. We anticipate returning to the Commission in Spring of 2024 to adopt the final introduction chapter. With that, staff recommends that the Commission authorizes the release of the draft updates to the Federal Elements of the Comprehensive Plan for a 90-day public comment period. I will now turn it over to Laura Shipman who will provide an overview of the draft revisions to the submission guidelines which are being updated in coordination with the introduction chapter update.'",
        "'MS. SHIPMAN': 'Thank you, Brittney. Building on the previous presentation, I will now present the corresponding proposed equity updates to the Submission Guidelines which we are also requesting authorization to release for a 90-day public review and comment period. As a reminder, applicant agencies submit development proposals to NCPC by following the process laid out in the Commission's submission guidelines. The guidelines describe the content of submissions, submission stages, along with the coordination and review process. The previous presentation outlined proposed equity updates to the Comprehensive Plan Introduction chapter. And based on this guidance, staff is proposing updates to the Submission Guidelines with the aim to encourage agency applicants to conduct early and meaningful community engagement and to submit information about the equity impacts of plans and projects to inform the Commission's decision-making process. When preparing the draft revisions to the guidelines, staff looked to examples of equity tools and project review'",
        "'MS. SHIPMAN': 'requirements from federal agencies and other planning agencies in the region and around the country. NCPC's federal capital improvements program solicitation of the equity questions, and the D.C. Zoning Commission's Racial equity tool, in particular, provided helpful guidance for the draft update and review process. These updates build on the work that many applicant agencies are doing to tackle issues of equitable development and environmental justice, particularly in their own responses to current Executive Orders. In many ways, we are aiming to embed equity considerations into our review that were often already being raised by applicants, the Commission, and the public. For this update, we are using definitions for equity and underserved communities outlined in recent Executive Orders. It is important to note that the term \"underserved communities\" refers to both populations and geographic communities. The proposed guidelines are organized the six equity key objectives outlined in the draft introduction'",
        "'MS. SHIPMAN': 'chapter to frame review for consistency with the Comprehensive Plan. In addition to providing information on these topics, applicants will be asked to indicate how the plan or project aligns with their agency's equity goals. Equity consideration will be discussed as early as possible in project development and will be integrated into all stages of the project review process from pre submission to briefing to final review with increasing specificity. And responses may be cross-referenced with other documents that analyze these same considerations such as National Environmental Policy Act and National Historic Preservation Act Section 106 analysis to not create a duplicative process. With that context, I will go through and summarize the proposed equity considerations starting with data analysis. At the top of the slide is the Comprehensive Plan equity key objective and below are the proposed submission guidelines equity considerations. We asked applicants if the project is in'",
        "'MS. SHIPMAN': 'or directly adjacent to an underserved community and if so, to include socioeconomic and environmental indicators, also to describe if there were any known previous federal development impacts and how they have been addressed. Next is community engagement. As the Commission has noted previously, effective engagement is essential to equitable development. So the guidelines as applicants to describe how they have proactively engaged with communities who have historically been excluded form planning processes and coordinated with local jurisdictions, how the project has changed to address issues raised, and ongoing plans for engagement. In terms of physical access, we ask if a plan allows equitable access for visitors to onsite public amenities and employees to amenities in the surrounding community and also any barriers the proposal would create to existing community amenities and connections. Next, the economic development consideration includes the economic benefits or negative impacts that the plan or project'",
        "'MS. SHIPMAN': 'could potentially create for underserved communities. Under cultural affirmation and diversity, we ask about any efforts to partner with communities to incorporate local and under-represented cultural identities into the proposal. We also ask applicants to indicate any potential affects in the cultural resources of underserved communities. Finally, the sustainability, resilience, and health consideration asked applicants to describe how the proposal addresses climate change, natural resource, and health impacts to underserved communities. So which plans and projects will these equity submission requirements apply to? We considered applying to all submissions; however, this will create unnecessary burdens on applicants with small projects that have low potential impacts on underserved communities. Instead we propose applying the submission requirements based on project type. They always apply to master plans and commemorative works regardless of location but do not apply to antenna projects or foreign missions. Applicability is a bit more nuanced with building site'",
        "'MS. SHIPMAN': 'and park projects where the requirements would only apply to proposals that include site selection or complex projects in or directly adjacent to underserved communities. Complex projects are currently defined in the guidelines as those with significant potential impacts, offsite effects, and community interest. For the projects where the submission requirements do not apply, we may coordinate with the applicant to gather further information if there are equity concerns. In all cases where the applicant is a local jurisdiction, we would allow them to utilize their local equity review process and include the findings in the submission. With these updates, staff reports to the Commission will include a brief community profile, demographic information, and equity indicators in the project summary, the analysis of equity impacts, any considerations that have not been addressed by the proposal, and potential strategies to better meet the Comprehensive Plan equity guidance, and in the consultation'",
        "'MS. SHIPMAN': 'section, a summary of the completed and planned engagement efforts with underserved communities. As with any of the considerations in the guidelines, staff review of responses to the proposed equity considerations is intended to highlight areas early for further revision and refinement and to frame the issues for the Commission for the decision-making process. Now I'd like to walk through two recent examples of federal projects that illustrate how some of these proposed equity considerations are already being raised during the project development and review process. The Pentagon Draft Master Plan submission reviewed at the October Commission meeting included the history of displacement through eminent domain of two Black communities, East Arlington and Queen City, for the construction of the Pentagon Campus. This information aligns with the data analysis equity consideration in the proposed guidelines which asks about previous impacts in underserved communities. While the planned acknowledgment of this history'",
        "'MS. SHIPMAN': 'was supported by the Commission, you also recommended there be efforts to go beyond historic documentation and included interpretive signage or other types of permanent memorialization in consultation with descendants of displaced communities, a recommendation that aligns with the proposed cultural affirmation and diversity equity consideration. The Commission also recommended that due to past housing displacement, the applicant should include affordable housing in their future development feasibility study for potential uses on under-utilized parking lots. This plan review illustrates how an applicant could begin to address the impacts previously created by federal development in their current plan submission. Previous impacts should be acknowledged and addressed with mitigation measures where possible, especially if within the scope of the current plan or project. Another example is the Bureau of Engraving and Printing Currency Production Facility, a building and site development project that received final approval by the Commission in October. The project'",
        "'MS. SHIPMAN': 'includes significant economic development and sustainability components. However, health equity considerations were highlighted by staff during the review. The applicant identified a directly adjacent environmental justice community of concern and found that significant adverse traffic and transportation impacts to the community could result from the proposal. The applicant proposed offsite intersection improvements as mitigations for these disproportionate impacts. However, staff requested that the applicant also provide an analysis of impacts on air quality in the surrounding environmental justice community through the supplemental environmental assessment. This plan submission and review illustrate how an applicant could identify and seek to mitigate anticipated health impacts on surrounding underserved communities and also how environmental analysis can be cross-referenced to respond to some of the proposed equity considerations in the Submission Guidelines, particularly those related to sustainability, resilience, and health. As a next step, staff recommends the Commission authorize the release of the draft Submission'",
        "'MS. SHIPMAN': 'Guidelines for a 90-day public comment period. The public engagement and review timelines for the draft guidelines will be the same as outlined in the previous presentation for the Introduction chapter. As noted previously, we plan to hold two public meetings and for the public listening in, more information and registration will be available on the NCPC website when the public comment period begins. In addition, a resource guide will be created after adoption of the revised guidelines to support applicant agencies in applying an equity lens to their master plans and projects. That concludes our presentations. We are available to answer any questions on either the introduction chapter or the submission guidelines updates. Thank you.'",
        "'CHAIR GOODMANN': ' Well, thank you very, very much. First, I want to thank and recognize the staff for the excellent presentation. Ms. Drakeford, thank you, and Mr. Smith and Ms. Shipman, thank you very much for that thorough presentation. And to remind the Commission, there are going to be two motions at the conclusion of our deliberations, but we've just heard, you know, the updates to the Federal Elements of the Comprehensive Plan and we heard the presentation on the draft equity updates to the Submission Guidelines. And we're going to now have a joint conversation and deliberate on the two subjects, but we will entertain two separate motions at the conclusion of our deliberations on these --on the authorization that's requested. So I'm going to begin those deliberations right now. Please turn on your cameras and your microphones. And I'm going to start the deliberations with Commissioner McMahon, please.'",
        "'MEMBER MCMAHON': ' I appreciate the hard work and so we've been working these issues for a while, participated in. It was interesting to see the Pentagon Master Plan brought up as a good example as they walk through. I think some of the issues are highlighted when it came about how those recommendations actually get executed and practiced, and that'll be a years-long effort which we'll obviously support. Other than that, I have no other comments right now. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner McMahon. Commissioner Stidham?'",
        "'MEMBER STIDHAM': ' Thank you for that very thorough presentation. I don't have any questions or comments right now. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'MEMBER ARGO': ' Just the only comment I had, it's -- I'm kind of -- I was trying to say we're on our way, but that's probably not the right term. You know, I'm impressed -- really impressed with the work we're doing on this and the -- you know, and the scope and depth of what equity really means in the planning and development process. That's my comment.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Argo. Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': 'Yes. Commissioner Argo, I think that term was exactly on point, \"we're on our way.\" I think this presentation -- both presentations were immensely powerful. Hearing them earlier in the year was powerful. The updates are very, very impactful. They're meaningful. It's not just lip service. And it's so important to recognize the generations of inequities and the segregation and the displacement of thousands of people, many of whom happen to be African American, the failure to recognize the Native American history in our area, it's -- the impact, the health disparities, so much -- you all have provided such tremendous work, and you put so much work into this and have delivered a product which I am personally very, very proud of, and I imagine our Commissioners are as well. And so I wanted to commend Mr. Smith, Ms. Drakeford, and Ms. Shipman and as a matter of personal'",
        "'VICE CHAIR HEWLETT': 'privilege, I want to give kudos because I know that each of the three of you also honed your immense skills at a neighboring entity in which I happen to overlap with each of you. So I wanted to give special kudos to each of you.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. We -- can we please now hear from Commissioner Green?'",
        "'MEMBER GREEN': ' Thank you. No. I really appreciate it. This is wonderful work and it's great to see it come to fruition and the voicing what reactions come through the public process. The one part I just want to say I did particularly appreciate is I appreciated the attempts to scale it to the types of projects and the applicant's own internal processes as they develop to make sure that -- I do appreciate that. And this is wonderful. And I look forward to seeing this become official. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much Commissioner Green. Ms. Sullivan, I see your hand up. Can it wait until the end of the comments or is it important?'",
        "'MS. SULLIVAN': ' My hand is not up. That's weird. Did I raise my hand? Is it showing that my hand is up?'",
        "'CHAIR GOODMANN': ' It is on my screen but that could just be --'",
        "'MS. SULLIVAN': ' Oh, well, that's new. Okay. But no, I did not raise my hand but --'",
        "'CHAIR GOODMANN': ' Okay. I thought there might be something --'",
        "'MR. SULLIVAN': ' On the A list.'",
        "'MR. GOTTO': ' -- we had to know. Okay. Thank you. Commissioner Wright, please?'",
        "'MEMBER WRIGHT': 'Okay, I have comments, and I'm sure that GSA will have a lot to say further in the comment period, but I have a couple of points that I want to make. First of all, I think this is, at every turn, I'm glad you gave the two examples, although if I never hear about the BARK facility again, I'll be very happy. I'm going to have nightmares about that project in retirement, but it's really important to illustrate what this means, and so giving the Pentagon master plan and the Mint facility in Beltsville is a good thing to do because it's hard to understand planning. I know this is heresy for all of this crowd, but planning is so boring for most people, and arcane, and impenetrable, and I think it's important to give examples and educate the public at every turn what we're talking about here, because'",
        "'MEMBER WRIGHT': 'a lot of people won't understand it and say oh, what's this got to do with anything? The second thing is, and maybe this is because I, you know, shepherded three humans through their teenage years, but trust but verify. When people give you examples of community engagement, make sure they're real and legit, and ask for proof and documentation. I don't think that's a heavy lift and people will fudge it. I think these things are so often turning into a box checking exercise and you can't let that happen. You've put a lot of work into this and it's really important that you hold people accountable. And then the last piece, and we'll probably write about this, but I heartily disagree with one thing, and that is leaving the antennae installations out of this. If any of you -- because it's already the Wild West and the carriers'",
        "'MEMBER WRIGHT': 'are the sheriffs, and I don't think that it's wise to exclude these installations. Because I'm assuming that when you say antennas, you're not just talking about rooftops. You've talking about the small cell equipment that has to be at street level, and leaving it up to the carriers is probably, their interpretation of what you mean or letting them be excluded altogether is probably not wise. We'll comment in writing about it, but those are my points.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Wright. Thank you. Commissioner Dixon?'",
        "'MEMBER DIXON': 'Madam Chair, I have spent some time with the staff talking about this direction, and I think they've done a great, great effort in putting together what we see today. I'm really very eager to hear what kind of, and as Commissioner Wright said, real participation we can generate around review while this is out from the community. I get a little emotional, as I have on other issues, but I get a little emotional because first of all, one of the major things, and some of this is not within the District of Columbia's -- it's in the District of Columbia's hands more than in the federal hands, but this document we're writing is basically going to be a combined effort, I would hope, with the city and with the federal effort. That is in terms of ongoing planning. But one thing, an example, one of the major things'",
        "'MEMBER DIXON': 'that happened in the world of Anacostia River East is that when they did the Southwest renewal effort, which was pictured in some of the slides, most of the folks who were in need were shifted into the land or are Anacostia River East, who received all of the public housing and everything that came there, and the impact has been ongoing. And I'm proud to say that there's a spirit and an energy there, which I grew up in, that managed to deal with that, and we're now moving into another phase where we're getting a lot more focus because of the value of the land and all of the things that are happening. And I just, I'm concerned. I look at the federal presence there along St. Elizabeth's West Campus. When I was a young person, that was the hospital, and there were people in my neighborhood who'",
        "'MEMBER DIXON': 'worked there as professionals, as clerical, as persons in the cafeteria, and we would see them in their uniforms whenever they may be walking, going up the street, up then Nichols Avenue, which is now Martin Luther King. It used to be called Asylum Road because there was an asylum, insane asylum, but that was not during my era. But they would go there to work. So, they were not only -- we at least were beginning to benefit from employment in that situation. So, I hope that we just don't include folks in hearing about what's happening because that's critical, engaging them and telling them what's going to happen in their communities, but don't forget including them in the work, and this is a contracting kind of statement, quite honestly. Including them in these projects so they can be a part of this economic benefit that comes from the'",
        "'MEMBER DIXON': 'work that's going to be done here, and that's, again, kind of a delicate thing of how do you do that. I know one way we do it is not to waive the minority contracting requirements that was a law I put in place in the 1970s, which is now basically being waived, so we are not involved as much as we should be in the work that's being done in our community. There was no hesitation to use us to build most of the city for free when we were enslaved, but now when we're not, we're not included, and we've got to find ways to see how we can bridge that gap. I know it's capacity, but it's also a matter of effort. And I could go on and on with this because I've seen this not only as a public official, but I've seen this as a'",
        "'MEMBER DIXON': 'business man for 30 years, and I've seen the trend, and I've been involved in a lot of projects that have not just low-task requirements, but high-task requirements, technology requirements that I could participate and offer services in. So, I hope that we look at this because this is where the rubber meets the road. You know, the development is a physical -- oh, that's fine, that we got to be included. We should be engaged in that, but we've got to make sure that when it comes, we can hopefully find ways to be a part of it from both, from the economic inclusion in that process. I think I've said what I can say and I'll be watching this, and as Commissioner Wright said, we've got to have some verification on this stuff and watch it closely because it's changing greatly, a lot of wavering going on. Thank'",
        "'MEMBER DIXON': 'you.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Dixon. I appreciate those comments very much. Commissioner Cash?'",
        "'MEMBER CASH': ' I think a lot's been said on the substance, so I won't repeat that all, but I will just say on a technical note, congratulations to the staff for getting a 24-page introduction and framework chapter, and I'm hopeful that when D.C. looks at its Comprehensive Plan next time, we can strive for something as short and pithy as that. So, thanks for all the work and I'll look forward to hearing the comments on it.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cash. Commissioner Davis?'",
        "'MEMBER DAVIS': ' Apologies for being late here. No comments from me. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Davis. Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' No comments.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Giachetti. Commissioner Cozart?'",
        "'MEMBER COZART': 'I also want to join other commissioners in really commending the staff for this great work with a lot of fairness, but I also want to add intentionality clearly comes across in what you've put together. And to Commissioner Wright's point about planning being impenetrable, I can't help but think that there is wonderful sequencing of the centennial information that you're going to be sharing and the release of these items that really may help us penetrate a little bit and help people understand what is this all about, like why does it matter, and connect it to history, our present and our future. And so, if you already thought about sequencing those things that way, then you are strategic minds and we're happy about it. If it just so happens, then I encourage you to take advantage of that. And Commissioner Cash, yes, they've thrown down the gauntlet on'",
        "'MEMBER COZART': 'having concise information coming through in a comprehensive plan, and I'm happy to take the lead and take you all's lead as it relates to that. I think it actually really sets things up well for the rewrite, which we'll start in 2025. So, thank you all for your thoroughness, your intentionality, and all of this great progress that you've done.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Cozart, and I too want to echo so many of the comments that have been made. The examples from the work that we've reviewed and the history that's gone into, and the thoughtfulness and the intentionality is breathtaking, and when I reviewed this earlier this month with staff, I was really, I'll use that new term we're using, blown away. I think that you all did a really, really tremendous job. And it's so critically important, you know, for the work that we do as a commission, and so, I mean, I just cannot thank the staff enough, and I look forward to using these guidelines as we review so much in the future, and I'm eager to hear what public comments are returned in the coming weeks and months. So, thank you very much for your efforts. And just as a reminder again, we had a'",
        "'CHAIR GOODMANN': 'discussion on both of these issues, but we will have separate motions. Do we have any further questions before I ask for a motion, any questions or discussion, comments? Okay, hearing none --'",
        "'VICE CHAIR HEWLETT': ' Madam Chair, I move that we release the updates for the Federal Elements of the Comprehensive Plan for the 90-day public comment period.'",
        "'CHAIR GOODMANN': ' Thank you very much, Vice Chair Hewlett. Is there a second?'",
        "'MEMBER DIXON': ' I second.'",
        "'CHAIR GOODMANN': ' Thank you very much. There's been a motion and a second. Ms. Koster, could you please confirm the motion and the second, and take the roll?'",
        "'MS. KOSTER': ' Thank you. The motion was made by Vice Chair Hewlett, the second by Commissioner Dixon. With that, Commissioner Cozart?'",
        "'MEMBER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'MEMBER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'MEMBER STIDHAM': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'MEMBER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodman?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'MEMBER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'MEMBER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'MEMBER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'MEMBER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'MEMBER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' And Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' Abstain.'",
        "'CHAIR GOODMANN': ' Okay, thank you very much. The motion has carried. And now we would have the second, this next agenda item, and is there a motion to authorize release of the draft equity updates to the submission guidelines for public comment?'",
        "'VICE CHAIR HEWLETT': ' So moved, Madam Chair.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. Is there a second?'",
        "'MEMBER WRIGHT': ' Second.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Wright. Is there any further discussion on this topic? Okay, no further questions or comments. Ms. Koster, could you please confirm the motion and second, and take the roll?'",
        "'MS. KOSTER': ' Sure, the motion was made by Vice Chair Hewlett and seconded by Commissioner Wright. With that, Commissioner Cozart?'",
        "'MEMBER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'MEMBER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'MEMBER STIDHAM': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'MEMBER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodman?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'MEMBER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'MEMBER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'MEMBER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'MEMBER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'MEMBER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' And Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' Abstain.'",
        "'CHAIR GOODMANN': ' Thank you very much. The motion has carried.'"
    ],
    "6A. WORKPLACE SCENARIO PLANNING STUDY ": [
        "'CHAIR GOODMANN': ' And the last agenda item, well, almost the last agenda item, we have an information presentation regarding the Workplace Scenario Planning Study. Ms. Lindsjo will be making a presentation, I believe, now, and we welcome you to please turn off your videos and mute yourselves for the presentation.'",
        "'MS. LINDSJO': ' Right, good afternoon, Chair Goodmann and Commissioners. Today, I will be providing you with an information presentation on our Workplace Scenario Planning Study. (Audio interference.)'",
        "'MS. LINDSJO': 'As a reminder, in March of 2021, the Commission decided to defer action on further changes to the Federal Workplace Element, which we started to update in 2019, so staff could continue to study the potential long-term impacts of the pandemic on the workplace. The Federal Workplace Element of our comprehensive plan, our long-range planning document, addresses the core policy issues and goals that shape the federal workplace environment, including the planning, the location, design, and operation of federal workplaces. To note, in 2016, the workplace element, there is a telework policy as telework was established, just not as widely used. Last year, we provided an information presentation to the Commission to discuss our new partnership with the Metropolitan Washington Council of Governments, COG, on our workplace scenario planning effort. Given the uncertainty of how much telework and remote work federal agencies will adopt in the long-term, NCPC, in partnership'",
        "'MS. LINDSJO': 'with COG, conducted scenario planning to better understand the cumulative impacts of federal telework and hybrid workplaces on our region. Earlier this year, we hired consultants, including the Schreifer Group, Wells and Associates, and HR&A, to help us with this project. Today, I'll be providing you background information on our study, and we'll pass it to our consultants to share their draft key findings from our scenario planning efforts. Keep in mind this is the first time anyone is looking at this, and it will be shared among stakeholders in the following weeks. This is a regional partnership, and again, is a scenario planning exercise that we hope will help agencies and jurisdictions as they move forward. Our study considered three baseline scenarios, maximum telework, moderate telework, and minimum telework, and analyzed how they may impact the region's federal real estate, federal workforce demographics, where federal workers live, public transportation'",
        "'MS. LINDSJO': 'and commuting patterns, with consideration for crosscutting areas, including environmental sustainability and resiliency, and equity. To inform our scenario planning effort, we split the project into four phases. In the first phase, we kicked off the study in May of this year, where we held a roundtable discussion with leaders in the field to have an open dialogue to help inform our scenario planning and to refine our work plan as we proceed with our study. This step helped us refine the scenarios and identified the key drivers that should be considered. As we moved on with our ongoing outreach efforts, in phase two, we held a series of virtual focus group interviews with federal stakeholders to really understand how agencies are incorporating telework and remote work, and how they may be influencing federal hiring, federal commuting, and workspace needs. We interviewed a variety of workspaces, including defense with intelligence'",
        "'MS. LINDSJO': 'offices, campuses with research and lab components, defense with training facilities, as well as administrative headquarters, and these were all located in different jurisdictions within the National Capital Region. We also conducted case studies during this time. As we moved into phase three, we gathered all of the information from our stakeholder outreach and targeted research, and we considered the direction, the timing, and the magnitude of the key drivers to see how they may affect our scenarios. This information was then summarized in a key findings report, which our consultants will share with you the draft findings today, and to keep in mind the final key findings report will help inform future policies and our comprehensive plan, specifically the Federal Workplace Element, and be a resource to help make more effective decisions as jurisdictions move forward from the pandemic. Now, I would like to pass it on to Paul'",
        "'MS. LINDSJO': 'Desjardin with COG. He's the Director of Community Planning and Services who will say a few words before I pass it on to our consultants.'",
        "'MR. DESJARDIN': 'Thank you, Melissa. Good afternoon, Chair Goodmann and Commissioners. I'm very pleased to be here with you again today. As you know, COG is the association of the 24 local governments in the Washington area, and our work includes planning for air and water quality, climate change, land use growth and the economy, affordable housing and public safety to name a few program areas. More significant, COG is also staff and host of the National Capital Region Transportation Planning Board, the federally-designated Metropolitan Planning Organization or MPO that convenes local and state transportation officials and other key regional transportation organizations such as WMATA to determine strategic allocation of federal transportation funds for local projects and studies. As a result, much of our technical and policy work focuses on working with local officials and regional organizations while they plan for growth so we can better link affordable housing with employment centers'",
        "'MR. DESJARDIN': 'such as those populated by federal agencies. COG has had a long and very successful partnership with the NCPC, sharing studies and analyses on topics such as income tax bracket, federal parking needs, commercial rail traffic, and as well as signature events such as a forum we jointly convened to address design challenges from the results of September 11. For this project, as Melissa noted, COG was pleased to host the initial workshop last spring with our planning directors and federal partners, and also actively continue our work with NCPC as this work continues to advance. The federal gove rnment is the largest employer, landlord, and land owner in Metropolitan Washington, and planning for the future federal presence is essential for making informed local and regional capital investment decisions to ensure the continued prosperity of our region. We look forward to not only hearing your comments today, but also having'",
        "'MR. DESJARDIN': 'the opportunity to share the results of this analysis with our technical and policy forums at COG. Thank you.'",
        "'MS. LINDSJO': ' Thank you, Paul. I would like to now pass it to Stan Wall from HR&R, who is part of the consultant team and who will share our draft scenario planning findings.'",
        "'MR. WALL': 'Thank you, Melissa and Paul, and good afternoon, Chairman Goodmann and members of the Commission. Thank you for having me here today. My name is Stan Wall and I'm Managing Partner of the Washington D.C. office of HR&A Advisors. We are a real estate and economic development consulting firm, and I will be presenting on behalf of our consulting team. Next slide, please? This afternoon, I'll provide a summary of our key findings on the implications of telework on federal real estate, walking through an overview of the project, existing conditions and trends, teleworking scenarios that were evaluated, and concluding with a summary of key findings. Next slide, please? In adding to HR&A Advisors, our multidisciplinary team including the Schreifer Group, a firm that supports federal agencies on facilities planning, development planning, and organization development, and led by Jill Schreifer. We were also joined by Wells and Associates, who focuses'",
        "'MR. WALL': 'on traffic engineering, transportation planning, and transportation management, represented by Jim Watson. Next slide? This report was commissioned by NCPC and COG to better understand the cumulative impacts of federal telework and hybrid workplaces on the national capital region, and to help inform NCPC's updates to the policies in the Federal Workplace Element. The primary focus of this report is on the ramifications of federal telework policy, on the federal real estate footprint in the National Capital Region. Our key findings are informed by our extensive research and analysis, geospatial evaluation, stakeholder engagement, including interviews with federal agency representatives, and case study research. We recognize that in addition to considering federal telework policies and implications for its real estate footprint, agencies must also consider government-wide policies, financial and equity considerations, procurement power, design and delivery of federal technology, as well as the environmental costs of these decisions. If agencies consider'",
        "'MR. WALL': 'more long-term telework policies, agencies must then consider a myriad of other concerns, including in-office attendance policies, funding issues related to reconfiguring space needs, and work/life cultural shifts. This study builds upon past efforts and studies. It is not meant to be definitive in predicting the choices that policymakers will make. Rather, it differentiates itself by viewing these issues through three scenarios to understand how teleworking trends could impact a range of factors across the regions, ones that could be used as additional information becomes available. We also recognize that this is an ongoing, ever-evolving issue, and our work in this report and with our scenario planning is meant to provide a base to discussion and provide key areas that agencies would see as implications. Before the pandemic, the federal government mainly required in-person work, but telework on a limited basis was supported, and in some cases encouraged, by many'",
        "'MR. WALL': 'agencies. In 2019, fewer than a quarter of all federal employees teleworked, and of those who were eligible, 56 percent took advantage of the telework options. Agencies struggled to track telework participation and eligibility. In 2020, with the onset of the pandemic, the federal government instituted work from home policies. This shift caused major shifts in federal government operations in the National Capital Region as telework has become the mainstay for many federal departments and agencies. On the one hand, with the widespread adoption of telework, many federal agencies reported increased productivity, increased work/life balance, as well as reduced overhead costs. However, some agencies question if it resulted in reduced productivity, as well as its effect on the economy and real estate of the National Capital Region. As agencies and employees return to the office after the pandemic, many are transitioning to a hybrid workplace, a workplace the incorporates a'",
        "'MR. WALL': 'mix of employees who are working in the office and those who are working from other locations. The federal government's telework policies in response to the pandemic could reshape the federal real estate portfolio, but to what extent was unclear. The GAO report demonstrated the extent of some of this issue. Agencies had excess space pre-pandemic, but post-pandemic, as much as 75 percent of agency headquarters' office space was unused. As agencies continue to consider how to return to the office, many are grappling with a variety of issues that will need to be considered. Today, the region's economy and the federal government presence are inextricably linked. Federal employment is essential to the region, with over 400,000 federal workers in the National Capital Region, making up 11 percent of the region's total employment. The federal workforce lives across this region, with the highest residency in Fairfax County, Prince George's County,'",
        "'MR. WALL': 'and Montgomery County, impacting commuting and travel patterns for those working in the District. Public transportation and commuting patterns are also linked to the federal government, with 50 percent of Metrorail stations serving federal facilities. The federal government is the single largest property owner in the region. It serves a wide variety of functions from labs and training facilities, to offices and military holdings, and for the purposes of our study, we have designated uses across three components, administrative headquarters and offices, research and lab space, and national security and defense-related spaces. As you'll see in this map, these owned and leased spaces are again distributed across the entire region. During the pandemic, a significant percentage of the region's federal workforce worked from home, which impacted many jurisdictions due to this dispersion of federal facilities. The future of the federal workplace is creating uncertainties among regional entities in their planning'",
        "'MR. WALL': 'efforts. We analyzed total leased office space and percentage of leased space expiring over the next five years based on publicly available data, recognizing that these facilities provide some flexibility for consideration by agencies. The District encompasses the most leases, indicating that the telework policy's impact is likely to continue to impact the District, but again will impact all of these jurisdictions, you know, based on changes to telework policy in the future. While some parts of the region have more leases expiring, the presence of national security or defense-related facilities do provide more stability in some of these jurisdictions. The National Capital Region is one of the main engines of economic growth on the East Coast of the United States, but recovery from the pandemic has slowed, exacerbating existing economic challenges, including labor shortages, high office vacancy, rising housing costs, and public transit challenges. Across our four trends in'",
        "'MR. WALL': 'the National Capital Region, there are some major shifts in regional trends that will be impacted greatly by the teleworking policies of the federal government. On federal real estate, regardless of any policy, government-wide policy has been to reduce the federal footprint. This will likely continue, but the way which it will be implemented will likely depend on a variety of factors, such as the use of the facility and the ability to flex the space. With almost 40 percent of employees entering retirement age and the desire to attract young talent, teleworking policy can impact recruitment, retention, and hiring practices. While demographics show racial diversity in the workforce, this diminishes with age, indicating barriers to advancement. Metro continues to face major challenges. Public transit use has plummeted to just 27 percent of pre-pandemic levels during the peak of the crisis, and has been slow to recover. The combination of'",
        "'MR. WALL': 'teleworking, safety-related service disruptions, and the degree of crime around several stations has hindered the return of commuters to public transit. Commuting and public transit experienced a major shift with the pandemic. Public transit use has, again, dropped quite severely, but while there's been a 25 percent improvement in ridership in 2023 compared to 2022, it still remains at only 54 percent of the level seen in 2019. Our scenario planning process and key findings are informed by, again, extensive research and analysis, geospatial evaluations, stakeholder engagement, including interviews with federal agency representatives, and case study research. This has allowed us to consider a wide range of possible options for agencies and facilities, and it's allowed us to understand some of the nuance that exists around these critical components. Interviews represented impacts across the region, and they provide insights into how our agencies and facilities are adapting to telework. In'",
        "'MR. WALL': 'addition to helping support our case study work, these interviews also helped us adapt our key findings and our understanding of how to adapt our scenario planning tool. We analyzed three case studies of representative facilities across the region to provide insights into how different agencies and types of facilities are adapting to telework. They are representative of each of the functions, administrative headquarters and office, research and lab, and national security and defense-related spaces. Our first case study was with the Department of Defense Washington Headquarters Services in Arlington, Crystal City, and Rosslyn, Virginia. This case study is the least flexible given its defense mission and facility type. The next case was the United States FDA White Oak Campus in Montgomery County, Maryland. This facility has adopted a flexible level of telework and is now reconsidering its real estate needs. And then finally, the General Services Administration, GSA Headquarters'",
        "'MR. WALL': 'at 1800 F Street in Washington, D.C. We selected this case because of its track record of pushing for creative and new uses of space. Our findings included department mission, leadership, and broader organizational policies play a key role in determining telework nuances, space allocation, and the approach to managing the changing workplace landscape. Agencies are focused on reducing their real estate footprint, although space needs vary across agencies. The presence of and use of real estate for national security and defense purposes limits those facilities' ability to allow for federal telework, indicating that there may not be as much change to real estate for those types of facilities. Some facilities, such as the GSA Headquarters, have shown remarkable resilience in adapting to challenges and trying the uses for space, whether that be infrastructure changes or the demands of the post-pandemic world. Agencies are grappling with retaining and attracting new'",
        "'MR. WALL': 'talent in an age where flexibility and teleworking are highly valued. They strive to find the right balance between offering telework and meeting operational requirements. Some agencies have seen firsthand the decline in consistent public transit use, including at GSA Headquarters, instead seeing an uptick in driving and street parking, reflecting an adaptability in commuting habits due to less frequent in-office attendance. We used this information to support building telework scenarios that would guide us in developing our work for this scenario planning analysis. There are three scenarios. Minimum telework assumes one to two days of telework per two-week period, moderate telework assumes five to six days of telework per two-week period, and maximum telework, which assumes eight to ten days of telework per two-week period. The base teleworking scenarios are then overlaid with office utilization assumptions by agency to understand the extent to which agencies might be able to'",
        "'MR. WALL': 'reconsider their real estate needs more efficiently. This is based on office attendance as reported by the GAO report. Departments or facilities with national security and defense-related spaces again are likely to have the least flexibility for teleworking due to security considerations for their mission. In looking at the minimum telework scenario, it is the closest to pre-pandemic era policies for most of the federal government. Implications on real estate would indicate agencies need to balance reducing the federal footprint government-wide with the needs of an in-office workforce, so would likely to continue the current trend of reducing leases. While it could induce some challenges to workforce demographics, the largest implication would likely be in where federal workers live and commuting patterns. With proximity to federal workplaces a necessity in considering where federal workers chose to live, transportation infrastructure would likely return to pre-pandemic levels in this scenario. The moderate'",
        "'MR. WALL': 'telework scenario implication on real estate will likely allow for federal departments and agencies to rethink space allocation and use considering how capacity and building cost energy would be used. This could likely support greater talent recruitment with younger talent favoring this flexibility. This would also likely support geographic dispersion of where federal workers live, allowing for a significant reduction in peak-hour congestion and moderate public transit use reduction. The final scenario of maximum telework implications on real estate would likely cause a major reduction in office space, with an emphasis on collaborative spaces due to low office utilization. This scenario of maximum telework would also drastically reshape the workforce demographics and where workers live, allowing for recruitment potentially beyond the region without the need for that much of a commute to the office. The goal for the summary scenario analysis was to allow stakeholders to consider where in this'",
        "'MR. WALL': 'matrix they may fall to help them consider the ramifications of shifts in these key trends, recognizing the impacts across not just real estate, but also impacts to workforce demographics, where federal workers live, and commuting patterns and the impact on transit. While the Administration has called for plans for federal employees to work more in the office, these plans will likely vary widely depending on the agency and facility's usage, and thus impacting jurisdictions differently driven by the unique mix of federal facilities that occur in each jurisdiction. In summary, teleworking will likely accelerate the implementation of reducing the federal footprint, but the usage of facilities play a pivotal role in how this impacts the agency, county, and region. Telework is a key factor in attracting and retaining young talent. In an age where flexibility is highly valued, fresh talent can support an inclusive and innovative environment, and replenish'",
        "'MR. WALL': 'the workforce as retirements accelerate. Increased telework allows for dispersion of where federal workers reside, and ultimately their commuting habits. This shift can encourage more non-work related travel, but also can lead to a marked decrease in daily Metro ridership, potentially impacting the region's transportation infrastructure. The net sustainability impact of teleworking remains unclear as building energy uses may decrease, but at-home energy costs and non-work related trips may increase. And again, each county's unique blend of agencies, the facilities' mission and usage, and lease expirations will play a key role in how each county might be impacted through teleworking changes. Looking ahead at next steps, we will continue our focus group discussions, using additional engagement opportunities to refine and finalize the report early next year. We will also recognize that additional considerations for sustainability and equity, like the presentation we heard earlier this afternoon, will be key areas for'",
        "'MR. WALL': 'consideration and additional study as this is an evolving issue. Thank you, and this concludes my presentation.'",
        "'CHAIR GOODMANN': ' Thank you very much. I'd like to recognize Ms. Lindsjo, and Mr. Wall, and Mr. Desjardin. Thank you very much for your presentation. Are there any questions at this time for our presenters? Any questions? Hearing none --'",
        "'MEMBER DIXON': ' Madam Chair? Madam Chair?'",
        "'CHAIR GOODMANN': ' Yes?'",
        "'MEMBER DIXON': ' I do have one question.'",
        "'CHAIR GOODMANN': ' I'm sorry, Commissioner Dixon.'",
        "'MEMBER DIXON': ' First of all, generally, I was very pleased with and impressed with the amount of work that's being done to look at this. The one factor that I'm not sure was touched on is the quality of work. I know that people are thinking about this, I think, measuring how the work by folks who are not in the office is comparable to those who are in the office, and I'm not sure. There's probably a phrase for it, but I didn't hear that touched upon, but I think it's probably a factor that needs to be considered.'",
        "'CHAIR GOODMANN': ' Thank you. Are there any comments?'",
        "'MEMBER DIXON': ' I guess the word is productivity.'",
        "'CHAIR GOODMANN': ' Yes, are there any comments from our presenters?'",
        "'MS. LINDSJO': ' Yes, we did not have that as part of our study. That would be something that we would look at additionally in the future if that was something of interest.'",
        "'CHAIR GOODMANN': ' Okay.'",
        "'MEMBER CASH': ' Madam Chair, I have a question.'",
        "'CHAIR GOODMANN': ' Yes, Commissioner Cash?'",
        "'MEMBER CASH': ' So, to what extent will this study be looking at kind of the, say the adjacent issues related to traffic and telework? So, I can say I live at Thomas Circle, and I've walked 14th Street between Pennsylvania and Thomas Circle every day back and forth for the last 13 years, and traffic has actually been worse downtown because all of those people that used to take Metro, they're not teleworking, but they're saying hey, I'm just going to drive now. So, it's an impact on Metro, but it's also an impact on just, like, the local roads. Will this study be looking at kind of like those adjacent issues that are coming out of the reduced number of people that think they can just now drive because it's easier?'",
        "'MS. LINDSJO': ' I think it touches upon that a little bit, but then it's going to -- it lays out how much more we need to research that specifically, because I think it's also -- this was regionally, and I think that's going to be --there's definitely going to be some points in different areas where that's more of an issue.'",
        "'MEMBER CASH': ' Thanks for that.'",
        "'CHAIR GOODMANN': ' Great, thank you, Ms. Lindsjo. Are there any other questions for the presenters? Yes, Commissioner Wright?'",
        "'MEMBER WRIGHT': ' Yeah, well, this is going to morph into a comment. Do you intend --because it has to do with some of the questions that have already been asked. Do you intend to take a position? In other words, as planners, let's say, one might think about taking a position and 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 making environmental arguments for telework. Is that the intent or is it just going to lay out the issues and let the reader draw conclusions?'",
        "'CHAIR GOODMANN': ' Do you have any comments to Commissioner Wright's question?'",
        "'MS. LINDSJO': ' Yes, so this study is going to just be a study where it is just laying out what is happening, but that would be something as we're looking at -- if we're drafting any new changes to our policies, which would be after the final report is done, we would then reach out again to the stakeholders and see if any new policies around that would happen, so that would be a potential in the future, in the near future, but not from the report itself.'",
        "'CHAIR GOODMANN': ' Thank you, Ms. Lindsjo. Is there any further follow-up questions, Commissioner Wright, or no?'",
        "'MEMBER WRIGHT': ' Well, I have comments, but I'll wait.'",
        "'CHAIR GOODMANN': ' Okay, well, then we'll move in, unless there are any other questions coming from the Commissioners, we'll move into our discussion. So, I'll just remind everyone to turn on your cameras and mics, and I'm going to begin with Commissioner Cozart this time. Any comments on the --'",
        "'MEMBER COZART': ' Appreciate the briefing. I think that the District certainly has a lot of interest in the outcomes of this study, but more importantly, in what are the policy implications. So, I'm looking forward to the study itself and the subsequent conversations that we'll be having about how the study results can inform the kind of goals and objectives that we set, and the policies that follow those goals and objectives.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you, Commissioner Cozart. Commissioner McMahon?'",
        "'MEMBER MCMAHON': 'Yeah, thanks, and I echo Commissioner Cozart's comments. Since Commissioner Cash opened the way for me to bring up just this comment here, I'm going to take a look at -- obviously, we've all seen, I think, the impact of COVID and even telework today on traffic patterns versus mass transit use, and we might as well put Uber into that conversation too just as a sidebar comment. But also, I think this issue of what we do with this study will be very critical coming out and what the results are. I think that's starting to try and dictate -- just watching how things work even within the Department of Defense, telework, and hoteling, and remote work requirements will be tough. As the study reflects, Mr. Wall, very well, with the three models you're using, it varies depending on agency and mission, and also it gets in the whole'",
        "'MEMBER MCMAHON': 'ranges of, including especially if we have an aging workforce, mentoring, training, development. Some of the interchange is absolutely critical that has to happen time and time in person, that can't be done well in telework, and even getting down to the issue of how do you actually measure productivity? We talked about quality of work and maybe even quantity of work that's accomplished in the telework environment. So, it's a thorny issue. The Department of Defense is wrestling with it right now if we take a look at our portfolio, and it also just gets highly into this whole issue of what do changes in telework patterns and work patterns do on the overall fabric of a community as we've seeing in downtown D.C. today? So, I'm waiting to see the results and I'm looking forward to participating in the conversations. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner McMahon. Commissioner Stidham?'",
        "'MEMBER STIDHAM': ' Thank you, Chair. I think this study is very timely. As we all, all of our jurisdictions continue to look at telework and the effects of telework, as well as the importance in the areas where we work and where we live. I think that understanding overall effects are extremely important as we begin to make decisions about future telework or future back in the office. So, this is just one indicator that will help us and inform our decision making, so thank you very much.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'MEMBER ARGO': 'Very interesting and informative, and the other thing I'm thinking about is how to get the broader picture by -- I mean, I'm interested in this and I wonder if how we would approach it. It would be interesting to find out if not just public, but some of the larger private non-public entities that feed into the, you know, the District of Columbia and our environ, and how they've looked at this and what some of the policies and some of the larger, for example, larger associations of businesses and operations in the District of Columbia and what, you know, how some of those may be parallel to what we're looking at from a federal perspective and may not. I'd be interested in that. It's just a spinoff of what, you know, of what we're doing. This is -- there's so many ways, I think, that, you know, that'",
        "'MEMBER ARGO': 'the COVID experience, how difficult and tragic it was in some many ways, you know, it gives us a view to, you know, to both the present and the future on the adoption of policies that affect our workforce. That's it. That was a complicated response, sorry.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Argo. Vice Chair Hewlett, please?'",
        "'VICE CHAIR HEWLETT': 'Yeah, hi. First of all, I want to just reiterate what everyone else is saying. This is a hard thing to grapple with because it varies from agency and from entity, and to some extent from person to person too, you know. So, it's hard, but we have seen that, in a lot of instances, the productivity increases with some teleworking, but then on the other hand, some people, as Mr. Wall has said, that for some entities, they question the productivity. So, it's very hard to find that balance, but I do appreciate the studies. That helps us and informs our ability to make a decision, especially as we get more and more information, so I'm very, very thankful to them. I'm thankful to Mr. Wall, good to see him again, and thank you for your presentation. Mr. Desjardin, it's very good to see you again as well, and'",
        "'VICE CHAIR HEWLETT': 'thank you for your presentation. And, of course, Ms. Lindsjo, we appreciate your presentation as well. And since I made that comment earlier about the other presenters and they're honing their skills at a certain entity, I'll do the same for you, so thank you, Ms. Lindsjo.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. Commissioner Green?'",
        "'MEMBER GREEN': 'Thank you very much. Yeah, it's certainly sobering. I mean, it's something we all see every day when we walk outside. It's just not -- weren't there. And I guess I'm most looking forward to the policy implications of this because, I mean, depending on your inclination, everyone can look at the same set of data and come up with diametrically opposed recommendations, you know, and it's important that there's some coordination in these because it's going to be terrifically important how this data is interpreted and how those policies are applied, and that's something that, I mean, we're all very much looking forward to with perhaps some trepidation, but it's going to be interesting. And again, I really appreciate this study and it was very sobering to hear it compiled so concisely, and I look forward to seeing -- again, as I mentioned, the policy takeoff from this is'",
        "'MEMBER GREEN': 'what I'm waiting for. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Green. Commissioner Wright?'",
        "'MEMBER WRIGHT': 'Well, it will surprise precisely no one to hear that I think that the Commission ought to take a position, and I think, on the issues that are in our wheelhouse, environmental, economic. Productivity, for example, we should stick to our knitting. That's not our business to determine whether or not people are more or less productive depending on their telework quotient. That's really not germane, in my opinion, to what a planning agency has to say about it. But the impact on urban form, transportation, economic development, pollution, and the list goes on, there are plenty of things that are directly in our wheelhouse, swim lane, whatever you want to call it, and I think making some recommendations based on the findings is the responsibility of the Commission. Because as I think Bryan, Mr. Green just, I think, pointed out, you know, depending on one's agenda, you could take'",
        "'MEMBER WRIGHT': 'this out and spin it any way you want, and I think that the Commission ought to stake a claim based on the findings because when it's all said and done, this is going to be a ton of work, and to just let it sit out there in the universe for, you know, anybody to interpret to serve their own agenda isn't all that helpful, so that's my two cents.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Wright. Commissioner Dixon?'",
        "'MEMBER DIXON': ' I think that it's very complicated, as Commissioner Argo, she mentioned it. It's really complicated and we all know that, I think. I also do believe that, with all due respect, Commissioner Wright, that I think we do have some concern about making our federal workforce productive. I mean, we make buildings designed so they can do things that will be more comfortable, but I understand what you're saying. We may be outside of our range to do that. I also believe that it's going to affect management style too. There are all kinds of things that will come up, but maybe they aren't within our range, so we'll have to see. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Dixon. Commissioner Cash?'",
        "'MEMBER CASH': 'Thanks. So, I think this study is going to be one of the more important things that is going to affect a lot of the Commission's activities going forward. I mean, I see -- I'm waiting with a lot of anticipation for the Federal Workforce element. I think this is going to be one of the most anticipated changes because we're really talking about the dynamics of things like the 60/40 rule. What does it even mean to work in D.C. anymore or not? Do people live there? So, I think it's going to be very information in helping the staff work through these updates to -- this is probably one of the most consequential updates to the workplace elements because, I mean, it's really just going to be a shift in paradigm of what we think of where you work and what those policies should be, how the District'",
        "'MEMBER CASH': 'interacts with our neighbors. So, I thank the staff in advance for all of the work that they're going to be doing on that, and I'll look forward to the results of this study.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cash. Commissioner Davis?'",
        "'MEMBER DAVIS': ' Yeah, thank you for the presentation. I think it's a really important discussion topic and I appreciate the information here. No further comments from me. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Davis, and Commissioner Giachetti?'",
        "'MEMBER GIACHETTI': ' Hello, thank you. No comments.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Giachetti. Well, I just want to say that, first, I was very pleased to be able to attend the convening earlier this spring. I think it's a daunting proposition that we're going to be evaluating in terms of what our future workplace looks like. And I can say, you know, not only in Washington, D.C., which is our primary concern, but I can reflect that just coming from the Midwestern perspective, this is something that's being evaluated and studied across the country in metro areas and also in smaller and mid-sized communities. But I am very, very happy that NCPC partnered with the Metropolitan Washington COG to convene this meeting, and I hope that we stay, you know, very, very engaged. The study of this is critical. I think that's been mentioned more than once. And, you know, COVID impacted us in so many different ways, you'",
        "'CHAIR GOODMANN': 'know, but it has significantly impacted the way we work, but it's also significantly impacted the health of our urban areas, our downtowns, and so we are eager to continue to look at how our metro area here in the capital will continue to evolve and develop, especially the workforce. So, we want to continue to work together with our partners in the future to have thoughtful conversations, and to identify strategies and policies that are going to benefit both the federal and the local interests. (Simultaneous speaking.)'",
        "'CHAIR GOODMANN': 'And I just want to - -I'm sorry. I just wanted to say that, you know, this isn't a study about one installation, one building, or one federal agency. This is a planning exercise that studies a broad range of implications for the federal workplace in the National Capital Region. And again, I'm just so grateful for the work that's gone on, for the presentation today, and please, you know, continue to pursue this, and we look forward to being part of that conversation at NCPC, so thank you. And please do also consider some of our more recent work on equity, resiliency, and climate in the context of these challenging questions that we face for policy. And I would like to say that this concludes the meeting, however, we've had one point of information raised, and I'm going to turn it over to Ms. Schuyler for a clarification, I'",
        "'CHAIR GOODMANN': 'believe.'",
        "'MS. SCHUYLER': ' Yes, thank you, Madam Chair. Commissioner Stidham was gracious enough to advise me that I did make an error in my legislative report, and since it's significant, we both felt it would be, required clarification. The error pertains to the Hershel \"Woody\" Williams National Medal of Honor Monument location. When the House passed the act, they deleted the 1,000-foot relationship between the monument and the Lincoln Memorial. The act that passed the House simply authorizes the monument to be on the Reserve. And I regret the error, but unfortunately, the libraryofcongress.gov did not correct their summary of the bill to note that change. So, again, there is no longer a 1,000-foot relationship. It's simply to be authorized now on the Reserve. Thank you. I'm sorry I had to ask for this time for clarification.'",
        "'CHAIR GOODMANN': ' Don't apologize. Happy to have the clarification, and appreciate Commissioner Stidham and Ms. Schuyler making those points before the close of this meeting. So, this concludes our open agenda. The next regular Commission meeting will be held on Thursday, January 4 in 2024 at 1:00 p.m. I just want to wish you and your families and loved ones a very happy, and enjoyable, and loving holiday season, and I want to thank all of you at this time too for your work, your participation, and your tremendous input to this work that we are commissioned to do. So, thank you very much, and if there is no further business, the meeting will stand adjourned.'"
    ]
}