{
    "1. REPORT OF THE CHAIR  ": [
        "'CHAIR GOODMANN': '  And I do want to report that the GSA administrator, Robin Carnahan, has informed NCPC of the designated alternates to serve on her behalf on the Commission.  And they are Nina Albert, Commissioner, Public Buildings Service; Melanie Gilbert, Regional Commissioner, Public Buildings Service;  Mina Wright, Director, Office of Planning & Design Quality; and Kristi Tunstall Williams, Deputy Director, Office of Planning & Design Quality.   I've also had the opportunity to meet    8     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   with several of the commissioners over the past month, and I'm very gr ateful for your generous welcome.  And I also appreciate all the conversations that we've had in our introductory meetings.  I just am very grateful to all of you.    Agenda item number 3 is report of the executive director, Mr. Acosta, please.'"
    ],
    "2. REPORT OF THE EXECUTIVE DIRECTOR  ": [
        "'MR. ACOSTA': 'Thank you, Madam Chair, and good afternoon. Today staff will present the final Guidelines for the Monumental Core Vertical and Surface Streetscape Elements and request the Commission's acceptance. In April, we will al so present the Draft Guidelines for the Small -Scale Streetscape Elements and request a release for a 60-day public comment period. I do want to take this opportunity to thank our Streetscape Intergovernmental Working Group members, which includes the Na tional Park Service, Federal Highways Administration, Smithsonian, General Services Administration, and 9 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com the District Office of Planning, and District Department of Transportation. I also want to commend our NCPC staff, Beth Miller, Paul Jutton, and Jeff J amawat for their tremendous work. And finally, I'd like to thank our Monumental Core Streetscape Project Manager, Meghan'",
        "'MR. ACOSTA': 'Dowker, for her professional leadership during this entire initiative. You do have my written report in your packets, and I'm happy to answer any questions that you might have.'",
        "'CHAIR GOODMANN': '  Thank you, Mr. Acosta.  And does anyone on the Commission have a question?  Hearing none, Agenda item number 4 is a legislative update.  Ms. Schuyler.'"
    ],
    "3. LEGISLATIVE UPDATE  ": [
        "'MS. SCHUYLER': '  Thank yo u, Madam Chair.  I have nothing to report this month.'",
        "'CHAIR GOODMANN': '  Thank you, Ms. Schuyler.      10     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Are there any questions for Ms. Schuyler from the Commission?  Hearing none, Agenda item number 5 is the consent calendar.'"
    ],
    "4. CONSENT CALENDAR  ": [
        "'CHAIR GOODMANN': '  There is one item on this month's consent calendar.  This is to approve the final master plan for the George Bush Center for Intelligence in Fairfax County, Virginia.  It was submitted by the United States Government.   Are there any questions or discus sion on the consent calendar?'",
        "'COMMISSIONER HEWLETT': '  Madam Chair, I move approval.   VICE-'",
        "'CHAIR DIXON': '  I second that.'",
        "'CHAIR GOODMANN': '  Thank you.  Thank you, Commissioner Hewlett and Commissioner May.  Was that for the second, or was that Commissioner Green? VICE-'",
        "'CHAIR DIXON': '  Commissioner Dixon.'",
        "'MS. KOSTER': '  I think it was    11     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Commissioner Dixon.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Dixon.  Ms. Koster, can you confirm the motion and the second, please?  And take the roll call vote?'",
        "'MS. KOSTER': '  Certainl y.  The motion was made by Commissioner Hewlett and seconded by Commissioner Dixon.   With that, Commissioner Cozart.'",
        "'COMMISSIONER COZART': '  Yes.'",
        "'MS. KOSTER': '  Commissioner McMahon.'",
        "'COMMISSIONER MCMAHON': '  Yes.'",
        "'MS. KOSTER': '  Commissioner May.'",
        "'COMMISSIONER MAY': '   Yes.'",
        "'MS. KOSTER': '  Commissioner Argo.  Commissioner Argo?'",
        "'COMMISSIONER ARGO': '  Yes.  Thank you.'",
        "'MS. KOSTER': '  Commissioner Hewlett.'",
        "'COMMISSIONER HEWLETT': '  Yes.'",
        "'MS. KOSTER': '  Chair Goodmann.'",
        "'CHAIR GOODMANN': '  Yes.     12     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'MS. KOSTER': '  Commissioner Green.'",
        "'COMMISSIONER GREEN': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Wright.'",
        "'COMMISSIONER WRIGHT': '  Yes.'",
        "'MS. KOSTER': '  And Commissioner Dixon.  VICE-'",
        "'CHAIR DIXON': '  Yes.'",
        "'CHAIR GOODMANN': '  Thank you, Ms. Koster.   The motion has carried.'"
    ],
    "5. BUREAU OF ENGRAVING AND PRINTING CURRENCY PRODUCTION FACILITY  ": [
        "'CHAIR GOODMANN': 'Agenda item 6A is a request to approve preliminary sight and building plans with the Bureau of Engraving and Printing Currency Production Facility.   Ms. Free.'",
        "'MS. FREE': '  Thank you.  Can you hear me and see my screen?'",
        "'CHAIR GOODMANN': '  Yes.'",
        "'MS. KOSTER': '  Yes.'",
        "'MS. FREE': 'Th ank you very much. Well, good afternoon, Commissioners and Chair Goodmann. 13 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com The U.S. Army Corps of Engineers has submitted preliminary site and building plans in coordination with the Bureau of Engraving and Printing and the Department of the Treasury for a new Currency Production Facility in Beltsville, Maryland. The Commission reviewed concept plans for the Currency Production Facility in April 2021 followed by an information presentation in July of 2021. Today the Commission is reviewing the preli minary site and building plans and final review is anticipated for later this year. The Commission's preliminary review focuses on if the applicant addressed the comments and recommendations made during the concept for review. (Audio interference) wit h the Comprehensive Plan policies. And overall, staff recommends approval of the'",
        "'MS. FREE': 'preliminary site and building plans with comments. And the following slides will provide a brief overview of the existing site and the purpose of the project, and 14 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com then I'll review the updates made since the concept plan. The proposed Currency Production Facility, or CPF, in Beltsville, will replace the existing facility located in downtown Washington, D.C., which was built in 1914. The existing CPF is no longer able to sup port the needs of a modern Currency Production Facility, and several options were considered for modernization, including renovation. However, studies concluded that a new facility would better accommodate required security features and be more cost - effective than renovating the existing facility. After an extensive site evaluation study, Congress passed the 2018 Farm Bill, which authorized and'",
        "'MS. FREE': 'directed an interagency land transfer of a portion of the Beltsville Agricultural Research Center, or BARC for s hort, from the United States Department of Agriculture to the Department of the Treasury, specifically to construct and operate a Currency Production Facility. 15 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com The Currency Production Facility will be located about four miles north of the Greenbelt Metr o Station and about midway between Interstate 95 and 295. (Audio interference.)'",
        "'MS. KOSTER': '  Ms. Free, I just wanted to  - this is Julia Koster.  I just wanted to stop for a minute.  We're having a little bit of a lag  -'",
        "'MS. FREE': '  Okay.'",
        "'MS. KOSTER': '  But why don't you go ahead, and I'll let you know if it continues to happen.'",
        "'MS. FREE': 'Okay. Thank you. The selected 104 -acre site is bound by Powder Mill Road to the south, Odell Road to the north, and a forested buffer to the east, and agricultural fields to the west. Within the site, are buildings and structures that are contributing resources to the BARC Historic District. All but three of the existing buildings on the site have been abandoned since 2012. 16 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Institutional, commercial, agricultural, and residential uses surround the site. Private residences immediately border the site to the north along Odell Road. The project site and its approaches present a bucolic image with rolling agricultural fields, mature forests, and meadows. And in the nex t section of the presentation, I will discuss the proposed project, its type plan elements, and -- (Audio'",
        "'MS. FREE': 'interference.)'",
        "'MS. KOSTER': '  Ms. Free?  Ms. Free, we're still having a little connection issue if you'd like to restart on that one, but I'd suggest tu rning off your camera for the moment.'",
        "'MS. FREE': '  Okay.  Let me do that quickly.   Okay.  And just to back up a moment, in the next section of the presentation, I'll discuss the proposed project, its type plan elements, and changes to the site plans sinc e the    17     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   concept review.   Is that connection coming through clearer?'",
        "'MS. KOSTER': '  Yes, it is.  Thank you.'",
        "'MS. FREE': 'Okay. So I'll begin by noting the Commission's previous comments focused on tree preservation and replacement, impacts to water resources, t he design of the new entrance road, lighting and noise, building design, and transportation and parking. The preliminary plans address these topics and also include new information about perimeter security, green building, and outreach, and Environmental Justice. The concept plan proposed a 921,000 - square-foot building with a square footprint and a building height before 40 and 50 feet with solar arrays and green roof proposed on the rooftop. Surface parking included 1,234 spaces and primary access to the site is planned from Powder Mill Road. Loading and service functions 18 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com are located on the north side of the building, and an emergency egress is proposed off'",
        "'MS. FREE': 'of Odell Road. The preliminary site plan is generally consistent with the concept plan. How ever, the applicant reduced the amount of surface parking from 1,234 spaces to 849 spaces, which adds about four acres of greenspace back into the plan. The square footprint of the building was selected for its compact form, which allows for maximum dist ance from the secure perimeter, protection of natural features, conservation of viewsheds, and optimum adjacencies of building programs. After entering the site, the new entrance on Powder Mill Road, vehicles are divided according to their business and sc reened through dedicated gatehouses. As I mentioned, the access point on Odell Road is for emergency use only. The design for the proposed entrance road shows a curved alignment that follows the 19 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr'",
        "'MS. FREE': 'gross.com existing terrain, avoids an existing intermittent stream a nd forested area to the east and prevents motorists from speeding. And formal tree plantings will complement the existing landscape character and screen the view of existing BARC buildings. The road, itself, is designed with one inbound travel lane and t wo outbound travel lanes and incorporates an eight -foot wide separated shared-use path that will connect into the county's future bicycle improvements plans along Powder Mill Road. And here we have a look at the proposed entry visualized both in the summ er and in the fall when the foliage is less dense. You can see here there is an entrance sign proposed at the intersection to mark the site's main entrance. The proposed signage program includes vehicular wayfinding, a site entrance sign, and building s ignage of the main entrance. Signage typeface is inspired by the serial numbers that'",
        "'MS. FREE': '20 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com are printed on bills before they enter circulation. Staff recommends that the signage program is expanded to include wayfinding for pedestrians and cyclists and also req uests the plan with proposed sign locations and sign elevations. The project also includes a secure perimeter that consists of an eight - to nine-foot-high anti -climb wire mesh fence and an eight-foot-wide patrol path. Staff notes the perimeter security fence and patrol path will enclose the site except for the existing wetland in the southeast corner of the site to minimize impacts. A 20-foot clear zone is required on both sides of the perimeter security fence. However, only tree trunks and limbs with in nine feet of the perimeter fence will be removed. And overall, staff appreciates the applicant's efforts'",
        "'MS. FREE': 'to balance perimeter security requirements with impacts to existing trees and water resources. 21 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com The design of the perimeter's security fence is al so sensitive to the immediate residences along Odell Road to the north. Perimeter lighting will be used to eliminate potential security threats on an as -needed basis. Otherwise, no perimeter lighting will be provided aside from that vehicular entrances. And here we have day and nighttime renderings along Odell Road that illustrate the limited visual impacts of the secure perimeter. During the concept review, the Commission requested that the applicant address potential light and noise impacts to the nearb y residences. The site plan indicates lighting interior to the site will be limited to areas necessary for safety and circulation. Light levels will be minimal'",
        "'MS. FREE': 'and targeted on horizontal surfaces to restrict uplight and protect the night sky. The applic ant also prepared a noise technical memorandum that concluded that operation of the CPF would have negligible noise 22 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com levels that are consistent with current daytime conditions and less than significant adverse noise impacts for nighttime operations. Overall, staff finds that the loading dock light and noise impacts to the residences will be limited because the loading is located 740 feet from the nearest residences. Lighting will be buffered from view by 480 feet of the existing forest. And all regular n on-emergency vehicle trips to and from the site will be routed to the south through the new entrance right along Powder Mill Road. I'll now speak to the potential environmental impacts'",
        "'MS. FREE': 'beginning with tree preservation and replacement. The project proposes preservation of more than 20 acres of existing trees. And while the proposed building is sited to minimize impacts to existing forested areas, approximately 20 acres of trees will be cleared, including 140 specimen trees. The applicant prepared a tre e survey to identify the size, location, and condition of the trees to be 23 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com removed, many of which are in fair or poor condition. The tree replacement plan proposes a combination of reforestation and individual tree replanting consisting of 2,500 new trees , which includes 3.9 acres of reforestation and 1,024 replacement trees. This replacement strategy will result in a net increase of on -site tree canopy at maturity, and staff finds the proposed tree preservation and replacement'",
        "'MS. FREE': 'plan is consistent with the Comprehensive Plan's policies. The existing landscape is the preliminary driver for the proposed landscape. However, the plans did not include a proposed landscape plan. Therefore, staff requests that the applicant submit a detailed a landscape plan that identifies the size, location, and species of proposed trees, understory plantings, and meadow areas. In addition, Prince George's County indicated in their comments that Odell and Powder 24 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Mill Roads would typically require a 40 -foot wide landscape b uffer, and therefore, staff recommends that the plans should include - the landscape plans should include additional landscape buffering on Odell and Powder Mill Road where possible. There are several wetlands and two streams located on or near the proje ct site. Impacts to wetland, streams, and'",
        "'MS. FREE': 'their buffers are anticipated to be minor and in many cases, temporary, particularly Wetland 4 is a large jurisdictional wetland at the southeast corner of the site that will be preserved as a site amenity with an overlook. Approximately 0.06 acres of wetland forest buffer will be disturbed. The submitted preliminary plans indicate that the operation of the CPF would produce approximately 120,000 gallons per day of wastewater. Wastewater would be pretreated onsite prior to discharging to the USDA's sanitary sewer system, where it would be further treated prior to discharging into Beaverdam 25 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Creek, which is a nearby Tier 2 perennial stream. This stream is highlighted here in yellow on the slide. The final Env ironmental Impact Statement concluded that downstream water flow and quality would not'",
        "'MS. FREE': 'be substantially affected. However, we recently learned that the EPA is developing a new approach that would avoid wastewater discharge to Beaverdam Creek entirely, which the applicant will discuss in more detail after my presentation. Regarding stormwater management, the proposed project will increase the amount of impervious surface area from an existing 17.3 acres to approximately 43 acres. However, the project is u tilizing low -impact design techniques such as green roof, rainwater harvesting, pervious paving, and micro -bioretention to retain and reuse 100 percent of the stormwater on -site, which would meet local, state, and federal stormwater management requirements . And now that I've covered the site 26 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com plan elements, I'll discuss the building design and architectural program. At the core of the building, is the manufacturing'",
        "'MS. FREE': 'hall, which is the where the currency is produced. The height of the building at the core is approximately 50 feet to accommodate the equipment required to produce the currency. The north side of the building contains the warehouse, storage areas, Federal Reserve vault, and wastewater treatment plant. The east side is primarily occupied by mechanical, electrical, and plumbing services for the building. The building height steps down to approximately 40 feet above these spaces. Staff notes the building height is driven by programmatic needs and step downs where possible to minimize the appea rance of the building in the landscape. As seen in section, the tran slips from west to east bearing a portion of the building at its westside. And staff notes that the existing grade and new 27 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009'",
        "'MS. FREE': '-4309 www.nealr gross.com landscape berms are further utilized to reduce the apparent bu ilding height. The building is sited such that only the top 14 feet of the building is exposed on the western side. The building façade reinforces institutional identity with metallic cladding that wraps the perimeter of the building. At the windowed po rtions, the metallic cladding consists of a perforated metal with patterning of finished currency. Staff finds the approach to the building from the side designed with patterned metal cladding creates a distinct and unique identity for the CPF without di stracting from the surrounding rural landscape. But to better understand the patterning and details, staff is requesting enlarged building façade elevations and renderings that illustrate the material selections and the pattern details in the next submission. And here we have some views around the site that set the building within the landscape. 28 NEAL R.'",
        "'MS. FREE': 'GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com The top left image is of the tour gatehouse, which has a reflective glass façade. The same treatment will be applied to the truck and main gatehouses. The CPF' s roof is considered a fifth façade as much of the project's enclosure is located on the roof. Overall, staff commends the project's rooftop design that includes an eight - acre photovoltaic solar array, approximately 550,000 square feet of green roof, and minimal roof-mounted mechanical equipment. Additional sustainable features include electric vehicle charging stations and native meadows amongst others. The sustainable building design measures will be evaluated through the LEED design process, which is a third-party green building rating system. The project is targeting LEED Silver certification, but staff encourages the applicant to seek a minimum of LEED Gold certification. The'",
        "'MS. FREE': 'project proposes an enhanced surface parking design that consists of perme able 29 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com paving and parking bays, micro -bioretention between parking bays, reinforced grass pavement, trees infilled between the parking bays, and some road travel wetlands. Comprehensive Plan policies recommend the use of parking structures, preferably below ground in the interest of efficient land use and good urban design. The applicant identified the proposed surface parking design as the preferred alternative for several reasons. For one, poor on -site soil conditions make below -grade structures not feas ible. Two, viewshed impacts of the above -grade parking structure from Odell Road would be greater. And third, structured parking has a much higher rate of embodied carbon emissions when compared to surface parking. The applicant provided an informatio n presentation'",
        "'MS. FREE': 'in July of 2021 with an analysis of how the proposed surface parking has a smaller carbon footprint considering both operational and embodied carbon compared to a structured or 30 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com underground parking structure. It indicated that on a yearly ba sis, structured parking would generate approximately 41.5 million pounds of carbon per year. The surface parking would generate 7.4 million pounds of carbon per year. And staff finds that the surface parking is inconsistent with Comprehensive Plan policies. However, the construction and operation of the proposed surface parking as designed results in a lower carbon emissions than structured parking and achieves a low profile within the landscape that reduces viewshed impacts. Pursuant to the National H istoric Preservation Act, the applicant initiated Section 106 consultation for the project,'",
        "'MS. FREE': 'which contains 22 buildings and structures that were contributing to the BARC Historic District, three archeological sites, and historic viewsheds. Consulting part ies have developed a Memorandum of Agreement to address the impacts from this project including minimizing the appearance of 31 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com the facility in the landscape. As part of this process, an analysis of the viewsheds surrounding the site was undertaken. Staff fi nds the viewshed analysis indicates the proposed CPF building, and the associated site improvements will be minimally visible from adjacent public roads and surrounding viewpoints. Here we have a view from Odell Road looking southeast. And another view he re from Odell Road looking to the southwest. This is a view from nearby Edmonston Road looking northeast towards the site. This view is from'",
        "'MS. FREE': 'Powder Mill Road looking northwest. And this last view here is from the adjacent agricultural fields from the west looking towards the new CPF. And in this next section of the presentation, I will discuss how the Transportation Management Plan and parking strategy has evolved since the concept review. The concept plans propose a 1:1 parking ratio for the CPF prod uction staff and a 32 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com 1:2 parking ratio for the administrative staff. This resulted in an overall parking ratio of 1:1.1 for the facility. As noted previously, the applicant reduced the amount of surface parking to 849 parking spaces, which is a 34 percent reduction. This reduction in parking results in a proposed 1:1.1 parking ratio for production employees and a 1:2.6 parking ratio for administrative employees.'",
        "'MS. FREE': 'This resulted in an overall parking ratio of 1:1.4 for the facility. In its previous action , the Commission requested a number of items from the applicant to justify why the applicant could not meet the Comprehensive Plan's recommended 1:2 parking ratio. I will discuss these items in detail on the following slides. The Commission asked for a n explanation of why the shift hours are difficult to adjust to better align with Metro operating hours. The applicant explained that CPF employee work shifts were negotiated in multiple 33 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com collective bargaining agreements and are expected to remain the same because changing them would require updates to many employee contracts. The applicant also inquired with WMATA about changing operating times who indicated that a system -wide change to the'",
        "'MS. FREE': 'train schedules is not practical to accommodate a few hundred emp loyees. As high concentrations of employees are commuting from Upper Marlboro in Maryland and Stafford, Virginia, the applicant completed example commutes for employees in both areas. This exercise demonstrated that the inbound commutes of day shift pro duction staff would be limited by public transit because the earliest arrival time at the CPF in Beltsville would be at least 30 minutes after the day shift begins. And the last train that leaves the Greenbelt Metro Station would leave approximately 30 mi nutes before the evening shift ends on most days. Therefore, staff finds that the applicant has demonstrated a typical commute via public transportation would not be feasible for 34 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com most production staff due to mandated shift'",
        "'MS. FREE': 'times that conflict with transit operating hours. The applicant also provided proposed Transportation Demand Management Strategies, or TDM strategies, to limit single -occupancy vehicle trips. These include expanding telework for administrative employees, increasing carpool or vanpool u se, implementing an expanded USDA shuttle bus service from the Greenbelt Metro, and on-site bicycle and pedestrian pathways, and supportive improvements to the bicycle infrastructure in Prince George's County. Telework for administrative employees is a significant TDM strategy used to improve the parking ratio. Also, administrative employees are more capable of using public transportation because their start and end times fall within normal WMATA operating hours. And overall, staff supports the proposed TDM strategies used to provide a 1:2.6 parking ratio for admin employees, which exceeds the Comprehensive Plan's recommended 1:2 parking ratio. 35 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009'",
        "'MS. FREE': '-4309 www.nealr gross.com However, for production staff, the Transportation Management Plan indicates that fewer employees would carpo ol in the future compared to existing conditions, and therefore, staff requests that the applicant revisit the 1:1.1 parking ratio for production staff with a focus on improving the percentage of employees who carpool since shift times are regular and many are commuting from similar geographic areas. The applicant will also coordinate with USDA to expand the existing shuttle program to create an on -demand flex route that operates between 6:00 a.m. and 6:00 p.m. at a minimum to connect BEP employees who are commuting via metro to the Greenbelt Metro Station. The Commission also previously requested information about the CPF's visitor program and the potential impact of tours on the transportation network. The preliminary plans indicate that approximately 45,000 visitors per year are expected in Beltsville and overall staff finds the visitor'",
        "'MS. FREE': 'program will not significantly 36 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com impact the transportation network as tours are ticketed and limited to 30 persons at a time, some of which will arrive by shuttle. And with regard to off -site traffic impacts, the traffic impact study identified seven intersections as primary needs for improvement resulting from the operation of the CPF. The recommended improvements vary from signal timing to road widening, and staff is recommending that the off -site intersection improvements prioritize options that improve levels of service without increasing impervious surface area. And staff also requested a timeline for improvements to the intersection - the nearby intersections a re completed prior to opening of the CPF to minimize traffic impacts to the surrounding community. And in response to Executive Order 13985, Advancing Racial'",
        "'MS. FREE': 'Equity and Support for Underserved Communities Through the Federal Government, NCPC developed a n Equity Action Plan 37 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com that incorporates equity approaches into the agency's plan review processes. As such, staff notes that the applicant prepared a Socioeconomics and Environmental Justice Technical Memorandum that identified an Environmental Justice com munity of concern is located within the project's region of influence. The memorandum describes and analyzes Environmental Justice conditions regarding race, ethnicity, income, and poverty conditions in the Region of Influence, which includes parts of the cities of Greenbelt and Beltsville. The memorandum found that significant adverse traffic and transportation impacts to the Environmental Justice community could result from operation of the proposed CPF from increased traffic volumes integrated level o f service conditions. However, staff notes that the'",
        "'MS. FREE': 'applicant has detailed the impact reduction and mitigation measures for traffic and transportation as described in the Transportation 38 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Impact Study to reduce adverse impacts to less than significant lev els. As previously discussed, staff is recommending that these improvements are prioritized before the CPF opens and that the applicant provide a timeline for the improvements in the next submission. And further, staff notes that the applicant is in the process of preparing a Supplemental EA, or Environmental Assessment, to evaluate the potential impacts to proposed traffic and utilities mitigation. The Supplemental EA will include an analysis of cumulative impacts related to traffic and air quality. And with regard to outreach, the applicant has engaged in more than 35 stakeholder meetings since 2017. The Draft EIS Notice of'",
        "'MS. FREE': 'Availability was advertised in several local print media outlets, such as the Washington Post. The applicant also mailed lette rs and hard copies of the notice of availability to all the stakeholders on the mailing list. 39 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com A periodic newsletter containing updates regarding the project and contact information for stakeholders to use has been in circulation, online, and through pos tal mail since January of 2022. And overall, staff finds that the applicant made a concerted effort to inform community stakeholders of the project and addressed public comments. And this concludes my presentation. I've incorporated the Executive Dire ctor's Recommendations into the presentation, and they're also listed in the staff report for your reference. We have several representatives from the Bureau of Engraving and Printing, the Army Corps'",
        "'MS. FREE': 'of Engineers, SOM Architecture, and the Transportation P lanning Team here to answer questions. And now, I would like to introduce Mr. Leonard Olijar, director of the Bureau of Engraving and Printing who would like to make a 40 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com brief statement. Thank you.'",
        "'MR. OLIJAR': 'Thank you for the opportunity to speak this afternoon before the Commission. I'd also like to thank the staff for all the work they've done with us during this project. The Bureau of Engraving and Printing's mission is to develop and produce United States currency notes trusted worldwide. We se ek to set the world's standard for banknotes through excellence in manufacturing and innovation. U.S. currency is the world's currency. More than two -thirds of the value of our currency, 56 billion notes in circulation, is held overseas primarily as a s tore of value. Demand for currency remains strong. Currency in circulation is a direct measure of demand for Federal Reserve notes, and currency in circulation continued to increase during the COVID-19 pandemic from $2 trillion in 2020, to $2.5 trillion in December 2022. Over the past five years, the volume 41 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS'",
        "'MR. OLIJAR': '1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com of U.S. currency in circulation has continued to increase on average more than 5 percent per year. Consumer cash holdings remain elevated. As the global currency, U.S. banknotes face threats on all continents. The Bureau is continually challenged to remain ahead of the technological capabilities of counterfeiters. Currency is redesigned primarily for security reasons. The upcoming redesigned currency will contain new security features and a r aised tactile feature so that blind and visually impaired people may denominate our currency by touch. The application of these new features requires new production equipment that will not fit in our current facility in Washington, D.C. BP has two curre ncy production facilities for continuity of operations and to meet global demand. Currency production and the availability of currency is vital to the economic stability of the nation'",
        "'MR. OLIJAR': 'and the world. 42 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com A shortage of U.S. currency would have a devastating impact on the world economy. The D.C.'s main and annexed buildings are 103 and 79 years old, respectively. These aging, outdated facilities lack flexibility and space for modern manufacturing and have significant safety and security vulnerabilities that cannot be mitigated. We need a new replacement manufacturing facility to accommodate the larger, more sophisticated equipment and processes needed to produce the technologically advanced banknotes of the future. Renovating the existing facility has been studied numerous times during the past 30 years. And the need for building a new facility was concurred with in 2018, Government Accountability Study, Options 4, and Costs of a Future Currency Production Facility, GAO 18 -338. BEP is excited about becomin g'",
        "'MR. OLIJAR': 'part of the Prince George's County community. Over 60 percent of our employees live in Maryland, and 43 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com about half of those live in Prince George's County. We will work hard to be a good neighbor and responsible steward of the site being entrusted to us. I know that our relationship with the surrounding communities will be mutually beneficial and productive. We look forward to continued dialogue and engaging with them. While we looked at several sites, the BARC property met Bureau requirements for location, security, accessibility, availability, size, and developability. BEP will continue to work with local stakeholders as the facility design and proposed roadway improvements advance. BEP was recently authorized to fund recommended off -site roadway improvements via the Consolidated Appropriations Act of 2023. A comprehensive'",
        "'MR. OLIJAR': 'Transportation Management Plan was established and revised to accommodate employees who drive, vanpool, telework, and take public transportation to reduce parking requirements a nd minimize impacts 44 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com on local traffic and quality of life for residents. Environmental concerns regarding the off-site roadway improvements, air pollution due to transportation activities, and off -site utility construction will be evaluated in a supplementa l environmental analysis scheduled for completion by the end of this year. Working with the U.S. Army Corps of Engineers, USACE, BEP has conducted environmental assessments and developed appropriate mitigation plans that meet or exceed federal and state environmental standards and requirements. BEP will be a good neighbor and has a proven record of environmental stewardship over the years. We have received numerous environmental awards at our facility'",
        "'MR. OLIJAR': 'in Fort Worth, Texas, such as the Pretreatment Partnership Award for over 13 years and the Pollution Prevention Award for an employee -driven Solvent Recycling Program. BEP's Environmental Management System 45 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com is ISO 14,001 certified. BEP and USACE began this project with a solid commitment to sustainability. We selected a location with significant existing development and sited our facility on the property to avoid wetlands and minimize the number of trees impacted. In fact, when we are done, we will plant over 2,000 more trees than are there today. I am very proud of the substantial investment the Bureau is making with respect to environmental stewardship including a green roof, implementation of tree replacement preservation strategies, and overall carbon emission reduction, solar photovoltaics, lighting and sound design, and'",
        "'MR. OLIJAR': 'stormwater management including bioswales, capturing rainwater in cisterns and reusing it, and installing a permeable parking lot. In addition, the Bureau is working with Washington Suburban Sanitary Commission, WSSC, and Prince Ge orge's County to eliminate a major public stakeholder concern by directing the 46 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com facility's wastewater into the WSSC system in lieu of the USDA -owned operated wastewater treatment facility. In this manner, none of the Bureau's wastewater will be discharged into Beaverdam Creek. Thank you for the opportunity today to talk briefly on why we are doing this and how much the local environment means to me and to'",
        "'CHAIR GOODMANN': '  Thank you, Director Olijar, and also to Ms. Free.   Do the Commissioners have any  questions at this time?  Yes, Commissioner Hewlett.'",
        "'COMMISSIONER HEWLETT': '  I do.  Thank you so much.   Thank you, Ms. Free, for your presentation and Mr. Olijar.   My question is having gone through the staff report and the support that we have from some entities but the opposition from others, I'd like to ask our counsel, Ms. Schuyler, or Ms.    47     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Free, but it's probably for Ms. Schuyler to talk about the Congressional Act, the 2018 Congressional Farmland Act, Farm Act, the Farm Bill, about  - because I want t o know whether there is a choice.   It seems a lot of the opposition seems to be about the location of this facility.  And I'm not sure that we have flexibility on that note.'",
        "'MS. FREE': '  Sure.  Thank you, Commissioner Hewlett.   I'm going to try this again  with both my video and sound, so please, let me know if there's any interruption in my connection.   I'll start  - and Ms. Schuyler can add to what I have to say here  - is that the Farm Bill authorized the transfer of land between the two agencies, the U SDA, and the Department of the Treasury, specifically for the construction of a Currency Production Facility at this location.  So as far as the location of this facility goes, it has been determined by Congress    48     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   to go in Beltsville on the site that is inc luded in the preliminary plans.'",
        "'COMMISSIONER HEWLETT': '  Okay.  And Ms. Schuyler, was there anything to add on that?'",
        "'MS. SCHUYLER': '  I have not looked at the legislation for a while to be honest with you.   Ms. Free, if I could direct a question to you. In y our review, did you note that the language was obligatory?  Or was it that your sense that it was obligatory?'",
        "'MS. FREE': '  It was my sense in my review that this is  - it was obligatory, yes.'",
        "'MS. SCHUYLER': '  All right.   I am happy to take a quick look at i t while you continue to discuss and maybe be able to provide a final comment on that legislation before you complete your action on this application.'",
        "'COMMISSIONER HEWLETT': '  That's what I would like to know because it seemed when I heard you respond, Ms.  Free, you said Congress    49     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   authorized.   I just want to figure out whether it's mandatory or not because if it's mandatory, which I sense that it is, then it's the other issues about the environment and whatnot that we want to address  - the environment and the traffic and things of that nature that we want to address.  The location might not be an option for us.  But I just would like to  -'",
        "'COMMISSIONER WRIGHT': '  The language does say \"authorized and directed.\"  That seems pretty definitive to me.'",
        "'COMMISSIONER HEWLETT': '  Okay.'",
        "'COMMISSIONER WRIGHT': '  And it's the subject of great consternation for a lot of people, I think.'",
        "'COMMISSIONER HEWLETT': '  And that's why, as an attorney, myself, I just wanted to hear from our legal counsel just a final confirmation on that note.'",
        "'COMMISSIONER WRIGHT': '  Yeah, I'm hoping that we can have a robust conversation on a 20 -   50     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   year site selection process that did not include NCPC.'",
        "'MS. SCHUYLER': '  Ms. Free, can I ask, do you have that legislation readily available that you could for ward it to me quickly?'",
        "'MS. FREE': '  I just did.  Yes.'",
        "'MS. SCHUYLER': '  Okay.  Bless you.  Thank you.  All right.  To be continued.'",
        "'CHAIR GOODMANN': '  Okay.  In the meantime, while Ms. Schuyler is looking at that for the answer to the questions that were posed by Commissioner Hewlett, are there other commissioners with questions for either Mr. Olijar or for Ms. Free?'",
        "'MS. KOSTER': '  I think Commissioner Cozart.'",
        "'CHAIR GOODMANN': '  I see Commissioner Cozart.  Thank you.'",
        "'COMMISSIONER COZART': '  Good afternoon.  Ms. Free , could you comment on if you have background in response to what was shared from the City of Greenbelt about limited    51     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   timeframe to provide feedback on the plans?'",
        "'MS. FREE': '  I'm so sorry.  I was on mute.  Of course.   As far as NCPC's inter -jurisdictional review process, we do refer the plans through the Maryland Clearinghouse once when they are submitted, which was done at the concept review, the previous review where we gathered comments from all agencies, local and state, within Maryland.  And the plans, the preliminary plans when they were submitted, were shared on our website including our summary of the plans that were submitted and all the materials that we received as part of the package.   We did notify the City of Greenbelt that day, when they were posted to the website, in hopes that we would get comments from the City of Greenbelt, as well, as part of this review.'",
        "'CHAIR GOODMANN': '  Thank you.   Additional questions?  Ms. Hewlett?'",
        "'COMMISSIONER HEWLETT': '  Well, not    52     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   really an additional question.  I' d looked at the signup sheet, and I know that Ms. Hruby had signed up to speak as well as the others, so we may get some clarification, particularly on Commissioner Cozart's question from them when they speak as well.  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you .   VICE-'",
        "'CHAIR DIXON': '  Madam Chair.'",
        "'CHAIR GOODMANN': '  Yes.  Yes, Commissioner Dixon.  VICE-'",
        "'CHAIR DIXON': '  Yeah, I have several questions, but I have learned over time that it's awfully good to hear the community's position because they're probably going to surface some of the same questions I have and give us some clarification as to what their concerns are to be spoken to, so I'm going to stand by until I hear them.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Dixon.  I'm doing the same.  But we do have  - unless there are other questions right now  - Commissioner Dixon is correct.  We do have    53     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   five speakers signed up, and so  - yes, Commissioner May, I think you have your hand up, or no?'",
        "'COMMISSIONER MAY': '  Yes, I do.'",
        "'CHAIR GOODMANN': '  Yes?  Okay.'",
        "'COMMISSIONER MAY': '  So my first question's already been asked and hopefully we'll get greater  - more information about that.   I'm really curious about the wastewater discharge.  I appreciate the fact that it's going into WSSC now  - or at least, theoretically, going in to that system rather than going into the creek.  But what about the levels of toxicity that we've seen still in the submissions from community members' concerns about the levels of toxicity of the wastewater to begin with?  And is the fact that it would g o into WSSC mean that it's going to be eliminated there because, ultimately, it all winds up in the Anacostia anyway.  So I'm just curious about that.'",
        "'CHAIR GOODMANN': '  Do we have someone    54     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   who'd like to respond to that question?   Yes, sir.  Mr. Davis fro m BEP?'",
        "'MR. DAVIS': 'Hi. My name's Chuck Davis. I'm the program manager for the Bureau on this, and I think we've mentioned this before. Our current DCF facility currently discharges into the WSSC system, and it goes through the Blue Plains Treatment Faci lity. That would be the same after discussion - that would be the same. Our understanding is that's the same treatment facility that WSSC would treat our water from Beltsville as well. It should be noted that of our approximately 120,000 gallons of wa ter, 80,000 of it is just from cooling tower blowdown. I mean, it's not toxic water. And about 35,000 is traditional office, sanitary human waste. The remaining goes through a pretreatment process on - site to remove any oils, greases, metals, anything li ke that. We've also eliminated as part of this 55 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200'",
        "'MR. DAVIS': '(202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com design, and as part of our manufacturing process, we've eliminated in this facility, any galvanic plating operation. So that's chrome and nickel plating. We will not have that in this facility. So we are strictly looking at the oils and greases and some metals, but that is pretreated to a WSSC standard, which is monitored frequently by WSSC and the Bureau because we have to meet their requirements before we discharge to their system. So all these discussio ns about toxic material, we don't see it. And we have a track record of pretreatment both in D.C. and in Fort Worth of maintaining the standards that are provided to us by the sanitary commissions.'",
        "'CHAIR GOODMANN': '  Thank you, Mr. Davis.'",
        "'COMMISSIONER MAY': '  If I could follow up, please.'",
        "'CHAIR GOODMANN': '  Yes, sir, Commissioner May.'",
        "'COMMISSIONER MAY': '  Unfortunately, the sound went out in my system here, and I missed    56     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   the very beginning of your statement about where the water is going now or something lik e that.  If you could repeat.'",
        "'MR. DAVIS': '  Sure.  Our existing DC facility discharges into WSSC and ultimately goes to the Blue Plains treatment facility.  We have been working with WSSC about the new facility and we are told that our discharge will go to th e WSSC system, and then go to the same treatment facility.  So, once we bring down operations in DC, it's the same stuff but less, actually, because we are getting rid of our chromium nickel-plating lines.'",
        "'COMMISSIONER MAY': '  So, the Blue Plains facility is operated by DC Water, not WSSC.  So, are you saying that WSSC is routing that water to Blue Plains to DC Water?'",
        "'MR. DAVIS': '  That's what we were told.  I'm not sure.  Is there anybody from Army Corps on here that would have additional information?'",
        "'CHAIR GOODMANN': '  Is there anyone from    57     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   the Corps of Engineers to respond to this question?'",
        "'MS. OZGAR': '  Sounds like you just said our understanding from WSSC is that is the facility that it goes through.'",
        "'MS. KOSTER': '  And could I just have her identify herself for th e record?  Thank you.'",
        "'MS. OZGAR': '  Yes, Carrie Ozgar, Army Corps of Engineers.'",
        "'COMMISSIONER MAY': 'Okay. I mean, given the fact that Mr. Davis pointed to a DC water facility and not WSSC, I'm not feeling totally confident about the answers that we're getting so far. So, I would appreciate it when we get to a final, to have confirmation, since you're going to change it anyway from what was previously proposed, that there be clarity about exactly where the water is going and how it's being treated all the way through. I think that would be useful for people to understand, because it's -- yeah, I 58 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com mean, the Blue Plains, it doesn't go into the Anacostia, but it does go into the Potomac. And you answered a question I had not asked, which is, where does it all go n ow?'",
        "'COMMISSIONER MAY': 'Which is that goes to Blue Plains. Okay, so I appreciate that. I do have a question, a follow -on, on the location, which there was an EIS that was conducted after the legislation was passed. And typically, the sort of things that you'd look at in an EIS would be, where should this thing go. But were there actual alternative sites that were evaluated? And I apologize, you may have covered this in previous presentations and I've forgotten it. But we deal with a lot of cases, and so I can't always reme mber everything.'",
        "'MR. DAVIS': '  So, as part of the EIS, this was the only site that was actively reviewed as part of the EIS.  Prior to the EIS, we started -- there was 81 sites --'",
        "'COMMISSIONER MAY': '  That's not my    59     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   question.  That's not my question.'",
        "'MR. DAVIS': '  Okay.'",
        "'COMMISSIONER MAY': '  And I don't want to take up more time than we have to.  I just want to know, so it was only a single site that was considered.'",
        "'MR. DAVIS': '  Yes.'",
        "'COMMISSIONER MAY': '  And then the EIS just examined basically a build here or a don't -build here.'",
        "'MR. DAVIS': '  Correct.'",
        "'COMMISSIONER MAY': '  Okay.'",
        "'MR. DAVIS': '  Correct.'",
        "'COMMISSIONER WRIGHT': '  Because of the Farm Bill language.'",
        "'COMMISSIONER MAY': '  I understand.  Okay.  And then the last question is, is there a timeline yet for when the CPS facilit y downtown will be vacated?'",
        "'MR. DAVIS': '  We are in the process of working with GSA on an analysis of alternatives.  We anticipate the annex building being    60     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   surplused, the GSA.  We are still looking at the main building on whether we will renovate that, or whether we will also surplus that building and go into lease space.  That is still being discussed.  The annex building will probably be around 2030, 2031, the main building, probably a little bit further down the road.'",
        "'COMMISSIONER MAY': '  Okay, appreciate that.  There are other uses that are clamoring for space in that vicinity.'",
        "'MR. DAVIS': '  Correct.'",
        "'COMMISSIONER MAY': '  And the use of the BEP building, the main building, as office space is really probably not the best idea.  But we can talk about that another ti me.  Thank you.  That's it for my questions.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner May, and thank you, Mr. Davis, for your answers. Are there any further questions from the Commission currently? And if not, hearing none, we will move into the five pe ople 61 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com who have signed up to speak today. And given the number of speakers, I just want to remind each of you to try to keep to your specified time for your testimony. And the first person we have is Marian Dombroski, with the Anacostia Watershed Community Advisory Committee. Ms. Dombroski, you're representing an organization, so you have five minutes to speak. And before you begin, I just want to thank you for your kind welcome in your written testimony that you provided. I thank you for welcoming me to th is position. But'",
        "'CHAIR GOODMANN': 'if you're ready to speak, we'd love to hear you. Well, it appears as though -- we know we're having some technical difficulties with our --'",
        "'MS. DOMBROSKI': '  Please let me --'",
        "'CHAIR GOODMANN': '  Okay.  Ms. Dombroski, if you want to go ahead an d speak -- (Simultaneous speaking.)'",
        "'MS. DOMBROSKI': '  My Internet keeps    62     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   crashing.  Can you hear me?'",
        "'CHAIR GOODMANN': '  Yes, maybe just turn your video off.  We can hear you.'",
        "'MS. DOMBROSKI': '  I'm sorry, can you hear me at all?  No.  Okay.'",
        "'CHAIR GOODMANN': '  We ca n hear you.'",
        "'MS. DOMBROSKI': '  Oh, I'm sorry.'",
        "'CHAIR GOODMANN': '  Please go ahead and provide your testimony, Ms. Dombroski, or we can return and try and help you connect.  While we're allowing staff to help Ms. Dombroski, we can move on to Maureen Fine.  Maureen Fine, are you able to connect, please?  And you do have three minutes to speak.'",
        "'MS. FINE': '  Thank you.'",
        "'CHAIR GOODMANN': '  Yes, you've very welcome.'",
        "'MS. FINE': '  Can you hear me?'",
        "'CHAIR GOODMANN': '  Yes, we can hear you.  Thank you.'",
        "'MS. FINE': '  So, good afternoon.'",
        "'CHAIR GOODMANN': '  I'm sorry, Ms. Fine.    63     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com    You just muted.  If you could unmute, then we can hear you.  Thank you.'",
        "'MS. FINE': '  Okay, we're good now?'",
        "'CHAIR GOODMANN': '  Yes.'",
        "'MS. FINE': 'Anyway, good afternoon and thank you so much for the really great questions that you asked that we all have been asking for quite a while. So, I'm one of the 900,000 residents and non-residents who enjoy birding in Maryland. And I'm also a grandmother who knows that the future of my grandkids is tied to the future of biodiversity. So, on behalf of the many bird species who will likely experience serious negative impacts due to the relocation of the BEP to BARC, I really appreciate that you're listening to what I have to say. So, among the top 100 of thousands of eBird hotspots in Ma ryland, BARC is listed as number 36. So, this is out of the top 100. This is a really big deal. The BEP 64 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C.'",
        "'MS. FINE': '20009 -4309 www.nealr gross.com relocation to BARC poses numerous threats to birds due to multiple factors, not limited to but including, habitat destruction and fragmentation, 24-hour noise and light collusion, and one of the most deadly, which is window strikes. In light of these serious threats, it is highly warranted that the BEP be held to the highest standards of bird -safe building design. The U.S. Green Building Council tells us bird-friendly strategies help building owners, and there is no incidental operating cost to making a building bird -friendly. On the contrary, the strategies can save on operating and energy costs, especially when these types of strategies are incorporat ed into the initial design phase, rather than after - the-fact. So, we also hear from the Green Building Council that not all lead -rated buildings are bird -friendly. Builders must opt to use the bird -friendly credit. And in my'",
        "'MS. FINE': 'written testimony, I have 65 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com put in a number of links and one of them is to that lead program. So, I also included a link to the Facility Standards for the Public Building Service, which is used for all of GSA's owned inventory, which is over 186 million square feet. I've included in my written comments, comments to the EIS back in December of 2020 from the Maryland Ornithological Society, which says that the information given by the BEP contractor is totally inaccurate, as far as bird counts. And they've been doing ongoing studies for many years.'",
        "'MR. JUTTON': '  That's three minutes, Ms. Fine.'",
        "'MS. FINE': '  Okay, thank you very much.  Please let's make the BEP building safe for birds.  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you very much, Ms. Fine.  Thank you for your input.  And does anyone have a question for Ms. Fine before we move on?     66     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Hearing none, thank you again.  And our next speaker is Terri Hruby, the City of Greenbelt Director of Planning and Community Development.  Ms. Hruby, you would have five minutes to speak.  Are you on the Zoom?'",
        "'MS. HRUBY': '  Yes, I am on.'",
        "'CHAIR GOODMANN': '  Okay.  Welcome.'",
        "'MS. HRUBY': 'Good afternoon, Madam Chair and members of the Commission. Thank you. Pardon me, because I am quite a bit under the weather. But I'm going to try to make it through the city's comment s. And I've also submitted the written comments as well. But I want to thank you for the opportunity to review and comment on the preliminary plans for the relocation of BEP to BARC. As was asked by one commissioner, we did feel we were hampered in our ab ility -- impeded, if you will -- to really provide detailed comments today. For one, we received the plans and the 67 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com notification on February 13th, and for a municipality to really have time to take it through its develop and review, that is too'",
        "'MS. HRUBY': 'quick a turnaround for us, unfortunately. But also, in my opinion, we're used to seeing plans for the entire site and that we can look at everything holistically, rather than really what I believe is, in the materials, was more of a conceptual, illustrative PowerPoin t presentation, rather than the plans themselves. So, it impeded our ability to look at all the details. But not withstanding that, we look forward to the final plans, in hopes that perhaps they should be shared sooner with the city. Obviously, we are a stakeholder in neighboring. We are also part of the scoping for the traffic impact analysis. So, this is a project dear to our hearts and we really would like the ability to comment in detail. But the city has constantly affirmed 68 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C.'",
        "'MS. HRUBY': '20009 -4309 www.nealr gross.com our strong opposition to the siting of the BEP at BARC. We strongly assert that the proposed relocation will have significant impact on BARC, the human, and the natural environment. I know you've heard from the birding community. You'll hear from the Anacostia Watershed Committ ee. And we've heard from a lot of environmental groups regarding the environmental impacts. We've also summarized them in detail of our concerns in other comments that we've submitted to you all. But also, we've provided our analysis of the environmental impact statement as well that outlines those concerns. And we believe that the transportation impacts as well. And just overall impacts on the surrounding community we have concerns of. So, we want to take this opportunity to reaffirm our position, and to also just ask that you take into consideration the previous testimony of the city, as well as the'",
        "'MS. HRUBY': 'referenced documents that we've provided, not only at this 69 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com meeting, but also when you were talking about the conceptual plan. We believe those comments ar e largely valid still today. We do look forward to hearing more about the wastewater treatment and the efforts not to discharge it. So, we look forward to having an opportunity for that dialogue to occur and to better understand that. I want to restate wh at the mission of BARC is. I mean, it's to provide the American public with an exceptionally talented, highly interdisciplinary, scientific community, in the USDA's largest scientific installation, and leverage these resources to envisage, create and improve knowledge and technologies that enhance the capacity of the nation and the world, to provide its people with healthy'",
        "'MS. HRUBY': 'crops, animals, and clean renewable, natural resources, sustainable agricultural systems, and agricultural commodities and products tha t are abundant, high -quality, and safe. 70 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com We continue to assert that the relocation -- (Audio interference.) -- with the stated mission, as well as we believe it is in direct conflict with BARC's own master plan, but also with local land use policies and pl ans as well. You'll see a number of park and planning, the Maryland National Capital Park and Planning Commission, plans to discuss BARC and discuss the value of BARC as an agricultural gem, if you will. And it discusses the need to preserve that gem. So, we do have concerns about allowing such an industrial use to be located at BARC and what message that'",
        "'MS. HRUBY': 'is saying for the future of BARC. Is it going to lead to more of what we believe are destructive land uses that are not in keeping with any policies, pr ocedures, both at a regional, as well as at a local, level. So, in closing, the city continues to urge the Commission to close this project for its 71 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com adverse attacks on the environment and transportation and quality of life. And although not in our testimon y letter, I would like to -- because it was addressed -- the city continues to have concerns about the transportation impacts and the offsite traffic improvements, and what those improvements will be as well in the environmental impacts of the improvements . And we do hope during the final review'",
        "'MS. HRUBY': 'by NCPC, that that information is right away available for the public to review and comment, as well as there's a lot of reference to offsite bike and pedestrian improvements. (Audio interference.) Applicant is prop osing onsite, it references in a lot of its materials the Prince George's County master plan and sited plans --'",
        "'MR. JUTTON': '  That's five minutes, Ms. Hruby.'",
        "'MS. HRUBY': '  -- improvements.  But there's no mechanism for which those plans are    72     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   scheduled for imp lementation or funding.  So, thank you very much for the opportunity to comment and look forward to discussing this project more.'",
        "'CHAIR GOODMANN': '  Well, thank you, Ms. Hruby.  We're very grateful for your input.  And at this time, do any of the Commissioner s have -- yes, Commissioner Hewlett has a question for Ms. Hruby.'",
        "'COMMISSIONER HEWLETT': '  Yes, thank you.  And it's good to see you, Ms. Hruby.'",
        "'MS. HRUBY': '  You too.'",
        "'COMMISSIONER HEWLETT': '  Thank you.  So, as we've discussed earlier, we may or may not have any flexibility in terms of the location.  And so, I'm looking over at the comments.  I wasn't on the National Capital Planning Commission in '21.  But I did notice that the City of Greenbelt sent in a letter on the concept plan.  And in that letter, it was suggested that if we have no flexibility on the location itself, there    73     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   were several conditions that the city would like to see addressed, and that's on page 22 of our internal staff report.  Now, our staff report indicates that those have all been addressed .  And are you still standing by that if in fact we have no choice on the location?'",
        "'MS. HRUBY': '  If it were to be located here, we do still have concerns, if you will, from a transportation and mitigation and environmental perspective.  Those concerns stand . I think that I would be remiss if I said that there have not been some positive changes since the Commission has reviewed the conceptual site plan.  But we had, and even if you look at our environmental visit, we had a number of concerns about some of the  methodology used to draw certain conclusions.  And I think those still stand.'",
        "'COMMISSIONER HEWLETT': '  Okay.  Okay, thank you.  I just wanted to know if in fact if    74     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   we had no flexibility on the location, on the siting, whether we could address most of the other concerns that you have raised.  And I think our NCPC staff has done a good job working with your engraving and permit.  And printing, rather, to address a lot of these issues.  And we as Commissioner may want to address them even further.  But I just w anted to know where you stood on that.  Thank you.'",
        "'MS. HRUBY': '  You're welcome.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Hewlett, and thank you, Ms. Hruby.  Are there any further questions for Ms. Hruby?  Hearing none, our next speaker is Patricia Jackman.  And, Ms. Jackman, are you present?  And if you are, if you would like to take the floor, we're looking forward to hearing from you.'",
        "'MS. JACKMAN': '  Hello.  Can you hear me?'",
        "'CHAIR GOODMANN': '  Yes, we can.  Thank you, Ms. Jackman.'",
        "'MS. JACKMAN': 'I'm trying to p ut my 75 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com camera on but it's not coming on. But anyway, good afternoon. I live in New Carrollton, which is in Prince George's County. And you can imagine my nervousness now because I planned my whole presentation to you on the fact that the wastewater from th is project was going to be treated in the BARC wastewater treatment facility, and then released into Beaverdam Creek. So, to hear just now that the Army Corps of Engineers and the project is now going to be using WSSC kind of gives my heart a flutter. So, please bear with me while I pull this together. We were extremely concerned that this 120,000 gallons of chemical wastewater was going to be treated at BARC's plant,'",
        "'MS. JACKMAN': 'especially since that plant is now in non -compliance in its current state with the Nation al Pollutant Discharge Elimination System. So, as Commissioner May was bringing 76 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com up, we're hearing WSSC will now process all the wastewater. Well, we need clarification on the infrastructure of WSSC, what they will require to be putting pipes and supportin g this project at the agricultural center. And also, a clarification of where it will all go. All this wastewater will go. I opposed locating the Currency Production Facility at BARC. With its acres of trees and farmlands that filter the air we breathe and the water running into the bay, it's just the wrong place to locate an industrial facility. And I think that now, if we get more clarification'",
        "'MS. JACKMAN': 'on the water discharge, we'll find out just how this will be proceeding. But in the meantime, there are a lo t of land use projects vying for access to agriculture land on BARC. The Superconducting Magnetic Levitation Train Project, once a 200 -acre train maintenance facility on BARC, and I know Maryland 77 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Department of the Environment is conducting a tier-two revi ew of Beaverdam Creek for the maglev. The stormwater is going to go into Beaverdam creek. So, I think that tier -two water reviews of all of the proposed projects should be completed for the cumulative impacts to Beaverdam Creek. And I also agree with the City of Greenbelt, just that CPF Industrial Project is inconsistent with applicable planning documents. There are the federal elements'",
        "'MS. JACKMAN': 'that maintain --'",
        "'MR. JUTTON': '  That's three minutes, Ms. Jackman.'",
        "'MS. JACKMAN': '  ARS's mission.  And thank you very much f or this opportunity to share.  My written testimony is more complete.  Thank you.'",
        "'CHAIR GOODMANN': '  Well, we appreciate both your written testimony, but we also appreciate you engaging with us today and sharing your insights.  So, thank you, Ms. Jackman.  Are    78     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   there questions for Ms. Jackman at this time?  Any Commissioners with questions?  Hearing none, we have another speaker.  This speaker is Benjamin Fischler.  Mr. Fischler, you'll have three minutes to provide testimony.  Are you here?'",
        "'MR. FISCHLER': '  Yes , thank you.  Can you hear me?'",
        "'CHAIR GOODMANN': '  Yes, can hear you fine.  Thank you.'",
        "'MR. FISCHLER': 'Great. Thank you for the opportunity to address this Commission about the proposed BEP facility. I apologize. My camera is not working either. So, I'm gla d you can hear me. My name is Benjamin Fischler. These comments are submitted from me personally, as a citizen of Greenbelt, Maryland, Prince George's County. Like Greenbelt City Council, I remain opposed to the relocation of the proposed facility at BARC . 79 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com I really appreciate Ms. Hruby's recitation of BARC's mission statement and really question the whole process back in 2018. I don't think there's public involvement really in that Congressional action. However, if this project does move forward at BARC, it's of critical importance to minimize the significant environmental impacts of this project. And I do appreciate that BEP'",
        "'MR. FISCHLER': 'has been obviously making some efforts there. So, I hope Marian will be able to speak later. I was counting on her covering a num ber of other topics. But my written testimony is focused on air quality and the effect of emissions from the traffic that increase traffic that this project would bring about. Although BEP's proposed design for the parking lot has reduced the number of pa rking spaces, if this facility is built at BARC, there will be significant additional traffic traveling 80 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com to and from the proposed currency production facility, essentially around the clock, and the traffic is estimated to include over 700 dump truck trips d uring the construction period. And then, after the facilities and operation, over 1,000 single -occupancy employee vehicles'",
        "'MR. FISCHLER': 'driving to and from it daily, average of 75 heavy duty diesel trucks delivering and picking up materials weekly, 45,000 visitors every year, arriving in buses, about 30 visitors per hour, six hours a day, five days a week, 50 weeks a year. So, that's a lot of traffic. And I know it's mentioned a number of times here that there's a supplemental environmental assessment on traffic impact s. It seems to me like that deadline keeps moving. I hear it's the end of the year. But which year? So, this increased traffic, including on cues at most of the fifteen intersections BEP studied, will likely adversely affect air quality 81 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com in local area fr om additional car and truck exhaust. Two of the Maryland Department of the'",
        "'MR. FISCHLER': 'Environment's 24 air monitors in the state that measure ground level concentrations of pollutants and hazardous air pollutants are near the proposed facility. One is only about a m ile north, and the other about three miles southeast.'",
        "'MR. JUTTON': '  That's three minutes, Mr. Fischler.'",
        "'MR. FISCHLER': '  Oh, I'm sorry.  Well, in any case, I think you get my point.  We're concerned about the air quality for local folks and would urge you to oppose this location and revisit the entire selection process.  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you for your input, Mr. Fischler.  I think we'll get clarification shortly on how much authority or lack of authority we have on site selection.  Moving on, I  believe we now have Marian, or Ms. Dombroski, available through audio, because she's been having technical    82     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   difficulties.  But we certainly want to hear from you.  Ms. Dombroski, are you available?'",
        "'MS. DOMBROSKI': '  I hope so.  Can you hear me?'",
        "'CHAIR GOODMANN': '  Yes, thank you.  Thank you.'",
        "'MS. DOMBROSKI': 'Thank you so much for your patience and for everybody's help. I'm speaking today on behalf of the Anacostia Watershed Community Advisory Committee. I'm not going to go into the details of who we are, except that many of our member organizations have worked for decades in the special contribution areas within and surrounding BARC. We oppose the allocation of federal property at BARC for uses unrelated to its mission, and we request location of the currency production facility in a site in Prince George's County, an appropriate industrial area. There's a reason that there's a difference between the category for farming and that for industrial. 83 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Anyway, locating the toxic industrial operation on protected and dan gerously scarce farmland, it's a disaster in itself. The details revealed'",
        "'MS. DOMBROSKI': 'in the EIS are shocking. One of the many aberrant outcomes of approving this project is the location would place the largest contiguous green space in our county, considered the lun gs of the Anacostia, in jeopardy. Our new Congressman has recognized the opportunity to establish an agricultural and environmental research triangle, housed at BARC, combining the resources of NASA/Goddard, Howard University, University of Maryland, Univ ersity of the District of Columbia, and the Patuxent Wildlife Research Center. This would create a resource invaluable to the nation. And unlike the Treasury's proposal, such a groundbreaking effort, consistent with BARC's mission, would produce a fertil e incubator for Prince George's County's struggling small businesses in fields 84 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com including agriculture and environmental health. The county's economic development strategic plan notes'",
        "'MS. DOMBROSKI': 'the fact that the county has not emerged as a leader, despite the presence of these institutions and research facilities. Indeed, two of our major universities are land grant, established to provide students with affordable access to career higher education in agriculture science and engineering, while promising jobs to our coun ty. Jobs already held by others. The proposed currency production facility and hotel project will undermine the realization of BARC's potential as a stepping stone to economic prosperity for Prince George's County. The proposed currency production facility is a gateway project. It closes the door to innovative enterprises consistent with BARC's mission, and opens the floodgates to inappropriate land use and destructive development. 85 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com The EIS lists at least 40 projects under cumulative impact. Projects wai ting'",
        "'MS. DOMBROSKI': 'in the wings to further degrade and hamstring BARC's wealth of resources and abundant opportunities. This would be imposed on a county built on agriculture, birthplace of low -impact development. Maryland's number one industry is agriculture, generatin g 40 percent of our economy, on the footsteps of the nation's capital. Project documentation indicates that the site selection was based on cost and convenience to the Treasury Department. It dismisses the cost of negative impact to adjacent communities, the region and the environment. This is the very definition of environmental injustice. We'll continue to work to protect BARC and support its mission in every way possible. We were successful in blocking the disposal of Parcel 107 at NASA, another impo rtant resource in 86 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Maryland's targets ecological area. President'",
        "'MS. DOMBROSKI': 'Biden has just appointed their new Chair. Thank you so much for coming. You have the President's ear. We rely on planners. The Commission is the premier planning body of the region, to prot ect our most valuable resources and direct development towards a healthy and sustainable future. Please direct this content to an appropriate just location -- not BARC -- so that the nation's premier agricultural research center can be preserved and suppor t to achieve the life - sustaining purpose for which it was established. Thank you so much for letting me speak and for your patience.'",
        "'CHAIR GOODMANN': 'Thank you, Ms. Dombroski. And we're very grateful for your remarks. And again, thank you for your genero us welcome. Everything you've provided has been very good and useful information. I want to thank all the speakers today 87 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com for participating. And this is what we need. And what we're looking for as Commissioners, is for input like this. And I also want to note that Marian Cantor from the Friends of the Beltsville Agricultural Research Center, the Maryland National Park and Planning Commission, Prince George's County, and the City of Greenbelt, all provided comments, which were distributed to the Commissi on. Written versions of the testimony and the comments provided today were also provided and available through our website. So, now I'd like to ask if BEP'",
        "'CHAIR GOODMANN': 'has any thoughts that they'd like to share that might help address the issues that have been raised b y our citizen input. Perhaps Mr. Davis or Mr. Olijar could make comment on some of this public testimony. Thank you.'",
        "'MR. DAVIS': 'Sure. Thanks, Chair Goodmann. So, I would just like to start off, a lot of good feedback. And I would just like to 88 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com say tha t we've been working with the public stakeholders, both from the state, the county, local, even some of the civic associations, for years on this project. I'm happy to say that we do have the support of the Vansville Heights Citizens Association, which rep resents the citizens immediately adjacent to this site. They are very supportive of this site. They've testified in the past at NCPC of their support. We also have the support of USDA BARC's leadership team. They recognize that BARC's mission has decreased over the years because a lot of the traditional research that the Government has done is'",
        "'MR. DAVIS': 'now farmed out to the universities around the country. And so, we are redeveloping a site that has previous development on it. This is not virgin green land forest . It has over 20 buildings on it that we currently are scheduled to begin demolition on. 89 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com We also have the support of the Prince George's County executive, as well as the State of Maryland and our federal delegation. So, there are some good points brought up. We've touched on the wastewater. That was a direct result of working with our public stakeholders. We heard the concerns about Beaverdam Creek, and so we are taking a look at other options. And so, that will be reflected in the supplemental environ mental analysis that'll be coming out towards the'",
        "'MR. DAVIS': 'end of this year. On Ms. Fine's concerns about the birds, bird strikes and light. I think just taking a look at the presentation, there is no exposed glass on this building. It's all been wrapped with met al panels. So, we are significantly decreasing the chances of accidental bird strikes. All of our lighting design is being designed for downlight so that we don't cause light pollution. And then, I think we're very happy 90 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com about our security. That was ano ther item that our public stakeholders brought up was our perimeter security fence. They didn't want this. And, hey, we're a federal government, we're hiding behind a fence line, or, we're going to be shining lights out. That was another item that we work ed a'",
        "'MR. DAVIS': 'lot with our design team and our security folks to make sure that we don't become a nuisance, or we're not noticed by the residents to the north. And then finally, the transportation. We've partnered with a lot of different organizations on the trans portation impacts study that we conducted a few years back and we have been working with federal highway, the county, state, to begin implementation of those recommended improvements. And so, we are going to be beginning a conceptual design on that, which we will bring to the Commission, we'll bring to the different stakeholders. 91 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com But we feel that based on the TIS that we completed, that a lot of the concerns about offsite transportation impacts will be alleviated. We're actually improving what's there'",
        "'MR. DAVIS': 'right now, because most of those roads and intersections in that area are already failing. And so, we are going to be improving them with our offsite roadway improvements, which our director even mentioned earlier on that we recently received Congressional au thority to fund those projects. So, more to come on those. But needless to say, we feel like we're going to be making things better than they are currently. So, any questions?'",
        "'CHAIR GOODMANN': '  Are there additional questions for Mr. Davis from Commissione rs?'",
        "'COMMISSIONER MAY': '  Yes.'",
        "'CHAIR GOODMANN': '  Commissioner May?'",
        "'COMMISSIONER MAY': '  Yeah.  So, I was a little puzzled by the statement there is no glass    92     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   in the building.  I mean, in the presentation there is an image of the building that seems to show, I do n't know, fifteen - or twenty -foot tall glass wall at the entry point.  Is that not correct?'",
        "'MR. DAVIS': '  The only place that you'll have an exposed glass right now is the entryway.  And that's a first -floor area.  All the other glass, all the other curtain wall on the south facing of the building has a metal panel over it, which --'",
        "'COMMISSIONER MAY': '  I understand that.  I understand that.'",
        "'MR. DAVIS': '  Okay.'",
        "'COMMISSIONER MAY': '  But you said there was no glass, and there is glass.  It may not be very tall but th ere's glass.'",
        "'MR. DAVIS': '  The concern with bird strikes is anything up higher.  The design standards that we've been looking at are not --'",
        "'COMMISSIONER MAY': 'I beg to differ. My office building got hit by a hawk at about 93 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com twelve feet off the ground. So, I think you should take this matter seriously. And as she said, it's not that difficult to do. I do have another question that didn't come up in the spoken testimony, but I thought I saw it in the written testimony, which was a concern about bats and wheth er you're taking that into consideration, particularly with the tree clearing. I know that's a big concern for us in the Park Service. It has the potential to severely restrict development in certain areas, depending on where bats are nesting. And the coming listing, like any day now I think, of the northern long -eared bat, is going'",
        "'COMMISSIONER MAY': 'to have a big effect. And are you looking at that? Do you know if there are any nesting sites? Have they been surveyed? How are you addressing the bat issue?'",
        "'MR. DAVIS': '  So , we've -- oh, go ahead.  I'm sorry.     94     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'MS. OZGAR': '  Would you like me to handle that, Chuck?'",
        "'MR. DAVIS': '  Yeah.  Absolutely.'",
        "'MS. OZGAR': 'Carrie Ozgar, Army Corps of Engineers. BEP is aware of the scheduled reclassification for the northern long -eared bat from threatened to endangered. And we believe that effective date is supposed to be 31 March 2023. BEP completed coordination with U.S. Fish and Wildlife Services under Section 7 of the Endangered Species Act during the EIS process and BEP committed in the r od to applying voluntary conservation measures to reduce potential impacts to the northern long -eared bat, as identified in the northern long -eared bat programmatic biological opinion. These measures may include avoiding tree removal activities within the PUPS season, which is June 1st to July 31st. In light of this reclassification, BEP has reached out to re -engage with U.S. Fish and 95 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Wildlife Services'",
        "'MS. OZGAR': 'on a project in late -January, and discussions of several members of the -- oh, I'm sorry. And we're cont inuing discussions with several members of the U.S. Fish and Wildlife Services, Chesapeake Bay Field Office, to keep up-to-date on what the changes may include.'",
        "'COMMISSIONER MAY': '  Great.  So, effectively, you're going to have to go take a step back and ren ew the consulting that you had done before with Fish and Wildlife Service, because that's what we've had to do.  Right?'",
        "'MS. OZGAR': '  We're waiting for their guidance still.  Thank you.'",
        "'COMMISSIONER MAY': '  Okay.  And then, one last question, which, again, was  touched on somewhere in the transportation impacts, is trucks. And there's not a lot of information in our staff report about that.  And I just think at final, it would be helpful to know the numbers of trucks.  Not the construction, but what happens onc e you're in operation.  The daily    96     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   truck trips, that kind of thing.  And where they're going, how they're coming and going.  I think we'll need to know that.'",
        "'MS. OZGAR': '  We've done this.'",
        "'COMMISSIONER MAY': '  Sorry.  I think we are just in construction traffic  as well, how that's going to occur, given the volume of trucks that were mentioned in the testimony.  Thank you.'",
        "'CHAIR GOODMANN': '  Yes, and Commissioner Hewlett, were you going to ask another question?'",
        "'COMMISSIONER HEWLETT': '  Well, I was.  I think Vice -Chair Dixon had his hand up first, unless it's --'",
        "'CHAIR GOODMANN': '  I apologize.  I did not see that.  Vice -Chair Dixon, can you please ask your questions.  VICE-'",
        "'CHAIR DIXON': '  No, I'm going to pass and let the local folks speak to this.  And Commission member, l et me yield to her, please.'",
        "'COMMISSIONER HEWLETT': '  Okay, thank you.  I do have a couple of questions.  One thing -- and, Mr. Olijar, please, I may or may not be    97     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   pronouncing your name correctly, so please tell me how I pronounce it.'",
        "'MS. FREE': '  It is Olijar'",
        "'COMMISSIONER HEWLETT': '  Olijar.  Olijar.  Okay.'",
        "'MS. GREINER': '  I'm Marty Greiner. I'm the deputy director and chief administrative officer and the Bureau of Engraving and Printing.  It appears Director Olijar might have gotten dropped off somehow.'",
        "'COMMISSIONER HEWLETT': '  Okay.'",
        "'CHAIR GOODMANN': '  Okay.'",
        "'COMMISSIONER HEWLETT': 'Thank you. So, here are my questions for him, and I hope you hear, and also, Mr. Davis. But Mr. Olijar emphasized working with the community and being good neighbors. And this is really important because though you have the support of a number of people and a number of entities, you still have people and entities in the cities and municipalities with a lot of concerns. So, for me, it's 98 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com imperative that you continue to work with the community. One of the things that you said, transportation is an issue, and then that results in car pollution and whatnot. And because it's in Maryland and you indicated that 60 percent of workers will come from Maryland, live in Maryland, 30 percent of which, half of that'",
        "'COMMISSIONER HEWLETT': 'which will be from Prince George's County, the Greenbelt Metro is not likely to be viable for some of them. For most of them, especially if they're coming from Upper Marlboro and places like that. It's not going to work. So, the cars and th e vans and carpooling are going to be critical. So, please emphasize tremendously if this passes, tremendously, to work together on the carpooling. And the bicycle and pedestrian pathways as well. Although the shuttle from the Greenbelt Metro will be imp ortant and we hope you continue with that as well. You've addressed the wastewater. You 99 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com have indicated that absolutely none will be going into Beaverdam. That is critical. And I hope that's accurate as well. You said you're preserving 100 percent'",
        "'COMMISSIONER HEWLETT': 'of the rainwater. You have a system in place to do that. Ms. Free indicated that you were losing 20 acres of trees there, but you're planting trees again. And she said at maturity there will be an increase. No one indicated how much of an increase. Is it a small increase? A teenie increase? How much of an increase? I'd like to know an answer to that as well. I know you're aiming for LEED Silver. Given the environmental concerns -- and I applaud you on the roofing too. That's very, very important. But given all the concerns that we've heard, I'm hoping that you can take it up a notch or two. (Off-record comments.)'",
        "'COMMISSIONER HEWLETT': 'LEED gold, or 100 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com even platinum, I think our residents can put up Prince George's County -- there's so many ramifications h ere. Why not give us more? Why not go for it? We don't want to be shortchanged. And I do want to say this. I see you have input from the Maryland National Capital Park and Planning Commission. And most of us know that I just retired from the Maryland National Capital Park and Planning Commission. I want it stated on the record that your comments from Maryland National Capital Park and Planning Commission are from December 2022. I resigned before that. I retired before that. So, there's no conflict of interest here on that. But the Maryland National Capital Park and Planning Commission really strives'",
        "'COMMISSIONER HEWLETT': 'for buildings to be at least gold, minimum silver. But gold or platinum. And why should we have any less from the federal government, particularly at such a beautiful location as BARC? So, I would invite you to go back and 101 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com work harder on that as well. And we're hearing your comments that you're stating on the record. We take them to heart and we hope you're very serious in following through with all of these. And also, your shifts. You also mentioned teleworking. Right? Those on the staff. That's another way to deal with the traffic. Clearly, not everybody can telework. But I hope you can maximize that to its full potential. Those are just come of the comments that I had. Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Hewlett.  Commissioner Dixon, I apologize.  I did not see your hand up.  If you have a question you'd like to ask?  VICE-'",
        "'CHAIR DIXON': 'No problem. First of all, I am more inform ed by the P.G. County representative Commissioner speaking. I share all of her concerns. 102 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com I also always am concerned about the home rule nature. That is, the participation of local folks in projects. And there's always, this is not in my backyard, there 's always issues. But I feel that this project had a lot of airing. And though the testimony of the witnesses has been very, very helpful in guiding for the future, I hope that there will be some mechanism -- I'm kind of asking a question of the presenter s -- whether there is going to be a built-in mechanism for ongoing community participation in this particular project. I mean, not just the project but'",
        "'CHAIR DIXON': 'the presence of this particular entity being in their community. And that's a question. And the last qu estion would be, I'm always big on solar. Everybody knows I'm big on solar. I know that there's always a tradeoff between green roofs and solar roofs. And I'm not sure how you make the distinction. But I'd like to know whether that 103 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com had been explored, i n terms of getting more solar in to help carry some of the electrical issues we have. Thank you. And I'll wait for answers. Madam Chair.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Dixon.  Are there any other questions from Commissioners?  Hearing none --'",
        "'COMMISSIONER HEWLETT': '  There's a hand raised.'",
        "'CHAIR GOODMANN': '  Oh, dear.  I'm looking for a hand.  Thank you for your help with that.  Yes, Mr. Breitenother, from U.S. Army Corps of Engineers, would you like to contribute something.'",
        "'MR. BREITENOTHER': '  Yes,  thank you.  Thank you, Chair.  Yes, good afternoon.  My name is Matt Breitenother.  I'm with the U.S. Army Corps of Engineers, a design manager for the team. I believe Commissioner May is the individual who brought up earlier the discrepancy    104     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   or question on DC Water and the WSSC relationship.  I just wanted you to know that I got confirmation that our proposed connection to WSSC does in fact discharge down to Blue Plains.  And from what I understand, WSSC and DC Water have a written agreement titled, The 20 12 Intra -Municipal Agreement.  Those are the details that I can share with you at this moment.  Thank you.'",
        "'CHAIR GOODMANN': '  And thank you.  Thank you for your contributions, Mr. Breitenother.  No further questions?  Are there other questions or comments fro m Commissioners?  Hearing no other questions or comments, it's become clear that there has to be additional research done on the original question that was posed to Ms. Schuyler.  And so, I would like to entertain a motion to forego --'",
        "'MS. KOSTER': '  Chair Go odmann, perhaps we would just like to have General Counsel    105     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Schuyler report back on what she has.  And then, we will -- sorry to interrupt.'",
        "'CHAIR GOODMANN': '  That's okay.'",
        "'MS. KOSTER': '  And then we will go from there.'",
        "'CHAIR GOODMANN': '  Very good.  Well, is Ms. Schuyler, are you prepared to update us at this point?'",
        "'MS. SCHUYLER': '  Yes and no.  And isn't that a classic legal answer?  I think I am confused.  And I am confused because it's my understanding that our applicant has always used the phrase, authorized and directed, an interagency transfer.  And I think, based on what I've seen in the farm bill, I'm not sure I would agree with that phraseology.  So, I might be inclined to ask if someone from Treasury can respond, were there some other additional directives giv en to Treasury about this transfer of jurisdiction, of which we should be aware.     106     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'CHAIR GOODMANN': '  And thank you.  And we do not have anyone present today from Treasury.  So, I am going to assume --'",
        "'MS. SCHUYLER': '  But maybe I misspoke.  And maybe Diane can  chime in here.  Maybe that's how the applicant has -- I'm getting my parties confused.  That's how the applicant, which is -- Diane, are you --'",
        "'MS. SULLIVAN': '  Or someone from the Bureau of Engraving and Printing.'",
        "'MS. SCHUYLER': '  Yeah, that would do.  Yes.'",
        "'CHAIR GOODMANN': '  Do we have anyone here from BEP who can comment on the representation of the decision for site location?'",
        "'MS. GREINER': '  I think we would prefer to have our lawyer, who is not present today, comment on that, since we are talking about a very legal issue.  So, we would want our lawyer -- our Chief Counsel, to engage in that discussion.     107     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'COMMISSIONER MAY': '  Thank you so much, Ms. Greiner.  Well, hearing this, then I would like to suggest that I would entertain a motion to table this discussion an d forego Commissioner response until next month because of this uncertainty.  So, if the motion to table does not require discussion, it requires a motion and a second.'",
        "'MS. KOSTER': '  Yeah, so if I could just interject, I think what we actually want, and I misspoke to you, Chair, is a motion to postpone until the next meeting, the April Commission meeting, pending a report from our general counsel with whatever input from BEP can provide.  And we would do that as a motion seconded and vote. And then, when we r eturned in April, we would move and second the underlying action, and then hear the report, and then proceed with Commission deliberations.'",
        "'COMMISSIONER HEWLETT': '  I have a    108     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   question.  So, being new to the Commission, normally where I came from, if we postp oned to another date, this record -- we're not starting from scratch all over again.'",
        "'MS. KOSTER': '  Correct.'",
        "'COMMISSIONER HEWLETT': '  We won't have new testimony.  Okay, thank you.'",
        "'MS. KOSTER': '  That is correct.  But we would not entertain additional testimony at the next meeting.  That has already been provided, other than the reports, as specified from our counsel.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Hewlett and Ms. Koster.  Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'Yeah, I'd like to just put some textu re into this inquiry because I'm just -- this is -- we've seen a number of site selection processes of late that lack sufficient influence exercised by this Commission, and I would like the inquiry into how this happened and how it made it into the Farm 109 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Bill. We're told that there was this expansive selection process and over 80 sites were looked at and winnowed down, you know, to this and that and this, and we're getting conflicting testimony as to who knew and when they knew it, what they knew and when they knew it. But it's just a startling turn of events to have Congress order, direct and authorize, whatever the language is, without the participation'",
        "'COMMISSIONER WRIGHT': 'of the planning, the federal planning agency or from what -- And I'd like to understand how could that be that there's no participation by NCPC, then an EIS gets done with a build or no -build alternative in one location which smacks of pre - decisional activity? The whole thing just doesn't add up and I'd like to verify that the Maryland, that the local pl anning agency was involved or not. I just don't understand how this can 110 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com happen. Why bother to have a federal planning agency if they're not going to be consulted at all, even as a courtesy, in the status before it gets to a congressional action which a uthorizes and directs? I just think that we would be remiss as a'",
        "'COMMISSIONER WRIGHT': 'commission if we don't ask some very detailed questions and ask for, to understand thoroughly how this came about. Because what I was going to say in my comments when we got there was, yo u know, the design team has done an admirable job of trying to make this building disappear, but no amount of design is going to make this right and it is a darn shame. And I can't help but think it was a decision that was not fully informed by professio nal planners who would have weighed in mightily about the ill -advised location of this facility on the'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Wright.  Are there -- yes, I see    111     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Commissioner May has a comment.'",
        "'COMMISSIONER MAY': 'Yeah, I agree largely with what Commissioner Wright has had to say. I will say that in the past, I have, in past reviews, I haven't been as concerned about the site, but I have been very concerned about the process by which this happened. I mean, it's a very difficult build ing to site, and so I can understand why, you know, you started out with 80 and you wind up with very few in the end, but the fact that NCPC was not part of that process as the federal planning agency is really problematic. And as Commissioner Wright her self knows, I'm very concerned about site selection for federal agencies because sometimes they wind up in the wrong place and we all wind up paying the consequences for that afterwards. I won't go into the specifics of what that project refers to, but sh e knows, so,'",
        "'COMMISSIONER MAY': 'anyway, thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner May, and I see Commissioner Linda    112     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Argo has a comment.'",
        "'COMMISSIONER ARGO': '  Yeah, I just want to -- I'm having a little trouble with my video, but can you hear me?'",
        "'CHAIR GOODMANN': '  Yes , we can.  Thank you.'",
        "'COMMISSIONER ARGO': '  I just want to identify with the comments made by Commissioner Wright and Commissioner May.  I think the -- I mean, I hate to use the very overused term, but the process itself that has gotten us here seems flawed and it makes me somewhat hesitant, even in my, you know, in my input through a vote on this project.   I'm not sure how we deal with that procedurally at this point.  I'll leave that up to the folks that know how to do that better than I do.'",
        "'CHAIR GOODMANN': '  Right, and Commissioner Argo, thank you for that, posing that question, and I think what I'm asking for as the Chair is a motion to table.  It requires a    113     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   vote and no further discussion of this particular project until we have the information that has been requested, and that will be provided.   If the motion includes a date certain of tabling it until the April Commission meeting, then there would be further reporting out at that time by staff, but not repeating all of the testimony.  We would still hav e that, but the motion would be to table until April 6.   So, I would entertain that motion, but you had your hand up again, Commissioner Argo.  Do you have something else you wanted to say?'",
        "'COMMISSIONER ARGO': '  No.'",
        "'CHAIR GOODMANN': '  Okay.'",
        "'COMMISSIONER ARGO': '   I can't get my hand down.  Thank you.'",
        "'CHAIR GOODMANN': '  Oh, okay, all right.  So, I can entertain a motion to table this until the April 6 meeting until we get the information that's been requested.'",
        "'COMMISSIONER HEWLETT': '  Madam Chair, I move that we post pone action on this item until    114     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   the April 6 meeting pending the outcome of the questions that were asked.'",
        "'COMMISSIONER ARGO': '  I'll second.'",
        "'CHAIR GOODMANN': '  Thank you.  It's been moved and seconded.  I'll refer this back to Ms. Koster.'",
        "'MS. KOSTER': '  Thank you .  The motion to postpone until the April 6 meeting pending a report from our general counsel was made by Commissioner Hewlett and seconded by Commissioner Argo, and with that, Commissioner Cozart?'",
        "'COMMISSIONER COZART': '  Yes.'",
        "'MS. KOSTER': '  Commissioner McMah on?'",
        "'COMMISSIONER MCMAHON': '  Yes.'",
        "'MS. KOSTER': '  Commissioner May?'",
        "'COMMISSIONER MAY': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Argo?'",
        "'COMMISSIONER ARGO': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': '  Yes.'",
        "'MS. KOSTER': '  Chair Goodmann?'",
        "'CHAIR GOODMANN': '  Yes .    115     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'MS. KOSTER': '  Commissioner Green?'",
        "'COMMISSIONER GREEN': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': '  Yes, yes, a thousand times yes.'",
        "'MS. KOSTER': '  Thank you.  Commissioner Dixon? VICE-'",
        "'CHAIR DIXON': '  Yes.'",
        "'MS. KOSTER': '  And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': '  Yes.'",
        "'MS. KOSTER': '  Thank you.  I believe the motion has passed.'",
        "'CHAIR GOODMANN': '  Thank you, Ms. Koster, and thanks to the staff for assisting with that, and for all of those who shared testimony today and all of the officials who provided more information.  And yes, Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'I would also ask that the findings be distributed to us well in advance so that we can really understand it fully. It's very important that we ask the right 116 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com questions. I think we 've all been sort of of the mind well, that ship has sailed because Congress said so, but I think even if we find that this cruise ship is unstoppable, it's very important to understand how it happened so we can make moves to see that it never happens agai n. And if that includes changes to NCPC's authorities, I think it's really -- particularly given our conversation last month about demolition, perhaps it's time to revisit the Commission's authorities because if it does turn out to be out of the realm of'",
        "'COMMISSIONER WRIGHT': 'o ur ability to change -- because this is textbook what should not happen.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Wright.  And moving on, the motion has carried.  We will have this subject tabled through next April, the next meeting April 6, and thank you all.'"
    ],
    "6. MONUMENTAL CORE STREETSCAPE DESIGN GUIDELINES VERTICAL AND SURFACE ELEMENTS    ": [
        "'CHAIR GOODMANN': 'NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'CHAIR GOODMANN': '  Agenda item 6B is a request to accept the final Monumental Core Streetscape Design Guidelines, vertical and surface elements.  Mr. Jamawat is going to be presenting.'",
        "'MR. JAMAWAT': '  Yes, can you hear me?'",
        "'CHAIR GOODMANN': '  Yes, yes, we can.  Thank you, Jeff.'",
        "'MR. JAMAWAT': 'All right, thank you very much. Good afternoon, Chair Goodmann and Commission members. For the Monumental Core streetscape project, I'm pre senting the design guidelines for vertical and surface elements, and today, we request Commission acceptance of the guideline. I will start off with a brief recap of the project, including the framework, and then present the vertical and surface elements guidelines, both of which have several components. For each component, there's a set of principles. The principles are summarized in attachment one in your meeting 118 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com packet. I will wrap up the presentation with how the guidelines will be used and tha t's that. To help refresh the memory and for the benefit of the new commissioner, I will start with recapping the purpose and background of'",
        "'MR. JAMAWAT': 'the streetscape manual. The manual was first created in 1992 and consists of construction detail and specification. There was a minor amendment in 2013. The Agency used its technical document to achieve a coordinated and consistent streetscape for roadway in the central area of the city and in the vicinity of the National Mall. In fact, the manual was used on 25 capital improvement projects between 1992 and 2012, and today, the manual is now 30 years old. A comprehensive update is needed to live the current best practices in urban design, city planning, and landscape architecture. In 2018, we began the guideline upda te to achieve higher quality streetscape as shown here in the photos, and to improve connection and 119 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com relationship between the Monumental Core and'",
        "'MR. JAMAWAT': 'surrounding neighborhood. The update includes best environmental practices like stormwater management, and emerging technology like micro -mobility and EV charging station. The new manual will be used by agencies to plan, develop, and coordinate streetscape projects. NCPC and CFA staff used the manual during project review. NCPC is leading this update in collaborat ion with the Interagency Working Group comprising 11 federal and local agencies listed here on the left. We also received extensive input from agency experts, including arborists, preservationists, and landscape architect. This collaboration has been va luable to ensure that the guideline meet the goals of the manual. And as a reminder, the project has four phases. The first one included the urban design framework and lighting policy which the 120 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Commission saw in 2018'",
        "'MR. JAMAWAT': 'and 2019. The Commission directed s taff to use the framework as the foundation to develop the streetscape design guideline and construction manual update, and we're here today to talk about phase two, the design guidelines for the vertical and surface elements. In 2022, the Commission relea sed draft guidelines for public comments and staff hosted two public meetings. We received comments from CFA, interest groups, and individuals. Staff addressed the comments and incorporated them in the final guidelines in front of you today. The commen ts are summarized in attachment two in the meeting packet, and at the next meeting in April, we'll be back to review the small -scale elements which I will preview at the end of the presentation. In the meantime, we are also working on phage three to updat e the construction detail and specification. When that's complete, we will update the memorandum of understanding'",
        "'MR. JAMAWAT': 'to 121 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com formalize how the agency will continue to collaborate. But before getting into the guideline, it's important to recap the urban design framework which provides an organizing principle for guideline development. This framework map from 2019 shows the expanded manual boundary and three distinct street categories which I will elaborate on the next slide. We have the radiating and edging streets shown in hot pink, the connecting and traversing streets in pale pink, and local streets in white. The radiating and edging streets, again in hot pink, have national importance and symbolic meaning. They radiate from around and along the edge of nationa l landmarks and open spaces. For example, Pennsylvania Avenue is a radiating street and Constitution Avenue is an edging street. And in pale pink,'",
        "'MR. JAMAWAT': 'the connecting and traversing streets have national and local 122 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com importance. Seventh Street, which runs acros s downtown Chinatown and National Mall falls into this category. Then we have local streets in white that make up the city grid and serve as a functional network for the District. All three street categories I described contain a range of streetscape elem ents, including streetlights, trees, benches, bike route, and pavement. We organized these elements into three groups, vertical, surface, and small -scale elements. Again, vertical and surface elements are the focus of today's presentation, and it's important to note that the guidelines only apply to public space from the property line to the curb, and only when there's a major site redevelopment project or a capital improvement project. The'",
        "'MR. JAMAWAT': 'guidelines are not applicable to routine maintenance and re pair. I mentioned earlier that the purpose of the manual is to achieve consistency in streetscape. Here, you have the degree of 123 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com consistency can vary based on the street category shown on the left and the type of streetscape element on the right. For exam ple, streetscape elements on radiating and edging streets should be more consistent than local streets. Also, street trees and lights along any street should have the highest degree of consistency because they are the most visible and help shore up the streetscape corridor. Before we get into the guidelines for the vertical elements, I want to take a moment to explain how we organized the final guidelines document. This document is provided as'",
        "'MR. JAMAWAT': 'a separate file in your meeting packet. Here, I included the cover page and table of contents. This is an example of the general layout and organization of the guideline. On the left, we have the type of element, each component, and the topics. In a moment, I will reference the principle, guideline numbers, and call-out boxes. 124 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Also, because there are multiple components and topics that contain a lot of information, I'm going to present each one using the same structure. First, I will summarize the high -level guiding principle that we presented to the Commission in 2022. Then I will recap the existing condition and current guidance from the 1992 manual. I will then show the proposed guidance in the manual update, and finally, I will'",
        "'MR. JAMAWAT': 'describe how we address public comments in the revision. I will note here that w ith the exception of the last bullet, the Commission has seen this content before. So, let's start with the vertical elements which have two components, streetlights and trees. Together, they help shore up streetscape corridor and frame important views. Streetlights are important because they contribute to the character of the capital city, historic district, and cultural landscape. 125 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com They strengthen important views, support streetscape consistency, reinforce unique precincts, and improve the relationship between Monumental Core and the surrounding neighborhood. There are two topics under streetlights, the fixtures and the National Mall crosswalk lighting. For the manual update, the guiding principles support using streetlight to express the dignity of th e nation's capital and'",
        "'MR. JAMAWAT': 'to provide nighttime illumination for safety, ambiance, and character. For the existing condition, you see an assortment of streetlight styles around the Monumental Core. We have everything from Washington Globe and Twin -Twenty that are ubiquitous around D.C., to special style lighting L'Enfant Promenade, an older style at the Capital Complex. With this variety of style, the current manual only provides guidance for Twin - Twenty, Washington Globe, and Olmsted lights as 126 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com shown on the m ap. In contract, the proposed guideline is more nuanced, capturing not only the range of styles, but also the height and placement of streetlights. The second topic includes recommendations that support the District region locals and address concerns abou t inadequate lighting on the National Mall crosswalk. There were no substantial'",
        "'MR. JAMAWAT': 'revisions on the draft guideline that we presented to the Commission in 2022. The second component under the vertical elements is the street tree guideline which covered five topics. Street trees are important because they support ecological function, improve pedestrian comfort, and enhance streetscape aesthetic. I'm going to highlight two topic areas, tree planning and tree box treatment. For the manual update, the guidelin e principles support the environment, aesthetic, and public health benefits of trees. Under tree 127 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com planting topic, the current guidance only addresses one tree species, the American Elm on the blue street shown on the map. However, our understanding of arboriculture practices have evolved in the past 30 years to include biodiversity in tree species and resilience to pests and diseases. The proposed guidance'",
        "'MR. JAMAWAT': 'promotes using different tree forms as shown in the legend to frame important view corridors. By fo cusing on tree form instead of tree species, we can achieve consistent streetscape character and expand the palette beyond the American Elm. The proposed guidance also limits the American Elm to National Mall shown in light blue where historic preservation is a critical factor. For the tree box treatment topic, the current guidance neither addressed stormwater management nor areas with high pedestrian foot traffic. The proposed guidance now addresses stormwater management through both bioretention 128 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com and non -bioretention tree boxes. It also provides several tree box options to ensure visual compatibility based on the landscape character and pedestrian volume. For the revision, CFA wanted to highlight how the guidelines support socially'",
        "'MR. JAMAWAT': '- oriented designs that c reate a comfortable, welcoming, and functional streetscape. We addressed CFA comment by adding a call -out box to emphasize the guideline that achieved this important attribute. To address other public comments, we added a new guideline to encourage sittin g in shaded areas and to consider the impact of root growth on the sidewalks and trails. Moving onto the guideline on surface elements, surface elements have four components, landscape and plantings, stormwater management, pavements, and pedestrian circula tion. Together, they enhance vista and contribute to the streetscape character. Landscape and planting provide 129 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com environmental benefit and unify streetscape character. We organized the guideline into five topics and I will provide a high -level summary of a couple of them. For the manual update,'",
        "'MR. JAMAWAT': 'we introduced a guideline principle that supports enhancing streetscape landscape and green spaces, improving soil for healthy trees and vegetation, and promoting native and pollinator -friendly plants. The current l andscape guidance only addresses mulch and turf grass, which is limiting and inadequate. On the other hand, the proposed manual update includes an appendix with an extensive planting palette. The proposed guideline also builds upon the urban design fram ework by identifying vegetation height based on street categories. In general, vegetation should be shorter on radiating and edging streets shown in hot pink to emphasize the view corridors. Along connecting and traversing streets shown in pale pink, landscape plantings can be taller. 130 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com And to address public comments, the revision addressed improving environmental practices by using a great'",
        "'MR. JAMAWAT': 'diversity of plantings to support pollinators like the Monarch butterflies. Next, I will cover stormwater management , which is important because it improves environmental quality, future pollutants, and reduces the strain on existing infrastructure. Stormwater management can also help mitigate flooding in the Monumental Core. And we organized the guideline into four to pics and I'm going to highlight a few of them. For the manual update, the guideline principles support using best practice to address flooding and water quality issues, protecting the historic and cultural resources, and ensuring proper maintenance of sto rmwater facilities. The guidelines also expand upon the current plan policies and coordinate with federal and local stormwater recreation. 131 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com As you know, the Monumental Core is prone to flooding. When we presented draft guidelines'",
        "'MR. JAMAWAT': 'to CFA, the Commission re commended that we highlight how we address this environmental issue, including the impacts of extreme weather and flooding. The current guidance from 1992 only addresses gray infrastructure, including catch basin and inlets. It does not provide guidance on current best practices like green infrastructure solutions. The proposed guidance identifies optimal locations for stormwater management based on urban design principles and curbside use of the sidewalk. Here on the left in the green box, the guidelines encourage stormwater management strategies, including bioswale and bioretention. And on the right in the red box, the guidelines discourage stormwater management in certain areas due to visual, historic preservation, and functional reasons, for example, limiting bioswale on the street crossing 132 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com National Mall and at locations with high'",
        "'MR. JAMAWAT': 'pedestrian volume. To address public comments, the revision includes highlighting how to address green infrastructure maintenance and consider best practices for universal ac cessibility. Moving onto pavement guidelines which contribute to the streetscape character and facility pedestrian circulation, we organized this guideline into four topics and I'm going to highlight the second topic on pavement material. For the manual up date, the guideline principle focused on unifying pavement character, enabling comfortable movement, simplifying material transition, and improving environmental condition. Walking around the Monumental Core, you may notice the existing condition with multiple sidewalk materials and pavement types, including red brick, London paver, and concrete as shown on the map. However, the current guidance only 133 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com addresses exposed aggregate granite curb and gutter on the streets highlighted in green.'",
        "'MR. JAMAWAT': 'In the proposed gu idance, we address every street in the Monumental Core and capture a more diverse palette of materials, for example, using exposed aggregate, shown on the map in gold color, on most streets within the Monumental Core, and using custom pavers, shown in burg undy, on special locations like the White House and L'Enfant Promenade. And to address public comments, the revision addressed curb ramp details, protecting historic views when designing bike lanes to enhance safety, and universal accessibility. And finall y, the last component is the pedestrian circulation guideline which addresses the space for pedestrian movement. We organized this guideline into five topics and I'm going to highlight just a few of them. For the manual update, the guideline principles s upport the following, enhancing circulation routes to facilitate pedestrian 134 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234'",
        "'MR. JAMAWAT': '-4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com movement, providing access to unique destinations, ensuring consistent alignment and adequate size of pedestrian spaces, and coordinating pedestrian spaces with other zones and travel modes. I want to note here that the manual update only focused on pedestrian circulation within the sidewalk space. The manual does not address curbside management and transportation because they are outside of the purview of the streetscape project. Here, the current guidance addresses roadway classification and pedestrian ways as shown on the map. However, it does not supply information on the minimum space needed for pedestrians and how transportation modes interface with pedestrian space. For the update, the working group made sure that the proposed guidance identified the minimum width for sidewalks as shown on the left legend, and the multi -use trail in dark blue, and restricted access roadways in dashed black and 135 NEAL R. GROSS'",
        "'MR. JAMAWAT': 'COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com green. To address public commen ts, the revision supports a continuous pedestrian access along the waterfront and highlights how different streetscape elements work together to enhance pedestrian safety and accessibility, also to reinforce that there are limitations on vending and parkin g within the National Mall area. This concludes the summary of the final vertical and surface element guideline. I will now explain how the guideline will be used. The manual will be used by agencies to plan, develop, and coordinate streetscape projects t o achieve consistency across multiple jurisdictions. NCPC will use the manual during project review and to inform policy when updating the comp plan. Using the new manual to coordinate streetscape improvement will ensure that the public space within the Monumental Core is beautiful, inviting, and functional. To'",
        "'MR. JAMAWAT': 'illustrate the manual's 136 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com application, I want to provide two examples. Here, Constitution Avenue as a radiating and edging street would have a double row of trees in spreading form, Twin -Twenty st reetlights, and unified planting and surface materials. Another example is 12th Street. As a connecting and traversing street, it would have a single row of trees in round shape, Washington Globe lights, and unified planting and surface materials. Looking ahead to the future phases of work for the streetscape project, as I mentioned at the beginning, we'll come back in April to look at the small -scale elements and to release the draft guidelines for 60 -day public comments. We will also host two public me etings in the spring. And later this year, we'",
        "'MR. JAMAWAT': 'will request Commission acceptance of the final small -scale guidelines. Upon completion, we will bundle the vertical, surface, and small -scale guidelines into one comprehensive package and this will wrap up phase two of the project. 137 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Here is a preview of the small -scale elements. They include two components, street furnishings and civil infrastructure. Street furnishings includes two topics, benches and receptacles. Civil infrastructure has several topics, including bike routes, fire hydrants, EV charging stations, parking pay stations, and utility boxes. Again, we will present this next month. In conclusion, the Executive Director recommends the Commission to accept the vertical and surface element guidel ines pursuant to NCPC planning authority, find that the guidelines are consistent with the comp plan, and build upon the urban design streetscape'",
        "'MR. JAMAWAT': 'framework, commend the Interagency Working Group for its collaboration, encourage the working group to begin u sing the guidelines for project planning, design, construction, and review, direct staff to use the guidelines to inform construction manual update in phase three. 138 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com I note that once accepted by the Commission, staff will incorporate any changes as directed and will finalize the respective text and graphics. This concludes my presentation and I will stay on for questions.'",
        "'CHAIR GOODMANN': '  Thank you very much, Mr. Jamawat.  That was a very thorough presentation and very helpful.  Now, do the commissioners hav e any questions about the presentation content?  Yes, Commissioner Wright?  You're on mute, Mina.'",
        "'COMMISSIONER WRIGHT': '  Sorry.'",
        "'CHAIR GOODMANN': '  That's okay.'",
        "'COMMISSIONER WRIGHT': 'I want to make sure that I understand this because we've seen this a number o f times and the content, I think, is very good. My question has more to do with implementation. So, if I understood correctly, the guidelines, since they're guidelines and not compulsory, I get that it's advisory, you're not making anyone do it, but, s o if I have a project, 139 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com let's just say, at USDA Whitten on the Mall, which falls squarely into the boundaries, and I don't follow the guidelines, I can expect when I get to the Commission for review of a project that the staff will recommend or the EDR will basically say this project runs afoul of the guidelines? Will it be used as a decision matrix'",
        "'COMMISSIONER WRIGHT': 'or establish criteria for evaluation is my question?'",
        "'MS. MILLER': '  I'll help with that one.  So, can you all see?  This is Beth.  Can you see me and hear me?'",
        "'COMMISSIONER WRIGHT': '  Yes.'",
        "'MS. MILLER': '  Yes, you're absolutely right.  These are not compulsory.  They are guidelines.  We will work with the Interagency Working Group amongst ourselves to coordinate, and when they do come to the Commission, they will be revi ewed to evaluate --'",
        "'COMMISSIONER WRIGHT': '  Okay.'",
        "'MS. MILLER': '  -- and we'll be able to give the Commission input on what we think --    140     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'COMMISSIONER WRIGHT': '  Right.'",
        "'MS. MILLER': '  -- it should be and then you can make the decision -- (Simultaneous speaking.)'",
        "'COMMISSIONER WRIGHT': '  Okay, so it as passive teeth?'",
        "'MS. MILLER': '  Yes.'",
        "'COMMISSIONER WRIGHT': '  Okay, good.  That's good.  I'm glad to hear that.  And my second question is -- because you, it's been a lot of work, and if it didn't have any teeth, that would kind of be discouraging.  And then the second question is how will you get the finished product into the hands of the people who need it?'",
        "'MS. MILLER': '  I'll take that one too, Jeff.  So, what our plan is, is when we wrap up the small -scale guidelines, we'll packa ge it, and then we're actually going to do an outreach to all of the respective agencies to do a briefing, kind of an education bit, go over the manual.  And so, that will be part of our    141     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   effort to inform everyone that it exists and how it can be used, and it will be packaged.  It will be electronic.  I will provide it to all of the agencies and it will be posted on our website.'",
        "'COMMISSIONER WRIGHT': '  Okay, third question because I wasn't clear.  Is there a plan to include 5G apparatus, apparati, is that a plural?  Whatever, you know what I'm talking about, the vaults, and the poles, and all of this stuff.  Are you going to get to that eventually?'",
        "'MS. MILLER': '  Jeff, do you want to -- I'll let you take that one.'",
        "'MR. JAMAWAT': '  Yes, so 5G falls into the small -scale elements.'",
        "'COMMISSIONER WRIGHT': '  It does.  You're right.'",
        "'MR. JAMAWAT': '  But they are being addressed separately and I think Diane is leading that effort.'",
        "'COMMISSIONER WRIGHT': '  I thought that's what I heard you say, but I wasn't sure.  Okay, thank you.  T hat's it for me.     142     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Wright.  Are there any other  commissioners with questions?  I do not see any hands up.  I see Commissioner Hewlett.  Yes, do you have a question?'",
        "'COMMISSIONER HEWLETT': '  My hand is not up, but I jus t think it was a great presentation and I just wanted to take a moment to say thank you.'",
        "'MR. JAMAWAT': '  Thank you.'",
        "'CHAIR GOODMANN': '  And if there are no further questions, then I would entertain a motion to accept the final Monumental Core Streetscape Design  Guidelines and the Executive Director's recommendations.  VICE-'",
        "'CHAIR DIXON': '  I have a question and I would like to also move that it be accepted.'",
        "'COMMISSIONER HEWLETT': '  And I will second it, Hewlett.'",
        "'CHAIR GOODMANN': '  Okay, great.  VICE-'",
        "'CHAIR DIXON': '  I wan t to say first    143     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   of all -- yeah, I wanted to speak to it a little bit.  I think excellent presentation.  I do have some questions and I guess maybe this is the time to do that, Madam Chair, or not?'",
        "'CHAIR GOODMANN': '  Yes, we can have questions now.  VICE-'",
        "'CHAIR DIXON': '  Okay, I'm concerned and have been about the electric charging stations which are a part of this discussion, whether there's going to be any standardization of the plugs that go into cars.   I'm hoping that at the national level, there will be some effort to standardize these because many chargers -- I have an electric car with chargers and it doesn't, oftentimes, the plugs don't fit it and there's, you know, some effort by certain vendors to make their plugs the only ones that are available which pu shes you to their vehicle, but anyway, that's one question and maybe he can speak to that maybe.  Is that possible?'",
        "'MS. MILLER': '  Go ahead, Jeff.     144     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'MR. JAMAWAT': '  I can tackle that one first.  So, the EV charging station also falls into the small -scale elemen ts and we have been working very closely with DDOT division for the EV charging station to develop, to look at the draft guidelines.  So, we have engaged through the Interagency Working Group to develop the working guideline.   I also want to point out tha t EV charging station is a live topic and I do feel like every day, we have new information on how many stations are being installed around the country, and every jurisdiction around the country are trying to wrap their heads around this issue as well.  VICE-'",
        "'CHAIR DIXON': 'Well, I just know that there's a lot of conversation about the rollout of all of these stations, but we need now to have some standardization. I mean, when you move from house to house in the United States, not internationally, but you p lug in an electrical plug, you have 145 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com three prongs now and that's in the building requirements, but there is no -- and it's easy for the federal government to say look, you've got to standardize these things because there's got to be a way to do that. Also, I'm also concerned, the bikes and other vehicles that move through the streets now, scooters, et cetera, et cetera, have got to be looked at in terms of the effect on the flow of sidewalks,'",
        "'CHAIR DIXON': 'et cetera, and I'm sure that you all are including that in your wo rk.'",
        "'MS. MILLER': '  Yeah, yes.'",
        "'MR. JAMAWAT': '  Yes, we did.'",
        "'MS. MILLER': '  Go ahead, Jeff.'",
        "'MR. JAMAWAT': '  Yes, the pedestrian circulation topic addressed how the pedestrian movement and how the micro -mobility and bicycle interface with pedestrian.  VICE-'",
        "'CHAIR DIXON': '  Okay, I'm very excited about this.  I just hope that it will also give some guidance and direction to the local communities so this doesn't end within the    146     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   area, because it's very, I think, very appropriate.  The lighting consistency, the type of bulbs consistency is very important.   Thank you for your work and I'm looking forward to more results from your effort.  Thank you very much.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Dixon, for your comments, and we'll continue to go around the table here and a sk for comments from the commissioners before we take a vote on the motion.  I know Commissioner Wright, you made some comments.  Do you have any further comments or discussion that you'd like to drive for this particular motion?'",
        "'COMMISSIONER WRIGHT': '  No, I  don't.  I mean, we've seen this a number of times and I think the content's very good.'",
        "'CHAIR GOODMANN': '  Okay, good.  All right, Commissioner Davis?'",
        "'COMMISSIONER DAVIS': '  No questions from me.  Thank you.     147     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'CHAIR GOODMANN': '  Okay, Commissioner Cozart?'",
        "'COMMISSIONER COZART': '  No questions, but just a comment.  Thank you so much to the staff.  This has been a big lift, very collaboration.  Our office has spent a lot of time working with you all, so thank you so much and appreciate the great presentation and the great work.'",
        "'MS. MILLER': '  Thanks to your staff as well.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Cozart.  Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': '  Yeah, thanks.  My only comment again is great work on the staff's part, a very well -defined report and it highlighted a lot of good issues to work on the future, so thank you.'",
        "'CHAIR GOODMANN': '  Great, thank you.  Commissioner May?'",
        "'COMMISSIONER MAY': '  Yeah, I ran this by our staff who have been working directly with    148     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   NCPC and others on it and only had compliments back, which is really good, you know.  We often have issues, but we didn't, and so we appreciate all of the good work that everyone has done.  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner May.  Commissioner Argo?'",
        "'COMMISSIONER ARGO': '  I don't have any additional comments or questions.  I really appreciate the work that's been done on this and that's it.  Thanks.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Argo.  Commissioner Hewlett?  Commissioner Hewlett?  I'm going to move onto Commissioner Green and we' ll get back to Betty.'",
        "'COMMISSIONER GREEN': '  Thank you.  No, I wanted to thank staff for this.  I really appreciate the granular detail, the granular attention to detail because what we often talk about is these big picture moves.   I mean, it's these fine grain moves that are so much about how people experience the    149     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   city, and how they move through it, and what they take away, and so I just really appreciate that.  Thank you.'",
        "'CHAIR GOODMANN': 'Thank you. Thank you so much, Commissioner Green. Commissioner Hewlett, are you back? You must have had some business to step away from the meeting for a moment. So, I will say that I'm just incredibly grateful to the staff on a lot of different levels, but I thoroughly enjoyed the briefing that I received from Jeff and Beth on this particular project of the NCPC. I found it very thorough. I was very impressed with the collaborative work that's gone on between the District, the National Park Service, the GSA, and really the thoughtful detail that's been provided, a nd hopefully it was have more than soft teeth as it's disseminated amongst the public and the different jurisdictions. So, I just appreciate this important 150 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com work that'",
        "'CHAIR GOODMANN': 'you've done. And I just want to give Betty a chance if she's back, if Commissioner Hewlett is back, and if not --'",
        "'COMMISSIONER HEWLETT': '  I'm back.'",
        "'CHAIR GOODMANN': '  Oh, you are back.  Okay, there are you, Betty.  Thank you.  Go ahead.  Commissioner Hewlett, do you have any comments on this or questions?'",
        "'COMMISSIONER HEWLETT': '  I didn't hear the question because I had a buffering issue.'",
        "'CHAIR GOODMANN': '  I'm sorry.  We were just commenting on the presentation.  We're just giving the round robin comments on the presentation that we had.'",
        "'COMMISSIONER HEWLETT': '  I gave my comment.  I'm good.  Thank you.'",
        "'CHAIR GOODMANN': '  Okay, very good.  All right, great.  Well, hearing no further discussion or comment, I'd like to ask Ms. Koster to call the roll, to repeat the motion and the second and call the roll, please?'",
        "'MS. KOSTER': '  Certainly.  Commissioner    151     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Dixon made a motion to accept the final Monumental Core Streetscape Design Guidelines, Vertical and Surface Elements.  It was seconded by Commissioner Hewlett.  And with that, Commissioner Cozart?'",
        "'COMMISSIONER COZART': '  Yes.'",
        "'MS. KOSTER': '  Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': '  Yes.'",
        "'MS. KOSTER': '  Commissioner May?'",
        "'COMMISSIONER MAY': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Argo?'",
        "'COMMISSIONER ARGO': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': '  Yes.'",
        "'MS. KOSTER': '  Chair Goodmann?'",
        "'CHAIR GOODMANN': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Green?'",
        "'COMMISSIONER GREEN': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': '  Yes.'",
        "'MS. KOSTER': '  Commissioner Dixon?  VICE-'",
        "'CHAIR DIXON': '  I'm going to say    152     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   yes, but I want to make two points.  One, I'm hoping this will blee d, obviously, into the Pennsylvania Avenue development plan we're working on because it's very connected.  And I always want to comment on the street furniture that can replace the ballasts that we always use for security, if there's some way we can give fo lks a place to sit down, relax, and enjoy shade and these streets.  Thank you very much, yes.'",
        "'MS. KOSTER': '  Thank you, Commissioner Dixon.  Commissioner Davis?'",
        "'COMMISSIONER DAVIS': '  Abstain.'",
        "'MS. KOSTER': '  Thank you.  The motion has carried.'",
        "'CHAIR GOODMANN': '  T hank you.  Thanks so much, Ms. Koster.  I appreciate it.  And so, now we have our final two information presentations and I'd like to start with the Armed Forces Retirement Home.  Ms. Herr, can you begin, please?'",
        "'MS. HERR': '  Yes, can you hear me?     153     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'CHAIR GOODMANN': '  Yes.'"
    ],
    "7. ARMED FORCES RETIREMENT HOME COMMUNITY OUTREACH UPDATE  ": [
        "'MS. HERR': 'Great. Good afternoon, Chair Goodmann and members of the Commission. Today, I'm going to give you a brief overview of the Armed Forces Retirement Home master plan and its hi story before turning it over to representatives from the home to provide you with additional information on their community outreach efforts. The purpose of this presentation is to give a quick update on the progress of the community engagement by the home , not the details of that process as it is ongoing. We recognize that an information presentation does not have public testimony. However, there will be time for public testimony in the future when AFRH has amendments to its campus reviewed by the Commiss ion. The Armed Forces Retirement Home or AFRH is located in northwest D.C. at the 154 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C.'",
        "'MS. HERR': '20009 -4309 www.nealr gross.com intersection of North Capitol Street and Irving Streets Northwest. The home is approximately 272 acres in total, with more than 100 buildings and structures that support AF RH operations. About 600 eligible retired and former members of the Armed Services live on the campus and are provided a range of support services and amenities. AFRH is a non -appropriated federal agency, meaning they do not get federal funding from Cong ress and rely on their own sources of revenue. Congress authorized AFRH to enter into a long-term lease agreement with the developer to redevelop a portion of the campus for private development to supplement their revenue. The previously approved master p lan amendment addressed this private development. The AFRH has the Washington Hospital Center complex to the south, including the Veterans Hospital and the McMillan site further south. To the east is Catholic University and 155'",
        "'MS. HERR': 'NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com the Brookland Metro Station. North are two cemeteries and to the west are residential neighborhoods. The existing campus has a variety of spaces and buildings, including the Lincoln Cottage and visitors center, residential housing, maintenance facilities, and historical facilities that are currently vacant. The site also includes extensive open spaces and a golf course. This is just a high -level timeline showing the history of the master plan that includes the prior NCPC approvals for the original master plan in 2008, amendment number one in 2018, and amendment number two that was approved last June. I've also noted that in July of 2020, NCPC, the D.C. Office of Planning, and AFRH signed this MOU outlining the purview process for the scenic site. Per the MOU, NCPC and the'",
        "'MS. HERR': 'Commission r eviewed and approved the master plan update. After the approval, AFRH is working 156 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com with the D.C. Office of Planning to implement zoning in accordance with the master plan. Once the zoning is in place, AFRH can move forward with construction. This MOU does not apply to the AFRH zone noted here. That area will continue to follow a typical NCPC federal review process. During the approval of the 2022 master plan amendment, several area residents expressed concerns that the applicant hadn't sufficiently coordinated with them or addressed their concerns specifically regarding access to open space in the future development. The Executive Director's Report included a recommendation from the Commission that AFRH reengage with NCPC staff, the District of Columbia O ffice of Planning, the National'",
        "'MS. HERR': 'Park Service, and the community to evaluate the feasibility of possible public access through the western portion of the AFRH zone, golf course, and open space as part of a future AFRH submission for the golf course and open space. 157 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com In addition, the former chair of the Commissioner requested that AFRH come back to the Commission in six months with an update on the progress of their community engagement. Now I would like to turn it over to General Rippe of the Armed Forces Reti rement Home to give an update and introduce his team. Thank you.'",
        "'GENERAL RIPPE': 'Thanks, Jamie, and thanks, Madam Chair and Commissioners. You're looking at the team here today. The issue at the June hearing was really one not of the eastern development, which is essentially going to be a new D.C. community on federal property with a 20 -acre park open to everyone, it was on access to the western side of our property. So, I want to hit three high -level issues that summarize my slide presentation. One, I'm going to talk about security, two, I want to talk about the D.C. ruling and why we closed the gates, because there's a lot of 158 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com misconceptions out there, and then finally, I want to talk about our current community access. So, let's talk about security. T his is not 1955.'",
        "'GENERAL RIPPE': 'This is a very, very dangerous place, the world today, and we're very concerned about our residents' age and what might happen if we open the gates. The other point I want to make is we're a federal installation. We are much more open than other federal installations. And I could argue, and I think you would probably agree, that our residents in our retirement community should be just as safe as residents living on Fort Myer. So, I'm going through the Fort Myer gate two months ago and the guard stops me and says your wife's ID card is expired. He confiscated her ID card and said ma'am, you cannot come on the base today. And I said wait, I'm just going to the commissary. Can't she come with me? He said no, sir, she cannot. She's been my wife for 20 years. 159 NEAL R. GROSS COURT REPORTERS'",
        "'GENERAL RIPPE': 'AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com I'm a retired general officer, so I couldn't bring her on that day and then I had to get a special piece of paper, permission to take her from the gate to the ID center three weeks later to get her ID card. So, that's the state of security on federal installations and we are a federal installation. So, the D.C. ruling in 1951, the D.C. opinions halted MPD patrols and jurisdiction on our property. Traffic really became a safety issue. Cars were going too fast, et cetera, et cetera, so in 1953, there was an attempt by the leadership to curb access, and finally in 1955, as a traffic safety issue, the gates were closed. It had nothing to do with race relations, which we hear all the time. It was basically'",
        "'GENERAL RIPPE': 'a traffic safety iss ue, so that's why we closed the gates in 1955. Now, let me talk about our current community access. We have initiated a walking program. It began before COVID and was suspended during COVID because we allowed no visitors on 160 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com campus, not even for resident s. And we offered 150 families walking permits to come on our property with their dogs on leashes. Thirty -seven have taken us up on that offer and we've only had 19 on the campus this year. So, from where I sit, I think we're pretty open and people hav en't taken us up on it. President Lincoln's Cottage, it's a national monument. It's on AFRH property. We have a memorandum of agreement with them. They have 35,000'",
        "'GENERAL RIPPE': 'visitors a year and numerous monthly events geared toward bringing community members in. We have Creative Minds International on the campus. It's a D.C. charter school, 600 - plus students pre -k through eighth grade with all of the associated activities you would expect a school like that to have. The golf course, this year we had 100 - plus com munity members that could come on property and play golf on the golf course. In fact, one day last summer, and this won't happen 161 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com anywhere else, I'm on the property and I see at one of the holes a family of ten having a great time and playing golf, and I d on't know a golf course anywhere where you can have a tensome. Our residents'",
        "'GENERAL RIPPE': 'have numerous activities that engage and bring in outside groups. The Fourth of July, we open the gates. We have all of our security folks on duty. The non -vets come to help wi th security and we open it to the neighborhood. We have numerous food trucks and, I don't know, 1,000 -plus community members, and the Friends of the Soldiers' Home runs this and they do a great job. We have bouncy houses and all kinds of stuff going on. Kids are running around on our driving range. Because of our elevation, we have a great view of the Washington fireworks display. So, we need to keep talking to the community. I hope you understand now why the security is an issue, and the fact that f rom where I sit as the CEO, we're pretty open to the 162 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716'",
        "'GENERAL RIPPE': '14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com community, and if they filled up the 150 -family walking tour spots, we would probably be inclined to increase that, but we have only had 37 takers to date. So, finally, I refer to the last slide on the n ext steps, and for sure community engagement, and by the end of this year, we want to figure out, determine the direction of the golf course. And again, this golf course, we visualize not only as a resource for our residents and community, but it's also a key rehabilitation facility and there's a lot of things golf course are doing now like, you know, you throw the golf ball and those kinds of things that older people can do. Our average age is 83. And we want to issue some kind of a golf course solicita'",
        "'GENERAL RIPPE': 'tion and negotiation in 2024, and our pledge to the community groups was we would keep them well in the loop on that. That's all I have today, Madam Chairman.'",
        "'CHAIR GOODMANN': '  Well, thank you.     163     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Thank you very, very much.  That was very helpful, Ms. Herr and General Rippe.  Thank you for that presentation.  And now I'd like to ask if the commissioners have any questions for our presenters today?  VICE-'",
        "'CHAIR DIXON': '  I do, Madam Chair.'",
        "'CHAIR GOODMANN': '  Yes, sir.  VICE-'",
        "'CHAIR DIXON': '  This is Dixon.'",
        "'CHAIR GOODMANN': '  Commissioner Dixon, yes. VICE-'",
        "'CHAIR DIXON': 'First of all, General, thank you for your presentation. As an O-6 retired Army and an Air Force Airman Second Class with an honorable discharge, I have two involvements. I want to know more about the golf course because I have played on it a couple of times. I enjoyed it and I know it's been needing repair and been sort of dormant a little bit off and on because of the work you're doing. I would like maybe you could tell me about that. Also, I'm interest ed in, I have a lot 164 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com of veterans I know and some of them may be qualified, but I would like to either now or off record have some advice on how we can give them an opportunity if'",
        "'CHAIR DIXON': 'they qualify. And lastly --'",
        "'GENERAL RIPPE': '  We've done a lot to open up eligi bility, so let's you and I have another conversation tomorrow or Monday.  Let's have a phone conversation and I'll fill you in on that. VICE-'",
        "'CHAIR DIXON': '  All right, that would be great.  And lastly, I have always been troubled by your funding.  I was trou bled that you had to look to the developers, but that probably is good for all of our communities that you did this, but I just think that there ought to be more sustained funding for you.  Now it comes from military officers, military folk giving donation s to it.  Is that still the vehicle?'",
        "'GENERAL RIPPE': '  Every active duty military member gives us $0.50 a month.  That's about $7 million a year.  We get all of the fines    165     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   and forfeitures from the military.  That's about $21 million a year.  We charge the VA  Hospital and MedStar for parking.  That was zero when I got here.  It's now $1.5 million a year.  VICE-'",
        "'CHAIR DIXON': '  Yeah.'",
        "'GENERAL RIPPE': '  We've got initiatives in place to increase the withhold and to get reimbursement for a portion of the $21 million a year we spend on medical care.  So, my charge is enhance your resident initiatives.  We've told -- your revenue initiatives.  We've told the residents that the only increase they were going to have in fees is cost of living, so they could take that to the bank.  So, my charge was go figure out ways we can raise revenue and the original -- VICE-'",
        "'CHAIR DIXON': '  I mean, I think that the $0.50 a month, with inflation, that goes back historical, right?  That hasn't changed for years.'",
        "'GENERAL RIPPE': '  It was $0.25 a month right after the Civil War, so --    166     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   VICE-'",
        "'CHAIR DIXON': '  Exactly.'",
        "'GENERAL RIPPE': '  Yeah, and I cannot -- I have charged that windmill for four years and I can't get any traction with DoD because they don't want to tax our service members anymore.  VICE-'",
        "'CHAIR DIXON': '  I understand that.  I can understand that.  Thank you for your time and I'll wait to have a conversation with whoever can give me some guidance on the --'",
        "'GENERAL RIPPE': '  Yeah, Travis and I will call you and then we'll talk about eligibility, and we'll also give you a little more background on the golf course, okay?  VICE-'",
        "'CHAIR DIXON': '  Thank you, sir.'",
        "'CHAIR GOODMANN': '  Commissioner, thank you for leading off the round robin.  You've done great today, Commissioner Dixon.   So, we are not having publi c testimony as everyone knows because it's an informational session, but there were comment letters that were sent in and they're available on the website.  If you haven't seen those, you can check those out.     167     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   So, I'd like to now jump over to Commissioner C ozart.  Could you please comment and then we'll run through the commissioners?  Thank you.'",
        "'CHAIR GOODMANN': '  Sure.  Appreciate the informational presentation.  I'm curious about the engagement -- to say, I guess, a little bit more about the engagement relat ed to the passes that are available, one, it occurs to me one of the letters that was written in was from Ward 1 council member for the District.  And so I'm certain that through some engagement with that council member's office and their constituent servic es, they would be happy to make sure that those passes are well known in the community.  So I'm curious what engagement there has been around the passes with the council member's office and the relevant -- that council member as well as the council members  for Wards 4 and 5, as well as some of the Advisory Neighborhood Commissioners.  That's my question.'",
        "'GENERAL RIPPE': '  I look forward to    168     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   working with them on that.  It's something we wish people would take better advantage of.'",
        "'CHAIR GOODMANN': '  General Rippe , your video is kind of jumpy.  Did you have more comment beyond that?'",
        "'GENERAL RIPPE': '  I don't know why it's so jumpy.  I'm really calm.'",
        "'CHAIR GOODMANN': '  Okay.  Okay.  That's great.  So you said you're going to be working on that, and you'd hope people wou ld take greater advantage.  Was there any more that you said?  I just don't know if your audio is working.'",
        "'GENERAL RIPPE': '  No, ma'am.  That's it.  I mean, we want to continue to engage with the community, but they have to understand that we want them to ha ve access.  We have a plan to have a 20-acre park for them.  But we're a continuing care retirement facility that's open to a lot of community members, but at the same time, we're a federal installation; we're very concerned about security.'",
        "'MS. KOSTER': '  A nd, General Rippe, this    169     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   is Julia Koster. I'm going to stop your video because we are having quite a lot of difficulty, but you will still be on audio.'",
        "'GENERAL RIPPE': '  Great.'",
        "'CHAIR GOODMANN': ' Thank you, Ms. Koster.  Commissioner Cozart, if you're finished, th en I'm going to move on to Commissioner McMahon, please.  You're muted.  Yeah.'",
        "'COMMISSIONER MCMAHON': 'No, I'm not. Thanks, Madam Chair. General Rippe, thanks for coming back to -- at Chair White's request to talk about the issues there. I think a lot of good information in the brief, which you submitted as part of the record. And I've read the comments, what's indicative of -- is there still much work to be done, I think, with the community, which I know you're working on, while we handle this key issue of security, not just as military installation, but you've highlighted for protecting, really, a 170 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com vulnerable community that you're responsible for providing great care. And we've been up there, as you know, a couple times myself, had lunch with many of the residents, and know what a great job goes on up'",
        "'COMMISSIONER MCMAHON': 'there. So I think we'll continue to monitor the continued development of a national plan for Area A while you work forward with the community to develop Area B as a new neighborhood for Washington, D.C. So, Madam Chair, that's all I've got. Thank you.'",
        "'CHAIR GOODMANN': '  Thank you very much, Commissioner McMahon.  So, Commissioner May?'",
        "'COMMISSIONER MAY': '  Yeah.  I'd say the situation right now with the Armed Forces Retirement Home and their relationship with the neighborhood continues to be troubling.  Now, I will say that it seems like things are better than they were when at least Commissioner Dixon and I sat through a marathon    171     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   hearing on the subject in, I think, 2008.'",
        "'CHAIR GOODMANN': '  Wow.'",
        "'COMMISSIONER MAY': '  An d it was probably one of the longest meetings I've ever been part of at NCPC.  So things are a bit better than at that point, but there still seem to be some significant problems, as evidenced by the letters that we received.  And I have to say I can understand some of the frustration that we are seeing in those letters.  Who's -- (Simultaneous speaking.)'",
        "'CHAIR GOODMANN': '  We've got -- Tim Sheckler, could you please put your -- he's on mute now.'",
        "'COMMISSIONER MAY': 'Okay. Good. Thank you. Sorry, Tim. Didn't mean to cut you off. Anyway, it's still troubling. And I've seen this repeated probably, at this point in my career, hundreds of times with different cases either in NCPC or, more likely, the Zoning Commission, where there is an inability to 172 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com communicate . And there are certain things, certain suppositions that are made on the part of the Agency or the property owner, the applicant, about what has to be. And so we heard evidence of that today. What has to be seems to be some level of security that's equ ivalent to a military base. That is wholly not equivalent to this. It is not the same kind of operation. I understand the need for security and making'",
        "'COMMISSIONER MAY': 'sure that your residents are safe. That is completely understood. But this is not Fort Myer, and I th ink that there's a problem when you start with that as the baseline. So I think that there is some re -examination that has to occur on the part -- (Simultaneous speaking.)'",
        "'COMMISSIONER MAY': 'Could I finish my statement before you say anything? All right. I'm going to continue. So I think there's some re -examination that has to be made of what your basis is. I 173 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com also found that contradiction in the notion that the gates were closed not because of some nefarious purpose but simply because of traffic management. I find that hard to accept, as well, because if it really is about traffic management, cutting all people out of this space, this vast resource, potential resource for the community, simply because you had trouble controlling cars in 1955 -- I'm sorr y. That's not a really good justification for continuing that now. My last statement about this -- and you're welcome to respond when I'm done, but my'",
        "'COMMISSIONER MAY': 'last statement about this is that I believe that you are at the point now where if you're going to really make progress with the community, it's not about the particular things that you are planning to offer. It really should be about having a good facilitated conversation. There are people in this city and in others who specialize in working between communities or working with communities and 174 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com institutions that reside within them. And I think that you would be helped tremendously by getting that kind of assistance. We have done that ourselves in the National Park Service where we are not hearing what peop le are saying, and it helps to have that kind of assistance. The biggest example of this in town is probably the'",
        "'COMMISSIONER MAY': 'Georgetown University Campus Plan before the Zoning Commission many years ago, where they were at absolute loggerheads, and we - - the Zoning Co mmission, which I also serve on -- we let the university know that they were not going to make progress until they made peace with the community. They hired a really good facilitator who has made and kept the peace. And they went on a hiatus with their c ampus plan approval. They came back a couple years later, and they got an approval for that campus plan in one night after having had five hearings of five hours each where it was nothing but a parade of complaints about the university's behavior. They g ot 175 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com through their hearing in one night. I'",
        "'COMMISSIONER MAY': 'think you need that kind of an intervention. That's it for me. Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner May.  General Rippe, did you have a comment on that?'",
        "'GENERAL RIPPE': 'I do. I'm well aware of what community concerns are. We've had three meetings. We've had a lot of dialogue. We listen to them, and they listen to us. I go back to -- we are a federal installation. We're a continuing care retirement community. Security is utmost. It's my respons ibility, okay? And it's very simple what they want: unfettered access to the western side of our property, while we are going to have a 20 -acre park for them with unfettered access on the eastern side. In fact, it looks like if we developed a golf course on the western side, that's going to be open to the community. So I would encourage the community to 176 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com take care of the walking program we already have.'",
        "'GENERAL RIPPE': 'If they want to get on the property this summer, join the golf course and take advantage of the myriad o f other things that are going on at Lincoln's Cottage. So I hear you. Thank you.'",
        "'CHAIR GOODMANN': '  Thank you --'",
        "'COMMISSIONER MAY': '  No, I think, actually, General Rippe, you really just made my point.  So I think you need help.  Thank you.'",
        "'CHAIR GOODMANN': '  Okay.  I'd like to move on and have other Commissioners contribute.  So thank you, Commissioner May.  And Commissioner Argo?'",
        "'COMMISSIONER ARGO': '  Yes.  Can you hear me, Chair Goodmann?'",
        "'CHAIR GOODMANN': '  Yes.'",
        "'COMMISSIONER ARGO': 'Okay. Good. I'm having some t rouble here. I would like to -- oh boy. I'm just going to jump on this last point that Commissioner May made. I think very insightful, 177 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Commissioner May, to recommend this as a kind of situation. I've been involved in this in several positions that I've had, and I probably am thinking of the same facilitator that you might be thinking of. But bringing somebody in, and we could -- I don't know. Chair Goodmann, we could maybe even give them recommendations of people we know and that we've worked with tha t are in the business of facilitating communication and conversation, oftentimes between neighbors and regulators, and I don't know how else to say it - - and government. So'",
        "'COMMISSIONER ARGO': 'I would like to -- I think it was a great suggestion, and I just want to second tha t. And again, we could help identify several people that probably -- if they were interested in that, I think would help them move this issue in a way that it might be difficult to move it in any other way. Thank you.'",
        "'CHAIR GOODMANN': '  Thank you for thos e comments, Commissioner Argo.     178     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': '  Yeah.  I think everything's been pretty much said.  I thank Ms. Herr and General Rippe for their presentations.  I do think I would have liked to hear a little bit more sensitivity  towards -- in the responses regarding the community.  It was lacking, from my standpoint.  It sounded a tad cavalier to me.  So I hope that we really are continuing to work with the community.  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Hewlett.  Commissioner Green?'",
        "'COMMISSIONER GREEN': '  Thank you.  Thank you, General Rippe, for your presentation.  I appreciate it.  And I'd just like to reinforce my fellow Commissioners' recommendations to fully embrace community discussion.  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Green.  Commissioner Wright?     179     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'COMMISSIONER WRIGHT': 'These he - said/she -said conversations make me uncomfortable when they come to us because it's hard to know. In full disclosure, GSA is advising on this project, but it's not out of the Office of Planning and Design Quality. So we have not been intimately involved in this. But I would concur that some kind of facilitation -- I would remind everyone of what a huge success in the end I believe it was that we had with something like this at the Sangamore Road project for DOD, which -- if you haven't seen it, make a point of going to look at it. It's a gorgeous -looking campus. And if you'll remember, the neighbors were really upset about a parking garage, about the height and the li ghting and this -- and there was a long -- and stormwater management along MacArthur Boulevard. There was a host of'",
        "'COMMISSIONER WRIGHT': 'issues. And in the end, with a little intervention, I think it was an exemplary planning process because the community was heard, and comp romises 180 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com were reached. I don't know if -- I think it's DIA who's there. I can't remember. I don't know if DOD would say that they were happy with the end, but I think the neighbors, in the end, felt heard. And perhaps something similar could take place be cause it certainly sounds -- we're hearing contrary testimony, or reading it. And it's difficult to be put in the position of trying to be the arbiters of truth in situations like this. So I think, if a third party could be engaged to facilitate the conve rsation, it might very well lead to'",
        "'COMMISSIONER WRIGHT': 'a better outcome.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Wright.  Commissioner Dixon, I know you spoke earlier, but did you want to comment?  You're next. VICE-'",
        "'CHAIR DIXON': '  Yeah, I do want to say some things.'",
        "'CHAIR GOODMANN': '  Okay.     181     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   VICE-'",
        "'CHAIR DIXON': 'First of all, I would like everyone to -- for the General and for me, to say thank you for your service. This is a facility that is designed to give some old soldiers a place to be cared for. And I think that maybe the G eneral and I need to talk because I know how military might be because I served as an enlisted person and as an officer and had a lot of exposure, Air Force Academy and all. So I got some concerns about privileges that we earn by putting our lives on the line. I didn't, but others did. I did in some ways. And we have to be sort of sensitive to that, you know? And maybe we can talk more about it, if you get my drift. All my colleagues -- none of them wore uniforms and never went through that. And that's'",
        "'CHAIR DIXON': 'not a problem. But folks have certain privileges that they like to have, and we have to protect those for them if we're really thanking them for their service. I'm done with my comments. Thank you. 182 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com'",
        "'CHAIR GOODMANN': '  Okay. Thank you, Commissioner Dixon.  And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': '  No comments from me.  Thanks.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Davis. And I just want to say thank you to General Rippe for his service, as Commissioner Dixon pointed out, and also for the information he shared today. Just want to note, though, that we have received comment letters from the Friends of the Soldiers Home, Georgia Avenue Thrive, Councilmember Brianna Nadeau, and just remember, while we don't have testimony at this meeting, there will be an o pportunity for testimony and discussion in the future. And I think that two things can be true at the same time. I think that there can be a desire for safety and security for people who live in the community, and there can also be a 183 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com strong need for more engagement with the neighborhood and different'",
        "'CHAIR GOODMANN': 'engagement and perhaps a facilitator. So I just want to say it's been a good discussion. I think that we're on a path to uncover more in future testimony and presentation. And I want to thank the General and I want to thank Ms. Herr for the presentation today. VICE-'",
        "'CHAIR DIXON': '  Madam Chair?'",
        "'CHAIR GOODMANN': '  Yes, sir.  VICE-'",
        "'CHAIR DIXON': '  I guess I'm kind of used to open format.  I come back in.  But I gotta make this point.'",
        "'CHAIR GOODMANN': '  Yeah.  Anytime.  VICE-'",
        "'CHAIR DIXON': 'I want to pull the Commander in play from Joint Base Bolling - Anacostia. We in that community, in our Anacostia River East, were able to use Bolling Air Force Base. We had functions there. We had all kinds of things there. And we had a great relationship with the base. 184 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Now, with greater restrictions, we are not able to do that. But I guess we have to organize our community politically because this is a political push. And if we started this Commander, you may be able to facilitate Ba rry Farms and folks in Anacostia being able to use the base at Bolling. There's a lot of things there we could use and like to use. And we could be right next to NSA and'",
        "'CHAIR DIXON': 'the other sensitive places there. I don't think these soldiers who are at the soldie rs' home are any less valuable and sensitive at their age and what they've done than some of the most sensitive areas on Joint Base Bolling-Anacostia. So we gotta -- because we have a very aggressive political community around this facility to get it push ed and raised the letters and all the things that they sent -- I read them. I've been through this longer than anybody here in terms of being a council member representing four in this area. It was my ward, and I could 185 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com go on and on and on. But I think we gotta be careful that we don't let the political efforts, which is very aggressive'",
        "'CHAIR DIXON': '-- any community could do that, you know, if we started doing that. And we could do that around every base in the United States, and it would be very interesting the resul t. So be careful, folks, how you proceed on this. Thank you very much.'",
        "'COMMISSIONER MAY': '  It sounds like Commissioner Dixon is offering to be the facilitator.  VICE-'",
        "'CHAIR DIXON': 'I will be glad to do whatever I can do, Peter. But I think, having dealt wit h -- I think they know how to facilitate very well. They go into places where you got people shooting and killing each other, and they facilitate. I mean, this is chump change. This is easy, easy, easy walk. I just think that the community has gotten s ome energy, which is understandable. And they see a target, and it's okay. That's the way 186 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com it works. I've played the game. I've been in the process. I'm also one of the people elected in this process, this group. And I know what it is when you're orga nized and you get letters in to have a monument to put in and'",
        "'CHAIR DIXON': 'soldiers that -- you can always ask -- we want a monument. You got one. But thank you. I can get worked up on this because 23 years in, and -- whatever. Take care.'",
        "'CHAIR GOODMANN': '  No, it's o kay.  It's all good input.  Thank you, Commissioner Dixon and Commissioner May.  Well, if there are no further comments or questions, I would just like to thank the staff and the Armed Forces Retirement Home team, General Rippe specifically.  So thank you, and look forward to future presentations.'"
    ],
    "8. COMPREHENSIVE PLAN INTRODUCTION CHAPTER UPDATE  ": [
        "'CHAIR GOODMANN': '  And then the next agenda item is an information presentation on the Comprehensive Plan Introduction Chapter update.     187     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   So, for this, we're going to be  featuring Mr. Chrishaun Smith from the NCPC.  And take it away, Mr. Smith.  Thank you.'",
        "'MR. SMITH': '  Good afternoon.  Let's see if I can get this to share.'",
        "'CHAIR GOODMANN': '  I think we have it.'",
        "'MR. SMITH': '  You have it?'",
        "'MS. KOSTER': '  Chrishaun, you just need to click the little icon at the bottom right so that it's full screen.'",
        "'MR. SMITH': '  All right.'",
        "'MS. KOSTER': '  Yeah.  A little monitor.'",
        "'MR. SMITH': '  There.'",
        "'MS. KOSTER': '  Looks good.'",
        "'MR. SMITH': '  Not good on my end.'",
        "'MS. KOSTER': '  Mr. Smith, you're good to go.  It loo ks good.'",
        "'MR. SMITH': '  Sorry.  Not on my end.'",
        "'MS. KOSTER': '  Okay.'",
        "'MR. SMITH': '  I'm sorry about this.  Is there any way that -- let's see.     188     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'MS. KOSTER': '  If you would like, we can have Mr. Champ put the -- (Simultaneous speaking.)'",
        "'MR. SMITH': '  Yeah.'",
        "'MS. KOSTER': '  Let's go ahead and do that. Mr. Champ, if you can put the slideshow up.  There we go.  I think you're ready.'",
        "'MR. SMITH': '  No.  I'm sorry.  It's not coming through on my end.'",
        "'MR. CHAMP': '  This is Tony Champ.  Might I suggest, Chrishaun, if -- maybe he needs to  come out of the meeting and come back in.  I don't know if we can take a three -minute break or something.  I don't know.  But I would suggest that he comes out of the meeting and come back in.'",
        "'CHAIR GOODMANN': '  Please go ahead and do that, Mr. Smith, as qu ickly as you can.'",
        "'MS. KOSTER': '  And while we're waiting for Mr. Smith to join, I just want to ask if Ms.    189     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Dupont is on standby in case he cannot connect.'",
        "'CHAIR GOODMANN': '  I can see him.'",
        "'MS. KOSTER': '  Okay.  Good.'",
        "'MS. DUPONT': '  And, Julia, this is Angela Dupon t.  I'm going to try to share the screen and then see if he can present on his end.'",
        "'MS. KOSTER': '  I think the screen is already up with Tony.'",
        "'MR. SMITH': '  Let's try --'",
        "'CHAIR GOODMANN': '  Is it still up?'",
        "'MS. KOSTER': '  Yes, it still is.  So, Mr. Smith, if you can just -- we can see you and hear you.  So, if you can proceed with the presentation, Mr. Champ will advance the slides for you, okay?'",
        "'MR. SMITH': '  Okay.'",
        "'MS. KOSTER': '  Thank you.'",
        "'MR. SMITH': 'Okay. Good afternoon, Chair Goodmann and Commissioners. My name is Chrishaun Smith, urban planner with the Policy and Research Division. And today I will provide an information presentation on our Agency's 190 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com efforts to update the Introduction Chapter of the Comprehensive Plan. Next slide. During today's discussion, first, I will talk about executive orders and NCPC's Equity Action Plan. Next, I will discuss the Comprehensive Plan and how it informs all of the work that we do within the Agency. Next, I will discuss the purpose of the Introduction Chapter update. Following , I will discuss our first focus group meeting from this past January, when we met with local community groups and stakeholders regarding our equity efforts. And lastly, I will discuss next steps going forward for'",
        "'MR. SMITH': 'the Introduction Chapter update. Next sli de. First, I wanted to briefly talk about the Comprehensive Plan, which is composed of two elements: the District elements, which are prepared by the D.C. Office of Planning, which address traditional city planning issues such as 191 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com land use, housing, and e conomic development; and lastly, the federal elements, which are prepared and managed by NCPC. The federal elements serve as the blueprint for the long -term development of the national capital and are the decision -making framework for Commission actions on plans, proposals, and policies for federal land and building development submitted for its review. The federal elements are critical to informing all of NCPC's planning, policies, programs, and guidelines. Next slide. First, as a reminder, recently we provided an'",
        "'MR. SMITH': 'information presentation on how our Agency is carrying out our Equity Action Plan. The Equity Action Plan was directly informed by the Biden Administration's Executive Order 13985, which charges the federal government to pursue a comprehensive approach to advancing equity for all, including people of color and others who have been historically underserved, marginalized, 192 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com and adversely affected by persistent poverty and inequality, as well as addressing systemic racism in our nation's policies and programs. Just this past month, a new executive order, 14091, further advances these goals, and NCPC will continue to incorporate equity policies and regulations that also advances this work. Next slide. In response to the release of Executive Order 13985 in 2021, NCPC prepared an Equity Action Plan that advances equity through its core'",
        "'MR. SMITH': 'work programs and identified incorporating equity considerations into the comprehensive element updates. Since the federal Comprehensive Plan establishes the policy guidanc e for all of the work that NCPC does, the Comprehensive Plan was identified in Action Item Number 2 of the Equity Action Plan as a principal mechanism to incorporate equity policy within the Agency. As identified in the Action Plan, NCPC will develop a c omprehensive framework and 193 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com guiding principles to address equity across the plan, guide subsequent updates, and inform Agency review and planning initiatives. Since the Comprehensive Plan, again, informs many of the Agency's core programs, it is critical t o put a framework in place to address equity. Next slide. The Introduction Chapter outlines the planning framework for the Comprehensive Plan's federal'",
        "'MR. SMITH': 'elements. The Comprehensive Plan's federal elements are linked by three guiding principles: one, to acc ommodate federal and national capital activities; two, reinforce smart growth and sustainable development planning principles; three, to support local and regional planning and development. Currently, the Comprehensive Plan lacks targeted policies, action s, and investments to improve outcomes for people of color, members of the LGBTQ+ communities, people with disabilities, and those adversely affected by persistent poverty or inequality. It also lacks 194 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com analysis of direct and indirect impacts to these groups. While NCPC's mission and authorities have limited application to development on non - federal lands, there is still a need for a thorough evaluation of the Comprehensive Plan to determine which policies may lead to unintended barriers for underserved com munities'",
        "'MR. SMITH': 'and where new or revised policies could reduce those barriers, particularly on racial and income inequities in the region and opportunities for improving accessibility for people with disabilities. NCPC also needs a comprehensive framework to exam ine potential inequities in the Comprehensive Plan and support equity outcomes across policy topics. The updated Introduction Chapter will provide the historical context of underserved communities in the region and practices that did more harm, as well as guide subsequent updates to the remaining federal elements around public 195 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com engagement and policy. These updates also include acknowledging the existing policies in the Comprehensive Plan that have created barriers to underserved communities, developing a ro bust public engagement strategy for element updates that engages historically underserved communities, and finding opportunities to eliminate and/or'",
        "'MR. SMITH': 'reduce those barriers, and incorporating federal and regional data sets that have been disaggregated by rac e, income, and other factors. Next slide. In an effort to conduct additional outreach, NCPC staff will engage with multiple community organizations as well as local government and key federal stakeholders regarding our efforts to create an equity framework within the Introduction Chapter of the Comprehensive Plan. To engage with historically underrepresented groups and to have additional 196 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com feedback outside of federal stakeholders, NCPC staff will engage in two focus groups to gain additional information on e quity planning within the National Capital Region. The first one was proposed as a discussion with local community stakeholders, and the second would be composed of planning representatives from select local government within the National'",
        "'MR. SMITH': 'Capital Region that have large landholdings of federal lands. NCPC held our first focus group discussion with local community stakeholders this past January. This group was composed of community stakeholders who represent entities that work to advance land use and planni ng considerations for underserved communities ranging from people of color, LGBTQ+, people with disabilities, and other organizations that advocate for those affected by poverty and inequities. Individuals representing a cross section of these underserved groups were selected to participate in this initial discussion, as you 197 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com can see on the screen before you. Discussions with other groups will follow. The goal of the discussion was to gather feedback on our approach to updating the Introduction Chapter. During the meeting, we presented the framework and approach for equity'",
        "'MR. SMITH': 'policy development, identified past policies that may have adverse impacts, and presented draft key considerations that would be used as the framework to address equity within the Introduction Chapter. This diagram describes the framework for how our Agency considered equity impacts and barriers in order to develop the key considerations for equity in the Comprehensive Plan. This framework acknowledges that the Agency's policies and pro grams, both historic and contemporary, have direct and systemic barriers. Direct barriers are short -term impacts to underserved communities, while systemic barriers are more long -term contemporary impacts of different policies and programs. Direct 198 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com barriers can be identified by analyzing the specific effects of the policies, while systemic barriers were identified by conducting literature reviews, reviewing oral histories, and reviewing our own'",
        "'MR. SMITH': 'internal records. These factors helped lead to how we should consider equity in the plan update. Next slide. NCPC's staff identified some of our earlier planning policies and work that may have led to inequities and presented barriers to equity, and this is what we discussed with the focus group and asked them to ad dress these and invite others who have traditionally not been involved to help us address these issues. There are three legacy policies and programs that we identified for exploring our equity principal and key considerations. And these include, first -- next slide -- the development of parks and recreation facilities within the District. Through the Agency's iteration as the 199 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com National Capital Park and Planning Commission, NCPC was responsible for purchasing land for'",
        "'MR. SMITH': 'the development of parks and playgroun ds for the District of Columbia. Through the purchasing of land, the Agency purchased and designated parks and playgrounds explicitly for whites or colored, while the policy of segregated park sites was designated by the Recreation Board of the District o f Columbia. Some long -term barriers of this practice include reduced green infrastructure in historically underserved communities, increased adverse environmental impacts and recreational opportunities, a reduction in a sense of belonging, or increased per ceptions of exclusion and lack of participation in formally segregated spaces. The next policy identified is urban renewal and slum clearance policies. Between 1945 and 1972, NCPC prepared, adopted, and certified 12 plans for implementation by the Redevelopment Land Agency for the removal and 200 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com rehabilitation of'",
        "'MR. SMITH': 'blighted, decayed, and deteriorating areas of the city. The District of Columbia Redevelopment Act empowered NCPC as a planning agency for all of Washington and its predecessor, the National Capital Park and Planning Commission. NCPC approved and adopted modifications to 10 of the 12 approved plans over time. Of these plans, three were for areas within Southwest, one in Northwest, and one in Northeast. The images shown on the screen is the Southwes t Urban Renewal Project, which resulted in the leveling of 99 percent of buildings in the quadrant and the displacement of 4,500 African American families. Some longer -term barriers of this policy include it contributed to residential segregation across t he National Capital Region, a reduction in community wealth and capacity, a reduction in social cohesion, and the disruption of social networks and concentrated residents into public housing. 201 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716'",
        "'MR. SMITH': '14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Next slide. And lastly, we discussed a more recent policy that may have had adverse impacts, the integration of federal campuses in local community design. NCPC's extending the legacy plan had a strong vision of directing federal development to all quadrants of D.C. and the National Capital Region to promote economic development directly and indirectly, using federal investment as a catalyst. The subsequent location of the Bureau of Alcohol, Tobacco, Firearms, and Explosives, ATF, as shown in the image on the screen, the Department of Homeland Security's St. Elizabeth s Consolidation Campus, and GSA's Suitland Federal Center were developed in a manner based on this policy direction. They were built with a premium consideration of security. Although NCPC was not responsible for the location decision, NCPC reviews the f ederal development application for consistency with the'",
        "'MR. SMITH': 'Comprehensive Plan. The development of these facilities 202 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com and campuses both have had positive and negative equity impacts. Some barriers that have resulted from these types of development include redu ction in access for residents at sites where federal facilities are located, creating physical, social, and economic barriers, and limited programmatic engagement between residents and federal facilities. When taking those barriers into account, staff iden tified six equity considerations and presented them to the group that we believe help to address challenges created by the policies mentioned. These key considerations will help frame future rewrites of the Comprehensive Plan elements, specific policies, and action items for the Comprehensive Plan. These key considerations include community engagement, local cultural affirmation, data analysis, economic development, sustainability and resiliency, and physical access.'",
        "'MR. SMITH': 'The stakeholders were then asked to identify the key equity considerations that they 203 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com find the most important for NCPC to focus on crafting policies and regulations on going forward. And this focus group identified community engagement and local cultural affirmation as the two primary conside rations, which I will further elaborate on. Next slide. Community engagement was regarded as the primary consideration that NCPC should focus its efforts to more clearly develop policies and regulations on to address equity in the Comprehensive Plan. Focus group participants recommended that NCPC focus on crafting additional tools to outreach with the local community for them to better understand NCPC's authorities and the differences between NCPC's authorities, including what can be defined as a federal i nterest, the District's authorities, and'",
        "'MR. SMITH': 'other local governments' authorities and involvement. They expressed that this lack of clarity may limit innovation. 204 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Some of our opportunities that were identified by the focus group how we can address some of thes e concerns include developing a tool kit that describes the, quote unquote, federal interest in what the Agency does. This would also include a workflow on the steps on how a project is reviewed by NCPC staff during the planning, conceptual phases, throug h design and cycling phases, as well as review and approval by the Commission. Another opportunity recommended by the focus group attendees would be to strengthen NCPC's role as a liaison between federal agencies and the local community by conducting or requiring federal agencies during earlier planning stages of their'",
        "'MR. SMITH': 'capital developments -- additional workshops and town halls with the local community members as well as local government representatives. These community engagement opportunities presented by the focus group may be similar to some of our existing efforts that the 205 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com Agency has recently undertaken as part of the Pennsylvania Avenue Initiative, where we conducted an extensive amount of outreach to local community groups to gain their insight on how to develop a new, inclusive vision for the Avenue. Next slide. Focus group members identified local cultural affirmation as the second -highest consideration that NCPC should focus its efforts to more clearly develop policies and regulations on to addres s equity in the Comprehensive Plan. Some concerns identified by the focus group members included a lack of understanding how'",
        "'MR. SMITH': 'the Agency may consider how gender, race, and a person's physical ability may impact how they may gain access to federal resources and amenities. They also identified at that NCPC should address how the federal presence may affect opportunities for residents in underserved communities. Opportunities that were identified by 206 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com the focus group include, as another form of liaison role, to serve a role in coordinating with federal landholding agencies to activate federal lands and amenities within underserved communities. Also within this new liaison role, encourage more federal and local partnerships to address and advocate for the needs of underserved communities. Next slide. Currently, we are in the second phase of this project, which is engaging with community organizations and local federal agencies, which will be ongoing through'",
        "'MR. SMITH': 'the spring. We have already met with the first focus gr oup of local community stakeholders. We will next conduct outreach with local planning department representatives from select local governments within the National Capital Region that have large landholdings of federal lands and installations. We will al so conduct outreach with federal agency representatives from large landholding agencies 207 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com within the National Capital Region to gain additional insight. Following these stakeholder engagements, NCPC staff will finalize the draft principal and key considerati ons to include in the Introduction Chapter and begin to prepare a first draft of the revision by mid -2023. Our goal is to have an updated draft submitted to the Commission by the fall of 2023. This concludes my presentation, and I stand by for'",
        "'MR. SMITH': 'any questio ns that you may have.'",
        "'CHAIR GOODMANN': '  Wow.  Thank you very much, Mr. Smith.  That was very thorough and a very, very impressive.  Do the Commissioners have any questions?'",
        "'COMMISSIONER DAVIS': '  I would just say it's a powerful presentation.  And it's importa nt to share that history, I guess, so we never forget.'",
        "'MR. SMITH': '  Agreed.'",
        "'CHAIR GOODMANN': '  Absolutely.  That was    208     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   an excellent presentation.  (Simultaneous speaking.)'",
        "'CHAIR GOODMANN': '  Commissioner Dixon, is that you?  VICE-'",
        "'CHAIR DIXON': '  Yes, it is.  I'm trying to contain myself.  First of all, I appreciate the presentation.  As has been said, it's very well done.  But I'm looking for the teeth, and that's the thing we have to think about. First of all, the clock is running for certain communities, just like the clock is running for us with this global warming and all that stuff.  It's running for communities.  There's not a lot of time to capture and help.  I've been in our Anacostia River East when they moved all the folks from Southwest into public housing i n our community.  And we have been constantly trying to carry that effort, the challenge of that, and so forth.  They say that land is limited.  We control --    209     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com'",
        "'CHAIR GOODMANN': '  You just became muted. VICE-'",
        "'CHAIR DIXON': 'They say also in our community that CR EAM, cash rules every action made. So land is what we can help try to manage with our efforts, with the community, with the city. But in the end, it's the resources like trying to get folks in these communities to have income from jobs that come out of St . Elizabeths, companies that are in the community. They have opportunities at St. Elizabeths, where we put these projects, where we put this stuff so we can get people income enough to be able to meet the costs of living in these areas. We don't really wa nt to just engage people to see the annihilation coming, planning and trying to show them what's happening when they have no ability to really seriously impact on it. You also have communities like in Anacostia where you have 70 percent of our 210 NEAL'",
        "'CHAIR DIXON': 'R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com population are renters. They don't see an engagement or a connection to what the future has for them. Getting them engaged and getting them to understand how it's them to be there and do it -- if you're on Connecticut Avenue and you have a meeting, people are going to show up, even if they're renters, because they understand what it means. But I won't go on. I got a lot of feelings about this, and it's interesting that we are concerned about trying to protect land for use by communities that are there. In Anacosti a, for east of the river, we have the park, Anacostia Park. I've been trying for multiple years now to get some attention on that. It's moving forward now. Well, time is running.'",
        "'CHAIR DIXON': 'Now we've put a lot of money into it, another bridge with a lot of progra mming. But that's wonderful. But I could -- thank you very much, Madam Chair. But it's more than engaging, showing people what's coming, that the bomb is coming and dropped on 211 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com all of them; they're going to be wiped out. You gotta find out how you can t alk about what tools you can use to make it work for them so they don't have to be pushed out. And I think that may be out of our control. It is probably, definitely, in the control of the city government. I think we need to look at stuff like -- and this is outside of our range -- making sure that'",
        "'CHAIR DIXON': 'your property taxes don't go up on residents who are there, and if they transfer that to their family members so they can stay there, then they should do that -- those kinds of things. But that's not in our ability. Thank you. I could talk about this for a long time. I'm also a little troubled -- historically on the Commission, I was involved in many things like these focus groups. I wish I could have maybe been pulled in a little bit just to observe and li sten. But yeah. That's another discussion. Thank you.'",
        "'MR. SMITH': '  Thank you, Commissioner    212     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Dixon.  And we will be sure to pull you into the upcoming focus groups.'",
        "'CHAIR GOODMANN': '  That's a great idea, Chrishaun.  Commissioners, other input, questions?   Otherwise, I'm going to run around the circle.  Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': '  No comments.  No additional comments.'",
        "'CHAIR GOODMANN': '  Thank you.  Thank you. Commissioner Green?'",
        "'COMMISSIONER GREEN': '  That was very powerful, and I really apprecia te all the work that went into that.  And yeah, thank you very much.'",
        "'MR. SMITH': '  You're welcome.'",
        "'CHAIR GOODMANN': '  Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'I don't have too much to say other than I think that the Commission can use this document to educa te people because there's so much that we don't 213 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com know, as citizens of the world, about the kinds of things, subtle as well as overt, that have created the circumstances that we are living with today. So the more you can illuminate history by giving examples , not just pointing at -- illustrating cause and effect. This is the plan, or these were the policies -- and draw a true line that's very clear to what the result is/was, and not leave it to people to draw conclusions that aren't overtly illustrated becau se -- especially people who might resist thinking that this is a real thing,'",
        "'COMMISSIONER WRIGHT': 'that injustices have found their way into the planning process systemically -- people want to resist that idea. Unless you're extremely direct, it will be ignored.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Wright.  Commissioner Davis, please?'",
        "'COMMISSIONER DAVIS': '  I appreciate the presentation and the comments of the other Commissioners.  I don't have anything to add.     214     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   Thank you.'",
        "'CHAIR GOODMANN': '  Thank you.  Commissioner Cozart?'",
        "'COMMISSIONER COZART': 'Yes. Definitely appreciated the presentation. See a lot of opportunities for kind of merging the approach on the federal elements with the approach on the District elements as we're coming up on, in less than two years, starting a comp lete rewrite for the District elements of the Comp Plan. So what you're learning from these focus groups is incredibly timely. Excited to be involved going forward. I think there may be some opportunities for our Executive Director reports to reflect so me of this history on various sites, and that could be one way, to Commissioner Wright's point, of educating folks publicly. Also excited for opportunities where NCPC may be exploring ways to look at this at a bigger level, sets of panel discussions and o ther things that would be a part of that. And we're 215 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W.,'",
        "'COMMISSIONER COZART': 'SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com happy to partner in that. But this is great work. Looking forward to what's next, and happy to partner and collaborate going forward. Thank you for the presentation.'",
        "'MR. SMITH': '  Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner Cozart.  Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': '  Yeah.  Thanks, Mr. Smith, for a great presentation.  I know the great amount of work that went behind doing what you're doing and what you're pulling together with the commun ity.  I appreciate those efforts.  I don't really have much more to add to my very much-more-smart-on-these-issues fellow Commissioners, but look forward to participating in the future.  Again, thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner McMahon.  Commissioner May?'",
        "'COMMISSIONER MAY': '  Thank you.  I also    216     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   appreciate getting this presentation.  I think you showed one that's a little more detailed than the one that we received, and I'm wondering if we could get the final version of that because I think there were some slides that were not what I have.'",
        "'MR. SMITH': '  Sure.'",
        "'COMMISSIONER MAY': 'Yeah. Thank you. I would just want to underscore a few of the comments. I think Commissioner Wright was correct in pointing out that we need to face certain things abo ut the history of planning in the District of Columbia and be direct about it and where we can make changes to try to address those sorts of things. Sometimes they're small, like how things are named, and sometimes they're very big, like the erasure of en tire neighborhoods, which have occurred with the blessing of this Commission in its past. It's not easy to address these things, but I think it's important to be able to do some of those things. 217 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com But I also want to say that, looking forward, having really robust community engagement'",
        "'COMMISSIONER MAY': 'is a critical component of this, and not just in terms of NCPC's planning efforts and the policies that the Commission establishes, but also in how we expect other federal agencies to be working with the communities that surroun d them. And I think that's particularly timely today, having had some of the discussions we had. So I really do appreciate this, and hopefully it will be a good step forward. Thank you.'",
        "'CHAIR GOODMANN': '  Thank you, Commissioner May.  Commissioner Argo?'",
        "'COMMISSIONER ARGO': '  Yeah.  I really appreciate the work that's been put into this and the work that we're going to continue to do on this.  Oh, and I don't have my video on.  Okay.   And first, I'm not quite sure where this came from, but somehow I'm getting a feeling that somehow in this effort, we could engage in    218     NEAL R. GROSS   COURT REPORTERS AND TRANSCRIBERS   1716 14th STREET, N.W., SUITE 200  (202) 234 -4433  WASHINGTON, D.C.  20009 -4309  www.nealr gross.com   some kind of partnership with the university community in the District of Columbia, which is very robust, and what that community has to offer. I will think more on that and offer more detail as I t hink more on that.  But it's a thought.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Argo. And again, I just want to congratulate Mr. Smith and team at NCPC for this excellent presentation and for all the work that went into it. I'm also looking forward to th e work ahead. It certainly is -- it's not just important; it's the imperative of our times. And that's been said before about equity. But I think our Commission -- and I'm new to this. I'm very new to all of this, but we have an opportunity here to mak e a real change. And I think that Chrishaun sees that. Others see that. And I know that this administration has made it the priority. 219 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com So it's also part of our charge to take a look at ourselves not just in'",
        "'CHAIR GOODMANN': 'terms of our internal practices and policies as an Agency but, as has been said by many others already, to look at the planning proposals that come before us. And I've said this to staff, but moving -- BEP presentation just jumped out at me with moving to that particular location where the production staff -- not the administrative staff, but the production staff -- is so negatively impacted because there isn't transportation. There's no mass transit to that location. So we're immediately picking winners and losers. And I think that those are the kin ds of things -- if we want to put teeth into the work that we do, we have to look at all of those barriers to prosperity, whether it's housing, whether it's a job and income, whether it's transportation, whether it's engagement in our community and our sch ools. We have an opportunity here. And'",
        "'CHAIR GOODMANN': 'I'm just so excited about this piece of the work 220 NEAL R. GROSS COURT REPORTERS AND TRANSCRIBERS 1716 14th STREET, N.W., SUITE 200 (202) 234 -4433 WASHINGTON, D.C. 20009 -4309 www.nealr gross.com that's being done by NCPC, along with the climate work. So I just want to say that we have a chance to advance equity and resilience, and I'm willing to do the work that it takes. But I look for leadership from people like Mr. Smith and others on the staff here and other Commissioners. So thank you. If there are no further comments or questions, believe it or not, this concludes our session today. And thank you for all the input and the good thoughts. And I know we have work ahead, so I look forward to working with all of you. Thank you. Our next regular meeting is going to be held Thursday, April 6th,'",
        "'CHAIR GOODMANN': 'at 1:00 p.m. And if there's no further business, we stand adj ourned. (Whereupon, the above -entitled matter went off the record at 4:44 p.m.)'"
    ]
}