{
    "1. COMMISSION ROLL CALL ": [
        "'MS. KOSTER': ' Yes. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' I'm here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Argo? (No audible response.)'",
        "'MS. KOSTER': ' Commissioner Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Present.'",
        "'MS. KOSTER': ' Thank you. Chair Goodmann?'",
        "'CHAIR GOODMANN': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Here.'",
        "'MS. KOSTER': ' Commissioner Dixon? (No audible response.)'",
        "'MS. KOSTER': ' Commissioner Dixon? (No audible response.)'",
        "'MS. KOSTER': ' I see him on the screen. I'll come back. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Present.'",
        "'MS. KOSTER': ' Thank you. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' Here.'",
        "'MS. KOSTER': ' Thank you. And, Commissioner Dixon, are you on?'",
        "'COMMISSIONER DIXON': ' Yes, I am.'",
        "'MS. KOSTER': ' Thank you. I'll note that Marcel Acosta, the Executive Director; Anne Schuyler, general counsel; and Diane Sullivan with the Urban Design and Plan Review Division are also in the meeting.'",
        "'CHAIR GOODMANN': ' Thank you very much. And noting the presence of a quorum I'd like to call the meeting to order. Today's meeting is live streamed and will be available in a few days and it will be located on the NCPC website. If there's no objection, the agenda as posted will be adopted as the order of business. And I'd like to play a short video clip of the Pledge of Allegiance now. If you can all join me. (Whereupon, the video was played.)'",
        "'CHAIR GOODMANN': ' Thank you. And NCPC will continue to conduct our meetings online until the renovations in the Commission chambers are complete. And I want to share how we will be conducting Commission business until that time. And following staff presentations and any other testimony I will ask for a motion and a second as appropriate. And during deliberations we will use the round robin format to ask each commissioner if they have any comments. During deliberations commissioners should be on video unless you're experiencing technical difficulties. At other times when commissioners wish to be recognized they should just un-mute and do so. I want to note that I'm having some technical issues with my GlobalProtect System, so if I am temporarily bumped off the Zoom, I just wanted to let Vice Chair Hewlett -- be aware that you'll be prepared in case that happens. So thank you.'"
    ],
    "2. REPORT OF THE CHAIR ": [
        "'CHAIR GOODMANN': 'Agenda Item No. 2 is the Report of the Chair. And I just want to say we are very pleased to be here today. I know there was some question given the looming business in Congress about whether or not we would be together today, but I'm glad that we are all here. And I also wanted to express my congratulations to the Committee of 100 on the Federal City as they celebrate their 100th anniversary this year. And I just cannot keep exclaiming about the wonderful Beyond Granite tour that we received last month from the staff and the incredible amount of work that went into that and the wonderful model, replicable model that it presents to not just the D.C. area, but also to the rest of the country in telling stories of Americans who are under-represented frequently on the Mall and the many museums in Washington, D.C.'",
        "'CHAIR GOODMANN': 'So I just want to congratulate our staff and our partnerships for that great work.'"
    ],
    "3. REPORT OF THE EXECUTIVE DIRECTOR ": [
        "'CHAIR GOODMANN': ' Item No. 3 is a report from the Executive Director. Mr. Acosta, please?'",
        "'MR. ACOSTA': ' Thank you, Chair Goodmann. I just have one announcement. After a decade with our agency Senior Planner Meghan Dowker is leaving NCPC. Meghan was instrumental in the Commission's Southwest Ecodistrict and Pennsylvania Avenue initiatives. Most recently she led the agency's work on the Monumental Core Streetscape Guide. We thank Megh an for her many contributions and we wish her all the best in her next chapter. That concludes my presentation. You do have a report in your docket. Happy to answer any questions that you might have.'",
        "'CHAIR GOODMANN': ' Thank you very much, Mr. Acosta. And congratulations to the team.'"
    ],
    "4. LEGISLATIVE UPDATE ": [
        "'CHAIR GOODMANN': ' Item No. 4 on the agenda is a legislative update. Ms. Schuyler?'",
        "'MS. SCHUYLER': ' Thank you, Madam Chair. I do not have anything to report this month.'",
        "'CHAIR GOODMANN': ' Thank you very much. Are there any questions for Ms. Schuyler at this time? (No audible response.)'"
    ],
    "5. CONSENT CALENDAR ITEMS NO PRESENTATION ": [
        "'CHAIR GOODMANN': '8456 - UNITED STATES DEPARTMENT OF DEFENSE, NAVAL FACILITIES WASHINGTON, 1053 7TH STREET, SE, WASHINGTON, D.C. - MARINE WASHINGTON P158 BACHELOR QUARTERS AND SUPPORT FACILITY 8494 - UNITED STATES DEPARTMENT OF DEPARTMENT OF DEFENSE, DEPARTMENT OF THE ARMY, RICHMOND HIGHWAY AND BELVOIR ROAD, FORT BELVOIR, VIRGINIA RICHMOND HIGHWAY BUS RAPID TRANSIT STATION 8495 - UNITED STATES DEPARTMENT OF THE INTERIOR, NATIONAL PARK SERVICE, 3200 MOUNT MEMORIAL HIGHWAY, ALEXANDRIA, VIRGINIA MOUNT VERNON CIRCLE SECURITY PROJECT ZC 22-36 - ZONING COMMISSION OF THE DISTRICT OF COLUMBIA, 7024 EASTERN AVENUE, WASHINGTON, D.C. -CONSOLIDATED PLANNED UNIT DEVELOPMENT AND RELATED MAP AMENDMENT FOR SQUARES 3351, 3352, AND 3353'",
        "'CHAIR GOODMANN': 'Hearing none, agenda item No. 5 is the consent calendar. There are four items on today's consent calendar, and the first is approval of the preliminary and final site and building plans for the Marine Barracks Washington P158 Bachelor Enlisted Quarters and Support Facility in Washington, D.C., which has been submitted by the Naval Facilities Engineering Command, Washington. The next is to approve preliminary site and building plans for the Richmond Highway Bus Rapid Transit Station at Fort Belvoir, Virginia, which has been submitted by the Department of Defense. The next is for the approval of the preliminary and final development plans for the Mount Vernon Circle Security Project in Virginia as submitted by the National Park Service. And the last item is to approve a report to the District of Columbia Zoning Commission on a proposed consolidated planned unit development and related map amendment at 7024 Eastern Avenue, NW.'",
        "'CHAIR GOODMANN': 'Are there any questions or any discussion on this consent calendar?'",
        "'COMMISSIONER DIXON': ' I so move.'",
        "'VICE CHAIR HEWLETT': ' I second. Hewlett.'",
        "'CHAIR GOODMANN': ' Thank you. There's been a motion by Commissioner Dixon and a second by Vice Chair Hewlett. Ms. Koster, could you please confirm the motion and the second and take the roll?'",
        "'MS. KOSTER': ' Certainly. Again, Commissioner Dixon made the motion and Commissioner Hewlett seconded. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodmann?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Yes.'",
        "'MS. KOSTER': ' And, Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' Yes.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you. The motion has carried. Thank you, Ms. Koster.'"
    ],
    "6. BUREAU OF ENGRAVING AND PRINTING CURRENCY PRODUCTION FACILITY ": [
        "'CHAIR GOODMANN': ' Agenda Item No. 6A is to approve final site and building plans for the Bureau of Engraving and Printing Currency Production Facility in Beltsville, Maryland. Ms. Free will be making a presentation. Ms. Free, please?'",
        "'MS. FREE': ' Yes, thank you, Chair Goodmann. Can you hear me and see my screen?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. FREE': 'Great. Thank you again and good afternoon, Chair Goodmann and Commissioners. The U.S. Army Corps of Engineers, in coordination with the Bureau of Engraving and Printing and the Department of the Treasury, has submitted final site and building plans for a proposed currency production facility located in Beltsville, Maryland. The Commission reviewed the concept plans for the currency production facility in April 2021 followed by an information presentation in July 2021. The preliminary plans were reviewed in April of 2023 and today the Commission is reviewing the final site and building plans. The Commission's review focuses -- final review focuses on if the applicant addressed the comments and recommendations made during the preliminary review and if there are any outstanding issues. Overall the applicant has worked diligently with NCPC staff to address the Commission's previous comments and staff is recommending approval of the final site and building plans. In the'",
        "'MS. FREE': 'following slides I'll provide a brief overview of the existing site and an analysis of the updates made following the previous review. As a reminder the proposed currency production facility, or CPF, will be located in Beltsville and replace the existing facility that is located in downtown Washington, D.C. The existing CPF is no longer able to support the needs of the modern currency manufacturing process and studies concluded that a new facility would better accommodate required security features and be a more cost-effective option than renovating the existing facility. After an extensive site evaluation study Congress passed the 2018 Farm Bill which authorized an interagency land transfer of a portion of the Beltsville Agricultural Research Center, or BARC, from the United States Department of Agriculture to the Department of the Treasury specifically to construct and operate a new currency production facility. NCPC was divested of its advisory authority to'",
        "'MS. FREE': 'review the transfer of jurisdiction of the BARC property at the time that the Farm Bill became law because the law included language granting the Secretary of Agriculture authority to approve the transfer. This interpretation is consistent with the language in the National Capital Planning Act which conveys authority to the Commission unless the matter specifically has been approved by law. The currency production facility will be located about four miles north of the Greenbelt Metro station and about midway between Interstate 95 and 295. The selected 104-acre site is bound by Powder Mill Road to the south, Odell Road to the north, a forested buffer to the east, and agricultural fields to the west. All but three of the existing buildings on the site have been abandoned since 2012. Institutional, commercial, agricultural, and residential uses surround the site and private residences are immediately --border the site immediately to the'",
        "'MS. FREE': 'north along Odell Road. The project site and its approaches present a bucolic image with rolling agricultural fields, mature forests, and meadows. In the next section of the presentation I will provide an overview of the proposed project and highlight the improvements made to the plan in the final review. The project proposes a 921,000- square foot building with a square footprint and a building height between 40 and 50 feet with solar arrays and green roof proposed on the roof. Eight hundred and forty-nine green surface parking spaces are proposed to serve the 1,286 employees of this facility. Primary access to the site is planned from the south on Powder Mill Road. Loading and service functions are located on the north side of the building and an emergency egress is planned for off of Odell Road. The Commission's preliminary comments requested that the applicant revisit the production employee parking'",
        "'MS. FREE': 'ratio with a focus on improving the number of employees who carpool, encouragement for the project to achieve LEED Gold certification, and more detail about the architectural facade, the landscape plan, and the wayfinding strategy. The Commission also requested a timeline for improvements for off-site intersection and roadway improvements and a better understanding of how these efforts will mitigate air quality impacts from increased vehicle trips in the surrounding community. The applicant has addressed the Commission's prior comments and overall staff finds that the applicant has made meaningful improvements to the project since the initial concept review in response to the Commission and the public. These improvements include reducing wetland, stream, and buffer impacts by retaining 100 percent of stormwater on site and routing wastewater to WSSC, a reduction in single-occupancy vehicle trips to and from the CPF through implementation of a transportation management plan, a 34-percent reduction in the'",
        "'MS. FREE': 'number of surface parking spaces, adding approximately four acres of green space back to the plan, reducing air pollutants from vehicle emissions by approximately 27 percent compared to a no-build scenario, a commitment to achieve LEED Gold certification, incorporating bird-friendly building design standards and materials, increasing tree canopy on site by one-and-a-half acres, and incorporating native pollinator plant species, including milkweed to support monarch butterfly habitat. So I will review each of these improvements in the following slides. To begin with water resources there are several wetlands and two streams located on or near the project site. Physical impacts to wetlands, streams, and their buffers are anticipated to be minor and in many cases temporary. Particularly Wetland 4 is a large jurisdictional wetland at the southeast corner of the site that will be preserved as a site amenity with an overlook. And further, 100 percent of stormwater will be retained'",
        "'MS. FREE': 'and reused on site that will avoid impacts such as erosion, sedimentation, and pollution. The April preliminary plans indicted that industrial wastewater would be pre-treated on site prior to discharging to the USDA's sanitary sewer system where it would be further treated prior to discharging into Beaver Dam Creek, which is a nearby Tier II perennial stream. The final site plans take a revised approach and would route wastewater to WSSC to avoid wastewater discharge into Beaver Dam Creek. 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 With regard to transportation the project includes a transportation management plan with transportation demand management strategies to limit single-occupancy vehicle trips including expanding telework for administrative employees, increased carpool and vanpool use, implementation of an expanded USDA shuttle bus service from the Greenbelt Metro station, on-site bicycle and pedestrian'",
        "'MS. FREE': 'pathways, and support of improvement to bicycle infrastructure in Prince George's County. As noted previously the applicant reduced the amount of surface parking from 1,234 to 849 parking spaces, which is a 34-percent reduction. This reduction in parking results in a proposed 1 to 1.1 parking ratio for production employees and a 1 to 2.6 parking ratio for administrative employees. This results in an overall parking ratio of 1 to 1.4 for the facility. During the preliminary review the Commission requested the applicant revisit the 1 to 1.1 parking ratio for production staff with a focus on improving the percentage of production employees who carpool or vanpool since shift times are regular and many are commuting from similar geographic areas. The applicant indicated that the 1 to 1.1 ratio is the most accurate estimate for the production employees that can be projected at this time. Therefore, staff requests an update'",
        "'MS. FREE': 'to the facility's TMP approximately two years after reaching full occupancy at the new CPF with a focus on increasing carpooling and vanpooling to improve the production employee ratio. This will allow time to see how employee commute patterns change and if locations of employee residences shift in response to the facility's new location. The applicant also plans to complete off-site roadway and intersection improvements to mitigate impacts of increased vehicle trips generated by the proposed CPF. Seven intersections will be improved as recommended in the traffic impact study. Improvements are scheduled to be complete prior to full occupancy of the CPF, which is anticipated for 2031. NCPC will review the traffic improvements proposed on Powder Mill Road and the Baltimore-Washington Parkway as they are federally-owned early next year. The applicant also provided a high- level analysis in the final site plans of the potential impact that traffic mitigation will'",
        "'MS. FREE': 'have on air quality in the surrounding area and found that the proposed improvement will reduce vehicle emissions by 27 percent compared to a no-build scenario. A more detailed analysis of the traffic and utility mitigation plan impacts will be completed in a supplemental EA, or environmental assessment. The Army Corps anticipates re-engaging stakeholders for feedback in development of the supplemental EA before the end of this year and the EA will be out for public comment early next year. At the time of the preliminary review the project intended to achieve LEED Silver (audio interference) in response to Commission comments (audio interference) used to incorporate sustainable design and low-impact development features such as solar PV panels, a green roof, stormwater reuse, native meadows, and EV charging stations. The architectural program and design approach, which is inspired by a vision to create harmony between the building and the environment and'",
        "'MS. FREE': 'to create a distinct identity for the institution, was supported by the Commission as well as the building's footprint, height, and massing and (audio interference).'",
        "'MS. KOSTER': ' I think, Stephanie, you are freezing up. This is Julia and I will ask our tech team to go over and see if they can assist her. (Pause.)'",
        "'MS. KOSTER': ' Thank you. If we could just pause for a minute, we'll wait and see if we can get Ms. Free back on the line. (Pause.)'",
        "'COMMISSIONER ARGO': ' Hello.'",
        "'MS. KOSTER': ' Hello, Commissioner Argo. Nice to see you. I'll go ahead. We're in the meeting now, so I'll go ahead and -- if you want to mute. Thank you.'",
        "'MS. FREE': ' Hi. I'm so sorry about that. Can you hear me and see me?'",
        "'MS. KOSTER': ' Yes, we certainly can.'",
        "'MS. FREE': ' My connection had just dropped. I'm not sure what happened, but I'm happy to pick up where I left off. Does that work?'",
        "'MS. KOSTER': ' Yes, so about a minute back.'",
        "'MS. FREE': ' Okay. Just one moment, please. (Pause.)'",
        "'MS. FREE': ' Okay. I will flip back a couple of slides, and just let me know if that's a good place.'",
        "'MS. KOSTER': ' I think that's -- yes, that was here you froze up.'",
        "'MS. FREE': 'Okay. I was discussing the architectural program and the design approach for the building which is inspired by a vision to create harmony between the building and the environment and to create a distinct identity for the institution. The Commission was supportive of this approach as well as the building's footprint, height, and massing and they requested additional detail on the facade design. The building facade consists of glazing and patterned metal cladding. Metal cladding will provide a uniform appearance across the window and opaque portion of the facade. At the window portions the metal cladding consists of a perforated metal panel that provides shading and privacy. A perforated pattern of the metal -- the perforated pattern of the metal panels will be based on the patterning of finished currency. The basis for its composition is an intricate, netlike patterns of many BEP products, called guilloches. And in response to'",
        "'MS. FREE': 'public comment the facade materials now incorporates a bird-friendly design with grid patterns on the proposed glazing materials. At the section of the perforated screens the design is estimated to provide for bird protection that is higher than the minimum. The facade material for a gatehouse as seen in the upper left image, the vehicle screening, and main gatehouse will be analogous to the opaque portions of the CPF. Additional views around the site, as seen here show the building set within the proposed landscape. The landscape plans include more than 2,000 trees, 32 acres of reforestation, and a net increase of 12 acres of canopy on site. The plan consists of native and adapted meadow species, trees, shrubs, and flowering perennials. Meadows are largely proposed throughout the site. In response to public comment the applicant increased the amount of common milkweed in the meadow gardens at the front entry'",
        "'MS. FREE': 'to 20 percent. Milkweed overall across the site from zero point three acres to two acres. The applicant has also reduced the extent of supported turf grass, which is limited to areas needed for emergency vehicle use and egress. Native meadow grasses are also proposed to enable weed suppression, ecological stabilization, water quality benefits and additional wildlife habitat.'",
        "'MS. KOSTER': ' Ms. Free, this is Julia Koster again. Your sound is a little glitchy still. I'm wondering if you turned your camera off if that might assist in your audio quality.'",
        "'MS. FREE': ' Okay. I will give that a try.'",
        "'MS. KOSTER': ' Much better.'",
        "'MS. FREE': ' Would you like me to move back a slide?'",
        "'MS. KOSTER': ' No, I think just keep going. It was just a little garbled.'",
        "'MS. FREE': 'Okay. Thank you for that note. So as I was saying, the meadows are proposed largely throughout the site. The amount of milkweed across the site has increased from 0.3 acres to 2 acres. The applicant also reduced the extent of support turf grass which is limited to areas needed for emergency vehicle use and egress. Native meadow grasses are also proposed to enable weed suppression, ecological stability, water quality benefits, and additional wildlife habitat. Additional plantings have also been added to the entrance road design as requested by the Commission and Prince George's County. Groupings of plants reflect the existing character of the site with copses of deciduous trees, groves of evergreen trees, and broad meadows. As requested the final plans also include detailed wayfinding strategies and drawings. The program includes directional signage for pedestrians and cyclists and specific locations for all signage. Sign elevations are also provided that'",
        "'MS. FREE': 'ensure consistency between signage types and visibility. So this concludes my presentation. I have incorporated the Executive Director's recommendations listed here into the presentation and I would like to now introduce Mr. Chuck Davis at the Bureau of Engraving and Printing to say a few words. Myself and several members of the applicant and design team are available to answer your questions. Thank you.'",
        "'MR. DAVIS': 'Hi. Good afternoon, Chair Goodmann and fellow commissioners. I'd like to thank you and the NCPC staff for working very closely with us over the -- and the Army Corps of Engineers to influence the design of this critical national facility over the past few years. As stated during the staff's presentation, the design has improved in many areas since our first engagement with the Commission in 2021. We are proud of the design's balance between the Bureau's mission requirements and that of minimizing impacts to the local community and environment. Both are very important to the Bureau's leadership as well as Treasury. As requested, the Bureau fully supports an update to our transportation management plan in approximately two years after our full building occupancy. That will allow us time to fully understand the impacts of this move on our workforce. And so we fully -- like I said, fully'",
        "'MR. DAVIS': 'support that and we'll come back to the Commission on that upon full occupancy. So again than you for your consideration today and we look forward to answering any questions. Thank you.'",
        "'CHAIR GOODMANN': ' Well, thank you very much. Thank you, Ms. Free, and also thank you, Mr. Davis. I'm very impressed with this follow-up review. I think you've addressed many of the concerns that were expressed at the last presentation, but I would like to ask my fellow commissioners if you have any questions or any comments at this time about the report.'",
        "'COMMISSIONER CASH': ' Madam Chair?'",
        "'CHAIR GOODMANN': ' Yes, Commissioner Evan Cash.'",
        "'COMMISSIONER CASH': ' I think it was back on slide 22, but I think that I heard something about EV charging stations and I hadn't seen that in any of the other materials that we provided. Did I hear that right?'",
        "'MS. FREE': ' Yes, that is correct. EV charging stations are proposed. There will be a combination of Level 1 and Level 2 chargers.'",
        "'COMMISSIONER CASH': ' Okay. Thanks.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cash. Yes, Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': 'Yes. First of all I'd like to thank you, Ms. Free, for your presentation. It was very thorough. And I'd also like to thank you for explaining about the Farm Bill and the terms of the Farm Bill and how NCPC was divested of authority with regard to the site selection. I think that was important to explain because we weren't sure at first. And in that regard I'd like to thank Anne Schuyler for her research on this matter as well. So we're very appreciative of her as well. And I'd like to thank the applicant for hearing us, hearing the concerns of the citizens and hearing the concerns that we expressed. The reduction in parking is tremendous. You have now committed to the LEED Gold, which is important. Your transportation management plan. Just thankful for hearing us and making the best of this situation. That was my only'",
        "'VICE CHAIR HEWLETT': 'comment. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you. Are there any other questions for our presenters today on this project? (No audible response.)'",
        "'CHAIR GOODMANN': ' Any additional questions? (No audible response.)'",
        "'CHAIR GOODMANN': ' Hearing none at this time I'd like to then ask our one person who has signed up to speak. That is Jaime Fearer. And, Jaime, welcome to the NCPC. And Jaime is with the City of Greenbelt. Ms. Fearer, you have five minutes to provide testimony. And thank you for coming and sharing with us today.'",
        "'MS. FEARER': 'Thank you very much. Good afternoon members of the Commission. For the record, I am Jaime Fearer, Assistant Director of Planning with the City of Greenbelt. And I'm speaking on behalf of the Greenbelt City Council, and the mayor, which has consistently opposed the relocation of the Bureau of Engraving and Printing Currency Production Facility, or CPF, and continue to do so. The city borders the Beltsville Agricultural Research Center, or BARC, and values BARC as an integral part of Greenbelt's green belt. Despite the city's opposition, the Department of the Treasury has made the decision to locate the CPF, to BARC. Therefore, these comments are offered in order to continue to improve the overall project, and to help mitigate its impacts on the residents of Greenbelt. While we recognize improvements in the plan since we last testified, including most notably a reduction in parking, improved onsite pedestrian and bicycle'",
        "'MS. FEARER': 'circulation, and revised building materials, we also want to highlight those concerns the City has, which remain unaddressed to date. The City continues to have concerns regarding traffic and site accessibility. The applicant proposes to relocate the current facility, which employs nearly 1,300 people from an area well served by public transit, and easily accessed on foot or by bicycle, to an area virtually unserved by public transit, located on a rural road lacking pedestrian and bicycle infrastructure. The Commission staff report states that bicycle, bicycle infrastructure exists on Edmonston Road, or MD 201, and/or Powder Mill Road, but this is inaccurate. While portions of these two roads do have intermittent paved shoulders, they should by no means be considered adequate bicycle infrastructure for the average commuter. The forthcoming supplemental environmental assessment, or EA, should address needed vehicle, pedestrian, and bicycle improvements along Edmonston Road, the Powder Mill Road frontage,'",
        "'MS. FEARER': 'and all other intersections identified for mitigation. Additionally, roadway impacts incurred during this project should be reconstructed with all Prince George's County Master Plan bicycle and pedestrian facilities, as identified in the county wide Master Plan of Transportation. If the SC maglev trainset maintenance facility is located on BARC, which the City is also strongly opposed to, it is anticipated that it will impact some of the same intersections and roadways that construction and operation of the CPF will impact. The Treasury should coordinate with the Federal Railroad Administration, and other relevant parties of the SC maglev project, to determine appropriate mitigation to affected intersections. Surprisingly, the final concept report does not address maglev in any way, nor does it identify the FRA as an agency to include in coordination efforts. The City also continues to have concerns regarding the environmental impacts of this development. The forthcoming supplemental EA should'",
        "'MS. FEARER': 'provide additional information on the environmental impacts of the utility projects, including detail on the conveyance of industrial wastewater into the Washington Suburban Sanitary Commission's sanitary wastewater system. The impacts to wetlands, streams, and stream buffer have been reduced to less than 100 linear feet along the proposed entrance road and parking area on the east side, compared to 117 linear feet in the previous report. The majority of the impacts that remain are to the stream buffer. The applicant should continue to refine the plans to avoid further impacts to the extent possible, and should continue to work toward minimizing impacts to sensitive environmental features onsite, including existing wetlands, to the maximum extent possible. The City would like for specimen trees on site to be retained to the maximum extent possible, especially those listed in very good and good condition. Additionally, as development proceeds, conformance with the requirements of'",
        "'MS. FEARER': 'the Prince George's County Landscape Manual, must be demonstrated. Finally, while the perforated screen design is estimated to provide higher-than-necessary coverage for bird protection, it is not clear if the opaque panel zones included on the CPF and the gatehouses meet the standards for bird-friendly designs, as well. It is also not clear if the current lighting strategy meets bird-friendly designs, and the City once again requests the opportunity to review a photometric plan for the site. Thank you for this opportunity to comment in an effort to continue to improve the overall project, and help mitigate its impact on BARC, the human and natural environment, transportation, the surrounding community, and the residents of Greenbelt.'",
        "'CHAIR GOODMANN': ' Thank you very much, Ms. Fearer. And now I'd like to ask, are there any questions from the Commission, or comments on her, on her input?'",
        "'VICE CHAIR HEWLETT': ' I would just like to thank her and the City of Greenbelt, for their continued interests and their comments, and for being vigilant. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. Are there any other comments or questions? (No audible response.)'",
        "'CHAIR GOODMANN': ' Well, thank you very much, Ms. Fearer. We do appreciate your input, and we do appreciate the information that you're bringing from your leadership in the community. And I would ask, like to ask though, Ms. Schuyler, just to review again the guidance, you know, that you shared previously with the Commission on the site location and selection.'",
        "'MS. SCHUYLER': ' Certainly, Madam Chair. NCPC, the Commission has review authority over acquisition of land in the environments, unless the acquisition is specifically approved by law. In this case, the acquisition was specifically approved by law. The Agricultural Improvement Act of 2018 had a provision which provided the Secretary of Agriculture discretionary authority to transfer jurisdiction of the land to, at BARC, to the Secretary of Treasury. This particular provision divested the authority of NCPC's review authority over the acquisition, and it became the guiding provision for the acquisition.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you, Ms. Schuyler, I appreciate that review. And now I'm opening this up to the Commission for discussion. So, can you please, commissioners, turn on your cameras and unmute. And, is there a final, or is there a motion to approve the final site and building plans for the Bureau of Engraving and Printing Currency Production facility?'",
        "'VICE CHAIR HEWLETT': ' Madam Chair, I so move.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Vice Chair Hewlett. Is there a second?'",
        "'COMMISSIONER ARGO': ' I will second.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Argo, for the second. And, now I'm going to begin to go around the commissioners and ask for your comments on this. And I'm going to begin with Commissioner Vice Chair Hewlett.'",
        "'VICE CHAIR HEWLETT': ' I think I've already shared my comments, so I'm done. I'll pass.'",
        "'CHAIR GOODMANN': ' Thank you. Okay, thank you very much. Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Thank you. No, I appreciate the changes made to the plan, especially the commitment to LEED Gold, the expanded shuttle bus service, and the reduction of parking spaces. And appreciate that very much. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Green. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'Oh, gosh. cannot in good conscience vote yes for this. just can't. I've wrestled with it for a time, and, the design team and the planners I I long have done the best they can to mitigate, but it is, it is, they've tried to make the building disappear and they've done a pretty good job. But no amount of design can make it belong in this location. And I understand the, our legal position. But it's just not, I'm going to vote against it for symbolic reasons, because I think the federal government needs to learn from lessons from this very bad marriage that is going to go on, and on, and on. And as someone with experience working on a facility that is, that was ill conceived from the very start, the headaches that are going to come to both the local and the federal government from this'",
        "'COMMISSIONER WRIGHT': 'project for time immemorial, are going to be significant. And so, it is with some regret that I am, I can't support it. It's the wrong thing to do.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Wright, for your input. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' I'm sorry I can't go video but I have no further comment. I am very attentive to Commissioner Wright's concerns, as always and, but I will move on. I also think there ought to be some way to deal with this bike path issue, if they do go forward. But those are my comments. Thank you for, thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Dixon. Commissioner Cash?'",
        "'COMMISSIONER CASH': 'Thank you. I just wanted to go back to the question that I had had earlier about EV charging. Like I said, I didn't see it in any of the documents as I glanced through them online, or in the packet that we got. But I just want to emphasize that it's not very often that we build brand new parking lots where there was nothing, so I think in this case, maybe we should emphasize this a little bit more. Because you could actually, if we're trying to get to LEED Gold, you actually get a LEED point by installing the infrastructure in 10 percent of the spaces for Level 2 charging. So, it seemed like it was kind of like a side thing that we were talking about as we went through the presentation. But I think that building this new parking lot, we're going to have a'",
        "'COMMISSIONER CASH': 'lot of workers that have to drive out there and we should be encouraging electric vehicles. So putting that infrastructure in place and getting one more point closer to LEED Gold, I think would go a long way as we look at the future because we don't build many new parking lots. So if we have to have it, let's make sure it's sustainable. So that's my only comment.'",
        "'CHAIR GOODMANN': ' Very good, thank you Commissioner Cash. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' I have no comments to make. Thanks for the presentation.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Davis. Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' No comments, thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Giachetti. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' No comments. I thank the staff for their work on this project, and for the presentation.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cozart. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes, thanks. Again, I'd add my thanks to the staff for their work, along with the work of the applicant to make changes as we requested. And, looking forward to seeing their results after their supplemental EA is done regarding the transit issues off, off the reservation that we talked about. Other than that, no comments.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner McMahon. Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': 'Thank you, and thank you for the presentation. The National Parks Service is working with the applicant on the supplemental EA, as it will require a transfer of a portion of NPS land associated with the B-W Parkway for the transportation improvements that they're looking at. We do continue to be concerned with the traffic impacts. As I think all of you know, the B-W Parkway is already pretty slammed, and adding anything else is a strong concern. I will also say that I'm a bit concerned about the storm water as they are currently, the applicant is currently requesting space on Parks Service land to deal with their storm water, which as a matter of practice, we like to take care of our own storm water, and not the storm water of others. So that will be something that we will continue to be working with the applicant on,'",
        "'COMMISSIONER STIDHAM': 'through the supplemental'",
        "'CHAIR GOODMANN': ' Interesting. Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes, sorry. I would like to, I was going to make another comment but I think what I'll do is I'll just, I would like to join with Commissioner Cash's comments on the importance of, with this parking lot, of including EV charging stations in this design. It's the kind of attention and foresight that we ought to be looking at and paying attention to, on these kinds of projects. That's my only comment. Thank you.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Argo. And I want echo some of the comments that were already made, and before I do, I want to thank Ms. Fearer for her testimony today, and thank staff and the project manager, for their testimony, as well. The project has seen improvements and I think that's a very good thing. I particularly was concerned about transportation. You know, 1,300 employees being moved into a totally different location where they typically would have had access to mass transit and now do not, is a concern to me. I am, I share concern about specimen trees that can, could possibly be saved. It is a beautiful space. I an thrilled about the EV charging stations. I think that's wonderful. I think there have been significant improvements in the water arena, and I, particularly wastewater. The storm water is a concern, and I'm hopeful that the applicant can'",
        "'CHAIR GOODMANN': 'work closely with NPS, and work on this supplemental EA to make sure that these other challenges are being addressed. But I do believe that the Bureau of Engraving and Printing has made an effort during this review process, to respond to our concerns and I'm grateful for that. And with that, I would just like to ask, are there any further questions or comments from the Commission? (No audible response.)'",
        "'CHAIR GOODMANN': ' Hearing no further comments, Ms. Koster, could you please confirm the motion and the second, and take the, the roll, please?'",
        "'MS. KOSTER': ' Certainly. The motion was made by Vice Chair Hewlett, and Commissioner Argo seconded. With that, I'll ask Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Thank you. Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodman?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' No.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' And, Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' I'd abstain.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you, Ms. Koster, the motion has carried.'"
    ],
    "7. PENTAGON RESERVATION MASTER PLAN UPDATE ": [
        "'CHAIR GOODMANN': 'Agenda Item 6B, is to approve comments on the Pentagon Reservation Master Plan Update. We have a presentation by Ms. Shipman.'",
        "'MS. SHIPMAN': ' Yes, thank you. Can you see my screen and hear me? (No audible response.)'",
        "'MS. SHIPMAN': ' Great, thank you.'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. SHIPMAN': 'Good afternoon Chair Goodman, and Commissioners. The Department of Defense, Washington Headquarters Services, has submitted a draft Master Plan Update for the Pentagon Reservation. The Commission's review of draft master plans focuses on topics such as program needs, proposed uses, circulation, sustainability strategies, and consistency with the comprehensive plan. Today, I will provide an overview of previous planning efforts, site history, and the draft plan, along with staff's recommendations for plan refinement. The Commission reviewed and approved the previous master plans for the Pentagon in 2005, and 2016. The 2016 Master Plan made significant changes from the 2005 Master Plan. However, this update serves as a minor revision, continuing the vision and goals of the 2016 plan in preparation for a more comprehensive master planning effort in 5 years. Located in Arlington County, Virginia, the approximately 245 acre Pentagon campus is bounded by Arlington National Cemetery to the west, the'",
        "'MS. SHIPMAN': 'Pentagon Lagoon to the east, and Interstate 395 to the south. The draft Master Plan update expands the study area from the 2016 Master Plan to include both the Pentagon campus and the Mark Center, completed in 2011 as part of the Base Realignment and Closure Act of 2005. The Mark Center is located in Alexandria, Virginia, approximately 4.5 miles away on 395, and considered part of the Pentagon Reservation. The Pentagon is on the National Register of Historic Places, and is listed as a National Historic Landmark. The draft Plan includes a history of the Pentagon development and community displacement at the time of construction. The Pentagon was built in 1943 on the site of the Washington Hoover Airport, to consolidate the War Department under one roof. Plans required more land than the former airport provided, and the federal government decided to use eminent domain to seize two Black'",
        "'MS. SHIPMAN': 'communities, East Arlington, and Queen City, forcing the relocation of over 900 residents within two months of receiving notice to move. Staff supports the inclusion of this history in the latest Master Plan document, but notes that Arlington County staff suggested the applicant include additional details to provide a more complete picture of the impacts of this period on Black communities. Staff recommends that Washington Headquarters Services coordinate with the Arlington County Neighborhood Services Division, to refine the plan to incorporate this information or references to additional resources. Some of the key external projects that are recently completed or in development around the Pentagon campus, are listed on this slide. Of particular note are the proposed 9/11 Memorial Visitor Education Center to the west, labeled number 1, which was reviewed by the Commission at the July meeting. And the Amazon HQ2 Metropolitan Park Project to the south, labeled number 3.'",
        "'MS. SHIPMAN': 'The Commission highlighted the poor pedestrian connection from the proposed Visitor Education Center, to the 9/11 Memorial on the Pentagon campus. Staff recommends that the applicant coordinate pedestrian improvements between the Memorial, and Visitor Education Center with Arlington National Cemetery, the Pentagon Memorial Fund, and applicable local and federal transportation agencies, to improve this connection. The overall goals presented in the draft Master Plan are to improve security, enhance safety and quality of life for employees and visitors, enhance environmental sustainability and climate resilience, balance planning factors and development pressures, and enhance multimodal access. The Master Plan projects are organized by topic: security, new facility and land use changes, circulation, environmental sustainability, and energy. Several projects are carried forward from the 2016 Master Plan. The only projects proposed for the Mark Center in the draft plan are energy conservation measures. Proposed projects are shown on the key map to the'",
        "'MS. SHIPMAN': 'right, color-coded by topic, and will be further detailed on the following slides. Security projects are not shown; however, staff supports the overall approach to establish a permanent, controlled perimeter, and to augment the protection of other key support areas. Staff recommends that as security projects are developed, they are submitted to NCPC for further review to ensure the proposals balance security needs with the, with considerations of accessibility, design quality, historic preservation, and pedestrian experience. Proposed new facility and land use change projects are shown on the key map to the right in purple. New facility projects are planned to be completed in the short term, zero to 5 years, and land use changes are planned for the long term, 6 to 20 years. The existing land use pattern on the Pentagon campus is generally retained in the proposed plan update, with three primary land use changes that support'",
        "'MS. SHIPMAN': 'the plan's sustainability goals. The conversion of certain parking areas into green space and bioretention, the conversion of the eastern portion of the North Village to a combined green open space in support, and land use changes to parking areas along Army Navy Drive, to mixed use support. New mixed use projects in Pentagon City include, including Amazon HQ2, have been developed in close proximity to the Pentagon's parking lots along Army Navy Drive, south of 395. The plan proposes a change in land use to mixed use support to position these parking lots for potential future in-fill development, which could incorporate a range of uses, including commercial uses, support uses for the Pentagon, pedestrian enhancements, and potentially, transit facilities and green space. However, the plan notes that future study is needed to determine the development feasibility and appropriate uses on these sites. The new facilities plan for the Pentagon'",
        "'MS. SHIPMAN': 'Reservation are limited, and include the center courtyard stage and stairs, and the Control Tower and Fire Day Station. The replacement Control Tower and Fire Day Station facility received NCPC preliminary and final approval, by delegated action in December 2021. The Pentagon site and the Pentagon transit center accommodate more than 26,560 employees traveling to and from the site every day, while also serving regional commuters as a major regional transportation node. The draft Master Plan update includes improvements to the transit, vehicular, parking, pedestrian, and bicycle systems. Plan circulation projects are shown in blue on the key map to the right, and are all planned to be completed in the short term, zero to 5 years. During its review of the 2016 Master Plan, the Commission encouraged Washington Headquarters Services to meet the 1:4 long-term employee parking ratio in the next Master Plan update. Since 2016, total parking has'",
        "'MS. SHIPMAN': 'been reduced and the Pentagon now meets the comprehensive plan parking ratio of 1:4, with 6,564 employee spaces to 26,560 employees. A recent circulation improvement project is responsible for most of this reduction. The Mark Center is located off of 395 in a suburban area beyond Metro, and the current parking ratio is 3,747 spaces for 6,400 people, or 1:1.7. The comprehensive plan standard for these areas of the region, is 1:2. The applicant has noted that some parking space are not in use, and the parking count and ratio will be reviewed as part of the transportation management plan, which will be submitted within one year of NCPC final approval of the Master Plan Update. The draft Master Plan Update includes changes planned in the south parking lot, to improve the safety, security, and efficiency of the vehicular and pedestrian circulation system. And to improve sustainability features. The project'",
        "'MS. SHIPMAN': 'includes elements such as signalized crosswalks, way finding, and improved pedestrian and bicycle connections. Additional circulation projects include pedestrian improvements to the north parking lot, area wide sidewalk improvements, connector road bridge upgrades, and intersection improvements, and pedestrian access control points at the entrance to the Metro station, and Corridor 8. The planned Corridor 8 access control point along the northeast of the Pentagon Building received final NCPC approval through delegated action in September 2022. The proposed Metro station access control point would redevelop the employee screening facility, and current access control point at the Pentagon entrance adjacent to the Metro station. As encouraged by the Commission in 2016, the current draft Plan includes an intensified focus on storm water best management practice strategies throughout the campus. The 2016 Master Plan took a different approach to sustainability from the 2005 Master Plan, through the use of surface parking, combined with'",
        "'MS. SHIPMAN': 'storm water management techniques versus structure parking with green roofs, which the applicant deemed economical infeasible, and difficult to execute. The current draft Master Plan Update continues the 2016 approach by decreasing the amount of parking and impervious areas, while increasing green space. Overall, green space on the campus will increase by 7.5 percent. Planned environment and sustainability projects are shown in green on the key map to the right, and are all planned to be completed in the short term, zero to 5 years. Sustainability projects proposed include storm water management through techniques such as parking lot bioretention, tree box filters, and vegetated roofs. This shows the proposed south parking lot storm water management project, which includes a bioswale and porous paving. Several energy projects are proposed on the Pentagon campus, including energy upgrades, pilot EV charging stations, and over the long term, installing infrastructure to transition to a'",
        "'MS. SHIPMAN': 'Pentagon-wide zero emission vehicle fleet. Additionally, the Pentagon is initiating feasibility studies to explore the installation of large, or large scale, photovoltaic systems. The proposed energy projects at the Mark Center also include additional EV charging stations, energy upgrades, and a project to install a canopy system with photovoltaic panels on the top level of the Mark Center's north parking garage. The plan notes that the Pentagon campus has been entirely developed, and retains only a few natural areas. Arlington County staff recommended the applicant set a tree canopy target for the campus, and noted the Pentagon City Sector Plan target of at least 20 percent, as a point of reference. The incorporation of additional trees on the interior of the campus is subject to security considerations. Therefore, staff recommends that prior to the next Pentagon Reservation Master Plan, the applicant study the potential to further expand tree canopy, and'",
        "'MS. SHIPMAN': 'consider setting a tree canopy target in the next Master Plan. The next master planning effort for the Pentagon Reservation will be more comprehensive than the current update, providing an opportunity to re-envision the future of this 245 acre campus, and the 16-acre Mark Center. In particular, the applicant should consider broadly addressing sustainability and climate resilience, multimodal connectivity within and around the campus, pedestrian safety and experience, increased outdoor amenities for employees and visitors, continued reduction in impervious area, and conversion of land dedicated to surface parking to allow for other uses such as future development opportunities. Staff recommends the Commission support the goals and overall approach presented in the draft Master Plan Update, and provide the comments highlighted throughout my presentation and listed here, and on the following slide. That concludes my presentation. Members of the applicant team from Washington Headquarter available to Commission. Services answer any and'",
        "'MS. SHIPMAN': 'qHDR, uestion are from also the Thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much, Ms. Shipman. We appreciate your report. And, I'd like to ask Commissioners if you have questions right now for Ms. Shipman, please ask them now. Anyone want to be recognized here? Any questions? (No audible response.)'",
        "'CHAIR GOODMANN': ' Well hearing none, we do have one person who is signed up to present to us today and provide testimony. Mr. Ben D'Avanzo, if you could please turn on your, thank you, there you are, your camera and unmute. We're eager to hear from you. Thank you. MR. D''",
        "'AVANZO': 'Hi, thank you. My name is Ben D'Avanzo, and I am a resident of Pentagon City. I am speaking for myself today but I am for context, a member of several neighborhood commissions, including the Pentagon and Crystal Cities Council, Co-chair of the Livability 22202 Housing Subcommittee, and represented the neighborhood on the update of the Pentagon City Sector Plan. But again, my views are my own. I wanted to speak to two opportunities to strengthen the recommendations here, and really do a lot of good at the same time. In particular, I want to speak a little bit more about Queen City, and the interconnection between it and how we can have a lot more come out of the parking lots that are proposed for alternate land use. I want to quote a little bit about the history of Queen City from the Arlington Library, and the Arlington Black'",
        "'AVANZO': 'Historical Society. Residents of Queen City were originally descendants of freed slaves who had lived in the area called Freedman's Village, that was eventually razed and displaced due to government action and generally, racism and dislike of those communities. They had moved to Queen City with help from a church, and created a close-knit community with men working at the nearby brick yards. It was a strong community built on proximity, hard work, social ties, and the realities of Jim Crow. The 1940 census showed 903 people living in 218 residences in the whole of East Arlington, of which Queen City was a part. Queen City was not razed for the Pentagon Building, but for the overall Pentagon project. In order to accommodate the large number of individuals who would be commuting and parking in the Pentagon on a daily basis, extensive accommodations had to be made for the automobile.'",
        "'AVANZO': 'Residents were given 4-6 weeks to leave their homes in an already tight housing market, and African Americans had even fewer housing options than Whites. With intervention from Eleanor Roosevelt and the House Military Affairs Committee, temporary trailer parking was finally set up for residents in nearby Green Valley, and Johnson's Hill. But not before many families lost all of their possessions because they had no safe place to store them. If you have not seen it, I recommend coming here to Pentagon City and checking out the new art project in Amazon HQ2 first phase to Queen City. It's a really great project. But I really wanted to take the opportunity to emphasize the deep, deep harm and injustice that was done to the residents of Queen City, nearly 100 years ago because of the creation of not just the Pentagon, but parking lots. And particularly in the light'",
        "'AVANZO': 'of our I think, shared desire to reduce reliance on cars, and reduce reliance on surface parking and its impact on the environment. The proposed master plan proposes a potential alternate site use for parking lots that now are on Army Navy Drive, which is actually more in Pentagon City itself than the Pentagon. They're separated by 395, a large highway. The plan itself says that there will be potential study for use of those parking lots. And, I think there's an opportunity now to guide the direction of that study. In particular, to guide the direction of that study for the use of affordable housing on those sites. And --(Simultaneous speaking.)'",
        "'MR. JUTTON': ' Three minutes, Mr. D'Avanzo. MR. D''",
        "'AVANZO': ' Oh, I'm sorry?'",
        "'MR. JUTTON': ' That was three minutes. MR. D''",
        "'AVANZO': 'Oh, thank you. In particular, affordable housing to make up for the harm that was done to the community due to Queen City, and the increases in housing prices. We're seeing 20 to 30 percent rent increases in this area, and a new wave of displacement meaning that service workers at retail, hotels, and yes, Pentagon employees, are not able to live in the area and must commute by car many, many miles away because they cannot find affordable housing. The second thing I want to mention is an opportunity to include, improve pedestrian and bike transit between Pentagon City and the Pentagon. The Sector Plan update for Pentagon City includes a proposed green ribbon, which is a biophilic pathway weaving throughout. I included some slides around that in my written testimony. The pathway right now between Pentagon City and the Pentagon is unpleasant, and unsafe. We have many people'",
        "'AVANZO': 'who live in the neighborhood, and many thousands to visit here via hotels, who travel to the Pentagon, travel to the 9/11 Memorial, and must dodge traffic. Must go under concrete bridges, or concrete tunnels. And really recommend specifically creating a safe, dedicated biophilic path between Pentagon City and the 9/11 Memorial, and the entrance to the Pentagon so that pedestrians and bikers can safely travel there, and in fact, would like to travel there instead of using other modes of transit, such as cars. I think there's a real opportunity here, and recommend that you consider both addressing affordable housing, and improving biophilic pathways. Thank you.'",
        "'CHAIR GOODMANN': ' And, I do thank you, Mr. D'Avanzo. Appreciate your input and your great ideas, and suggestions. Are there any questions from the Commissioner, Commissioners for Mr. D'Avanzo? (No audible response.)'",
        "'CHAIR GOODMANN': ' Mr. D'Avanzo, appreciate that history you've shared with us. I think it's certainly of interest to all of us, and so thank you for that bit of history. I'm now going to open it up to the Commission --(Simultaneous speaking.)'",
        "'COMMISSIONER DIXON': ' Madam Chair?'",
        "'CHAIR GOODMANN': ' Yes, sir?'",
        "'COMMISSIONER DIXON': ' Okay, you're opening it up to and I'm --'",
        "'CHAIR GOODMANN': ' Yes, I'm opening it up.'",
        "'COMMISSIONER DIXON': ' Okay, good.'",
        "'CHAIR GOODMANN': ' I was just going to --(Simultaneous speaking.)'",
        "'COMMISSIONER DIXON': ' I want to, yes, excuse me.'",
        "'CHAIR GOODMANN': ' Yes, please go ahead, Commissioner Dixon.'",
        "'COMMISSIONER DIXON': 'Yes, I wanted to just mention to Mr. D'Avanzo, and I appreciate very much his testimony. A couple comments though. One, I think we need to talk about former enslaved people being released, not slaves since no one is really a slave. But that's a minor point, but I think it has significance. But the other thing I wanted to suggest is I'm curious about Madam Chair, generally, this parking discussion. I know that there's been a desire to reduce parking so we limit the use of cars on the road, to try to cut back on cars. But if you know the Pentagon City area, and I'm there over in that area quite a bit, there about three years ago was a massive move to build parking under the Pentagon City Mall area, Pentagon Row. It got so interesting because they, not only did they put, make, create the'",
        "'COMMISSIONER DIXON': 'parking there, but they named it Air Force, Army, and Navy floors. And also put in systems which are pretty common now, that tell you how many seats are available, I mean spaces are available when you enter. So I think we may have discouraged, may have limited the parking at the Pentagon, which I think has, has merit, of course. But I don't think we have necessarily eliminated the need for people, or the people using vehicles. What we may have done is probably supported the parking industry, by encouraging these new floors to be built and put in place for that. So it's okay, that's the way things work. But I just kind of mention it and try to get people to drive less, and that's not what I'm hearing. So that's my general comment at this time. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you. I appreciate that, Commissioner Dixon. But any further questions for our, our guest Mr. D'Avanzo? Yes, Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': 'I don't have questions and I hope he's still listening. I really want to thank him for his presentation. It is important to share history. And while we see the need for the Pentagon and the Master Plan and I support the comments as set forth by Ms. Shipman, I thank her for her presentation as well. But it is so frustrating to me to hear similar instances over and over, and over and over again. So here in this particular case, as our guest Mr. D'Avanzo I think it's pronounced, as he indicated and as Ms. Shipman indicated, these folks were displaced with only four to --and it's not just their families, but it's a community set up because you can't live everywhere. These are, the families are formerly enslaved people, and thank you Commissioner Dixon, formerly enslaved people who moved to these communities and established a community, which'",
        "'VICE CHAIR HEWLETT': 'it was not easy. And then they get displaced and where are they going to go? Because you can't, you have redlining, you have homes like Levitt Homes with the restrictive covenants. You can't get loans. You have inflated interest rates, and so they have to find a place. They find themselves in trailer parks, or asked -- these people were specifically asked to double up, double up their families where they used to, they had homes before. And, this happens time and time again. And in my former capacity as chair of the Maryland National Capital Park and Planning Commission, we had many plantations here in Prince George's and Montgomery Counties. And I'm sure we're no different from any other jurisdiction, or many other jurisdictions. And there was always this interest in preserving the grave sites on the plantation, or the big house, so to speak. And, there are'",
        "'VICE CHAIR HEWLETT': 'African Americans who are buried with no markers and what not. I'm like, you have to do archaeological tests to see if there are grave sites and artifacts there, as well, because they matter, too. And so, I really want to thank him for sharing that history. I want to thank Ms. Shipman and of course, you know, I support the, the comments that were made for the improvements to the Master Plan for the Pentagon. But I just think it's so important to share that story, and I thank you for being bold enough to put that forward.'",
        "'CHAIR GOODMANN': ' Thank you, thank you very much, Vice Chair Hewlett. I couldn't agree with you more. Are there any more questions, and if there are no further questions for Mr. D'Avanzo, then I would entertain a motion to approve the comments on the Pentagon Reservation Master Plan Update. Is there a motion?'",
        "'VICE CHAIR HEWLETT': ' I so move, Madam Chair.'",
        "'CHAIR GOODMANN': ' Okay, thank you, Vice Chair Hewlett. Is there a second?'",
        "'COMMISSIONER DIXON': ' Second.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Dixon. It's been moved and seconded. Now we can start with deliberations on the presentation. Commissioner McMahon, I'm going to start with you, please.'",
        "'COMMISSIONER MCMAHON': ' Thank you, Madam Chair, I appreciate it. I see a lot of hard work evidenced here by the Department of Defense team, some of which are onboard and standing by for any questions. But also by the NCPC staff to work with them, to develop a very good set of recommendations that the Department supports as we complete this Master Plan, including the incorporation of the Mark Center into the Reservation, which was transferred from the Army to the Department of Defense itself, that bureaucratic terminology there for you, several years ago. And you see our commitment there for an environment for energy, for resiliency, sustainability and it's for the community as we work some of the issues that were identified. So, if there's no other questions regarding that, we'll go around the table and I appreciate your support.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner McMahon. Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Thank you for the presentation. I have no comments.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I have no additional comments, other than how fortunate I feel to be part of a group that has these kinds of projects in front of us. And brings people forward who teach us things about the work that we're doing that are, that have historical significance and foundation.'",
        "'CHAIR GOODMANN': ' Thank you, thank you very much Commissioner Argo, I couldn't agree more. Commissioner, oh, I'm sorry, Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' It's okay, I have no additional comments. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. Commissioner Green?'",
        "'COMMISSIONER GREEN': 'Thank you very much. Two comments. One, I would like to see better pedestrian connectivity to the, between the Pentagon and the 9/11 Memorial, and the Visitor Center as we've discussed before. Any recommendations that, I mean, that should be a significant set of recommendations as important as that monument is, and to the number of people that would like to access it by foot. And, the second is in the form of, I would very much like to see the Master Plan address the community displacement issue, and really make recommendations for active inclusion of mitigation for this. Documentation is an important start. It has to start there. But the Master Plan should go beyond that to make recommendations for mitigation in the form of community amenities, memorialization, or other tangible efforts made in consultation with that community, and the descendants of those who were displaced. And that's where'",
        "'COMMISSIONER GREEN': 'the decision should be made and again, to go beyond, start with documentation but move well past that. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Green. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I would agree with everything Mr. Green just outlined. Some interpretive evidence of all this research on the site would be helpful. I also think that the plan, this is a tough site. It's tough to green this up and you've done as good a job as you can really, with what you've got to work with. But so I won't go on but I do think that the, it is important to have some physical markers and interpretation for lots of people to learn this history. Because I for one, knew nothing about it, and it's a story that needs to be told. you, Comm'",
        "'CHAIR GOODMANN': ' Absolutely. issioner Wright. Commissioner Dixon? Thank'",
        "'COMMISSIONER DIXON': ' Yes, Madam Chair, I also appreciate all the comments that are being made. And, I would also just like to add sort of an add that we also recognize that Arlington Cemetery was also land, grounds that were first inhabited by folks who were, people who were enslaved, or freed, freed enslaved people then, who were building the Capitol, the White House, and the monument. And they had a thriving community there with a bank, and churches, and homes. And that is now where the cemetery is located. So it's, thank you just adding this comments, thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Dixon. Sounds like we need a lot more interpretation. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Thanks for the presentation. No additional comments.'",
        "'CHAIR GOODMANN': ' Thank you. Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' Hi, thank you, no comments here either.'",
        "'CHAIR GOODMANN': ' Thank you.'",
        "'COMMISSIONER CASH': ' Madam Chair? I think you skipped over me.'",
        "'CHAIR GOODMANN': ' Oh, my goodness. Commissioner Cash, I apologize. Yes.'",
        "'COMMISSIONER CASH': ' No, that's fine.'",
        "'CHAIR GOODMANN': ' Please.'",
        "'COMMISSIONER CASH': 'I just had a couple of comments. Something that caught my ear during the presentation was talking about some of those lots, I believe it was along Army Navy Drive. And that in the next Master Plan, maybe we'll look at other uses for those, but additional planning would be necessary to see what could be developed there. And that just caught my ear because I see these parking lots, and I can guarantee you there's plenty that could probably be put there. And, just to bring that idea around to the history of the site that we were just talking about. I think that if there's any way to try and get those lots into the hands of Arlington County or a developer to do something like affordable housing, that not only could bring back the idea of folks that were displaced in the past, but those kind of'",
        "'COMMISSIONER CASH': 'partnership that you can do to, to really bring it to life, not just put a marker down, I think that would be an excellent opportunity. And, I did want to mention something about the green space. So, it is a tough site. There is some green space. But the observation that I would make being over there before, it's not a lot of quality green space. There's a lot of grass, like lawn grass, which is not very sustainable whatsoever. And if you can't put trees in for security reasons, which I kind of cringed at but I know this is the Department of Defense so I'll accept it, maybe you can put some higher quality green space. Like, you can put some native plants, something like that there that requires less lawn mowing, which means less carbon output. So, any little opportunities like that where you can swap'",
        "'COMMISSIONER CASH': 'out maybe some low quality green space for something that is easier to maintain and better for the environment, better pollinators, I think that every opportunity like that should be taken. So, those are the comments that I had for this very tough site.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cash. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes, I want to thank the staff for their presentation and the work on this project, and also just want to associate myself with the comments of Vice Chair Hewlett, and Commissioner Green.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Cozart. And I just want to say again, thank you, oh, I'm sorry, Commissioner Hewlett? (No audible response.)'",
        "'CHAIR GOODMANN': ' Oh, you're on mute.'",
        "'VICE CHAIR HEWLETT': ' So, if you, I know you want to make your own remarks but I'm wondering if when you finish your remarks, I don't know if Robert's Rules, so maybe Ms. Schuyler can answer this. Whether you can amend your own motion, whether I can amend my own motion, which was to adopt the comments, approve the comments that were set forth. But I'd like to, Commissioner Green, Commissioner McMahon, and Commissioner Cash made some really good options for us to consider, that were not included in the initial comments. And so, I'm willing to accept those as additional comments if other people are, and if it's appropriate.'",
        "'CHAIR GOODMANN': ' I'll defer to Ms. Schuyler, but perhaps there could be a friendly amendment to add those items to the motion. Ms. Schuyler?'",
        "'MS. SCHUYLER': ' I was going to say I think a friendly amendment might be in order.'",
        "'CHAIR GOODMANN': ' Okay. So, would someone like to craft that friendly amendment to yourself, Ms. Hewlett, or would you like some recall of what those particular items were that you wanted to be included? Was it the housing, it's the interpretation, it's expand the green space, and.'",
        "'VICE CHAIR HEWLETT': ' It's all of those things. And to go, yes, to go beyond and to go beyond the mere documentation, it's all of those things. And, it's additional as our inimitable Commissioner Wright indicated that it's hard to add more green to this space. But you know, Commissioner Cash made some interesting points about cutting down on the carbon footprint, less grass mowing with some plants and what not, too. But also the housing. The opportunities that exist to redress some of the descendants of those folks who were displaced there, then. And the more interpretive --interactive or interpretive signage, at least. Something you know, to enhance, to enhance the knowledge. And I think Ms. Koster wanted to add to that, I would guess.'",
        "'MS. KOSTER': ' Yes. If you wanted to amend the language, I would offer this to help things along. So more in the document, consider the following opportunities with a colon, to go beyond historic documentation to include interpretive signage, to consider sustainable enhanced green spaces, and to consider affordable housing opportunities and partnerships, if you wanted. Is that in keeping with what you had in mind, and I --(Simultaneous speaking.)'",
        "'VICE CHAIR HEWLETT': ' Commissioner Green had to add, wants to add to that, I think.'",
        "'COMMISSIONER GREEN': ' Yes, ma'am, and I just wanted to add just very briefly to that, that whatever these, whatever these strategies are that they're made in consultation with descendants of that community so it's not, it's asking, not telling.'",
        "'VICE CHAIR HEWLETT': ' Not paternalistic. Thank you.'",
        "'CHAIR GOODMANN': ' Okay, so with that addition, Ms. Koster, do we want to review the motion?'",
        "'MS. KOSTER': ' Oh, no.'",
        "'CHAIR GOODMANN': ' Okay, all right, okay, I think we'll, we probably can run the tape back, but I think with the addition of that language from Vice Chair Hewlett, and Commissioner Green and other contributors, Commissioner Wright, Commissioner Cash, I think you summarized it well. Does anyone have any comment and then Elizabeth, would you accept that amendment as a friendly amendment to your motion?'",
        "'VICE CHAIR HEWLETT': ' Absolutely.'",
        "'MS. KOSTER': ' Okay.'",
        "'CHAIR GOODMANN': 'Okay. So it has been moved to second it, the amended motion. And I can, I think I would like to make my comments before we vote on it. And, I just want to say that I endorse everything that was just included in that motion. I do want to also acknowledge that the work that's gone on to address this parking ratio. I've spent time over in that building, and I walked through the parking lots that probably get up to 120 degrees in the sun because there is no shade. It's a formidable building but the parking facilities are even more daunting, if you will. I would like to see some, see as much work done as possible to try to use permeable surfaces, if we can, because it's really, it's a lot of parking. And I know we need it, but there is transit, and there are'",
        "'CHAIR GOODMANN': 'opportunities, and I love the opportunity of affordable housing, or housing to be in that space. We have a housing crisis not just in the District, but across the country. We're all struggling with it across the country right now. And so, I think that's a beautiful option to consider for that, some of that space, and I also want to emphasize and support the comment that we need to create better pedestrian connection to the 9/11 Center. And just those are my comments, but again I want to thank those who presented. I want to thank our gentleman who made our, the testimony and shared his good thoughts with us on the history of the place, and the space. And if I can ask one question, I know I'm out of order, but as Chair I'll take that privilege. Why is it called the Pentagon Reservation?'",
        "'COMMISSIONER MCMAHON': ' Yes, I guess unless someone on staff who is listening can jump in, I'll say because that's what the legislation calls it.'",
        "'CHAIR GOODMANN': ' Okay.'",
        "'COMMISSIONER MCMAHON': ' Reservation's an old military term for property we have I'm sure around, so it's not unusual but it's now I guess, memorialized in law.'",
        "'CHAIR GOODMANN': ' Understood, thank you for that. And so, if there is no further input or questions for the motion, on the motion, then I will ask if Ms. Koster, could you please call the roll?'",
        "'MS. KOSTER': ' Certainly. And, I will note that this is an amended motion with the amendment somewhat as follows. To consider the following opportunities colon, to go beyond historic documentation to include consultation with descendants and interpretive signage. To provide enhanced sustainable green spaces, and affordable housing development. Is that, oh, right, so.'",
        "'VICE CHAIR HEWLETT': ' Or, I think Commissioner Green said, interpretive signage or other types of memorialization. Permanent memorials. Is that what you said, Commissioner Green? Okay, thank you.'",
        "'MS. KOSTER': ' Okay.'",
        "'COMMISSIONER MCMAHON': ' Yes, I'm concerned before we go with the language concerning affordable housing.'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'COMMISSIONER MCMAHON': ' That is not, it's not part of the Department's mission, per se, but you know, certainly as we take a look at the, the future needs for those three parking lots on Army Navy Drive, you know, it may involve some divestment. And that's not again, the Department's mission to provide affordable housing. That's up to the community and Arlington County, and other local municipalities. But certainly, we could take a look at those options for that property afterwards and that's going to be in consultation with you know, other government entities and other organizations to then develop and move out. That's not something the Department would do as part of their Master Plan.'",
        "'CHAIR GOODMANN': ' Thanks for that clarification. I appreciated Commissioner Green's comment. I believe it was his that perhaps working in partnership if there is a divestiture of land, that there would be an opportunity for that. I think the consideration is what is suggested clearly. It's not, you know, thank you for that, Commissioner McMahon. It is not the mission of you know, the Department of Defense to build housing in that particular space. But I think to leave that door cracked open for other possibilities on the land if it should be possible, it was, I think it was intended to be that.'",
        "'COMMISSIONER CASH': ' And Chair Goodman, if I could just, just so we have it on the record and back on the video. This stemmed from the comment that we might look at in the future at other planning studies, for some of these spaces. And I think that in the presentation, the, commercial was mentioned. So in the same vein that we would be looking at commercial, I think just having affordable housing on the record in just future planning efforts. Not saying that DoD would do it. That was the intent of even bringing that up.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cash, for that clarification. Okay, hearing no further comments or questions, then Ms. Koster, could you please call the roll?'",
        "'MS. KOSTER': ' Certainly. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodman?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Yes.'",
        "'MS. KOSTER': ' And, Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' Abstain.'",
        "'CHAIR GOODMANN': ' Very good. Thank you, Ms. Koster, the motion has carried. And I just want to say that this concludes -- I see Vice Chair Hewlett would like to be recognized.'",
        "'VICE CHAIR HEWLETT': ' Madam Chair, I really have to, I echo and even augment the comments made by Commissioner Argo. As I sit here, you know, month after month and consider the many different plans and projects that come before us, I have to think, I am reminded constantly what an honor it is to serve on this board. And to hear the array of plans that we hear, and review. And we really immerse ourselves into it and it's that part in and of itself is an honor. But it's also an honor to serve with such a professional team, and amazing engaged colleagues. And I just, you know, it's just awesome and I just had to comment with that comment, make that comment before I sign off. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much, Vice Chair Hewlett. And, I'll second that. So, it is an honor. And so, the motion has carried and I know this meeting is a rather brief meeting. We're going to have to steel ourselves for a longer meeting in November, is what I've been advised by staff. But appreciate all the input today, and the thoughtful nature of our conversations. So next month's meeting, our regular Commission meeting, will be held on Thursday, November 2, 2023. And hearing no further business, this meeting stands adjourned. Thank you all. (Chorus of thank yous.)'"
    ]
}