{
    "1. REPORT OF THE EXECUTIVE DIRECTOR": [
        "'MR. ACOSTA': 'Thank you, Vice Chair, and first, congratulations to you, Vice Chair Dixon and Commissioners Argo and Cozart for your reappointment to the Commission. Just one more testimonial on behalf of the NCPC Staff, I would like to take this opportunity to thank Chair White for her many contributions during her 11-year tenure with the Commission. We greatly appreciate the guidance, wisdom, and support you provided to the Staff. Over the years, you have generously shared your ` 32 time and expertise with our entire team. Your insightful observations and strong leadership have benefitted many projects and initiatives coming before this Commission. And you lead this Commission through meaningful deliberations about some of our most important planning issues with tremendous grace and dignity. I know I speak for my NCPC colleagues to say it has been a privilege working with you. We wish you all the best and much success in'",
        "'MR. ACOSTA': 'your future endeavors. Not only do we also bid farewell to urban planner, Carlton Hart. Carlton has been with NCPC for 16 years. He's presented to the Commission many high-profile projects, including the Kennedy Center expansion, the Department of Homeland Security Headquarters, and the Pentagon and Arlington Cemetery. We congratulate Carlton in his new role as senior urban planner at the U.S. ` 33 Commission of Fine Arts. Very well deserved. With that, I'd like to conclude my presentation and I'm happy to answer any questions you might have.'",
        "'MS. KOSTER': ' Chair Dixon, I believe you're on mute.'",
        "'VICE CHAIR DIXON': ' Thank you, Mr. Acosta, for this. Do any Commissioners have any comments for Mr. Acosta? If not, we'll move to our legislative update with Ms. Schuyler.'"
    ],
    "2. LEGISLATIVE UPDATE": [
        "'MS. SCHUYLER': 'Thank you, Mr. Vice Chair, and to you and the Commissioner Members, happy new year. And to former Chair White, we spoke yesterday and I think you know how I feel and I think there have been some beautiful things said today which I couldn't possibly compete with. So, we'll leave it at that. Mr. Chairman, to the matter at hand, I do have a legislative report. There ` 34 were four bills incorporated into the Consolidated Appropriations Act of 2023 relative to commemorative works and they all became law on December 29, 2022. A brief summary of each bill, first, the bill authorizing the establishment of a commemorative work in the District and its environs to commemorate the commitment and service of women who worked on the home front in World War II. The law requires that the establishment of the commemorative work shall be in conformance with the'",
        "'MS. SCHUYLER': 'Commemorative Works Act. Second, a bill authorizing the extension of the authority for establishing a National Liberty Memorial commemorative work. The law extends the authority through September 3, 2027. The National Liberty Memorial, for those of you who are new, is a proposed national memorial to honor the more than 5000 ` 35 enslaved and free persons of African descent who served as soldiers or sailors, or provided civilian assistance during the American Revolutionary War. Third, a bill authorizing the establishment of a commemorative work on federal land in the District and its environs to commemorate the heroic deeds and sacrifices or service animals and their handlers. The law requires that this work shall be in conformance with the Commemorative Works Act. Fourth and last, a bill authorizing the establishment of a commemorative work on federal land in the District and its environs to honor the extraordinary contributions of Jean'",
        "'MS. SCHUYLER': 'Monnet. The commemoration to him is in respect to his restoring peace between European nations and establishing the European Union. Again, the law requires that this commemorative work shall be in conformance with the ` 36 Commemorative Works Act. This completes my report. I'm happy to answer any questions.'",
        "'VICE CHAIR DIXON': ' Thank you very much, Ms. Schuyler. Any comments from the Commissioners or questions?'",
        "'COMMISSIONER MAY': ' Mr. Chairman, I wanted to add a couple things to Ms. Schuyler's that also passed in the omnibus bill. I'm not sure exactly what their origin was, I don't have a full recap here. But there was an authorization for Area 1, for the Fallen Journalists Memorial. That was approved by Congress as well and then two other new memorials authorized the enslaved individuals who endured middle passage and the Thomas Paine memorial. So, those are ones that we've picked up from the bill in our recap. So, it was a big year for us.'",
        "'MS. SCHUYLER': ' It was, a total of seven. Thank you, Commissioner, for adding `  37 that information, which I guess I missed. It's a large bill.'",
        "'COMMISSIONER MAY': ' It's a large bill, yes. I should have gotten this to you in advance.'",
        "'MS. SCHUYLER': ' That's okay, thank you very much for contributing.'",
        "'COMMISSIONER MAY': ' Sure.'",
        "'VICE CHAIR DIXON': ' Thank you both for that. Any additional comments from the Commissioners? Hearing none, we'll move to Agenda Item 6, the consent calendar, and I'd like to ask Madam Secretary to go through those items and see if there's any additional comments from Staff that are needed.'"
    ],
    "3. CONSENT CALENDAR ITEMS": [
        "'MS. KOSTER': ' The first item on the consent calendar is for final approval of the Joint Base Anacostia-Bolling Housing and Community Support District Plan in Washington D.C. This project was submitted by the `  38 Department of the Air Force. The second item is approval of comments to the Council of the District of Columbia regarding the partial closing of 1st, Water and V Streets Southwest, as requested by the District of Columbia Office of the Surveyor.'",
        "'VICE CHAIR DIXON': ' Having heard those, is there a motion to accept the consent calendar?'",
        "'COMMISSIONER MAY': ' So moved.'",
        "'COMMISSIONER HEWLETT': ' Second.'",
        "'VICE CHAIR DIXON': ' It's been moved so now, Secretary, call the roll please.'",
        "'MS. KOSTER': ' What I pulled from that was the motion was made by Commissioner May and seconded enthusiastically by Commissioner Hewlett, is that correct? Thank you. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May? `  39'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Dixon?'",
        "'VICE CHAIR DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' Thank you, the motion has carried.'",
        "'VICE CHAIR DIXON': ' Very well, thank you all very much. We'll move now to Agenda Item number 7A, for the approval of comments on concept planning for Tidal Basin and West Potomac Park Seawall Rehabilitation. `  40 I'll ask Lee Webb to make the presentation.'"
    ],
    "4. APPROVAL OF COMMENTS ON CONCEPT PLANNING FOR TIDAL BASIN AND WEST POTOMAC PARK SEAWALL REHABILITATION ": [
        "'MR. WEBB': ' Great, Ms. Koster, can you confirm that you can see my presentation and hear my voice?'",
        "'MS. KOSTER': ' Yes, indeed. Thank you, Mr. Webb.'",
        "'MR. WEBB': 'Thank you. Good afternoon, Members of the Commission. The National Park Service has submitted concept plans for the repair and rehabilitation of approximately 6800 linear feet of the failing sea wall along portions of the tidal basin in West Potomac Park in Washington D.C. The project goals include returning the sea walls to their historic functional high, improve visitor accessibility and experience over the next decade, and plan for ` 41 sea level rise in the future. The Park Service only has funding for rehabilitation and repair at this time and is therefore taking a phased approach for stabilizing sections of the wall and restoring the historic functional high allowing more time to consider additional measures in the future. NPS will be working with the U.S. Army Corps of Engineers and other stakeholders on future planning efforts to consider broader climate change impacts and solutions for West and East Potomac'",
        "'MR. WEBB': 'Parks, as well as a comprehensive plan for the Tidal Basin. The sea wall area along the Potomac River and Tidal Basin were created as part of a land reclamation project beginning in the mid 19th century. West Potomac Park is a U.S. national park in Washington D.C. adjacent to the National Mall. It includes the park land that extends south of the Lincoln Memorial reflecting pool and from the Lincoln Memorial ` 42 to the grounds of the Washington Monument. The park is the site of many national landmarks including the Korean War Veterans Memorial, the Thomas Jefferson Memorial, the Franklin Delano Roosevelt Memorial, and the Martin Luther King Junior Memorial. West Potomac Park as well as East Potomac Park in the area encompassing the Tidal Basin were listed in the National Register of Historic Places in 1973. The sea walls are considered contributing features to the National Register'",
        "'MR. WEBB': 'Historic Districts. As this is a concept review, the focus of today's presentation is to receive Commission comments and feedback prior to the preparation of a more detailed preliminary submission by the Applicant. In this case, the focus of the review is understanding the appropriateness of the project for the site and context, ` 43 understanding any particular unique or complex issues that need to be addressed, and identifying any stakeholders that may need to be further involved. Now, I will share some images of the existing conditions resulting from the issues with the sea walls as well as provide an orientation to the project area. As these existing photographs show, over the years the sea walls have significantly settled, leading to water overtopping the sea walls as well as poor drainage. This has led to reduced public access and damage to the cultural landscape and park infrastructure resulting in'",
        "'MR. WEBB': 'negative impacts to visitor use and experience. This slide shows the extent of the current project area which is outlined in yellow. This project will address immediate issues of the failing sea wall in locations demonstrating the highest degree of settlement and erosion. ` 44 The Applicant has indicated the project will not address longer-term rises in sea level at this time but will lay the structural foundation for additional wall increases in the future as needed. As I mentioned previously, NPS will be working on future comprehensive planning efforts to consider broader climate change impacts and solutions for the Tidal Basin and West and East Potomac Parks. Thus, Staff finds that future measures to address rising sea levels could have more significant impacts on the landscape and we'll need to consider historic preservation, visitor experience, sustainability, and program needs. The project area is divided into four distinct sections and'",
        "'MR. WEBB': 'I'll begin with Tidal Basin East that extends from the Inlet Bridge to the Jefferson Memorial steps. You can see this area circled in yellow on the left image on the slide. Its ` 45 current configuration dates to the early 1940s as a portion of the Tidal Basin itself was adjusted to make room for the construction of the Jefferson Memorial. The sea wall features a concrete wall with historic stones along its outward face. The walls closest to the Inlet Bridge date back to approximately 1909 when the Inlet Bridge was built. Land settlement in this area has caused daily flooding with water unable to naturally drain, becoming trapped on the land, leading to vegetation die-off and damage to tree health. The next area is Tidal Basin West which extends from the Inlet Bridge to the pathway to the Franklin Delano Roosevelt Memorial next to the Japanese pagoda.'",
        "'MR. WEBB': 'This section of wall was first built in the late 1800s, the Tidal Basin West wall was reconstructed between 1907 and 1909 when the Inlet Bridge was constructed by the Corps ` 46 of Engineers. In 1941, an eight-inch-thick concrete coping was added to the top to heighten the wall to account for settlement. Today, the wall shows evidence of settlement behind the walkway resulting in water ponding and vegetation damage alongside the inside edge of the walkway. The next area is West Potomac Park South, which extends from the Inlet Bridge to approximately the intersection of West Basin Drive and Ohio Drive. The West Potomac Park South sea wall is the oldest in the project area. The foundation was completed in 1884 and the top of the sea wall completed in 1891. However, riprap and other fill like concrete and asphalt have been periodically added to stabilize the wall'",
        "'MR. WEBB': 'or shoreline through the 1990s. The last project area is West Potomac Park North, which extends from the ` 47 intersection of West Basin Drive and Ohio Drive to Memorial Bridge. This is the newest section of the sea wall, which dates to 1965. Pepco rebuilt this section of the wall with a concrete cap, excavation of the soil behind the wall in this area indicates it is a cast-in-place concrete wall with a stone veneer. It is unknown if any of the original sea wall stones remain. The concept plan's approach will allow for additional height to be added the sea walls in the future as sea level rise increases. This project would increase the percentage of total park area that is open and safely accessible for public visitation by reducing instances of flooding, overtopping, and pooling of water. In addition, a significant amount of deferred maintenance backlog will'",
        "'MR. WEBB': 'be addressed by this project. After careful consideration to ` 48 address the immediate issues of the stabilization of the sea walls in the project area, NPS determined the design should incorporate a pile-supported foundation extending to the bedrock to avoid future settlement. This solution also allows the wall heights to be raised in the future if needed. However, additional comprehensive study will be necessary to consider whether this or other approaches will appropriately address future sea level rise. As this is a rehabilitation project, the goal is to re-establish the sea wall's historic functional height and reconstruct it along the historic alignment. When first constructed and then adhered to in subsequent modifications and extensions, the sea wall was built to an elevation of six feet above mean-high water. Settlement combined with rising sea levels have resulted in the wall residing much ` 49 closer to the wall surface. And'",
        "'MR. WEBB': 'when we say historic functional height, we're talking about the relationship between the water level, the height of the sea wall, and the landscaping adjacent to the wall on the land's side. To correct this, the selected top of wall elevation is based on a height of six feet above current mean-high water. The proposed height will help keep adjacent areas from flooding during normal tidal events as well as minor floor stage events. This results in an elevation increase of 4.75 feet within the Tidal Basin. The top of the wall elevation along the West Potomac Park sea wall would be increased by 5.5 feet. This is to account for the additional impact of overtopping of larger waves which do not impact the walls inside of the Tidal Basin. The proposed design includes foundations that bear on bedrock, relieving the ` 50 weight of the structure on the soils'",
        "'MR. WEBB': 'that has caused previous settlement. This type of foundation allows future capacity for the walls to be raised vertically in response to future sea level rise and increasing storm surge elevations. Two of the main requirements of this project are to prevent future settlement of the sea wall and maintain the historic character. The proposed pile-supported foundation details reflect what NPS believes to provide the ease of construction and reduced cost while preventing future settlement. As such, Staff supports the Applicant's approach for the sea wall project by removing the existing stone masonry sea wall and reconstructing the wall along the historic alignment and to the original historic functional height. To the extent possible, the stones of the historic walls will be salvaged and reused in the rehabilitation. ` 51 The proposed face of the wall maximizes the reuse of historic stone, maintains the historic ashlar stone look, and has'",
        "'MR. WEBB': 'the ability to be built upon to combat future projected higher water levels if needed. The Applicant has evaluated different options for the appearance of the reconstructed sea walls and the look of the stone in consultation with consulting parties and the review agency. The preferred approach includes maximizing reuse of historic stones, utilizes even coursing and stone size with rough and smooth faces, and a uniform stone color with medium gaps. Historic stone will be a minimum of nine inches in depth, allowing extant stone to be cut to maximize their use. This approach was deemed appropriate because it replicates the historic appearance in arrangement of the oldest components of the sea walls while allowing for the possible reuse ` 52 of the greatest number of existing stones. In regard to other components of the landscape adjacent to the sea walls, walkways will be repaired or replaced to re-establish'",
        "'MR. WEBB': 'the character of the park and the visitors' experience. Pathways will be widened to 12 feet to accommodate park visitors. The sea wall rehabilitation project will also correct deficiencies in the upland areas behind the walls. Grading will be adjusted to accommodate the elevated sea wall height and to re-establish sheet flow run-off. This will eliminate any existing areas of settlement. The additional elevation and re- grading will eliminate the daily inundation of the tides, reduce the impact of and provide positive drainage of more extreme storms, allowing for the cultural landscape of the park to be restored. As such, Staff supports the ` 53 Applicant's intent to repair or replace the walkways to re-establish the character of the park and improve the visitors' experience and safety. With respect to trees and vegetation, approximately 300 existing trees will be removed and will be replaced with approximately 381 new trees following'",
        "'MR. WEBB': 'NCPC's tree replacement policy. NPS will replace all removed trees, including all the Japanese cherry trees. Their location and species will be informed by the cultural landscape report for the Tidal Basin, as well as the work of a historic landscape architect and NPS' arborist. Where possible, storm water management will be maintained by a natural gravity run-off over a two percent slope on vegetated terrain. Clogged storm water drains within Tidal Basin East will be cleaned and made operational within this scope of work. Therefore, Staff supports the ` 54 Applicant's intent to plant more resilient vegetation in identified areas informed by the tidal basin cultural landscape report. Staff does request that the Applicant does provide further information about the proposed tree removal and replacement, including estimated quantities and proposed species as part of the next review. To conclude, Staff commends NPS for engaging partner federal agencies and the'",
        "'MR. WEBB': 'Section 106 consulting parties through the development of the design for the sea wall's rehabilitation project. Staff recommends the Commission support the NPS' project goals to rehabilitate the Tidal Basin and West Potomac Park sea walls to return the sea walls to their historic function and height, improve visitor accessibility and experience, and plan for future sea level rise. I note that the Section 106 process is continuing with an expected memorandum of ` 55 agreement to be executed to address agreed upon mitigation measures commensurate with adverse effects caused by the project. Also, NPS is preparing an environmental assessment for NEPA which will be released prior to submission for preliminary review in 2023. We look forward to working with NPS, the Corps of Engineers, and other stakeholders as NPS commences future planning efforts to consider broader climate change impacts and solutions for West and East Potomac Parks, as well'",
        "'MR. WEBB': 'as their work on a comprehensive plan for the Tidal Basin. This concludes my presentation. I've covered the recommendations in presentation I will not repeat them here. At this time, I would like As my to introduce Jeff Reinbold, the Superintendent of the National Mall and Memorial Parks, who would like to say a few words. Also, Tammy Stidham with the ` 56 National Park Service and Margaret Boshek, the project engineer, are here to help answer any questions the Commission may have. Thank you.'",
        "'MR. REINBOLD': 'Thanks, Lee. Thank you for the opportunity to be with you today, a special thank you to the Commission Staff and to Mr. Webb for the presentation. As a quick aside from NPS, I would be remiss if I didn't acknowledge Marcel and the NCPC Staff, and the many projects we work on daily, especially things like Beyond Granite and Pennsylvania Avenue, that really have the potential to be transformative for the city and our parks. As you can tell, this is an ambitious project. As you saw in the presentation or as you've witnessed firsthand, the Tidal Basin near West Potomac Park, the work is desperately needed. Nationally, the National Park Service made rehabilitating the sea walls one of its top priorities for federal funding ` 57 through the Great American Outdoors Act, which is intended to address deferred maintenance, a highly competitive funding process. And we were fortunate'",
        "'MR. REINBOLD': 'to receive upwards of $100 million in funding as one of the largest National Park Service projects across the nation. We need to move this project and this process efficiently to capitalize on this once in a lifetime funding opportunity. But we couldn't do that without the work of a variety of agency partners, and while we're still at the concept stage, many of them have already been invaluable. And I do want to just acknowledge them, the D.C. Department of Environment and Energy, U.S. Army Corps of Engineers, National Oceanic and Atmospheric Administration, D.C. Water, Virginia Passenger Rail Authority who is working on the Long Bridge project, the Advisory Council on Historic Preservation, D.C. State Historic Preservation Office, the ` 58 Commission of Fine Arts, the NCPC Staff, and also the National Marine Fishery Service and the Fish and Wildlife Service. And as Lee mentioned, we also have a'",
        "'MR. REINBOLD': 'robust group of consulting parties and stakeholders in the 106 process as well as great and varied public interest in this. I will also mention that we're eager through this project to demonstrate the impact and public benefit of this work so that it may be a catalyst for future federal investment to address the miles of sea walls that the NPS maintains along both Potomac and Anacostia Rivers. That future work is exciting as we may be able to explore a variety of treatments that could be more effective and more appropriate in those locations. So, looking forward, again, we'll release the environmental assessment and go to CFA in February or March, come back to you for preliminary review. ` 59 And while the project today is about rehabilitating a small area of the Tidal Basin, we are eager to launch the master plan that we mentioned. This builds'",
        "'MR. REINBOLD': 'on some of the recent initiatives in the Ideas Lab by the Trust for the National Mall and National Trust for Historic Preservation to take a more comprehensive look at the Tidal Basin. So, we appreciate your consideration today on this really important project for the park. Thank you.'",
        "'VICE CHAIR DIXON': ' At this time, we'd like to thank Mr. Webb and Superintendent Reinbold for his and their work on this project. Do the Commissioners have any questions at this time?'",
        "'COMMISSIONER WRIGHT': ' I do. I think you just answered it, Jeff, but my question was going to be about I'm assuming that money wasn't the only reason that you're not going for more comprehensive solutions. `  60 But can you say a little bit more about that? And you also answered my other question about the Ideas Lab and how it played into this project. But can you say a little bit more about the process, how you're going to use this not as a prototype but what you're going to do with what you learned through the process of implementing this project?'",
        "'MR. REINBOLD': 'Sure, thanks for that question, and I may ask Tammy to weigh in on some of the technical sides. I will say more strategically the deferred maintenance backlog in the National Park Service is significant and the fight for this funding was very competitive. And so we felt that we could have the biggest impact in the Tidal Basin on West Potomac Park because those areas, people did not have use for them for a long period of time. And the resource damage from them was significant as they flooded twice daily. ` 61 Our hope is, though, we're looking at several hundred million dollars to just do the rest of East Potomac Park, not even a mention to the other sea walls that the Park Service maintains. So, I'm hoping that through this we'll demonstrate the public benefit, the return on that investment, as well as learn a lot'",
        "'MR. REINBOLD': 'technically that will help inform the steps that we take south of here, and actually make those investments more efficient in how we tackle places like East Potomac Park. I mentioned it quickly but outside of the Tidal Basin and West Potomac Park, we do also look forward to the opportunity to explore other treatments beyond just rebuilding a sea wall if there are national shorelines along the Anacostia or the Potomac that would make more sense. We're eager to explore those as well. Tammy and Margaret, if you want to add anything technically on what we'll learn from ` 62 this that we can use to inform the future sections.'",
        "'MS. STIDHAM': ' I think we learned a lot about the soils of this area and how best to engineer a new foundation for the wall that will give it a longer lifespan.'",
        "'VICE CHAIR DIXON': ' Please identify yourself.'",
        "'MS. STIDHAM': ' I'm sorry, I'm Tammy Stidham, I'm the Deputy Associate Director for Lands and Planning at the National Park Service.'",
        "'VICE CHAIR DIXON': ' Thank you.'",
        "'MS. STIDHAM': ' These are uphill as this was created park land and the walls were meant to hold it in place. So, the engineering that we learned will place it on bedrock instead of on rubble and I think in places where we look at East Potomac Park and even Anacostia Park where it has a similar construction. As we look towards those future `  63 projects, I think the engineering that we developed here can be applied in those areas, in areas where putting the sea wall back makes the most sense.'",
        "'COMMISSIONER WRIGHT': ' I have a follow-up question.'",
        "'VICE CHAIR DIXON': ' Go ahead, please.'",
        "'COMMISSIONER WRIGHT': ' I think you're going to see where I'm going to with this. Are there plans while construction is underway to have some interpretive, educational, what's going on, explanatory stuff so that people can learn about what's happening. The reason I'm asking, of course, is because as feds, we're going to have to invest billions of dollars and the public is going to have to get behind this. So, I'm hoping the answer to this question is yes so that people can be educated and informed and understand what's happening and the implications, including what you're learning as you go that's applicable to future `  64 projects.'",
        "'MR. REINBOLD': ' I'm smiling because somewhere our Staff is shuddering because that is really important to me when we undertake these major projects. There's a great opportunity not only to meet a public interest but to educate and build support for projects like this to help people understand the benefits and the needs. So, most definitely.'",
        "'COMMISSIONER WRIGHT': ' Okay, well, I can testify that you did not send me a check to ask that question. In fact, I can't remember if we've met in person so I'll vouch for you. I think it's really important to take every opportunity we can because these bills are going to come new and people are going to be upset. So, the more they know the better. Thank you.'",
        "'VICE CHAIR DIXON': ' Very good, I thank everyone for the presentation and comments as always, Commissioner Wright. `  65'",
        "'COMMISSIONER GREEN': ' Can I ask a question?'",
        "'VICE CHAIR DIXON': ' Yes.'",
        "'COMMISSIONER GREEN': ' Thank you very much. I had a question about the wall height. If you can speak to the process for determining that wall height, and also if you could speak to the engineering that will allow that wall height to be increased in the future and what that impact might look like?'",
        "'MS. BOSHEK': 'I'll jump in here. I am Margaret Boshek, I am a professional engineer with Moffatt & Nichol on the JV team. So, we were asked to re-establish a historic functional height and this was the relationship between the top of the wall to the water levels. Now, we know that sea level has occurred since their conception in the late 1800s to now. So, we looked at today's mean low water level and added six feet on top of it, and we came to an elevation of +4.75. We then ` 66 provided a risk analysis to understand how often that wall height may be overtopped and what type of long-term effects that would have. From that, we established that 4.75 was appropriate for inside the Tidal Basin as it did not have effects on the icons themselves and the existing infrastructure. We were able to maintain the positive drainage'",
        "'MS. BOSHEK': 'down to the water using those elevations and grading them back. And on the Potomac River, as Jeff mentioned, because of the added high currents, ice. and wave overtopping, we were able to go a bit higher to the 5.75 to prevent the erosion of the back side of the wall, which is what led to its demise initially. So, that's how we came to the 4.75 and then we validated it through that risk analysis.'",
        "'COMMISSIONER GREEN': ' And could you explain the intent to build in sufficient engineering to allow the wall height to be `  67 increased in the future?'",
        "'MS. BOSHEK': 'Yes, sorry, I missed that part. We are looking at alluvial soils, they're very soft soils, and originally the wall was built on the foundation of riprap. That has sunken into those soft soils over time and we found historic geotechnical analyses that suggested that if we place anything any greater in height, the additional weight would initiate additional settlement. So, instead of chasing our tails, we looked at options that sent piles all the way down to bedrock, which is variable throughout the site, and then a relieving platform on top. Lee showed a cross-section of that in the presentation. That is now holding the wall. That's taking the weight of the wall and so the weight is no longer on the soils but it is on that relieving platform. And it is built with the ability to add additional height on top without causing ` 68 any type'",
        "'MS. BOSHEK': 'of settlement as it's founded directly on that bedrock.'",
        "'COMMISSIONER GREEN': ' So, the heights would go directly on top of the relieving slab and then continue on?'",
        "'MS. BOSHEK': ' Correct. The additional height would be added on.'",
        "'COMMISSIONER GREEN': ' Thank you so much.'",
        "'COMMISSIONER CASH': ' I had a quick question. I know in the report and I think in the presentation it was mentioned that there's going to be these future studies about future sea level rise. What's the status of those, what's the timeframe? Have those studies been funded? Is it going to be going on concurrently with construction? So, I guess a little bit more detail on how realistic and how real those future studies are when we're looking at the spectrum.'",
        "'MR. REINBOLD': ' Tammy or Peter might `  69 be best to address those.'",
        "'COMMISSIONER MAY': ' Some of the information about predictions of sea level rise is already available and that was factored into the risk analysis in trying to find what heights we would build to right now and what our tolerance is for occasional flooding, what the frequency of that is. Some of that information is already out there. I think the future studies that we're really looking forward to is how do we take what we learned here and address the other segments of the wall, in particular the Tidal Basin. The rest of the Tidal Basin, there is a study that we are actually getting underway later this spring. But that's more of a planning study, it's not leading immediately to any action the way this work is. Can you add to that?'",
        "'MS. STIDHAM': ' No, all that was correct. `  70'",
        "'VICE CHAIR DIXON': ' I also want to indicate that we have two persons to testify who signed up to speak. I want to go to them at this time, if we can. First we have Mary Dolan, Ms. Dolan are you with us?'",
        "'MS. DOLAN': 'I'm right here. Hi, everyone, good afternoon, I am Mary Dolan, I am Co-Founder and Executive Director of the FDR Memorial Legacy Committee. We are a citizen-led organization supporting the FDR memorial with the mission to promote education about the memorial to improve inclusion and accessibility so all visitors can experience the memorial and to preserve the memorial for future generations. Our organization is born out of the successful disability-led campaign in the 1990s for disability representation at the memorial. We are a 501(c)3 organization led by a board of seven and an Advisory Board that includes three grandchildren of FDR and Eleanor Roosevelt, and former U.S. Senator Tom Harkin. ` 71 It's a pleasure to speak to you all today. In the interest of time, I'm not going to go through all of the different events that we've held at the FDR Memorial since 2019, so I'll ask you'",
        "'MS. DOLAN': 'to review my testimony. But we hold multiple wreath layings and events at the memorial and in summer of this year we'll be bringing 72 teachers to the FDR Memorial and the greater Tidal Basin area for professional development. So, we are significant users of that space and use it programmatically. In addition to our ongoing active agenda, our interest and involvement in issues related to the Tidal Basin has been well-known. Accessibility concerns about the mud and water at the FDR Memorial walkway were identified in our accessibility audit of 2021 and we responded to the public comment period for the Tidal Basin Ideas Lab. We participated also in a tour of the Tidal Basin with representatives from the ` 72 National Trust for Historic Preservation and Trust for the National Mall in summer of 2021. Because we take our role as a consulting party seriously, I have hired'",
        "'MS. DOLAN': 'a few consultants to help advise me in our board and Advisory Board to help advocate for the protection and preservation of the memorial. However, our role is larger than just the FDR Memorial. Our role is also to ensure access and inclusion for disabled people at the Tidal Basin now and into the future. We believe that NCPC can assist us in that dual role of protection and access as it relates to this project in the following ways. Number one, support our request for access to reports, calculations, numerical modeling results that assures that this project won't exacerbate flooding at the FDR Memorial. The current modeling does not include the influence of sea level rise, winds, rain water, sub-surface water calculations. ` 73 The environmental assessment is yet to be completed and while we have specifically requested the geotechnical report, we're advised that will be released only when'",
        "'MS. DOLAN': 'the environmental assessment is issued. The comments that the FDR Committee would submit in response to this Section 106 draft memorandum agreement would be better informed and more useful if we could have access to those reports. And as it stands today, we can't do that as we would like to by January 6th, which is the MOA comment deadline. We ask for your support to help release the geotech report and any of the information that's available from the environmental assessment and request as a signatory agency the extension of the January 6th deadline so that reports can be reviewed. Number two, how will storm water management be handled given that this project does not include storm water management? ` 74 We all know that extreme rain events are becoming more voluminous and frequent and when combined with a storm surge, these rain events may produce compound flooding and'",
        "'MS. DOLAN': 'may become more acute with the presence of a wall. This is not included in the present assessments. There is also the risk of flood waters not flushing downstream and remaining in and around the memorial, causing damage. The FDR Committee recommends that NCPC support inclusion of a storm water system assessment as a stipulation in 106 MOA. Point three, the Tidal Basin has two bridges which are the responsibility of the U.S. Army Corps of Engineers. In the NPS cultural landscape report of 2020, it cited that the curtain gates of those bridges were not working. This federal agency partner is not yet seemingly included in Section 106. We understand that if the curtain gates were restored to their functioning capacity, the ` 75 current flooding would be reduced if not mitigated. This of course does not address the deterioration of the sea wall but it stands to reason'",
        "'MS. DOLAN': 'that the rehabilitation concept under review could be different if the curtain gates were restored. The flood gates could also help prevent the expected overtopping of the present sea walls around the memorial.'",
        "'MR. JUTTON': ' That's five minutes.'",
        "'MS. DOLAN': ' Clearly, coordination with the Army Corps would be important. In our MOA we are requesting that there be the CLRs for the FDR Memorial and the MLK, as called for in the Tidal Basin CLR of 2020. We think that's important for the Tidal Basin comprehensive plan and we ask for continued centering of accessibility and inclusion for disabled people in the comprehensive plan and in all stages of planning. `  76 Thank you so much for your time.'",
        "'VICE CHAIR DIXON': ' Thank you very much for your testimony. I think we may want to get some response to your comments from the presenters, is that possible?'",
        "'MS. DOLAN': ' I'm available, if that's a question, Commissioner.'",
        "'COMMISSIONER MAY': ' Mr. Chairman, since the next speaker is part of the same team, it's probably good to get her testimony first so we can handle all the questions at once.'",
        "'VICE CHAIR DIXON': ' Thank you, Peter, I'll do that, thank you for the advice. Let's move then to our next presenter, Angela Schedel, and we have three minutes for you.'",
        "'MS. SCHEDEL': 'Great, thank you, Commissioner Dixon. Good afternoon, Commissioners, and thank you for the opportunity to speak. As previously mentioned, I'm representing the FDR Committee, I've been ` 77 engaged as an engineering consultant and I'm here to amplify Ms. Dolan's remarks. Before becoming a consultant, I was an officer in the U.S. Navy for 23 years teaching engineering at the U.S. Naval Academy and I earned my Ph.D. at the University of Maryland. I'm intimately familiar with the Tidal Basin and I've experienced its flooding firsthand during the 14 years I've lived and served in the greater D.C. area. As a coastal engineer with a sub- specialty in historic preservation, I have several comments related to the Executive Director's recommendation report and also to what Mr. Webb just presented. In the report, you state the project would not increase floodplain elevations and as Ms. Dolan just mentioned, we've had previous'",
        "'MS. SCHEDEL': 'exchanges with the National Park Service and design consultants have used a hydrodynamic model to evaluate the flooding and that we ` 78 understand that it's not accounting for storm water run-off. And we have concerns that the compound flooding that was previously mentioned in the testimony by Ms. Dolan, and was to include rainfall, storm surge, sea level rise, and tidal could possibly be exacerbated in the vicinity of the FDR memorial and our team would just appreciate the opportunity to review the water results that the HDR and Moffatt & Nichol team were based on. We made this request to NPS but it's our understanding that this information is not going to be read by the consulting parties until the informal assessment is reviewed. My next point is once again what Ms. Dolan said about the ground storm water system journaling through this project and considering the flash'",
        "'MS. SCHEDEL': 'flooding events that we all know are very frequent in the D.C. area, we would like to have assurances that the future master plan that is mentioned in the draft memorandum of ` 79 agreements would include a review of storm water systems. My next point is that the EDR and Mr. Webb commended NPS for fully engaging partner and federal agencies and as Ms. Dolan mentioned, we haven't seen any evidence of the Army Corps of Engineers participation, at least in the Section 106 consulting process that we've been a party to. And we do recognize those tidal gates, the Baltimore District did receive some funding in the year 2022 for either repair or replacement of the engineering design of those gates. And it's possible, as previously stated, that those gates, if functioning properly, can alleviate some of the flooding in the Basin but we believe NCPC and the'",
        "'MS. SCHEDEL': 'other consulting parties to be better informed about the potential for risk to the Tidal Basin and flood risk for the Army Corps to be involved. And then my last point is, as ` 80 previously mentioned, we're really concerned about transition between that new sea wall being raised several feet and the current sea wall right to the FDR Memorial boundary. And we would like assurances that handicap accessibility won't be impacted once concessions are made. That concludes my remarks, I do welcome any questions and thank you again for the opportunity to speak.'",
        "'VICE CHAIR DIXON': ' Thank you very much. That concludes our testimony from witnesses. This will bring us back to the Commission. Let me open it up to the Commission in the round robin approach, and that is to call on the Commissioners. We'll start with Peter and then we'll move around to the rest of the Members.'",
        "'COMMISSIONER MAY': 'I appreciate that, I'll also take this opportunity to try to respond to some of the points that were raised in the public testimony. And I would ask my ` 81 colleagues and Ms. Boshek to supplement as needed. First of all, there is a lot of study that has gone into this. I mentioned geotechnical studies, hydrological studies. The hydrological studies were used to determine the assessment of effect, which is part of the Section 106 process. So, that's how we know the extent to which these walls may or may not exacerbate the existing flooding that occurs occasionally and again comes up against FDR and other portions of the Tidal Basin that are not part of this project. The project stops when we get to the edge of the FDR Memorial. As it turns out, that information that we have compiled before indicates there will not be increased'",
        "'COMMISSIONER MAY': 'flood risk as a result of this. When you look at that section of wall that's being raised and the amount of land that will now be protected by it, it is not ` 82 really significant compared to the overall volume of the Tidal Basin of the Potomac River or the Washington Channel, all of these places where water will go. And so the information that we have right now is based on how the water flows and how the water volume is dispersed and flooding events. It's not going to impinge on the FDR Memorial in any appreciable way, and that's reflected in the information that's has already been presented to the consulting parties. The other part of this, as I mentioned, is the geotech report. That has to do with how the foundations are formed and we got a good description of that earlier, and that information'",
        "'COMMISSIONER MAY': 'is still in draft form. Our consultants are required to produce that as part of the EA and appendix to the EA, so all that information will be there for all members of the public to review and consider at that point. ` 83 As far as the involvement of the Army Corps of Engineers, I think we agree with the idea that somehow the tidal gates that have not historically been used for flood control but have been used for the management of sediment in the Washington Channel is a good idea. And we want to explore that and it's going to take some work, I think, to get the Corps of Engineers to come along with that idea because their study, what they've been studied for most recently, they're not thinking that far yet. And we're going to have to bring them along and coax them but that's'",
        "'COMMISSIONER MAY': 'an idea that I think many of us are interested in. For those of you that don't understand the difference between the water control or flood control and sediment control, the Tidal Basin basically is designed and the use of these gates is designed to allow the Tidal Basin to fill up at high tide, and then ` 84 to let the water out at low tide, so that flow of water runs through the Washington Channel and carries with it the sedimentation that can build up through normal river flows. So, it's designed to help the channel, in addition to being a beautiful park feature. It does double duty. The Corps of Engineers we've been consulting with regularly. Historically, the Corps of Engineers doesn't get involved in Section 106 matters like this. They have their own Section 106 process for projects that they'll undertake and there might be some'",
        "'COMMISSIONER MAY': 'circumstances where their interests need to be addressed but it's not normal for them to enter into this kind of a discussion in the 106 context. But we have been consulting regularly, we know they have the front door and the back door on this body of water, we're not going to be working this without their support and assistance. ` 85 So, the other one was storm water management. We certainly appreciate the need to address storm water broadly across the city and its impacts on this. In this circumstance, there really isn't any impact to the storm water system except that as part of the project there are some catch basins that will be cleaned out so that the flow of water from our roads in certain areas of water we'll collect above and beyond this will function better. But there isn't really an impact on the storm'",
        "'COMMISSIONER MAY': 'water system. There is potentially that impact from storm water flowing into a river but that's, again, more part of hydrological studies and it's not really something where we have to assess the capacity of the existing storm water system in and around the Tidal Basin. Because we don't really have a problem with that component of the system overflowing. Where there is a problem with ` 86 water overflowing it's further into the city where there are issues. And we're part of the Silver Jackets team that's trying to address all of that. So, we're mindful of all of these things but this is just a rehab of a sea wall that needs to be stabilized and raised just a bit. Anyway, I've done most of my stuff in explaining. Any of my colleagues want to add to that? I see shaking heads no, so they've taught me well.'",
        "'COMMISSIONER MAY': 'And then other than that, I would just say we're very excited about moving this project along. We are very early in the process as you know. This is comments on the concept and we will be back in two months for preliminary approval and at that point, the environmental assessment will have been released and we will be moving forward from there. And I appreciate the Staff's work on this and the report and the excellent comments ` 87 we have received. So, thank you very much.'",
        "'VICE CHAIR DIXON': ' I'll also mention that we did receive a letter from the National Mall Coalition and those comments have been provided on our Commission's website. Moving now to our next Commissioner, Commissioner Argo, any comments?'",
        "'MS. KOSTER': ' I think actually Commissioner McMahon -- I'm sorry, I'm wrong, my apologies.'",
        "'VICE CHAIR DIXON': ' Does anybody have any comments? If not, maybe the round robin isn't necessary. Mr. Argo, you are next for the round robin I think.'",
        "'COMMISSIONER ARGO': ' I don't have any additional comments. I'm excited about this for the District of Columbia and I think the scientific and engineering part of this is over my head yet fascinating to me. That would be my only comment. Thank you.'",
        "'VICE CHAIR DIXON': ' Ms. Hewlett? `  88'",
        "'COMMISSIONER HEWLETT': 'The only comment I would have is that I guess I would like to commend the National Park Service because this is really complicated and as Commissioner Argo said, some of the engineering aspects and whatnot, or probably all of the engineering aspects, are beyond my capability right now. But it's an incredible balancing effort to -- we want to preserve those monuments that surround the area, you want to preserve as many trees as possible but it's not possible to preserve all of them. So, you have this replanting effort. Actually, utilizing some of the masonry, some of the same masonry will be salvaged and then reused again to the extent possible, which is amazing. You're trying to prevent as much flooding as possible yet improving the walkways and I would imagine that improving those walkways so that you have greater access also ` 89 includes greater safety for'",
        "'COMMISSIONER HEWLETT': 'people of all ability levels. So, I think that's very important and I think that addresses some of the comments that were just raised by the two speakers about accessibility. The collaboration with all of the other agencies, I just want to commend the National Park Service for that. Interestingly enough, I had looked at the history of the Tidal Basin and at some point it was used for segregated beaches way back when. Anyway, that was my effort to just commend the National Park Service and everyone who has been involved in this. Thank you.'",
        "'VICE CHAIR DIXON': ' Mr. Green?'",
        "'COMMISSIONER GREEN': ' Thank you very much. This is an important and necessary project and my only hope is that as the project moves forward, perhaps additional thought to the height of that wall. `  90 Sea level rise, it's not if it's when and how much and to build that in, I understand the thought process to allow it to be increased but perhaps the time is now. Thank you.'",
        "'VICE CHAIR DIXON': ' Thank you, Mr. Green. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'I agree with you, Mr. Green, and that's why I'm pushing on this educational opportunity and I would urge the National Park Service to do the same and not be afraid to talk about money. I don't want to say it's interpretation but whatever signage you do employ, I hope it's more than just signage and you direct people to a website where they can learn what they need to learn and be very transparent. And the other thing that's going to invariably happen all over town is that we're going to have a smackdown between preservation and environmental stewardship. ` 91 Everybody needs to get used to the fact that, as Mr. Green mentions, this wall is going to have to be big and it's going to have to change the character of the Tidal Basin, and we're all going to have to grapple with that. And the sooner'",
        "'COMMISSIONER WRIGHT': 'we do the better. So, I think this is a huge opportunity for the public to be educated and some of the shock of what's to come is mitigated, starting now.'",
        "'VICE CHAIR DIXON': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': 'Thank you so much. I wanted to also echo some concerns about why we're not building additional height now. I know it's way above the pay grade of anyone who is sitting here. As a former Congressional staffer I understand the constraints but just as a taxpayer it really bugs me that we could build it for twice the price now than we what know we need to do, in 30 years we could do it for triple the price of what it's going to cost. ` 92 So, just a little bit frustrating but again, I think the work that's been done here and the plans look really good. I'm glad we're at least getting it back up to a functional height and preserving the landscape and all that. But I'm just hopeful that these future studies will show that we've got some decent protection down there and I'm'",
        "'COMMISSIONER CASH': 'glad we are building in the ability to build it up in the future. But sea level rise is definitely happening. I was just visiting Baltimore's Inner harbor for the first time this weekend and saw that a lot of the water levels are already right to the level of where they built it in 1995 already. So, I'm just hopeful this will be the band-aid that we need for now and really hope there's a renewed push in the future to get this to where we need to be for the next generations. ` 93 But I think the plans look great and thanks for the work.'",
        "'VICE CHAIR DIXON': ' Thank you, Commissioner Cash. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Thanks, I appreciate the presentation. No additional comments from me.'",
        "'VICE CHAIR DIXON': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Thank you, I agree with all the comments made by my fellow Commissioners. It seems like an important project that's necessary now. I agree that it is in the bigger picture a short-term project but we need to move forward with it. Thanks.'",
        "'VICE CHAIR DIXON': ' We've been around the membership. I'd like to also say that I heard mention of some reports that were going to be needed by maybe the folks Ms. Dolan mentioned. And I wonder whether the timing `  94 could be such that it would be supporting them more. If it's a problem, I raised it. I also wanted to mention that I'm happy to hear they're looking through the Anacostia River because we have obviously the same problems. And hopefully it will get to us in time, that part of the city in time, as well. That's my only comment and I don't know, Peter, do you want to answer that comment of timing?'",
        "'MS. KOSTER': ' If I can also just say I think this might have been my error, but I didn't know if Commissioner Cozart had anything to add?'",
        "'VICE CHAIR DIXON': ' It was in my script, I didn't see it. Commissioner Cozart, let me ask you to weigh in now if you would, please.'",
        "'COMMISSIONER COZART': ' Just thanks to the Staff for the presentation and the analysis and I'm glad this project is moving forward.'",
        "'VICE CHAIR DIXON': ' Peter, you're `  95 back on, please.'",
        "'COMMISSIONER MAY': 'As I mentioned before, the geotechnical report that was specifically asked for is something that's still being developed and refined and will be incorporated into the environmental assessment that will be coming out soon. I don't know the exact date but that will be there. It's not going to be in sync with the comments on the memorandum of agreement under Section 106 but it's hard to connect the geotechnical report with Section 106. But there will be plenty of opportunity for folks to comment on this for public review so I'm not worried about that. And of course, the Commission will review it all at the next meeting. Also, I just want to reassure my fellow Commissioners that we're not doing some minimal, I think it was the term band-aid measure that was mentioned by someone. ` 96 This is a robust addition to the existing wall and it'",
        "'COMMISSIONER MAY': 'will provide protection for a long time. It's going to make the Tidal Basin wall here especially, it's going to reinforce that. It will be good for a couple of decades. So, it's not something minor and we are building it with flexibility. The reason we are not simple going higher is that there are a lot of components to this wall. Again, think about that map that was done and how little of Tidal Basin wall we are actually addressing, compared to the entire extent of it. And there are many different heights along there, there are three memorials that border it, there are a couple of bridges. There's a lot of complexity trying to match all those things up, not to mention the fact that we have the historic landscape of the cherry trees, including some of the originals. ` 97 So, there's a lot that has to'",
        "'COMMISSIONER MAY': 'be balanced. And so what we're taking here is we're dealing with the worst component of it, we are fixing it for a good, solid period of time and we are planning for flexibility into the future. And I agree with Commissioner Wright, we're looking at a future where the nature of the Tidal Basin may need to change. However, I'll also say that if they're able to take advantage of some of the ideas that were discussed here, such as the use of the inlet gates and the outlet gates to control the potential flooding, if we can work with the Corps of Engineers to make use of that, we may not need to raise the sea wall any higher within the tidal basin. That's still to be determined. So, there are just too many variables to simply go out there and put in a ten-foot wall when a'",
        "'COMMISSIONER MAY': 'five-foot wall will do. So, I just want to make sure that ` 98 everybody knows we are not doing something minimal here and just planning for the future. We are taking I think a pretty reasonable course and balancing it with future needs and the Needs for Future study.'",
        "'VICE CHAIR DIXON': ' Thank you, Peter, I think that clarification was very useful. And with that, if there's no other comments or questions, is there a motion to move the tidal basin and West Potomac sea wall rehabilitation? Do we have a motion?'",
        "'COMMISSIONER HEWLETT': ' I move approval.'",
        "'VICE CHAIR DIXON': ' Is there a second?'",
        "'COMMISSIONER MAY': ' Second.'",
        "'VICE CHAIR DIXON': ' It's been made and seconded, with that I'd like to ask the Secretary to please confirm the motion and also call the roll.'",
        "'MS. KOSTER': ' The motion was made by Commissioner Hewlett and seconded by `  99 Commissioner May. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo? I'll come back to Commissioner Argo. Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Dixon?'",
        "'VICE CHAIR DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' I just wanted to check to see if Commissioner Argo was back on? `  100'",
        "'COMMISSIONER ARGO': ' I am back on. That would be a yes.'",
        "'MS. KOSTER': ' The motion has carried.'",
        "'VICE CHAIR DIXON': ' Thank you for the motion and having proceeded, let us now move to our next agenda item, Item 7B, the approval of comments and concerns for plans for the Rock Creek Park Golf Course rehabilitation. Ms. Herr is going to present that, right?'"
    ],
    "5. APPROVAL OF COMMENTS AND CONCERNS FOR PLANS FOR THE ROCK CREEK PARK GOLF COURSE REHABILITATION ": [
        "'MS. HERR': 'Thank you. Good afternoon, Members of the Commission. The National Park Service has submitted a concept design for the rehabilitation of the Rock Creek Park Golf Course located at 6100 16th Street NW in Washington D.C. The golf course is located in Rock Creek Park, west of 16th Street and north of ` 101 Military Road. As this is a concept review, the focus of today's presentation and analysis is to receive Commission comments and feedback prior to preparation of a more detailed preliminary submission. In this case, the focus of the review is understanding the appropriateness of the site and context, understanding any particularly unique or complex issues that need to be addressed, and identifying any stakeholders that may need to be further involved. The National Park Service is responsible for three historic public golf courses in the District. NPS has signed a 50- year agreement with the National'",
        "'MS. HERR': 'Links Trust to rehabilitate the three courses. The Rock Creek Park Golf Course will be the first course to be renovated as it is in the worst condition. The Rock Creek Park Golf Course is currently listed in the National Register of ` 102 Historic Places as a contributing resource to the Rock Creek Park Historic District. The site is approximately 100 acres and includes an 18-hole park-land-style golf course primarily designed by golf course architect William S. Flynn. In 1921 William Flynn was hired to design a new course and in 1923 President Warren G. Harding dedicated and opened the course. In 1924 Flynn returned to determine the new routing to increase the course to 18 holes, which opened to the public in the spring of 1926. Modifications occurred in the 1950s with the realignment of Military Road NW. A 2017 cultural landscape inventory for the course established that'",
        "'MS. HERR': 'the course is individually eligible for listing in the National Register of Historic Places. It is an important local work of William S. Flynn and a largely intact example of a course designed during the period referred ` 103 to as the golden age of golf course architecture. Golf course architect William S. Flynn created a layout that highlighted the topography and incorporated stands of mature trees. An existing 19th century farmhouse was originally renovated for use as a clubhouse but was eventually replaced in 1964. The main entry to the course is from 16th Street NW and winds past the maintenance building and parking area to the clubhouse. The course only has 14 active holes as 4 holes are not in service due to deteriorating conditions, as noted here in the red circle. At the southern end of the course, the location of six of the front-end holes were'",
        "'MS. HERR': 'shifted due to the construction of Military Road, but the overall routing of the course was retained. The current course suffers from deferred maintenance that has impacted golf course facilities as well as the playability of ` 104 the course. Woody vegetation encroaches on the fairway, screens, and tees. Over the years, vegetation was planted on the front line without following the distinct golf course style. In other instances, invasive vegetation, especially vines, has covered original stands of trees, which obscures views into forested areas. The course also suffers from poor turf conditions caused by traffic patterns, poor cart paths, poor drainage, tree competition, poor irrigation systems, and shade from encroaching trees. The existing 1964 clubhouse is listed as a contributing resource within the Rock Creek Park Historic District. However, after evaluation, it was determined that the building could not be reused due to its small size and lack of'",
        "'MS. HERR': 'accessibility. The extensive use of masonry interior partitions would also make reconfiguration difficult. ` 105 As such, the demolition and replacement of the clubhouse with the new facility are proposed to meet the needs of the National Links Trust, golf course patrons, and the community. The proposed project includes a nine-hole regulation course and a shorter nine-hole par-three course. The intent is to expand the appeal of the facility to both experienced and beginner golfers. The nine-hole regulation course will use corridors from both Flynn's more open front nine and more wooded back nine, taking advantage of the natural bowl-like topography, the proposed driving range stands on what is now the 9th and 10th holes with a line of play up the hill to the north. The maintenance building will be relocated out of view of the main entry. The Applicant is proposing a new clubhouse with driving range and'",
        "'MS. HERR': 'a community pavilion with terraced seating that will offer a view of the ` 106 first and ninth holes. The nine-hole par-three course will start and finish just west of the current 9th green. This course is a place for beginners to transition from the driving range to the course and for more advanced players to sharpen their skills. The mix of playing options takes advantage of the site's natural sitting and minimizes tree clearing, allows for healthy turf conditions, which improves playability. The proposed project transforms the area on the northern edge of the golf course, which was historically the location of the 12th and 13th holes into a maintained meadow. A proposed irrigation pond occupies a natural depression in the fairway of the 12th hole. The scale of tree removal and replacement impact is unclear at this stage and the Applicant will need to submit this information at'",
        "'MS. HERR': 'future submissions. The Applicant is proposing to ` 107 demolish the existing clubhouse and replace it with a new 10,400 square foot fully accessible 2-level clubhouse, offering a food and beverage operation, restrooms and other amenities. The proposed clubhouse will be located near the existing clubhouse, the center of the course. The building will be oriented to enhance and emphasize the panoramic views from the club house to the golf course, sited to preserve mature trees and surround the existing clubhouse and nestled into the existing topography of the site. A two-tier driving range structure will extend west from the main clubhouse building. The Applicant also proposes a parking area with around 100 spaces. While this is a reduction from the 125 spaces today, it's unclear what is the minimum amount of parking needed. This parking information will be needed at future submission. The Applicant is ` 108 also proposing'",
        "'MS. HERR': 'permeable paving to decrease storm water run-off. The new clubhouse will house classrooms, program spaces, and the administrative headquarters of First Tee of Greater Washington, a golf-based youth development organization. For operational efficiency --(Telephonic interference.) -- service and to provide a continuous accessible route through the facility, the range structure is connected directly to the clubhouse on each level and will step down along its length following the grade of the range line. The massing of the building draws from traditional forms and the building features extensive use of natural materials such as stone and wood, combined with large expanses of glass and contrasted with steel and other elements. This elevation shows the two-story ` 109 driving range connecting the main clubhouse with the community building. As previously noted, the Applicant is planning extensive use of natural stone with timber, horizontal siding, and slate shingles, combined with large expanses of'",
        "'MS. HERR': 'glass, steel elements, and other features. Additional details on lighting and landscaping in this area will be needed in the future. As you can see in this rendering, the building will be oriented to enhance and emphasize the panoramic views from the clubhouse to the golf course, sided to preserve the mature trees and nestled into the topography. Aesthetically, the goal is to create a contemporary design which is compatible with the historic context of Rock Creek Park. The Applicant is proposing to improve the cart pass but also establish a 1.2 mile ecological trail, shown here in red, that ` 110 loops through a multitude of areas in the northwestern portion of the site. The goal is to promote inclusive access to nature for improved health and wellbeing, expand the uses of the property beyond golf users and encourage cross-pollination between recreational communities. Additional details on bicycle facilities and'",
        "'MS. HERR': 'how the trails will connect to area roadways will be needed at a future submission. As the golf course will continue to consist of turf grass, wood, and meadows, storm water management is only required to address the areas of increased impervious surface such as the clubhouse and parking area. The Applicant is proposing to use bioretention and bioswales as well as a large irrigation pond for water storage. The Applicant is also proposing a more sustainable approach to course maintenance. Additional details on these ` 111 approaches will be needed in the future. This concludes my presentation. I have incorporated recommendations throughout the presentation so I will not read them but I have kept them here for your reference. To summarize, the Applicant will need to provide additional information on tree removal and replacement, the lighting approach, the approach to reducing water, fertilizer, and pesticide use, the quantity and'",
        "'MS. HERR': 'location of bicycle facilities, parking requirements, proposed landscape pallet, including the integration of native and pollinator species, and connecting the proposed trails to area streets. I'm available to answer any questions and Brian Joyner from the National Park Service is here and would like to make a few remarks. Thank you.'",
        "'MR. JOYNER': 'Thank you. Good afternoon, everyone, thank you very much for being here to consider our ` 112 comments on this particular project. At the National Park Service we are excited to see the rehabilitation plans for the parks moving forward. The course has long been an integral part of the park. It fits into a landscape of farmland and woody hills that characterize this area in the early 1990s. Through the years, course and player experience has suffered as the original layout changed. Vegetation crept into the fairways and the course structures continued to deteriorate. Now, a century later, we have a chance to bring back the course through a partnership with NPS and NLT. It is depending on the historic designed golf course that will be revived and expanded to meet the needs of 21st century golf. The historic front nine layout that underpins the original intent in the'",
        "'MR. JOYNER': 'facilities that include a modern clubhouse ` 113 and driving range. Park visitors will have the opportunity to play golf or be in the pavilion, wander through a pollinator meadow or natural trail, or enjoy a meal with friends and families in what is arguably one of the most beautiful park settings in all of the metropolitan area. This rehabilitation provides a chance to welcome a new generation of park visitors and ensures that the park is sustainable financially and environmentally well into the future. We look forward to working with you on the Commission as NPS and NLT complete the environmental assessment and design for the rehabilitation and move into construction in the near future. With that, I would like to introduce from NLT Michael McCartin. MR. Mc'",
        "'CARTIN': 'Thanks, Brian. My name is Mike McCartin, I'm the ` 114 Co-Founder of National Links Trust. Thank you to everyone here, thank you Commissioners, it's really a pleasure to discuss our plans with you for Rock Creek today. I'd like to start by giving a bit of background about National Links Trust. First, we're a 501(c)3 nonprofit, our mission is to protect and promote accessible, affordable, and engaging public golf courses that positively impact local communities across the United States. And we were formed specifically for the purposes of applying for the lease for these three golf courses in D.C. So, as we put that mission into practice in D.C., our mission means providing welcoming and inclusive facilities that run a variety of educational sports and workforce development programming. It's designed to expand access to golf and to the benefits of golf to as wide a population as possible. It'",
        "'CARTIN': 'also means ensuring these properties provide opportunities and ` 115 access for non-golfers to enjoy them too. As Brian mentioned, we have a 50- year lease with the National Park Service under which we're responsible for addressing just an incredible amount of deferred maintenance at each of the golf courses. And our plan is to accomplish the work of addressing that deferred maintenance by undertaking full-scale renovation projects at each course. The first of those courses is the Rock Creek project we're discussing today. That would be followed by Langston and then East Potomac which has a tie-in to the sea wall work we were all just discussing shortly before. We're working through the compliance process at both Rock Creek and Langston concurrently. Obviously, we're here right now for Rock Creek but shortly we'll be here again for Langston. Rock Creek is the first to get to this point and'",
        "'CARTIN': 'will be our first project to get to construction for a few reasons. ` 116 Most importantly, as was mentioned earlier, it's by far the most underutilized of the three properties, sees the least number of golfers, and has the most inadequate infrastructure of the three courses. As a result of all that, it's the least financially viable of the courses. Another contributing factor is the compliance process is relatively more straightforward at Rock Creek for us versus Langston. At Langston we're working through some storm water management elements involving daylighting streams and constructing wetlands that will make that process just a more complicated one to navigate. But we're equally excited about all of these projects. I know the details of the project were really covered in detail in the earlier presentations but I just want to talk about the overall purpose of the project from our perspective, which is'",
        "'CARTIN': 'to make an investment in ` 117 the Rock Creek property that will see it through the next 50 years. That planning on our end is guided by the history of the golf course, which includes the golf course designed by William Flynn, which we've touched on. Also by desire to create a facility that provides appropriate facilities for all types of golfers, which the current course really fails at. By virtue of that evolution over time and the changes to the original design and lack of facilities. And we want to make sure that what we provide is good for all types of golfers, whether they're new or experienced, whether they're unskilled or skilled. We're also guided by environmental sustainability. There's a great opportunity at Rock Creek to do a better job of transitioning from the more built environment of the clubhouse and golf course into the beautiful forest'",
        "'CARTIN': 'that surrounds the course. ` 118 And there's a whole bunch of - whether it's pollinator meadows or other strategies that we're excited to implement on that level. And then finally, we're guided by the opportunity to positively impact our community, both by providing better facilities and increasing access to golfers as well as ensuring that the spaces are utilized by non-golfers too. In order for all this to be successful, we clearly need to ensure that we end up with a sustainable financial operation, not just at Rock Creek but at all three golf courses after we're done with these renovation projects. But we've intentionally set up our organization as a nonprofit so that we can prioritize affordability and accessibility and the impacts to the communities that we can do with these properties over the length of our lease. ` 119 Given the scope of our projects here in'",
        "'CARTIN': 'D.C., this is likely the first meeting with you all of many. It's really great to meet you today, we're looking forward to working together on this project and the other projects as we go forward. I'm available to answer any questions about the project and thanks again for the opportunity to speak with you today.'",
        "'VICE CHAIR DIXON': ' Thank you very much. I think that concludes the presentation and I appreciate all of you. At this time I think we need to give Commissioners a chance to speak to this. Let me ask generally, does any Commissioner have any comment at at this point in time?'",
        "'COMMISSIONER HEWLETT': ' I would just add way to go on the First Tee program.'",
        "'VICE CHAIR DIXON': ' We can go around the Commission, as we have in the past. I guess we start with Ms. Cozart this time. `  120'",
        "'COMMISSIONER COZART': ' Thanks to the Staff for the review and preparation. No questions from me.'",
        "'VICE CHAIR DIXON': ' Then I guess next would be -- I can't see it. Let's just start with Ms. White, see if she can help us out. Ms. White?'",
        "'MS. KOSTER': ' I think Commissioner McMahon would be the next, followed by Commissioner May if you wanted to start there?'",
        "'VICE CHAIR DIXON': ' Let's do that then, Mr. McMahon?'",
        "'COMMISSIONER MCMAHON': ' Thank you, good presentation from the Staff, I appreciate that, and also from Mr. McCartin. It's obviously an important project in the history and future of the District of Columbia so I'm looking forward to it moving forward. Thanks.'",
        "'VICE CHAIR DIXON': ' Mr. May?'",
        "'COMMISSIONER MAY': ' Yes, I would just say we're very excited to have this first `  121 course moving forward. We're also very excited about our new relationship with National Links Trust. These are folks who dreamed up doing what we need to do at these golf courses. I could not imagine a better circumstance than having these folks step up and take on this challenge and to undertake it in what so far has been an excellent collaboration. I hope it will continue that way well into the future. We've got 50 years to be together but less time than that to get things fixed up. We're looking forward to moving that along very quickly. Thank you very much.'",
        "'VICE CHAIR DIXON': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I don't have any particular comments. I think this is pretty exciting. It makes me get also excited about dusting off my own golf clubs. I won't even tell you where they are `  122 but to have this broad, interesting, inclusive approach to golf in our community I just think is great. I'm very supportive and excited about seeing the evolution of this project.'",
        "'VICE CHAIR DIXON': ' Thank you very much. Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' I too am very excited and echo the comments of my other colleagues again with the First Tee and I like the pollinator meadow too. Thank you.'",
        "'VICE CHAIR DIXON': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Thank you, I appreciate the presentation and I have no questions.'",
        "'VICE CHAIR DIXON': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I don't have any comments either. I am singularly unqualified to opine in any way because I have never played golf in my life and I know what the back nine is versus the front nine but `  123 that's about it. I learned a lot reading the EDR, I'm not sure how useful the knowledge is but I'll take it.'",
        "'VICE CHAIR DIXON': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Great presentation and I do think the clubhouse is actually one of the unsung stories here. I think it would be a great community amenity up there when it's not being used necessarily for golf. I think it's a great expansion and I hope for Mr. May's sake that will not be formstone in the final design, but that really caught my eye in the presentation. Thanks for the work.'",
        "'COMMISSIONER MAY': ' No formstone.'",
        "'COMMISSIONER WRIGHT': ' That's the over his dead body category.'",
        "'VICE CHAIR DIXON': ' Commissioner Davis? `  124'",
        "'COMMISSIONER DAVIS': ' Thanks for the presentation, no additional comments from me.'",
        "'VICE CHAIR DIXON': 'It goes without saying that I'm very excited about this. I've been a golfer for a long time but I haven't played for a while. My clubs need to probably be dusted off too, Commissioner Argo, and it's going to encourage me to do that. I also like the idea of the executive par three hole course because it does open up the opportunities to a lot of different players and it's a good way, the way, to get started and get into the game. I do wonder, though, whether or not the clubhouse, and I agree with Commissioner Cash, this could be a useful facility for other events when it's not golfing time or golfing. St. Andrews, for example, they have a lot of events there that are ungolf-related because they have a large clubhouse, which I also have used. Also, I would wonder whether or not ` 125'",
        "'VICE CHAIR DIXON': 'the idea of the top golf approach with targeted driving ranges is something that might be thought of. We don't want to get that vendor in there but the concept of having a driving range that has a targeting capacity that could maybe add to the technology and the interest in the course and in the golf and in the driving range. I just wondered, I'm going to ask the presenters, whether some of this technology has been looked at and may be looked at for the driving range? MR. Mc'",
        "'CARTIN': ' That's a good question, Commissioner Dixon. We actually have already installed technology that underlies top golf out at Langston and at East Potomac. And so that would be a component of what we do at Rock Creek. (Simultaneous Speaking.)'",
        "'VICE CHAIR DIXON': ' You can see that I haven't been out on the course recently. I `  126 started playing many years ago when I was a kid and I think I played in golf courses all over the world, including St. Andrew's and Turnberry and on and on. I hope you get this finished in time for me to use it. Thank you very much. Having said all of that, let's move to consider a motion to go forward. Is there a motion to move, please?'",
        "'COMMISSIONER MAY': ' I would move approval of the'",
        "'COMMISSIONER ARGO': ' And I will second.'",
        "'VICE CHAIR DIXON': ' Would Secretary Koster please call the roll, please, and confirm the motion?'",
        "'MS. KOSTER': ' Sure, the motion was made by Commissioner May and seconded by Commissioner Argo. With that, Commissioner Cozart?'",
        "'MS. KOSTER': ' Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes. `  127'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Dixon?'",
        "'VICE CHAIR DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' The motion has carried.'",
        "'VICE CHAIR DIXON': ' Now we can move to Item 7C, approval of the final master plan for Joint Base Anacostia-Bolling Historical `  128 Anacostia District Plan. (Simultaneous Speaking.)'",
        "'MR. WEIL': ' Can you see that, Ms. Koster?'",
        "'MS. KOSTER': ' Yes, I see it and we can hear you, thank you.'"
    ],
    "6. APPROVAL OF THE FINAL MASTER PLAN FOR JOINT BASE ANACOSTIA BOLLING HISTORICAL ANACOSTIA DISTRICT PLAN ": [
        "'MR. WEIL': 'Thank you. Good afternoon, Mr. Vice Chairman Dixon and Members of the Commission. The United States Air Force has submitted its final Anacostia District Plan to the Commission for review and comment. In addition to the Anacostia plan which is before us here today, I would also like to note that you recently approved the final plan for the housing and community support district on today's consent calendar. This district is made up of mostly residential neighborhoods with some open and recreational space and a community support note ` 129 with a base of change and commissary. However, I will just be reviewing the Anacostia District Plan today as the Air Force has mostly smaller-scale improvements planned for the housing and community support district at this time. Previously, our Commission also approved two other District plans for JBAB, the Sentinels of the Capital District and the Historic Bolling District. These,'",
        "'MR. WEIL': 'in addition to today's plans, will complete a series of updated Air Force plans for the installation, which includes a larger base-wide framework plan and transportation and management plan. As this is the final master plan approval, we are considering how the Air Force submission reflects the previous comments on the draft district plan if there continue to be any unresolved issues that still need our attention as the Air Force submits future individual projects for the review by the ` 130 Commission. As a reminder, the Joint Base Anacostia-Bolling, or JBAB, is situated in SE Washington D.C. at the convergence of the Potomac and Anacostia Rivers in Ward 8, cornered by the Naval Research Laboratory to the south, Frederick Douglass Memorial Bridge to the north, South Capitol Street and I-205 to the east, and the Potomac and Anacostia Rivers along its west side. JBAB is located approximately 1.5 miles'",
        "'MR. WEIL': 'to the southeast of the U.S. Capitol Building and at the base of the Washington topographic bowl and just to the west of the Department of Homeland Security is St. Elizabeth's campus. JBAB has a total population of approximately 17,000 military and civilian employees, hosting units that include the National Guard, Military Reserve, United States Coast Guard, and other federal personnel. Similar to a small city, the 966- ` 131 acre installation has a wide range of land uses with privatized homes and a mix of other uses that includes parks and open space, commercial uses, communication and air facilities, military barracks, child development centers, and administrative buildings. And here are some notable campus landmarks that include the JBAB Marina, Blanchard Barracks, the JBAB base exchange and commissary, Air Force Honor Guard Campus, and the DIA building. The one other prominent feature is the raised earth and levee sea wall'",
        "'MR. WEIL': 'along JBAB's shoreline, originally completed in 1939. The raised levee offers panoramic views to downtown Washington D.C., East Potomac Park, and Reagan National Airport. The Anacostia Planning District encompasses the northernmost portion of the installation with primary land uses that include mission, administration, and industrial uses. ` 132 In addition, there are several pockets of community support, bachelor housing, and green and recreational space in the District's northern tip, which is currently under control of the Navy. The Anacostia District's development pattern reflects its previous operation by the military as an early naval airfield with industrial and service-oriented uses. The District area was formally known as Support Facility Anacostia until its merger with Bolling-Air Force Base in 2010 to form the current Joint Base Anacostia Bolling Installation. The historic core of the District, formally known as the Naval Air Station Anacostia Historic District, is shown here in yellow, encompassing multiple'",
        "'MR. WEIL': 'historically significant buildings, some of which are unused and in poor condition, and experience subsidence based on existing soil conditions. Here we see the Anacostia District ` 133 superimposed over JBAB's 28-mile internal roadway system, which is made up of primary, secondary, and local roadways. And you will note the installation's primary north-south spine road represented here as the thicker blue line is named Chappie James Boulevard in the south and Defense Boulevard in the north. The roadway accesses each of JBAB's planning districts as well as each of its three operational gates, south gate, Arnold gate, and Firth-Sterling gate in the north. About half of JBAB's land area is currently susceptible to 100 and 500-year flood events with virtually all of the Anacostia District encompassing lower-line flood-prone areas, as shown here on the slide. Here is a notable area of locations in the District, including the Navy-controlled open and'",
        "'MR. WEIL': 'recreational space to the north, JBAB's Firth-Sterling gate, the raised levee and its water-front trail, and the historic air ` 134 station district with several buildings. The area west has a number of planning objectives for the District which include enabling mission partners and unique missions, enhancing base security, adopting to climate change, and providing complete multimodal transportation networks. Building on these, the District framework plan translates these objectives into future planning actions within the context of the District's activities nodes, landmarks, paths, and connections, and future planning opportunities. These ultimately become future projects, as depicted here in this illustrative plan for the District, including a new access control point, screening area and transit hub, a more cohesive Navy Ceremonial Guard Campus, the JBAB levee improvement project and several other proposed warehousing and service building expansions. Our Commission previously provided ` 135 the Air Force with a number of comments'",
        "'MR. WEIL': 'during its review of the draft Anacostia District plan and I will now summarize how the Air Force responds through its final plan submission over the next few slides. In general, Staff is satisfied with the final Air Force's master plan submission and so we are recommending Commission approval of the final plan of today's meeting, as stated in the final Executive Director's Recommendation before you. Our draft master plan comments included a recommendation which is shown here on the slide, for the Air Force to comply with Federal Executive Order 13690 to improve JBAB's resilience against future flooding. This would be in addition to the JBAB plan to improve its river-front levy. In response, the Air Force has revised the District plan to clarify future that future development would meet the requirements of this executive order. ` 136 In response to our request for future consultation relating to new'",
        "'MR. WEIL': 'Firth- Stirling access control point project, we note the Air Force has already met with the DDOT and NCPC Staff to solicit early feedback and JBAB will continue to meet with our Staff periodically as they initiate a future environmental assessment study and continue to develop the access point design. The Air Force has indicated that they will consult with NCPC and D.C. SHPO Staff early in their design process for the new Navy Ceremonial Guard Campus redevelopment, responding to a previous review recommendation. As an aside, I would also like to note that since our draft Anacostia plan review from this past September, the Air Force has elected to preserve an additional air station historic district building, identified here as Building 91, with a plan to convert its space into an indoor recreational recycle as part of the future Navy Ceremonial Guard Campus project ` 137 design. However, we'",
        "'MR. WEIL': 'did include a recommendation in the final approval action to emphasize NCPC's desire for early consultation related to all planned projects both in and around the historic air station district to mitigate any potential adverse effects to the air station's historic features there. Responding to our previous request, the Air Force will brief us on their renewable energy program for JBAB once they complete their installation-wide energy plan and a presentation will provide our Commission with a look at their solar array siting process, future installation-specific energy goals, and the status of their current power purchase agreement. While the Air Force is unable to plan for a new pedestrian and bicycle gate at the northernmost tip of JBAB as the land will continue to remain under Navy control, the new Firth-Sterling access control point facility ` 138 would not only accommodate an east-west route between the riverfront and South Capitol'",
        "'MR. WEIL': 'Street, which is in the spirit of our previous recommendation, but the project would strengthen the travel range for pedestrians and bicyclists with a formalized transit hub for DOD shuttles, WMATA buses, and public drop-off traffic, thereby improving JBAB's connectivity into downtown Washington D.C. and the surrounding areas. Over the next few months, the Air Force will submit the latest TMP data for Staff review, which will help us track the performance of JBAB's travel demand management programs as they work to reduce installation-wide employee parking demand. Before I conclude, I would like to comment on future installation-wide employee parking. The Air Force has committed to a long-term one to three goal and they do support planned transportation services such as high- ` 139 capacity transit to downtown Washington and commuter and ferry and water taxi service, which is expressed through their TMP. The installation has recently improved its overall'",
        "'MR. WEIL': 'parking ratio and JBAB will continue to improve through limited future capacity increases. While this approach would continue to gradually improve JBAB's overall ratio, the Air Force must further limit parking to reach its overall one to three goal by 2041. In addition to JBAB's continued employment population growth over the next 20 years, the Air Force will need to design some of their planned new projects with minimal or no additional parking capacity, or else parking can be removed elsewhere on the installation as an offset for new parking needed to support a new development site such as the National Capital Region Center of Excellence. Thus, NCPC will consider further requests for new parking on a project by ` 140 project basis, and for each case we will need to understand the overall installation-wide ratio at the time of submission, how each project fits into JBAB's overall plan to'",
        "'MR. WEIL': 'meet its long-term one to three goal, as well as employee travel and mission requirements and the availability of public transit, carpool, vanpool, pedestrian and bicycle infrastructure to each future project site. We include all of these points in the final Executive Director's recommendation that is before you here today. With that, that concludes my presentation and I would like to note that we have a number of representatives here from JBAB who are available for questions by the Commission, including Coronel Zeitler, who is the 11th Wing Vice Commander, Kat Keller-Kratzer, who is the Deputy Base Engineer, and Mark Berger, who is the Planning Director at JBAB. Thank you very much and that ` 141 concludes my presentation.'",
        "'VICE CHAIR DIXON': ' Thank you very much. At this time, I'd like to openly ask whether the Commissioners have any particular questions at this time and then we will go into a round robin again to get everybody's comments. I'll open it now or I will go in a round robin. Any comments? We'll go to Commissioner Argo first, Commander Argo I should say.'",
        "'COMMISSIONER ARGO': ' Yes, I do love that title. As an Honorary Commander --'",
        "'VICE CHAIR DIXON': ' Honorary Commander, this is retired Coronel Dixon speaking to you.'",
        "'COMMISSIONER ARGO': 'I love it. I'm excited about this, I actually visited the base over the holidays as an Honorary Commander for a holiday party and was able to -- in fact, I gave a presentation and ` 142 was also able to talk to some of the people about some of the issues that we've touched on here today. I don't have anything in particular to comment on, other than obviously a lot of the focus has been on, and anybody who goes down there can see it, the need to get a really tight TMP plan. There's a lot of cars out there and on land that could be used for better purposes I think for everybody and for the environment. But there are great people out there and I think they are very committed to what I can tell in my conversations with them to make some of the'",
        "'COMMISSIONER ARGO': 'changes and improvements that we've suggested as we've reviewed the plans for this nearly 1000-acre installation. So, I appreciate it, thanks for the opportunity to comment.'",
        "'VICE CHAIR DIXON': ' Thank you very much. Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' Thank you so `  143 much. This is a really, really good plan and focuses on the transportation management plan. Also, I'm pleased with the installation energy plan, particularly the use of solar panels, and also Chappie James, that's very nice and very important to emphasize the Tuskegee Airmen --(Simultaneous Speaking.)'",
        "'VICE CHAIR DIXON': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Thank you, I appreciate the presentation and enjoyed the report. My only comment would be I'd like to, as this moves from a master plan to implementation, look for ways to minimize the demolition of historic resources within the Historic District. Thank you.'",
        "'VICE CHAIR DIXON': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I'm not going `  144 to say anything more, I feel like we've seen this 100 times and I've commented along the way but mostly, I agree with Mr. Green. Again, and I've said this before, there are opportunities to fix the mistakes that have been made and I'm glad to see they're going to do that. Please don't make anymore.'",
        "'VICE CHAIR DIXON': ' Commissioner Wright, I have to tell you this, your two cats have upstaged you. Now you have a very black and a very white tail, beautiful cats.'",
        "'COMMISSIONER WRIGHT': ' I've got four of them. I'm in crazy cat lady territory.'",
        "'VICE CHAIR DIXON': ' I've been there so I understand how four cats can be. Take care. Now we'll move on to Commissioner Cash.'",
        "'COMMISSIONER CASH': 'Thank you so much, I do want to just point out I think it's great, the bike lanes, looking at the pedestrian accessibility and those additions. As we're looking at the TMP I think I've made this comment before, but seeing if ` 145 there's ways to utilize D.C. Capital Bikeshare, just to get more people moving around like that. And then looking at the slides with the cross-section of the bike lanes, I do just want to say I hope that we don't just slap a couple of bike lanes down. I hope you are being thoughtful about pervious surfaces and then I started looking at Google Maps again. Maybe you can put this into the plans but some trees along those routes would be great. You want to get people walking and biking and it's kind of a barren wasteland out there when it comes to vegetation and'",
        "'COMMISSIONER CASH': 'foliage. So, just keeping those things in mind because the bike lanes by themselves and the sidewalks by themselves won't get the circulation. You need those other amenities. But I think there has been some good work done so thanks.'",
        "'VICE CHAIR DIXON': ' Thank you, `  146 Commissioner Cash. Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Thanks for the presentation, no additional comments.'",
        "'VICE CHAIR DIXON': ' Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Thanks to the Staff for the analysis and the presentation. I noted that there's plans for reviews of Building 91 that we have talked about before and I appreciate the Staff note about the early Section 106 presentation.'",
        "'VICE CHAIR DIXON': ' Commissioner May?'",
        "'COMMISSIONER MAY': 'I agree with the comments already made by the Commission, in particular Commissioner Cash's comments about bike infrastructure and trees. I do want to highlight one odd thing that I saw in the EDR and I think we should consider making a small modification to the EDR. And that is that there's a comment that says the Commission finds that while this approach, this is referring to the ` 147 one to three parking goals, will slowly improve the overall JBAB ratio over time, the installation is unlikely to reach its one to three goal by 2041. I don't think we should say that. I understand that might be a certain reality that the Staff has come to conclude but as a Commission, I think that if we include this in the report, we are signaling in advance that we're not really expecting them to meet that goal. And I'",
        "'COMMISSIONER MAY': 'don't think we should do that, I think we should simply strike that finding from the'",
        "'VICE CHAIR DIXON': ' Do you want to make a motion for that, Peter, because I think you're right?'",
        "'COMMISSIONER MAY': ' I will make a motion that we strike the finding that states the Commission finds that while this approach will slowly improve the overall JBAB ratio over time, the installation is unlikely to meet its `  148 one to three goal by 2041.'",
        "'VICE CHAIR DIXON': ' second that? Does anybody'",
        "'COMMISSIONER ARGO': ' I will second that.'",
        "'VICE CHAIR DIXON': ' Without objection, I don't hear any objection, it will be accepted as an amendment to the final vote we take. I'm procedurally correct, I believe. Peter, do you have anymore you want to say?'",
        "'COMMISSIONER MAY': ' No, that's it. Otherwise, I feel like, Commissioner Wright, I've seen it 100 times and I don't want them to make any more mistakes. So, more trees, more bike infrastructure, make use of what you've got. It's a terrific opportunity to make it into a very special place in addition to having all of its important functions.'",
        "'VICE CHAIR DIXON': 'I agree with you. I would also ask for a motion to go forward. I think we also have had a lot of cooperation ` 149 from the folks there in our concerns in the past and they worked with us closely. I also have to say from a historic perspective, I remember this base when it used to have planes landing on it. I pre-date anybody in the Commission on that one, and therefore, you understand the absence of trees goes along with planes landing. You don't want a lot of trees around. But it does need to be I think corrected now for this kind of use and I would agree. I also want to mention that the parking issue is also a little delicate because a lot of folks like me, I'm a retired Army Coronel and I use the base as a military retiree for a'",
        "'VICE CHAIR DIXON': 'lot of different things. And there's a lot of community coming in and I think there's going to be more given the presence of so much federal on St. Elizabeths, with the Coast Guard there, et cetera. ` 150 So, people will be using this base for a lot of stuff so there is going to be some more cars that are maybe not accommodated by or required for employees. I don't know if we have to look at that and see where it goes but I do support Peter's position. And with that, I'm happy to see this go forward and I look for a motion at this time.'",
        "'COMMISSIONER MCMAHON': ' I move that we accept the EDR proposed by Commissioner May.'",
        "'COMMISSIONER HEWLETT': ' Second.'",
        "'VICE CHAIR DIXON': ' So, the motion is to move as amended and I will ask the Secretary to verify the vote and to also confirm the adoption.'",
        "'MS. KOSTER': ' Commissioner McMahon moved the EDR as amended and that was seconded by Commissioner Hewlett. With that, Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon? `  151'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Dixon?'",
        "'VICE CHAIR DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' Thank you, the motion has carried.'",
        "'VICE CHAIR DIXON': ' Thank you very much, Madam Secretary. With that, we'll move to our last item and that is the Southeast `  152 Federal Center.'",
        "'MS. FREE': ' Good afternoon, can you see my screen?'",
        "'VICE CHAIR DIXON': ' We can.'"
    ],
    "7. APPROVAL OF THE SOUTHEAST FEDERAL CENTER REVISED MASTER PLAN 3RD AMENDMENT ": [
        "'MS. FREE': 'Good afternoon, Commissioners. The General Services Administration has submitted a third amendment to the Southeast Federal Center Master plan for review. The Southeast Federal Center, or SEFC, also known as the Yards, is in Southeast Washington along the Anacostia River. The Federal Center Public-Private Development Act of 2000 was established by public law 106-407, which established or which authorized GSA to enter into agreements with a private entity for the redevelopment of the SEFC. In 2004, GSA selected Brookfield Properties, formally known as Forest City, as ` 153 the master developer for the redevelopment of the SEFC pursuant to the approved master plan. NCPC is tasked by public law 106-407 to ensure that redevelopment of the SEFC is consistent with the objectives of the NCPC's 1997 vision plan entitled Expanding the Legacy, Planning for America's Capital in the 21st Century. Building from the framework of the 1791 L'Enfant plan and'",
        "'MS. FREE': '1901 McMillen Plan, the Legacy Plan is the third chapter in the District's planning history. It departs from previous plans that concentrated facilities and investments around the National Mall by shifting the city's perceived center to the U.S. Capital and by directing federal development outward to all city quadrants. The legacy plan envisioned a redeveloped SEFC with an active and publicly accessible waterfront park. Also, per a 2005 memorandum of ` 154 understanding between NCPC and GSA, NCPC reviews for comment and advice the 35 percent exterior building design drawings at the SEFC for conformity with the urban design guidelines and minimum phase performance standards which are outlined in the MOU. These guidelines include the preservation of views and vistas to and from the waterfront as well as to federal monumental buildings. High-density residential and mixed use is also encouraged and plazas and open-space destinations are an integral part of'",
        "'MS. FREE': 'the site. The guidelines recommend an appropriate mix of neighborhood and waterfront-oriented retail, service and cultural uses located at the ground level along major streets and buildings that face onto the waterfront park. The original master plan was approved in 2004 and an update to the master plan was then approved in 2007, and two ` 155 subsequent amendments in 2016 and 2020 were approved to reflect development that had occurred and minor changes for future development, including flexibility in land uses. NCPC has also reviewed the 35 percent design drawings for several of the projects in the SEFC pursuant to the 2005 MOU since the plan's adoption. As a reminder, the SEFC is a 42-acre site in southeast. At full build-out, the SEFC is anticipated to contain approximately 5.5 million square feet of development. Since 2007 GSA and Brookfield Properties have consulted on three historic rehabilitation projects and multiple'",
        "'MS. FREE': 'new buildings with the District of Columbia State Historic Preservation Office, the Advisory Council on Historic Preservation, and the Section 106 consulting parties. Since the adoption of the SEFC master plan, several projects have been ` 156 completed including the Yards Park along the Anacostia River and the majority of anticipated developments surrounding the park. Currently, Parcels H and I in the western portion of the plan area are under construction. The purpose of the proposed amendment is to add residential use to the existing office land use for the eight parcels which are bound by 1st Street to the west, M Street to the north, New Jersey Avenue to the East, and Quander Street to the south. The parcels are currently undeveloped and the amendment will last in flexibility in their use. There will be no change to the building's footprints, heights, or massing, and flexibility for residential and/or'",
        "'MS. FREE': 'office uses above ground-floor retail on the A parcels is not inconsistent with the goals and objectives of NCPC's legacy plan. Staff notes the proposed amendment ` 157 also includes minor modifications to land use, spacing, and parking plans to reflect this amendment and bring these figures into alignment with as-built conditions. The parking plan is updated to reflect actual parking for completed projects and the planned parking program for future development parcels. It also adjusted the previously designed three levels of below-grade parking with the H parcel to two levels which was included in the Commission's 35 percent design review of the H parcel development. The square footage chart and the phasing plan is also updated to reflect the revised totals in each phase, which are consistent with as-built conditions. And overall, Staff recommends approval of the third amendment to the revised master plan for the Southeast Federal Center.'",
        "'MS. FREE': 'This concludes my presentation and I am available to answer any questions along with ` 158 Shelly Jones and Brett Banks from the General Services Administration, and Toby Millman from Brookfield Properties, who are also available for your questions.'",
        "'VICE CHAIR DIXON': ' We have one person to speak. Patricia Haney would like to speak, she's one of our witnesses, is she with us?'",
        "'MS. HANEY': ' Hello.'",
        "'VICE CHAIR DIXON': ' You have I think three minutes.'",
        "'MS. KOSTER': ' She has five minutes if she's representing the organization.'",
        "'MS. HANEY': 'Thank you. Good afternoon, Members of the Commission, my name is Patricia Haney and I am a researcher with Unite Here Local 25. Our union represents about 6500 hospitality workers in the region, many of whom are hotel and restaurant workers here in D.C. NCPC's legacy plan states that jobs, transportation, and housing are among ` 159 Washington's most urgent social and economic problems, and if the Legacy Plan is no more than a technical exercise, it must help the city solve them. Our union agrees with this sentiment and as D.C.'s economy recovers from the COVID-19 pandemic, we believe it is vital that any new development creates good jobs and affordable housing that allow hospitality and service workers to not only survive but thrive in D.C.'s economy. The ongoing development of the Yards as the Southeast Federal Center site has the potential to bring a diversity of new jobs'",
        "'MS. HANEY': 'to the District, including the potential for new hospitality and service industry jobs. It is critical that these jobs are good jobs so that workers can afford to live, work, and play within their communities, a sentiment that is not currently a reality for many working people in D.C. The National Low Income Housing ` 160 Coalition's 2021 annual report shows that the hourly wage necessary to afford a two-bedroom apartment in Washington D.C. is $33.94, however, the median hourly wage for hospitality and service worker falls far below that in the region. Housekeepers in the area make a median hourly wage of $14.53 and food service workers make $14.50. D.C. workers need commitments to bring good hospitality and other service industry jobs to our community. Along with jobs, this development has the potential to deliver additional dwelling units with the third amendment to the Southeast Federal Center revised master'",
        "'MS. HANEY': 'plan and NCPC's Legacy Plan states further that Washington must work for its residents and for the people who do business here. It must be clean, safe, attractive, and affordable. As Washington becomes less affordable for working people, we hope that affordable housing is a priority for any future ` 161 residential uses at this site. While we are not opposing the third amendment to the master plan before you today, our union believes it is critical to consider the conditions for future workers and housing affordability at every stage of the development process. In NCPC's equity action plan, the Commission acknowledges that agency outreach does not regularly reach and engage underserved communities. As a union of women, immigrants, people of color, and those who are regularly disenfranchised, we hope our comments today urge NCPC, the General Services Administration, and Brookfield Properties to prioritize the creation of good jobs and'",
        "'MS. HANEY': 'affordable housing in this next stage of the development and all future phases. Thank you for your time.'",
        "'VICE CHAIR DIXON': ' Thank you for your testimony. I wish you were around when I `  162 was doing this, when there was no union available to protect us a lot of years ago. Thank you for your input. With that, at this time we'll move to Commissioners to get their comments. I'm going to start with Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes, I'm going to defer to Toby Millman to respond to Ms. Haney's testimony because...well, it's complicated. But a lot of the issues that she raises, despite the citations which are all accurate, in the Legacy Plan the amendment provides -- it should open the door for all kinds of good things because it won't be in another office building. But I will defer to Mr. Millman, he is the Senior Vice President at Brookfield. Toby, would you like address some of her comments?'",
        "'MR. MILLMAN': 'Sure, thanks Commissioner Wright. My name is Toby Millman, ` 163 I'm the Senior Vice President for Development at Brookfield Properties. I definitely appreciate Ms. Haney's comments and frankly, I completely agree with the goal to provide dedicated affordable housing in the Yards and frankly, throughout the District. Brookfield has been very supportive of affordable housing initiatives consistently across the region. As many of you may be aware, all of the multi-family apartments that have been delivered in the Yards have provided 20 percent of their units as affordable, at 50 percent AMI. This has resulted in over 300 units of affordable housing to date in the Yards, that's almost three-quarters of all affordable housing delivered in the entire capitol and riverfront neighborhoods. So, we're batting way above our weight in our neighbors there. ` 164 Even without the A parcels, which is the subject of the amendment today, we'",
        "'MR. MILLMAN': 'are on track to deliver about 450 dedicated affordable housing units at full build-out of the yards. The amendment that's before you today, would provide the opportunity to deliver even more housing, which would in itself help address affordability by adding new housing supply, but would also be subject to the same affordability requirements as the rest of the Yards. So, that's affordable housing and I think we're frankly in a good place with that, and again, doing better than most of our peers in the Yards. As it relates to jobs, I'd say we have been meeting or exceeding our CBE employment requirements for construction jobs and since the inception of the project, Forest City put in place what is widely recognized as a really strong workforce development program that we carried forward that's been really ` 165 successful in matching local disadvantaged residents with permanent jobs. So, not'",
        "'MR. MILLMAN': 'just construction jobs but jobs that continue on in the neighborhood going forward. Of course, the details of all these developed plans will continue to be the subject of individual development applications that will be reviewed by NCPC and any other consulting parties as well as the D.C. Zoning Commission. So, we appreciate the consideration of the amendment by the Commission today.'",
        "'VICE CHAIR DIXON': ' Ms. Wright, you still have the floor if you want it.'",
        "'COMMISSIONER WRIGHT': ' I yield the floor.'",
        "'VICE CHAIR DIXON': ' Then we'll move to Commissioner Cash.'",
        "'COMMISSIONER CASH': ' No questions or comments, thanks.'",
        "'VICE CHAIR DIXON': ' Commissioner `  166 Davis?'",
        "'COMMISSIONER DAVIS': ' I have no questions or comments, thank you.'",
        "'VICE CHAIR DIXON': ' Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Thanks to the Staff for their presentation, no questions or comments.'",
        "'VICE CHAIR DIXON': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' No questions or comments from me, thanks.'",
        "'VICE CHAIR DIXON': ' And Commissioner May?'",
        "'P': ' No questions, no comments, and no cats in the background.'",
        "'VICE CHAIR DIXON': ' Next time maybe, you could borrow at least one maybe. Commissioner Argo? Is Commissioner Argo there?'",
        "'COMMISSIONER ARGO': ' I'm here with a muted mic, sorry. I don't have any comments, thank you. `  167'",
        "'VICE CHAIR DIXON': ' Commissioner Hewlett?'",
        "'COMMISSIONER HEWLETT': ' I agree, no comments or questions, thank you very much.'",
        "'VICE CHAIR DIXON': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' I appreciated the presentation and I have no questions, thank you.'",
        "'VICE CHAIR DIXON': ' I will look for a motion to move forward but I want to comment  168 that I think people do understand and appreciate the relationship between affordable housing and having employees near their work, a community that is diverse in levels of income and is also diverse in opportunities. So, I'm glad to hear that this project has taken that into consideration and we hope to have more affordable housing available which is very important, as I said, so employees can live where they work and be better employees in many ways.  169 ` With that I look for a motion to go forward?'",
        "'COMMISSIONER HEWLETT': ' I move  170 approval now.'",
        "'VICE CHAIR DIXON': ' Very good. With that I'll ask the Secretary to please confirm the motion and give us a vote count, please?'",
        "'MS. KOSTER': ' Thank you, I will say I missed the second on that, was there a second?'",
        "'COMMISSIONER ARGO': ' Second.'",
        "'MS. KOSTER': ' Duking it out, the motion was made by Commissioner Hewlett and the second by Commissioner Argo. And with that, Commissioner Cozart?  171'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner May?'",
        "'COMMISSIONER MAY': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Hewlett? `  172'",
        "'COMMISSIONER HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.  173'",
        "'MS. KOSTER': ' Vice Chair Dixon?'",
        "'VICE CHAIR DIXON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Cash?'",
        "'COMMISSIONER CASH': ' Yes.'",
        "'MS. KOSTER': ' And Commissioner Davis?'",
        "'COMMISSIONER DAVIS': ' Abstain.'",
        "'MS. KOSTER': ' Thank you, the motion has carried.'",
        "'VICE CHAIR DIXON': ' With that, this concludes our opening agenda and also concludes my first meeting to chair.  174 Thank you Staff for so much help, particularly you, Madam Secretary, and others and for the cooperation of my fellow Commissioners in putting my here and working with me through this first meeting that I had to do myself. `  175 Thank you all very much. Our next Commission meeting will be Thursday February 2, 2023 at 1:00 p.m. You all be good, bye for now.'"
    ]
}