{
    "1. COMMISSION ROLL CALL ": [
        "'MS. KOSTER': ' Certainly. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Here.'",
        "'MS. KOSTER': ' Thank you, Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Good afternoon.'",
        "'MS. KOSTER': ' Thank you.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I'm here.'",
        "'MS. KOSTER': ' Thank you. Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Here.'",
        "'MS. KOSTER': ' Thank you. Chair Goodmann?'",
        "'CHAIR GOODMANN': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Here.'",
        "'MS. KOSTER': ' Thank you, Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Dixon? Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Here.'",
        "'MS. KOSTER': ' Thank you. Commissioner Cash?'",
        "'MS. KOSTER': ' And Commissioner Davis?'",
        "'MS. KOSTER': ' And Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' Here.'",
        "'MS. KOSTER': ' I'll note that Marcel Acosta, the Executive Director, Anne Schuyler, General Counsel, Diane Sullivan with the Urban Design and Plan Review Division, and Elizabeth Miller with Physical Planning are also in the meeting.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you, Ms. Koster. In noting the presence of a quorum. I'd like to call the meeting to order. Today's meeting is being live streamed and will be available in a few days as a video on NCPC's website. If there's no objection, the agenda as posted is adopted, and the order of business. And now please join me as a short video clip, the Pledge of Allegiance, is played. (Pledge of allegiance.)'",
        "'CHAIR GOODMANN': ' Thank you. NCPC will continue to conduct its meetings online until the renovations in the Commission Chambers have been completed. I want to share how we will be conducting Commission business today. And following our staff presentations, and any other testimony, I will ask for motion and a second as appropriate. During Commission deliberations, will use the round robin format to ask each of a I the commissioners if they have any comments. During the deliberations, commissioners should be on video unless you are experiencing technical difficulties.'"
    ],
    "2. REPORT OF THE CHAIR ": [
        "'CHAIR GOODMANN': 'So, Agenda Item Number 2 is the report of the Chair, and I just want to say Happy New Year. And it's wonderful to see all of you here today. As staff noted, we have a fairly light agenda. I think Commissioner Wright, who has been here for many, many years and is our veteran, said that she's never seen an agenda this light. But we're excited to hear the presentations today. And I think as we consider the work of the Commission in the past year, I'm happy to let you know that the NCPC staff has recently released their 2023 year in review. It highlights the Beyond Granite program and also the Pennsylvania Avenue Initiative which we'll hear about again today. There are several other high profile projects that have been reviewed. And I encourage all of you to take a look at that. This has all been'",
        "'CHAIR GOODMANN': 'a reminder to me of how important the work is that we do. I know that the General Services Administrator, Robin Carnahan, by letter, has advised me that Elliot Doomes, PBS Commissioner, and Melanie Gilbert, were new Commission member alternates along with Mina Wright and Kristi Tunstall Williams. So I do want everyone to be aware of that.'"
    ],
    "3. REPORT OF THE EXECUTIVE DIRECTOR ": [
        "'CHAIR GOODMANN': 'And Agenda Item Number 3 is the report of the Executive Director, Mr. Marcel Acosta. Marcel?'",
        "'MR. ACOSTA': 'Thank you, Chair Goodmann, and Happy New Year. The public is invited to attend two upcoming meetings to discuss the updated comprehensive plan introduction chapter and submission guidelines which the Commission reviewed last month. An online meeting is scheduled for January 25th, and an in-person meeting on February 20th. Please visit our website to review the draft updates and to RSVP for the meeting. I also have two personnel announcements. Management and Program Analyst Cana Williams has been with the agency since 2016 and has recently accepted a position with the National Institutes of Health. We thank Cana for her service as our facilities and record manager over the past eight years and wish her the best of luck in her new role at NIH. After 22 years as Commission Graphic Designer, Paul Jutton has retired. Paul has made every NCPC plan, webpage, newsletter, and public event engaging and visually'",
        "'MR. ACOSTA': 'interesting. He developed our current logo and was the driving force behind the agency's recently launched online planning library and upcoming Centennial Exhibit which you'll learn about today. We'll certainly miss Paul and wish him all the best in his future endeavors. You do have my written report in your packet. I'm happy to answer your questions. Then, just by the way, in February we do expect a very busy meeting.'",
        "'CHAIR GOODMANN': ' Thank you, Mr. Acosta. Does anyone on the Commission have a question for Mr. Acosta?'"
    ],
    "4. LEGISLATIVE UPDATE ": [
        "'CHAIR GOODMANN': 'Hearing none, we'll move on to Agenda Item Number 4, and that is the legislative update. Ms. Schuyler?'",
        "'MS. SCHUYLER': ' Thank you, Madam Chairman. And Happy New Year to you and members of the Commission. I do have nothing to report today.'",
        "'CHAIR GOODMANN': ' All right, any questions for Ms. Schuyler?'"
    ],
    "5. CONSENT CALENDAR ": [
        "'CHAIR GOODMANN': 'Hearing none, we'll move on to Agenda Item 5 which is the consent calendar. And there are two consent calendar items. The first is for approval of the final site and building plans for the multi-level parking garage at the National Institutes for Health in Bethesda, Maryland. The second is for approval of the final site and building plan at the Children's Inn renovation and expansion at 7 West Drive, Bethesda, also for the National Institute of Health. Do the Commissioners have any questions regarding either one of these projects at this time?'",
        "'COMMISSIONER DIXON': ' Move the approval.'",
        "'CHAIR GOODMANN': ' Very good, thank you for that motion, Commissioner Dixon.'",
        "'VICE CHAIR HEWLETT': ' Second.'",
        "'CHAIR GOODMANN': ' And second, thank you Vice Chair. Ms. Koster, could you confirm the motion and the second and take a vote, please, by roll call?'",
        "'MS. KOSTER': ' Certainly. The motion was made by Commissioner Dixon and seconded by Vice Chair Hewlett. With that, Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Yes.'",
        "'MS. KOSTER': ' Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes.'",
        "'MS. KOSTER': ' Vice Chair Hewlett?'",
        "'VICE CHAIR HEWLETT': ' Yes.'",
        "'MS. KOSTER': ' Chair Goodman?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' Yes.'",
        "'MS. KOSTER': ' Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' Yes. checking. Giachetti?'",
        "'MS. KOSTER': ' Thank you. Just double Commissioner Cash? And Commissioner'",
        "'COMMISSIONER GIACHETTI': ' Abstain. you very much.'",
        "'MS. KOSTER': ' Thank you.'",
        "'CHAIR GOODMANN': ' Okay, The motion has carried. well thank For the remainder of the agenda we will hear information presentations from staff.'"
    ],
    "6A. PENNSYLVANIA AVENUE INITIATIVE UPDATE": [
        "'CHAIR GOODMANN': 'Agenda Item Number 6A is an information presentation on the Pennsylvania Avenue Initiative. Mr. Jamawat, could you please proceed when you are ready?'",
        "'MR. JAMAWAT': ' All right. Let me share my screen. Can you see my screen?'",
        "'CHAIR GOODMANN': ' Yes.'",
        "'MR. JAMAWAT': ' All right. Chair Goodmann and Commission Members, the purpose of today's information presentation is to provide (Audio interference.)'",
        "'MS. KOSTER': ' Jeff, if you can, would you -- we did have some difficulty hearing you. So perhaps if you want, I'll ask Mr. Champ to pull up the slides for you, and then you can go ahead and give the presentation. Mr. Champ, if you can go ahead and do that, we'll give you a minute or two. Great, thank you. Looks good, see it. So Mr. Jamawat, I think go ahead and proceed. And we'll make sure that we can hear you during your presentation.'",
        "'MR. JAMAWAT': 'Thank you very much. Good afternoon, Chair Goodman and Commission members. The purpose of today's information presentation is to provide an update on the Pennsylvania Avenue Initiative. Next slide, please. The project area is a 1.2-mile segment of Pennsylvania Avenue between the White House and the U.S. Capitol encompassing about 40 acres of adjoining public spaces, adjacent blocks, and intersecting streets. Guided by the 1974 plan, the study area has complex jurisdictional structure with several federal and District agencies responsible for different aspects of the corridor. In 2023, NCPC worked with GSA to secure the funding and enter into a partnership with the Park Service, District government, the Downtown D.C. Business Improvement District, and Events DC to prepare the Pennsylvania Avenue plan. Next slide. In 2018, the Executive Committee published their findings and strategic action plan outlining the near, medium, and long term activities to prepare the new plan. The'",
        "'MR. JAMAWAT': 'findings were the outcome of several foundational studies. The Committee's work led to several catalytic actions, and after consulting with a multi-disciplinary panel of experts, the Committee agreed on the new vision for the avenue. This direction was reinforced by the District ULI report in 2020 that underscored how investment in public space and civic infrastructure can help spur economic activities and revitalize downtown post-COVID. In fact, we're just so delighted that the Mayor incorporated Pennsylvania Avenue into her economic development strategy for the District, including the forthcoming Downtown Action Plan. Next slide. Federal and local stakeholders agree on a new vision that the avenue should be a beautiful street designed for people first. And the highest and best use is the avenue as a venue, elevated as America's stage for events of national and global significance. These new events will supplement the existing local and regional events on Pennsylvania'",
        "'MR. JAMAWAT': 'Avenue today. Also the avenue can help reduce over-programming at the National Mall by hosting events that are more appropriate for its urban character, as well as bringing events and a critical mass of tourists closer to downtown. Next slide. The partner agencies also agreed that the avenue needs to be a better street for daily life, a destination that prioritizes pedestrian, bike, and transit with more comfortable and engaging public spaces for people to enjoy every day, all day, and into the evening. Next slide. As a reminder, in 2022 the Commission released a vision and three early concepts for public comments by the end of the four and a half months comment period. NCPC received over 450 comments. We also hosted public meetings and met one on one with a range of stakeholders, including in-person events on the avenue. We learned from each engagement that people are motivated,'",
        "'MR. JAMAWAT': 'inspired, and are very excited about the future of Pennsylvania Avenue. Next slide. On behalf of the project partners, NCPC is seeking two consultant teams through two separate RFPS to develop critical components of the new plan. The first RFP was issued in September and focuses on the Implementation Program. The consultant will develop the program of requirements for special events, perform economic analysis, and develop the business case for the new vision, and recommend a new stewardship entity to administer, operate, maintain the Avenue which is critical to the long term success. The proposals are being evaluated by the selection panel comprising representatives from each partner agency. The second RFP was published in December and focuses on physical design of the corridor and public spaces, as well as infrastructure improvement to realize a vision of the Avenue as a venue and a great public space for everyday use. The'",
        "'MR. JAMAWAT': 'proposals are due on Friday, March 1st. And we anticipate a large number of submissions that will inform the selection time line. Next slide. This slide provides an outline of the tasks in each RFP leading up to the Commission review and agency approval of the new plan in Task 7. As you can see, the seven tasks are similar for each team, the IP Team focusing on the tasks in blue and the Design Team focusing on tasks in green. This work will require close coordination among subject matter experts that represents both core disciplines. And by splitting the RFP into two pieces, we are able to maximize the expertise required to execute a comprehensive scope of work. Both teams will collaborate and coordinate their work intuitively through different phases of the project. Staff will return to the Commission later this year to share more detail on the selected'",
        "'MR. JAMAWAT': 'consultant team and their work plan. Next slide. Looking ahead at the time line, we are in the middle of the procurement period noted in yellow. We anticipate starting work with the first consultant team in February and the second team in early summer when we brief the Commission on the work plan. The first step is to build on the three early concepts and public comments received and to continue meeting with stakeholders to refine these concepts. This will be the basis to initiate NEPA and Section 106 in 2025, at which time the public will have multiple opportunities to provide input on the concept design activity. Our goal is to present the new plan to the Commission for review in 2026, the year of America's 250th anniversary. And once approved, certain aspects of the new plan will require legislative action before implementation. While the plan is under development,'",
        "'MR. JAMAWAT': 'the partners are also interested in learning from the fun and inspirational demonstration events taking place on the avenue, next slide, for example, the Capital Pride Festival in June and Walk with Amal in September. We are also working with Destination DC and Park Service to advocate for special events on the avenue in 2026. This concludes my presentation. I will stay on to take any questions.'",
        "'CHAIR GOODMANN': ' Thank you very much, Mr. Jamawat. We appreciate that are there questions from any Commissioners? Any questions? Well, hearing none, then I'm going to start the discussion in round robin fashion. And we begin with Commissioner Mina Wright.'",
        "'COMMISSIONER WRIGHT': ' Oh, I didn't know you were going to do that. I don't --(Laughter.) 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22'",
        "'COMMISSIONER WRIGHT': ' Gosh, what a long strange trip it's been. It does feel like we've been at this for a long time, and I'm very sorry that I won't be here to see it come to fruition. But I have every faith in the team and in getting this done. I did not know, however, that the Mayor had included it in her economic development plan or, I don't know, maybe I garbled that, Jeff. What was the plan that she included it in?'",
        "'MR. JAMAWAT': ' The Comeback Plan and the Downtown Action Plan.'",
        "'COMMISSIONER WRIGHT': ' Oh, yes. Okay. There are so many plans afoot that I get confused about which is which. But in any event, I understand that responses to an RFP are forthcoming. And I can't wait to see what happens next.'",
        "'CHAIR GOODMANN': ' Very good. Okay, and next on the list, I'm sorry, is Commissioner Dixon.'",
        "'COMMISSIONER DIXON': ' Fine, thank you. The presentation, it's very exciting to see this happen. And I was on the first Pennsylvania Avenue Development Plan thirty years ago. So this, I think, it's good to see this change. I can't wait to see what they're going to come up with. Thanks for the presentation, well done.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cash is not here, I presume.'",
        "'MS. KOSTER': ' That's correct, neither is Commissioner Davis.'",
        "'CHAIR GOODMANN': ' Okay. Then Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' I have no comments, thank you very much.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Giachetti. Commissioner Cozart?'",
        "'COMMISSIONER COZART': 'Good afternoon, and Happy New Year to everyone. Appreciate the presentation and even more appreciate the great collaboration and partnership with NCPC about this. And yes, this was included in the Mayor's Comeback Plan which you can think of as kind of a comprehensive economic development strategy of sorts. For the next five years, it takes care of the whole diamond of the District. And then the Downtown Action Plan is really the one that's focused most exclusively on our downtown. So excited about particularly the energy and the visualizations that have been so strong. I'm excited about having additional consulting help for NCPC to strengthen those even more. Because in many ways, for the downtown, what's necessary is those visualizations that really help people think about what could be, what we can manifest, that kind of things. So thank you all for the good work, the partnership, I'm looking'",
        "'COMMISSIONER COZART': 'forward to what's ahead and what's in store.'",
        "'CHAIR GOODMANN': ' Thank you.'",
        "'COMMISSIONER COZART': ' I did have one question. Sorry, wrong section. If there's anything that the Commissioners can do to be supportive of this going forward, we'd be happy to know about that as well.'",
        "'CHAIR GOODMANN': ' Good question, thank you, Commissioner Cozart. Did you want Mr. Jamawat to respond to that now, or perhaps Director Acosta?'",
        "'COMMISSIONER COZART': ' However staff want to handle it is fine with me.'",
        "'CHAIR GOODMANN': ' Okay. That's good. Well then, I'll move along. And thank you, Commissioner Cozart. And we'll have Commissioner McMahon please respond?'",
        "'COMMISSIONER MCMAHON': ' Thanks, Chair Goodmann, and good afternoon, everybody. Not a whole lot of comments, a great presentation. And as Commissioner Cozart says it's a, you know, and Commissioner Mina, excuse me Commissioner Wright, a long-term effort here and continuously building on what we've done in the past. And I think using, obviously, the 250th Anniversary is a great lead in to try and get some work accomplished here, sooner than we typically do in this country of ours. thanks again.'",
        "'COMMISSIONER STIDHAM': ' Thank Commissioner McMahon. Thank you very much. Commissioner Stidham? So you,'",
        "'COMMISSIONER STIDHAM': ' Thank and happy new year. We are excited for the you, collaboration and to explore the possibilities for Pennsylvania Avenue with everyone, and look forward to the project moving forward as we convene throughout the new year.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Nothing much else to say except how wonderful it is to see the fruition that's coming here and the, you know, what appears to me to be a really superior collaborative effort to bring us to this point. involved. So kudos to all that were'",
        "'CHAIR GOODMANN': ' Thank Commissioner Argo. Commissioner Hewlett? you,'",
        "'VICE CHAIR HEWLETT': ' Yes. Thank you, Mr. Jamawat, for your presentation. I echo the sentiments of everyone who has already spoken. I just think it's exciting, and just fascinating, and can't wait. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. And Commissioner Green?'",
        "'COMMISSIONER GREEN': ' Thank you. Thank you for the presentation. I look forward to watching this project develop, and can't think of a more important street in America, and very much looking forward to the development. Thank you very much.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Green. And I just want to say and recognize the work of those Commissioners who have been here for a long time and have worked so hard on this, because I'm new. But it is an impressive project, and it was exciting today to hear about the progress that's been made on the signature project. And, you know, we have once in a lifetime opportunities to elevate our nation's most important street in this way and to be recognized worldwide. And, you know, coming from a relatively small town in the Midwest, main streets are critical to the vibrancy, and the life, and the future of a community. They are where our stories are told. And for those of us who live out here in the hinterlands, the main street, Pennsylvania Avenue is a place that's recognizable not just in our country but worldwide. And so I'",
        "'CHAIR GOODMANN': 'feel particularly honored to at least be coming in on the tail end this incredible project. I think what is probably more impressive than even the project itself is this partnership that has brought it to fruition. And, again, something we learn in small towns, in large communities, and even in the nation's capital, is that partnership is the way of the future. We have to do this to survive. And I just am edified by the group that has been working on this and the leadership that has been provided, not just by, you know, other agencies and departments but by pushing it along by the NCPC staff who have worked hard on this. So I just want to recognize them and thank them. So now we're moving to this juncture where the consultants will on board, and we will continue to contribute to the shaping of this plan.'",
        "'CHAIR GOODMANN': 'I am also very pleased that the Mayor has included this in the downtown economic development -- economic health plan and also the DC Comeback Plan. I mean, I think this is just a wonderful, wonderful example of partnership befitting the nation's main street. So just want to congratulate everyone on the work done here and also the GSA for helping to secure the funding for this work. And we look forward to a future update, so thank you very much. Are there any further comments or questions?'",
        "'COMMISSIONER WRIGHT': ' Yes, sorry. You sprung it on me, so I wasn't ready. (Laughter.)'",
        "'COMMISSIONER WRIGHT': 'I do have one thing to say, or a final plea to make. And the people who've been on the team for the last eight years are sick of listening to me say this. But if there's anything I've learned in 40 years it's that people are not necessarily good at, outside of our profession, people have a very difficult time imagining physical plans. So spend some money, not just on, you know, Revit drawings or the like, hire yourself a really good artist who can do some beautiful watercolors, specifically, renderings to help people imagine what the avenue can be. It's just no better way to sell an idea. And people are shy about admitting that they can't read a plan, or a section, or what have you. So make it easy for them and really invest in the imagery. I think that's what sold some of the concepts'",
        "'COMMISSIONER WRIGHT': 'when we first got going with the three alternatives. And I think when you get to a detailed plan, a buildable plan, I mean, okay, it's not going to be built overnight, but the legacy of this plan needs to be illustrated in some really elegant, beautiful pieces that one day might be in the history books just like the McMillan Plan and its brethren. So that's it. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you very much, I couldn't agree with you more. Are there any other comments from any Commissioners?'"
    ],
    "6B. POLLINATOR BEST PRACTICES RESOURCE GUIDE": [
        "'CHAIR GOODMANN': 'No further comments, hearing no further comments, we're going to move on to our next agenda item which is 6B. And it's a presentation on the Pollinator Best Practices Resource Guide. Ms. Free is going to do the presentation, and I know that Ms. Sullivan will also be available to help answer questions at the conclusion if we have questions for staff. Thank you. you hear me'",
        "'MS. FREE': ' Great, thank you. and see my screen?'",
        "'CHAIR GOODMANN': ' Yes. Can'",
        "'MS. FREE': 'Thank you, great. Good afternoon, Chair Goodmann and Commissioners. The purpose of this information presentation is to brief the Commission on a new Pollinator Best Practices Resource Guide. The guide was developed by staff to clarify how NCPC incorporates plants that support pollinators and its review of proposed projects. The guide will be located on NCPC's website along with a number of other existing resource guides. Resource guides provide an overview of specific topics related to NCPC's authorities, comprehensive plan policies, and plan review processes for use by staff and applicants. I'd like to underscore that resource guides do not create any new standard, and they're not policy documents. As pollinator best practices, a resource guide is purely intended to clarify existing guidance as it relates to our plan review and bring existing best practices together in one place that can be referred to by applicants, staff, and the public.'",
        "'MS. FREE': 'As you are aware, NCPC reviews landscape plans as part of site and building plan submissions. There is a lot of existing guidance and similarity about the importance of native plant species, and their selection, and their benefits. But more recently we have heard a lot about including plants that support pollinators in landscape plans. So staff developed the Pollinator Best Practices Resource Guide to clarify how NCPC utilizes federal guidance to support pollinator habitats in its review. In this presentation I'll cover the resource guide topics which are listed here, and before I go into detail on what the guidance is I will speak about what pollinators are and why we need plants that support them. First a brief reminder of what a pollinator is and a little bit of plant biology 101. A pollinator is anything that helps to carry pollen from the male part of a flower'",
        "'MS. FREE': 'to the female part of the same flower or another flower. The movement of pollen must occur for the plant to produce fruit, leaves, and other young plants. Some plants are self-pollinated while many rely on external pollinators such as wind, water, or insects and animals for pollination. The focus of the resource guide in today's presentation are the best practices for selecting plants that support animal and insect pollinators, in particular, bees and monarch butterflies. But this also includes wasps, moths, birds, flies, and small mammals. Pollinators are extremely important for the health and longevity of the human and natural environment. For example, at least 75 percent of all flowering plants on earth are pollinated by insects and animals. This amounts to one in 1,200 food crops and 180,000 different types of plants that help to stabilize soil, clean the air, supply oxygen, and support wildlife. Despite how valuable'",
        "'MS. FREE': 'pollinators are, recent surveys have shown disturbing population declines in insect pollinator species across Europe and the United States. Beekeepers are losing an average of 40 percent of their managed European honey bee colonies every year. And Monarch butterflies have declined 85 percent in two decades. Overall the migrating Monarch populations are less than half the size they need to be to avoid extinction. The cause of pollinator decline is attributed to several factors: development of natural habitats fragments pollinator habitat; invasive plant species degrade natural habitats by reducing plant biodiversity; urban, suburban, and agricultural landscapes offer limited nesting sites; diseases, parasites, exposure to pesticides, and the changing climate are all reasons for their decline. In 2014, President Obama issued a presidential memorandum titled Creating a Strategy to Promote the Health of Honey Bees and Other Pollinators, which established the Pollinator Health Task Force who was charged with developing a'",
        "'MS. FREE': 'national strategy to promote the health of honey bees and other pollinators. Federal agencies used this guidance to establish their own policies to support pollinators. This includes a joint effort between GSA and CEQ titled Supporting the Health of Honeybees and other Pollinators, and then USDA's Field Office Technical Guidance on Conservation Planting and Wildflower Habitat Establishment. NCPC defers to these resources for the best practices when selecting plants that support pollinator habitats. The Federal Environment element of the Comprehensive Plan for the National Capital also includes policy guidance to include the introduction of plants that support pollinator species. So with this federal guidance in hand the Resource Guide provides an outline of what NCPC can do in its plan and project review and what agencies can so as plan preparers to support pollinators. And simply put, we can plant more plants that support pollinators. A healthy pollinator habitat consists'",
        "'MS. FREE': 'of plants that will provide food, primarily in the form of pollen or nectar, shelter, nest eggs and materials, and/or larval hosts for pollinators, animals and insects. As I mentioned, we already talk a good bit about native plants in our reviews. And I wanted to take a moment point out that there is a lot of overlap between native plants and plants that are good for pollinators. Native plants are species that evolved and occur naturally in a particular region. Many of them have co-evolved with pollinators like bees and butterflies since many plants and pollinators rely on each other for survival. Herbaceous flowering plants like the Purple Coneflower often come to mind when one thinks about a pollinator plant. And flowering plants like this are very important for pollinators, because they produce nectar which is a pollinator food. However, native plants that support pollinators can also be trees,'",
        "'MS. FREE': 'shrubs, perennials, vines, ground covers, grasses, sedges, and other uses. They provide some other benefits that I mentioned, like shelter, nest eggs, and larval hosts. On this slide here we have a few images of native trees and shrubs that are popular hosts for butterfly and moth caterpillars in this region. That includes oak trees, maples, birches, and poplars. One native pollinator-friendly plant that we have heard a lot about recently is milkweed. Milkweed is critically important, because it is the only plant species that Monarch caterpillars can eat. Therefore, without it the Monarch butterflies would go extinct. The Monarch butterflies are important pollinators. They are the only butterfly species that completes the two-way migration across North America every year and play a critical part in sustaining ecosystems along the way. There are over 100 different species of milkweeds that are considered native to North America, one of which stands'",
        "'MS. FREE': 'out, Asclepias syriaca, or common milkweed. According to the U.S. Forest Service, common milkweed is nature's mega food market for insects. The Forest Service goes on to say that it is among the most important food plants for Monarch caterpillars. It has even been identified by the Xerces Society as a priority species for Monarch habitat restoration in the Mid-Atlantic. Studies demonstrate that Monarch butterflies lay more eggs in total when a diversity of milkweeds are present than when compared the presence of a single species alone. They further suggest that planting the right milkweed species for the site has massive impacts on the quality of milkweed plants which influences where the Monarchs choose to lay their eggs. Therefore, the Resource Guide recommends that a diversity of milkweed species, including common milkweed, should be planted on federal landscapes as appropriate for the site conditions. We also see a lot of'",
        "'MS. FREE': 'native grasses and sedges proposed on plans which are often overlooked when it comes to pollinator benefits, because they are wind pollinated, and they do not produce nectar. However, these native species serve an important role in pollinator habitats. They provide larval hosts and food, nesting materials and structure, and suppress weeds. Their bunching habit and extensive root systems also slow storm water, reduce erosion, and sequester carbon. And in addition, they support other wildlife habitats for birds and small mammals. And here we have an example of four native grass species that are larval hosts for skipper butterflies and for the nesting materials and structure for native bees. They also serve as the foundation for a designed plant community with texture, structure, and seasonal interest. Sedges, or Carex species, are another type of native plant that are packed with environmental benefits. Some provide pollen or larval hosts for pollinators.'",
        "'MS. FREE': 'Birds and small animals eat the seeds, and butterfly and moth caterpillars enjoy the leaves. Sedges also provide habitat value to invertebrates, reptiles, and amphibians, and are very adaptable. They are very adaptable plants for storm water management. Many can even be mown and used in place of turf grass as seen here in the top image. On the bottom image here, we have a rendering from the National Desert Shield and Desert Storm Memorial final submission which was reviewed by the Commission in December of 2022. A native Carex is proposed on the back side of the dune-like berms. So in this next section of the presentation I'll briefly summarize the best practices for selecting plants that benefit the pollinators, and both meadow and mound meadow are designed landscapes. Sometimes we see meadow landscapes on plans which are largely fields that are dominated by wild flowers and grasses. But'",
        "'MS. FREE': 'more often, we are reviewing designed landscapes which includes cultural or commemorative landscapes, gathering spaces, and recreation areas. Here we have a planting diagram plan from the Bureau of Engraving and Printing project which has naturalized pollinator meadows around the periphery of the site. Designed landscapes, basically like seating areas and bio-retention, are proposed closer to the building and in the parking areas, many of which are dominated by trees, shrubs, perennials, and grasses that benefit pollinators. For meadow landscapes, the Resource Guide summarizes guidance from the USDA's 2022 Maryland Conservation Planting Guide and 2023 Maryland Wildflower Habitat Establishment Guide. This guidance recommends that meadows consist of 100 percent native plant species with 85 to 90 percent wild flowers and 10 to 15 percent grasses. In a meadow where Monarch butterfly habitat is the primary purpose, at least one and a half percent native milkweed should be planted as food'",
        "'MS. FREE': 'for the caterpillars, and 60 percent of the wild flowers planted should be species that can provide nectar for the butterflies. It also recommends that at least three plant species from each bloom period, that being spring, summer, and fall, are specified to provide consistent and adequate resources throughout the growing season. For non-meadow and designed landscapes, the Resource Guide lists recommendations on supporting the health of honey bees and other pollinators. Here we have an example of a designed landscape, the Constitution Gardens Rehabilitation Project, where such best practices would apply in NCPC's review. Here best practices include choosing plants native to the project's eco-region; selecting the right plant for the site; the use of some non-native plants, as long as they're not invasive; selecting at least three plant species from each bloom period; considering all types of plants, such as trees, shrubs, perennials, and grasses; responsible seed acquisition;'",
        "'MS. FREE': 'and taking care when selecting cultivars. The Resource Guide also acknowledges that NCPC must balance the need to maintain historic, cultural, or commemorative significance with the demands for ecological sustainability. Here we have an example of a recently reviewed project, the Resilience Project at the U.S. Department of Homeland Security Headquarters. But the proposed landscape plan did not include milkweed, because milkweed was not identified in the site's cultural landscape report. However, 50 percent of the plant material proposed provides other pollinator benefits consisting of native trees, sedges, shrubs, and perennials, with at least nine different plant species for each growing period. So overall, the primary takeaway from the Resource Guide is that biodiversity is key to healthy pollinator habitats. Biodiversity is important to any healthy ecosystem. It provides resiliency in the event that a pest or disease, or climate changes develop that are detrimental to a specific species. A'",
        "'MS. FREE': 'healthy pollinator habitat will provide food and shelter, larval host nesting materials or sites, which may be provided by a diversity of plant types. Native flowering plants are especially important as they produce nectar which attracts pollinators and encourages pollination. And as discussed, common milkweed and other native milkweed should be planted to the fullest extent possible, and as appropriate for the site, to support Monarch caterpillars and butterflies who are critically important pollinators. The Resource Guide includes citations throughout its text from credible resources such as the Penn State Extension and other state university research centers, the Xerces Society, the National Park Service, and the U.S. Forest Service, amongst others. It also includes a section on additional applicant resources, many of which are listed here with links to federal documents, recommended plant lists and mixtures, and studies on this topic. And though information presentations are not available for public'",
        "'MS. FREE': 'comment, staff has completed outreach with particularly interested parties, including individuals who have signed up to speak about supporting pollinators at Commission meetings. We did not receive any substantial comments and therefore hope the individuals will address any concerns and incorporate their comments into the guide. So this concludes my presentation. I thank you for your time, and I am available to answer any questions.'",
        "'CHAIR GOODMANN': ' Thank you very much, Ms. Free, we appreciate the excellent presentation. Do Commissioners have any questions at this time? Do Commissioners have any questions? Well, hearing none, we're going to move on then to Commission discussion. And if you would, if you haven't turned on your camera, please do. And I'm going to begin with Vice Chair Hewlett, if you could please share your thoughts on this presentation.'",
        "'VICE CHAIR HEWLETT': ' Yes, thank you, Madam Chair. I first of all would like to thank you, Ms. Free, for the presentation and also for your diligence in working with all the interested parties. And it's very important, and you listened intently, and you embraced some of the suggestions that we've heard from others. And I can't thank you enough for that. I think this is exciting, it's important, and I learned a lot during this entire process. So thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. I would like to ask Commissioner Green to please share your thoughts.'",
        "'COMMISSIONER GREEN': ' Thank you very much for the presentation. It was terrific. And especially in light of some of the questions we've had at recent meetings, it will be really wonderful to have this, this great report at hand for all future process subjects. So thank you very much for your work on this.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Green. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': ' I don't have any comments, thank you.'",
        "'CHAIR GOODMANN': ' Thank you. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': ' I very much appreciate the report, and thank you very much. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you Commissioner Dixon. Commissioner Cash and Commissioner Davis, I will continue to move on, not seeing them present. Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' No comments, thank you very much.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Giachetti. Commissioner Cozart?'",
        "'COMMISSIONER COZART': ' Thank you to the staff for all their work on this, and for the presentation today.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cozart. Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Thanks, and thanks to the staff for the great reports today. More importantly, and as reflected, to just explain, there are two consent items, they were consent and not for presentation from NIH. Both had long sections in it to discuss their efforts to provide this kind of --(Simultaneous speaking.)'",
        "'COMMISSIONER MCMAHON': ' --environment for butterflies. So obviously the work they're doing with everybody who does work in the national capital region that comes to NCPC is listening. So I congratulate them and look forward to seeing more of these in the future.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you, Commissioner McMahon. And Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' Thank you for the presentation. We were able to review and provide some comments. And I understand this is to be a living document, which I think is great, because I think that things will evolve as time goes on, especially with the fact that the monarch --(Audio interference.)'",
        "'MS. KOSTER': ' So Commissioner Stidham (Simultaneous speaking.) (Audio interference.)'",
        "'COMMISSIONER STIDHAM': ' Am I back?'",
        "'MS. KOSTER': ' Yes, you're back.'",
        "'COMMISSIONER STIDHAM': ' I think it's important as other federal agencies develop their strategies based on that main strategy, that we include that on the guidelines to be sure that we're covering all our bases and that this is a guide and it's used as we review these projects. So thank you for your work on this.'",
        "'CHAIR GOODMANN': ' Thank you. Thank you Commissioner Stidham. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' I think it is really, really interesting and exciting thinking about the possibility. And the one thought, I don't want to take up time on this now, but is how I'm thinking about it, how we trickle down some of this information to really -- I live in Washington, D.C., talking about the, you know, literally getting information down at the neighborhood, you know, almost the ANC levels. It could, I think, it is great information for people to have, especially as they think about work that's being done on their own property, as well as properties in their neighborhoods. Thank you.'",
        "'CHAIR GOODMANN': 'Thank you, Commissioner Argo. And I'll just add a few remarks. I just want to, again, thank the staff for the good work that's been done on this, and thank the public that has come and consistently brought this to the attention of the NCPC. I think that their contributions help, you know, influence our work oftentimes. Although this has been established work by the federal government, it still is good to hear from people about it. This is wonderful work, and I think it reminds us that, you know, we live in an interconnected world, and our interconnectedness relies on mutual respect, if you will. And I know that all of these projects and programs that we are seeing will have landscaping. And there are things that we don't even measure yet. But the impact on workforce, and on people who visit and work in these environments, you know,'",
        "'CHAIR GOODMANN': 'there's a lot of benefit from just being around national environments, not to mention the benefits to the pollinators and all the rest of the birds and the bees. So I do appreciate this presentation, and it will be incredibly helpful to our applicants as they come before us. And thank you, Commissioner McMahon, for pointing out the important projects that were in the consent agenda that included aspects of this landscape, so thank you, and landscape guidance. So thank you very much. And are there any additional questions for Ms. Free?'"
    ],
    "6C. NCPC 2024 CENTENNIAL ": [
        "'CHAIR GOODMANN': 'Hearing none, the last agenda item today is the information presentation on NCPC's Centennial. And Ms. Mezghebe will be making the presentation. Are you ready?'",
        "'MS. MEZGHEBE': ' I am, can you all see me, can you hear me?'",
        "'CHAIR GOODMANN': ' Yes, we can see and hear you. Thank you.'",
        "'MS. MEZGHEBE': ' Okay, wonderful. I'll get started. Good afternoon, Commissioners. 2024 is full swing, and NCPC turns the big 100 this year. We are all very excited about that. And I'm excited to share an overview of how we'll be celebrating this amazing milestone. Our staff has put together a range of exciting and thoughtful products and events. Before I present them to you, I'd like to first share some reflections from former chairs and commissioners on their aspirations for Washington and the region that we gathered as part of our Centennial Oral History Project. Please enjoy these reflections and I'll resume the presentation right after. (Video played.)'",
        "'MS. MEZGHEBE': ' Great, I'm just going to share my screen. Thank you, Tony. Okay, can you all see my screen? (Chorus of yes.)'",
        "'MS. MEZGHEBE': 'Wonderful. So I hope you enjoyed hearing from some of your predecessors. This quote stems from former chair Libby Rowe that you see up on the slide, also captures NCPC's awesome responsibility in the region over the past 100 years and into the future. It's been hard virtually. We wish you were all in person for all of us so the staff could be able to communicate how excited we are to celebrate this, to celebrate our centennial. But we've kept this sentiment center of mind as we have conceptualized how to commemorate this milestone. And I'll go ahead and walk you through. When considering our agency's history, we organized it into three time periods characterized by key Congressional acts that established or affected the agencies' authority and duties. In 1924, Congress established the National Capital Park Commission, which later became the National Capital Park and Planning Commission, to acquire'",
        "'MS. MEZGHEBE': 'park land, preserve the natural scenery, and prevent pollution of Rock Creek Park and our rivers. In 1962, the National Capital Planning Act gave NCPC its current name and the authority to plan for all of Washington, both local and federal. And Home Rule, in 1974, established a unique shared system of planning between the District and NCPC. Our centennial offers a unique opportunity to reflect on this history. More than that, it also offers a chance to examine the evolution of planning in Washington and the region, acknowledge inequities created by past planning practices, and consider lessons learned to inform planning today and into the future. Our staff has planned a variety of ways to engage diverse audiences on NCPC's historic role in the region's planning. We are kicking things off with an online event, called One Night, 100 Years, on the evening of January 23rd. We're inviting six'",
        "'MS. MEZGHEBE': 'thought provoking professionals, who you can see listed here, to discuss a transformational plan developed by NCPC and its impact on the region. Our speakers were asked to choose from our new online planning library which we developed for the Centennial and that I'll introduce shortly. This event will be a fun, fast round of presentations with diverse view points, and we encourage you all to attend. Here we look at some of our other events that we have planned for the year to engage audiences generally interested in the region, as well as other members of the public with professional and academic interests in planning and our agency. In April at the D.C. History Conference, we'll explore the complicated legacy of a former NCPC chair, Harland Bartholomew, a national planning pioneer and also a proponent of efforts that resulted in institutionalized segregation and racialized displacement. In May, at the'",
        "'MS. MEZGHEBE': 'American Planning Association's Federal Planning Division conference, we'll explore the impact of federal planning in the capital city and the region. On June 6th, which is the actual day of our Centennial, we'll launch our physical exhibit, which I'll describe shortly, at the Martin Luther King Jr. Library with a speaker event. And the conversation will focus on the years from 1952 to '74 where debates in Washington about transportation, urban renewal, and civic engagements shaped the form of Washington and mirrored this broader national conversation. And in September at the APA's National Capital Area Chapter Conference, we'll close out the year with a reflective panel discussion on how past planning practices have shaped the region, lessons learned, and pathways for the future. And in addition to our events, I am really excited to introduce our online planning library which is a collection of influential plans, legislation, and maps with'",
        "'MS. MEZGHEBE': 'an emphasis on the maps that shaped the region's development, with an emphasis on items from 1924 to 1974. We developed this resource with the D.C. Office of Planning into our shared planning history up until 1974. The library is designed to be an evergreen resource accessible to the public. At great effort, staff members identified 300-plus items, and the library currently houses over 100 items. As staff continued to conduct research on various projects, we will be updating current entries and adding new ones. Staff also worked diligently to develop a robust library application that features easy navigation, filters, sorting, and a key word search. We've soft launched the library and gotten really positive feedback on its usability and catalogue. We encourage you to browse the library and we look forward to hearing more from you and the public about this great tool. I'll just walk you through an'",
        "'MS. MEZGHEBE': 'example of what you can find in the library. Here's the entry for a policy plan for the new year, excuse me, A Policy Plan for the Year 2000, the Nation's Capital developed in 1961 by NCPC, and the National Regional Planning Council. The viewer will find a description of the plan which you can see the region being defined by wedges and corridors of open space and development. Each entry has a carousel of images including this one. So this entry, which shows how corridors would comprise a development hub linked by a rapid mass transit route and paralleled highway. There is also a link to a Washington Post News article about the plan and, of course, a link to download the plan. There's lots more great material in the library and you are encouraged to check it out. In partnership with the D.C. Public Library, NCPC is preparing'",
        "'MS. MEZGHEBE': 'exhibits to share stories from the past 100 years with the emphasis on the first 50 years of the agency's history leading up to Home Rule. The physical exhibit will first be displayed at Martin Luther King Jr. Library in June of 2024 and then move to other neighborhood libraries. A companion digital exhibit will allow visitors a deeper dive into the scenes and stories presented in the physical exhibit. The exhibit will explore NCPC's early years which include the agency's role in creating the region's incredible park system and open spaces. Washington was also a proving ground and laboratory for ideas about modern planning including zoning, comprehensive plans, and the big ideas that led to highways and urban renewal in the new century. A key proponent of these ideas was Harland Bartholomew, a national planning pioneer and former NCPC chair, whose legacy will also be explored in some of'",
        "'MS. MEZGHEBE': 'our events. The exhibits will confront the consequences of these planning efforts, including displacement, often of African American communities, and sprawl. There was community opposition to many of these top-down sweeping plans. The Commission reflected this struggle with a slow turn towards mass transit and historic preservation. Former NCPC Chair Libby Rowe was a champion of this evolution and planning. Lastly, the exhibits will explore how planning became a shared responsibility with the District following Home Rule and how the Commission took on new and evolving issues and is still trying to achieve the balance between local and federal interests. As you can see, there is lots that will be unpacked in the exhibits. The final product I'll describe is our oral history project. As you saw from the video clip at the start of my presentation, we conducted oral history interviews with former chairs, commissioners, and staff regarding their'",
        "'MS. MEZGHEBE': 'experiences and reflections on working with the commission. These oral histories will serve as critical resources for future generations to better understand the unique history and evolution of planning in the nation's capital. The public will be able to browse the complete transcript housed on our centennial website, and we're also creating additional compilation video clips with highlights from certain interviews. We'll share them with the public throughout the year. We're promoting the centennial and engaging the public through social media campaigns, our beloved Field Notes, and appearances at popular events. And we invite you to visit the centennial website to access all of our offerings, including the planning library and oral histories, and stay up to date on all of our events. That concludes my presentation, and I'm happy to answer any questions.'",
        "'CHAIR GOODMANN': ' Thank you very much, Ms. Mezghebe, and appreciate all the work that's going into this. And I will now ask the Commissioners if they have any questions. Hearing none, we'll go ahead and begin discussion using round robin format. I'm going to begin with Commissioner Cozart, please.'",
        "'COMMISSIONER COZART': ' You know, like the other Commissioners when you first call on them, I'm not ready. But here I am, and thank you all. This is an impressive lineup, and I'm excited to get a chance to kind of reflect. And this may be a way for us to continue to get more people interested and involved in the work of the Commission. So appreciate the thoughtfulness about it, the breadth of offerings, and excited to engage with you on as many of them as possible. So thank you for your great work on this, and I'm glad that we're making time for this, this look back and look ahead.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Cozart. I appreciate your comments and your willingness to be first. I will say, I just have to footnote this, we all have Ms. Koster to thank for the order of these discussion plans. I threw her under the bus. I apologize. But anyway, it's a new year, so I had to reveal that secret. Anyway, Commissioner McMahon?'",
        "'COMMISSIONER MCMAHON': ' Well, I'm glad to volunteer to be number two. (Laughter.)'",
        "'COMMISSIONER MCMAHON': ' But thank you. No, a great presentation and looking forward to interesting year of looking back and looking forward for NCPC let by the staff. They've done great work.'",
        "'CHAIR GOODMANN': ' Thank you very much. Commissioner Stidham?'",
        "'COMMISSIONER STIDHAM': ' I think this work is just great. I mean, the Commission has been around and done so much over the years, and I think that gets lost over time. I had the opportunity over the holidays, you know, to just look at the website and the compilation of the materials, the old plans, old documents, a few things I've been looking for myself, actually. So that was a huge task to pull all that together, and putting it into a timeline is just amazing work. So great work, and I look forward to the celebration to come.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Stidham. Commissioner Argo?'",
        "'COMMISSIONER ARGO': ' Yes, I echo all the compliments that we've heard. And I know personally it makes me want to dive deeper into some of the things that we've heard about today just, you know, as a Commission member, as a long-time District resident, and to take -- and to think about some of the additional kind of practical applications to some of the things that have been presented to us and how we share some of them also more broadly. So thank you, thank you for all the good work, staff. Thank you. That's it.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Argo. Thank you very much. And Vice Chair Hewlett, please?'",
        "'VICE CHAIR HEWLETT': ' Yes, I just want to thank you for the presentation as well. This is really an exciting time for us. And it's just to hear the history, just to -- and I too was -- my curiosity was piqued. So not only do we have the report that was sent, and I printed out, but it caused me to go back and look at some more. As a newbie on the Board, I mean, there's just so much more knowledge to acquire. And each time, you know, you stick your chest out a little bit further and further, because the Commission does so much. And it's important to preserve that history and to tell our story, to share that story so that everyone knows. So thank you so very much for all the work you're doing. And I just can't wait starting with January when we watched the presentation.'",
        "'CHAIR GOODMANN': ' Thank you, Vice Chair Hewlett. Thank you very much. And Commissioner Green, please?'",
        "'COMMISSIONER GREEN': ' Thank you very much. Now I look forward to these events this year. And this is going to be great experience. And thank you to the staff. I know it's been a lot of time and effort to pull these together. And I just really appreciate it and looking forward to it. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Green. Commissioner Wright?'",
        "'COMMISSIONER WRIGHT': 'Well, gosh, this is a huge opportunity to teach people what planning is about. Planning, this is heresy for this group, but people think planning is --and they don't understand it. And it sometimes is, let's face it. Some of it is pretty arcane, and pretty abstract. And we're not very good as humans at thinking temporally, in other words, far into the future. It becomes more and more abstract, just like your physical vision, right. Things are far away, you can't see details, it becomes quite blurry. And I think one of the things that really helps people to understand is negative examples. And by that I mean, you know, when you go to art school they teach you, at least where I went, they teach you to draw the negative space. It's a different way of showing people, of teaching artists how to look at things. So when'",
        "'COMMISSIONER WRIGHT': 'you're looking at a still life, you draw the air around it instead of the objects. Why am I going off in this direction? Because we have to teach people. This is a great opportunity to show them examples of what happens in the absence of planning. Because sometimes people just don't get the examples that you give them. See, there was this great plan, and it came about, and this is what NCPC did about it, or this is the role that NCPC played in it. I think some examples of what happens, what would happen were NCPC not to be around, were planning functions -- were planners to just drop of the face of the earth, what would happen, is a good way to illustrate why it's so important. People get what it is when something bad is happening in their neighborhood. We all know what NIMBY is'",
        "'COMMISSIONER WRIGHT': 'about. But in the larger picture, and in the composition of the city, I'm not sure that Joe Q citizen is all that familiar. So this is a huge opportunity to educate and, yes, a little self-serving, garner support for the Commission. And then I just want to make one more point. Because as I've been saying, I'm quite philosophical these days and reflective, and I think about will people in the future who have jobs like mine, and Commissioner McMahon's, and Commissioner Stidham's, the land owning agencies of the federal government are not always able or disposed to best practice, what we would call best practice in design and planning. And without a really healthy and robust ecosystem in design and planning in the District, or the DMV in broader terms, our jobs would be that much harder. And I think that the DOD and the Park Service might'",
        "'COMMISSIONER WRIGHT': 'agree with me. Sometimes I have to use the NCPC/CFA/SHPO ecosystem, the review and approval system, as a cudgel to beat my own colleagues into submission to do the right thing. So this is really, really important. And the centennial is a once in a lifetime opportunity to flex a little. And I encourage you to do that.'",
        "'CHAIR GOODMANN': ' Thank you very much, Commissioner Wright. Thank you. Commissioner Dixon?'",
        "'COMMISSIONER DIXON': 'First, thanks to staff for the hard work that they've done already and more that they'll be doing. I also apologize to them for not being able or having the time or capacity to review some of -- some of the stuff I said that would have been maybe useful if I had been able to do that. But that's all done, that's done. I'm also blessed and honored, or honored and blessed to have been part 30 years of the 100 years, and maybe more, on with the Commission and having known all of the speakers who a least spoke as former chairs, and others who did not speak. But I think it's just, it's great that they documented it. I believe we cannot, without looking back, we cannot move forward with vision in planning. We can't have vision in our planning if we don't look back with respect'",
        "'COMMISSIONER DIXON': 'to what's happened to get us here. I also think that this is a very significant statement of how we, as a very Home Rule-less community, have operated in a planning environment with the most powerful government in the world. And we've been able to come together in a planning operation that has respected those turfs, I think, in a very sensitive manner. I think that we've been able to do that. And I think that's a very, very powerful image, one that could be used in many places now across the globe where powerful forces can control small areas where people are somewhat Home Rule-less, as we have been. I say Home Rule-less, we have Home Rule, but we're still looking for a stronger form of it. So I thank them for the work. I'm looking forward to all this. Hopefully I'll be able to participate and see this'",
        "'COMMISSIONER DIXON': 'as it goes forward. And I will be, I'll be here. Thank you.'",
        "'CHAIR GOODMANN': ' Thank you, Commissioner Dixon. And Commissioner Giachetti?'",
        "'COMMISSIONER GIACHETTI': ' Thank you very much. You know, this is a very exciting opportunity, but no comments or questions from me. Thanks, everybody.'",
        "'CHAIR GOODMANN': 'Great, okay. Well, thank you, Commissioner Giachetti. And I just want to begin by, again, just thanking the staff. You know, when you think about the backbone of so many federal agencies, and some of what you all participate in and work for, you know the kind of work that goes into maintaining federal agencies, and staff, and departments, and all of the work. So I do want to just really congratulate the staff who have worked so hard on this. And I also want to thank, as a newbie, as Commissioner Green said, as a newbie, I want to thank the Commissioners who have been here for a long time, Commissioner Wright, Commissioner Dixon and others, Commissioner McMahon, others who have been here for many, many years, and also our partners from the District. You know, your leadership is important too, at least to me as a new chair.'",
        "'CHAIR GOODMANN': 'And I've spent much of the last year, you know, past is prologue, as Commissioner Dixon mentioned, and I've spent the last year reading a lot about McMillan, and a lot about L'Enfant, and the planning that went into this tremendous place we call our national capital. But now I'm looking forward to this year to be able to consume the products that our staff have created that bring the 20th century to light and demonstrate how, you know, folks just like us have worked hard to be consistent with that aspirational vision of America and of our national capital. And I do acknowledge, and we've learned a lot, we've learned about many of the inequities that have occurred through planning in the past. And we're working hard to, I think, amend those, to create capital and planning projects and programs of the future that are going to address those'",
        "'CHAIR GOODMANN': 'inequities and also keep the concept of beauty in mind that was part of the original design of this place. I also think we need to continue to keep an eye on the resiliency, the climate resiliency piece of this to make sure that what we're planning, and building, and protecting here is protected. So all of those things come to mind as I look forward to this year anniversary. But mostly I just want to thank staff and thank, you know, the Commissioners who have served for such a long time, and Commissioners who were here before us. And I'm looking forward to being part of the conversation with the public about this and talking about the challenges and the opportunities ahead. So I just want to thank you for the presentations today, all of you, and for a lovely new year, and a short meeting to begin the'",
        "'CHAIR GOODMANN': 'year. Because next month is going to be really an exciting, again, an exciting meeting in planning. But it'll be a little longer, I think. So hearing no other questions, does anyone have any more comments or questions before we conclude? This concludes our open session. And the next meeting will be on February 1st at 1:00 p.m. And I look forward to seeing all of you at that time. And if there's no further business, the meeting will stand adjourned.'"
    ]
}