{
    "Proclamation for the League of Women Voters 100th Anniversary Day.": [
        "'speaker_0': 'And we got one more proclamation, because this is also the 100th anniversary day for the League of Women Voters. And as I understand, Susan Hauser, Almeida, league president, is here to receive the proclamation. Any of you can come up to the podium.'",
        "'speaker_0': 'So, yeah, come on. Safety in numbers. Oh, no, we're friendly.'",
        "'speaker_8': 'Yes.'",
        "'speaker_0': 'You're right. You brought a cast out.'",
        "'speaker_2': 'It takes a village.'",
        "'speaker_0': 'It takes it does take a village. You're right. Okay. So for the League of Women Voters, whereas the League of Women Voters or the League was founded on February 14, 1920, as this is a, quote, mighty political experiment, close quote by the foremothers of the suffragist movement at the National American Women's Suffrage Association.'",
        "'speaker_0': 'And. Whereas, their goal was to help the 20 million women who were granted the right to vote by the 19th Amendment understand and carry out their new responsibility as voters. Whereas with the success of this effort and the tireless efforts over the last 100 years to strengthen and uphold its mission, to empower voters and defend democracy, the'",
        "'speaker_0': 'league has become a trusted, nonpartisan, grassroots organization. And. WHEREAS, the league has sponsored legislation and fought in the courts to protect and strengthen voting rights and access and for free and fair elections, civil rights, children, community health and education.'",
        "'speaker_0': 'And. Whereas, the League has consistently been noted for its nonpartisan election information, including sponsorship of candidate forums and information on state and local ballot issues, as well as its commitment to register, educate and mobilize voters. And. Whereas, the league champions government systems that are open, transparent, inclusive and equitable.'",
        "'speaker_0': 'And. Whereas, the League believes that active and engaged citizens, irrespective of gender, ethnicity or political affiliation, are the hallmark of democracy. Now, therefore, be it resolved that I Maryland, as he Ashcraft, mayor of the city of Alameda, do hereby proclaim February 14, 2020 as the League of Women Voters 100th anniversary day in the city of Alameda, we'",
        "'speaker_0': 'honor and congratulate the League of Women Voters on this auspicious occasion of its 100th anniversary and commend the League for its significant contribution contributions to empowering voters and making democracy work for all. Thank you so much for all your good work.'",
        "'speaker_0': 'And I just want to say quickly, Alameda is League of the League of Women Voters of Alameda is known throughout the state as being one of the strongest, most vibrant, active chapters in the state. And we're so lucky to have them here as elected officials.'",
        "'speaker_0': 'They keep us all on our toes about the various issues they'll do town halls or forums about, and they provide great information about and about ballot measures. And I have worked with them in the past to help register high school students, and we thank them for everything they do.'",
        "'speaker_0': 'So I miss Howser. Did you want to say a few words?'",
        "'speaker_8': 'I just wanted to say thank you to all of you. And this is an MC Carrigan, who is our vice administrative vice president. And here's Bill Smith, who is vice. He's on the board for the covering programs. And Anna Crane is our treasurer and Ken Werner over there is the in-charge of voter service.'",
        "'speaker_8': 'And Anna's husband Neil is here. He's a member also. And we're open to men and women.'",
        "'speaker_2': 'And we just first of all, again, want to thank you for this proclamation. We'd like to take this.'",
        "'speaker_9': 'Opportunity to.'",
        "'speaker_2': 'Invite, first of all, you and anyone here and listening to our yes to have a celebration that we're going to be having at Tucker's. And he.'",
        "'speaker_0': 'Would like ice cream.'",
        "'speaker_2': 'To.'",
        "'speaker_8': 'Go on February.'",
        "'speaker_2': '14th. Between two and five, we'll have lots.'",
        "'speaker_8': 'Of celebration and of course, ice cream cake. We would also like to invite everyone to visit our Web site, LW, the Alameda dot org where you can.'",
        "'speaker_2': 'Find great information about the league.'",
        "'speaker_8': 'The different forms we have and also we have fun social events and would like to.'",
        "'speaker_2': 'Have you join or become a member with upcoming.'",
        "'speaker_8': 'Elections voters. Edge is a wonderful place to get voter information, so we encourage all our all voters to take a look at that. And finally, in celebration of.'",
        "'speaker_2': 'Of 100 years, in.'",
        "'speaker_8': 'Appreciation for all of the work done by previous members of our organization, as well as those women who fought.'",
        "'speaker_2': 'Tirelessly for. Women to get the vote.'",
        "'speaker_8': 'We encourage those visiting our site to consider.'",
        "'speaker_2': 'Making a $100 contribution in celebration of the 100 years.'",
        "'speaker_0': 'Thank you. Thank you. Let me.'",
        "'speaker_2': 'Okay. Thank you so much.'",
        "'speaker_0': 'You. That was great.'",
        "'speaker_2': 'Good work.'",
        "'speaker_10': 'Thank you. Okay.'"
    ],
    "Vehicle Replacement Purchase Authorization from Various Vendors.": [
        "'speaker_1': 'See recommendation to authorize purchase of vehicles consistent with revised vehicle replacement policy, an amount not to exceed $227,404 with for some Lake Ford for 101.175 and from downtown for sales for 123,000 from National Auto Fleet Group. All right.'",
        "'speaker_0': 'Good evening. And be sure to get close enough to the microphone so that it picks you up.'",
        "'speaker_7': 'Good evening, counsel. My name is Forest Heidrich, Public Works Supervisor, and I'm here to answer any questions on item five that you might have.'",
        "'speaker_0': 'Okay, Mr. Vice Chair.'",
        "'speaker_4': 'So I don't so much have questions. I raised this issue the last time we had vehicle replacement. There are a number of vehicle providers that have chosen to fight the state of California and our fuel economy standards. One of those is Nissan.'",
        "'speaker_4': 'And the day after we approved approved the purchase of vehicles last time around, the state of California actually announced that they would no longer be supporting those who are fighting against our climate goals. Given that there are three Nissan Leaf vehicles, I support fully that they are EVs and very green.'",
        "'speaker_4': 'On the other hand, I do think that there, as we have declared a climate emergency that that for myself I can't support supporting that company. So if I'm the only one, I would ask that we just bifurcate the two purchase agreements for the Fords and that and then I then Nissan's.'",
        "'speaker_0': 'So a question and maybe for even the city attorney. So I understand I think I understand what you're saying, vice mayor, that Nissan has opposed California's stricter emission regulations, but our regulations are still in place at the state.'",
        "'speaker_0': 'Is that correct? I mean, I know they're under attack from Washington, DC, but is do you can you update us on.'",
        "'speaker_5': 'I don't know for sure, but I believe that is generally the case that they are currently in place. But they are they are being challenged by the federal government.'",
        "'speaker_0': 'Okay.'",
        "'speaker_7': 'Just please. Yes. Yes, that is correct.'",
        "'speaker_0': 'And again, microphone.'",
        "'speaker_7': 'Correct in.'",
        "'speaker_4': 'Stating that that, yes, they are still.'",
        "'speaker_7': 'In place. And what Governor Newsom did place on the injunction is only liquid fuel vehicles. So that's internal combustion engine, not electric vehicles, which is the only reason we proceeded.'",
        "'speaker_4': 'Forward with the Nissan Leaf in this request. I appreciate that. Thank you.'",
        "'speaker_0': 'All right. Okay. Councilman Brody.'",
        "'speaker_3': 'Just a quick comment question. I mean, that kind of raises the point to me if if that's in fact, the case, why that was not put in here as a climate impact. Because of that. That was the purpose of this climate impact section on the staff report is to tell us all the climate impacts and if we're'",
        "'speaker_3': 'buying from a company that is not agreeing with our emission standards, to me that's a climate impact.'",
        "'speaker_0': 'I would like to comment on that. Mr.. Every city manager.'",
        "'speaker_4': 'I think Forest answered.'",
        "'speaker_7': 'That question because I think based on his knowledge, it being a Nissan Leaf and not under the prohibition of California, he didn't see that as a climate action.'",
        "'speaker_6': 'Violation because.'",
        "'speaker_7': 'This met the exception within the Nissan's for the California legislation as he understood it. Great. And correct me if I'm am I correct on that?'",
        "'speaker_4': 'Yes, that's correct.'",
        "'speaker_7': 'We still wanted to proceed with the purchase of electric vehicles in place of liquid fuel vehicles, internal combustion engines. And since this injunction did not directly reference EVs or.'",
        "'speaker_4': 'They were the exception.'",
        "'speaker_7': 'In that injunction, we proceeded forward. It allows us to stay with vehicles that we've purchased previously. That allows us to continue with technician training and things like that.'",
        "'speaker_5': 'Along the same vehicle lines.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_4': 'Can I ask a quick question? Ford currently has electric vehicles as well. Correct. I mean, no, not any more that they've ceased.'",
        "'speaker_7': 'Yes. Along with Chevrolet, we are expecting that the large corporation manufacturers will be coming back to market in 2023 with with more EVs. But right now, there is a limited amount of original equipment manufacturer electric vehicles available for purchase.'",
        "'speaker_4': 'And so the Nissan Leaf would be one of those few that are available to a fleet. Yes, that's correct. Great. Thank you.'",
        "'speaker_0': 'All right. Okay. Any further questions or comments? To have a motion.'",
        "'speaker_4': 'With the new information. And again, I apologize to staff. I did catch this just before the meeting. So thank you. And I appreciate your explanation. The thought that went into this, considering that I would move approval as recommended.'",
        "'speaker_0': 'Do you have a second?'",
        "'speaker_9': 'Second?'",
        "'speaker_0': 'Okay. One of them second wave emotion and a second. All in favor. I any opposed, any abstain. The motion passes unanimously. Thank you for the report.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'All right. So that takes care of the consent calendar. So we move to regular agenda items. Madam Clerk.'",
        "'speaker_1': 'Six days introduction of ordinance, approving a lease and authorizing the city manager or designee to execute documents necessary to implement the terms of a one year lease with 41 year extension options, each subject to reasonably discretionary approval of the city manager with Shelter in Peace, a California nonprofit corporation for 2815 San Diego Road, located at Alameda Point'"
    ],
    "Lease Approval and Surplus Lands Act Exemption for Transitional Housing for Refugees at Alameda Point.": [
        "'speaker_1': 'to operate transitional housing for refugees and recommendation to approve the finding that the short term lease transaction with shelter and peace is exempt from the Surplus Lands Act as amended.'",
        "'speaker_0': 'Thank you, Ms.. Potter. Are you presenting on this? And this is this is something that has been in the works for a while. It's a project that I'm really proud of our city council for moving forward. And I think it really just puts into action the slogan Getting a little faded, but still as meaningful as ever in'",
        "'speaker_0': 'the back of the room that everyone belongs here. Miss Potter.'",
        "'speaker_8': 'Good evening. I'm Debbie Potter, the clean development director. And the mayor has just on my staff, which is fine with me because I wholeheartedly agree that this is something that the city and the council has been at for several years now.'",
        "'speaker_8': 'And it has been quite the process to get this single family home out at the base renovated. And the renovation is currently underway so that we can enter into a lease with a nonprofit called Shelter in Peace, who is going to run transitional housing for immigrants and refugees at the house.'",
        "'speaker_8': 'And so this is the very last step, I'm quite hopeful, which is the introduction of an ordinance for a lease with shelter in peace. That is a one year ordinance with four and one year lease with for one year options to extend for for a total term of five years.'",
        "'speaker_8': 'The lease transaction this evening is exempt from the Surplus Lands Act because given the short term nature of the lease, it is not considered a property disposition under the Act. And then just a few highlights of the term of the lease.'",
        "'speaker_8': 'It is a one year annual rent, a security deposit of $1,000. The use will be limited to transitional housing for refugees.'",
        "'speaker_0': 'You said it was a one year annual rent. Did you mean to say a dollar amount?'",
        "'speaker_8': 'Maybe $1? Sorry. Thank you. The tenant who is sheltering peace will do all of the referring and placement of the families, and they will be responsible for maintaining insurance and for all of the standard repairs and maintenance. And with that, staff is recommending that the City Council introduce an ordinance on first reading for for this lease for'",
        "'speaker_8': 'the single family home on San Diego Road.'",
        "'speaker_0': 'Could I ask that whoever is playing music or a cell phone step out of the out of the chambers. Oh, okay. But perhaps it was just him. Okay, so any questions or comments from them? From the council?'",
        "'speaker_7': 'No problem.'",
        "'speaker_0': 'No emotion.'",
        "'speaker_9': 'I'm of approval. Second.'",
        "'speaker_0': 'Okay. We have a motion. It's been seconded. All in favor. I and it's a the motion passes unanimously. And I just want to thank shelter and peace and Ms.. Potter and your staff for all the good work in bringing this this project to fruition.'",
        "'speaker_0': 'And we look forward to doing our part to help this community. Thank you so much for being here. And, you know, we actually have a I know, applause rule. I guess we did for a couple of the proclamations.'",
        "'speaker_0': 'Do you want to say something?'",
        "'speaker_8': 'And I just want to say thank you. I want to say on behalf of.'",
        "'speaker_0': 'Yeah, go ahead and introduce yourself. Do you want to introduce yourself?'",
        "'speaker_8': 'Oh, I'm out of Ross. I'm the chair of Shelter and Peace. The whole board is here tonight and we owe very pleased at this forum of this ordinance. And if I could just quickly.'",
        "'speaker_0': 'Introduce actually, I'd love to have you introduce and bring your board up. Yeah, come on up and. Are you?'",
        "'speaker_8': 'Introduce yourselves.'",
        "'speaker_0': 'Yeah, everybody just introduce yourself quickly. I'm Sister Pat.'",
        "'speaker_7': 'Nangle. And thanks to each and every one of you. Good evening. Member Council members. Michael Yoshi. One of us. Unanimous.'",
        "'speaker_0': 'Welcome.'",
        "'speaker_9': 'Hi, I'm Andrea. Report a member of the board.'",
        "'speaker_7': 'I'm Bob Key, member of the board.'"
    ],
    "Update on Traffic Safety and Traffic Calming Activities.": [
        "'speaker_0': 'Nice to meet you. All right. Thank you very much for your good work. All right. Thank you. So then we move on to item six P.'",
        "'speaker_1': 'Recommendation to accept update on recently installed and ongoing traffic safety and traffic calming activities.'",
        "'speaker_0': 'All right. And presenting this item is our city engineer, Scott Wickstrom. Welcome.'",
        "'speaker_11': 'Thank you. Good evening, Madam Mayor. Members of the City Council. My name is Scott Wickstrom. I am the city engineer. I apologize.'",
        "'speaker_0': 'What did I say? City attorney.'",
        "'speaker_7': 'Or.'",
        "'speaker_0': 'Engineer? I did. Okay, good.'",
        "'speaker_11': 'Apologize for my voice a little bit. I've been fighting that cold from so tonight. Presenting with me will be Don Emery.'",
        "'speaker_0': 'To use your microphone.'",
        "'speaker_11': 'Lean in as much as I can.'",
        "'speaker_0': 'I know I'm taller. When?'",
        "'speaker_11': 'Tonight presented with me will be Donya Mary, who's a principal engineer with us, and she will share the presentation with me. I want to start really kind of, you know, laying out why are we here and how this item came before council.'",
        "'speaker_11': 'Between August in November of last year, there were 16 bike and ped pedestrian collisions involving minors. The photo on the right was a silent protest that members of the community concerned parents held before the November 5th City Council meeting, where this body adopted the Vision Zero policy document.'",
        "'speaker_11': 'And then two days later at on November 7th, the active transportation plan kicked off along with its open house. And I think you started the meeting tonight, recognizing that the unfortunate tragedy that occurred on Friday brings poignancy to the efforts that we're trying to achieve here.'",
        "'speaker_11': 'So. They would acknowledge that together these items have really highlighted traffic safety as a significant and immediate concern of both the community and the council. So we're not here to talk about Vision zero per se, but I want to at least bring it up in terms of a context.'",
        "'speaker_11': 'It is the guiding principle for our planning, design and maintenance for all of our transportation activities. The goal is really safety for all modes and all users. And really the underlying goal is eliminating fatalities and serious injuries through education, enforcement and engineering.'",
        "'speaker_11': 'One of the things I want to least broach tonight is that it really is a data driven approach. We look to existing data to the best extent we can, and we use that data to to hone in our efforts where they can be most effective and have the greatest impact.'",
        "'speaker_11': 'I'm going to show you a map that you can't read, but this is really collision data that has been gathered for the last ten years. And the little dots represent incidents for either bikes, peds or vehicles. It really is part of the vision zero effort.'",
        "'speaker_11': 'There will be more discussion about this as the Vision zero item comes before City Council. A key thing to point out, though, is the idea of high incident corridors. And these are areas where we want to begin to focus our efforts of how we can make improvements as quickly as we can to have the maximum impact.'",
        "'speaker_0': 'So those are the colored areas that get you to.'",
        "'speaker_11': 'The colored area, so that the two blue lines obviously on the west we have Webster and Park Street to the east and then there's Lincoln and Central and Grand Street are ones that have already been identified through the visual process, and you'll hear more about that in the coming months as that whole process comes forward.'",
        "'speaker_11': 'But that that serve to help us as we as we go through our process for immediate and short term responses. This is really the same data in a slightly different format. On the left, you'll see the total number of collisions a year.'",
        "'speaker_11': 'And it's and if you look at it, there really have been close to 800 collisions every single day or every single year. That's over two collisions every day. It's a significant item. It's also as you look at that graph, of course, of ten years, it's stubbornly persistent.'",
        "'speaker_11': 'You can be generous and say there's a slight downward trend, but it's not that significant. You look at the pedestrian and bicycling involved collisions and for our most vulnerable users and those are also holding steady. One of the things that we have committed to our staff and as obviously council is committed to as well with the Vision'",
        "'speaker_11': 'Zero, is to do what we can to bring those numbers down. And that's really what the Vision Zero policy is intended to do. One of the things I want to caution the public and also council is to recognize that this is not going to be accomplished over the course of weeks or months.'",
        "'speaker_11': 'It's a it's a many year effort that through continuous improvement and continuous efforts, that we will gradually look to reduce both the number of collisions and, almost most importantly, the severity of those collisions that lead to permanent life altering injuries.'",
        "'speaker_11': 'So with that, I'm going to hand off the presentation to Dana, who's going to kind of walk through what we have done in our short and near term to address traffic safety, don't you?'",
        "'speaker_0': 'Thank you.'",
        "'speaker_12': 'Thank you, Scott. Good evening, Madam Mayor, and members of the City Council. Tonight I'm here to let me to my slide go over two major topics. One is our immediate response to the children involved collisions. And secondly, to go over our next steps and our near-term plans.'",
        "'speaker_12': 'On October 28th, 2019, the city manager called for an immediate an emergency meeting in response to the data that's shown on this map. This map depicts the 16 locations that, unfortunately, children and and minors were involved in collisions throughout the city.'",
        "'speaker_12': 'The green dots depict the additional nearby locations that we looked at. The very first thing that we did was form an interdisciplinary response team, including members from our city managers, office engineers, planners, police officers and school officials when available.'",
        "'speaker_12': 'What we did is that the map that I showed earlier, the 16 identified locations, we visited each site as a team and determined what happened, what was the what we knew of the cause of the collision. But what else could we do in terms of traffic safety improvements at that location?'",
        "'speaker_12': 'Our lieutenant showed us how the collision occurred, additional information that was available to him. School officials also joined us in the field and explained to us typical traffic patterns around the schools and school drop off zones and other concerns they had around their school.'",
        "'speaker_12': 'Since we were there doing this investigation, while we, in a period of 6 to 8 weeks, visited all of our sites and gathered information, the police department also ran a special enforcement effort on overtime in the month of November to issue over 400 tickets around the locations of the known collisions.'",
        "'speaker_12': 'All in all, we developed 25 work plans, which included the original 16 plus the nine nearby locations that we developed work plans and scheduled the work through our contractor. And some of that I would quickly go over some of the some of the things that we did that we were able to achieve pretty quickly.'",
        "'speaker_12': 'One was daylighting. Daylighting was adopted by city council, and it's basically red painted curbs at intersections to improve visibility. We thought this was a pretty simple improvement that we could do in almost all the locations we looked at opportunities to either extend or introduce red red curbs for the first time.'",
        "'speaker_12': 'Part of Daylighting is a notification process, which is a courtesy letter that we send out to the residents who are losing parking or businesses that were losing parking. So the notification letters went out in two phases, and we did that in two phases because we wanted to quickly start the work scheduled with our contractor.'",
        "'speaker_12': 'So some of our residents got this notification letter, but the next thing that we did, as you can see, is add ladder crosswalks and do a striping refresh. So this is the intersection of Encino Avenue and High Street.'",
        "'speaker_12': 'Here we refreshed the striping at the crosswalk with a thermoplastic, yellow thermoplastic paint and a ladder of stripes. As you can see, it really enhanced the safety, the visibility of the crosswalks at this location and really brightened up the look intersection.'",
        "'speaker_12': 'Another safety element that we introduced through our project was an advanced stopper, so that the stop bar basically pushed the vehicles further away from the crosswalk by moving the stop legend further down and making vehicles stop further away and of course, refreshing the the crosswalks and the center lines.'",
        "'speaker_12': 'This is a before and after picture of Lincoln Avenue and Sally's Avenue. So those are basically the three top things that we did at the 25 intersections, which was our immediate response to the children involved collisions. We knew that that wasn't going to be the end of our traffic safety efforts in Alameda.'",
        "'speaker_12': 'So right now, I will go over what our next steps are, which are basically our near-term improvements. And given that our concern, and rightly so, was due to the collisions involving children, mostly around schools, walking and biking to school.'",
        "'speaker_12': 'Our number one focus right now for near-term improvements is around schools. The next focus will be intersections and corridors known, as Scott mentioned, to have high collisions and speeding and other intersection issues that we have data on already.'",
        "'speaker_12': 'The third is a traffic signal timing updates for increased safety at the intersection. And lastly, it's infrastructure modernization to give us the capabilities to run the special timing, I guess, controller features that would be available to us to make the intersection safer in terms of how it is timed.'",
        "'speaker_12': 'So quickly, go over these four things in terms of school. Our number one priority, I have great news to share that we have seven assessments already in hand. This kind of gives us a good head start or a boost in our efforts.'",
        "'speaker_12': 'The assessments that we have in hand are called Safe Routes to School Assessments funded by Ictsi Safer Afterschool Program. And I won't go through the list, but I have listed the seven locations that we have already and our plan is to actually implement the striping plans.'",
        "'speaker_12': 'I'm sorry. Our plan is to implement all striping recommendations that have been given to us through these school assessments. However, if you could just focus on the fine print on the bottom of this exhibit, which is an example at Franklin Elementary School, the consultants from Ictsi that gave us the assessments basically said that these are just our'",
        "'speaker_12': 'recommendations and actual engineering analysis are required for some of the things that we're putting on a map, basically. Which is which brings me to my third bullet point here, which is perform engineering analysis as needed. So depending on what was recommended to us, the ones that require engineering analysis, we would do that next and seek funding for'",
        "'speaker_12': 'the warranted recommendations. Typically, things that require engineering analysis or if there is recommendations regarding traffic signals, a stop, a new stop control intersection and our fobs, the flashing beacons for the crosswalk. And there is a combination of all those three things mentioned in the seven assessments we have, but we will start off with our striping and work'",
        "'speaker_12': 'our way down. But definitely safe routes to school assessments will be our starting point in addressing our first goal. And in terms of intersection improvements, we have Lincoln and Walnut listed as a location. Unfortunately, this location has been known for collisions.'",
        "'speaker_12': 'We recently had another collision here and what we're planning on doing here, sorry, there's a lot of information here, but just focus on the green boxes, which is the first thing we want to do is do a lane drop west of the intersection.'",
        "'speaker_12': 'So so right now you have four lanes total two lanes in each direction. And we want to get that to one lane in each direction. And in order to do that, west of the intersection, we have to drop the lane 2 to 1.'",
        "'speaker_12': 'So as you're approaching the intersection, there's just one lane plus a left turn pocket that we want to add on both sides. So we want to have two left turn pockets, single lane with enhanced crosswalks so that you see the it'll be a ladder crosswalk as well as yield lines before the crosswalk for vehicles to stop for'",
        "'speaker_12': 'for pedestrians crossing the intersection. And lastly, we have a hatch painted bulb outs, so we want to shorten the crosswalk. So the distance through the crosswalk is shorter, vehicles are stopping and the lanes have been narrowed down. This is just an intersection improvement and we do believe that Lincoln Avenue needs a further all corridor evaluation.'",
        "'speaker_12': 'And like I said, these are just our near-term goals, that that is a future goal for us to look into the full corridor at a later time. Another example of an intersection improvement we are doing near-term and this work actually got done yesterday.'",
        "'speaker_12': 'I was in the field verifying it is at the intersection of Burnside Boulevard and High Street here. For the first time we are introducing a new crosswalk leg and pedestrian. Signals. And in addition, we are doing ladder crosswalks all around the intersection to add visibility and just bold, you know, crosswalks for pedestrians where because this intersection has'",
        "'speaker_12': 'the, I guess up to date controller cabinet and controllers, we're able to run lead pedestrian in a interval for all the phases of this intersection. What this means is kind of like along Park Street, pedestrians are able to start crossing the street while all vehicles are at a stop.'",
        "'speaker_12': 'And in terms of corridor projects, I will just highlight and repeat what Scott brought up in terms of the data that we have regarding our high injury corridors, which are shown as Webster, Webster Street, Park Street and Grand Lincoln and Central.'",
        "'speaker_12': 'Two of our corridors have, I guess, existing projects that just need completion. One is the Webster Street Corridor Project. It's I've learned has is a ten year project. And we have some technology to implement or install in the cabinet to basically run signal coordination along Webster.'",
        "'speaker_12': 'Likewise, Park Street received the technology needed in the cabinets and we just need to complete the signal coordination portion of that. So in terms of signal coordination and timing update, those are the two corridors that we're focusing on this year.'",
        "'speaker_12': 'And in terms of other improvements for our high injury network corridors, we were planning on Daylighting all along Lincoln Avenue Central and Grand. And so I'm going to combine my third and fourth point, which is traffic signal timing for safety and modernization of our traffic signal system.'",
        "'speaker_12': 'So there are features that we can run at our intersection that would enhance our safety at the intersection greatly, in my opinion. And one of it is I've listed them there as basic signal timing updates that we could do for traffic safety.'",
        "'speaker_12': 'An all red phase is a it's like a safety buffer to to basically have all vehicles, pads, everyone at a stop before the next phase gets their green. It kind of gets everyone a chance to, like, recheck themselves, be aware of their surroundings, and then the next phase will go.'",
        "'speaker_12': 'It is a slight delay at the intersection, but a one or 2/2 stop is very important and increasing safety at the intersection. The next bullet point I have is a minimum green time for bicyclists. This is great for bicyclists and not so great for vehicles, but that is okay with this signal timing changes.'",
        "'speaker_12': 'What we would be doing is looking at every intersection in the city and ensuring that a bicyclist has the sufficient time to safely cross the intersection to the last leg, making a left turn, basically the longest trajectory from one direction to another versus the view of vehicle.'",
        "'speaker_12': 'So right now, our traffic signals are timed for a minimum green time for a vehicle to get to an intersection. I don't think that is the safest programing and that is another effort. So what we would have to do is re time, all of our signals increasing our minimum green so that if a bicyclist were there, they'",
        "'speaker_12': 'could make it to the intersection and not get stuck in a yellow or red halfway through the intersection. The third thing I already mentioned is lead pedestrian interval. This allows pedestrians to get into the crosswalk in advance of vehicles.'",
        "'speaker_12': 'And lastly, it's time of day signal timing plans. So right now, our city, all of our intersections are timed, fixed. So what that means is that it's regardless of an afternoon peak traffic time or school dismissal time or 2 a.m., when traffic is very light, we are running the same exact times throughout the day with no differentiation'",
        "'speaker_12': 'for the change in traffic. So while we are like I have a picture of an old cabinet, that's basically what most of our city is like in the picture. To the right is this traffic signal cabinet, which is which has the equipment needed to run some of these things.'",
        "'speaker_12': 'But running the time of day signal plans would be something that for the most part, we have some of our controllers that can handle this change. So I believe this would make our corridors more efficient and help greatly with our traffic safety efforts so quickly.'",
        "'speaker_12': 'There are some other things that I would like us to implement near term, and one is a yellow reflective border around signals so that you could see from afar that you're approaching a traffic signal. The pedestrian countdown signals.'",
        "'speaker_12': 'I know we have them mostly everywhere, but not all intersections have it. And lastly, we have some intersections where the crosswalks are missing. The signal head for a pedestrian. So this is a matter of purchasing equipment to ensure that if a pedestrians crossing the crosswalk, not only are they getting the information of not only are they getting'",
        "'speaker_12': 'an API to safely cross the intersection, but a countdown to tell them how much time they have to get through the intersection. And so I will actually pass it back to Scott to continue.'",
        "'speaker_0': 'Thank you. Great presentation. And I want to ask, I don't think this was included in our packet. Will you be able to make that available to us? I think that's great. And I also wanted to just let the public know that in the back of the room, we have Lieutenant Matt McMullen from APD Wave to the people'",
        "'speaker_0': '. So thank you. He came particularly for this item. Thank you, Mr. Wickstrom.'",
        "'speaker_11': 'I'd like to continue and build off what Daniel was saying. So we have a very active program to improve traffic safety. But there's another component to traffic safety, which is basically good maintenance of our existing infrastructure. So signs and striping anyone who's been anywhere west of Grande Street has noticed stop signs, stop legends, crosswalks that have been'",
        "'speaker_11': 're striped. We re striped over 250 intersections west of Grand. Focusing on those three components. We are moving on to our next phase, which is really looking from grande to park and then eventually park to the east and the island and eventual kind of work away into Bay Farm Island as well.'",
        "'speaker_11': 'I will say that payments is also a component of traffic safety in the sense that while we've revamped our our our paving program, we're doing more than just 2 to 3 miles the streets per year with a lot of preventative maintenance.'",
        "'speaker_11': 'We're going to be doing ten miles of pavement maintenance this next year or this year or 2020. And with that comes all new striping and opportunities to look at ways to improve our our striping crosswalks, potentially painted billboards where appropriate.'",
        "'speaker_11': 'So that's another major component. And then I want to talk about sidewalks, because sidewalks are a critical component of our transportation network. There's a lot of dots on there. So this is kind of what we call zone four, which is between Grand and Broadway.'",
        "'speaker_11': 'You notice we tend to work left to right across the city with our with a program. We're going we've transitioned to a new kind of method for sidewalks where we're doing a lot more cutting of offsets. And it's going to help us go from a several hundred remove and replaces to over 2500 potential trip and fall hazards'",
        "'speaker_11': 'that will be removed just in this section alone. Staff report should be coming to you in two weeks to award that contract, which we'd certainly appreciate.'",
        "'speaker_0': 'It just approved it for the next agenda.'",
        "'speaker_11': 'I yes, it will be next two weeks from now. Yeah. Want to talk a little bit about some capital projects that are in construction that are near nearing completion. Obviously, the cross Alameda Trail is set for a grand opening on the 29th.'",
        "'speaker_11': 'They took half of the fences down for the remaining section today. They're down tomorrow. So if you want to ride the cross Alameda Trail on your bike or walk it from Webster to Main Street, you should be able to do that on Wednesday.'",
        "'speaker_11': 'But certainly by the end of this week, the business park over at Harbor Bay has that long had some concerns about traffic and the ability for their workers to leave safely. At the end of the day. And we are in progress of installing two new traffic signals on what are called A street and B street or Penumbra'",
        "'speaker_11': 'Street. Those are in progress and should be operational by the end of the month or not early into March. So those are well under construction as well. And perhaps a couple of things that you might not be as attuned to from, I'll say, a city council perspective, but we do have a fair amount of design that we're'",
        "'speaker_11': 'working on in the background. So Island McCartney Intersection has long been on our, I'll say our our work plan for a capital budget. And originally the idea was to install a signal here. We've been working with one of our traffic consultants who did it recently completed an intersection control evaluation, if you will.'",
        "'speaker_11': 'What is the best way to manage traffic here? And there's the idea came out about what about possibly doing a roundabout at this location. This is something that we recognize. We're going to go back and make a visit by the Transportation Commission, bring this idea through them and get a little more input and feedback from them before'",
        "'speaker_11': 'potentially bring it back up here to council. That's something we're working on in the background as well. Hopefully that will be to Transportation Commission this spring. And then I do want to talk a little bit about protected intersections.'",
        "'speaker_11': 'Most collisions occur at or in the vicinity of an intersection, and the latest practice or latest guidance is to protect the intersection as best possible, to separate the pedestrian movement from bicycle movements, from vehicular movements. And these are sometimes referred to as Dot's intersections.'",
        "'speaker_11': 'We currently have eight of these in design. Seven of them are out on Alameda Point. A lot of them are with the base we use project which we hope to kick off in in 2021. The one that's going to come first is likely going to be well is going to be Otis and Grand as part of the'",
        "'speaker_11': 'Otis Street Safety Improvement Project. So there's a lot of exciting stuff that we're working on in the background, and I also want to at least put some thought through that. Traffic safety happens as part of development projects as well.'",
        "'speaker_11': 'Side a, phase one that was really early in the morning when I took that photo. But they have the pavement down. They're beginning to get the sidewalks and the bike paths in there. It may depend on a couple items we're trying to work through open to the public as early as April this year.'",
        "'speaker_11': 'And you'll have access through to see play in the ground and potentially access back between the north and south of Alameda Point and then Del Monte Construction. The new developer pulled permits last month and they have actively begun construction.'",
        "'speaker_11': 'And the big carrot there is that Clement Avenue will be extended from its current terminus at Entrance Road and carry all the way through to Atlantic. So that'll be a wonderful addition for it. So that kind of concludes our presentation that Danny and I had prepared, and both of us are available for any questions, anyone we might'",
        "'speaker_11': 'have.'",
        "'speaker_0': 'Thank you very much, both of you. That was a great presentation. I do we have public comments on this item. Speaker Okay, well, shall we hear a public speaker and then have to have comments and questions? Okay.'",
        "'speaker_1': 'Jeff Not.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_7': 'Evening, mayor. Council members. I'm Jeff Canals and I live at the corner of Lincoln and Walnut and I feel like I've hit the lottery. After hearing that presentation about what's going to happen at Lincoln and Walnut, but I'm going to go ahead and read this anyway to put an exclamation point on why the work needs to be'",
        "'speaker_7': 'done. According to Alameda transportation statistics, there have been 47 collisions at this intersection in the past five years. In one, one of my cars parked at the curb was totaled. In another, my fence was taken out in four separate crashes.'",
        "'speaker_7': 'The neighbor across the street has lost two cars parked on the curb and two fences. To be fair, the city has implemented traffic calming measures. Cornered parking spaces have been replaced with red curbs to improve sightlines when crossing Lincoln with a newly repainted crosswalk, a neon yellow pedestrian crossing signs.'",
        "'speaker_7': 'But the collisions between cars trying to cross Lincoln keep happening. In the past six months, there have been four accidents, all resulting in personal injury requiring ambulance transport to a hospital. In one recent collision, it resulted in a car crashing through the front bedroom of a house where a mother and her two children were sleeping.'",
        "'speaker_7': 'The house has been red tagged and the occupants displaced, still not back. There are several conditions that make this intersection so difficult for drivers. We already know that drivers regularly exceed almeida's 25 mile per hour speed limit. On Lincoln.'",
        "'speaker_7': 'It's more like 35 to 45 on the stretch between Willow and Oak. I know because I live there. As speeding drivers approach the intersection going east from the light at Willow, they have to merge from two lanes to one.'",
        "'speaker_7': 'The merge happens right at the intersection of Lincoln and Walnut. Going west from the lighted oh. There's a split from one lane to two drivers behind a slower car step on the gas at the split. And that acceleration happens right before the intersection of Lincoln and Walnut.'",
        "'speaker_7': 'Drivers already exceeding safe speed limits in a hurry, distracted on their cell phones, often encounter cars on Walnut wanting to cross Lincoln, not to mention students from Love Elementary. Love the name of that school. By the way, I'm a retired principal from Alameda Unified and Alameda High School, just two blocks away, one to across the street vehicles'",
        "'speaker_7': ', including the mail truck who parks there every day at the red curb, obstruct sightlines and they never get tickets when there is an event closing Park Street, a default detours Walnut Street, which exacerbates an already difficult crossing. And I promise that I did not have any prior knowledge to your presentation.'",
        "'speaker_7': 'One obvious solution is to change the lane configuration on Lincoln from two lanes each way to one. I just wrote this tonight.'",
        "'speaker_0': 'It's brilliant.'",
        "'speaker_7': 'With a middle lane designated for turning cars, Broadway has this configuration. My neighbors and I have been in contact with the city as vice mayor and city manager. To their credit, they have met with us to discuss the accidents that have caused significant property damage and personal injury.'",
        "'speaker_7': 'We have heard there may be a plan to mitigate the danger. I'm almost done last sentence to indicate the conditions that link in a wall and we would love to know what the plan is. Thank you very much for that tonight.'",
        "'speaker_7': 'And I would love to know how soon it might be put in place.'",
        "'speaker_0': 'Thank you for your comments. Okay. These are all our public comments. Correct. Okay. We we will close I have a comment and I was thinking I didn't know we had a retired principal in the chambers, but I was thinking how nice it is to have all these students from middle school and high school listening because it's for'",
        "'speaker_0': 'all of you. You're one of the reasons we want to keep our streets and our sidewalks safe so that your parents will let you walk and ride your bike to school. But we want to have safe ways for you to do it.'",
        "'speaker_0': 'So with that, and thank you to to both of our folks from the city engineer's office, because this is a it's a big issue for this council, for our city. And so with that, let's let's start out with our comments.'",
        "'speaker_0': 'So we just go down the line or to somebody somebody just itching to go first.'",
        "'speaker_3': 'Vice Mayor Doesn't matter to me.'",
        "'speaker_0': 'Okay. Well, okay then on my right. Okay.'",
        "'speaker_3': 'So couple questions since since I got the mic first. So that gentleman raised some interesting questions. Can we get some answers to those?'",
        "'speaker_0': 'Oh, you know, you.'",
        "'speaker_12': 'Are schedule for Walnut and Lincoln is. So we have the plans, as I showed, and it's a matter of getting our contractor crisp company to schedule the work. So we are expecting it in in spring, so within a month or so.'",
        "'speaker_0': 'Thank you. Yeah. All right, you heard it here.'",
        "'speaker_3': 'So then what's our long term? I'm sorry. I mean, what's our long term? Because it's not just that section of Lincoln. I mean, all of Lincoln is kind of a speedway.'",
        "'speaker_12': 'Right. So as I mentioned, we do believe that Lincoln Avenue needs a fuller full corridor analysis. And we expect that there's a lot of community outreach required, additional funding and design for what could be done. Narrowing the four lanes to two lanes with some billboards are just things that we're imagining.'",
        "'speaker_12': 'The lane shift actually would offset some of our traffic signals and the location of the signal heads. So there's some modifications along the corridors that are needed and each traffic signal modification is a few hundred thousand dollars at the least.'",
        "'speaker_12': 'So we are hoping to revisit or scope out this project. And this year, like we want to look at the full corridor and have like a ticket, an item, I guess a price tag to what we need, how much we need to fully address the full corridor.'",
        "'speaker_3': 'And are there things we can do on an emergency basis? You know, like, for example, temporarily shut down lanes if kids are getting hit lower the speed limit in school zones, because I thought we had that authority under the state law.'",
        "'speaker_12': 'So. Sure. So regarding the speed limit we are I'm putting together an RFP to do a citywide speed survey. I'm working with our police department to determine the segments that need to be surveyed. Once we have that data, the Council can and we will share that with you.'",
        "'speaker_12': 'And there there is some ability for the agency to lower speed limits around school zones. Now, there's I think I know of Sacramento who has done it, but in order to get that far, we need our speed survey done first.'",
        "'speaker_12': 'And the speed survey actually also it's very tricky because the speed survey could show higher speed limits. And in that cases, lowering it where it is, you're kind of tied to what you could do there. But we do have more ability around school zones.'",
        "'speaker_3': 'Okay. And then the other thing I think I asked this last year when we had this discussion, I remember working in San Francisco, and if you were a pedestrian, you could pretty much walk down some of the major arteries to Market Street because the lights and the crosswalks were time to pedestrians.'",
        "'speaker_3': 'I mean, if we thought about implementing something like that to make it, I mean, we're doing it for bicycles, but making our main streets park in Webster and so on. A little more pedestrian friendly.'",
        "'speaker_12': 'Yes. Great recommendation. And that is something where I'm looking at and considering all the safety improvements that we could do with traffic signal with our traffic signal system, some of our intersections have obsolete technology, obsolete cabinets and controllers.'",
        "'speaker_12': 'We just don't have the ability we have the ability to replace the cabinet and by the cap, the controllers, basically the computer running the intersection to install these features along certain business districts like Park in Webster. We are definitely considering additional pedestrian timings because we know the volume.'",
        "'speaker_12': 'Is there more? Not at every intersection in the city, but definitely along certain corridors. There's a need and it's being considered. Definitely.'",
        "'speaker_3': 'Well then I'll just make some quick comments. I appreciate your presentation. I appreciate the fact that our staff has prioritized working on this. I mean, to me, this is the one thing we cannot get wrong because I don't want to look in the face of a parent or a child who may have lost their mother or father'",
        "'speaker_3': '. You know, some of us that are not kids also get hit in the street. Right. I see one of our surviving accident victims in the audience. So I'm intrigued by the, uh, the roundabout. On on Harbor Bay, I think there are a number of places in the city, that High Street intersection being one of them.'",
        "'speaker_3': 'I think there's one on Gibbons where that comes out. So I think this is something that's not just European. I know, Malia, when you were prepping for your wedding, I was driving around and I didn't cover a lot of roundabouts.'",
        "'speaker_3': 'So I think it's a much safer way to deal with some of these dangerous intersections. I'm excited to see that. But let's let's keep up the work. Let's keep prioritizing this. This is something we have to do now.'",
        "'speaker_3': 'We have to do it right. And we we have to just get it done. So I appreciate it. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember de SAG.'",
        "'speaker_6': 'Well, great. Well, thank you. Thank you very much for the presentation. I think one area where I'm interested in is for all the 25 locations that you've identified as well as. The various corridors that that you've identified. If we can make sure to get, uh, ample data, you've already gathered the data, ample data so that you can'",
        "'speaker_6': 'compare in a statistically significant manner, have the, have the, you know, approaches that you've adopted actually resulted in statistically significant improvements that are outside of chance. I think we need to know that, you know, that I think the public needs to know that the the tools that we're adopting are going to be effective.'",
        "'speaker_6': 'Um, and, you know, I have no doubt that, you know, if you put a stop sign, you stop the car. But, but, but you also want to know, are you diverting traffic to elsewhere, other parts of town which did not exhibit, you know, high traffic incidents?'",
        "'speaker_6': 'So I think that's the type of data that we need is not just to collect trends data, but be able to put into some kind of context that allows us to evaluate the effectiveness of our decision. And I think it's not it's not difficult to just, you know, to, uh, put the data all together and just, you'",
        "'speaker_6': 'know, run simple statistical significance analysis. Unfortunately, what that means, though, is once the the techniques are put into place, we won't be truly able to measure the the statistical significance impact for at least three or four years, because we have to gather like a number of data, but we can do some preliminary basis.'",
        "'speaker_6': 'You know, we can compare five years before with five years after. Um, but I think it's important that we at least put, begin to put some kind of remedies in place. But, but at the end of the day, though, we need to know that the remedies are truly effective.'",
        "'speaker_6': 'And I think we owe that much to to the residents. Otherwise, we're just kind of, you know, making people feel good and saying, oh, hey, you know, we're going to put all these ball balls and I'm going to put all these are one, two to let two days to one lane remedies.'",
        "'speaker_6': 'But at the end of the day, we need to know that that what we're putting in place will be effective. But like I said, though, in order to make that kind of comparison, it's going to take some time.'",
        "'speaker_6': 'But these would be lessons learned that future councils can can look to and draw on when it comes to saying, you know, what are the remedies that work? So thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor. Next.'",
        "'speaker_4': 'WHITE Thank you. So I believe this is Ms.. Mary's first council presentations. I wanted to welcome her and also recognize that when she started last fall, she came in at probably one of the most horrific times for a traffic engineer to start in Alameda, because not only were children being hit at a shocking rate, but a council'",
        "'speaker_4': 'who was prioritizing street safety was screaming, do more, do something now. Holy cow. And I just wanted to, you know, thank you. Thank thank Mr. Wikstrm as well for the work that has been done, because there's been a lot of it.'",
        "'speaker_4': 'And I know that sometimes and I'll say this personally, but I'm sure you're hearing from other people, we are always saying more. But but that doesn't necessarily mean that we're not also recognizing the hard work and the work that's being done out there.'",
        "'speaker_4': 'I also wanted to recognize that the courage in pronouncing it for sales took me five years to get there. So, you know, I've been trying to think about how to how to talk about this. Maybe one of my former neighbors who grew up in Alameda, you know, really wanted to bike.'",
        "'speaker_4': 'She really wanted a tricycle. And she was an older adult. And, you know, our neighborhood came together and bought her that. And she felt so unsafe riding and riding on the streets of Alameda that she would only ride on a few sidewalks in our neighborhood.'",
        "'speaker_4': 'And so when I think about, you know, where we need to get to as a city and again, thank you for doing everything we're doing. But also, oh, my gosh, we need to do so much more. You know, I think this is an example of we are trying to not just make it safe for for students to'",
        "'speaker_4': 'be able to walk to school, but for people to just have mobility around their own neighborhoods and whatnot. You know, we have decades and decades of decisions that have led us to the city that is unsafe and doesn't feel right now.'",
        "'speaker_4': 'And we don't have decades and decades and decades to undo that work and fix it. I said at our council workshop for for me, the word of the year is transformational. And, you know, as we move forward, I do see a lot of repaving, repaving projects and whatever else actually starting to transform our streets.'",
        "'speaker_4': 'And I really appreciate that there's been a lot of proactive work done there. I, I am still curious when we're going to start. I have seen that. So if you go down Broadway to Bayview, the first protected interstate or first clear intersection with bollards in Alameda has appeared.'",
        "'speaker_4': 'But when I see us clear zoning and doing projects on Lincoln, etc., I'm not seeing the use of bollards. And unfortunately, I know, I know they're not the most beautiful things. But unfortunately, people who drive seem to as, as Mr. Chernoff mentioned, park in those red zones with quite a imputed community.'",
        "'speaker_4': 'And we have to, unfortunately, have to put a physical barrier to tell drivers that the red zone is not a place for you to park for 15 minutes because you're just running in. It's a safety zone for for our for our neighbors.'",
        "'speaker_4': 'And I'd like to start seeing I'd really like to start seeing that as a part of our ah toolkit coming out because I think we need to not just create the space, but we need to protect the space.'",
        "'speaker_4': 'Yeah. You know, I we we started this meeting with with a moment of silence for the fatality that happened on Friday night. You know, one of the tenets of Vision Zero is that all fatalities are avoidable. Right. That there are changes we can make, whether it's providing better protection on sidewalks, whether it's slowing the speed limit down'",
        "'speaker_4': '. It is it is not a shock that that fatality happened on one of our four and that many of our fatalities happen on our fastest streets. That is a 35 mile an hour street. We have had many conversations kind of at the community level, not within the city, about just removing the four or five streets that are'",
        "'speaker_4': '35 miles an hour and making them safer at 25 miles an hour. And just having to be in Alameda, we drive 25 and I would like to see that as a part of our conversation as we're going forward.'",
        "'speaker_4': 'Again, acknowledging that you're doing speed service for 50 mile an hour school zones and. Right. This is not a let's bring it back in March. But but, you know, let's keep that in the mix as well as as we're thinking thinking things through.'",
        "'speaker_4': 'San Francisco has done a lot of work to extend pedestrian crossing times for seniors. Alameda as population is, you know, aging quickly. County's population is aging quickly. That doesn't always come at the cost of extending the length of time that the light has to stay green.'",
        "'speaker_4': 'It can actually come out of sometimes if the green area just means, you know, a longer yellow. But it gives that it gives seniors a little bit more understanding of how much time they have if we just program them for a slower crossing time.'",
        "'speaker_4': 'And that's been shown to have some safety impacts as well. You know, I guess I want to say I appreciate Councilmember D's call for evaluation and whatnot. I want to make sure we have the right metrics. For me, the metric isn't we divert traffic to somebody else's street.'",
        "'speaker_4': 'For me, the metric is are people getting hit less? Are the behaviors we're trying to change changing? Because sometimes these numbers are not going to go to a place where somebody where there have been, you know, 15 collisions over five years and find a statistically significant change over five years.'",
        "'speaker_4': 'But you can go and measure whether or not people are more slow and stop slowly making the corner or people are yielding for pedestrians, etc.. And those are the behaviors that that, you know, we know yielding speeding illegal turns and running red lights and stop signs are typically the five things that lead to people getting hit.'",
        "'speaker_4': 'Are we are we are we reducing those incidents so that there is a reduction in the chance that we're going to be hitting people? My guess is we're going to find that, yes, we have kind of reduced it, but we haven't eliminated it.'",
        "'speaker_4': 'And that actually a lot of the things that we're doing, which I appreciate, are quick and effective. Right. These are best practice, are not enough that we're not going far enough. And that gets to the long term and the more transformational things that I know you're working on.'",
        "'speaker_4': 'And I will stop here in basically just saying, you know, I am proud to serve with the council I serve with because I think you have strong partners in safety. You know, I think you have you have the council that you can come to and talk to about the fact, you know, we have 1950 stoplight traffic lights'",
        "'speaker_4': 'and we're trying to implement 21st century safety things. We need to have that conversation. And I think we're here to to support you. So, you know, ask us for the tools we need. Bear with us when we seem impatient again.'",
        "'speaker_4': 'I mean, me, you know, but I also know that it's done. It's done with support and and appreciation for the hard work that's come in and that we want to be here for you, because you guys are doing a great job for our community and we all want to work for the community, you know, to become what'",
        "'speaker_4': 'we what we have always said we are. But when I talk to people, people are not feeling that we are the small town, that you just feel like you can send your kids to the movies anymore. People feel like they they have to kind of armor their kids up to just, you know, have them go hang out'",
        "'speaker_4': 'with some friends for an afternoon. So thank you.'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_9': 'So I want to thank staff for the quick turnaround on this. I think whenever and it may have been a few months, but the reality is with city government and all of the things that we have to look at and take a comprehensive approach, a few months is a very quick turnaround, so I really appreciate that.'",
        "'speaker_9': 'I'm also somebody who used to live at the corner of Sherman and Santa Clara, and while I lived there and multiple cars drove up over the curb and we actually put in a rock wall of sorts, which has even since then prevented cars from careening into the house.'",
        "'speaker_9': 'But I was also there when cars hit rope, drove into the house across the street, and I saw that happen a couple of times and was the first person out making the call to 911. And I think, you know, a lot of these changes have been a long time coming.'",
        "'speaker_9': 'Many of these intersections were just on the cusp. And I think we need to and I think we are doing that as a policy, kind of changing how we're looking at this from a problem solving standpoint and who we're trying to make.'",
        "'speaker_9': 'Make it safest for a couple of questions that I had was. You know, we've I heard you speak about the obsolete obsolete traffic signal technology. There have been a few intersections that I've been at where the as a pedestrian, I see a lot of pedestrians walking against the pedestrian light because they haven't hit that button.'",
        "'speaker_9': 'They either don't know to hit the button or. And in fact, when I was over at Love school early one morning with the mayor and the vice mayor.'",
        "'speaker_0': 'Out in the.'",
        "'speaker_9': 'Rain. Out in the rain, I think we all witnessed this where the that the pedestrians didn't hit the hit the button and so the pedestrian light didn't turn on for them to cross and they basically missed a cycle or were walking against the pedestrian light.'",
        "'speaker_9': 'And so that's something that I would just like to see gone. And I see it happen all the time. I live near Washington Park and it happens all the time where people kind of miss the pedestrian signal and then they have to either choose between waiting for another cycle or crossing against the signal.'",
        "'speaker_9': 'And I kind of hold my breath whenever this happened. And I see a lot of parents doing it with strollers and things like that. And as a new parent, you know, in fact, the other week I was out there telling people, no, you have to press the button here, otherwise it doesn't change for you.'",
        "'speaker_9': 'So those are the types of things that I would just like to see gone. I think there are a hold over. Obviously there's a cost associated with them. But to that point, when when looking at these zones and I know we're focused on school zones, but I would also like my question is, are we looking at kind'",
        "'speaker_9': 'of the zones near these major parks and thoroughfares the same way? Because if there's a dog park or things like that that we know are kind of heavy pedestrian traffic, it seems to me that we should be. Obviously, there's limits.'",
        "'speaker_9': 'You said that. Is that part of the overall consideration in terms of what we're focused on? I'm seeing Scott not. Okay. Thank you. The other the other question that I had was the roundabout or the intersection, I guess, at and Snell Central and Sherman, which is where the three streets kind of come together for streets, I think'",
        "'speaker_9': ', come together and what the plan is for that. When I say roundabout, I'm I'm hoping that hopefully we'll think about that at some point.'",
        "'speaker_11': 'That specific intersection and one of the things I'm going to make and I'll I'll yellow get your.'",
        "'speaker_0': 'Voices softer tonight.'",
        "'speaker_11': 'Yeah we didn't talk too much about some of the longer term plans and actions that are going on. I know the active transportation plan will be in front of this council and next month sometime and they will be talking about a lot of the larger corridor projects.'",
        "'speaker_11': 'The specific intersection you're talking about is at the end of the Central Avenue project. And so that will be incorporated into that project. We're looking at it. I know a roundabout has been discussed. There are some challenges, geometry that will be presented and evaluated as part of that larger Central Avenue corridor project.'",
        "'speaker_9': 'Okay. Appreciate that. The other thing that I've seen a lot of is the illegal double parking. My colleague, the vice mayor, mentioned parking and red zones. I've seen a lot of that. But there's also been a lot of illegal double parking.'",
        "'speaker_9': 'I've seen everyone from delivery drivers to people on, you know, picking up food and things like that, running into restaurants, illegally parking, double parking. And I know that while it's convenient for them, I also see them doing this in our bike lanes and seeing cyclists have to bike around this, seeing cars have to drive around it in'",
        "'speaker_9': 'an unsafe manner. And I'm hoping that we can also be looking at that in some of our plans. And I think to staff's point, when we're looking at new structures and new kind of areas of commerce and things like that, making sure that there are delivery, ample delivery of 15 minute parking, that sort of thing, so that'",
        "'speaker_9': 'people can actually have a spot to to safely double park or not to safely park rather than double park. Excuse me, because it seems in some of our districts we don't have those types of spaces which mean that there isn't an ability to stop for a few minutes, drop something off or pick something up.'",
        "'speaker_9': 'You either have to park in a in a regular parking spot or double park. And obviously, I would like to see that cut down because I think it's incredibly unsafe where it's happening. Thank you.'",
        "'speaker_0': 'Thank you. And so I will just echo a lot of what my colleagues have said, but I also want to start out and recognize both of you. I think we're lucky to have both of you on Team Alameda.'",
        "'speaker_0': 'But Missouri, I have to say, it's always a pleasure. It makes me proud to see a woman engineer. You're a great role model. We have a lot of young men in this room, but I'm hoping there's some girls watching do.'",
        "'speaker_0': 'And even for you guys, she's an engineer, isn't she? Awesome and great. Just a great presentation. So so thank you for that. I had a few questions that I made in my margins when I was reading I'm reading the staff report.'",
        "'speaker_0': 'So one of them is when I'm out and about in the community, people come up to me and talk to me about their intersections of concern, and I will just throw out that Councilmember Vela and I get our nails done at the same salon.'",
        "'speaker_0': 'It's this is not an advertisement, but it's at the corner of Central and Ninth Street. And I cannot tell you how many times I've been there, a captive audience. I'm always happy to talk to me any time that they come up and talk to me about and especially the women who work there because they saw a window'",
        "'speaker_0': 'and they see so many near misses at the corner. This is at Central at Ninth Street. And so they've asked me, you know, what's being done about this? And so I promised them I would bring this up during this report.'",
        "'speaker_0': 'So you heard it here. You can tell my manicurist. And then the other intersection that was brought to my attention is at Central and page. And page is that little street you might know where Spitzer's cafe is just down from Washington Park on central.'",
        "'speaker_0': 'And so it's a popular coffee place. But also just down the street in that same block is a is a center, a day center for adults with developmental disabilities. And that intersection has, you know, nothing just some pain on the ground.'",
        "'speaker_0': 'And I, as an able bodied person, always feel that I'm taking my life in my hands when I'm crossing the street to to meet someone for coffee. And so that was that's been brought up to me, I think, actually, by one of the parents of an individual who uses that center.'",
        "'speaker_0': 'But it's I would like to to know what's being what, if anything, is being considered there. And then I think at the Open House workshop you did at the library last year, which was great and very informative, I asked.'",
        "'speaker_0': 'The question is, would it be possible in a couple of intersections in our downtown area and I'm thinking especially at Park and Central and Park in Santa Clara, to do what is done in some other business district. Scott Smiley He knows what I mean to say.'",
        "'speaker_0': 'I know it is a scramble intersection. I think there's other terms. But just today, the city manager and I were coming back from a meeting in Oakland and we were driving down Webster Street through Oakland, Chinatown. And for years they've done a very successful and actually very beautiful with the decorative pavement scramble intersection, which means at one'",
        "'speaker_0': 'time pedestrians can go every which way. And they really seem to honor that and observe it in for even longer than the one in Oakland, Chinatown, in the financial district in San Francisco. There's a couple of those. And so, you know, I realize everything costs some money, but I'm wondering if that's something that could be considered in'",
        "'speaker_0': 'time. And then I will just close with saying I cringe when I hear about the antiquated signal boxes. And so just be sure that you're letting the city manager know because our mid-year budget cycle study is coming up.'",
        "'speaker_0': 'So we want to be able to to fund these necessary changes and improvements because safety is just the top priority for for everyone on this council. And I know for all of our city staff. So with that, I thank you for your time.'",
        "'speaker_0': 'Do you want to come and address any of the inquiries you heard or did you all you got the notes down and. Okay, so with that council, what we're being asked to do on this is to accept the update on the recently installed and ongoing traffic safety and traffic calming activities.'",
        "'speaker_0': 'So do I have affirmation? So we do a motion move. Okay, get a motion second. Got a second. All in favor. I okay. I think that was unanimous. Right, that was unanimous. Thank you so much. Now we're going to do a little bit of housekeeping audience.'",
        "'speaker_0': 'I beg your pardon?'",
        "'speaker_4': 'Process safety.'",
        "'speaker_0': 'Sure. Process.'",
        "'speaker_4': 'Question Can I assume that what's coming forth in March to the council is is essentially the response to the council direction in September to bring back an intersection equity access policy, street lane with how we're doing traffic calming?'",
        "'speaker_6': 'Uh, I can't say yes to all of those things, but several of those things will.'",
        "'speaker_4': 'Be.'",
        "'speaker_6': 'Are, are being developed right now. Things like the lane with study and what's what was referred to for March 17th is the active transportation plan.'",
        "'speaker_7': 'Active choices plan annual report.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Okay. Got that answered. All right. So here's my my housekeeping and we are going to take a break. Let's say. Uh, yes, Mr..'",
        "'speaker_4': 'That one option that we've discussed is.'",
        "'speaker_7': 'Since you have a lot of speakers on Sunshine.'",
        "'speaker_0': 'I'm getting to that. Thank you. I'm one option we have. We're going to take a break and take a ten minute break. What I would appreciate from the audience, could I get a show of hands because we have a couple more items.'",
        "'speaker_0': 'What do we have, madam? Quick. We've got three items. Yes. Okay. So I'm guessing that we have a lot of speakers on the last one, which is item six is about the Sunshine Ordinance five. So it is there.'",
        "'speaker_0': 'Raise your hand if you intend to speak on item six. E Okay. So that looks like one, two, three, four, five. Okay. So that is five. Okay. And what about we've got item six. C is looking at four weak requests for qualifications for West Midway Project.'",
        "'speaker_0': 'Two speakers, any more than two, raise your hand if you wanna speak for Ms. on West Midway. And then there is the one about the personal wireless service facilities in public right away zero which.'",
        "'speaker_1': 'Is in one speaker on.'",
        "'speaker_0': '9a9a Okay. So Counsel, I would suggest that we take that in with the most speakers first, but I am but one person. What does everyone think?'",
        "'speaker_3': 'I'll move for that to change the agenda to do so.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'Okay, so then that would be should we go in the order of the speakers? So we do the Sunshine Ordinance, the West Midway and then the small cell.'",
        "'speaker_3': 'So just move 60 next.'",
        "'speaker_0': 'Yeah. Okay. Does that work? All right, so we have a motion. We have a second all in favor. I, i okay. That is, that carries four to nothing. I miss village. Just had to step out, bitch. So she didn't vote.'",
        "'speaker_0': 'Okay, ten minute break. We'll be back and we'll start with such an ordinance.'",
        "'speaker_7': 'Yes.'",
        "'speaker_0': 'When? Just take their seats, please. We will get started. The staff hangs on my every word.'",
        "'speaker_3': 'We all.'",
        "'speaker_0': 'We all do. Yeah. I have children.'",
        "'speaker_2': 'I'm used to being ignored. It became.'",
        "'speaker_0': 'So high. Audience I apologize for the delay. Usually when I say a ten minute break, it's 10 minutes. But just we had some housekeeping details that couldn't be avoided. So. Counsel, you're not going far, right? Vice Mayor Okay, you and we have had a little agenda, possible agenda change come up.'",
        "'speaker_0': 'But I want to just take your temperature, as it were. So on the West Midway item, that's item six. See, there are some couple of possible ways we could proceed. We could continue this to a date certain, uh, we could.'",
        "'speaker_0': 'Mr. City Attorney, help me out. We could move forward tonight.'",
        "'speaker_5': 'You could. The Council could choose to move forward tonight. Or you could choose to take a vote to continue the item to a date certain you have flexibility in how you could choose to proceed.'",
        "'speaker_0': 'Okay. So, um, well, we have two speakers, but we're not going to hear from them if we're going to continue. So first, I want to do the housekeeping from the council. So counsel, your thoughts. Just go down the line.'",
        "'speaker_0': 'Now, I won't start with the prison history on my right, Councilman Brody.'",
        "'speaker_3': 'I just moved my seat. I'd actually like to hear it and then figure out why we might want to continue it or not.'",
        "'speaker_0': 'Councilmember dissuaded Councilmember Desai.'"
    ],
    "West Midway Project Development, Negotiators, Surplus Land Finding, and RESHAP Infrastructure Design.": [
        "'speaker_6': 'Well, you know, if if it's a matter of crossing our T's and dotting the I's, then I'm all in favor of continuing it to a later time.'",
        "'speaker_0': 'Okay. My preference is continuing to a date certain because I want to just have as much information as possible to make an informed decision. Vice Mayor.'",
        "'speaker_4': 'I'd like to hear tonight.'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_9': 'Deciding vote. I actually would like to continue it in light of the question that was raised.'",
        "'speaker_0': 'Okay. So that is a 22 motion. Okay. So you can make a motion.'",
        "'speaker_9': 'I'll move to continue the item. Do we have a date?'",
        "'speaker_0': 'Certain to have a date certain? I would like a date. Certain.'",
        "'speaker_7': 'I'd recommend March 3rd.'",
        "'speaker_0': 'Okay. So the first meeting on March 2nd. Okay. We have a motion. It's been seconded to continue the item to March 3rd, the first council meeting in March. Any discussion at all in favor? I oppose.'",
        "'speaker_4': 'No, no.'",
        "'speaker_0': 'Okay. The motion carries 3 to 2. This motion will be heard, as we noticed and heard on March the third. To those in the audience who came to speak on this item, I apologize. But once in a while an anticipated events occur and we just play the hand we're dealt.'",
        "'speaker_0': 'So thank you and see you soon. Okay. So then we we had decided before the break that we were going to go with the item that has the most speakers and that is item six. E Madam Clerk.'"
    ],
    "Ordinance Amendment to Sunshine Ordinance Provisions and Enforcement.": [
        "'speaker_1': 'Introduction of ordinance amending the Civil Code by amending various provisions of Article eight Sunshine Ordinance of Chapter two Administration, including provisions related to public access to public meetings and public records and Sunshine Ordinance enforcement, including recommendations to eliminate the null and void in order to cure remedies and replace such remedies with the authority for the Open Government'",
        "'speaker_1': 'Commission to issue recommendations to care and correct.'",
        "'speaker_0': 'Thank you. And we have a okay. And so we have Assistant City Attorney John Lay to do the staff report. Good evening.'",
        "'speaker_6': 'Madam Mayor. Members of the council, members of the public. John Lee, on behalf of the city of Alameda, Alameda City Attorney's Office. I'll keep my remarks brief.'",
        "'speaker_0': 'And just be sure that you speak right into the microphone so everybody who's out, you're seeing.'",
        "'speaker_6': 'Things. So our office was charged with preparing amendments to the Sunshine Ordinance, and we did that in consultation with the city manager's office. And we worked very closely with the city clerk's office, in part because they have a great deal of institutional memory and knowledge in this area, and we thank them for their assistance on that.'",
        "'speaker_6': 'I'd also like to acknowledge the Open Government Commission when we prepared the amendments which ended it for their discussion and recommendation, and they provided us with very thoughtful and thorough analysis. And I just want to state that we respect the work that they do, and we want to I want to thank them for the input that they'",
        "'speaker_6': 'provided and the ordinance currently that you have before you. Proposes ten amendments. The first thing I want to do is sort of emphasize that. In nine out of the ten amendments, our office and city staff and the Open Government Commission were able to find common ground.'",
        "'speaker_6': 'Nine out of the ten we were in agreement. There were probably two minor amendments to those nine, and our office agreed with those amendments as recommended by the Open Government Commission, and those amendments are reflected in the staff report.'",
        "'speaker_6': 'That is, of course, leaves one amendment that there wasn't such agreement, which is sort of the elephant in the room I'm referring to, obviously the null and void remedy. You might recall that our office did prepare an opinion on this remedy, and I'm not here to reiterate or rehash any of that.'",
        "'speaker_6': 'I will just simply say that we continue to hold that opinion and we have been keeping an open mind in terms of new facts or law. And that hasn't changed. But I'm I do want to emphasize that if the council does wish to make the amendments as proposed by our office and staff, what sort of remains, even'",
        "'speaker_6': 'if it were removed and the agency would still have many of the matters they currently have within their purview, they'd still be able to review council actions and all boards and commissions subordinate to the council. They would still be able to impose fines for violations of both portions of the ordinance, public meetings, public records.'",
        "'speaker_6': 'And they would also, based on our recommendation, be able to make recommendations concerning the complaints that they hear so they could make a recommendation, for example, to care and correct. That would still be within their purview, even if the council chooses to take out an old board remedy.'",
        "'speaker_6': 'So I'd like to close with this idea that the the amendments here before you are actually the result of great civic engagement, you know, fierce advocacy on the part of the agency for greater transparency through thoughtful legal analysis, not just from our office, but also members of the public.'",
        "'speaker_6': 'And with that, we recommend that you adopt excuse me, introduce the ordinance up first reading based on staff's recommendation. If you have any questions, I'm here to answer them.'",
        "'speaker_0': 'So, counsel, before we hear from our public speakers. Does anyone have any clarifying questions about the report?'",
        "'speaker_9': 'Councilmember Vela Yes, I'll go ahead and start ahead of Councilman Brody so that he doesn't have to lead on every might. My question is, who recommended that this provision, this null and void provision, be added to the ordinance?'",
        "'speaker_9': 'How how did it come about?'",
        "'speaker_6': 'I will say that I tried my best to research the issue on my own, and I wasn't able to determine. I know there have been allegations that it was actually prepared by a member of the city attorney's office, none of whom are currently here.'",
        "'speaker_6': 'I don't know the definitive answer. To tell you the truth.'",
        "'speaker_9': 'Okay. And then.'",
        "'speaker_6': 'And.'",
        "'speaker_9': 'Similarly, are there any other cities that have a similar commission or body that that has this type of power? So our cities.'",
        "'speaker_6': 'Understood. And so when we started this process and we did do some research on other cities that have sunshine ordinances. Actually, the First Amendment coalition keeps a great list of all the cities. As you can imagine, it's a topic of their utmost concern.'",
        "'speaker_6': 'And we identified 14 jurisdictions that we surveyed and none that we were aware of, and that was probably six months ago, roughly had this null and void remedy and sort of in a bunch of caution. And to make sure that we are thorough, we actually serve those jurisdictions again to see if any changes were made and none'",
        "'speaker_6': 'that I'm aware of.'",
        "'speaker_9': 'Did you review the meeting, the meeting minutes from when this ordinance was enacted as part of your research?'",
        "'speaker_6': 'I did I did review the meeting minutes. My recollection was that they were quite sparse. Maybe they were more action minutes. I do recall reviewing the tape as well.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Then, Mr. Abbott. Councilman Brody? Yeah, well, let's go. I mean, it just makes up the order a little bit. Councilmember Desai, you go next.'",
        "'speaker_6': 'Is a quick question. Was the concept of null and void, was that in the original ordinance that resulted in the creation of the of the AGC? And so at least so if so, then we know a time at which point it was adopted.'",
        "'speaker_6': 'So I obviously wasn't here when that was adopted. My recollection was that the Sunshine Ordinance was adopted around the same time. That is that the sort of organic statute that created or memorialized the duties and powers of the Open Government Commission, they were around the same time as my understanding it's in a different chapter of the AMC'",
        "'speaker_6': ', but it was around the same time. Okay. Quick question. And it's more of a broad question, and I don't know if now's a good time to answer it, but I'll ask it nonetheless. What harm is there if we keep the concept of null and void in the ordinance?'",
        "'speaker_6': 'What kind of harm results from that? Sure. And it's hard to tell with a crystal ball. I mean, obviously you've got our opinion out there. And so it's a null and void remedy is used again. There is this sort of incongruence about where our office stands and obviously our office is opinion may or may not change, but'",
        "'speaker_6': 'there there's that risk. Okay. Thank you.'",
        "'speaker_0': 'And I would just ask Mr. Lay for those in the audience in watching who might not have reviewed the staff report. In your opinion, can you just encapsulate a little bit about the the precedent that this would set and.'",
        "'speaker_6': 'Sure. You know, one thing that I've remarked time and again about this remedy is that although it's been in there since its inception, I think it's been used only recently. And are you asking sort of for the for the legal position I'm sorry.'",
        "'speaker_0': 'I shouldn't make this a guessing game. I highlighted in the staff report on page six of of of your staff report about the middle of the page, a little below that the well, you describe how the city council's authority to legislate locally stems from its constitutionally granted charter charter city powers.'",
        "'speaker_0': 'Sure. And you quote some legal authorities noting the limitation on the power to delegate legislative authority and then talk about the null and void that I'm.'",
        "'speaker_6': 'Happy to bring.'",
        "'speaker_0': 'I want to take it from there.'",
        "'speaker_6': 'Yeah, I think there are really to I mean, if you look at this from sort of a lost perspective, I mean, the general.'",
        "'speaker_0': 'Wants one.'",
        "'speaker_6': 'Yeah, yeah. The general rule is the one that we're citing. And there have been refinements to that general rule. But the general rule essentially states that when you have a policymaking body that's vested with it, with the power, with various powers, and in this case the legislative power to make local law, they cannot delegate that authority.'",
        "'speaker_6': 'And what is meant by that is that and the purpose behind that is to is to ensure that the policymaking body makes the fundamental policy decisions. Now, there has been some refinements on this general rule over time, including Supreme Court precedent.'",
        "'speaker_6': 'Ah, Supreme Court, California Supreme Court that talks about when you can do delegation. But we view that authority as separate from sort of the general rule. So the question really for us is, is does the null and void remedy, where does it fall within the law, within the jurisprudence?'",
        "'speaker_6': 'Is that more of the general rule or is it the refinement? And the refinement is one that you're all very familiar with. You've done it multiple times where you make the overarching decision, the fundamental policy decision, and you leave on to some executive or employee to decide how to fill in the blanks, because it's fully recognized by'",
        "'speaker_6': 'the courts that the Council can't make every single policy decision possible to ensure that every eventuality is provided for. Instead, what's recognized is the Council may make sort of a fundamental and you did this with the rent ordinance, you did this with cannabis, and you've done it with various other ordinances where you create this regulatory regime, you'",
        "'speaker_6': 'decide that that's what you want to do and you let staff. Fill in the blanks. And for us, we don't believe the null and void remedy falls within that second bucket where you're just filling in the blanks. That's not what's occurring here, at least in our view.'",
        "'speaker_6': 'For us, it's more of a fundamental policy decision, in part because the power to make local law includes the power to repeal it. And for us, we feel it falls more into that box. I hope that.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'And kills over disagree. You finish with your clarifying questions. You can go. No, no, stay with you and then we'll go to accountability.'",
        "'speaker_6': 'On this subject matter. Some have pointed to Article three, Dash two, as language that allows policymaking boards to establish concepts like the null and void. And they're the way that I receive emails about, you know, referencing 3-2 is when people write the council.'",
        "'speaker_6': 'May three, Dash two says the council may confer upon any board or office powers and duties. Now, is it correct, though, that there is a part of 3-2 that oftentimes is left out? And that part is the predicate because a full reading of 3-2 is the council may confer upon any board or office powers and duties, and'",
        "'speaker_6': 'the missing predicate seems to be additional to those set forth in the charter so that we can. What that means is the council can confer upon boards and policymaking bodies, powers and duties, but it has to be consistent with certain parts of the city charter.'",
        "'speaker_6': 'So if the city charter says that ultimate power making authority rests with the city council, which it does in section three, dash one. Mm hmm. Yeah, I agree. I think that's certainly one possible interpretation of it. Sort of the meaning of additional and whether it means additional to those powers, to those boards and commissions that are actually'",
        "'speaker_6': ', you know, set forth into the charter. That's certainly probably the easiest interpretation to take, that it's additional to those. So if not so stated, it's not clear that it's provided for. I think that's sort of the gist of your point.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Okay, Councilman Brody, thank you.'",
        "'speaker_3': 'My questions are on other sections, so hopefully you can answer them. So going to the. I think it's. Section one, Part D policy body shall mean the following blah blah, blah. Okay. I'm looking at the the draft ordinance, but I think that's what it is.'",
        "'speaker_3': 'Yeah. So I mean, there's the housing authority board fall under that purview.'",
        "'speaker_6': 'Under the definition of a policy body, right. I don't believe so, because I it's not clear to me that they make policy on. Well, they certainly I know that there they observed the the Brown act and so their their meetings are agenda I's a need a lot of the sort of parallel requirements that we have in our'",
        "'speaker_6': 'sunshine ordinance. Now now if you're asking if they are sort of fall within the purview of the Sunshine Ordinance, you know, I have not thought about that.'",
        "'speaker_3': 'Can you? I could look this up, but could you remind me what? Five, four, 952. Is that what.'",
        "'speaker_6': 'That that that's the portion of the Brown Act that actually defines what a legislative.'",
        "'speaker_3': 'Body. So that's the Brown acts. Somehow their subject has a policy body under the Brown Act. So we're defining a policy a policy body as it's defined under the Brown Act. So it would think I would think that they would also be subject to our Sunshine Ordinance as well.'",
        "'speaker_6': 'Understood. I you know, as I sit here, as I stand here in front of the dias, I mean, I that sounds like a sensible interpretation. I guess what I'm saying is that I don't know that we've actually sort of connected those dots.'",
        "'speaker_0': 'Okay. I want to hear from the city attorney, Ben san, please.'",
        "'speaker_5': 'So, Councilmember, I believe that because the housing authority is currently a separate legal entity, much like the school district, they're not subject to the Sunshine Ordinance.'",
        "'speaker_3': 'Okay. Maybe we could suggest that they adopted voluntarily. So my second question, maybe I'll go back to the way my colleague was describing it. So two Dash 91, dash five.'",
        "'speaker_6': 'Mm hmm.'",
        "'speaker_3': 'So the audience requires all documents material to an agenda item accompany the agenda. So, I mean, we just had an instance today. I know there's a lot of work that needs to be done to put these presentations together, but I mean, should that presentation, which I mean, arguably was material to an agenda item, I mean, should that'",
        "'speaker_3': 'have been something that was part of the agenda or. Or is that an exemption? And if it's an exemption, then maybe this is not something we want to put in there.'",
        "'speaker_6': 'Which presentation. I'm sorry.'",
        "'speaker_3': 'On the traffic.'",
        "'speaker_6': 'B Oh, I wasn't here for the traffic spillage. I'd say sometimes.'",
        "'speaker_3': 'We have presentations that accompany agenda items should be put on the agenda and sometimes we get them at the last minute. So I'm just wondering where that type of presentation would fall under to Dash 91.5?'",
        "'speaker_6': 'I'm not sure, but I can I can tell you that sort of the intent of the of the amendment was to really just take the language and ensure that it's not just sort of general materiality, in other words, just general relevance to relevance to the entire topic and more about, you know, what the agenda, what the action'",
        "'speaker_6': 'that's being taken. So we were trying to kind of narrow that a bit so that it was a lot more clear. And I'm I'm not sure that I've answered you, but.'",
        "'speaker_3': 'I mean, who is to decide if it's materials at the object's job.'",
        "'speaker_6': 'I suppose it would be if there was a violation or or alleged violation.'",
        "'speaker_3': 'Okay.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_3': 'I mean, to me, it's just it's unclear. Sure. If it's unclear, then it opens up room for interpretation and controversy. So.'",
        "'speaker_6': 'Sure and.'",
        "'speaker_3': 'Little concerned.'",
        "'speaker_6': 'About that. I understood. And I would just.'",
        "'speaker_0': 'So I will just remind people we're asking clarifying questions about the staff report. Council will have ample time after we've heard our public speakers to do a discussion.'",
        "'speaker_6': 'Now, make not just one note just really quickly and I don't want to leave the impression that the logic will simply be sort of grasping in the dark to figure out what this means. The object is staffed by our office, so they would have the ability to consult our office in terms of determining whether or not there'",
        "'speaker_6': 'was a violation or what was considered material in light of these changes.'",
        "'speaker_3': 'Okay. And then my last question was, so you have to dash 91 that 1515, which there was a discussion about that vis a vis resolution 15382 which prohibits ceding of time. And then we have to dash 93.7, which says this provision states that all local laws inconsistent with the ordinance are superseded.'",
        "'speaker_3': 'So I mean, is that 15382 kind of in conflict with two dash 93.7.'",
        "'speaker_6': 'I'm sorry, where's the conflict in the two sections?'",
        "'speaker_3': 'Well, the the Sunshine Ordinance allows you to cede time right and point a spokesperson and 15382 got rid of that option and that's but yet the Sunshine Ordinance says it takes precedence over anything else. So I just wonder if there might have been an issue there.'",
        "'speaker_6': 'Sure. But I'm not aware of it conflicting anywhere else. And to the extent that it does, we can certainly address that in a subsequent amendment. But we did want to clarify that. We wanted it to be consistent with council adopted resolution.'",
        "'speaker_0': 'Right.'",
        "'speaker_6': 'We primarily made the to the extent permitted by law to clarify.'",
        "'speaker_0': 'Mr. Lane, I'm going to interrupt you just so your boss can speak. Mister said.'",
        "'speaker_5': 'So. Council Member I think your point is well taken that the the sunshine ordinance does. You're right the sunshine ordinance allows speakers to see time 15382 does not. And given that one of the reasons we're bringing this forward to you is is our thinking that because you when you adopt it 15302 later, that that is the policy'",
        "'speaker_5': 'the council wants to effectuate. And therefore, we're proposing the amendment to make the Sunshine Ordinance consistent with the Council's will on that particular issue. If if that is not the Council's will, we're happy to additional changes.'",
        "'speaker_3': 'Well, that was clairement. So then the final question. Sorry. So then does it are we applying that to the 93.7 prospectively or retrospectively?'",
        "'speaker_6': 'Only it would have to be prospectively, I believe. I mean, unless we have a provision that states that it's going to be retrospective, there's a general rule against retrospective.'",
        "'speaker_3': 'But it sounds like.'",
        "'speaker_6': 'Retroactivity.'",
        "'speaker_3': 'Skews it sounds like we did kind of make it retroactive. That said, if we do if. There's something written before then. This supersedes it. But going forward. Well, you can think about that. We can talk about it when it's time to discuss.'",
        "'speaker_0': 'Okay. Any further clarifying questions of counsel before we go to our public speakers? Let's go to our public speakers.'",
        "'speaker_1': 'And we now have eight speakers. So.'",
        "'speaker_0': 'So when we have eight speakers, the individual speaking time goes down to 2 minutes. But rest assured, 2 minutes is a pretty good, long period of time. So to keep things moving along, my goal is always to get us out on the same evening that we started the meeting.'",
        "'speaker_0': 'I will. And again, no cheering boos doing the wave, what have you. I'm just listened respectfully to speakers, but listen for your name. If you're the next speaker, put yourself out in a position to be next to the podium.'",
        "'speaker_0': 'Okay. I'm Adam Clark.'",
        "'speaker_1': 'We have Susan Hauser, Steve Larson, then Bill Smith.'",
        "'speaker_8': 'Okay. Good evening, Honorable Mayor Ashcraft, Vice Mayor Knox White and council members. The League of Women Voters of Alameda was a strong advocate for the development of the Open Government Commission or the Commission and participated in its development through the Sunshine Task Force in 2010.'",
        "'speaker_8': 'You are now being asked to reconsider your decision and remove the main enforcement mechanism from the Commission. We request that you oppose doing so. The Commission stated that the enforcement role is essential to our democracy and the main purpose for the Commission's existence.'",
        "'speaker_8': 'The City Attorney states that the City Council cannot delegate or grant legislative authority to the Commission, implying that the enforcement provision is legislative. It is not legislative. This enforcement authority did not abdicate any of the City Council's legislative power.'",
        "'speaker_8': 'The Commission simply evaluates and rules on process issues, not the merits of the Council's legislative action. In summary, the enforcement provision is not legislative. We recommend that after a complaint about improper process is filed, you suspend further action until the Commission has had time to investigate before holding the next and certainly the final hearing on the legislation'",
        "'speaker_8': '. The Open Government Commission is more likely to be viewed by the public as a neutral arbiter of council adherence to legislative procedures than the Council itself. The Commission has also proven to be a more accessible arbiter than a court system that requires expensive attorneys.'",
        "'speaker_8': 'We urge the City Council to reject the proposed amendments to the penalty section of the Sunshine Ordinance. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Steve Larson. Then Bill Smith, then Kurt Peterson.'",
        "'speaker_11': 'Good evening, Mayor Ashcraft, council members. I'm Steve Swanson and I'm here to speak in opposition to the proposed ordinance and to demand it be tabled. I want you all to understand that it's not that we don't trust you.'",
        "'speaker_11': 'It's just that we don't trust you. You haven't done any favors for the people of Alameda in the last two or three years with this million dollar payout to the former city manager helping yourself to $40,000, borrow money to pay your personal attorney's fees, holding a special election costing the people of Alameda $700,000 for the sole benefit'",
        "'speaker_11': 'of one developer and failing to bill that developer for the $700,000 additional cost. And lastly, you're not doing the people of Alameda any favors by trying to tamper with Measure A. The sunshine ordinance is put here and we want to keep that sunshine shining on your conduct.'",
        "'speaker_11': 'Respectfully request that you table this ordinance. Thank you.'",
        "'speaker_0': 'Thank you. And the next speaker is Bill Smith.'",
        "'speaker_11': 'Mayor Ashcroft, Vice Mayor Knox White and council members. I want to thank you by living by the spirit of the Sunshine Ordinance, a marijuana bill. You passed it, but you went back and reheard it later, eventually. So thank you for that.'",
        "'speaker_11': 'As you just heard from Mr. Sjstrm, there are a number of people in the community that don't trust the council for a number of things. And I think this is an opportunity for you to earn back some of that trust for certain areas.'",
        "'speaker_11': 'And and that is by keeping the Open Governance Commission, making sure that they have enforcement powers. And so the preferred option is, as you heard from the League of Women Voters, to leave the null and void in and work for that.'",
        "'speaker_11': 'And you heard the we have a couple of attorneys, Robert Sumwalt and Paul Foreman, both have opinions that would slant more and direction of the alternative, that this council does have the power to delegate, that those things you might find that the housing authority and also the electrical utility probably make policy, too, is my bet.'",
        "'speaker_11': 'And the housing authority used to be part of the city at one point. So what happened and I think it was during the time the Sunshine Ordnance was in effect, that's another opportunity you might have had. There's also a procedural way to do this.'",
        "'speaker_11': 'You can just decide, okay, you're going to suspend, as you heard the league, when voters ask you suspend all action. And once somebody files a complaint and it never becomes law, so it doesn't have to be declared null and void, you just suspend action until it's clear whether it's a sunshine committee and you've heard and you've disposed'",
        "'speaker_11': 'of the the complaint. And then you can also in an emergency. If this I know something's come up an emergency ordinance, you're going to require something like a five unanimous vote of all sitting council members, which would be five, to go ahead and override the the sunshine the government committee to get something passed in a hurry if'",
        "'speaker_11': 'there is a complaint about it. So you have an opportunity here to maintain confidence, increase confidence.'",
        "'speaker_0': 'Thank you, Mr. Smith. And the next speaker is.'",
        "'speaker_1': 'Curt Peterson, then Paul Foreman, then Trish Spencer.'",
        "'speaker_2': 'Okay.'",
        "'speaker_7': 'Good evening. I already introduced myself earlier. I'm not surprised, Jim, that you don't remember a lot of things about that first meeting.'",
        "'speaker_0': 'Mr. Peterson. We do not countenance ad hominem attacks from the podium. Will restart your time. But you are not here to address individual council members, but the entire body. Wait a.'",
        "'speaker_7': 'Second. It's an actual fact. Mayor, I can't state fact. I was making a point that I too do not remember all the things that were in the Commission's bylaws and rules. It was presented to us by our city attorney, Janet Kern, at that time.'",
        "'speaker_7': 'Okay. Laura was also there. Jim, was there two other people besides myself who were the original people on the commission were there. We took the bylaws without any question, no discussion whatsoever about it. I brought up one key point in that is someone makes a complaint and that if the board doesn't uphold their decision or what their'",
        "'speaker_7': 'ruled, the ruling was in their favor, that they were banned for making a request. Again, I think three or five years. Well, a long time. I thought that was inappropriate. But the bottom line is, we were given the the right to do that.'",
        "'speaker_7': 'That hasn't changed. That was in the original one. I want to say, whoever the attorneys team here brought up more questions than answers about this new ordinance that you're talking about. I cannot believe you would respond to it.'",
        "'speaker_7': 'He can't give us any answers. It's kind of like the same defense Republicans are doing as far as in the Senate right now. I want some answers. Not well, I don't know. The bottom line is, if you had a city attorney that was doing their job the night that this was in question, they should have actually aired'",
        "'speaker_7': 'with caution rather than not saying we're going to go along with it. I don't see a problem. Why not just say, wait, we'll look at this. Let's take a step back. We'll make sure you're taking all the teeth and all any kind of authority that the Open Government Commission has away.'",
        "'speaker_7': 'And that's a shameful.'",
        "'speaker_0': 'Q Thank you, Mr. Peterson. Our next speaker is Mr. Foreman. And be sure to speak right into the speakers. So we get into make sure to speak right into the microphone so we can all hear you.'",
        "'speaker_7': 'In answer to councilman's valid question about where this all came from, read the minutes of October 18th, 2011, starting with page four. City Council knew exactly what they were doing when they passed this ordinance. They specifically said, We do not want council policing its own process.'",
        "'speaker_7': 'And that's what they did. They were proud of it. They unanimously passed it and their city attorney vetted it. Now, I must state that the staff report is dead wrong in saying the ordinance had not been reviewed since 2011.'",
        "'speaker_7': 'I served on the commission in 2015 when we reviewed the ordinance line by line and made several revisions there to a city attorney. Was there didn't say a word about this enforcement provision. Both Attorney Schwartz and myself have conducted email useful dialog with Council member Knox White, and we've written to council and to the city attorney.'",
        "'speaker_7': 'However, our city attorney has not seen fit to dialog with us and attempt to resolve these differences. We are not attorneys litigating against the city for the benefit of our clients. We are citizens of this community or donating our legal research in the public interest.'",
        "'speaker_7': 'The A.C.T. letters suggest two options that could retain significant enforcement powers in the AGC, while avoiding the issue of delegating legislative powers. If neither of those suggestions satisfy council or the city attorney, I suggest that we follow the procedure followed in 2011 before the audience with adopted appoint a Sunshine Task Force, including a representative of the City'",
        "'speaker_7': 'Attorney's Office to resolve our differences and present recommendations to council. I would be happy to serve on such a group. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'And Spencer, then Serena Chen, then Brian Schwartz.'",
        "'speaker_2': 'Good evening, counsel. Staff I agree with the city attorney's recommendation on this. I want to thank you for your research. I did hear the comments of members of the public that they do not trust council. I would submit that the response of not trusting council is not to implement something that is illegal or to continue with something'",
        "'speaker_2': 'that is illegal. I think the body of law and the position that the attorney, our city attorney has made is correct. This has never been challenged in our city. It's the first time it's happened. I think that's why we're all looking at it.'",
        "'speaker_2': 'We weren't looking at it before because it hadn't occurred. That's why we're looking at it. The night of the ordinance, when it came to us, we did look at our city attorney. They did make a decision of it being within the Brown Act.'",
        "'speaker_2': 'When it came up for the second reading again, the issues were made. The city attorney weighed in. This is actually the third city attorney that has ruled on has come out on this. We had Janet Kern, we had Michael Roush, and now we've had your office.'",
        "'speaker_2': 'They have all landed on the same position of counsel being able to move forward and take action. And so I disagree that if people don't trust the council, you don't vote them in or you recall them, you don't implement the wrong law.'",
        "'speaker_2': 'It is very important that this law is it is clear. And so I hope that you do. And and in regard to the Open Government Commission, they're like every other commission. They should be they make recommendations to council.'",
        "'speaker_2': 'They do not supersede council. They don't. So thank you very much and good job. City Attorney.'",
        "'speaker_0': 'Thank you. Our next speaker is Sabrina Chen Mischief.'",
        "'speaker_8': 'But evening, Mayor Ashcroft, members of the council. My name is Serena Chen. My middle name is Theresa, which is named after the saint of lost causes. And it starts with a T, and it rhymes with trouble. Basically, I'm the person who filed the Sunshine Ordinance complaint at the urging of several elected officials in this city, not on'",
        "'speaker_8': 'the council, who, after I told them what had occurred, insisted that I file a complaint and challenge this. I come to you just as a resident of Alameda of over 20 odd years, and I spent 27 years as a public advocate for smokefree, air laws and tobacco control laws.'",
        "'speaker_8': 'So as in that role, I've attended over 400 city councils, school board and whatever meetings in every single city in this county and in neighboring cities as well as neighboring counties. Every single time anything came up on the agenda, that was in the discussion of the city council that I attended that was different than what was being'",
        "'speaker_8': 'proposed in the original agenda. The city attorney or someone on that council would lean into the mic and say, Excuse me, Madam Mayor, or excuse me, but I think if we're going down this route, we need to look at whether we want to go with the provisions we have as written or whether we want to rewrite it'",
        "'speaker_8': 'and bring it back in two weeks. Thanks to that law, I went to the city of Dublin so many times because they kept changing provisions that I saw the hills turn from green to yellow to brown. I wanted a residency there, but it was a pain to have to adhere to the Brown Act.'",
        "'speaker_8': 'But it was also something that I felt was part of fairness and part of how you run a democracy and good government.'",
        "'speaker_0': 'Thank you, Mrs. Chen. Our next speaker is Mr. Schwartz. Yes.'",
        "'speaker_11': 'Madam Mayor. And Council members. My name's Brian Schwartz and the current chair of the Open Government Commission. I'm a civil rights lawyer locally. I have the greatest respect for all of your volunteerism in coming and dedicating all these hours, and also for all the citizens who come here late on a Tuesday night to do this because of'",
        "'speaker_11': 'their civic engagement. And that's really what I'm here talking about, because the value that we have of openness and encouraging this kind of civic engagement is why we have the Open Government Commission, and it's exactly why it's so important to reject this amendment at this time and give it some more time to figure out the right way'",
        "'speaker_11': 'to go about this. The I'm concerned by the city attorney representative's effort to minimize what happened with the open government, commissioned by suggesting, first of all, by burying the lead and saying we agreed on nine out of ten things when the one thing that was really driving this was the one we disagreed on.'",
        "'speaker_11': 'And then by saying there wasn't such agreement, when in fact unanimously and very strongly the open government commissioners appointed by all different Bense from the city rejected this idea just as they had of of of eliminating the authority and just as they had previously remanded back to council the the ordinances on the on the dispensaries.'",
        "'speaker_11': 'And I think that's very important. Commissioner, I'm sorry. Councilmember Desai I made it really important question, which was what harm is there here? And the answer was very telling. It was it's hard to tell. And that there's might be potentially a sort of incongruence.'",
        "'speaker_11': 'Okay. On the other hand, what's the harm of not eliminating null and void? I mean, I'm sorry, of eliminating null and void. It is that we have an absence of due process, Brown Act violations and people suing the city who otherwise wouldn't need to.'",
        "'speaker_0': 'Thank you, Mr. Schwartz. And our next speaker. That's. That's all of our speakers. Okay. Numerous speakers. No one wants to take a speaker, slip out. Okay. With that public comment is closed and we come back to the city council.'",
        "'speaker_0': 'Who wants to lead off on this one? Councilmember Vella.'",
        "'speaker_9': 'Um, so I guess I have a few more questions and incorporate them into my comments as well. In Section nine, we lay out a timeline essentially that starts from when the complaint is filed and it reads 30 business days, which is about six weeks, and that's to schedule.'",
        "'speaker_9': 'The hearing. And then again, a formal written decision on the matter can be at a continued meeting within 30 business days of the conclusion of the hearing or at its next regularly scheduled meeting. And I guess my question to the city attorney's office is, have we you know, it's been raised about due process and timing, and I'",
        "'speaker_9': 'have a concern about these kind of extended timelines. On the one hand, I, I, I understand wanting to have time for parties to meet. On the other hand, depending on the ordinance in question and the impact that it could potentially have, I'm wondering if that sort of timeline really makes sense.'",
        "'speaker_9': 'So do we look at that when when this recommendation was put through and why 30 business days? I mean, that's.'",
        "'speaker_6': 'Sure that.'",
        "'speaker_9': 'The.'",
        "'speaker_6': 'Time the 30 business days, I realize that it sounds like a long time, but part of it is informed by the process that happens to get this thing on calendar. You know, you've got to coordinate a bunch of schedules together and sometimes it doesn't always align.'",
        "'speaker_6': 'And if there's a question about sort of shortening that or making it more aligned with how an ordinance would be sort of rendered null and void so that or that or a clear, incorrect recommendation so that the counsel can kind of get to it in time.'",
        "'speaker_6': 'That's something would have to involve sort of the city clerk's office, because that's a part of the sort of the nuts and bolts that our office isn't directly responsible for, but we want to be sensitive to those needs as well.'",
        "'speaker_9': 'So I think my concern is we have all these other commissions are former mayor Trish Spencer referenced that we have a number of commissions. Those commissions tend to meet monthly or at least have a date held. Is it possible for us to you know, I get that they're they're they're under this ordinance meeting twice a year.'",
        "'speaker_9': 'But to say sunshine or open government commission, whenever a new commission is convened on an annual basis, come up with regular meeting dates, because it seems to me that it's inherently not transparent to not have kind of dates held because then the person filing the complaint doesn't necessarily know what date it could be heard on the other'",
        "'speaker_9': 'parties that might be of interest. Don't know when that date is, but if we have a date held and the commissioners I'm on the lead abatement JPA, for instance, and, and in October and November of every year we get together and we say, is there a, you know, third Thursday of the month that works for everyone to'",
        "'speaker_9': 'have this meeting? So is it possible for us? Because it seems to me that those are the types of transparency issues that potentially exist, where we could get rid of a provision that says something like 30 business days.'",
        "'speaker_1': 'And I'll just give you some past practice just as a little maybe hopefully helpful.'",
        "'speaker_0': 'You might ask.'",
        "'speaker_1': 'The Open Government Commission. Two meetings are on the first Monday. And so when we've had a complaint, I've always attempted to schedule on that first Monday because then, you know, that's kind of the date that people are used to and whatever.'",
        "'speaker_1': 'But sometimes the complaint, it can't make the date. The complaint is required to be at the hearing. So we've had to have some flexibility to accommodate both sides because the complainant is can't have the matter heard if they don't come to the hearing.'",
        "'speaker_1': 'That's part of the provision. And so we've had to juggle it sometimes to like a Wednesday instead or, you know, if they needed another day.'",
        "'speaker_9': 'But if there is a date that's on the calendar is being held, then the complainant could look at that and know that's the date that the meeting occurs. It's the same thing that happens with the RAC or the planning board.'",
        "'speaker_9': 'You know, if you file appeal to planning board, planning boards meetings or planning boards meetings and you basically make it work. So I'm a little concerned that and I hear what you're saying, it's it's just seems like it's odd that we're allowing potentially a delay in actually hearing a matter that I think is of concern.'",
        "'speaker_9': 'Because if we're trying to legislate something, I think that there needs to be some set process in an expeditious manner to achieving an outcome in that whatever the outcome may be. The other question that I have is, you know, if we remove null and void, what is the remedy?'",
        "'speaker_9': 'So let's say that that and again, you know, is it just that there's a recommendation and why would somebody go to the Open Government Commission as opposed to just filing in court? Because part of. This is really about getting curing the issue as soon as possible and doing it in a way that removes kind of all the'",
        "'speaker_9': 'legalese and removes these legal barriers of having to go to court. And so I'm just wondering what what is then the process?'",
        "'speaker_5': 'So Councilmember Vela, as currently proposed, the process would be that the commission would still hear the matter, just like they would do today. And if they believe that there is a violation, they would issue a recommendation to the originating body, which details their findings.'",
        "'speaker_5': 'And we believe that by having that recommendation and decision be issued, it serves a number of purposes. We believe that that the open and transparent nature of that decision will probably cause the original body to seriously reconsider the decision that was made.'",
        "'speaker_5': 'And second of all, we believe that any decision that was ultimately, you know, an unfortunate hypothetical ignored by the city, that decision would probably be accorded significant way by a court on judicial review. So we believe that that issue decision has multiple important audiences and it serves an important function.'",
        "'speaker_9': 'So I guess the other follow up to that is if there's how does that work? Because the city attorney's office represents the city, but then they're overseeing and advising the AGC. And if the AGC makes a recommendation against the city or against the process, that's been advised by the city, how does that work?'",
        "'speaker_5': 'So there's well-established judicial precedent that allows a government office to establish ethical walls when appropriate, when conflicting bodies are being represented. And this happens fairly regularly throughout the state. And I'll give another example. When there is an appeal to a personnel board, it's another perfectly good example where the city attorney's office may both be representing the decision'",
        "'speaker_5': 'maker, which is the Personnel Board and the Human Resources Department, who is proposing a particular discipline and judicial decisions indicate that a government office can impose ethical walls so that its lawyers can represent both functions faithfully.'",
        "'speaker_9': 'So I think, you know, and my questions are really about the process because I am concerned in having this be a transparent process for people to file complaints. And I want this to be more than just about the ordinance that kind of triggered this whole conversation, because there's other ordinances that we've passed through, you know, emergency ordinances'",
        "'speaker_9': 'and that sort of thing. And I'm concerned if there was an opportunity to say, put potentially hit pause on one of those, what the what the impact would be. But it also seems like some of these issues are process issues that perhaps and what happened with the cannabis ordinance was really unfortunate because of the timing and us'",
        "'speaker_9': 'going out to recess that there it snowballed into a bigger issue and there were longer delays. But it seems like maybe we could explore other procedural ways of streamlining this so that those sorts of issues don't happen and where we could region dice something and hear it sooner and have a way for the item to be heard'",
        "'speaker_9': 'sooner so that we can get resolution on it sooner. So that's kind of where I'm coming from. I, I guess I'm a little concerned about removing the ability to have this be a kind of decision to call, to call the question really on the council without going to court.'",
        "'speaker_9': 'And that's that was the value of this provision when I spoke with some of the people that were on the council at the time was that this would allow that sort of decision to be made with some teeth.'",
        "'speaker_9': 'But but to really put the council's feet to the fire without having to go through a long, drawn out court process. And the benefit to the city was that it wasn't a long, drawn out court process. So I'm a little concerned if that incentive goes away and you have another council in place that then doesn't really care'",
        "'speaker_9': 'what the logic says and moves forward and just keeps the thing on the books. And then we're in a situation where we're in court litigating over this issue.'",
        "'speaker_0': 'Okay. Who wants to go next?'",
        "'speaker_6': 'Happy to.'",
        "'speaker_0': 'Councilmember Desai.'",
        "'speaker_6': 'Well, thank you very much. You know, we do need a tool that allows us, the city council, to catch ourselves in instances when we make decisions. The details and substance of which was not publicly noticed, public noticing is key so that the public so that the people can weigh in on matters, so that they can give us'",
        "'speaker_6': 'their opinions on how we might vote and we on the issues that we might think about as as we deal with these public issues. NULL and void is meant to be that tool. It's meant to be that tool that deals with situations when council comes to a vote and a decision on a topic.'",
        "'speaker_6': 'The public wasn't properly informed about. NULL and void is a tool that supersedes a council decision and therefore represents a power that, when exercised, is above the city council. But the problem with null and void as I look at it, the problem with null and void is that it has no basis in our city charter.'",
        "'speaker_6': 'Instead, the city charter at Article 3-1 vests all power in the city council. It is true that in the next article, Article three, Dash two, Article three, Dash two says that the the council can delegate powers to commissions.'",
        "'speaker_6': 'But Article three, Dash two also says that it can only do so in a manner consistent with the charter. So it has to be consistent with the prior Article three, dash one. So to me that's an important sticking point, is understanding what is the basis of null and void and how does that align with the basis of'",
        "'speaker_6': 'the council's powers? Now, when we talk about powers, the city charter even becomes even more specific. When you look at, for example, Article one, dash two, dash de D, one of the powers that the city council is vested in is the ability to the ability to make and to enforce laws.'",
        "'speaker_6': 'And when you put it all together, three dash, two, three dash, one article, one dash, 2-d. What that means is that the City Council is invested in making powers and rules, and we can delegate that to commissions and boards, but we cannot delegate it in a way that places the council in an inferior position.'",
        "'speaker_6': 'And the way in which null and void is being exercised, I believe, does that. So the remedy is to correct a null and void, but still come up with a tool that deals with situations where the public isn't properly noticed.'",
        "'speaker_6': 'I would encourage us not to be so adamant that null and void is the only tool. It's altogether possible that members of the public, members of the Open Government Commission can come up with a variety of other tools that checks the City Council.'",
        "'speaker_6': 'When we make a decision that was not public informed, for example, it's altogether possible. Just thinking off the top of my head. This The Council can create an ordinance that allows the LGC to like like a football referee throw a flag.'",
        "'speaker_6': 'And when they throw a flag and in situations when they clearly point out that a decision was made when the public was wasn't adequately noticed, when that flag is thrown, then subsequent ordinances, council cooking come up with it is that while the decision of the council can move forward, there would still be certain penalties.'",
        "'speaker_6': 'For example, perhaps one of the penalties is in those decisions where the public will see what the public was not fully formed, informed. Then the council has to vote on a 4 to 1 basis on on those matters.'",
        "'speaker_6': 'So it becomes it doesn't altogether eliminate the the decision of the council. It just raises the bar of how to move that that issue forward. So council can still exercise its authority. In other words, these are just kind of off the top of my head ideas that that we might look at, that the public might look at'",
        "'speaker_6': 'as to continue to create the right check on the city council. When we I mean, there are times when we're going to make accidents, when we're going to make some decisions, when we didn't correctly publicly inform the residents.'",
        "'speaker_6': 'But when we create those checks, um, let's do so in a way that's aligned with the city charter. And I have no doubt that there are, there are ways, there are many ways for us to create the remedies that are similar to null and void that are and as effective.'",
        "'speaker_6': 'No one on this dais doubts the effectiveness of null and void. It stopped a certain decision in his track. City Council had to go back and redo that decision. No one no one doubts that. But that decision, though, has to grow out of a basis.'",
        "'speaker_6': 'And that basis is our city charter. And so as we correct null and void. I would hope that the Odyssey and the public as well as City Council figure out ways to do so in a way that's aligned with the city charter.'",
        "'speaker_6': 'And I and I have no doubt that we can.'",
        "'speaker_0': 'Thank you. I mean, you can buy me your next wait.'",
        "'speaker_4': 'Go ahead. Thank you. I I'm going to find myself in high alignment with Councilmember Desai. I appreciate the way in which he laid that out. So I was on the on the Sunshine Task Force with Jeff Mitchell, who was charged with writing the the section for the Open Government Commission, which took a section, and he was the'",
        "'speaker_4': 'former editor of the Alameda Journal. Transparency was extremely important to him. And at every single meeting when we talked about this, the rallying cry from Jeff and others like voters and I would say the other four of us on the task force was that the Open Government Commission needed to have teeth.'",
        "'speaker_4': 'This was not just supposed to be a body that says, hey, there's a problem and then everything moves on. How do we make sure that when they make a finding, something happens that causes the city to kind of sit up and reassess?'",
        "'speaker_4': 'Well, I appreciate that. The staff report in the step reporting that the idea that just a finding that is written that says there's a violation will make the city really reconsider it. I think the one time this has happened shows that that was not true.'",
        "'speaker_4': 'In fact, the city went into full battle mode to tell the ask, you know, basically ask the Open Government Commission to reconsider, not just null and void, but reconsider their decision that a sunshine violation had happened. Right. Everybody put all their power into discrediting the finding of the of the sunshine of the of the Open Government Commission'",
        "'speaker_4': 'rather than just re agenda using the darn thing and having it done. I mean, that was what was kind of silly to me about this whole thing. It was such an easy cure. And yet we spent months talking about this thing.'",
        "'speaker_4': 'So I agree completely with with Councilmember de Sug and others that I mean, obviously, the staff lawyers, three of them now that, you know, from as as they have explained it to me, because I am not an attorney, but well, that null and void is not a legal finding.'",
        "'speaker_4': 'And now that we have all this written about this, it is problematic, you know, that there was a lot of concern around this issue that somebody would sue. There is going to be an issue, whether it's around development or something else that is hot and right, that's going to drive somebody to file a sunshine complaint that's going'",
        "'speaker_4': 'to put us in a legal position. And if we have some, you know, we're going to end up in court at some point in time fighting null and void and in it. So but at the same time, I am not supportive of just removing it and hoping that at the end of the day, the Open Government Commission's'",
        "'speaker_4': 'finding is, you know, it's just a finding that sent and hopefully somebody cares enough to take it back up. So, you know, the way I've been thinking about this, knowing that we, you know, it's problematic for this for this body or anybody to undo the actions of the council.'",
        "'speaker_4': 'You know, we also know that that sometimes actions of the council take a little time to to. You know, we we we give we set up ordinances all the time that take 30 or 60 or 90 days to actually really get up.'",
        "'speaker_4': 'You know, we might pass a law, but enforcement of that law really doesn't happen for 60 or 90 days if a violation is found. You know, I would propose that that we have a sunshine ordinance that requires that that agenda, that item get agenda based on the next, you know, reasonable agenda for consideration.'",
        "'speaker_4': 'And that that consideration be both a finding of concurrence or non concurrence with the with the Open Government Commission's finding, but also that it would be that it would include a an opportunity to cure the issue. So actually what they would do is actually put some pressure.'",
        "'speaker_4': 'The simplest path would not be to find against the Open Government Commission. The simplest path would be to rehear the item and cure the item. You know, and I think that that if we were to write something that also basically said that we will maintain the status quo during that 30 or 40 day period to get it'",
        "'speaker_4': 'back up on that agenda. Basically, that means that there's, you know, back to the trust issue. There's not that time for, you know, staff or the council to somehow sneakily do a lot of work on the on it while it while it's in existence.'",
        "'speaker_4': 'It doesn't it doesn't remove that. But it but it basically gives the the the public the opportunity to come back to that body at a publicly at a properly noticed meeting and to weigh in not only on whether there's violation, but weigh in also on the issue itself, publicly noticed at that point in time, it's you know'",
        "'speaker_4': ', I don't want to you know, it's not the same as null and void. It does not undo that. I've heard that. Oh, it's not on doing it because the council can also pass it. But if the council doesn't repass it, it's been undone that I do.'",
        "'speaker_4': 'You know, I, I am convinced of that. Yeah. I'm going to end by just sharing a quick story. As an advocate, I went to the. California Transportation Commission. They badly noticed something that was very significant and had a big timeline.'",
        "'speaker_4': 'And we filed a complaint ahead of the meeting that that they had not noticed this properly. And then because they didn't know who I was, I sat with with the staff and the county and the council members. The staff said, don't worry about it.'",
        "'speaker_4': 'You just pass it tonight, give everybody the assurance that it's going to happen and we'll just bring it back and notice it in 30 days. Right. And then they realized that I was there and everybody ran off and and huddled separately.'",
        "'speaker_4': 'I want to make sure that we're not getting ourselves in that situation where basically we you know, it's just that the finding is just kind of perfunctory. I think Councilmember Vela spoke, too, that there needs to be something that puts a little bit more teeth in that, which brings it back and puts it on the dais and'",
        "'speaker_4': 'on tape and allows people to stand up and speak. And so if we can come to something that replaces null and void with with an acceptable alternative, you know, I can support it. But, you know, and I'm not I'm not supportive of the staff's recommended language of just removing one void and kind of hoping shame is enough'",
        "'speaker_0': '. Councilmember Councilmember O.D..'",
        "'speaker_3': 'Thank you. Thank you for also letting me not go first.'",
        "'speaker_9': 'Yeah.'",
        "'speaker_0': 'I was working on it.'",
        "'speaker_3': 'And trust me, you're not the Iowa Democratic Party, so we will get out of here on time today.'",
        "'speaker_0': 'Do we have results? I was working.'",
        "'speaker_3': 'So I also appreciate Councilmember De Sykes comments. Sometimes the non-lawyer distills it in a way that we all can understand. I would just add to it that, you know, there's also the restraints of the United States and the California Constitution.'",
        "'speaker_3': 'So we could pass any law we want. We could think it's great because Jeff Mitchell thinks it's great. But if it's not constitutional, you know, it's it's not it shouldn't be there. So and I also appreciate both the suggestion from the vice mayor and the suggestion from Councilmember Dysart, you know, that we do replace it with something'",
        "'speaker_3': '. So there needs to be some teeth to it and there needs to be some calling out of the council. If we do do something that violates the Sunshine Ordinance, you know, like the idea of immediately putting it on an agenda that we either agree or disagree and then move forward one way or the other.'",
        "'speaker_3': 'And then, you know, if somebody wants to sue, I mean, there's an opinion on the sunshine or the Open Government Commission, you know, that will have some weight. And then if the council doesn't really have anything supporting of that, you know, I understand that.'",
        "'speaker_3': 'My only concern here and, you know, I think this is going to not be an issue 99% of the time. So let's not let's not ignore the elephant in the room on what happened here. My my concern is that someone and I'm not saying anyone did this because I think the people on the Open Government Commission exercised'",
        "'speaker_3': 'their judgment based on their understanding of the rules. And I am not saying anything about the person who filed the complaint, but others, not anyone in this room, not anyone who filed a complaint did say to me that they were going to use that to try to overturn the cannabis.'",
        "'speaker_3': 'So and which normally wouldn't be a big deal. Right. But the problem that happened was there was an election, there was a swearing in of new people that many people in the community thought had different opinions on it, and that they were going to they were going to use this as a sword to implement their policy and'",
        "'speaker_3': 'not as a shield to protect the public from non transparency. So and I remember my first meeting, we spent the entire time discussing Del Monte, you know, I can't believe it's still not ground broke yet or maybe it's close to it, but it's been, you know, five, five months.'",
        "'speaker_3': 'And I guess the argument that was made and maybe it's a legitimate one was that the agenda item said we were discussing delivery only cannabis and then we just and to dispensary's and yet we decided to bump that up to four.'",
        "'speaker_3': 'So I think that was kind of the that was kind of the gist of the complaint and the finding. So I went back and I remember I went to the meeting on December 2nd, 2014. I sat in the audience back where Catherine sitting now and we had a discussion on the first reading of the De Monte Project'",
        "'speaker_3': 'and 35 speakers got up. I just kind of the minutes and then after the public comment had closed and the DEA and the masterplan were there, there was a suggestion from the dias to reduce the number of housing units from 414 to 380.'",
        "'speaker_3': 'Okay. Well, if you're not a housing advocate, you probably don't care about that. But if you are a housing advocate, you didn't go to that meeting thinking that was going to happen, and you didn't go to that meeting thinking that was going to happen after the public comment was closed.'",
        "'speaker_3': 'So and then we had the second reading, which I wasn't there for, and then we had the thing. So I mean. I think we've got to be careful about what happens during that period when we have a switch, because I think this can be used in a negative way.'",
        "'speaker_3': 'Now, that's the people that, you know, were against this project, probably didn't know this tool was there and didn't use it. But, you know, if there was a motion to move approval of adding an addendum to modify the master plan on the date to not include city portion A partial B reduced the number of housing units from'",
        "'speaker_3': '414 to 380. And they didn't know about it. I mean, to me, that sounds like a worse violation than anything this council was accused of. So if there are some safeguards that can be put in place during that interim, when there's a change or there might be a change to try to undo a council decision, you know'",
        "'speaker_3': ', I'd be open to hear what that is. And the but you know, on the flip side, you know, we don't want to jam things in at the end either. So there has to be some safeguard there. So giving some direction either to the C or staff to develop some replacement that meets the needs that I've heard from'",
        "'speaker_3': 'my colleagues. But also, you know, doesn't allow this to be used as a sword when there's a change of election, I think would be would be would be super critical to me.'",
        "'speaker_0': 'Thank you. So I'll go last and thank you all for your time and attention and your emails, your remarks this evening and to staff who's put a lot of time and effort into this. There is an adage in law which is bad facts make bad law.'",
        "'speaker_0': 'And I do recall the particular item that generated the complaint that Ms.. Chan referenced, and I, I was upset about that, too. But at the same time, we have to follow the law and my colleagues to the left and the right.'",
        "'speaker_0': 'Councilmember Desai again, Vice Mayor Knox, while I think articulated very well, I come at the remedy a little differently what our authority is, what our authority is, and we have to respect the authority that has been delegated to us, and that is not delegate role to others.'",
        "'speaker_0': 'I do feel that the order to cure remedy is adequate and sufficient. I would certainly be interested in the you see the Open Government Commission if they so choose to, coming up with something that incorporated some of the suggestions we've heard to make sure, for instance, that there is a set time period so someone's complaint does not'",
        "'speaker_0': 'languish. But I would emphasize that we have a city attorney's office that takes great pride in doing good legal work and advising the city and its boards and commissions. Everyone is certainly capable of making mistakes because we're all human.'",
        "'speaker_0': 'But this particular issue has been scrutinized extensively, and I am confident in the in the outcome that we've seen. The question was asked the rhetorical question, so what's the harm if we just let the the null and void clause stand?'",
        "'speaker_0': 'The harm, I would say, is essentially what Councilmember Desai alluded to. This is not a power we can delegate. And then two points that Councilmember Odie raised. It isn't just about an improperly noticed item. That's not the only thing the null and void remedy could be applied to.'",
        "'speaker_0': 'It could, in the right set of hands be applied to a law that someone doesn't like. And that's that's that's a concern. And again, we were elected to do this job. Now we've heard it said, by gosh, even the League of Women Voters that people don't trust elected representatives.'",
        "'speaker_0': 'Well, here's the thing. I say this often. If you choose to be an elected office, you better have thick skin, a sense of humor and a backbone. And I can attest to the fact that every one of us sitting up here don't all agree come from different perspectives.'",
        "'speaker_0': 'But we're working awfully hard for the people we represent. And then I would further quote my favorite president of recent times, Barack Obama, who in his closing address to the nation said, And if you don't like the folks who are representing you and you think you can do better, pick up a clipboard, collect the signatures, and run'",
        "'speaker_0': 'for public office. And and I wish more people would serve on our boards and commissions. Use that as a. A stepping stone to elected office. I happen to think we have great representative government in this city. We've come to a point of disagreement on this particular item, but I take very seriously the advice that the city attorney's'",
        "'speaker_0': 'office has given us. I've read the references to the case law and the city charter. And so I, I support the amendments, all of them that the city attorney's office is recommending. But I would also entertain a further remedy not to bring, you know, null and void light back, but to make sure that the intent, the spirit'",
        "'speaker_0': 'of this law is is honored. And it was something I was going to say, and there is something that concerned me in the staff report, and perhaps it was paraphrased in correctly, but it it did talk about it.'",
        "'speaker_0': 'And I, I didn't feel that Mr. Lay was burying his lead when he talked about there was agreement on nine of the ten amendments. There were. I think it's maybe just a way to transition in, but be that as it may, it is stated in the staff report and maybe I'm interpreting it wrong, but the commission further'",
        "'speaker_0': 'stated first they didn't agree with the null and void decision. Commission further stated that it would not support any similar amendment. So I'm concerned that what that means what if first, if indeed that's what the commission said, because they didn't go back and listen to the the actual meeting.'",
        "'speaker_0': 'But I would expect that our boards and commissions will work cooperatively and collaboratively with our city attorney's office and vice versa because we respect all of our times. But I think that we can come we can maybe have some additional guidelines that make sure that people who have a complaint are taken seriously.'",
        "'speaker_0': 'I mean, the analogy to the the penalty, the ref, you know, dropping the the filing the penalty, I will say coming so soon after the Super Bowl was a little painful. But hey, but but that it does stop stop the game until they go and, you know, review the the tape and look at it from all those'",
        "'speaker_0': 'different angles. I still didn't think that was a touchdown the other night. But anyway, I'm over it almost. But you know something that makes sure that, yes, this is taken seriously. You you tell us that that we there needs to be in order to cure it comes to the city council as quickly as possible.'",
        "'speaker_0': 'And we don't, you know, buried under the rug. So if someone, you know, wants to suggest a way to do that, I'm all ears and that's all for me. Thank you. Let's start with Councilmember Velvet and the vice mayor, then Councilmember Odie Councilmember.'",
        "'speaker_9': 'So there was a suggestion earlier by a couple of members of the public that there may be some sort of task force similar to the original task force or that it go back to the Open Government Commission for them to to weigh in on.'",
        "'speaker_9': 'I think when we had the task force, we didn't necessarily have the AGC and I don't know what happened in 2015. There was a reference to a review of that. I don't know if that was in connection with being on the AGC because I know Mr. Foreman has been on it before, but perhaps the AGC could could'",
        "'speaker_9': 'weigh in and let us know what options may work or that they think they could recommend in terms of giving something, giving some teeth to this. I also think looking at the process in nine B, because right now we're saying that we want it to come back quickly from the GC.'",
        "'speaker_9': 'But again, if there's six weeks between when the complaint is filed and the AGC hears it, that could be problematic. And maybe we want to give them some direction that they can hold. Meeting dates that can be posted on the calendar.'",
        "'speaker_9': 'If there's no complaint filed, then they can just not have their meeting, which is what other boards do. And then the other thing is, with the Sunshine Ordinance in place, that quick turnaround may be difficult. So if they have a regularly scheduled meeting that this is heard at and depending on when in the month that is, yeah'",
        "'speaker_9': ', we may need to have some clause in there that allows them to expedite re agenda using it before the council because of the delay. And I'm out of time.'",
        "'speaker_0': 'Okay. Vice Mayor.'",
        "'speaker_4': 'I have on our screen, I think I saw staff working on something. I was just going to ask if they pass a. They had language they might want to propose based on the commentary that they've heard. Jon Stewart Sorry, it's not up here, but I was going to warn you that I see you typing, okay?'",
        "'speaker_0': 'Like, I can't. I can't even read it that small.'",
        "'speaker_4': 'I just. It seemed like SAP was trying to possibly put put together something. And, you know.'",
        "'speaker_0': 'His staff want to comment.'",
        "'speaker_5': 'Oh, so, Madam Mayor, if I may.'",
        "'speaker_0': 'Yes, I would need a mirror to read that.'",
        "'speaker_5': 'We've been we've been hearing the council comments and then speaking.'",
        "'speaker_0': 'To the microphone, please.'",
        "'speaker_5': 'Oh, yes, we've been hearing the council's comments. And we've we're we've drafted up something for the council's consideration, which I believe addresses both the vice mayor and council member de Suggs concerns that they've raised, which is that one, it comes back to the original commission or the council as soon as practicable, and that this amendment further requires'",
        "'speaker_5': 'the originating body to make a decision based on the OGC recommendation, which may involve agreeing and caring or disagreeing, and that it further takes into account the vice mayor's concern, which is that lots of things could be happening in the meantime, so that this amendment also provides that the city would take all necessary actions to the extent'",
        "'speaker_5': 'authorized by law to maintain the status quo.'",
        "'speaker_0': 'Okay, let's hold that thought, because I think the vice mayor inlets, were those your comments that you could see them?'",
        "'speaker_4': 'I mean, yeah, that that looks I just wanted to find out if there was possible language before we started possibly developing new task forces and whatever else.'",
        "'speaker_0': 'But yeah, I am. Thank you for that. Were you done in our call on council member?'",
        "'speaker_3': 'Thank you. I'm not so sure about that maintaining the status quo because there is a law in place about ordinances and when they take effect in 30 days and so on and so forth. So that would kind of overrule that.'",
        "'speaker_3': 'And I don't know if that works, but I like the idea of council development in about you having meetings regularly scheduled that if there is some issue that it can be addressed ASAP. I also think that ONGC probably is the best body to come up with ideas on how they think that a violation can be enforced most'",
        "'speaker_3': 'effectively. I mean, there's a fine provision there and we all care about the budget and that may be something that that maybe can be enhanced. The question I did have, though, and we kind of didn't touch on it because we went into the No.'",
        "'speaker_3': 'One void, but this whole idea that it supersedes other laws, I mean, does that mean anything that it that's different in the past is changed or anything that we passed in the future that conflicts which hopefully neither of our none of our staff lets us do how?'",
        "'speaker_3': 'I just was not sure about that.'",
        "'speaker_5': 'So council members and the laws cannot anticipate what you would do in the future and it cannot bind future councils. So what it does is that it supersedes laws that were in existence at the time of the adoption.'",
        "'speaker_5': 'In fact, when you adopt an ordinance, you always adopt a provision called implied repeal, which is in any law that's inconsistent with the ordinance that you're adopting at the time. It's a is repealed to the extent necessary to effectuate your new law.'",
        "'speaker_5': 'So your new law will always take precedence.'",
        "'speaker_3': 'Well, we should make that clear. That's all. My time is up.'",
        "'speaker_0': 'To the council everyday.'",
        "'speaker_6': 'So with 70 seconds, I'm going to speak quickly. It's hard for me to understand whether or not the proposed language has teeth, but I'd love to get input from the AGC or anyone else on that on what's proposed here.'",
        "'speaker_0': 'And I will make a motion to extend the time because I think this is a an important issue and I don't see that it serves any. Okay. How much time, folks?'",
        "'speaker_2': 'I'm sorry. Four.'",
        "'speaker_0': 'Okay. Okay. Motion to extend time. 5 minutes for everybody.'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'Okay. Okay. That's a second. I've got a motion second on favor. I, I think Councilmember Desai seconded. Okay. Okay. So continue, Councilmember.'",
        "'speaker_6': 'So that's basically my point. I said it in 17 seconds. I would bring it input as to they understand our broad parameters or broad parameters. It has to be consistent with the charter as we discussed it. But we also have to believe that within those parameters we can still come up with something that's that's that has teeth'",
        "'speaker_6': ', but it's just not null and void null and void concept.'",
        "'speaker_0': 'Okay. So your recommendation to send it back to the board, you see, and that would be the remedy I would favor as opposed to convening yet another subcommittee because I think we want to keep this moving forward. Um, who else didn't finish their comments to Councilmember Gallo?'",
        "'speaker_9': 'I was going to say, I think having it go back to the AGC makes sense. In this instance, I'm a little wary about drafting something tonight and then adopting it, especially in light of the topic that we're discussing.'",
        "'speaker_9': 'So I'm not going to be supporting I think that that clearly there are other ideas that exist that are out there. Perhaps these can be brought to the GC and discussed and noticed properly and all of that. I do think, like I said, creating a process similar to call for review or appeal to planning board where we'",
        "'speaker_9': 'have kind of a date set and a turnaround possible would be helpful. Keeping in mind the other provisions of the Sunshine Ordinance that require us to notice things ten days before and all of that, and because I do worry about an instance, let's say, where it's not a cannabis issue that we're dealing with, but we're dealing with'",
        "'speaker_9': 'an exigent ordinance. For instance, when we were looking at the issue that impacted a tenant who was going to be evicted, who was a Holocaust survivor, and the emergency ordinance that we put into place, and if that had been formed, what that would mean.'",
        "'speaker_9': 'So and perhaps it's the AGC that can make the determination to suspend certain rules for noticing and still comply with the Brown Act. But maybe not because it's already been been heard and is now being cured, that there's a shorter time frame for adding to the agenda, an item like that.'",
        "'speaker_0': 'And my observation would be that since this is the first reading of an ordinance, I think these amendments might take this a bit beyond what we first contemplated and would recommend would would need another first reading anyway. So I would certainly support sending it back to the Open Government Commission.'",
        "'speaker_0': 'But again, to work with the City Attorney's Office and I am quite confident we will follow the city attorney's recommendations, but I think this can be made a bit better and give some reassurances and however that needs to be worded.'",
        "'speaker_0': 'Council Would we at least say that this this amended draft might be a good starting point to to work from?'",
        "'speaker_9': 'I.'",
        "'speaker_3': 'I don't think so. I don't like the maintaining the status quo because you're basically overriding the state law.'",
        "'speaker_0': 'Well, no, I'm saying to send back to the the Open Government Commission very fine.'",
        "'speaker_3': 'Without that, the city shall take all necessary action sentence.'",
        "'speaker_0': 'If you will. That could be directed to staff. Yeah.'",
        "'speaker_3': 'Okay. Just adopting it as is with the direction that we've all decided we want to give.'",
        "'speaker_0': 'I don't know. I don't know what adopting the ordinance is now. It's going to be modified. Why would we adopt it now.'",
        "'speaker_9': 'For a new first reading?'",
        "'speaker_3': 'Life we adopted and then tell The Odyssey to come back in two or three months with replacement. I don't want.'",
        "'speaker_0': 'That. But then in the in the intervening time, this would be the councilman, I mean, councilmember like to be on the council member city attorney.'",
        "'speaker_5': 'I think Mr. Councilmember Otis point is to adopt a staff recommendation with direction to review. I think that's okay. So I think you're in agreement with the mayor.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Speaking a different language. Okay. Got it. Okay. So are you making a motion?'",
        "'speaker_3': 'Sure. I'll make a motion to.'",
        "'speaker_0': 'Adopt the.'",
        "'speaker_3': 'Adopt the staff report as written with direction for staff to work with the Open Government Commission to find a replacement, an effective replacement to the null and void remedy based on our discussion and anything else they may have.'",
        "'speaker_0': 'Okay. We have a motion by Councilman Brody and a second by Councilmember de suck discussion Vice Mayor next week.'",
        "'speaker_4': 'So I won't be supporting this motion. I feel that we should. Like I said in my comments, I'm happy to remove null and void, but I'm only going to remove it when I know what the remedy is. Because I think that removing something like take all necessary actions to maintain the status quo puts us into the they're'",
        "'speaker_4': 'now making a finding, but everybody just ignores it. And it's basically it has it it removes any meaning and teeth. I'm also going to just we didn't talk about it but the the the fine $250 public works getting the transportation commission getting fined for violating the Brown Act $250 transfer is going to send 250 bucks.'",
        "'speaker_4': 'Right. You know, laughing to the finance department. I mean, it's not you know, I don't the fine doesn't really unless we're getting into tens and tens of thousands of dollars, it's not going to have a real big impact on noticing in this body because it doesn't the people getting fined are not the people sitting here.'",
        "'speaker_4': 'So I have.'",
        "'speaker_0': 'Interject an inquiry.'",
        "'speaker_7': 'Or.'",
        "'speaker_0': 'Would you like staff direction to include that you would like the fines and penalties provision revisited. I even if you're not supporting the motion, would you like to see that be part of staff direction? But you don't have to.'",
        "'speaker_0': 'Sure.'",
        "'speaker_4': 'Yeah, I just I guess what I'm trying to say is I.'",
        "'speaker_0': 'Think that's a good point. And then you had more to say.'",
        "'speaker_4': 'I do, yes. I would like to make sure that our direction is that that, you know, to to the mayor's point earlier, it's I have very much appreciated hearing from almost all the, uh, open government commission members and their concern about removing null and void, but that the direction is that it's going to be removed and that'",
        "'speaker_4': 'we are accepting the city, the city attorney's position on this. And therefore, I just want to make sure that if we're going to send it back to the Open Government Commission, that we're trying to find that balance where, you know, to me, all necessary actions to maintain the status quo gets us to a place where they're not'",
        "'speaker_4': 'repealing it. They're just slow walking there. The roll out, their vice mayor, former vice mayor, city council member, fellow still vice mayor, in my mind, you know, came up with the, you know, the idea of maybe if it's an emergency know, maybe there's some exceptions where whatever else.'",
        "'speaker_4': 'But but I, I feel like for me in order to repeal this, I need to know what I'm repealing it for. I don't want to repeal it. And then in three months, come back and say, yeah, we can't agree on what's going in there.'",
        "'speaker_4': 'So now it's just repealed and we have nothing. So which, which I fear is, is a possible outcome.'",
        "'speaker_0': 'And I will just add that I couldn't support anything that is keeping the null and void option in because we've heard several times over that it's it's not a valid remedy given the charter and our authority. So. But we have a motion in a second.'",
        "'speaker_0': 'Is there any further I'm sorry, Councilmember Rivera.'",
        "'speaker_9': 'So I'm not going to be supporting this motion and for similar reasons as the vice mayor, I would also I think this has been on the books for a long time, and then we knew it was an issue when the complaint got filed.'",
        "'speaker_9': 'So. For me, it seems like it's been on the books. We knew there was an issue, there was legal research and we've kind of gone back and forth. And so I don't see the harm in waiting another month or 60 days for the GC to weigh in and give us a remedy because it has been on the'",
        "'speaker_9': 'books for this period of time and I would like that process to happen and to have some teeth proposed that we can all live with and then put it in there so that it works. So I'm I have a similar position as the Vice Mayor.'",
        "'speaker_0': 'And I'm looking forward to the AGC coming back with something.'",
        "'speaker_3': 'But my only point to that is I think we all agree that that is not an authorized remedy under our Charter or the Constitution. So, I mean, if we had an ordinance that says you can discriminate against women and we know that that's unconstitutional, would we just keep that in there until we fix it or would we'",
        "'speaker_3': 'take it out because we know it violates the law?'",
        "'speaker_0': 'Okay. We have a motion. We have a second. All in favor.'",
        "'speaker_6': 'I just want to say you.'",
        "'speaker_0': 'Yes, yes. Sorry.'",
        "'speaker_6': 'Yes. The quick comment I want to make is I do think that the points that Councilmember Vela and Vice Mayor Knox White are valid, because if we do take a vote, we run the risk of of taking the leverage out that the GC might have because we've made a decision that we're going to.'",
        "'speaker_6': 'But but by the same token, Councilmember Odie raises a good point that if there is a rule that that is in contradiction to, to a higher rule, do we sit around and let it be? So for me, I'm going to have to believe I'm going to have to have faith that the city attorney is going to work'",
        "'speaker_6': 'in good faith with the Open Government Commission and the public in creating the language that that is akin to null and void, that does provide some teeth, but is aligned with how we're interpreting the city charter. So I'm going to have faith that that's going to occur even as we move forward with staff recommendations.'",
        "'speaker_6': 'So that's why I will remain in favor of the vote.'",
        "'speaker_0': 'Thank you. All in favor.'",
        "'speaker_4': 'I oppose. No.'",
        "'speaker_0': 'No. The motion carries 3 to 2. And I just want to comment that this has been an excellent council discussion and I really appreciate the very thoughtful comments and also the melding of different suggestions and perspectives. Thank you, everyone.'",
        "'speaker_0': 'We look forward to this coming back to us and I'm ready to go on to the next item, people. Okay. Remind me what that is. 60, 60. We have 60 up next. Okay. Excuse me. Excuse me. We are conducting a council meeting.'",
        "'speaker_0': 'Excuse me, Mr. Peterson. I'm going to call a break if you don't leave now. Miss Smith, would you please would you please give us the.'",
        "'speaker_1': 'Can I read the title really quickly? Thank you. Introduction of Ordinance Amending the code by adding new Section 20 3-9 Personal wireless service facilities in the public right away, and amending Section two Dash 59.3. Limitation in power to make contracts to exempt master license agreements for use of public assets for personal wireless service facility installation and a'",
        "'speaker_1': 'recommendation. Authorize the city manager designee to negotiate and execute master license agreements for the use of public assets consistent with local law. Good evening, Madam Vice Mayor. Members of council.'",
        "'speaker_0': 'Be sure your right up to the microphone.'",
        "'speaker_1': 'My name is this. Yeah.'",
        "'speaker_0': 'Yeah. Closer is getting pull up. Yeah, I know. It's. We got. We're going to get into Hollywood. I don't know.'",
        "'speaker_1': 'Uh, my name's Aaron Smith and the city's deputy public works director. I know it's getting late, so I'll do my best to present this matter succinctly before you tonight. As an ordinance amending the municipal code to set the regulatory framework and standards for permitting of the installation of wireless facilities in the right away.'"
    ],
    "Personal Wireless Service Facility Ordinance and Master License Agreements.": [
        "'speaker_1': 'Further, the ordinance delegates authority to the Public Works Director to publish and amend as necessary relevant administrative documents such as design standards for these facilities, the SUBMITTAL Guidelines for when they go to submit a permit. Accompanying the ordinance will be use of a master license agreement with each of the telecommunication carriers for use of city facilities in'",
        "'speaker_1': 'the public right away. The license agreement will include include, among other provisions, insurance, indemnity bonding, maintenance requirements and of course, annual license fees that are associated with use of city facilities. The terms of the master license agreement are intended to be consistent with the ordinance and implement those provisions in the ordinance before you this evening.'",
        "'speaker_1': 'You may be asking, why are we hearing this tonight? If you recall, in the summer of 2017, when Senate Bill 649 was making its way to the Governor's Desk, Council, awarded a professional services and master license agreement to five bars.'",
        "'speaker_1': 'Now communities and the services were for both telecommunication consulting as well as the marketing of city assets to wireless carriers in exchange for shared a shared revenue arrangement. Will SB 649 ultimately was vetoed by Governor Brown? But following that, the Federal Communications Commission issued a declaratory ruling.'",
        "'speaker_1': 'And I'm going to read you the title of that ruling, because I think the title in of itself is telling of its intent. And the title of the declaratory ruling was accelerating wireless broadband by removing barriers to infrastructure investment.'",
        "'speaker_1': 'So that was issued by the FCC in 2018. And among other things, it limited the compensation that local government was able to receive from wireless carriers for use of city facilities. So following that ruling, not unexpectedly, community communities terminated the master license agreement that we had entered into with them.'",
        "'speaker_1': 'So that same FCC ruling also promulgated expedited shot clock or timelines in which we have to turn around a permit review process. So the expedited shot clocks, timelines as well as excuse departure really puts us in a time sensitive nature to both adopt this ordinance and enter into master license agreements with each of the carriers as such'",
        "'speaker_1': '. The second portion of this ordinance amends a different section of the municipal code to provide an exemption to the clause that requires contracts in excess of a five year term to be approved by council. And so what this ordinance amends is, it allows for an exemption for these specific types of master license agreements, since the term of'",
        "'speaker_1': 'those will likely be ten years since the state requires the term of the permit that authorizes the wireless facility in the right away to be those ten years. Lastly, the staff report is seeking that the council delegate authority to the city manager to actually negotiate and execute these master license agreements.'",
        "'speaker_1': 'So with that, I'm happy to answer any questions.'",
        "'speaker_0': 'I have a question. Good report, Miss Smith. Thank you. So I represent Alameda on the League of California Cities, and they were one of the very vocal bodies opposing SB 649. And I believe there might be a legal challenge making its way through the courts.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_1': 'Yes. And I'm sure our attorney's office can speak more to it. There's definitely legal challenge to the 2018 FCC ruling.'",
        "'speaker_0': 'Right. And so so could one of the folks from the fisheries office tell us about how how would that how would an eventual ruling form in favor of cities essentially impact the decision we're making tonight?'",
        "'speaker_5': 'Sure, Madam Mayor. So that legal challenge is still working its way through the court system. There is no current pending injunction against that particular federal legislation. And therefore, we have proposed to you the best and the most comprehensive local regulation that a local agencies are able to implement at this.'",
        "'speaker_5': 'Time. If we receive a judicial ruling that overturns the federal regulation, then we would certainly come back to you in cooperation with our public works colleagues to give you additional local control to the maximum extent possible.'",
        "'speaker_0': 'Thank you. Another good answer. All right. Any questions or comments? Councilmember de SAC.'",
        "'speaker_6': 'So I remember back in 2015, we dealt with an issue where cell towers were proposed for Lincoln Avenue and Saint Charles. I think the Pagano building or somewhere around there. Also, at the same time, cell towers were proposed for an apartment on a shoreline in grand or somewhere somewhere near there.'",
        "'speaker_6': 'Now, during the course of that discussion, what I recall and even from previous discussions, there was really a lot of involvement of the planning staff in terms of design, you know, esthetics, all that kind of stuff. Is it such that that that they are no longer involved in that?'",
        "'speaker_6': 'And so everything is now the public works department.'",
        "'speaker_5': 'So I'll give you the legal answer and I'll my colleagues might give you additional policy answers as well, which is that local regulation of cell towers essentially originated from two places. We have the ability to regulate the right of way and we have the ability to regulate private property.'",
        "'speaker_5': 'Cell towers are both. Both. In both instances, our local control is significantly circumscribed by federal legislation. What is before you tonight is the public right of way regulations. If the Council desires for the city to implement further review of its zoning regulations on private property, you can certainly give a very brief direction on that tonight for planning'",
        "'speaker_5': 'staff to undertake and review. But what is before you is essentially one half of the regulatory authority that the city is able to exercise.'",
        "'speaker_6': 'Okay. So this is just public, right? So the question that I have is I don't quite recall seeing references to the Parks Commission, Parks and Recreation Commission, and I raised that only because a lot of the cell towers are being placed in parks.'",
        "'speaker_6': 'I think when I look at the crazy tennis courts, you look up at the lights, there's cell towers. So is that what thought is there? And involving things like the Parks Commission or frankly speaking, even the school district?'",
        "'speaker_6': 'Well, I guess that would be a school district decision. Okay. That's separate the parks parks Commission. Yeah. So for that.'",
        "'speaker_5': 'I defer to my policy colleagues.'",
        "'speaker_1': 'Yes. So the ordinance tonight is is very strictly related to in the public right away, the city has more discretion when it's on private property or city owned property like parks, where we're acting as a as a private landowner.'",
        "'speaker_1': 'That's not covered in this ordinance, although just based on conversations with the parks that there that is still open for the possibility of placing wireless facilities less so I think cell towers. But like you had mentioned on the taller existing poles, those provide, I think, real estate for the wireless carriers to mount their antennas up there.'",
        "'speaker_6': 'Also by public. When I was reading this, I was interpreting public right away as public property. So what you mean by public right away is basically like infrastructure, like streets, sidewalks that are basically in the purview for the most part of the public.'",
        "'speaker_6': 'Yes.'",
        "'speaker_1': 'We're not talking city building facilities either. Oh, okay. Another area of.'",
        "'speaker_6': 'Discussion. I see. Okay. Thank you.'",
        "'speaker_0': 'Any further clarifying questions before we go to our public speaker then? Okay. We have a very patient public speaker somewhere in the audience. Come on up.'",
        "'speaker_2': 'Because the public is.'",
        "'speaker_7': 'Hello, councilmembers. My name is Chris Vegas. I'm with Verizon Wireless. It's a pleasure to be here this evening. First, I wanted to begin by thanking staff for preparing the ordinance. That's before you this evening. We appreciate the direction that the city is moving in and we're excited to work with the city and are interested in entering into'",
        "'speaker_7': 'a partnership with the city of Alameda that will allow.'",
        "'speaker_11': 'Verizon Wireless to attach.'",
        "'speaker_7': 'To city owned assets on the public right of way. We've reviewed the ordinance that's before you and have provided comments which highlight areas of concern for Verizon. That letter was submitted earlier today. I'm not sure if you've had the opportunity to read that, but that should have been distributed.'",
        "'speaker_7': 'We would like the opportunity to meet to meet with staff, to discuss the issues in further detail so that we can ensure a successful deployment for Verizon as well as the other carriers. And I would request that council direct staff to continue to work with the wireless industry as they work to finalize the design and permitting guidelines'",
        "'speaker_7': 'that will essentially allow for the successful deployment of small cell wireless facilities. Again, my name is Chris Vargas, and I'm happy to answer any questions that you may have.'",
        "'speaker_0': 'I have a question. Sure. Was there a reason you didn't submit your letter until this afternoon?'",
        "'speaker_7': 'A part of that is due to the fact that we were waiting on documents from city staff so that we can submit them all at once. So we received the ordinance, I believe it was last week, and then we received the additional documents this week.'",
        "'speaker_0': 'I believe the ordinance is actually this. The draft ordinance is attached to the staff report and we do have a 12 day advance notice. So our packets are put out to the public 12 days in advance.'",
        "'speaker_7': 'Right. And so we specifically wanted to provide the comments on the design guidelines as well as the permitting guidelines. And those are referenced in the ordinance, but they're not specifically called out or they're not gone into the ordinance, doesn't go into detail about what that will look like.'",
        "'speaker_7': 'And so that specifically what we wanted to.'",
        "'speaker_11': 'Comment on, because that will determine what our deployments look like.'",
        "'speaker_0': 'Thank you. Okay, Miss Smith, why don't you come up and.'",
        "'speaker_1': 'Want to clarify a couple of things? So the design guidelines and the permits permit submittal the design guidelines and permits middle guidelines actually went to our planning commission in April of 2019. Those have remained relatively unchanged, except that we will obviously need to update the reference that carriers need to consult with communities for a sublicense agreement.'",
        "'speaker_1': 'However, the design guidelines and the report, the permit submittal guidelines have been on the city's website since April of 2019. So I just want to clarify that we are and I have amended them to now reflect this non-equity world that we're going to be living in.'",
        "'speaker_1': 'And that is what Chris is mentioning before you tonight is just the ordinance. And again, what this ordinance does is vests in the public works director, the authority to update those administrative documents as needed.'",
        "'speaker_0': 'Okay. Thank you. Okay. That's the of our public speakers. So I'll close public comment. Counsel, your thoughts or emotion?'",
        "'speaker_3': 'I can go first this time.'",
        "'speaker_0': 'Yes, Councilman.'",
        "'speaker_3': 'Thank you for the report. This SB 69 was very controversial. I remember when it when it went through. Hopefully we can work with the industry. I mean, we don't have to do everything they say, but it'd be good to bring them to the table because if we can when we do part two, if everyone's on the same'",
        "'speaker_3': 'page, that would be helpful. So I'm willing. I don't know if I need to add that to a motion, but I'm willing to move approval of the item.'",
        "'speaker_0': 'Okay. We have a motion to have a second second. It's been moved and seconded. Any discussion.'",
        "'speaker_6': 'Yet?'",
        "'speaker_0': 'Councilmember So.'",
        "'speaker_6': 'You know, I feel that this ordinance, it proposed ordinance has has so much moving parts in, you know, the implications of which I'm just not sure. So I was just wondering if council would consider having a sunset to this ordinance after five years because I don't know.'",
        "'speaker_6': 'I mean, I know we need to have, you know, mortar and cell towers and all that kind of stuff, even on public rights away, perhaps. But anyways, it's just it's a thought. It's just very complicated.'",
        "'speaker_0': 'I'm thank you. So I will turn to the city attorney on this. I mean, this is federal law and we're just implementing our and. Is it even possible to sunset this well?'",
        "'speaker_5': 'So if the council so assuming it sunsetted, let's say next month and the law does not change, we would just the city would simply lose local control because there will be no further local regulation governing the deployment of these small cells on the public right of way.'",
        "'speaker_0': 'So it goes to the federal government to say what the.'",
        "'speaker_5': 'With default rules and no further local control and no further local ability to enter into licenses to authorize them or charge fees.'",
        "'speaker_0': 'And it doesn't sound like a good thing.'",
        "'speaker_5': 'Okay. It would not be our recommendation.'",
        "'speaker_0': 'Yeah. Okay. Any further discussion? Hearing then? We've had a motion. It's been seconded. All in favor I. Any oppose, any abstained. The motion passes unanimously. Thank you. Okay. So then we move on to. Boy, this is so written on City Manager Communications.'"
    ],
    "Paid Parking Policy for City Owned or Operated Lots.": [
        "'speaker_1': 'Nine is consider requiring paid parking at any future city owned or operated parking lots, including the Main Street Ferry Terminal. This item was placed on the agenda at the request of Councilmember Vela, and we have three speakers.'",
        "'speaker_0': 'Okay. So, Councilmember Ballard, the floor is yours.'",
        "'speaker_9': 'I'll keep it short. But basically this item has come up a number of times whenever we've discussed our Climate Action Plan and various projects that have been brought before the Council. And I thought that it would be helpful to have this conversation agenda so that we can really discuss it in full.'",
        "'speaker_9': 'Because I know that there are a number of items coming back to the council are scheduled to come back to us and as we all know, free, there's nothing that's really free. It just means that it's subsidized from somebody.'",
        "'speaker_9': 'And and in in this case, subsidizing parking means that we're spending public funds on parking, which is not necessarily in line with our stated goals under our Climate Action Plan or in line with our other goals in terms of finding ways to provide more housing and things like that.'",
        "'speaker_9': 'So I just want us to have this conversation so that we can give staff some direction ahead of these items coming back. And I certainly I didn't I specifically didn't put a dollar amount or anything like that because obviously it depends on the project and how we go about and, you know, enforcing it.'",
        "'speaker_9': 'But I think if we can at least have the general conversation and perhaps give staff some general direction to put this into effect, then any time an item comes up where there would be a city lot or city parking, we know to to include this analysis in the staff report so that we can vote on it.'",
        "'speaker_9': 'And it just becomes part of the conversation as opposed to something that we add on later on. So I hope you'll be supportive.'",
        "'speaker_0': 'Okay. And so I. I think I'm. So what's your ask?'",
        "'speaker_9': 'My ask is that we direct staff essentially to come back to us with either what basically to give directive to staff that for any projects including city parking city. Any any parking lots or other parking structures that they provide us with options for how to actually do that had actually charge for parking and that that be part'",
        "'speaker_9': 'of the the cost analysis that that gets built in.'",
        "'speaker_0': 'Okay. For new projects. Mm hmm. Okay. And we have new public speakers on this. Are we do we have three? Okay. Any current questions from council before we take our public speakers?'",
        "'speaker_3': 'Calcium or maybe not from the author, but from staff. So the parking lot at Seaplane Lagoon Ferry, I mean, is that something that has already been. We've done that.'",
        "'speaker_0': 'It's already there. Okay.'",
        "'speaker_3': 'So. Okay.'",
        "'speaker_0': 'Anything further? Let's hear those patient public speakers Denise Trapani.'",
        "'speaker_1': 'Debbie Ryan and Ruth Harvey.'",
        "'speaker_0': 'Who they are. Good evening. It's still evening.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Hi, Madam Mayor and council members, thank you for the opportunity to speak here tonight and especially thank you, former Vice Mayor Vella, for bringing this subject up. I also want to start by thanking staff, especially the transportation and planning staff and the public work staff for the work they've done to encourage aluminum and to choose alternative transportation'",
        "'speaker_2': 'options. We heard from the public works director that said the Cross Alameda Trail, a big section of it is opening in a couple of days. It was actually open today and I got to ride it tonight. And it's amazing.'",
        "'speaker_2': 'It's stunning. But even with all that encouragement that our staff is doing for people to choose, alternative transportation's drivers are continuing to kill and injure people on our streets, and our greenhouse gas emissions from personal transportation continue to rise.'",
        "'speaker_2': 'It's clear that encouraging people to get out of their cars isn't enough. I'm here to ask you to please go beyond encouraging people to do the right thing by also actively discouraging driving. You can do that by no longer paying the cost of people to park in our public lots at the ferry and in other places.'",
        "'speaker_2': 'If this comes up and we have a public conversation about it, you're going to hear from people who say that you can't charge for parking at the ferry until you provide another transit option. But that's simply not true.'",
        "'speaker_2': 'That's no different than people saying you can't approve any more housing construction until you solve all our traffic issues. The issues are unrelated and drivers will just keep moving the goalposts. If you were able to magically get Alameda or Alameda County Transit to provide bus service to the terminal, people would still need to pay an extra 450'",
        "'speaker_2': 'daily for their roundtrip bus drop bus ride. I don't know why we would think that the they need the option to pay for a bus ride before we start giving away parking. We've run bus service out to Main Street terminal before while there was free parking.'",
        "'speaker_2': 'People didn't stop driving then and they won't do it now. Not unless the option is at least financial parity, which means we have to charge for parking. And I'd also ask you to maybe consider something a little more radical, which is potentially absolving yourselves from the responsibility to provide free parking.'",
        "'speaker_2': 'It's it's not our responsibility. It's not a free parking. It's not a right. It's a luxury that we've decided to give to those who are lucky enough to afford a car and choose to drive. There is no free parking, so I think my time is almost up that I'll just close with that.'",
        "'speaker_2': 'So thank you for raising this issue.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Debbie Ryan and Ruth Abby Ben Smith.'",
        "'speaker_2': 'Good. Very late evening, Tom. Yeah. Good evening. Try to keep it short. Hopefully you received a letter earlier today from Qatar. Can the action for sustain. Mm. But my name is Debbie Ryan with Qatar. And the gist of the letter is that we are in support of furthering this conversation and considering the requirement of paying for parking'",
        "'speaker_2': 'as stated in the referral. Mainly because we do want to completely connect this to the transportation plan, the transportation choice plan that was committed to start a year and a half ago. The Climate Emergency Mobilization Resolution that was committed to in March of last year, as well as the Climate Action Resiliency Plan that was committed to in'",
        "'speaker_2': 'September. We very much feel that these are directly related. And if you look at the current plan, which details on page 21 to 22 and as of January 2020, about 70% of Almeida's annual GHG emissions will come from transportation.'",
        "'speaker_2': 'And in order to reach the city's newly set sustainability goals, Alameda must achieve deep cuts in transportation emissions. This is directly affiliated with that. And if you look at the letter, it does detail. I don't have to go through all the bullets, but all the different ways that we really can reduce GHG, we can increase carpooling, we'",
        "'speaker_2': 'can look at increasing biking to the ferry and the cross Alameda Trail and ridership on AC Transit Line 96. So all of these can be implementable and increased upon. Now, we do also look at the idea, I think, what the last speaker just said, which is that in conjunction we have to look at this by continuing the'",
        "'speaker_2': 'momentum, the forward innovation of affordable transportation options. Because speaking to many folks, including at a community event this evening, people want to ride their bikes, they want to lock them up. They want to ride their scooters. They want to see new lines and new pools developed.'",
        "'speaker_2': 'We have to keep working on that together, but we have to avoid the use of the single occupancy vehicles. Real quickly, I just wanted to also read a quick note. This is not here locally, but just a congratulations article to the towns of Banff and Canmore.'",
        "'speaker_2': 'Yet another city who's increased their use of paid parking in order to look at the reduction of GHG emissions. And I think there's a really good point here in that it says these proposals do not represent yet another fee, but rather paid parking redistributes a silent charge on all taxpayers to an explicit charge for those who use'",
        "'speaker_2': 'public parking lots. And I think that's really important for us to consider, because these parking spaces are worth something and the city should use perhaps the funds coming out of it to work in other ways to get people out of their cars.'",
        "'speaker_2': 'So thank you. We're in full support.'",
        "'speaker_0': 'Thank you for all your good work with Ryan Mosby.'",
        "'speaker_2': 'Good evening, Madam Mayor. Members of the City Council. My name is Ruth Abby with Community Action for Sustainable Alameda. And we support the the request to put this discussion on a future agenda. You're not going to be discussing the merits of the proposal tonight.'",
        "'speaker_2': 'But I think one of the things you might ask staff to do when you do is to look at a blanket policy rather than coming up for each new development to provide options for paid parking. Just, you know, develop a city council policy that you will always have paid parking for public spaces, and that would be our'",
        "'speaker_2': 'recommendation. Then you don't have to worry about it. You don't have to litigate it every time and have public comment and concerns about it. It would just be the policy of the city. Thank you very much.'",
        "'speaker_0': 'Thank you. And Mr. Smith.'",
        "'speaker_11': 'And good evening, Madam Mayor, Vice Mayor and council members. And thank you, Councilmember Melo, for bringing this up. I've been a member of the Sierra Club for a long time and I remember bringing up housing for a long time.'",
        "'speaker_11': 'All of these organizations have been saying, we, we need to do something to have people pay for parking. It's another example of inequality by subsidizing the car, not paying the full prices. And we make people pay for a bus ticket, which is environmentally better.'",
        "'speaker_11': 'It's also the people that take the busses generally have less money to begin with. So it's just backwards, bad public policy. So I realize that it's it's difficult to do politically, but this is where the education begins and great deal with climate change deals, inequality.'",
        "'speaker_11': 'We've got to begin educating people and there's no way to begin that education and with the pocketbook, but no better way to do that. So thank you. I really do support having this come up for discussion.'",
        "'speaker_0': 'Okay. So council your thoughts.'",
        "'speaker_3': 'I'll jump in.'",
        "'speaker_0': 'Again.'",
        "'speaker_3': 'Yeah. So just to finish my other point. So when the ferry station parking opens, is that going to be paid?'",
        "'speaker_0': 'Seaplane Lagoon.'",
        "'speaker_3': 'Seaplane Lagoon.'",
        "'speaker_0': 'Yeah. Yes.'",
        "'speaker_7': 'That's the intent. We are actually bringing back. And so we can take your comments tonight and we're bringing back a parking.'",
        "'speaker_6': 'Staff.'",
        "'speaker_7': 'Report, I believe, in March. So we can at this point, this is great timing. So we can take your comments from tonight and put it into that staff report.'",
        "'speaker_3': 'Okay. So I'll be really quick because it's getting late. I fully support this. I think we need to go even beyond what this this does. San Francisco, you know, different neighborhoods have different stickers where you're allowed to park in certain times.'",
        "'speaker_3': 'Where I grew up, we used to every car had a village sticker and it was kind of cool to see the different art on them. But the point is, if you didn't have a sticker, you got a ticket and you also generated some revenue.'",
        "'speaker_3': 'So if there was something we could do to kind of charge for parking, kind of in a way, you know, like you got to have a permit to park on a city street. I don't know what that solution looks like, but other cities have done it because I think, as the speaker said, you know, there's just way'",
        "'speaker_3': 'too many cars here and the cost of driving nice to drive to San Francisco. It would be $7 to park and $6 for roundtrip. I mean, that was $13. That's not a lot of money to go to San Francisco.'",
        "'speaker_3': 'But, you know, if it was 25, I'd never go because it was 40 bucks to park downtown. But, you know, if if the cost of parking is comparable or is prices you out, then, you know, you'll have to take a bus.'",
        "'speaker_3': 'And then last thing, this chicken and the egg thing about the funding, I think if we start charging for parking and we can amass enough money, we can help subsidize bus because I think that's what we did with the line 19.'",
        "'speaker_3': 'We paid for it as a city the first couple of years and then we paid more. But once it generated more revenue and then I and I also think we're having site A I think we're getting bus service on day one, too.'",
        "'speaker_3': 'So I mean, those kind of arguments don't really hold a lot of water with me.'",
        "'speaker_0': 'I will just chime in and remind us that what we already know is that we can charge for parking, we can have regulations, but it requires enforcement. And I do know I have it on good authority that in the next month or so that item is coming to us.'",
        "'speaker_0': 'So, you know, we want to manage expectations. It's never enough to just say, yeah, we're going to pay for parking, but there has to be a way to deal with it. And then yeah, just a reminder.'",
        "'speaker_6': 'Councilmember Desai One thing that I would encourage when we talk about single occupancy vehicles is this the people who drive to work are not bad people, they're not evil people. They are fellow residents, they are neighbors. They love this city just as much as anyone.'",
        "'speaker_6': 'And if the trend is any indication, at some point we're going to get out, get away from. You know, gas powered cars that everything will be electric. So I would encourage the residents to avoid rhetoric that paints single occupancy vehicles as bad people.'",
        "'speaker_6': 'And I'm very concerned that that's the trajectory that we can be going. They get up early in the morning, travel long distances like San Jose or Fremont, you know, to make a living for their families just like everyone else.'",
        "'speaker_6': 'And by the same token, you know, it doesn't mean that, you know, people who ride bicycles are, you know, all the virtuous people. Let's not create caricatures of different people who utilize different modes of transit. Let's just have a policy discussion on its merits.'",
        "'speaker_0': 'Thanks. Hi. Well, I appreciate. I think. I think that's a that's a point well taken. Um, let's see. Just going down the line. Oh, well, the maker of the motion and I.'",
        "'speaker_9': 'Want to clarify one thing, because I this is a I had two drafts of this and I realize this is after it got published this it. This is this wasn't the original one. And that there was this not the one that I intended to use.'",
        "'speaker_9': 'And it says that new including the new terminal at Main Street. And that was a typo.'",
        "'speaker_0': 'And it's.'",
        "'speaker_9': 'The seaplane lagoon, but also any any new parking or changes to the parking at Main Street. Because one of the things that has come up in the past that we've discussed is perhaps repaving or expenditures out there. And I want that to be considered as new parking if we're going to be expending any sort of major funds'",
        "'speaker_9': 'to improve existing lots.'",
        "'speaker_0': 'Right. Basement X way.'",
        "'speaker_4': 'Sure. So obviously. Well, hopefully. Obviously, a topic near and dear to my heart. I guess I'm struggling a little bit with what we're actually asking because we already have policies that every public every public parking project that is underway or exists is priced except for our two ferry terminals and Main Street ferry terminal is likely going to'",
        "'speaker_4': 'fade into fade in its use significantly. It's very unlikely that anybody will be using it at once once the new the new terminal goes in. And I would want to be careful that we're not spent encouraging encouraging the spending of money on unpaid parking infrastructure.'",
        "'speaker_4': 'It's a place that people might not be using, although I think if it's going to be revamped because it's getting used, I think I think it's a it's a good idea. My understanding is that we have a parking policy for street parking, etc., that is somewhat under development.'",
        "'speaker_4': 'We've tried so many different things that the transportation folks I have no idea where that is and I don't have an expectation it will be to us in the next month. But. But. I guess I'm not I'm not I'm not exactly sure what direction we're giving to staff.'",
        "'speaker_4': 'I don't know that there is. With all the different transportation projects, whether or not something asking for somebody to come back very, very soon on this issue I don't think is going to have a huge impact. And I'm wondering if we can kind of give more direction that when issues related to city owned lights and etc. come'",
        "'speaker_4': ', you know, rather than a discussion in the future, why don't we just can we just give it the the direction tonight that there always be a paid parking option?'",
        "'speaker_9': 'That's what I'm asking.'",
        "'speaker_4': 'Okay. So I heard bring it back for discussion in the future. Not tonight. So that sounded like a whole new parking item. So it's just this. Just give direction. Yeah. Okay. I do want to say one thing. The residential parking permits do not pay for themselves or barely pay for themselves.'",
        "'speaker_4': 'They are something like $27 a year and the state law does not allow for anything more. So all they end up doing is privatizing the street for the people who live in a specific area, but they aren't a really good management process for managing overall use.'",
        "'speaker_4': 'So I think we're not correcting you. There are places where they exist. We have actually given it away for free out at Harper Bay near the ferry out there. I think that's something we should maybe reconsider someday. But we're nobody parks in the street, but nobody has to pay for permits.'",
        "'speaker_4': 'So nobody parks anyway. But yeah, I can see if that if that's if that's the intent. I'm 100% on board.'",
        "'speaker_0': 'And I would just say I actually think that people will continue to use the Main Street Ferry terminal. It'll just be more trips that are going to Oakland, and that's yet another way we get single occupancy vehicles off the road.'",
        "'speaker_0': 'But I also think that it is a matter of prioritizing both staff time and funding. And I think that Seaplane Lagoon should be were our biggest pressures because I think that, you know, this is the new ferry terminal and you're starting from scratch from the ground up.'",
        "'speaker_0': 'You can do it. Right. But I think it's those are good recommendations. I just think that we also need to tell staff it's not something that you push everything else off the desk and work on this. But I think, you know, it's it is something I think.'",
        "'speaker_2': 'We.'",
        "'speaker_0': 'Do need to do whatever we can to incentivize people out of their single occupancy vehicles. But I, I hear what Councilmember de SAG is saying. I think I always like to look for as many carrots as sticks. I mean, my carrot is I'm not sitting in my vehicle surrounded by traffic, but it's probably telling people they're horrible'",
        "'speaker_0': 'people or implying that that's not your most effective strategy. But we're rather going to strive to do better. And even if you drive in TV, we don't need more cars on the road because the roads are pretty crowded and that will keep working.'",
        "'speaker_0': 'So so this is essentially a recommendation to staff and do we need anything further? Okay. So then thank you for bringing that to our attention, Councilmember Vella. And then with that, we've got Council Communications Councilmember Vella, anything from you?'"
    ]
}