{
    "Fluid Spill in the Estuary Report. (Fire)": [
        "'speaker_0': 'And at this point, we'll proceed with three.'",
        "'speaker_1': 'A update by the interim fire chief on the fluid spill in the estuary. Good evening, Madam Mayor. Actually, I'm going to give the update tonight. Sorry for that confusion. This is just going to be a very informal quick update.'",
        "'speaker_1': 'We we do plan on coming back once we after what I talk about once we receive more documentations, will be coming back and doing a formal report for you. But I just wanted to give you an oral update about where we are.'",
        "'speaker_1': 'On March 16th, Mayor Spencer, myself and Fire Chief Long went to Yerba Buena Island to visit with the Coast Guard Command staff, and we toured the facility there. They gave us a briefing on their response capabilities. And also they briefed us a little bit on the spill that occurred on February 10th in the Alameda, Oakland estuary.'",
        "'speaker_1': 'At that time, they they let us know that they had done testing. The testing was they had not received it back yet. Once they do receive the testing back, it will be forwarded on to their headquarters. And then we will be privy to the information of interim chief.'",
        "'speaker_1': 'Long has submitted a public records request, a freedom of information, they call it, for the federal government Freedom of Information Act. Once we they and they are obliged to respond to that. And once we receive that information, we will be coming back to council with that information.'",
        "'speaker_1': 'Additionally, Chief Long spoke to the California Department of Fish and Wildlife Office of Spill Prevention and Response regarding their investigation. As you probably are aware, both the Coast Guard was doing their own internal investigation and the Department of Fish and Wildlife also did an investigation.'",
        "'speaker_1': 'And they they have concluded they actually haven't concluded their investigation. But the analysis that they did take in the samples that they took, there was not a match with any of the Coast Guard vessels. And from their perspective, they determined that the samples will be saved as evidence, and the investigation from their perspective remains open until they'",
        "'speaker_1': 'can actually determine where the source of the spill came from. But they did not. So this was again, this was Department of Fish and Wildlife, Office of Spill Prevention and Response. So separate from the Coast Guard. And they did not have a match and they did sample the Coast Guard cutters.'",
        "'speaker_1': 'So once again, though, we will be we still waiting on the response from the Coast Guard themselves from their investigation. And once we receive, that will be coming back with a full on report. That concludes.'",
        "'speaker_0': 'Councilmember questions before we have we have three speakers. Council member questions. All right. I'm going to go ahead and call the public speakers. Our first speaker will be April Squires and then Monty Hain and then Brock the Out.'",
        "'speaker_5': 'My chum. All around.'",
        "'speaker_1': '4:00 on the afternoon of.'",
        "'speaker_5': 'October 12th, 2014, I watched a floating expanse of grayish.'",
        "'speaker_0': 'Brown sludge.'",
        "'speaker_5': 'Enter San Leandro Bay from the direction of.'",
        "'speaker_1': 'Alameda.'",
        "'speaker_5': 'As Otis Street Bridge. The plume moved slowly and curled around the eastern tip of Alameda Island. Then enter the Oakland Alameda estuary.'",
        "'speaker_1': 'Mr. Huynh and I continued watching following the plume.'",
        "'speaker_5': 'From.'",
        "'speaker_1': 'A path on the Oakland side of the estuary. Around 5:30 p.m., we observed the plume from directly above the Fruitvale Bridge. By that time, the plume extended from San Leandro Bay westward past the Park Street Bridge. It was grayish brown and had a thick gel like almost foamy consistency unlike anything I'd seen.'",
        "'speaker_1': 'The plume was about.'",
        "'speaker_5': '15 feet wide and.'",
        "'speaker_1': 'Maybe 20 foot.'",
        "'speaker_5': 'Long segments embedded with some clumps.'",
        "'speaker_1': 'Of grass with roots attached.'",
        "'speaker_5': 'And other debris.'",
        "'speaker_1': 'Including straws, paper cups and pieces of wood.'",
        "'speaker_5': 'There were occasional breaks in the.'",
        "'speaker_1': 'Plume where there.'",
        "'speaker_5': 'Was a thin.'",
        "'speaker_1': 'Oily sheen. Around 6 p.m., Mr. Huynh borrowed.'",
        "'speaker_5': 'My cell phone and called 911.'",
        "'speaker_1': 'I listened as he was first connected with CHP. Then the Alameda Fire Department. I heard him describe the sludge and tell the other party that he would remain in the area. At the Nob Hill parking lot and be available by cell phone as if he were needed.'",
        "'speaker_1': 'I heard him give his cell phone number.'",
        "'speaker_5': 'So that he could be contacted.'",
        "'speaker_1': 'Mr. Huynh told me, Excuse.'",
        "'speaker_0': 'Me just one moment. I'm very sorry, but I just want to make it very clear. I truly apologize for interrupting, but I do not believe this is on the subject matter of the estuary spill. So it's fine to have you speak on matters, not on the agenda on this matter.'",
        "'speaker_0': 'And we were prepared for that. But I just wanted to make it clear that this is not a spill. So nobody's saying.'",
        "'speaker_5': 'I didn't think so, but no, I wasn't sure.'",
        "'speaker_0': 'How. No, no, I appreciate it. And I don't mean to, but I don't want it to be confusing because this is a different spill.'",
        "'speaker_5': 'So different this would be hold out. It's more like a public comment.'",
        "'speaker_0': 'Yeah, she's actually speaking items, not on the agenda. So public comments are not really on the estuary spill, right?'",
        "'speaker_5': 'That's right. Yeah. Thank you for the clarification.'",
        "'speaker_6': 'She'll get her full 3 minutes, though.'",
        "'speaker_1': 'So we start over.'",
        "'speaker_5': 'Okay. Anyways, should I just.'",
        "'speaker_0': 'Continue or do I start.'",
        "'speaker_1': 'Over? Okay. And why did time is the 3 minutes so anyway, so he could be contacted. He, he told me that quote that they said that a truck would be sent. So because it was getting dark and cold, Mr..'",
        "'speaker_5': 'Huynh and I had coffee at Pete's at Nob Hill Grocery.'",
        "'speaker_1': 'Sitting where we could see the Fruitvale.'",
        "'speaker_5': 'Bridge, expecting to hear a siren after.'",
        "'speaker_1': 'About an hour when there was no siren or a fire truck. I laughed, and.'",
        "'speaker_5': 'Mr. Hawing said that he would return to the bridge and try again. Issues that concern me going forward, the insufficient response resulting from 911 calls.'",
        "'speaker_1': 'I learned that it is likely that response is inadequate.'",
        "'speaker_5': 'Because there was.'",
        "'speaker_1': 'No protocol.'",
        "'speaker_5': 'In place for first responders in pollution cases that are not petroleum.'",
        "'speaker_1': 'Based and.'",
        "'speaker_5': 'That the and.'",
        "'speaker_1': 'Also secondly, that the city of Alameda should establish its own protocol to protect the marine life we all enjoy, as well as public.'",
        "'speaker_5': 'Safety of residents and visitors who enjoy the beaches.'",
        "'speaker_1': 'The mayor should.'",
        "'speaker_5': 'Create a commission and a citizen advisory.'",
        "'speaker_1': 'Committee. And thirdly, that the proposed Senate bill 718 by California state senators Mark Leno and Lori Hancock delineates.'",
        "'speaker_5': 'Procedures to report pollution events, identify.'",
        "'speaker_1': 'Causes, hold accountable polluters, and create and promote citizen reporting and involvement. The mayor should ensure that the city's protocol.'",
        "'speaker_5': 'Is integrated with the Senate bill. Thank you very.'",
        "'speaker_0': 'Much. Thank you very much. Monte Hein.'",
        "'speaker_7': 'Thank you. When I was modifying, I investigated the plume that Ms.. Squires and I observed, and here are some of my facts and conclusions. Alamy the Sphinx lagoons underwent extensive dredging during the first two weeks of October 2014.'",
        "'speaker_7': 'Dredging. Solids from these lagoons were dumped in a toxic hot spot at Alameda Point, and the residual liquids were released through the Lagoon portal into San Francisco Bay. Two months later, a mystery, a great mystery girl killed and injured hundreds of seabirds along the shores of Alameda, San Leandro and Hayward and the bird rescue nonprofit's budget has'",
        "'speaker_7': 'been drained. Chemical analysis by Cal Fish and Wildlife has not ruled out lagoon dredging as the source of the mystery goo. Fish and Wildlife took samples from near the Lagoon portal to test and compare with the Mystery Goo.'",
        "'speaker_7': 'I saw an employee of Clean Lakes Inc taking a lagoon water sample. Per their website, Clean Lakes uses toxic agricultural chemicals to clarify inland waterways. One such product is, quote, absorbed and translocated by aquatic plant foliage interfering with plant metabolism.'",
        "'speaker_7': 'Another is, quote, a contact herbicide effective against a broad range of aquatic plants. Clean Lakes also uses surfactants, which are chemical compounds that can emulsify, dissolved and dissolve solids and render them float able. Degradation of marine habitat near the lagoon portal is evident in this screen right here I'm showing in the center.'",
        "'speaker_7': 'You'll notice the lush greenery around the rocks that was taken over a year from the most recent photo, which in which the rocks are bare. Here is a photo showing a foaming agent, a possible sort of act surfactant in the lagoons.'",
        "'speaker_7': 'That's right here. Hmm. Notice the gray fringe where the white foam meets the water as if a chemical change is taking place in those two cloudy areas with the arrows point. That's what I'm referring to. It's gray right on the fringe of that white foam.'",
        "'speaker_7': 'Conclusions. The timing, flow, direction and content of the October sludge plume are consistent with Alamitos Lagoon dredging and the mystery. Good additional sampling analysis are required to prove link with linkage between the goo and the lagoons. Further investigation is needed to determine the extent of environmental damage and the risk of relying on toxic chemicals to maintain the'",
        "'speaker_7': 'aging finger lagoons. We need further study to determine the extent to which a new era of catastrophic environmental risk to the Marines ecosystem of San Leandro Bay has been brought about by changes in tidal currents due to drought related sediment buildup.'",
        "'speaker_0': 'Thank you. Thank you very much. Rock the lot.'",
        "'speaker_8': 'Council Mayor. I actually want to address the February 10th fuel spill, which is different from what has just been discussed by the previous two speakers. We're all human and as humans we do make mistakes. Accidents are just that.'",
        "'speaker_8': 'There are accidents and we can accept that. What's difficult to accept. It's a cover up. And not getting the truth about something that put people from the island at risk. Health risk and risk of their property. The fuel spill that occurred on the 10th of February was quite substantial.'",
        "'speaker_8': 'It ultimately covered miles of the estuary. At the.'",
        "'speaker_7': 'March 3rd.'",
        "'speaker_8': 'City Council meeting, we had representatives from both the Coast Guard and the Cal.'",
        "'speaker_7': 'Fish and Wildlife Department.'",
        "'speaker_8': 'Who said that.'",
        "'speaker_7': 'The source of the spill remained unknown.'",
        "'speaker_8': 'That what was detected in the spill was Marine diesel. After that, you heard numerous speakers, numerous very knowledgeable speakers say that it was their opinion that what was detected was a kerosene based substance, which would be consistent with JP five, which is a fuel that's used in the modern generation cutters and the aircraft that fly off of'",
        "'speaker_8': 'them. The only place that that could have come from was the Coast Guard. We're all waiting for our Freedom of Information Act to come through. We have no further information from the Coast.'",
        "'speaker_7': 'Guard.'",
        "'speaker_8': 'Because their investigation is still active. It's still underway. So there's no news there. But I did take a sample from our marina that night and passed it on to Fish and Wildlife. And they sat on that for the last two months.'",
        "'speaker_8': 'And I found out just this afternoon that my request to have that returned to me so that I could do an independent analysis of it. They have instead sent it to a commercial lab for a, quote, independent analysis.'",
        "'speaker_8': 'So I'm actually looking forward to seeing those results and sharing those with the council. Once again, I would say if that comes back as JP five, the only source of that could be the Coast Guard. Now, we take great civic pride about having the Coast Guard in this city.'",
        "'speaker_8': 'And I, in fact, have great respect for the Coast Guard or have had respect for them up until this incident. But I think that we as a community deserve the truth on a matter that's this serious. And I'm feeling like the Coast Guard would just as soon have this all just pass as water under.'",
        "'speaker_7': 'The bridge or water out the estuary.'",
        "'speaker_8': 'Nobody wants to take any formal responsibility for this.'",
        "'speaker_7': 'And I think that the people that were.'",
        "'speaker_8': 'Liveaboard that night were put at risk. And I think that we could be better prepared for an incident like this in the future and that the city and residents of Alameda deserve the truth of the matter. And I don't think we received that today.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Have no further speakers subs for this item. Three B.'",
        "'speaker_1': 'Update on safety of vacant buildings at Alameda Point or. Oh. Um.'",
        "'speaker_7': 'I'm going to. I'm just going to exercise my prerogative. Leave it. Thank you.'"
    ],
    "Equipment Purchase from Alameda Paving and Excavating.": [
        "'speaker_0': 'Thank you very much. And now through five g.'",
        "'speaker_1': 'Recommendation to authorize the purchase of equipment from Alameda paving and excavating in the amount of 129,800 an authorize the city manager to execute all necessary documents.'",
        "'speaker_0': 'All right. And member South pulled this item.'",
        "'speaker_3': 'Madam Mayor, the reason why I pulled this item is because a very good friend of mine is been working with staff and I haven't been involved. And I just want to make sure to recuse myself from this.'",
        "'speaker_0': 'All right. So do we have a motion? For 5G.'",
        "'speaker_5': 'So moved.'",
        "'speaker_0': 'Approval.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Was there any discussion? When all the vote all those in favor. I oppose one recusal member decide. Thank you.'",
        "'speaker_7': 'Um, he's got to come back.'",
        "'speaker_0': 'To and then we're going to move on to five j.'",
        "'speaker_1': 'Approving in your work plan and setting public hearing to continue assessing merchants within the Webster Street District by approving the annual assessment report and adopting a resolution of intention.'"
    ],
    "Update on the City's OPEB Liabilities.": [
        "'speaker_0': 'Second. Any discussion? A call the vote. All those in favor. I oppose none. One recusal member de saag. And that completes the consent calendar. So now we're on the regular agenda items. I have a recommendation for our sixth recommendation.'",
        "'speaker_1': 'Receive an update to the July 23rd, 2013 report on the city's other post-employment benefit liability. Irma.'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'It's. Thank you very much, Madame Mayor. Council members. Tonight's report is in anticipation. Of some upcoming. Votes that the council may be taking with respect to addressing the city's long term liability crunch in the area of post-employment benefits.'",
        "'speaker_7': 'What we wanted to do tonight as staff is to give context and to help the public understand what exactly is meant when we talk about OPEB or other post-employment benefits. It is an issue that is somewhat complicated but can be pretty easily understood once it's explained.'",
        "'speaker_7': 'It is also a huge headache for cities throughout the country, especially in California. You can thank assistant city manager and soon to be acting city manager. Warmer than for the photo of George Washington on the dollar bill to represent the struggle that cities face.'",
        "'speaker_7': 'I'm glad she did that. I'm a big fan of Presidents Day merely because I love commercials where Abraham Lincoln and George Washington are selling cars or wrapping or engaged in, you know, beer pong. So this is probably the most important issue that the city faces over which it has control.'",
        "'speaker_7': 'Our goal tonight is to demystify OPEB for the public. Next slide, please. So what is the difference between Purrs and OPEB? In a nutshell, hers is your pension. OPEB is what's called a retiree medical. Now with PERS. When an employee retires, they get the number of years of service.'",
        "'speaker_7': 'Let's say, just for argument's sake, 25 years of service times. Some factor. Some percentage. It used to be that the percentage for most employees was 2%. About 14 or 15 years ago, the legislature decided after the dot com boom that the PERS fund had done so well that.'",
        "'speaker_7': 'It would make a lot of sense to bump pensions up and bump the factor up from 2% to 3%. That was a huge. Huge. Impact from an actuarial perspective on what cities would have to pay eventually and where we sit today with premiums.'",
        "'speaker_7': 'I want to note that public safety employees throughout the state receive 3% at 50. That means for every year of service, they get 3%. If they work 25 years, they'll get 75% of their what's called pensionable number, which is usually the top year of salary.'",
        "'speaker_7': 'And they're able to retire at 50 years of age. At the same time that those formula were changed from 2%, 2.5% to 3%. The retirement date changed from 55 to 50. So look at it this way. You went from 2% to 3%.'",
        "'speaker_7': 'That's a 50% increase in value in the pension. Plus you get to retire five years earlier. So five additional years of liability. This has had a terrible impact on cities throughout California and for Alameda. Now. One point you should make because there's a lot of confusion about this, is that employees who receive a person's retirement are not'",
        "'speaker_7': 'allowed to draw Social Security. So it is in lieu of. But it is a much more expensive program for the city itself. So that's the pension side. That's PERS I'm not going to address PERS tonight. Some of us who are involved in state level politics at the time when this happened, including me, I was president of the'",
        "'speaker_7': 'League of California Cities at the time, spoke at the time and said and spoke out publicly and said this change in the formula was non-sustainable. We did not prevail. You can draw your own conclusions about why, but we are where we are now.'",
        "'speaker_7': 'So what's the difference between person OPEB? Well, OPEB is not a pension. Hers is run by a state agency. Alameda, like most cities, contracts with powers to operate the pension program. Some cities exist in risk pools. Others just exist in the main prize pool.'",
        "'speaker_7': 'In 2013, a bill was passed called Peprah. Pepper says that for new employees, there is now what's called classic purrs and new purrs. And for those who are employees, classic purrs is like classic coke. And new purrs is like new coke.'",
        "'speaker_7': 'New purrs says that public safety employees, police, fire, sheriffs, etc. all get instead of 3% a year, they get 2.7% a year. That sounds small. It's not. It's a 10% reduction. But more importantly, instead of being able to retire at 50, these new employees have to retire at 57.'",
        "'speaker_7': 'So there's seven more years of contribution and seven fewer years of payout. As for miscellaneous employees nonpublic safety, they no longer can retire at 55. They are now retiring at 62. The main point about this and why I wanted to talk about Perce is that because of the losses in the stock market, both in the wake of'",
        "'speaker_7': 'the dot com boom and in the wake of the housing boom. PERS did not hit its investment return targets in the next six years. And you will see this when the city does its presentation on our budget for the next five years.'",
        "'speaker_7': 'Our premium rate, the amount we have to pay to PERS to fund these pension benefits is going to rise pretty dramatically. It has already risen pretty dramatically. The city cannot control the purse rate. What the city can however, exercise some modicum of control over is the retiree medical benefit, the so-called OPEB.'",
        "'speaker_7': 'And that's what I want to speak about tonight. Now, before we do that, let's take a look real quickly at the increase in prices rates, because this is the challenge that most cities and Alameda will face in the coming years.'",
        "'speaker_7': 'Right now, the fiscal year we are in, we are at the tail end of 1415. So if you're looking at this chart, it's the third bar from the left. Our premium. What we pay to two in Sacramento is for every dollar in public safety salary, we pay $0.53 on a dollar to PERS to fund the pension benefit'",
        "'speaker_7': '. Our employees pay 13 of those $0.53, which makes them among the highest in the region. And for those who generally believe that we should confront the unions and, you know, jam down the number that they're supposed to get and make them pay more.'",
        "'speaker_7': 'I want to let you know that one of the consequences of PEP brought the Pension Reform Act is that state law says you cannot impose more than $0.12 on the dollar. We get more than that because we bargained for it.'",
        "'speaker_7': 'Right now, the city pays $0.40 on the dollar. Employees pay 13 for a total of 53. Look ahead. This is what's called purrs, smoothing the purrs smoothing process to try to catch up for the so-called lost decade of investment returns that I mentioned earlier.'",
        "'speaker_7': 'We'll raise our premium up to $0.65 on the dollar. Given our contracts with our police and firefighters. They will be paying $0.15 per dollar. We will be paying 50 per dollar. I want to note there is a, as I said, no way to impose more than 12 under state law and B, the $0.15 that our employees will'",
        "'speaker_7': 'be paying. No one is paying more in the Bay Area. Some people from time to time ask, why can't you just do what San Jose does? Well, here's why. San Jose has its own pension fund. It's not part of PERS.'",
        "'speaker_7': 'It's completely different situation. So we're facing an increase from $0.40 on the dollar five years out to $0.50 on the dollar. That is going to put a real strain on our ability to provide services. And so it's critical because these costs are not controlled by the city.'",
        "'speaker_7': 'It is critical that we bring our OPEB costs, the retiree medical costs under control in the next few years. Now I want to talk about what is open. Our miscellaneous employees, meaning the nonpublic safety employees. When they retire, they get $122 a month.'",
        "'speaker_7': 'That's the end of their benefit. Public safety employees, though, depending on their hire date. If they're hired before June 2011, they get full medical and dental health care through retirement. For them and for their spouse, that's if you're before June 2011.'",
        "'speaker_7': 'By contract and by agreement between the management of Alameda and our bargaining units. Those employees who were hired after June 2011 do not receive the benefit for spouses. It's a single party coverage, not a family coverage.'",
        "'speaker_0': 'But is it still full coverage?'",
        "'speaker_7': 'It's full coverage, but it's it's one party. And it does make it over time as we phase in these new employees. That provides us quite a bit of relief. Now. How are course determined. What do we pay for OPEB?'",
        "'speaker_7': 'What is our total bill? How do we get ahead of this and what do we face in the future as more people retire? Well. This chart shows you that. I want you to look at the fourth word. The fourth column down is pay as you go.'",
        "'speaker_7': 'Pay as you go is the amount that the city has to pay every year to pay the medical premiums for the existing retirees. Now. I read blogs. I look at opinion pieces. There's a lot of people who believe that the city can just unilaterally change the benefit to retirees.'",
        "'speaker_7': 'In fact, they can't. The city did try to do this about six years ago. And the retired police officers brought in arbitration against the city and one and one in every regard and ended up the city ended up paying for their lawyers as well.'",
        "'speaker_7': 'You can't touch the existing retirees. What you can do, however, is negotiate with the existing employees who will be retiring at different rates in the coming years. Right now, in fiscal year 1415, the year we're in now, the city is paying $2.7 million a year for the medical premiums of the retired police and firefighters as more and'",
        "'speaker_7': 'more retire and as people live longer. That number is going to go up. As you can see, if we do nothing. The number will go up such that by fiscal 1920, which is only five years away, that 2.7 million is going to go up to 4.2 million.'",
        "'speaker_7': 'At the same time, remember I showed you earlier how the PERS numbers are going up. We cannot absorb both of them at the same time. It's not possible. We have to come up with a program that will provide us relief in this field because we can't do anything about the PERS field.'",
        "'speaker_7': 'Now, I want to give you some definitions because you see some terms up there. You see the term normal cost, you see the usual amortization. Here's what normal cost is. This is the cost of all benefits earned by current and active employees.'",
        "'speaker_7': 'In other words, this is what we should be putting away today and putting into investments into safe, safe return vehicles in order to pay this bill in the future. We're not doing it. Nearly no cities do it. Some do, but very few.'",
        "'speaker_7': 'In fact, Alameda at least has paid it's pay as you go as it came. Do some cities, including the one I live in that I used to work in, borrowed over the past 15 years just to make their ongoing payments.'",
        "'speaker_7': 'So they have compounded their problem such that it's now a problem that's in the billions of dollars rather than millions. The next definition I want to show you is unfunded, actuarial accrued. Oops. Oh, thank you. No, go back.'",
        "'speaker_7': 'There it is. Okay. This is the cost to fund the benefits that should that have already been earned. And should have been funded in the past. The most important point, if you have one take away about all of these benefits, retirement and retiree medical, is that this is a problem that didn't start just 15 years ago when'",
        "'speaker_7': 'the formulas changed. This is a problem that started in the immediate postwar when governments at all levels began giving out pensions and post-employment benefits without putting any money aside to fund them whatsoever. It's been going on for more than 60 years.'",
        "'speaker_7': 'We are now in such a fix that it will take, I believe, 15 to 20 years to fix the problem. That's the bad news. The good news is, if we're diligent and strategic, it can be fixed. Alameda, at least unlike some of its neighbors, is in a position to fix this problem.'",
        "'speaker_7': 'So again, you shall. Is how much we should have been putting away. And normal cost is how much we should be putting away today. When you put them together. It's something called the annual required contribution. This is the combination of normal cost.'",
        "'speaker_7': 'Again, normal cost is what we should be putting away now for the people who are working for us now. And the fuel, which is what we should have been doing in the past. When you put it together. The the actuaries call it the annual required contribution.'",
        "'speaker_7': 'This is the amount we should be putting aside annually to be whole. Now. Let's go back to the numbers now that we've talked about it. This means that what? The city. Is paying in PAYGO comes off of the so-called arc.'",
        "'speaker_7': 'We are underfunded in 1415. If we were going to be 100% funded, that we didn't have a big problem in the future. We should be paying $6.3 million. You can see by the late where the laser pointer is, we should be doing that.'",
        "'speaker_7': 'Instead, all we're doing is $2.7 million. And you can see the problem gets larger. It gets away from us every year. Next slide. Now, how do we come up with these numbers? We assume that every year medical premiums are going to go up 8%.'",
        "'speaker_7': 'Now, last year, the medical premium went up less than 3%. The indication is that this year the medical premium will go up less than 3%. So why are we picking such a high number? Doesn't that make our problem look bigger than it actually is?'",
        "'speaker_7': 'The reason we're picking the bigger number is because for the last 20 years, we have repeatedly had years in which medical premiums and you know this, if you pay your own health care, medical premiums have gone up eight, nine, sometimes as much as 12 and 14% a year.'",
        "'speaker_7': 'We had one good year. We think we have another one coming. We don't know that that's a real lasting trend or whether it's just a blip. So consequently, we're using a pretty conservative number by using the 8%. All of the financial analysts believe that even if you could, you should not fund 100% of your liability because you're'",
        "'speaker_7': 'using assumptions like this 8% and that the most prudent thing to do is to fund at about 75 or 80%. Of course, we're not remotely close to that. Let us show you where we are. Work. Oh, there it is.'",
        "'speaker_7': 'Okay, so what would it look like if we only had to fund 75% of the benefit for next year? 1516? Well, at 100%, we would be underfunded by 6.7. At 75%, we'd still be underfunded by $4.3 million. So, you know, you can play with the numbers, but the numbers are still very bad.'",
        "'speaker_7': 'But we felt it was important to show you what the most common standard is, which is 75 to 80%. Okay. Next one. So to look at it as a pie chart. With 100% funding. The pay go is 31% of the pie.'",
        "'speaker_7': 'That's what, in other words, PAYGO is what we're actually paying today. What we predict we're going to pay in the next fiscal year. The blue area is what we should be paying so that we don't have a bill in the future that we can't meet.'",
        "'speaker_7': 'The pie chart on the right shows you. If you go 75%, we're still more than 50% underfunded for what we ought to be doing. Next. The obligation as it stands today is about $91 million. That we need to.'",
        "'speaker_7': 'Now, we don't need to pay $91 million today, but it's $91 million over the next 30 years.'",
        "'speaker_0': 'And this is just OPEB.'",
        "'speaker_7': 'This is just OPEB. This is not right now. All we're talking about now. That's right, Madam Mayor. Thank you. This is just OPEB. This is not the pensions. This is why we have to get this under control. Police represent a little more than $44 million of our obligation.'",
        "'speaker_7': 'Fire represents about 39 million. And everybody else who's not in public safety represents seven but seven and a half million dollars. The city's total unfunded liability is just a little over $91 million. Next slide. What has been done so far.'",
        "'speaker_7': 'What's been done so far was at long last, in January of 2014, the city decided we better at least get started. With the pension trust. So we created an OPEB trust that currently has about $2 million in it to try to prefund some of this.'",
        "'speaker_7': 'I mentioned earlier there's no spousal coverage as of June 2011. On the 14th of this month, we are going to publish for the public's review and for vote by the Council on April 29 A Proposal. It is a new five year contract with all of our police and fire unions.'",
        "'speaker_7': 'That will include solutions for the OPEB trust. It will fashion a trust that will actually be able to provide us with years of breathing room and will save the city tens of millions of dollars. I want to be clear as I was in my discussions with our Treasurer and auditor yesterday about this.'",
        "'speaker_7': 'This is not a solution that solves the problem forever. It doesn't solve it for 30 years. It solves it in the near term to allow us the time without borrowing, without making the situation worse. It is a net seriously positive impact.'",
        "'speaker_7': 'It allows us the time to cope with the OPEB. A Pardon me? The purse, the pension rates going up. Anything else? So with that council, Madame Mayor, I'd be happy to answer any questions about the context of OPEB.'",
        "'speaker_7': 'There will be much more discussion in this month. Again, the 29th is the meeting and the 14th under the Sunshine Law. 15 days prior to the vote on any labor contract, the public must have access to the contract and all related materials, and we will publish all of those no later than Tuesday, the 14th.'",
        "'speaker_7': 'And with that, I thank you, council members for your attention and would be happy to answer any questions you may have, if I can.'",
        "'speaker_0': 'And we do have two speakers from the Public Council. Did you want to ask questions first? If. Member Ashcraft.'",
        "'speaker_5': 'Thank you. Thank you for that report, Mr. City Manager, on page one of the staff report now page three talking about the unfunded actuarial accrued liability. And in Almeida's case, the fuel is 91.2 million as of the last actuarial valuation done in January January one, 2013.'",
        "'speaker_5': 'Do we do these evaluations annually?'",
        "'speaker_1': 'Every two years.'",
        "'speaker_5': 'Every two years. Okay. So we're not up for what we are.'",
        "'speaker_1': 'So we are. We're in the process of doing one right now.'",
        "'speaker_5': 'Okay. And will we have those numbers by the time we can.'",
        "'speaker_1': 'Actually have Doug Pryor here from and Associates, our actuary? Could you come to the microphone? The question is this years actuary, when do we expect it?'",
        "'speaker_7': 'Yeah, we're we're still in the process of collecting the data. So we're. Typically 4 to 6 weeks off from having.'",
        "'speaker_2': 'Kind of preliminary results to.'",
        "'speaker_7': 'Present to staff.'",
        "'speaker_5': 'So just to follow up, then, by the time we come back on the 29th to vote on the contract provisions, we won't have that information. You don't think 4 to 6 weeks from now or are you in the midst of that.'",
        "'speaker_7': 'Process where we we're still collecting the data from the city, so we don't have everything yet to proceed with our.'",
        "'speaker_2': 'Analysis, but.'",
        "'speaker_1': 'In the order of magnitude of changes are not going to be that. I mean. Right. We're talking billion. Okay. 30 years to 43 million order of magnitude won't change. All right.'",
        "'speaker_5': 'Okay. Um. And. Uh. Okay. The others can wait till.'",
        "'speaker_0': 'After member day.'",
        "'speaker_3': 'So just to clarify in question for a staff, city manager or assistant city manager. Now, when we're talking about the unfunded liability of $91.2 million for the OPEB side, now that unfunded liability, broadly speaking, can be distributed in two ways.'",
        "'speaker_3': 'One for. People who are part of it is attributable to people who are right now retired. They're no longer working. And part of it is attributable to people who are working right now in city hall. But we need to make plans for them in the future.'",
        "'speaker_3': 'So.'",
        "'speaker_7': 'That's correct. It's the whole number. Thank you.'",
        "'speaker_2': 'Vice Mayor and just for the public. Mr. City Manager. If you can verify the assumptions on. The solution, as well as the liabilities, is projecting an 8% increase in health costs a year?'",
        "'speaker_7': 'That's correct.'",
        "'speaker_2': 'And also, it assumes that it's the number of employees that we have now as active no more. Correct?'",
        "'speaker_7': 'That is correct. So what it assumes we've had persistent vacancies, particularly in the police department. This assumes that we are continuing to budget for full staffing. But not increasing or decreasing. Now, if you increase or decrease, you change the numbers.'",
        "'speaker_2': 'And the same with the health or the percentage of increase in health care, correct?'",
        "'speaker_7': 'Well, the percentage, yeah. I mean, it'll be 8%. Whether you have 100 employees or 120, it's going to be 8% per year.'",
        "'speaker_2': 'But those are two variables. What I'm.'",
        "'speaker_7': 'Saying. Oh, yes, right. Absolutely. But but it is important to know that the assumption is that there will not be an increase in the size of these forces and there's no decrease in the. So it's the assumption is we are where we are and we will be there for the next, you know, 5 to 10 years minimum'",
        "'speaker_7': 'number.'",
        "'speaker_3': 'So a thank you. And I want to underscore that point so that people understand that while the what's in front of us right now is about looking out at and years out, 5 to 10 years out, and that's just a proposal stage.'",
        "'speaker_3': 'Let me emphasize, to the extent that it's a good program and the possibility of it going beyond ten years is strong, in which case it is important to us to emphasize and reemphasize that the mechanics of the preliminary idea are such that we have certain assumptions with regard to the number of workers.'",
        "'speaker_3': 'And so to the extent that you change those assumptions, you could potentially then change, you know, all the modeling that we're doing in terms of how much money that we think we need to set aside in the future or now.'",
        "'speaker_3': 'So that's an important point. And I want to further put the context as to why that's an important point, is because, you know, there are certain metrics with regard to staffing levels, how many fire people you need, how many police people you need, how many parks people you need, and where we are with regard to those benchmarks'",
        "'speaker_3': ', again, a guess which one says, you know, okay, this is a satisfactory number of police per 10,000 residents or this is a satisfactory number of parks and park workers per 10,000 residents. Now where we are with regard to those benchmarks.'",
        "'speaker_3': 'When we move forward with with the proposal that we have in hand, we're going to be sticking to our law employee numbers because they help drive our understanding of how we're going to deal with the OPEB issue in the long term.'",
        "'speaker_7': 'May I? May I? Yes. Yeah. From a management perspective, one of the problems that has happened over the years with local government, with all levels of government, is too often when it's budget time. A body looks at saying, adding, let's say, you know, the argument is to add and they're going to add another policeman or police, police'",
        "'speaker_7': 'officer and they say, okay, well, the police officer is going to cost. An extra $100,000 in salary and benefits, but no one looks set. It's also going to increase the premium for the pension in the future, and it's also going to increase the health care in the future.'",
        "'speaker_7': 'And so it becomes important for this government to follow on what Councilmember De Saag was saying. It becomes important that if you're going to handle something like this over the years, to really manage it, to protect the service level of the city which is valuable and should be protected.'",
        "'speaker_7': 'You have to look at the full cost of what is happening in every decision. And I fear that in most levels, particularly of local government, that doesn't happen.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'I have questions. You know, so this is about OPEB. Do we have the dollar amount for the unfunded PERS? Will we see that?'",
        "'speaker_7': 'We don't. We don't. We have presented it before, but we don't have it here tonight.'",
        "'speaker_1': 'When you say unfunded.'",
        "'speaker_7': 'It's yeah, it's it's so it's challenging because it's not unfunded. It's we know what, what our.'",
        "'speaker_1': 'What the bill is.'",
        "'speaker_7': 'Yeah, we know the bill and we know we have indications from PERS. Based on what you saw, that goes up to 65% I think misinformed em actually has the dollar numbers for PERS. With her.'",
        "'speaker_0': 'So when this comes back, that's one of the numbers I'll be looking for, not just the percentages, but dollars for the pub. And it's not just for an oral presentation. I really like this included in writing so that the public can has the opportunity to review it in advance and I want it to go over.'",
        "'speaker_0': 'So there are some slides that came up here today that weren't in the packet. So it could all those be added so that, you know, the public can have all of the slides.'",
        "'speaker_7': 'So everything we've prepared for tonight. Will be presented in the package that is presented to the public on the 14th as well. All right. Will be the 15 days.'",
        "'speaker_0': 'But if these can be added so that the people can look at these right away. That'd be great. So we get a head start on trying to figure this out. That'd be great.'",
        "'speaker_7': 'Yeah, we have no problem putting them on the website, but they will be packaged. Everything will be packaged again for the 14th. So someone picking up the package will have all of the data, some of which you've seen in closed session as we were going through, but that we couldn't disclose until tonight.'",
        "'speaker_0': 'Right. But I really want the public to be brought along. So I want to go over the dates, because if I have this correct, we're talking about a date, April 29th, which is not our regular. Is that April 29th?'",
        "'speaker_7': 'It's it's a budget hearing because this impacts the budget.'",
        "'speaker_0': 'All right. So I want to make sure the audience is aware when this comes back. It will not be on a regular Tuesday council night meeting. It'll be on a special meeting as part of the budget that was added.'",
        "'speaker_0': 'And then in regards to so I appreciate the comments in regards to the number of employees. How does overtime pay impact pensions and our contribution? Is it based on? It's actually based on what the employees earn, including overtime pay.'",
        "'speaker_0': 'Correct.'",
        "'speaker_1': 'So certain. Yeah. I mean, so again, we're talking about OPEB, which is not does not affect overtime. OPEB overtime does not affect other post-employment benefits. So I just want to make sure that we're clear this presentation's about health care into retirement.'",
        "'speaker_1': 'The question that you're asking, Madame Mayor, is about overtime and how that affects retirement. The pension, there's a very small portion of our overtime that is actually factored into the retirement. But generally speaking, overtime is not what we call personal.'",
        "'speaker_1': 'It's not counted toward there per service. There is a small portion of overtime in the fire department that is planned that because of their work schedule, they know that they're going to have overtime. Every work schedule that is pensionable, but the majority of overtime is not counted toward a pension.'",
        "'speaker_7': 'But if I may, can I just follow on a little bit? Thank you. This is an important this is an important point, because everybody who vests once they vest in their post employment, medical care, benefit, everybody gets the same thing.'",
        "'speaker_7': 'Pension. Everybody gets something different depending on their years of service and when they were hired. The retiree medical benefit is flat. It's the same for everybody. So it wouldn't be impacted by what rank you retired at or what your salary was.'",
        "'speaker_5': 'Question for Mr. Russo through the chair, can you just explain when you said when everyone vests with what are you what are you talking about there?'",
        "'speaker_7': 'If you're a police officer or a firefighter, you can't come here, work for a year and get this benefit. You have to work a certain number of years, which eludes me at this moment. How many years it is, Miss Warm Adams, you know.'",
        "'speaker_1': 'It changes. It changes on when you were hired.'",
        "'speaker_7': 'You were hired, right? There's like four different versions, right?'",
        "'speaker_1': 'The current vesting is ten years. So if you're hired today, you need ten years in order to get these benefits.'",
        "'speaker_0': 'Okay. And then I want to discuss at some point the scheduling of when this is going to be approved. I don't think it's appropriate to approve a contract at the special meeting. I think it's important that it be on a regularly scheduled meeting, which is when our public is used to being here.'",
        "'speaker_0': 'I'm very concerned about people thinking that we're pushing it through. So I would prefer that that be set either really be the next regularly scheduled meeting.'",
        "'speaker_7': 'Well, Madam Mayor, we can't do that because the Sunshine Law requires us to give 15 days notice in the next regularly scheduled meeting is 14 days from today.'",
        "'speaker_0': 'Or then the next regularly scheduled meeting after that, as opposed to putting it on a special meeting.'",
        "'speaker_5': 'Like the one to the council to discuss.'",
        "'speaker_0': 'So I think I would like us to discuss the impact because this has been a concern that I think we've all heard. So I would like counsel feedback. I didn't realize that we were talking about doing it on a special meeting, and I think the council would like council feedback on that.'",
        "'speaker_0': 'I appreciate that.'",
        "'speaker_5': 'Question for the city attorney. So anything in our charter and that prohibits us from having an action item like this on a special meeting?'",
        "'speaker_0': 'No, there does not. You you could vote on the contract on the 29th if the next the next regular scheduled meeting would be on May five.'",
        "'speaker_5': 'And and I take it there are ways that we can publicize the fact that this item will be coming before this meeting. STAFF Yes.'",
        "'speaker_0': 'I mean, that's part of what the 15 day and advance notice will be about. It will be on it will be in the newspaper, it will be on the website, there will be notices about it.'",
        "'speaker_5': 'And if I recall correctly, all of those handouts that we were given in closed session this evening that were now appear to be released to the public, that'll be part of the packet that is released on the 14th of this month.'",
        "'speaker_7': 'That's correct.'",
        "'speaker_0': 'Any other council comments? So do we need a motion to have this item come back on that date? Is it? I mean, who sets that calendar?'",
        "'speaker_7': 'Well, I understood that council gave direction, approving it, and took a vote to that effect in executive session tonight, which is why I'm able to discuss that it's happening.'",
        "'speaker_0': 'For that specific date?'",
        "'speaker_7': 'Yes, ma'am.'",
        "'speaker_6': 'Yeah, I think we could. We can kind of control the narrative if if we sit up here and we say this is being pushed through, even though there's 22 days notice and it's the one of the top two biggest issues facing the city council.'",
        "'speaker_6': 'You know, then people are going to think that a bit of we do the responsible thing and don't push that narrative, then I don't think there's going to be a lot of people saying that we're trying to push this.'",
        "'speaker_0': 'So I'm going to say I think it is the responsible thing to have it on a regularly scheduled meeting. Contrary to you suggesting that. But my point.'",
        "'speaker_6': 'What are we've already decided.'",
        "'speaker_5': 'So that's is that a motion you're making at a mere.'",
        "'speaker_6': 'Point of order? I thought we we've already decided that in closed session.'",
        "'speaker_5': 'Oh, that's so.'",
        "'speaker_0': 'So, so it wasn't so.'",
        "'speaker_5': 'We did. I got out on it. Right.'",
        "'speaker_6': 'So did. Yes, you could vote to reconsider, but since you didn't vote yes, then I don't know why.'",
        "'speaker_0': 'We're I think it's very important that it be made clear to the public that we're talking about having a special meeting. I don't think that that was shared as part of the vote that we were discussing. A special meeting.'",
        "'speaker_7': 'I take I have I have to say, Madam Mayor, we did say it was happening at the special meeting of the 29th, which was a budget meeting. And the reason it was being placed with the budget meeting is because of the impacts of the of the proposal have to be considered as part of the budget.'",
        "'speaker_7': 'We had that conversation in executive session just a couple of hours ago.'",
        "'speaker_0': 'So I don't have the verbatim of the vote, but I'm fine with that. I appreciate that we do have two speakers, so I'm going to call the speakers at this point. We have Kurt Peterson and then Jeff del Bono.'",
        "'speaker_7': 'Make one other point, please, because it's come up in this discussion if the council will permit. So. I want to be clear. The term pushed through is problematic. There was. A task force to look at OPEB that was seated in 2012 that included members of Labor, the city's treasurer, the city's auditor, investment bankers, community members, actuaries to'",
        "'speaker_7': 'look at how might we solve this problem. In 2013, I made a report to the Council about OPEB and about the problems with OPEB. This has been discussed for nearly four years now. And so I just want to be clear that while there are legitimate differences of opinion about putting this before special meeting or putting this in'",
        "'speaker_7': 'a regular meeting, I don't share that concern, but because I think it's part of the budget. But and I do recall when I first got here in 2011 that some critics of going forward with a contract for police and fire said, how can you do this as not part of the budget?'",
        "'speaker_7': 'So we're doing it as part of the budget this time. I just want to be clear. This has been nearly four years in the making. And so to the extent there's any suggestion that this is being frog marched through the process, I.'",
        "'speaker_7': 'It really isn't.'",
        "'speaker_6': 'I think it's irresponsible to say that it is.'",
        "'speaker_7': 'I'm not prepared to use that term.'",
        "'speaker_0': 'If I were mayor, vice mayor.'",
        "'speaker_2': 'And I think just to stick to the point, terrorists. The public is going to see on the 14th. The numbers and a proposal that goes with those numbers and that goes with this this general overview plan the council in between and this is another thing we discussed is going to individually avail themselves if they so choose.'",
        "'speaker_2': 'And I think we all better do this and meet with the assistant city manager and go step by step through the contract. It's going to be presented so that we understand what stays the same, what's being changed, and then how it applies to this this proposal that we all heard tonight, and I think we have a meeting'",
        "'speaker_2': 'in between now and the 29th where we could call the question back and say, we're not satisfied. We need to move the target back up, but we better have a reason for that. And I think we're all going to study it.'",
        "'speaker_2': 'So I'd like just to keep this focused on we've got a program that's not going to solve it but is going to reduce our liability. We've got potential for a contract that implements that. We haven't seen that yet.'",
        "'speaker_2': 'I think I'd like to see it. I'd like the public to see it, and I urge everybody to look at it all. Your council member email your council member, email the city manager with your feedback so that by the 29th or when we decide to do it, that we make an informed decision.'",
        "'speaker_2': 'But please look at the numbers and then please look at the contract to make sure that it gets us toward that.'",
        "'speaker_0': 'Remember.'",
        "'speaker_5': 'Ashcroft Thank you. And again, we're talking about doing something that it has been said we should have done long ago in this council is digging in and actually doing it. And when I heard the city manager in the presentation thinks that it will take 15 to 20 years to fix the OPEB problem.'",
        "'speaker_5': 'What I wrote in the margin on my notes is that we as the City Council need to provide the blueprint for how to do that. We want to show the path forward for not just our council but councils that will come after us.'",
        "'speaker_5': 'It is the responsible thing to do and I also give our public credit for coming out to the issues that are important to them, whether at a regular meeting or at a special meeting. So I, I don't think we want to delay this any further.'",
        "'speaker_5': 'And again, some very interesting materials that you've seen in the slides will be coming out for the public a week from today. Thank you.'",
        "'speaker_0': 'Thank you. Kurt Peterson.'",
        "'speaker_7': 'Thank you once again. IP. I find it very disturbing that these numbers that are so troubling to our city are presented to you by our city manager rather than our treasurer or auditor. You have to keep in mind he is also the city negotiator on these contracts.'",
        "'speaker_7': 'You're giving an awful lot of impact and power to one individual here. And he's also telling you that this took years, we've had problems. But by the way, we have to do it in 14 days now. We have to get it taken care of in 14 days.'",
        "'speaker_7': 'This is the rush. Technique that has been placed in front of our city council for a number of years. I commend you as far as Madam Mayor, to want to do this at a meeting. Maybe it's not convenient, but you knew that this was coming up.'",
        "'speaker_7': 'You could have planned ahead of it. And I think it is the mayor's responsibility to do agendas as set up agendas, but conveniently were in this again in a special meeting. People aren't going to know. It's going to be presented as far as on the 14th.'",
        "'speaker_7': 'And you got to realize we've got to papers come out once a week minimum time for them to come up with due information and article again, forcing the hand of the people without their understanding. And it's just unbelievable that you can sit here and let it continue to happen.'",
        "'speaker_7': 'Take time. Do it correctly. It makes sense. Maybe we won't have a problem in the future if you do it that way. But to have the person that gives you the numbers. I would have felt much better if Mr. Kennedy or Mr. Kearney could have given you these numbers, explained his concern about it, rather than the person'",
        "'speaker_7': 'that's going to take the time and do the negotiation. And he's going to be leaving office in the very near future as well. Thank you very much.'",
        "'speaker_0': 'Thank you, Jeff Del Bono. And I don't have any other slips on this item. If you want to speak, please turn in a slip.'",
        "'speaker_6': 'Not a mayor. Council members, city staff chief told Bono if Local 689 president and negotiator for the last three or four contracts and.'",
        "'speaker_4': 'This is just to add some context from our perspective because everybody has their own perspective. I think we've been working on this for 15 years since I've been here. I know that it's been a cultural change in our department.'",
        "'speaker_4': 'I know that I've sat up here and I've had discussions with Mr. Kennedy, Carnegie, John Russo, other people in the community that I have a core belief that people deserve health care, they deserve a good pension when they retire.'",
        "'speaker_4': 'Mine's good. I'm thankful for that. I have a good health care, good pension. I know that that's an important thing. I know it's important. It's important for the people that are sitting out in the audience tonight that are looking for a good wage.'",
        "'speaker_7': 'So I'm a true believer in that. But. Under my.'",
        "'speaker_6': 'Leadership and the.'",
        "'speaker_4': 'IFC leadership that's been here the last 15 years, we have increased the time.'",
        "'speaker_8': 'For investment from 5 to.'",
        "'speaker_4': '10 years. This is for OPEB. We have dropped Cadillac plans off. That was something John didn't mention. We've captured a Blue Shield or Kaiser and got rid of the other plans that we that past retirees could pick from.'",
        "'speaker_4': 'We've dropped the spouse for new hires and set up a412 age plan that they can contribute to for their spouse that they invest in and capped out at Blue Shield or Kaiser. We've taken our pension for our purse and we've gone from pay 9% to 15%.'",
        "'speaker_4': 'And what does that mean? Whether you believe that overtime should be paid to firefighters or police officers in the city. I do. If I work, I want to be paid for my time. My hourly rate is four $41 an hour and I take $8 of that and I pay it towards my pension and my health care.'",
        "'speaker_4': 'And I have no problem with that. And at this point, you know, we're looking at a dual to where we form a trust. And the employees who have never played one dime towards their retiree health care are now looking and willing in facing paying a percentage towards a health care trust.'",
        "'speaker_4': 'So I'll end this by by saying that this health care trust once set up and where the city's invested, the employees are vested. I have another 15 years ago, and I know that you have my word after doing all we have done over the last several years, that we understand that this isn't going to be fully funded'",
        "'speaker_4': '. But we are partners. We are willing to sit at the table. We are willing to look at this fund that we're both going to be invested in and make it succeed. That's where we're coming from. I'm speaking for the firefighters.'",
        "'speaker_4': 'I feel safe enough to speak for the police officers because we've been working together to fund this benefit. And what I would ask of you is give us the same respect back. Realize that sitting down and talking and being respectful to each other works a lot better.'",
        "'speaker_4': 'Sitting in the coffee shop and yelling things out and badmouthing public safety and badmouthing.'",
        "'speaker_6': 'Our benefits as leaders doesn't work.'",
        "'speaker_4': 'So give us the respect back. We want to be respectful to. We're willing we've proven that over and over again.'",
        "'speaker_6': 'Thank you for your time.'",
        "'speaker_5': 'Um, I would, I would ask that we have the city treasurer Kevin Kennedy, and parties are putting you on the spot. Mr. KENNEDY. But I happen to know that you have seen this presentation and discussed it with the city manager.'",
        "'speaker_5': 'Would you mind coming?'",
        "'speaker_8': 'I wouldn't mind. I was hoping that this would be one of the few meetings that I'm not doing the presentation, Mr. Peterson. I actually have enjoyed someone other than me doing this. This is great. I've spent a lot of time.'",
        "'speaker_8': 'I was thinking I've probably spent almost as much time with Bartels over the last ten years I have with my son. These numbers are things that I've spent an inordinate amount of time on. I've said all along, I've said it to our city manager.'",
        "'speaker_8': 'I've said it to the various council members over the last ten or 15 years, and I've said it to Mr. Del Bono and to the police also. My interest is in resolving this in a way that doesn't bankrupt the city, but that also does not deny these employees some of the promises, quite frankly, that the city's made'",
        "'speaker_8': 'to them over the years. This is not one side versus the other. This is a collaborative effort to try to figure out how we're going to dig our way out of this hole. And I think we've had that type of dialog.'",
        "'speaker_8': 'I think it's good. But it is a very deep hole, as you can see from those numbers. I got to be honest with you, I've seen those. We did our first actual report in 2007 as a result of changes in the accounting, the Gadsby rules.'",
        "'speaker_8': 'My stomach turned just as much looking at that tonight as it did the first time I saw those things. That's a big, big number. But at the behest of a Vice Mayor Maharishi, back when he was on council, along with Doug Duhon, I participated in a group that actually quantified these numbers, talked about what was involved.'",
        "'speaker_8': 'I tried to lay those out. It was not a policymaking group. We did not get into the solutions portion, but we did lay these problems out. That was feels like it was just last year, but it was seven years ago.'",
        "'speaker_8': 'Now, as a city measure, Russo mentioned, I was part of a task force that sat down with all the interested parties and took a look at what potential solutions were out there. I think that was a productive chance for us all to sit down at the same table and talk about these things.'",
        "'speaker_8': 'I will tell you, I do have a concern, though. I've been part of the discussion. I haven't been part of the negotiation, and that's probably not my role. But I got these this information yesterday. I was briefed by by our city manager and our assistant city manager yesterday.'",
        "'speaker_8': 'I've spent a lot of time with these numbers. I opened up the new actuarial reports, which go into a lot more detail than the summary tonight. And quite frankly, it makes my head spin. I've got two weeks to try to figure out.'",
        "'speaker_8': 'I can't tell you tonight whether I think it's a good deal, a bad deal or indifferent. And I doubt I'm going to tell you tomorrow or at the end of the week. This is a huge, huge pile of information, and I've spent a lot of time with it.'",
        "'speaker_8': 'So my concern is not whether or not this is a good deal, because, quite honestly, I'm not in a position to weigh in on that at this point. My concern is that if I'm going to have to really bear down over the next couple of weeks to figure out what this is, I don't know how many of'",
        "'speaker_8': 'you followed that OPEB presentation and understood all of that, but this is OPEB 101. When you look at this and this is a five year deal, so I just think there's an awful lot of work done that needs to be done, I'm sorry, over the next two or three weeks so that the public understands what's going on'",
        "'speaker_8': 'and the public can express their opinions. And most importantly, the five of, you know, because you're voting on a five year contract and that's a very big thing. Again, I can't tell you if it's good or not, but I can tell you it's a very big decision.'",
        "'speaker_8': 'And I think it really is going to take a lot of heavy thinking over the next couple of weeks. I'm happy to participate however I can. I need to get my brain around it. I know staff is eager to educate us about it, but.'",
        "'speaker_8': 'If I have a concern at this point, it's that we've got a couple of weeks to vet what I think is a very critical decision for the city, and I hope we're all up to it.'",
        "'speaker_7': 'The question's actually may I ask real briefly just because we've talked about this for so many years, you know, both formally and informally, I'm not asking you to give an opinion. I agree with you. You've had 24 hours with the proposal, the solution proposal that's going to be disclosed on the 14th.'",
        "'speaker_7': 'But the numbers that were in the presentation, they don't look. Unduly rosy to you compared to the number of, say, your task force that put together seven years ago? Because the the allegation here, what's what's sitting here and I know this town well enough at this point to know the narrative that some are attempting to construct.'",
        "'speaker_7': 'That the numbers are cooked. Do you think those numbers look cooked now?'",
        "'speaker_8': 'No, I don't think the numbers are cooked. I think you've got an that liability of 91 million. I think in 2007 it was 71 million, something like that. So we're up 21 million since then or 20 million since then.'",
        "'speaker_8': 'I don't think those numbers are flawed. I think Bartel is a very good actuary firm. They a lot of this is based on assumptions that they're very familiar with and that they use in a lot of places. So I'm not worried about that 91 million being the right bogey.'",
        "'speaker_8': 'I think the question goes back to how do we fix it and how much can we fix it? Is it feasible to assume that we can continually dig our way out of this hole? Is this proposal that's on the table now?'",
        "'speaker_8': 'Going to get to move the ball down the field. And again, I'm not saying it won't. I'm not saying it will. But I think we need to figure out in the next 14 to 21 days whether or not this is the way to do it.'",
        "'speaker_8': 'I think it's very clear on both sides, both from the city standpoint and from employee standpoint, that this isn't a solution. The city manager is very clear. Neither the utter I are under any illusion that this is going to solve the problem.'",
        "'speaker_8': 'But does it make a difference that's meaningful? Net net with all the different moving parts that are part of this agreement. That's the question. And again. I think the important thing and we talked about this when the last public safety contracts were approved.'",
        "'speaker_8': 'One of my gripes, if you want to call it that, was that the public did not have a lot of time to vet that. And given that. These things tend to appear on the agenda when they're up for your approval.'",
        "'speaker_8': 'Not when our position is being considered our negotiating position. You know, we're probably in a similar spot now where the public's opinion, quite honestly, has been rendered moot because this deal has basically been put together. So really what it's falling down to at this point is, are the five of you comfortable with where this goes and your'",
        "'speaker_8': 'understanding of it? You know, I'm I'm getting used to the process of government, but I. I think this. I don't know if I'm if I'm wrong on this, please correct me, but I'm not sure this is a negotiation at this point.'",
        "'speaker_8': 'This is deciding whether what we've gotten to is a feasible and viable option. So I think everybody, though, needs to, including the public, if they're able to to to vet these numbers, should spend some time with it, because it again, it's a very, very important thing.'",
        "'speaker_0': 'Thank you. Any other member questions? I have a question. The current contracts, when do they expire?'",
        "'speaker_7': 'At 2017.'",
        "'speaker_0': 'Is it June or January?'",
        "'speaker_7': 'No, it's it's the end of 2017.'",
        "'speaker_0': 'Or the end of 2017 is when the current contracts expire. All right. So we're asked why are we doing this now as opposed to closer to the end of 2017?'",
        "'speaker_6': 'I can kind of answer that. The vice mayor and I heard about this on the campaign trail made it a priority. And this was something that people told us they wanted fixed. I mean, we spent an hour sweating at the Oakland Tribune going through all these numbers.'",
        "'speaker_6': 'I mean, this is something that is is an issue that is important. And we need to tackle this. And if I recall correctly, we unanimously gave direction to staff a few weeks ago to pursue a path based on what was what they came up with on Friday.'",
        "'speaker_6': 'So, you know, we gave direction. Staff come up with it. They negotiated in good faith and. I guess I'm confused. Why why there's why there's backlash after we gave gave this direction to the staff to do it this way.'",
        "'speaker_0': 'If I'm trying to educate the public as to what's going on here, and that hasn't been sure as far as I know.'",
        "'speaker_7': 'Well, all right. Let me let me suggest that tonight we were trying to place context on OPEB so that the discussion about the eventual contract could be meaningful and placed in an important context. What I will say is this as I've argued with labor for the last two years.'",
        "'speaker_7': 'This problem of these benefits and the unfunded liability, the longer we don't address them, the harder it becomes to fix them. And I see my friend, the Treasurer, nodding his head. Yes, because we've been having this conversation for years now.'",
        "'speaker_7': 'The sooner you get at this, the better. So now that there's the opportunity based on council direction to go forward and negotiate what will be an essential first step, a necessary if not sufficient first step in a solution.'",
        "'speaker_7': 'That's why we're bringing it forward now.'",
        "'speaker_0': 'Thank you. And then when this comes back, we'll include the entire contract. This will include all the contracts.'",
        "'speaker_7': 'Will be disclosed on the 14th. It is required by the Sunshine Law.'",
        "'speaker_0': 'And then we'll highlight the highlight the changes, whatever changes. So that's clear.'",
        "'speaker_1': 'It'll be strikethrough.'",
        "'speaker_0': 'Strikethrough. Thank you. And remember Ashcraft.'",
        "'speaker_5': 'And just for the clarification on the staff report that we will get before the 29th when we consider that the public safety contracts, will we will the staff report include commentary by Mr. Kennedy or his analysis? He said he's he's going over the numbers now.'",
        "'speaker_5': 'I know.'",
        "'speaker_8': 'I'm next week.'",
        "'speaker_5': 'Keeping oh.'",
        "'speaker_7': 'Wait.'",
        "'speaker_5': 'Times.'",
        "'speaker_7': 'I assume that that both Mr. Kennedy and Mr. Carney, who's Mr. Carney with April 15th looming is particularly under the gun, although so is Mr. Kennedy. From what I understand, I assume that both of them will be able to attend and will attend the meeting on the 29th and address answer questions and give their opinion about what'",
        "'speaker_7': 'they think about it. And I'm pretty confident I'll hear about it before the 29th from them personally.'",
        "'speaker_6': 'And we could to.'",
        "'speaker_0': 'Any other member disagree.'",
        "'speaker_3': 'Or about comments.'",
        "'speaker_0': 'Uh. Right, we're going to comment. Right. I think we're done with all the speakers. Correct? Right.'",
        "'speaker_3': 'Thank you. Thank you very much. Earlier this evening, we as a council met in executive session to go over some of the deal points that were going to help inform the discussion that that will happen about the contracts for public safety, particularly.'",
        "'speaker_3': 'This evening I had voted. I had to stand on the vote. And I just want to make clear as to the reason why I abstained on the vote is because it's similar to what City Treasurer Kevin Kennedy said.'",
        "'speaker_3': 'I just I need to know not just the mechanics, but in the end I need to know that the numbers are going to help us towards solving the the unfunded liabilities. There are elements to the agreement that are in place.'",
        "'speaker_3': 'You know what? Share how much people are going to contribute over time. But those percentages and rates in my the way that I deal with these matters in to be applied to some real numbers so that I can say all I see so that adds up to that and that relative to the $91 million is so and'",
        "'speaker_3': 'so so that I can then eventually say, okay, I think that's a solution that I can live with or not. And because this evening was for the most part about kind of the fleshing out the framework of the discussion, I abstained.'",
        "'speaker_3': 'It doesn't mean that I'm against the framework. It doesn't mean that I'm against the particulars that were raised in the course of the discussion. It just meant that, you know, for my. Comfort level. I just wanted to actually apply those numbers.'",
        "'speaker_3': 'Some absinthe that I can also. I'll do that on my own as well. So. So when we eventually have the discussion on the about the contract of the labor contract in our council members and either make a decision that night to make to move forward with a contract or they can make a decision to move forward with'",
        "'speaker_3': 'the contract at a later time. You know, there are plenty of options. So I don't think we should second guess a person's motives or not. I think in the end, we're going to make a good decision on behalf of the public when it comes to the contract A and B, and this is what I really want to'",
        "'speaker_3': 'get at. I think we're going to make a good decision on behalf of the public when it comes to dealing with the outstanding unfunded liability for the on the open. And I think we're got we're moving in the right direction because without going into the details.'",
        "'speaker_3': 'The mechanics of the trust fund idea that City Manager Russo has promoted not just recently, but over the course of 18 months. Roughly, we can Kanaks of the trust fund. The idea is that it could help address the unfunded liabilities that is attributable to workers who are right now working in City Hall.'",
        "'speaker_3': 'Remember that question that I asked earlier that when you look at the unfunded liabilities, that broadly speaking, you can just you can divide it into two categories of the $91 million, the portion that is attributable to those who are retired right now, they're out of city hall or leading the good life, hopefully.'",
        "'speaker_3': 'And then there's also the portion of the $91 million as attributable to workers who are right now still in city hall. But we have to make sure to plan for their health needs in the future. So the $91 million breaks off in 2 to 2 numbers.'",
        "'speaker_3': 'And from what I'm seeing, the mechanics of the trust fund idea that city manager Russo has has put forward over the many months, I think really do begin to deal with the to address the unfunded liability for the current workers.'",
        "'speaker_3': 'And it's a long term solution. So but I do think that we still are going to have to we're still we still need a strategy for the unfunded OPEB liabilities for those who are already retired. Because, you know, we made a promise to them that the money was going to be there.'",
        "'speaker_3': 'Now, let me make sure to say right now, as the city manager had indicated, we're paying $3 million every year towards individuals as retired persons as health. I remember that $3 million is, as we had dubbed, it's a pay go, meaning that it's paying for medical services or is paying for whatever agreements that we did for that'",
        "'speaker_3': 'retirees. But it's not the $3 million is not going towards buying down the outstanding $91 million unfunded liabilities. So on the issue of the OPEB trust, in my mind we almost have to think about having two trusts, one trust or the workers right now with whom we have certain deal points, the mechanics of which are clear.'",
        "'speaker_3': 'But the the, you know, the extent to which it addresses the unfunded liabilities attributable to current workers, it's it's still out there. But I think it's it's moving us in the right direction. But I also think we need another trust fund of sorts to deal with the unfunded liabilities for those retired workers.'",
        "'speaker_3': 'So in a nutshell, let me just put it to just just to give you an order of magnitude, my understanding is that of the $91 million in unfunded liabilities for OPEB, of the $91 million, $38 million is attributable attributable to workers right now.'",
        "'speaker_3': 'We know that the workers right now how long they're going to live when they retire. And we've made the calculation through Bertelsmann Associates, I think it's roughly $38 million needs to be set aside for them. So that means that the balance $53 million is what needs to be strategy.'",
        "'speaker_3': 'That's what I'm talking about, that there needs to be a strategy for that as well. And also, I think it's important, like I mentioned earlier, that we make this decision on a wide, wide open basis, meaning that there will be some agreements that we're going to have to make with regard to staffing levels over the long term'",
        "'speaker_3': '. And the final point is, I do think this is an issue that I raised several weeks ago. I do think that we still need a finance commission, one of whose specific tasks is to kind of, you know, monitor the progress that we would make relative to any agreements we make on the unfunded liabilities for current workers, OPEB'",
        "'speaker_3': 'liabilities for current workers, or unfunded liabilities for those who are already retired. So thank you.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_5': 'Well, I'm sorry, I. I think Mr..'",
        "'speaker_0': 'Brody.'",
        "'speaker_6': 'I think you met. I just try to be brief. I think if you look at the staff report, you know, there's a sentence in any solution must be developed in partnership with our labor groups. And I think that's the big constraint that I think sometimes is lost in this argument, is that as the council, we cannot sit'",
        "'speaker_6': 'up here and impose a solution unless we involve our partners in the labor organizations, specifically public safety, because they're the biggest chunk of of of the cost. So. We've had we have this in three parts. You know, we've known about the liability.'",
        "'speaker_6': 'You it was 71 million back in oh seven. It's 90 some million now. Keeps growing. And we had an idea. There was a task force. The trust fund. That was the idea. So we had to solve how we're going to fund that trust fund.'",
        "'speaker_6': 'And that's the task that, you know, I think lost in today's discussion is unanimously this council a few weeks ago gave direction to staff using a framework to negotiate a solution, not a complete solution, a partial solution that will not kick the can down the road, but at least maybe will carry the bucket for a few years'",
        "'speaker_6': 'and then try to have to fill it up again later. So. That's what we the job we gave the staff and they came up with a funding solution. It's painful. It's painful for us as a city. It's painful for our employees who will be doing something that no other bargaining unit in the area will be doing.'",
        "'speaker_6': 'But I think it's a good step in the right direction. And and I hope that we remain focused on, you know, this is this is the one thing that keeps me awake at night is how are we going to take care of these unfunded liabilities?'",
        "'speaker_6': 'This and what we do in the next couple of months at Alameda Point are probably the two biggest, biggest issues that are going to face this council. So this is something that's very important to us. I mean, we take this seriously.'",
        "'speaker_6': 'I hope to hear from a lot of people when the details of of the proposed contract come out, you know. I hope that that, you know. Some of the comments are respectful, you know, and that are responsible. And it's instead of, you know, using some of that code word that the city manager talked about earlier about ramming'",
        "'speaker_6': 'things through, and I hope the discussion is framed in a way that. If you don't like the way that the city has decided to fund this trust fund, then please come up with different ideas. So, I mean, showing leadership is not sitting in a coffee shop bashing our public safety employees and bashing their benefits.'",
        "'speaker_6': 'Showing leadership is saying. This is how we're going to find a solution. And if one of us doesn't like that solution, then I think to show leadership, it's our job to find a different solution. So I'm really looking forward to spending the next few weeks diving into the details of this and and especially on the impacts.'",
        "'speaker_6': 'So when we see the numbers, you know, it's not going to solve the entire 91 million. Of course, Member de Song alluded to that. But let's pay attention to what what we are going to solve and the big chunk that we're going to take out of this liability.'",
        "'speaker_6': 'And then our next task is to approach, you know, the other 38 million and come up with solutions that we can make this long term sustainable. But I think this is a good first step, and I'm really interested in delving into the details.'",
        "'speaker_0': 'Amber Ashcraft.'",
        "'speaker_5': 'Thank you. Mayor Spencer And so I was just going to ask a couple of maybe pragmatic housekeeping questions to the folks who think we shouldn't be moving forward at the end of this month considering these revised contract provisions.'",
        "'speaker_5': 'Is it because you feel we don't have enough information? And if so, what is that information? What more information would you want to have? I've heard the concern that it's a special meeting versus a regular meeting, so people aren't as attuned to that regular, first and third Tuesday.'",
        "'speaker_5': 'But we all know that we can have a regular council meeting with a very sparse attendance because it's more the agenda items that bring people out rather than it just being a regular meeting. And people participate in all different ways.'",
        "'speaker_5': 'They're watching us on television, on their computers, live streaming. And then I also want us to consider the question, do we think it's preferable to continue these current contracts that are in place? Because then we wouldn't be adding these provisions that start getting the employees to help pay down their own pay towards their own benefits and help'",
        "'speaker_5': 'us start paying toward our OPEB liability. It's not quite the same, but I'm just going to analogize to the Iranian nuclear agreement that was was agreed to on a national and international stage last week. And and yet there is a party in Congress that would like to just tear it apart.'",
        "'speaker_5': 'And the question there is, is it better to continue with no agreement in that case or an agreement that maybe not perfect but took a long time in the making? I do know that the city manager, I think, has a weekly breakfast meeting with the two Kevins, as we like to call them, Mr. Kennedy and Mr. Kearney'",
        "'speaker_5': '. I do realize it's tax tax season and you guys are really busy and we do appreciate all the good work you do for the city. But when this staff report comes back, I do want to see the devil's advocate portion.'",
        "'speaker_5': 'I guess the devil's in the details and I want to see the devil's advocate position because we don't just want a happy talk and we want to know, you know what? Why is this a good idea? Why maybe is this not I want to hear.'",
        "'speaker_5': 'I mean, it will help all of us make a more informed decision. I'm not entirely clear on what Member De SA still wants to see, but perhaps he will. We'll let staff know because when this comes back to us, I do want us to have as complete information.'",
        "'speaker_5': 'I, I know because the city managers kept us informed in the last month or so that these talks have been ongoing. And that's the nature of talks. You don't you don't get everybody agreeing to all the points that need to be agreed to the first time out.'",
        "'speaker_5': 'It's been an ongoing process. So give us all the details. The good, the bad, the ugly. Don't sugarcoat it. We we want to have all the information possible to make a good, informed decision and to any of the council staff public who would like to see more information, shoot an email to to the staff.'",
        "'speaker_5': 'They'll they'll consider it. Thank you, Mayor.'",
        "'speaker_0': 'I swear.'",
        "'speaker_2': 'The only thing I'd like to say is that I'm looking at this as if we do nothing. What happens if we do this? What's the upside? And is it worth the downside? Is the money we're going to save worth the five extra years, for example?'",
        "'speaker_2': 'That's a good thing to measure. I urge people to do that. Second thing is, if this is a matter of having a special meeting versus a regular meeting, I'm perfectly willing to say we can meet on the fifth at the regular fifth six days to me, doesn't matter in the scope of things here.'",
        "'speaker_2': 'I, I do like the fact that it's paired with a budget hearing because this is the number one issue of, of our budget. And I think if everybody is heightened to it. But I think we're going to do a better job at educating people on what the impact of what these decisions are.'",
        "'speaker_0': 'So in regards to our budget calendar, I believe we also still have budget meetings coming up. We're not finished with the budget in April. So we have not seen our multi-year budgets. I think we have a meeting May 12th that addresses the budget.'",
        "'speaker_7': 'No, actually the multi-year budget will be presented on April 16. So there's a meeting next week. That's on next Thursday, April 16, and that's where the five year budget projections will be presented. Then there's a regular council meeting on April 21.'",
        "'speaker_7': 'And then there's another budget meeting on April 29. Then there's another budget meeting second week of May, and then there's a regular council meeting on May five.'",
        "'speaker_2': 'And my understanding is that. This item. Is going to be presented. And part of that budget. Projection on the 16th. Correct.'",
        "'speaker_7': 'This item will be included include numbers will be included. And on the 14th the entire package will be presented to the public, sharing a lot of the data that the Council and mayor have already received. And if during those numbers, during that presentation of the numbers, if council members want to start exploring some of the ramifications of'",
        "'speaker_7': 'the potential deal, it's not an orderly process that way, but it's your process.'",
        "'speaker_0': 'So so we do have more budget meetings coming up after the date in April. Yes. So so that's one of my concerns. I also like to bring the public along as much as we've had now to close session meetings of approximately half an hour each to discuss this.'",
        "'speaker_0': 'The public has not been privy to that. And I think it's very important that the numbers be shared with the public. And I am looking forward to seeing the continuing meetings on the budget and the multi-year budgets as well as the entire contract that we will be being asked to extend the entire contract, not just this and'",
        "'speaker_0': 'I have not been privy to the looking at the entire contract. I think that that's very important that that be shared. Any other comments on this one? Thank you. So now we can move on to six be.'",
        "'speaker_1': 'Recommendation to accept report on offer to transfer a portion of the Oakland Inner Harbor Tidal Canal from the Army Corps of Engineers to the city of Alameda at no cost and subsequent disposition of property.'"
    ],
    "Report on Transfer and Disposition of Oakland Inner Harbor Tidal Canal.": [
        "'speaker_0': 'Madam Mayor and Council, this particular item is coming to you primarily from my office, Andre Pennock as an assistant city attorney in my office, and Jillian Blanchard of Rutter Law Group, who is an Alameda attorney, have been working very hard with the Army Corps of Engineers and other potential regional partners.'",
        "'speaker_0': 'This is another sticky wicket that's been around for a very long time that has just hard to get our arms around and try to solve some problems with. It's not the big ticket numbers that you've just been hearing about, but it has a lot of implications and frankly, has a lot of impact for quite a number of'",
        "'speaker_0': 'Alameda. And so I'm going to turn it over and let Andre go and Jillian walk you through it. Thank you.'",
        "'speaker_3': 'Thank you. City Attorney Kern. Good evening, Madam Mayor. Vice Mayor matter. Members of the City Council and members of the public. My name is Enrico Pinnick. I'm the assistant city attorney and I have with me Ms.. Julian Blanchard, outside counsel from the Ryder Law Group.'",
        "'speaker_3': 'We're here to provide you with an update on the potential transfer of a portion of the Oakland Inner Harbor Tunnel Canal from the US Army Corps of Engineers to the city of Alameda. It's not quite the OPEB discussion you've just had, but as Mr. Kernen has just mentioned, it is an important matter to many citizens here in'",
        "'speaker_3': 'the city of Alameda. I will provide you with a brief overview and history of the title canal. Discuss the existing conditions along the canal and highlight some of the issues related to the proposed transfer. I wouldn't turn it over to Miss Blanchard, who would discuss the possible transfer options and the consequences of no action.'",
        "'speaker_3': 'I would then conclude the presentation with a brief discussion of next steps. The Army Corps created the title canal in 1882 by dredging the Oakland estuary to San Leandro Bay. The total canal is 85 acres in total area, approximately 400 feet wide and 1.8 miles long.'",
        "'speaker_3': 'So it's approximately 1800 feet northwest of the Park Street Bridge and goes down to the entrance of the San Leandro Bay. As a result of accretion, which is the gradual accumulation of soil along the banks of the last century.'",
        "'speaker_3': 'Taro Kono now includes uplands areas. Note the area in red and blue on the current slide. That's the primary area that we're going to be talking about tonight. But there are other areas. The red line is known as the bulkhead line.'",
        "'speaker_3': 'Or the outer boundary of the original title canal. The blue line is called the pier hit line, as it generally follows the outer boundary of the existing piers. The area between the bulkhead and the pier line is the shoreline area is approximately 35 feet wide on average and currently contains private structures, docks and in some cases portions'",
        "'speaker_3': 'of houses. Part of the shoreline area also supports industrial uses. And as you can see from the map, from the slide, there are a lot of structures in between those two red and blue lines. There are approximately 90 residential properties and 14 commercial properties which are adjacent to the shoreline area.'",
        "'speaker_3': 'Portions of the shoreline area are dry, while other portions are partially or fully submerged like the rest of the total canal. The shoreline area is owned by the Army Corps. The history of the negotiations in 1990, the Water Resource Development Act, or Water authorized the Army Corps to transfer the Alameda side of the total canal to Alameda'",
        "'speaker_3': 'at no cost. Oakland was offered the same deal for the Oakland side of the Tidal Canal. The water only allows transfer at no cost to a public entity. The Army Corps has repeatedly stated that it wants to transfer the entirety of the canal as a package and has no interest in transferring to multiple private owners.'",
        "'speaker_3': 'In 2004, the Army Corps instituted a permitting moratorium for new construction, maintenance and repair. The moratorium remains in effect indefinitely. As a result, the city is unable to enforce its zoning and building code requirements. From about 2005 to 2012.'",
        "'speaker_3': 'Citizens and realtors in Alameda have expressed concern to the city regarding the moratorium and have requested that the city take action. The property owners along Burnside and Marina Avenue have formed a homeowners association called the Waterfront Homeowners Association, or Wahaha, to deal with this specific issue.'",
        "'speaker_3': 'Although the Army Corps has been authorized to dispose of this property since 1990, interest on both sides to pursue this transaction as waxed and waned over the last 20 years without much more progress. Then in 2013, the East Bay Regional Parks sent a letter of intent to the Army Corps expressing interest in taking the Oakland side of'",
        "'speaker_3': 'the tidal canal. Once upon him on September 2nd, 2014 and closed session, the City Council authorized the city attorney to send a letter to the Army Corps expressing the city's interest and also negotiating a possible transfer. With this renewed expression of interest, the city attorney asked Miss Blanchard.'",
        "'speaker_3': 'To continue to meet with the Army Corps and its representatives. And in addition with the representative of the homeowner's association. About the next steps to transfer the Alameda side of the tidal canal to the city. On February 3rd in closed session, the city attorney updated you in closed session on the status of the discussions.'",
        "'speaker_3': 'The City Council at that time directed city staff to present this item at an open meeting so as to inform the public and to allow the opportunity for public input. Well, there's a saying that if it were easy, somebody would have done it already.'",
        "'speaker_3': 'And true words were never spoken when it comes to this proposed transaction. It is not going to be easy. It is going to take a lot of support from all concerned to move this transaction forward. Current situation creates problems that affect the individual property owners.'",
        "'speaker_3': 'Industrial users and businesses along the tidal canal. Realtors in the area as well as the city as a whole. The per minute moratorium prevents any new construction, maintenance or repair of existing structures unless there's an emergency. Thus, the city is unable to properly enforce its zoning and building code requirements within the total canal area because the adjacent'",
        "'speaker_3': 'property owners have no authority to fix their dogs and other dilapidated structures.'",
        "'speaker_7': 'Moreover.'",
        "'speaker_3': 'There is no mechanism to clear title. Many of the adjacent residents and property owners have used the shoreline area as if it were their own. However, they pay no property taxes because the property is actually owned by the federal government.'",
        "'speaker_3': 'In many cases they pay no possess re interest tax because they do not have current leases with the Army Corps. In 1913. Taking a step back as to how we got to the situation, the assistant secretary of war authorized a license to construct nine permanent structures along the tidal canal for maritime use.'",
        "'speaker_3': 'Adjacent property owners took advantage of this license and started building structures between those red lines and those blue line.'",
        "'speaker_5': 'What did you see? That was Mr..'",
        "'speaker_3': 'Billy. I'm sorry, ma'am. It's 1913. Going way back. One more. One until. Because it's the Secretary of war. And we never call them that anymore.'",
        "'speaker_7': 'However, the.'",
        "'speaker_3': 'After setting up this license regime, the Army Corps has changed his position several times on how it chooses to regulate the tidal canal. The Army Corps then imposed the moratorium in 2004. And now here we are, where structures were lawfully put in this shoreline area.'",
        "'speaker_3': 'But now the adjacent residents are prohibited from doing anything with them. The resident, the residential owners, but the residential owners, when it comes time to sell their property, there is no way to clear title for an area that they have improved in use but do not own.'",
        "'speaker_3': 'Is not because the adjacent property owners are unwilling to legitimize their use is because they're unable to do so given the status quo. As a result of the current situation. Property tax revenues. Building permit fees. Code enforcement fines that otherwise would be imposed if this were property anywhere else in the city go uncollected and the blighting condition'",
        "'speaker_3': 'continues. Although it's taken us a long time to get to this point, the discussions have only recently started in earnest. And there is still a lot of due diligence that staff has to do before we be prepared to come before you with a recommendation.'",
        "'speaker_3': 'In a moment, Julian will outline the possible transfer scenarios that Steph has considered thus far. However, any discussion has to consider some basic considerations, and this proposed transaction immediately raises three issues. Worse, the city cannot provide a gift to public funds.'",
        "'speaker_3': 'This issue is not related to the initial transfer between the Army Corps and the city, as that transfer will be at no additional cost apart from the recorder and escrow fees. This issue relates to any subsequent transfers of the property from the city to third parties, like the adjacent registered residential owners and commercial property owners.'",
        "'speaker_3': 'Under California law, a public agency cannot authorize a gift of money or value to a private individual. However, public funds may be used for a public benefit. Even if it results in an incidental benefit to an individual. Thus, at a minimum, the subsequent purchasers of the property must pay the transaction cost and the transfer must result in'",
        "'speaker_3': 'a public benefit. The proposed transaction will not move forward until we are certain that it can be structured in such a way as to avoid any gift to public funds. Secondly, the city cannot take unnecessary environmental ownership liabilities.'",
        "'speaker_3': 'There is contamination in the northwest. There's contamination northwest of the fruit belt, the Fruitvale Bridge. We know that from studies, contaminants such as petroleum and toxic heavy metals were found in soil samples from multiple locations along the commercial and industrial shoreline in higher concentrations than screening levels for industrial land use.'",
        "'speaker_3': 'The City Attorney's office, outside counsel and staff will be looking at ways to minimize the city's exposure to these liabilities through waivers, indemnification, pollution, liability insurance and discussions with the appropriate environmental regulators up front. Thirdly, there's the issue.'",
        "'speaker_3': 'There's the public trust question. The Army Corps has asserted that the tidal canal is not and has never been in the public trust. This argument has a certain logic because the Army Corps dredged this canal from what had been dry land and it remained in federal ownership ever since.'",
        "'speaker_3': 'However, the city needs to do due diligence. We will also research any potential restrictions on subsequent transfers associated with this issue. That's a brief overview of where we are today. I now turn it over the presentation over to Ms..'",
        "'speaker_3': 'Blanchard to discuss the possible transfer options.'",
        "'speaker_0': 'Thank you, Mr. Penick, for that thorough presentation of the background and the history of the title canal. Good evening, Mayor Spencer, Vice Mayor, Motor City Council members and members of the public. My name is Jillian Blanchard. I am outside counsel, as Mr. Penick mentioned, with the Retter Law Group located here in Alameda.'",
        "'speaker_0': 'And I assist the city attorney's office on environmental and land use matters. And I have been tasked with the interesting assignment of trying to untie the Gordian knot that is, you know, Oakland, Inner Harbor, Tidal Canal. So our goal tonight is really to update council as well as the public on where we are at this point in'",
        "'speaker_0': 'our concept for a transfer. So this is our magic overview side of the current transfer concept. And as a backdrop, it's important to remember Mr. Penick mentioned this the fact that the Corps has repeatedly stated it will not transfer portions of the canal.'",
        "'speaker_0': 'Its goal is to transfer the entire title canal in one transaction. And so given the various issues at play and in consideration of the slightly differing set of concerns associated with different areas along the canal, at this point, we have proposed to split the parcels into three and still be three parcels that would all be transferred simultaneously'",
        "'speaker_0': 'from the core, but we would be disposed of in slightly different ways based on the needs of the public and relative constraints. So just as an overview, the three parcels are the orange, the residential parcel, and that includes a sliver of upland but mostly submerged land between, as Mr. Penick mentioned, the bulkhead line and we call the'",
        "'speaker_0': 'bulkhead line and the pier headline, which is the outer boundary essentially of the existing pier structures. This parcel we would propose at this point to transfer from the core and then immediately to the city and then immediately transfer from the city to the individual property owners along the canal of which there are approximately 90.'",
        "'speaker_0': 'And we'll get into additional details as we go through it. So it's late, so we'll try and keep it succinct. The second parcel is the commercial parcel that's in green, and again, it's just a sliver. It's approximately 35 feet wide on average.'",
        "'speaker_0': 'And it's between it's from Fruitvale Bridge just to in case that isn't clear, up to the northwest boundary of the tidal canal. And it would go from the bulkhead line to the pier headline. We would propose at this point to have this parcel transferred from the core to the city and then have the city hold the parcel'",
        "'speaker_0': 'pending further disposition. Again, we are looking at a variety of options as to what that would look like. But this is a an update on where we are in the process. The third parcel is the remaining piece, the open water parcel, and that's from the pier head line to what we call the 50 yard line set the'",
        "'speaker_0': 'center line of the canal. At this point, we're looking into options to transfer this parcel from the core, either directly to East Bay Regional Park District or to the city. And that will depend on upon further information that gets uncovered during the due diligence process.'",
        "'speaker_0': 'Okay. So here is just an overview side of the residential side where there are approximately 90 properties. The red line, of course, is the bulk headline. The blue line is the pure headline. It's approximately 35 feet on average.'",
        "'speaker_0': 'And as you can see, it includes mostly submerged lands, underlying existing docks. However, there are some there is some uplift. So let's get into the details here of where we are at this point. The residential parcel in our proposed transfer, as I mentioned, it would involve a simultaneous transfer from the core to the city and then to'",
        "'speaker_0': 'the individual property owners. In order to effect that type of a double simultaneous transfer. We would need to complete legal descriptions and all survey work on the 90 parcels in advance of any transfer from the core to the city.'",
        "'speaker_0': 'So effectively the proposal would be to have the city on the chain of title for this parcel for a conceptual nanosecond, effectively. And we've been working with representatives from the homeowners association. And we will continue need to continue working with all of the property owners within the residential parcel to confirm 100% participation in this deal.'",
        "'speaker_0': 'Staff would not come forward to the city and recommend moving forward with the transaction unless and until we had the assurances of all the residential parcels that they would be transferred. At this point, it is our understanding that there is a high level of interest among the property owners to participate in rectifying this ongoing issue.'",
        "'speaker_0': 'The question has been raised with respect to assessments and whether or not this transfer would trigger any tax reassessments under Proposition 13. I am not a tax attorney, nor do I pretend to be one, but I presume. And so just to be very clear, we are not providing any legal advice to the public on this issue.'",
        "'speaker_0': 'However, based on preliminary research and discussions, we anticipate that any reassessment would relate specifically to the sliver. At issue is this 35 or on average a foot wide piece and therefore would be minimal. Of course, we would encourage buyers, prospective buyers, to associated with the residential parcel, to do their own research, to figure out their own rights'",
        "'speaker_0': ', their own tax liabilities, etc.. Mr. Penick brought up a very, very important point, which is served essentially as our guidepost in this transaction, which is the very clear fact that the city cannot provide a gift to public funds in any way, shape or form.'",
        "'speaker_0': 'So the property owners have been made aware of this fact and they understand their need to pay their fair share in order to buy into this program to obtain their sliver, if you will. We have completed only back of the envelope calculations at this point to figure out what those costs look like associated with the transaction.'",
        "'speaker_0': 'But at this point, we anticipate that the property owners will need to pay between 5 to $10000 to be able to buy into the program, if you will. And in addition to that, they would need to accept all future maintenance and any obligations related to ownership.'",
        "'speaker_0': 'So just to be very clear, the transaction cannot take place if there is any sort of gift of public funds on the part of the city. So and there is also the question associated with that of what is the public benefit?'",
        "'speaker_0': 'And we want to make clear that at this point, the city is unable to enforce its building code requirements, its existing code requirements on that adjacent sliver along the canal. So completing this transfer and the reason that is, as Mr. Penick identified, is because of the cause permitting moratorium.'",
        "'speaker_0': 'Property owners simply can't get the authority necessary to do necessary upgrades to docks and existing structures. So completing the transfer would result in the court lifting the permitting moratorium and then would clear any current and existing cloud on title and allow the city then to enforce its necessary building code standards, including any necessary safety setbacks from the'",
        "'speaker_0': 'water and would certainly prevent any future unauthorized construction. Here's an overview of the commercial side. Again, we're talking about the red lines and the blue lines, the bulk headline, the big headline on average, a 35 foot sliver. There are approximately 14 properties and they include marinas, industrial uses, redevelopment sites, streets, etc..'",
        "'speaker_0': 'An overview of what we're looking at at this point for the concept of transfer. Again, it's a package deal from the core. So if you want to take the residential piece, you need to take the commercial piece, kind of figure out what that disposition looks like.'",
        "'speaker_0': 'As indicated previously, the court has refused to transfer it in pieces. So and as you could tell, as many of you are aware, there's been an existing industrial uses, I think back to World War Two or even before.'",
        "'speaker_0': 'So as you might imagine, and as Mr. Penick referenced, there are as a result of those industrial uses, there is contaminated sediment and soil within the commercial area. The Corps as part of their transfer process, has to complete a number of environmental reports in order to get to what's called a finding of suitability of transfer.'",
        "'speaker_0': 'And as part of that, they've completed a phase one and a Phase two environmental site assessments. And without going into too many details at this point, it's it's fair to say that the shoreline soil in the commercial piece is markedly more contaminated than the residential side.'",
        "'speaker_0': 'And they have identified soil at multiple locations on the residue on the commercial piece contaminated with petroleum toxic heavy metals in excess. As Mr. Penick mentioned, of regulatory benchmarks. So the reports that the Corps has provided at this point indicate that there is no imminent threat to human health or the environment.'",
        "'speaker_0': 'Owever, if there were any proposals to excavate through redevelopment, they would need to be remediated to acceptable screening levels. The Regional Board has been involved in the preparation of the Phase one and the Phase two reports and is currently reviewing the most updated version of the Phase two report.'",
        "'speaker_0': 'And the city myself in particular has been actively engaged with the Regional Board who by the way, has the exclusive jurisdiction with respect to contaminated sediment on the canal. So we've been actively engaged with them not only to determine the levels of contamination, the source of the contamination, which clearly is not from the city, and most importantly'",
        "'speaker_0': ', methods of limiting the city's liability if they were to be entering into the chain of title. Because another clear guidepost is that the city cannot accept any potential contamination liability associated with this transfer. It's complicated, as Mr. Phenix said.'",
        "'speaker_0': 'If it was easy, it would have been done already. So what we're doing now and will continue to do is research these avenues for limiting liability, which could include and likely would include negotiating leases with the existing commercial operators, which would include detailed indemnities, hold harmless agreements, very specific environmental restrictions with respect to excavation, etc., possible transfers'",
        "'speaker_0': 'to the developers directly, which is similar to what we're proposing on the residential parcel piece. And then prospective purchaser agreements with the Regional Board potentially or any other regulatory agency as necessary to limit the city's liability with respect to environmental cleanup.'",
        "'speaker_0': 'Again, we're in process of researching these avenues. So we would staff would come back to council once we've completed further due diligence with a much more specific path, an avenue, an approach to limiting the city's liability. At this point, we're just providing an update as to where we are.'",
        "'speaker_0': 'The public benefit again here would be code enforcement, which at this point the city is unable to enforce along that sliver to the extent it's applicable. In addition, we would note that there's potential lease revenue from the leases that we mentioned associated with commercial operators in the area.'",
        "'speaker_0': 'Moving right along. We have the open water parcel, which is the remaining open water piece from the pier head line out to the 50 yard line, as we call it. At this point, it's still open and we're in the process of due diligence.'",
        "'speaker_0': 'But at this point, what we'd be proposing is to have this parcel transfer directly from the core to East Bay Regional Park District. They have stated their clear intent and interest in taking the Oakland side for purposes of creating the Bay Trail.'",
        "'speaker_0': 'And so it would be a natural extension to have East Bay Regional Park District take the rest of that open water piece. That said, of course, we need to complete additional due diligence and make sure and in particular the public trust issues to the extent there are any and make sure and we confirm the most prudent and'",
        "'speaker_0': 'beneficial course. It could be that it makes more sense for the city to take that piece and we will come back to council with progress on our discussions with East Bay Regional Park District as well as our further research on the issue.'",
        "'speaker_0': 'So as we've said a couple of times now, it's not easy. It's not clear. It's it's complicated. It's not a simple transaction. There are many constraints. There's a variety of moving parts that all need to hang together to complete this process.'",
        "'speaker_0': 'And many have immediately dismissed this as out of hand is saying it's too difficult. It's too complicated. And as a result, the properties along the canal have suffered. There is now blight along the canal. There are dilapidated docks and adjacent property owners really have no legal path to being able to improve their property.'",
        "'speaker_0': 'Unfortunately, the problem won't go away. It continues to rear its ugly head and it gets uglier with the more and more dilapidated dock situation. So if we cannot reach a resolution at this point or at some point property owners and realtors, I certainly would continue to lobby the city on this issue.'",
        "'speaker_0': 'We anticipate the Corps would continue its permitting moratorium, which would, of course, prevent the city from being able to prevent to enforce its building codes, to allow necessary upgrades to improve the waterfront as a whole. Docks and other structures may fall continue to fall into disrepair, and there's potentially continued unauthorized construction.'",
        "'speaker_0': 'So I guess. It's taken. I guess the last thing I would just impart to the public and and the council is that there's more work to do. It's taken many months to get to this point, just to have our concept of what the transfer strategy looks like.'",
        "'speaker_0': 'And we would propose to come back to city council once we have a lot more information, have completed our due diligence and really reach out more directly and effectively to the property owners, including the commercial operators, with a more detailed plan and a potential path to creating what could be a legacy along the waterfront and resolving the'",
        "'speaker_0': 'issue for generations to come. So with that, I would turn it over to back to Mr. Penick for details on next steps of long term and short term. Thank you for your time.'",
        "'speaker_2': 'But just before he goes.'",
        "'speaker_5': 'Well, Miss Blanchard, I think we have a question for you.'",
        "'speaker_0': 'Vice Mayor, he's going to ask a question real quick.'",
        "'speaker_2': 'In this transfer scenario, who is responsible for dredging?'",
        "'speaker_0': 'It's an excellent question and it depend. The answer depends on where you're talking about with respect to the navigation navigational channel, the federal navigational channel, which is effectively the open water piece. The Corps of Engineers would maintain its obligation of navigational servitude to dredge that channel for maintenance purposes.'",
        "'speaker_0': 'The good news is that it was created to be a tidal canal and it works. So there's effectively a lot of scour along that canal. And to our knowledge, to my knowledge, the Corps has not had to do very much if any maintenance dredging the side pieces would be any maintenance.'",
        "'speaker_0': 'Dredging attached to the residential side would be transferred to the individual property owners.'",
        "'speaker_5': 'But that's a really basic threshold question. And by the way, I just want to compliment you, Ms.. Blanchard and Mr. Pennetta on it. I think it's a fascinating report. I know the property owners would probably use a different word than fascinating, but you could take material that some might consider dry.'",
        "'speaker_5': 'Well, I know we're talking about water, but and make it and really make it fascinating. So thank you for that. When I was reading the report, I saw that in 1882, maybe this was dredged to create a tidal canal.'",
        "'speaker_5': 'Why? Why do you need a title?'",
        "'speaker_0': 'I ask the same question. Okay. If it was some sort of disease, mosquito borne disease that was festering in Lake Merritt, as I understand it. And so by scouring the tidal canal, it created the tidal action that affected Lake Merritt as well and alleviated the problem.'",
        "'speaker_5': 'Is Oakland owes anything for that.'",
        "'speaker_0': 'Member de Saag Thank you.'",
        "'speaker_3': 'Just a quick question on the transfer of the ball transferring, triggering the Prop 13 reassessment, will we have language that clearly says that this is a possibility and whatever agreement we strike with whomever, as we at the end of the day know if people are going to shell out 5 to $10000.'",
        "'speaker_3': 'We also don't want them to say, but I didn't I didn't realize that, you know, so this is a risk. And and if everyone is willing to bear that and recognize that on eyes wide open basis, and that's important to specify.'",
        "'speaker_0': 'Absolutely, I would agree. Councilmember de and we intend to have a number of disclosures attached to whatever transfer documents we provide to the property owners, and we'll engage in additional conversations with the assessor on that issue. Member. Brody.'",
        "'speaker_6': 'Quick question. Thank you also for the very detailed presentation, this Prop 13 thing. That's the thing that concerns me, too. So are we looking at. The sliver would be its own parcel. Yes.'",
        "'speaker_0': 'Yes, yes, yes. That's what the legal description would be for each of these property owners was would be a sliver. The sliver. And that's what they would be effectively purchasing for purposes of a Prop 13 reassessment. But again, we're not making we're not providing legal advice here.'",
        "'speaker_0': 'That is our current estimate of for.'",
        "'speaker_6': 'Which they end up with the two parcels be combined, or would they remain separate parcels? And if they're separate parcels, you know, we have various parcel taxes.'",
        "'speaker_0': 'I think that that's an excellent question. And I think that requires further research to determine what each individual property owner might do. And maybe it's a question for the property owners as well as in terms of what their next steps might be.'",
        "'speaker_0': 'Okay. Thank you. Member de SAC.'",
        "'speaker_3': 'Yes, thank you. Just a follow up question, and I want to be clear about the transfer of the property. So there are three elements to the transfer the residential, the commercial and the in the open water. Aren't those focusing on any on either of them?'",
        "'speaker_3': 'Well, let's focus on the residential when when and if the Army Corps of Engineers transfers the residential to us. Are we then automatically transferring it through the to the residence, though, so that we're not. We might get title to the property on a moment from the Army Corps of Engineers.'",
        "'speaker_3': 'Then suddenly we own it. That that's not going to happen, right?'",
        "'speaker_0': 'Right. That is part of our that is a huge part of our due diligence process is absolutely ensuring that everything is in place and teed up such that the transfer would go immediately from the core to the city to the property owners.'",
        "'speaker_0': 'The way worda is drafted, it's it's required to go effectively through the city. And so that's why the city is is in the process in the center of this process. But yes, absolutely. Councilmember Desai That would be a huge part of making sure everything is teed up before we take anything for.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Mayor Brody.'",
        "'speaker_6': 'Is there going to be a transfer tax on that for people or.'",
        "'speaker_0': 'A transfer taxes for tech? I wouldn't pretend to answer that question for I'm not I'm not certain, but we could certainly research that piece for you. And in regards to the open water parcel, it sounds like it may or may not go to East Bay Regional Park District and if the city keeps it, then my concerns would'",
        "'speaker_0': 'go to. I'd want to know the liabilities dredging, maintenance, environmental cleanup, maintenance of Fruitvale Railroad Bridge and any any potential loss that you would anticipate. Right. Thank you. Mayor Spencer. I think that's an important point. And at this point, we are proposing to have it go directly to East Bay Regional Park District.'",
        "'speaker_0': 'But to the extent that with respect to public trust issues, there is a need for the city to take it. We would do extensive research on that, on the issues of potential liability. I would add, though, that that with respect to any maintenance dredging, that certainly would stay with the Corps.'",
        "'speaker_0': 'And the other piece that we have at this point negotiated with the Corps is removing the Fruitvale Rail Bridge from the question of this transaction. So the city would not be taking the Fruitvale Rail Bridge. As we understand, that's raised concern and questions in the past.'",
        "'speaker_0': 'All right. I just want to reinforce, because I know there was some questions in some of the blogs and things. The idea is in the open water, the corps would retain dredging responsibility, not the city. Whether the city owned it or the East Bay Park District owned it.'",
        "'speaker_0': 'The Corps would retain dredging, and I would I would second the city attorney's sentiment, which is that the Corps is actually unable to transfer that dredging responsibility. They maintain the obligations of navigational servitude, so they cannot transfer that obligation.'",
        "'speaker_0': 'Thank you for clarifying that. Any other council comments at this point? Did you want to finish up this report? And we have 18 speakers, by the way.'",
        "'speaker_3': 'Thank you, Madam Mayor. In. Given the lateness of the hour, we're just going to conclude with our next steps, which is basically to move forward with the direction that the council has already given us in closed session, and that is to continue to negotiate with the Army Corps of Engineers regarding the possible transfer to reach out to'",
        "'speaker_3': 'our partners in the East Bay Regional Parks with regard to those transactions, as we've just previously discussed. We are also going to begin actively engaging the residents and the commercial property owners with regards to their interest in the subsequent transfer process.'",
        "'speaker_3': 'And of course, we will continue to update both the council and the public periodically on the citizen negotiations. So with that, I will conclude the presentation and we stand ready to answer your questions to the best of our ability, if and when you have them.'",
        "'speaker_0': 'At this point, I plan to call speakers. Thank you. Katie Braun, it appears you. You're going to see to your time or did you want to speak?'",
        "'speaker_1': 'I'm going to cede my time to Seth, who's the chairman of Wawa.'",
        "'speaker_0': 'And Seth, did you want to speak at the end where your slippers or did you. All right, Kurt Braun.'",
        "'speaker_7': 'Uh, Madam Mayor.'",
        "'speaker_4': 'Members.'",
        "'speaker_7': 'Managers. Staff.'",
        "'speaker_4': 'My name's Kurt Brown. I've been a resident of Alameda, actually. Native, uh, or close to 55 years now. And homeowner at three, three, six, five, four inside. And member of the Waterfront Homeowners Association. Katie and I moved to our present home at three, three, 654 inside in 1986.'",
        "'speaker_4': 'And we've seen numerous mayors and council members and managers come and go trying to tackle this issue. I've been attending council meetings and writing letters regarding this issue for almost 30 years now. And we'd like to offer some continuity to the current council and staff.'",
        "'speaker_4': 'Getting permits to repair decks, docks and other structures in our back yards from all the various agencies has always been a nightmare. And as the report said that since 2000, the Army has stopped issuing permits altogether. The city acknowledged the situation back in 1989 in a letter to waterfront homeowners.'",
        "'speaker_4': 'I've got some of this stuff here and and began a subdivision project with Kirkland engineering surveying the estuary and our backyards. That's. Mr. Kirkland's done a lot of work and I would say that survey, if you guys could dig it up, has a lot of the what we're going to need in the future to do the subdivision'",
        "'speaker_4': '. It's been the work's been a lot of it, in fact, I'd say mostly done already. The 26 years later, we're still discussing this transfer of land the army and the city don't want and the homeowners need title to in order to repair, get repair permits and clear title to their product and to sell their properties.'",
        "'speaker_4': 'In 1993, Mayor Withrow at a council meeting suggested the city could take title and then immediately convey parcels the adjacent land. I see this has been going on a long time. Still no action.'",
        "'speaker_7': '96 we got the Water Resources Development Act.'",
        "'speaker_4': 'Amended, allowing direct transfer from the army to the homeowners.'",
        "'speaker_7': 'That was a little bit. I have to take a little bit issue there. So paragraph three of that does allow direct.'",
        "'speaker_4': 'Transfer, but the Army doesn't want to do that. So we still don't have any action despite direct, quick claims to adjacent homeowners in the past. In fact, the back of our house was done in a quick clean but claim that they had no line line drawn around it there.'",
        "'speaker_4': 'So that was back in 1941. So it has happened in the past. But they don't they don't want to do it anymore. So we're back to finishing the Kirkland survey, the city taking title and transferring to the homeowners.'",
        "'speaker_4': 'So I urge you to finally move ahead with the transfer. And you're welcome to contact me for further information. I've got an extensive file on this subject, so hopefully I don't have to be here in another 30 years dealing with this.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. And next is Ron Valentine. So you're planning to cede your time to Seth also. Okay. Then I'm going to move on to end of our 11. And then it'll be Michael. Michael Gorman and then Michael Fisher.'",
        "'speaker_1': 'Well, I lost my stuff, so hopefully I can remember. Good evening, Mayor Spencer. Council staff. My name is. And Balaban. I'm a resident and also a local realtor here in Alameda. And first, I.'",
        "'speaker_0': 'Also would like to thank.'",
        "'speaker_1': 'The council for that great presentation. This is not an easy thing to grasp. I know having sat through many presentations on this subject over over the last. Ten years or so, I suppose. So I'm here just to also encourage staff and council to really, you know, continue moving forward on this.'",
        "'speaker_1': 'This is something that is very important for our community. As a realtor, I see it impacting people as they are trying to sell their properties or those who are trying to buy properties. When you have any kind of clout on title, it makes things quite difficult.'",
        "'speaker_1': 'And to be able to declare it, to be able to clear that it would be very beneficial also for existing homeowners has been said to not be able to repair structures that are on your property is troublesome not only in the fact that you clearly these are these are particularly in water areas.'",
        "'speaker_1': 'Safety factors are huge. You want to make sure that people using these structures are safe. And then also on a personal level as to the environment, what happens to these structures when they finally do get to the point that they break away or whatnot or create problems within our waterways and and I'm sure our wildlife as well'",
        "'speaker_1': '. So all of those things are quite important. I think.'",
        "'speaker_0': 'Most of the items are really.'",
        "'speaker_1': 'Well stated within the presentation. As far as you know, who takes on the.'",
        "'speaker_0': 'Cost of this. The homeowners have been notified. People are working.'",
        "'speaker_1': 'You certainly have many folks that want to see this happen.'",
        "'speaker_0': 'So I'm.'",
        "'speaker_1': 'Really just here to support and to encourage.'",
        "'speaker_0': 'The maybe.'",
        "'speaker_1': 'Final resolution of this, which would be really wonderful as it has been going on for some time. So thank you for your time and hopefully we'll get this done.'",
        "'speaker_0': 'And next up is former council member Michael Gorman.'",
        "'speaker_7': 'Good evening, Madam Mayor. Council members. I was privileged to sit up in that seat for several years back in the eighties. And I guess the first I'd like to say to you all is thank you very much for all you do for this city.'",
        "'speaker_7': 'I know what those 2:00 in the morning meetings were like over and over and over, and all the preparation is to go into it. We've been working on this for a long time. I'm a third generation resident and our family's been in the property on Fern side since 1950.'",
        "'speaker_7': 'I can allow your fears about the dredging, because since 1950 there's been no need to dredge. The water moves through there at such a rate that it just flushes it. And the mosquito deal as the original reason is a nice way to put it.'",
        "'speaker_7': 'I think it was really there was no sewage treatment back in the late 1800s and early 1900s. It all went into the estuary and there was nothing to flush that out. So the tidal canal was very effective around the time I was on the council in the eighties.'",
        "'speaker_7': 'Curt mentioned there was a survey done by Kirkland and this is a reduced copy of not only the survey, but a tentative map. The city filed a tentative map. It's in the file. Not sure where that office is right now, but I went and got these copies from it several years ago.'",
        "'speaker_7': 'The tentative map was never acted upon. So as he said, a lot of work had already been done on this. Even back in the eighties. Not too much happened over time. And then ten years ago in I think it was oh five, the Corps seemed to have a spurt of energy to do something about this.'",
        "'speaker_7': 'Hired Barbara Price at a meeting at Edison School with all of us homeowners. And we're going to transfer this property. That was February well, five. Here we are in 2015. And we the homeowners association and all of our.'",
        "'speaker_7': 'Neighbors along the street there really want to see this happen. So thank you for giving your staff direction to this point in time. And I hope they can keep keep it moving and we can get this resolved once and for all.'",
        "'speaker_0': 'Thank you and thank you for your service. Michael Fisher. And then Donna Fisher and then Troy Davis. Michael Fisher. Donna Fisher. Troy Davis. Hey. And Donna Rock that. Bauman. And Kevin Peterson. Good evening, Madam Mayor and council members.'",
        "'speaker_0': 'My name is Don Uruk. My husband Jim and I are waterfront homeowners who reside at 33274 inside Boulevard.'",
        "'speaker_1': 'And we are members of the Waterfront Homeowners Association.'",
        "'speaker_0': 'We moved to Alameda ten years ago, which means I guess we're newbies.'",
        "'speaker_1': 'Here or everybody else. And we moved.'",
        "'speaker_0': 'Here mainly because of the attraction of living on the water and living on an island. When we purchased our property, it was our understanding that the Army Corps of Engineers moratorium for new construction and maintenance or repair of our docks would be resolved shortly.'",
        "'speaker_1': 'I think our real estate.'",
        "'speaker_0': 'Agent told us within the next year. Now we're ten years from there and we're still unable to maintain our docks. With every big storm we see parts of dark structures around.'",
        "'speaker_1': 'Us falling.'",
        "'speaker_0': 'Into the estuary.'",
        "'speaker_1': 'We'll see a piling, you know, going by and we'll kind of look down there to see who.'",
        "'speaker_0': 'Lost part of the dock. The continuance of this moratorium when we're at a point where it can be stopped is counterintuitive.'",
        "'speaker_1': 'And the decision to support the transfer, in my opinion, as a no brainer.'",
        "'speaker_0': 'With the residential parcel, there's no cost to the city. All the transfer costs are going to be borne by the homeowners. The transfer promotes investment in the maintenance of our properties. The transfer protects the sensitive estuary environment. These are certainly public benefits.'",
        "'speaker_0': 'We're excited that this issue at long last has come before the city council and urge you to vote for the transfer of the residential parcel to the city from.'",
        "'speaker_1': 'The Corps and from the city to the waterfront. Homeowners. Thank you.'",
        "'speaker_0': 'You. Pop plowman.'",
        "'speaker_5': 'Left.'",
        "'speaker_0': 'And Kevin Peterson. And Ed Payne.'",
        "'speaker_2': 'Had asked when she left to give her time to Seth also. Better Mayor Council.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_4': 'Mm hmm.'",
        "'speaker_2': 'And staff, I want to thank you for your time here and listening to this situation. And Kevin Peterson, a little bit. Three, 3494 Insight. My wife and I bought the home almost two decades ago. And as they expressed some of the situation about the realtor, I mean, that hits home with us because our home built in 1920'",
        "'speaker_2': ', technically about a third or a quarter that is over that and is technically in the Army Corps of Engineers land. So trying to represent a property like that or US future, I mean, this is kind of a hang up for us.'",
        "'speaker_2': 'Our backyard is literally part of this Army Corps. I mean, if you could put yourself in our situation and somebody telling you you can't do anything to your backyard for 15 years or longer that this moratoriums been on, it's been difficult.'",
        "'speaker_2': 'So at these docks we've been breaking down, a number of these older ones were made of creosote or. Other more harmful ingredients to being part of the environment. This last December, literally three docks within view of my home took it because they had fallen into disrepair and weren't or unable to do any upgrades in regards to this'",
        "'speaker_2': 'property. Um. Mr. Russo, I.'",
        "'speaker_7': 'Watched your presentation on the budget.'",
        "'speaker_2': 'I just want to make a comment that this is.'",
        "'speaker_7': 'No cost to the city. This is an opportunity to us, partner.'",
        "'speaker_2': 'With and share this to make this.'",
        "'speaker_7': 'A palatable.'",
        "'speaker_2': 'Resolution for both the city and the homeowners. That it allows us to invest in our property, allows us to do the proper upkeep to prevent any further damage to our environment. It's something that needs to happen. And we encourage you to accept this report and work through the details.'",
        "'speaker_2': 'I know there's some details to work through, but I don't think they're that complicated. And I think we're prepared to work with you to come to a good resolution. So I know it's late and I won't take up any more time, but I thank you for your time and encourage you to move forward.'",
        "'speaker_0': 'Thank you. Ed Payne. Then Susan Fitzgerald and then George Fitzgerald.'",
        "'speaker_7': 'Thank you for the opportunity to come and express my opinion on this on this matter. Good to see Vice Mayor Matarese again up there on the. As part of the council anyway. Yeah, I'm part of the Waterfront Homeowners Association.'",
        "'speaker_7': 'I'm actually the vice chairman. I've lived on Marina Drive for 39 years, and I got I didn't realize when I bought my home what I was getting myself into. I have to tell you, to be honest with you, I just bought.'",
        "'speaker_8': 'It because.'",
        "'speaker_7': 'I had a boat and I wanted some place to park it. Well, the very next year, I really.'",
        "'speaker_8': 'I was told, hey.'",
        "'speaker_7': 'You need a permit to build this dock. And then I started getting into all of the headaches, all of the red tape, the bureaucracy. And I've been fighting with that for a years.'",
        "'speaker_8': 'I've been dealing with that for years.'",
        "'speaker_7': 'And I have found that there's many, many other people have also dealt with those same problems.'",
        "'speaker_8': 'Over the last.'",
        "'speaker_7': '39 years. I've gotten to know them, and this has been the first time that this has offered me some glimmer of hope that that all of the problems they've talked about were displayed up here in the slides and possibly be resolved now.'",
        "'speaker_7': 'And it's exciting to me to know that that all the things we have been dealing with as homeowners now can possibly be addressed. We can. I have seen docks. My neighbor's dock just deteriorated to the point where the whole wharf fell in the water.'",
        "'speaker_7': 'The whole floating dock just deteriorated. But and I've seen people, you know, what's happened is they couldn't get permits and stuff. They so what did they do? They they're building them in the middle of the night or on the weekends.'",
        "'speaker_7': 'And so all kinds of legal, illegal structures here is an opportunity to do something that we all benefit from. The city benefits from it, the homeowners benefit from it. I believe that there's tax revenues can can be generated from this Corps of Engineers gets it gets us out of their hair, you know, so everybody benefits from this'",
        "'speaker_7': '. I encourage you to move forward on this. This is something that has given me some sense of hope and to address the issues I've been dealing with for the last 39 years. So thank you.'",
        "'speaker_0': 'Susan Fitzgerald. George Fitzgerald of. That's all right. Winston. WESTERVELT And then Seth.'",
        "'speaker_5': '17.'",
        "'speaker_0': 'Winsome WESTERVELT. He's still here. W i n somi w e s trv vlt. All right. Looks like Seth is up. And I don't know if you're going to need all this time. One, two, three, or five, six, six people that have seated.'",
        "'speaker_0': 'So, I mean, including your own.'",
        "'speaker_8': 'And a mayor, vice mayor, council members and staff. Thank you so much for all of your time on this. I will not use all of the time ceded to me, but I think it's helpful to.'",
        "'speaker_7': 'Leave you with a couple of.'",
        "'speaker_8': 'Couple of thoughts on kind of.'",
        "'speaker_2': 'Who is this group has come in and spoken to.'",
        "'speaker_7': 'Unite. Who's this group that.'",
        "'speaker_8': 'That I'm representing here tonight? I'm the chair of the homeowner's association. And this is an organization that was started on a volunteer basis, unlike a lot of other homeowner's associations where you're just stuck as soon as you buy the property.'",
        "'speaker_8': 'This is actually a coming together of neighbors who actually all agreed on one really specific thing, which is that this situation needs to be resolved. But I think it's also really important for us to start out being really clear about something here.'",
        "'speaker_8': 'I think, you know, if you were to characterize us as a group, the first thing that you would want to say, we're incredibly grateful. I'm going to explain each one of these. We're also incredibly frustrated. But I start with the grateful because we know that we're in a special situation as well.'",
        "'speaker_8': 'We're asking for help. We are organized and we are a resource for the city to lean on to help make this go as smoothly as possible. And we're asking for speedy action as long as this is going on.'",
        "'speaker_8': 'It's time to bring it to a close. And we're actually at a point where that could really happen. And we're really heartened that this is being heard tonight, because, as Ed described, it feels like it's so close finally.'",
        "'speaker_8': 'I want to go back to each of these points very briefly on the grateful were incredibly grateful for all the work that the city has already done on this. The Corps is not here tonight because it's not really about the Corps, but they also have done a ton of work.'",
        "'speaker_8': 'But the city attorney's office especially has spent a lot of time unraveling the Gordian knot as well. And it makes all the difference. We have a really clear path to move forward on. We are admittedly frustrated, as you've heard from a lot of folks.'",
        "'speaker_8': 'This is just a really bizarre situation to be in, to have at one point been granted permission by the adjoining property owner, built structures, started using them, and then decades later, find ourselves in a position where we cannot maintain, cannot fix.'",
        "'speaker_8': 'And it's it's embarrassing, frankly. We recognize that a lot of people see us as they come across the high street and frail bridges, and we would like to take better care of our structures. We really care deeply about the estuary.'",
        "'speaker_8': 'Some of the people who came up to speak tonight have spent hundreds, maybe thousands of their own hours, both figuring this out and also figuring out ways to get funding to help remove sunken vessels and do other things to help protect the estuary.'",
        "'speaker_8': 'We think of us as the first line of defense really in a lot of ways. I want to emphasize again the gratefulness. We recognize that we're in a really lucky position. I think some people might throw stones at us as a group and say, you know what, a bunch of whiners, you know, here they are.'",
        "'speaker_8': 'They're so lucky to be on the water. We don't deny that. But we also paid for it. We bought them. And I think a lot of the concern that you heard about the property tax issue, we've spent time talking to the assessor's office.'",
        "'speaker_8': 'And what the assessor found back in the eighties when this was first considered, was that the value was already paid. The property owners actually thought they had use of this structure and paid full value. And now we're just trying to reconcile the legal property boundaries.'",
        "'speaker_8': 'But we are incredibly grateful. We recognize these are very special properties. We would like to maintain them so they they appear special to the outside world as well. We're frustrated because honestly, during this time, you know, people measure life by milestones.'",
        "'speaker_8': 'I have a son who wasn't born when this started and is now ten years old. And I'm not even the one who's who's endured the longest part of this. But when you think about it and this is sound a little bit ridiculous, but and maybe I'm playing the child card too much, but, you know, you think about'",
        "'speaker_8': 'it, that's ten years where I can't safely take him out onto that dock. Like the things fallen apart. And I just want to fix it. Not asking for something special. I just want to fix it. We've lost members during this time, frankly.'",
        "'speaker_8': 'I mean, it's very morbid, but like when ten years go by or 30 years go by, when an issue is at hand. People's lives go on. And so I know that it's easy to say, like, it was very complicated and maybe we don't tackle it, but, you know, it doesn't matter to us.'",
        "'speaker_8': 'That's why we're here tonight and we're asking for help. And I know that a lot of times the city is doing much bigger issues. But we're prepared to make it as painless a path as we possibly can. And that's why we're organized.'",
        "'speaker_8': 'So I ask that you lean on us for assistance during this process. And I ask that you move as quickly as you can. We are very close. The Corps has done what I believe is probably all the work that they're going to do on this.'",
        "'speaker_8': 'And at this point, they need a willing counterparty to bring this transaction to a close. And so the one thing I would ask is I know that oftentimes you want more time to study an issue, more time to ask the what ifs.'",
        "'speaker_8': 'But at some point for this issue that has been going on for 30 years, and so we're asking let's just get to a speedy resolution. We're not asking for it to be done the wrong way or sloppily. You know, anything worth doing should be done.'",
        "'speaker_8': 'Right. But it's time. So thank you very much.'",
        "'speaker_0': 'Thank you. And we have two more speakers, Adam Stone and then Paul Mabry. And here comes our closer. You want to speak? This is your last chance. Please turn your slip.'",
        "'speaker_7': 'Council. Mayor, thank you very much. My name is Paul Maybury and I'm probably the newest owner of the firm site Homeowner's Association. And I would like to add just a little twist to what Seth left you with, and that is I have a four month old, so I am in Seth's shoes ten years ago.'",
        "'speaker_7': 'And I really would like to have my both my sons I have a four year old and a four month old. I'd like to have both those boys grow up and fully enjoy the waterfront. I also in my day job, I'm a California licensed attorney and a professional and surveyor, and I am working on probably the largest'",
        "'speaker_7': 'redevelopment projects in the region on Treasure Island and Candlestick Point, Hunters Point Shipyard. And as you know, there's a lot of Navy owned properties there as well. So. Seth offered the homeowners association as as a resource you can lean on.'",
        "'speaker_7': 'And I would like to just kind of clarify that, that the homeowners association, by virtue of my particular skills, also has some very unique. Qualifications that have to do with this type of Navy transfer. The title issues, the land survey issues, writing legal descriptions, all of those things that will be the nitty gritty.'",
        "'speaker_7': 'We do have resources here that we would volunteer to provide to the city and help you out as much as we can. Thank you very much.'",
        "'speaker_0': 'Thank you. Council Commons member Ashcraft.'",
        "'speaker_5': 'Thank you, Mayor Spencer. And I want to thank all of the speakers, all the homeowners who spoke and property owners and the ones who just attended and the ones who couldn't stay this late. And I want to disclose at the outset that I outset that I did have a phone conversation this afternoon with Mr. Hamelin.'",
        "'speaker_5': 'And first of all, I don't think of you all as whiners at all. It's really rather horrifying to hear what you've gone through. It's it really is a catch 22. I do want to, you know, send a shout out to our city attorney's office because Janet Kern, her very capable staff, very capable outside counsel.'",
        "'speaker_5': 'Ms.. Blanchard, they tackled this. And I think we're going to be the counsel that's going to bring this to a resolution to I for one, I'm not speaking for my count, my colleagues, they'll speak for themselves. But I think we've had some really thorough presentations.'",
        "'speaker_5': 'I understand that there's still a few more details. This is no doubt complicated, but I don't think we need to study this to death. I think we need to move it forward and bring a resolution to you. So I really commend everybody who's working on this.'",
        "'speaker_5': 'And the other thing I would love to see are cohesive neighborhoods like yours. You make us a better city and you make it a very nice place to live in in your neighborhood because you were all and again, this wasn't mandated.'",
        "'speaker_5': 'You got yourselves together, which is just kind of a great example of volunteerism. You're volunteering. You all have your special skills. None of us has a lot of extra time, but you're willing to to step forward and help out your neighbors and yourselves.'",
        "'speaker_5': 'And so I, I think that we just want to see are the the attorneys and city staff who are working on this to continue to bring it back to us as soon as it's possibly ready. And and I do think this is the council that's going to put an end to the nightmare that you've endured.'",
        "'speaker_5': 'So hang in there just a little longer.'",
        "'speaker_0': 'Thank you, everybody.'",
        "'speaker_6': 'Thank you, Madam Mayor. I'll try to be brief. First, I want to thank the city attorney for prioritizing this. It's complicated, but there's really no action item. But I would say the action item for us, at least speaking for myself, is let's get this done.'",
        "'speaker_6': 'The one just just three brief points. And I don't think any of the residents here are asking for anything special. They're just asking for the benefit of the bargain when when they purchase their homes and they're asking their government to work for them.'",
        "'speaker_6': 'And that's our responsibility. And I think we need to do it.'",
        "'speaker_0': 'All right. Any other member comments? Vice Mayor.'",
        "'speaker_2': 'Two questions. Oh, when is our next step? What's the next milestone that we're going to be made aware of and enter the community? And second, um, I'm glad this is an open session. I think it's very important. Because we're dealing with another agency that's tax supported that we make sure the public knows what's going on as well'",
        "'speaker_2': '. And I'd also like to have them whatever follow up that you do is to consider either the pros and cons of the commercial portion of the transfer to go to the best for public the Tidelands Trust under the state and see if that option benefits the city or liability.'",
        "'speaker_5': 'All right. I just got a question and a question, Mr. Panic. I'd like you to ask. I think I heard either you or Ms.. Blanchard say that you can't move forward with this agreement until you have consensus of all of the property owners.'",
        "'speaker_5': 'And my question is, what if you have a holdout or a recalcitrant property owner, especially for the residential folks? What if you don't have 100% buy in? I think there's maybe some out of town owners that or others that just don't see the value of this I've heard.'",
        "'speaker_5': 'So how would you address that?'",
        "'speaker_3': 'Through the mayor again, Enrico Penick, assistant city attorney. If I may, I'd like to take councilmember as he asked Kraft's question first, because I think it's the easier of the two. The the current. Concept that we're working on here is if there had been any holdouts, the homeowners association would take title to that holdout property, and then'",
        "'speaker_3': 'it would be up to the homeowners association to work out any deals with the individual holdout members so the city staff would not be prepared to come to the council to recommend this transfer unless we had either 100% participation from the residents or assurances from the homeowners association that they would cover the cost of any holdout members'",
        "'speaker_3': '. Again, that's conceptual. We will have to get those assurances from the association. But you've heard from their representative and you can see that there is some strong. Interest on the part of the homeowners association. So we're confident that those details can be worked out.'",
        "'speaker_3': 'Two Mayor, two vice mayor matter raises questions. The next milestones from the city's perspective would be to start reaching out to the East Bay Regional Parks, to talk to them with regards to their issues. Also to steward working in earnest to do that survey and mapping work.'",
        "'speaker_3': 'Although there may have been some work that has been done in the past, just taking a survey down the canal. There are a lot of structures that sit offset from the main houses. So the the idea would be to draw a line from the adjacent property all the way down to the waterfront.'",
        "'speaker_3': 'In some cases, that may or may not be able to be done. You may have to that line may have to shift because of existing, existing structures. So I think one of our major task would be to do some survey work, get some preliminary mapping work, and then take that back to the homeowners and to resolve any'",
        "'speaker_3': 'conflicts between adjacent property owners on exactly where those lines might be drawn. Once we have that and we have an agreement in concept from the Army Corps, I think we'd be in a position to be able to come back to you to report some real progress.'",
        "'speaker_2': 'Approximate time.'",
        "'speaker_3': 'I wish I could give you a timeframe on when that could be accomplished. I would venture a guess that.'",
        "'speaker_0': 'Sure a member matter. One piece that we're we're up against is, of course, we're one party. We have to have the cause engagement on a very real level. And while they've have done some work, there is more work that they do need to do.'",
        "'speaker_0': 'So we're we're working with them. And I think with city council strong support in favor of moving forward, I think that will motivate the Corps to take more active action. So we are reliant on them as well as responses from the Regional Board on their review of existing environmental reports.'",
        "'speaker_0': 'So we will again push those resource agencies. They have tight staffing constraints, but we will push them and with a more clear green light, we would begin pushing even harder to try and get more immediate responses. And then, as I understand it, in regards to East Bay Parks, that's another part of you don't have a.'",
        "'speaker_1': 'Middle for.'",
        "'speaker_3': 'That. You're absolutely right, Madam Mayor. We we we we have to. We have yet to reach out to the East Bay regional parks. So we have no idea where they currently stand on their negotiations with the Army Corps and how prepared they are to move forward and how quickly.'",
        "'speaker_0': 'So one of my concerns then is to make sure that there's not any liabilities that the city would hold. And as it's approaching 1030, we actually have three items that are still pending 60, 60 and nine A and I would need a motion and approval by four to proceed past the.'",
        "'speaker_0': 'To take up these. We have a motion to move.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Any comment? All those in favor. Hi. A motion passed unanimously. Thank you.'",
        "'speaker_5': 'I think the city attorney want to weigh in on you.'",
        "'speaker_0': 'Yes. I was just going to suggest, Madam Mayor and council that it while it's true, we don't know exactly the timeline because we have other agencies. I think what we will do, though, is make a commitment to the council and to the folks who are here and listening, that we are going to continue to proceed with all'",
        "'speaker_0': 'deliberate speed. And we can make a promise to you that we can get some sort of report back to you. I would say three months. So the 1st of July. Is that adequate?'",
        "'speaker_2': 'Vice Mayor First of all, I thought I heard that you were looking for maybe I misunderstood a green light from the council or some song sentiment that you can take to the other agencies saying, We're gung ho on this, but even though this is not scheduled for action, we can all nod our head and give a sense'",
        "'speaker_2': 'that there's unanimous support to move this thing forward.'",
        "'speaker_0': 'So we can give direction.'",
        "'speaker_2': 'We give direction.'",
        "'speaker_0': 'So I'd like to hear from member so.'",
        "'speaker_3': 'I have a separate question altogether.'",
        "'speaker_2': 'So I just want I just wanted to check. Is that correct? She's not.'",
        "'speaker_0': 'Yes. You may do that.'",
        "'speaker_2': 'Into what I was.'",
        "'speaker_0': 'I remember day.'",
        "'speaker_3': 'Thank you. Two comments. First is on an overview comment. Several weeks ago the city council close the loop on a matter with regard to undergrounding of of. Lines, overhead lines coming up with a citywide strategy. And that was a matter that I dealt with in my first go around and.'",
        "'speaker_3': '11 years ago on 24. Sometimes the wheels of city hall runs very slow. All right, Councilmember Gorman, about that. This being 30 years or so. So hopefully we can get things going. I think the question that I have is I just want to make sure that technically and narrowly understood that we've exercised all our due diligence report'",
        "'speaker_3': 'gathering information. Or is there still outstanding work to be done? That's the that's the plan. If I could go back to to the vice minister. QUESTION We I think that three months, if that's acceptable, is a good timeframe.'",
        "'speaker_3': 'But we would also commit to coming back to you sooner if we have material progress report in the meanwhile.'",
        "'speaker_0': 'Thank you. Any other comments? So I want to thank staff residents for coming out here and I look forward to the updates. Thank you very much.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Six C presentation on the city's economic development programs and initiatives and status of the Economic Development Strategic Plan and recommendation to establish the Mayor's Economic Development Advisory Panel in lieu of re establishing an Economic Development Commission.'"
    ],
    "Economic Development Programs and Initiatives and Mayors Economic Development Advisory Panel.": [
        "'speaker_0': 'And we're going to take a few minutes here, but people are exiting the room. Well, we're going to take a short recess. Okay. There she is. All right, so now we're done.'",
        "'speaker_7': 'Okay, here we go.'",
        "'speaker_0': 'We are going to resume with six C. Everyone could please take your seats. We're about to resume. Appreciate it. Thank you, Miss Potter.'",
        "'speaker_1': 'Thank you. Good evening. I'm Debbie Potter. I'm the city's community development director. And the Community Development Department consists of three divisions building, planning and economic development. And we began an active rebuilding effort regarding our economic development division about 18 months ago.'",
        "'speaker_1': 'And key to that effort was hiring an economic development division manager to develop and guide programs and policies that focus on business attraction, expansion and retention efforts that grow our city's employment and tax bases. And we were very fortunate to hire Daryl Doan as the new economic development manager.'",
        "'speaker_1': 'And fittingly, today is Darrell's one year anniversary. He started with the city of Alameda on April 7th of 2014, and he's going to be presenting an overview of the economic development division, its work, its accomplishments and our proposed initiatives going forward.'",
        "'speaker_1': 'And this presentation is being presented in part to help inform the City Council's discussion of Vice Mayor Matt Orestes referral regarding reconstituting the Economic Development Commission and best practices for engaging the business community in our economic development initiatives.'",
        "'speaker_1': 'So with that brief introduction, I'd like to have Daryl come up and make his presentation about the Economic Development Division and its activities. Thank you.'",
        "'speaker_0': 'Thank you. You're done. I. Happy anniversary.'",
        "'speaker_2': 'Thank you. But good evening, Madam Mayor.'",
        "'speaker_8': 'And members of the Council. I feel somewhat special because I got my own little action.'",
        "'speaker_4': 'So.'",
        "'speaker_8': 'As Debbie said, yes, it's my one year anniversary. And that's completely coincidence. Honestly is. But. So let me start this way. So, as Debbie said, I oversee the city's economic development division. We were in the process of preparing a sort of overview, high level presentation for you, owing to the fact that you were a new council and'",
        "'speaker_8': 'I'm a new employee and it's a new division. And so we thought it was probably time to check in. And then in the midst of doing that and working to get that agenda rise, which took a little longer than we thought, there was a council referral on reestablishing the Economic Development Commission at the March 17th Council meeting'",
        "'speaker_8': ', Council was reminded that we would be bringing forward a presentation and then specifically asked that we bring back two additional items as part of that presentation. One was an update on where we stand with the city's economic development strategy document.'",
        "'speaker_8': 'And two was a recommendation from staff as to what we how we think, whether or not the EDC should be reached out. So that's what we're doing today. So I'm going to go quickly through a PowerPoint presentation. I have no idea what I'm supposed to do with area right and left.'",
        "'speaker_8': 'Okay, I got it. I'm going to go quickly through this PowerPoint presentation and cover the sort of high level overview of how we spend our day in our newish economic development division. I want to point out, however, that this is this is what's the slides that you will see in the public will see are not an adopted'",
        "'speaker_8': 'strategy at all. It is simply our work program that we are implementing at the staff level and it is different than the actually adopted economic development strategy. I didn't want there to be any confusion over that. So economic development in Alameda one year in.'",
        "'speaker_8': 'We have a mission. And our mission is and this is a this is a mission statement for convenience. But it's our sort of guiding principle. Our mission is is quite simple. It's to grow the city's tax and employment bases through the diligent pursuit of business retention, expansion and attraction projects.'",
        "'speaker_8': 'In that order, I would add related real property development because most businesses need a roof over their head to be successful and workforce development. So those are our three sort of focus areas. Actually, we have seven focus areas as the slide shows.'",
        "'speaker_8': 'So we organize those three goals more properly called around seven strategic focus areas. And they are, as you can see, they're marketing cluster and sector development, commercial development, retail and small business development, workforce development, external relations and then data and benchmarking.'",
        "'speaker_8': 'And there's no magic to these. It's how many cities organize the fourth city. I've worked for doing economic development. It's just sort of how economic development is organized in these sort of focus areas. Some cities have different ones, they have more, they have less.'",
        "'speaker_8': 'But but these are what I think are appropriate for where we are with Alameda right now. So I'm going to run through these really quickly and just touch on them in a little bit of detail. So one is marketing any city that is doing quality economic development needs to needs to build a brand and a compelling story'",
        "'speaker_8': 'around what are its business fundamentals. Then you need to go spread that brand around city, region to state and nationally to an extent that you can. And so that's what we're doing. And how do we do that? We do that in a number of ways.'",
        "'speaker_8': 'We do it through traditional and web based advertising quality collateral materials. The printed word is still important robust web and social media presence, attendance at regional and national trade and industry associations. All of those are avenues by which we do this.'",
        "'speaker_8': 'What you see on the screen there is just. Very simple advertising. We do more sophisticated advertising, but these are just very simple advertising showing our primary advantage, which is frankly locational. So number two. Cluster and sector development. So the way to think about a local economy is to divide it into sectors.'",
        "'speaker_8': 'Right. So we're talking broad categories, nonprofit businesses, biotech, high tech, maritime industry. In the case of Alameda, there are ten or so that we have identified. And a year into this process now that we think are either thriving and successful might be showing some weakness and we need to preserve them or our areas that we can grow'",
        "'speaker_8': '. And that's kind of how you do it. You identify the weak sectors. You make a qualitative and quantitative decision about whether that sector is still viable. And you identify the strong ones and you try to grow them and you try to tailor programs and incentives around those sectors.'",
        "'speaker_8': 'So that's cluster. Cluster and sector gets confused. Sector is a group of like type of businesses. Cluster is a group of businesses in one geographic location such as Spirits. Alley is a cluster. Maritime is a sector sometimes a sector is a cluster, but not all.'",
        "'speaker_8': 'So number three, commercial development. So I'll get to retail in a minute and that's critical. But commercial development basically means any commercial activity that is not retail. So we're talking office industrial, advanced manufacturing, high tech, some of the sectors I just identified.'",
        "'speaker_8': 'The great thing about Alameda is that it's an island. It's also one of our weaknesses from an economic perspective, but it's also a strength in that we have a very confined geographic area and it's easy to manage conceptually.'",
        "'speaker_8': 'Where are our businesses from a commercial standpoint? Are businesses are primarily in two areas. They're in two business parks, which you're aware of Harbor Bay, Business Park and Marina Village Business Park, the opportunity and there's some in the neighborhoods and some on Park and Webster, you know, in the form of like above retail, small lawyers and dentists'",
        "'speaker_8': 'and things like that, and in some cases on the first floor. But the business parks are primarily commercial opportunities of existing real estate. We have new opportunities, which are primarily Alameda Point and Alameda Landing Phase two and maybe a few infill sites.'",
        "'speaker_8': 'So we're an island. We have limited real estate opportunities. We've got to make the most of those. When we're looking at commercial development and, you know, we're in the process of doing it. So how do we do that?'",
        "'speaker_8': 'We coordinate with brokers, owners and tenants and our business associations to do business recruitment and facilitate expansion. I touched on retention, retention, expansion and recruitment, and I said, that's the proper order. And what I mean by that is and it's germane to commercial development, is that a city, a city always needs to be recruiting, but anybody in'",
        "'speaker_8': 'sales will tell you, don't lose your existing customer base while you're, you know, while you're in the process of focusing on drawing in new customers. So the simplest thing that a city like Alameda can do is make sure that our existing commercial and retail businesses are being taken care of.'",
        "'speaker_8': 'Right, that they are thriving, that their needs are being met, that when they call City Hall, somebody answers the phone when the trash can in front of the barbershop is overflowing. We take that call and we act as an ombudsman and we get that problem resolved all the way up to a large user employing six or 700'",
        "'speaker_8': 'people who may have a lease coming up and they may be thinking of leaving. We build strong relationships. We'll know that. They'll tell us that. And we can act to forestall, you know, any kind of a relocation threat.'",
        "'speaker_8': 'The goal is to do retention so that you never have to deal with a relocation threat. We'll always meet that goal, but that is the goal. And then, of course, you know, recruitment, we all know what that is.'",
        "'speaker_8': 'Recruitment. It's we go out and spread that gospel and work with these owners, brokers and tenants to bring in businesses that have high value in terms of employment and growing our tax base. Paying, paying taxes. Number four, retail and small business development.'",
        "'speaker_8': 'So we separate. This is part of commercial, but we separated it out because I find in talking to community members and even some council members that when people think of what is economic development, they think of this, they think of Main Street and they think of shopping centers.'",
        "'speaker_8': 'That is an important part of economic development, but it is one of many sectors. It is one of those ten sectors. That's how I look at it. It is arguably, though, from a tax perspective, the most critical sector, because unless the numbers have changed, I'm not aware of it.'",
        "'speaker_8': 'Sales tax is our fourth largest source of general fund revenues. For many cities, it is their first source of general fund revenue that is driven largely by the large ticket items. Cities are size that have automobiles. They have, you know, 110,000 plus square foot, big box type of retailers.'",
        "'speaker_8': 'They have high value ticket sales in things like electronics, appliances and furniture. We that's where we fall. That's where we are weak is in those sort of high ticket sales. Where we are strong is on great. You know, we have two great, very successful sort of main street level commercial districts with great business owners.'",
        "'speaker_8': 'And in the aggregate, you know, individually, the ice cream shop doesn't generate a whole lot of sales tax, but in the aggregate, they generate a lot of sales tax, especially when you think of our main street districts have shopping centers in and of themselves.'",
        "'speaker_8': 'That's really what they are. Again, we're an island, limited geography. We know exactly where our retail is. It's in it's in eight or so shopping centers and it's in two commercial districts. And we know where it can go.'",
        "'speaker_8': 'It can go to Alameda Point, it can go to Alameda planning phase two and a few other areas. Five workforce development. What is it? So basically, you know, a city like Alameda has a jobs housing imbalance, right? We need additional jobs at density.'",
        "'speaker_8': 'And so that's why when we're focusing on commercial development, we're focusing on taxes. Yes. But arguably, more importantly, generating jobs in good paying jobs, because if we're going to solve that jobs, housing imbalance and the attendant traffic issues that come with it, in my opinion, the answer is not no more growth.'",
        "'speaker_8': 'It's about bringing in growth that generates the kinds of jobs that will allow people who are currently commuting off the island to quit their job in Walnut Creek or Oakland or San Francisco because there's a there's a there's a good replacement job here.'",
        "'speaker_8': 'So I am very focused on not just jobs, but quality jobs. And you need jobs all across the spectrum. You need service jobs. Because for some people, that's their job. But we need we've got a lot of that.'",
        "'speaker_8': 'We need higher quality, better paying jobs in a range of industries. And that's the focus. When we when we have companies that are already here, though, they have they have workforce needs. They need to hire new people because they're scaling up their production.'",
        "'speaker_8': 'They need to hire 150 people in a short amount of time. We help with that. We build through our relationships. We know about those scale up opportunities or new companies that have come to the island to lost some of their workforce because of relocation and need to hire up.'",
        "'speaker_8': 'We can't control where those companies choose to draw from, but we can work with them to make sure to the to the greatest extent possible. Those new hires are Alameda residents. I don't care about people outside of Alameda coming to work for Alameda companies.'",
        "'speaker_8': 'Well, I do in the sense that they need to have employees to be successful. What I really care about making sure that Alameda residents get hired for those jobs, and that's critical. And we do that by assisting those employers.'",
        "'speaker_8': 'We assist employers and we assist employees. We have programs for both. We want to help Alameda residents find jobs with our employers. We want to help those employers hire Alameda residents. We host job fairs, we partner with workforce development agencies, etc., etc..'",
        "'speaker_8': 'And that's how we do that. Number six is external relations. This is real simple. We we are out there. We are out there regionally. We are out there locally and we are out there statewide. I go to conferences, I go to trade shows, will be doing even more of that.'",
        "'speaker_8': 'You know, some sometimes the public scoffs at that. Why are these bureaucrats going to these fancy trade shows in Las Vegas? It's not because we're partying. We need to be there. We need to have a presence. That's how we grow our brand.'",
        "'speaker_8': 'Number seven and finally is data and benchmarking. I'm a big believer in this and we've spent a lot of time over my first 12 months here trying to get a handle on, you know, economics, by definition is about numbers.'",
        "'speaker_8': 'We need to know our numbers. We need good quantitative data so we can make good qualitative decisions. We've been looking at all of this. Some of that groundwork was already laid before I got here. I'm trying to take it to the next level.'",
        "'speaker_8': 'Actually, in your consent agenda tonight, you approved a contract whereby we'll be buying employment data from the State Department of Employment Development. Seems like a simple thing, but when I got here, we didn't really know who are top employers are.'",
        "'speaker_8': 'We knew anecdotally, but we didn't have the hard numbers and we need hard numbers. So we'll be doing more of that and you'll see more things coming to you where we're going to, you know, frankly have to buy third party data.'",
        "'speaker_8': 'Some of it we gather ourselves and some of it is original work. So those are our seven strategic focus areas. So just quickly, key programs and initiatives, this is not everything, but I just wanted to get you a sense of some of the things that we do in our programs.'",
        "'speaker_8': 'We run a formal business visitation program. We target the top 75 aggregate tax generating and largest employee businesses because with limited resources, those are the companies that we need to make sure first and foremost to be taken care of.'",
        "'speaker_8': 'It's those who employ the most people and generate the most revenue. So we have Alameda Service, which is our new permit expediting program, which has been extremely successful. There have only been one or two issues that we haven't been able to resolve.'",
        "'speaker_8': 'And this this has allowed us to move. We've never had a higher volume of permit or planning applications. And conversely, they never move faster than they are right now. And that's a testament to the building planning and my division.'",
        "'speaker_8': 'We are absolutely committed to improving our reputation, real or perceived. On that point. We have a new business welcome program where the mayor sends out a letter to anybody who pulls a business license, whether you physically locate in Alameda or just doing business here.'",
        "'speaker_8': 'We've started business meet and greets and some of you participated in that. And I appreciate that. We have a we have a burgeoning, I would call it Startup Assistance Program, where we work with prospective new small business owners to start their business.'",
        "'speaker_8': 'It's not yet an area of expertize for us, but we're going to grow that. We're partnering with the Small Business Development Center, who's been very helpful with us on that. I talked about workforce development. We actually have a on May 7th, we are hosting in partnership with Alameda Unified School District at Encino High School.'",
        "'speaker_8': 'We are hosting a youth job fair. That's an example of something that we do. There'll be more information about that coming around. But, you know, it's an internship program for high school students to find jobs if they maybe aren't on a college track and they need a skill when they graduate.'",
        "'speaker_8': 'So just an example. We have an annual broker event that we've done two years in a row. We have another one coming up right also on May seven. And you all will be getting invitations for that tomorrow. We have a print advertising program.'",
        "'speaker_8': 'We publish a monthly business newsletter. It's actually ten times a year where we try to sort of get the word out about all of the good, positive things you all should be receiving that.'",
        "'speaker_2': 'Um.'",
        "'speaker_8': 'And we will be continuing that program. We have a burgeoning social media program. We are tweeting. We are on LinkedIn. You know, you have to be doing that. It's not yet eclipsed the Internet as the primary source of information, but it probably will soon.'",
        "'speaker_8': 'We have an Alameda Island shopper campaign, which is one of our small business programs where we you know, we essentially guilt trip residents into shopping locally as opposed to taking that money out of town. We'd like to move that from a guilt trip to a real incentive, and we'll be working on that.'",
        "'speaker_8': 'Your trip is a good thing sometimes, right? Why should residents take their money to other communities when they can spend it here and keep their dollars right here in this community? And then as you voted on tonight, we manage the city's two business improvement areas in partnership with our Business Improvement Association.'",
        "'speaker_8': 'Quickly. 20 1415 Key accomplishments. So we created the division. That's a big step forward. We hired a division manager. That's a big step forward. We are still transitioning from doing economic development through redevelopment. To doing traditional economic development activities in the absence of that funding source.'",
        "'speaker_8': 'That is a tricky transition. Many cities in the state are going through that. We are no different. We don't have that pot of money anymore. So we have to rely on other things like our charm, like our guile, like our willingness to pick up the phone and our tenaciousness when we are going after businesses.'",
        "'speaker_8': 'We have engaged the business community. I don't know if this is a high number or a low number. I think it's high approximately well, exactly 289 separate times through March 30th. Those are distinct meetings with businesses might be the same business multiple times.'",
        "'speaker_8': 'If you drilled down two distinct businesses, it's probably half that number. But that's a pretty tremendous outfit. Mind you, the economic development division has two and a half FTE. There's a couple other people like our base reuse department and our leasing team that dabble in economic development.'",
        "'speaker_8': 'But only two and a half of us that are doing this on a full time basis. We've met with almost 300 businesses in the last calendar year. We've we've had a number of attraction successes. We've have a number of expansion successes.'",
        "'speaker_8': 'We've placed 21 separate advertisements in local, regional and national publications. We've done that brokers event two times. We're doing it a third. We've gone to ICAC in Las Vegas, San Diego and Monterey. We had three very you know, we had three East Bay EDA Innovation Award finalist and two winners and nobody else had that.'",
        "'speaker_8': 'And we were named by Sunset Magazine or Sunset magazines as a finalist or Best Municipal Makeover, which is, you know, great.'",
        "'speaker_0': 'And before we continue, I made a motion to continue past 11.'",
        "'speaker_5': 'So moved.'",
        "'speaker_0': 'Have a second. And we need at least three votes to continue. All those in favor by passes unanimously. Thank you.'",
        "'speaker_8': 'I'm actually almost done, so bear with me future programs and initiatives that you will see coming through our budget process or through the budget process. We're going to talk about this in a minute. The mayor and cities the mayor and I've added and city council's economic development advisory panel.'",
        "'speaker_8': 'We're going to be reinstituting the facade improvement grant program contingent upon your approval of our budget request. We are starting what we call sector focus groups and we have the first one with the maritime sector coming up on April 30th where we will sit down and have a one on one with the leaders of that sector to'",
        "'speaker_8': 'get their perspective and understand how the city can help them succeed. We are going to be redesigning our business website and creating micro breakout sites for both commercial recruitment and local shopping, something that doesn't exist right now. We're going to be instituting a formal commercial recruitment marketing campaign, and we're going to we're going to do a better'",
        "'speaker_8': 'job of reporting back to the council through a series of quarterly reports, which I think will be helpful for you and it will be helpful to the public. Okay. So let's get to the councilmember referral. So just quickly, the two things that we were asked to cover were strategic plan and reestablishing the economic development.'",
        "'speaker_8': 'So we have a strategic plan. It was adopted by council in July of 2000. The former economic commission actually instituted a review of that plan in 2005. And I know some of you sat on that and went through that process.'",
        "'speaker_8': 'The EDC did that by establishing a subcommittee to guide that review process with extensive community engagement. The revised plan was adopted by Council in 2008. We are putting a budget request through the budget process in front of you for monies to update that again, because it's time we've come out of the dark winter of the Great Recession'",
        "'speaker_8': 'and we're booming and we need to redo that plan and make sure it's keeping up with market realities. So we would hope to have that funding and be able to go through that process with you again, because it is definitely coming this quickly.'",
        "'speaker_8': 'The 2008 plan has these seven broad strategy imperatives in it. Some of these are still relevant. Some of these perhaps are less relevant. We need to go through that process of updating what these strategies are and of course, their implementation their implementation steps associated with all seven of these.'",
        "'speaker_8': 'But I didn't list them here. So that's the current status of the 2008 Economic Development Strategic Plan. We hope to start that update process in the new fiscal year and call it very soon the 2000 1516 ish feature plan as to the Economic Development Commission.'",
        "'speaker_8': 'So some of you have the history of this and I wasn't here. So I'm working from the record from from our files and sort of recreating what this has been and where it came from. But it was created in 1990, if I've got my date right.'",
        "'speaker_8': 'Around in 2012, the membership was reduced from nine members to seven members. I don't presume to understand why specifically, but more importantly, in October of 2013 at Stat's recommendation, the Council at that time disbanded the Economic Development Commission.'",
        "'speaker_8': 'Not because we didn't think that they were useful or had been doing their job, but because the agenda had been dwindling. Redevelopment was disbanded itself, and much of what I'm told, much of what the commission was doing was considering disposition of development agreements, owner participation agreements and A's that were tied to redevelopment as a funding source.'",
        "'speaker_8': 'Among other things, some policy activities such as the aforementioned strategic plan. And so staff recommended that we disband that program 19 months ago, or that commission 19 months ago. And in its place, we asked council to adopt these three objective driven.'",
        "'speaker_8': 'That's what they were called objective driven policies that would take the place of that EDC. And they were the use of ad hoc committees and tax task forces. We had been doing that prior to that October 2013 disbanding action and we will be doing it going forward.'",
        "'speaker_8': 'I think I've been told that the two best examples were an America's Cup ad hoc subcommittee and a fiscal sustainability committee that went back to 2008. I could envision the Council using that ad hoc committee process to guide staff in updating the Economic Development Strategic Plan.'",
        "'speaker_8': 'And in fact, when we come back to you with a formal recommendation, that's probably what we would recommend. As the vehicle to do that. Number two is is just enhanced coordination and information, information sharing among businesses and associations.'",
        "'speaker_8': 'This is ongoing. We have really picked up our game in that since I came on board. And that sounds self-serving, but it's not. I mean, we have to be engaged with our chamber, our three business associations, owners, brokers, tenants.'",
        "'speaker_8': 'We have to have our ear to the ground to get good information. And we've been doing that. And some of those partners are here tonight, and I think they would attest to that. And it's been very successful. Debbie sits on the board of the chamber.'",
        "'speaker_8': 'I sit on one of their committees. We're very engaged with Waba and Pizzi, and GABA is going through its own resurgence and growth phase. And we've been very supportive that in fact I just presented to ABA last week at one of their monthly mixers.'",
        "'speaker_8': 'Number three on that list was create something called a Mayor's Economic Development Advisory Panel. So I want to touch on that for a minute. This is one of the three objective driven approaches to replacing the EDC that we have not done yet.'",
        "'speaker_8': 'It is. It is. It is, in our opinion. Time to do that now. The purpose of that mayor's economic government advisory panel, which I've been calling midcap, because everything needs a good actor government. But that's not official. Is to enhance the business climate of Alamitos, business parks and commercial districts and support the growth of Almeida's identified commercial'",
        "'speaker_8': 'and industrial clusters and sectors. I've added by providing both strategic policy and tactical business attraction and retention advice to the council and staff. So that came right out of the October 2013 staff report that whereby the Council created this concept, the intent was for it to be flexible, focused and ambassadorial.'",
        "'speaker_8': 'So in the absence of real sort of projects for an EDC to approve because you know, they already signed off on Alameda Point, they already signed off on Alameda landing. Those things are happening and we don't see any major new projects to come forward from.'",
        "'speaker_8': 'From a transactional standpoint, I'm speaking in the absence of that and shifting from a redevelopment focus to a more traditional economic development focus, we need this panel to help us close deals, reach out to prospective businesses, to help us with our recruitment.'",
        "'speaker_8': 'Nothing helps us to recruit a biotech company like asking a guy like Adam Elsasser, who runs a very successful biotech company in town to make a phone call, to have a lunch with a prospective business that is incredibly valuable and really can't be measured.'",
        "'speaker_8': 'And so we want this to serve an ambassadorial purpose. We want it to be focused so that if the council or staff feels that we need a third party to evaluate an issue or to give us advice on a program or to review a program that we might be proposing to give us that comfort level, to know'",
        "'speaker_8': 'that it was properly vetted because not everything we do makes it to the council. Right? We would use it for that purpose and we want it to be flexible. The intent when this was set up was to not be a standing commission in the way that a formal commission is to meet perhaps formally once or twice a'",
        "'speaker_8': 'year. And then for this panel to be available to the mayor, to the council and to staff to call upon when we have specific issues that we want to address. These are some of the activities that were envisioned in October 2013 and that I envision using this for now if the council wants to move this forward.'",
        "'speaker_8': 'There was a recommended structure in that staff report. I think formal has been adopted, but we would envision seven or so members, you know, nominated by the mayor or perhaps confirmed by the council two year terms. The intent was for it to be composed of high level business executives, CEO types of some of our largest companies and'",
        "'speaker_8': 'some of our important smaller companies, a good cross-section of sectors and CEOs. These are the ten sectors or so that we've identified as being meaningful right now. You can read them. Certainly, that's a very debatable list about what are Iraqi sectors that are.'",
        "'speaker_8': 'Reasonable minds can differ on that. We think that's a pretty good list for now. So. That's a presumptive slide. Next steps before a recommendation. So I'm going to do this backwards. So what we are recommending specifically in response to the EDC referral is that staff is recommending not to reestablish the Economic Development Commission and instead do two'",
        "'speaker_8': 'things. One is continue to use the ad hoc subcommittees, continue to use our outreach, extensive outreach to the business community as to tools that we will continue to use and will do that in an ongoing fashion. And then we think it's time to sort of flip the switch and turn on this panel that exists that was created'",
        "'speaker_8': 'but has never been impaneled. And we would recommend that in lieu of bringing back the Economic Development Commission. And largely because in just as a sort of a final word for me, the reasons that the Economic Development Commission were disbanded only 19 months ago.'",
        "'speaker_8': 'If you go back and read that staff report, we think they're all still valid. We don't think anything's changed. Reasonable minds can disagree on that. So we're going to stick by our recommendation. We don't see any reason to change it and and suggest this to you.'",
        "'speaker_8': 'And so now go backwards if you agree with this. And that's totally your prerogative. Obviously, we would think that next steps for creating or for paneling this panel because remember, it already exists is to develop we would develop a representative list of CEOs and business leaders from a set of economic sectors, maybe the ten I showed you'",
        "'speaker_8': ', maybe some different ones. We would work with the mayor to identify and recruit seven or so advisory panel members. I presumably for counsel consideration, although I don't want to be presumptive about that. Exactly what the process would be is up to you to just start recommending.'",
        "'speaker_8': 'That would come to you for consideration as well as sort of a formal staff report and recommendation on how this should be set up, what the terms are, who the people are, how many times they should meet. And then we would convene that inaugural advisory panel meeting sometime in the summer of 2015.'",
        "'speaker_8': 'And that's our recommendation. Belleville answered questions.'",
        "'speaker_0': 'We have two speakers that. Counsel Did you want to ask any questions at this point or. I call the speakers. All right. First would be Michael McDonough and then Rob Rado. And any other slips on this one.'",
        "'speaker_7': 'Good evening, Mayor and Vice Mayor, council members and staff. I'm Michael McDonald, president of the Alameda Chamber of Commerce. And I just wanted to come here tonight to show the chamber's support for the city staff's efforts in the economic department, specifically for all the work they've been doing to develop the strategy and the development.'",
        "'speaker_7': 'So far that's been really moving Alameda forward in the last couple of years. We really have worked well with Darrell and of course, Debbie, and we really appreciate the efforts they're putting out. And it's really interesting because as Darrell began with his mission, the chamber's mission parallels that very closely.'",
        "'speaker_7': 'We really do want to support the existing businesses to retain them. We want to make sure that they get the opportunity to expand in a in a business friendly environment and, of course, to attract new help attract new businesses to town.'",
        "'speaker_7': 'In fact, we have worked with the city on many of the key programs that they describe there, including the new business welcome the new business meet and greets. We've done a number of times we were at the and helped with the annual broker event.'",
        "'speaker_7': 'We've really promoted the Island Shopper campaign and we're currently working on the job fair that on the Committee for the Job Fair that Darrell mentioned. So we really have worked in conjunction with the city and a lot of these economic developments.'",
        "'speaker_7': 'So we really enjoy that and have had a great relationship. And it's very true that that they have reached out to us in the last, I don't know, a year and a half. We have had a very good working relationship and we too have reached out to the other business associations to try to form a better bond'",
        "'speaker_7': 'so that you guys can hear the voice of the business community, not just from the chamber, but from all the business associations. So I believe that the city's goals and the chamber's goals, we're working in conjunction in the same direction.'",
        "'speaker_7': 'It's been very rewarding for both parties, I think. And regarding the second part of Darrell's presentation regarding the Economic Development Commission, you know, when that when that in 2013 was disbanded, they did come to the chamber and we worked closely with them to think about what it would look like if that wasn't here.'",
        "'speaker_7': 'And we understand why, you know, it had I wouldn't say lost its purpose, but but it changed with the lack of redevelopment funds. And I think the the recommendation at that time for the advisory panel was a good one and we supported that.'",
        "'speaker_7': 'And we look forward to working with maybe the advisory panel. And if you decide to do the economic commission, we look forward to working with that as well. But we do support staff's recommendation to move forward with the advisory panel and even to the point where we would look forward to to directly participating on the advisory panel'",
        "'speaker_7': ', if so, chosen. So the main thing I wanted to say here tonight is we really appreciate the staff's efforts and the economic development strategy that they've been enacting over the last several months, if not years, and want to support them in their recommendations to you tonight.'",
        "'speaker_7': 'Thank you. You.'",
        "'speaker_0': 'Erato and then Karen Bass.'",
        "'speaker_6': 'You're back to your post 11 p.m. time slot.'",
        "'speaker_7': 'Well, I have the over and under at 1030, so I win. Rob Reiner, executive director of Park Street Business Association, soon to be the downtown Alameda Business Association. Don't worry, you'll get the invitations. We're in concurrence with the staff report.'",
        "'speaker_7': 'We were sorry to see the economic. Development Commission go under. But at when it did go under, it had kind of petered out and run its course. This sounds like a wonderful plan. Hopefully it will work. Hopefully. Mr. Madden Rossi came to our board meeting a month ago, and we kind of talked about this a little bit'",
        "'speaker_7': '. And we would concur with him that one of the things that absolutely has to happen with this panel is that the council needs to give this panel and staff some direction. I think that was one of the things that was absolutely we agree with Mr. Rossi that that was one of the things missing.'",
        "'speaker_7': 'Toward the end of the EDC. And we hope to see that. The other thing I got to tell you that I'm just thrilled to death to see up there. And boy, are you going to be hearing from me for the next couple of council meetings.'",
        "'speaker_7': 'The best thing that can come out of this. Is the reestablishment of the facade grant program. Oh, I'm so happy to see you all go like this. That was the best damn business program for small businesses this city ever had.'",
        "'speaker_7': 'And we were sorry to see it go. So if you folks can do whatever you need to do and staff can do whatever they need to do to make that happen. We are happy to participate in it again.'",
        "'speaker_7': 'And, you know, you give me a call, I'll walk you up and down the street and I'll show you every business that's got a facade grant program and every business that got one, it only improved the look of the street.'",
        "'speaker_7': 'So we hopefully you'll pass this this evening. We look forward to working with everyone, and I'll go ahead and take my shot. We'd love a spot on that little advisory committee. I'll talk to you later, but.'",
        "'speaker_0': 'Karen B. And then she's our last speaker on this item.'",
        "'speaker_9': 'Good evening, Mayor Spencer, members of the City Council and staff. My name is Karen Bay and I'm here tonight. First of all, I want to say thank you, Daryl and Debbie, for a great presentation. Whatever you decide tonight, I'm here to ask that you consider adding one more strategic focus, and that is tourism.'",
        "'speaker_9': 'Alameda point will become a regional destination if we get that approved and we can use this development to attract tourists to other areas of Alameda Park Street. Webster Street. There are other areas that have great potential for development.'",
        "'speaker_9': 'We were once a resort community and the development of Alameda Point and the Northern Waterfront can help us create this new industry. San Francisco tourists spent $9.4 billion in 2013, up from 8.9 billion in 2012. As a result, they collected over 600 million and sales tax revenue.'",
        "'speaker_9': 'We just talked about sales tax revenue being a huge component of the revenue. So I think this is a potential industry that could help us solve a lot of problems. We can attract some of those visitors from San Francisco by creating a theme a day in Alameda.'",
        "'speaker_9': 'I also want to mention that we were the finalist and Sunset Travel Awards this year, and I think we need to build on that. This is kind of an easy it's an it's an easy solution here. So if we use the Oakland model, Oakland has a full time person in their economic development department working on nothing else'",
        "'speaker_9': 'but increasing tourism in Oakland. The campaign is called Visit Oakland. She was previously a senior vice president of business development of the Santa monica Convention and Visitors Bureau and a sales manager at Tourism Whistler. That's the kind of talent that we need.'",
        "'speaker_9': 'All right. If we want to focus our attention on increasing tourism, we need that kind of talent as a result. Well, Oakland as a result increased 300 new restaurants. And Alameda in Oakland in the last two years, 110 new restaurants in the last six months.'",
        "'speaker_9': 'All right. As a result, Jack, London Square just landed an upscale food market which will be developed by Napa Valley developer. His name is Steve Cullen. So 5 minutes away from us, they're focusing on tourism. San Francisco is focusing on tourism.'",
        "'speaker_9': 'We need to add that. Please consider adding that to the seven strategic focuses. Just real quickly, some of the steps that we can we can ask our visit Alameda team to do is hire a marketing director, a CEO, a sales director to focus on rebranding Alameda as a tourist destination and create a goal.'",
        "'speaker_9': 'Bring 50 restaurants to Alameda and create art and culture and entertainment in Alameda, create a bicycle tourism plan and consider developing a hotel convention center at Alameda Point. We'll need to work with all of the what the Alameda Point developers and the Northern Waterfront developers to try to meet our goals.'",
        "'speaker_9': 'I urge you to consider this. I think this is a wonderful opportunity and it would increase our sales tax revenue. Thank you.'",
        "'speaker_0': 'Thank you. Is our last speaker on the item council member. Actually, as vice mayor, this is your referral.'",
        "'speaker_2': 'Thank you. I've actually heard a lot of things that were on the plate of the Economic Development Commission in 1996, which resulted in the 2000 strategic plan. Among the activities that that commission took up was the downtown plan, which eventually was implemented, and that's the theater in the parking structure that you see.'",
        "'speaker_2': 'It is jump started Park Street. I do think that economic development is not an ad hoc. Um, activity. And I think that we need it now more than ever, that redevelopment is not in place and that we're still waiting for the successor to redevelopment funding.'",
        "'speaker_2': 'I think it's valid to. Look at a commission. Because the commission has all the trappings that are necessary to make sure that policies reflect. The entire nature of the city input from the residents. And those recommendations are formed in a agenda as measured.'",
        "'speaker_2': 'And a collaborative approach with. Public forums that the Commission meetings provide. It sounded like in this presentation that this mayor's economic development advisory panel. Is tracking along that. But I. I would prefer a commission that. Both through our regular Border Commission process for appointment and and confirmation.'",
        "'speaker_2': 'It goes through the regular process of having meeting minutes, agendas and reports to council, and I think most importantly gets direction from the council on what its tasks are. I think this council referral is still valid and I'd like to hear what my colleagues think.'",
        "'speaker_2': 'And I'd like to be able to make a decision on it tonight and delayed a couple of. Maybe three times because of long agendas and other things out of our control. But I think it's on the plate now.'",
        "'speaker_0': 'All right. Any counseling? Okay. Ashcroft.'",
        "'speaker_5': 'All right. Thank you. So I. I have to give considerable weight to staff's recommendation because it is staff who were tasking with the work of overseeing a commission. If indeed that's what we're to decide to do. When I was reading through this staff report and the the presentation.'",
        "'speaker_5': 'Nice presentation, Mr. Doane. It did strike me that. What a lot of the vice mayor's objectives and intent seem to be encompassed in many ways in the recommendations that came out of this this. I. This report, it seems that the advantage of an ad hoc committee is and it's laid out in the in the presentation on page'",
        "'speaker_5': '18 is the more flexible structure and approach accessing resources and personal contacts of the business community as and when needed to help close the deal or for other recruitment or development of particular expansion of particular sectors perhaps. And at the same time, I also see that in the.'",
        "'speaker_5': 'The staff report, there is a process for assembling members to address specific needs. I am mindful that the projects, the two projects that the vice mayor quoted, the theater and the parking structure, both very successful and I think have brought a lot of benefit to our city and to the Park Street area.'",
        "'speaker_5': 'Did both come about with redevelopment funds? And I heard the reference to, you know, at some point when there is a successor to redevelopment and I know there's been some talk in Sacramento and I know at least there's talk of it happening some time, but we're not there yet.'",
        "'speaker_5': 'So what I would prefer to see, although I have to say I also agree with the I think it was Rob Prado who and the vice mayor echoed this that. Whatever the iteration is, whatever we decide to do, it needs city council oversight and direction.'",
        "'speaker_5': 'And for that reason, I'm hesitant and I don't think I could support the recommendation that it be a mayor's committee that the mayor recommends. I would prefer to see an ad hoc committee assembled to address specific needs, and it might be, for instance, the update of the economic strategic plan or the strategic plan of the general plan'",
        "'speaker_5': ', because that is a bit outdated, I think. But I'd prefer to see that sort of a committee formed and it can certainly come. I would want it to come to the City Council for approval of the members, but I'd like to hear from staff and our business associations and Chamber of Commerce who I think have the greater'",
        "'speaker_5': 'overview of what the what resources are out there, who to to tap for maritime or nanotechnology or whatever the sector is that we want to focus on. And I think that it is important to have the council oversight.'",
        "'speaker_5': 'And I but I'm wondering, is it mutually exclusive? I like the idea of the minutes and the accountability, but I don't know why the the council couldn't direct an ad hoc committee to do to do the same. And and again, because this panel is advising the entire council, I think it's a city economic development advisory panel or'",
        "'speaker_5': 'city council. But I do think it's important to hear, as Mr. Doane mentioned, at least quarterly, what some of the initiatives are and what progress we've made. I think we don't we don't toot our own horn enough sometimes that the the things that we're doing.'",
        "'speaker_5': 'So I think I want to see a hybrid kind of an approach, and I do want to see accountability to the council, but I definitely want to hear input for potential panel members from the business community and peers out there in the business community who I think are in a good position to help advise.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Member, Odie.'",
        "'speaker_6': 'Thank you, Madam Mayor. So I'm I'm looking at the the vice mayor's referral, and I see a lot of overlap between the the roles of the Economic Development Commission, as he suggested it, and, and this mayor's advisory committee.'",
        "'speaker_6': 'So I think we're pretty close in agreement between the staff report and the vice mayor's referral on what it is that we want this group to do. I just think we're kind of a little at odds on what to call it, which I don't really care.'",
        "'speaker_6': 'You can call it a economic development commission. You could call it the mayor's committee. You could call it the mayor council committee, whatever. Doesn't really matter to me. And then we're also at odds over how much oversight and formality this commission should had.'",
        "'speaker_6': 'And I. I still. Are for the third time talking about this. I agree with the vice mayor that we need to have some type of, you know, formality and structure to it. You know, I was able to serve on the America's Cup Ad Hoc Committee.'",
        "'speaker_6': 'And I think what made that work is, you know, we had an event, the America's Cup. We wanted to take advantage of the economic opportunity and the tourism. And the then vice mayor at the time put in a referral to create this this committee.'",
        "'speaker_6': 'And it was made up, you know, of a few prominent business leaders and mostly maritime, you know, business leaders. So we were able to be focused on a task that was, I would say, very narrow and that is attracting, you know, maritime business.'",
        "'speaker_6': 'And the committee actually was able to help attract the Swedish team, Artemus, to be here. But I think that the goal of of this new mayor's committee or economic developed commission or whatever you want to call it, it was a little bit more broader, you know, focusing on Alameda Point, you know, being more more diverse in its'",
        "'speaker_6': 'membership, you know, from from different business sectors. So. I'd like to see if there's a way we can. Again, I don't really care what it's called, but and it sounds like the goals of the council referral and the goals of the the proposed mayor's committee are the same.'",
        "'speaker_6': 'We can find a way to to marry those together and do it in a way where there's still accountability and structure and compliance with our sense and ordinance and keeping things open and to the public. I mean, that be something I'd be more in favor and just to kind of.'",
        "'speaker_6': 'Go off topic for just a bit with Karen. Karen Bass. Comment. Last week I had a holiday. Cesar Chavez Day. I went on line, said what? I took the day and went away. And I did a search. Things to do in the bay area on one day and pull up this article in the chronicle and reading through'",
        "'speaker_6': 'and one day one of the things was a day trip to Alameda. I wasn't going to do that. Sorry. Wanted to get out of town. But you know, there's some merit to the idea that Alameda is now becoming a tourist destination, you know, at least for one day with with Spirits Alley and, you know, all the different'",
        "'speaker_6': 'family activities that we have. So, you know, I think that's kind of a good thing to add to the to the goals. But, you know, I still I'm not convinced that. I'm still. I still am in favor of the way that the vice mayor is proposing this.'",
        "'speaker_0': 'Every day.'",
        "'speaker_3': 'Thank you. You know, when the matter first arrived to council to review the way the Economic Development Commission was operating and how we might modify and improve that. This was back in 2013 or so. At that time, I concurred with staff's recommendation to look into the approach utilizing an advisory panel, working with the mayor and possibly Knight'",
        "'speaker_3': ', working with the mayor or the counsel general. That's a view that I still hold on and I hold it for several reasons. When I look at what we want to achieve through an economic development organization, and let's use that term broadly an economic development organization which could either be a commission or could be an advisory panel along'",
        "'speaker_3': 'the lines described through the mayor's task force. I really see two key issues. One is about function and the other is about attributes in terms of function. You can break that down into three areas that that an organization might play.'",
        "'speaker_3': 'It could be in the planning role. It could really be in the monitoring role. And finally, it could be in the implementation role. Those are key functions that an economic development organization can play. I think when I look back on the Economic Development Commission as I knew it and when I look at the panel, that's being a'",
        "'speaker_3': 'task force that's been suggested. I see the commission's role as having been more in the area of planning and and monitoring. And I see the task force role now being more about implementation. That is, use the phrase that's been used like closing the deal when projects come forward.'",
        "'speaker_3': 'And I think we're at a point where where we need to move fast. And I think we need to be nimble in this competitive environment. And I see something like the task force as achieving that. So to me, the key the key thing with regard to function is implementation.'",
        "'speaker_3': 'And I want an economic development staff working closely with council or the mayor working closely with key business leaders in town of which we we have representatives of major, major, major corporations, you know, ready to quickly, if not open doors and at least close deals.'",
        "'speaker_3': 'It's less big, frankly. Altogether possible. It's altogether possible. That there will be members of the Economic Development Commission. Who are not the right people. Send to a meeting where you have to close a deal. It's altogether possible that.'",
        "'speaker_3': 'Of the type of issues and concerns that they're most interested in. And it might not be one and might not be to. Are about. A frames. Signage on windows changing ordinances to that end. So to me, in addition to what is the function, I'm also interested in the attributes.'",
        "'speaker_3': 'Of the economic development organization. And when it comes to opening the doors that you need to be have opened when it comes to perhaps closing the deals that you need to have closed. I think the prospects of an economic development as force, the mayor's task force, or even these ad hoc committees that we've had, like the LA'",
        "'speaker_3': 'Biennale or maybe the the the America's Cup. I think the attributes are most suited to moving quickly to get things done. Okay. So the question then becomes, okay, well, whatever, whatever happened to the function of planning and monitoring?'",
        "'speaker_3': 'I think having as a city move forward with the economic development strategy of 1999 2000, having updated that subsequently 2008 and then and then with the prospects of updating it even more, I think that serves the framework for to make sure that whatever task force or whatever ad hoc committees that we have, that they don't operate in'",
        "'speaker_3': 'a vacuum. And there could be other ways to to ensure that that whatever Ido we come up with, hopefully, is a one that acts nimbly and quickly and closes deals, that there are other ways to make sure that they are not operating in a vacuum.'",
        "'speaker_3': 'So I'm still I'm still fine with a recommendation from 2013, and I see that mainly as expressed in the staff's recommendation tonight. It's a different way of doing economic development in Alameda and what we've been doing since I'm a mayor with the start of the Economic Development Commission, perhaps in 1990 or 1992, I can't quite remember.'",
        "'speaker_3': 'And I think we're at a point now where we've got the key players and. I do believe we have to choose one or the other. I don't think we can have both. I don't think we can have the Economic Development Commission along the lines that we had in the 1990 and early 2000 and a task force, because'",
        "'speaker_3': 'I think that that runs the risk of sort of sending mixed messages. I think that's the last thing you want to do. If I had to make a choice, I'd say it's a new century. We need to act nimbly.'",
        "'speaker_3': 'And I'm going to go with the staff's recommendation with regard to the mayor's task force and and if necessary, the ad hoc committee approach.'",
        "'speaker_0': 'So I appreciate all the comments. And I want to share, first of all, that this started back in 2013 before I was mayor. The prior council disbanded the commission and came up with this approach that staff continues to support.'",
        "'speaker_0': 'And we have had some amazing businesses come here during that time. I personally would like to give them the opportunity to continue their work. And when you speak, when staff speaks to why they think they need this, they want to be more flexible than a commission.'",
        "'speaker_0': 'So we're all here tonight. I go to meetings from a lot of commissions regularly. I do not expect business people to come and hang out here and think that that is the same goal that's going to support the business community.'",
        "'speaker_0': 'Now, I know we do have some businessmen and women that are here this evening, and thank you. But in regards to a commission coming up here and speaking publicly about what vision they may have or policies, I don't think that's what staff is asking for.'",
        "'speaker_0': 'I think staff is asking for business people that that that they can call on quickly, that they can ask for their expertize and not set a meeting, not go through the sunshine. Now, staff did say that they would formally consider meetings 1 to 2 times a year and maybe it would be a quarterly or something.'",
        "'speaker_0': 'I'm not sure. And staff is asking to be able to come back and be more clear about really what they're looking for. But I see this as member day, August 9th, who's been part of this much longer than I have.'",
        "'speaker_0': 'What he. But what the difference really is. And I would like to share that it's now a problem. I started meeting with staff on this in early January, and we do have some business people that are ready to step up and we continue to.'",
        "'speaker_0': 'Be waiting. And I think that's unfortunate. I think there are deals out there where we could use their expertize now. I think it is important to go ahead with staff's recommendation that they've been asking for apparently actually since 2000, the end of 2013.'",
        "'speaker_0': 'But but but I think. I would agree also with j soc in regards to member de sog in regards to you can't really have one. You can't have both. But I think staff is speaking about having formal, formal meetings.'",
        "'speaker_0': 'That's what we heard at least once or twice a year. And they have an idea of what they're looking for. CEO types, high level. I live a high level business people and they have specific things that they want these people to help them with.'",
        "'speaker_0': 'For instance, closing a deal that's you are not going to close the deal at a commission meeting. We know that that's not going to happen. It's not going to happen up here at a commission meeting. It will happen when staff has the flexibility that they're asking for to call certain people and have them.'",
        "'speaker_0': 'Assist. And that's what I see this as AM and that's why it needs to be flexible and a staff needs is thinking that they need that type of support to close a deal. I want to be able to support them.'",
        "'speaker_0': 'I don't want them to have to set a meeting 45 days down or 30 days down and do it publicly. Not going to happen. You're not going to close the deal at a public meeting. Yes.'",
        "'speaker_5': 'It's a clarifying question for staff. Maybe, Mr. Doan, what's to keep you from doing any of the things that are proposed now on your own? Gathering representatives of different sectors to help you or with their specific sector to help you close the deal.'",
        "'speaker_5': 'On bringing a new business here. Are you waiting for an ad hoc committee to advise you?'",
        "'speaker_8': 'We can we can do that now. And. You know, we have those relationships, right? We have a Rolodex. We have the ability to pick up the phone. I think there's an organizing principle, though, at play with a with an advisory panel that allows us to do that in unison with different sectors.'",
        "'speaker_8': 'A group of CEOs is sometimes better than one two. It's a quick, efficient way to sort of.'",
        "'speaker_7': 'Get.'",
        "'speaker_8': 'All that function together, you know, get a letter written, have it cosigned by seven or eight different members welcoming a business to town.'",
        "'speaker_5': 'So so who's going to be giving the direction to that group of CEOs to write that welcoming letter?'",
        "'speaker_8': 'Staff would call upon those CEOs. I don't know if it's. Giving direction per say. I mean, I think I think you you through your action, we this is how I would see this happening. We would go back to our offices and we would put together a formal proposal for you, for the council, and you would give up'",
        "'speaker_8': 'with the recommendation to Empanel said advisory panel, you know, thusly. And we would go and do that. You would give us the direction with our recommendations, hopefully taken into account on the activities that you would see the panel doing and the types of things that we would ask them to do and the mechanism for doing that.'",
        "'speaker_8': 'And we would take that directory, take that direction and essentially.'",
        "'speaker_5': 'I'm notified the hours getting late. So my brain is probably getting a little fuzzy here. But let me ask it a different way. What is it that you're not able to do now that you think you'd be able to do if you had either an ad hoc committee or an economic development commission?'",
        "'speaker_8': 'I think it's the. I think having the. In some ways, nothing. In some ways, though, there's a lot of value in the formality of an actual panel that's been formed by the council that we can call on quickly and efficiently to do what in some ways staff can do now is just it would take us longer and'",
        "'speaker_8': '. You know, having the sort of weight and the punch of an actual advisory panel, as opposed to me just calling a CEO and asking them to pitch in. They will. I think there's a lot of value and weight and having that punch of a formal body.'",
        "'speaker_0': 'Member J soc.'",
        "'speaker_5': 'But I'd like to hear of my colleague.'",
        "'speaker_3': 'Well, I think that the power of a task force would first and foremost come in the form of a letter issue of business or a corporation, perhaps, that we're trying to attract. Mm hmm. And on that letterhead, it said.'",
        "'speaker_3': 'Don Stevenson from Oakland Raiders. Erika Johnson from East Coffee. Joe Blow from Abbott. Whatever. And then I went from. McCartney's last Google one from Wind River slash intel. I think it's had and then in fact it and with the letter signed frankly by the mayor of Alameda.'",
        "'speaker_3': 'I think a letter like that, I'm coming from a house. That's what we mean by being able to respond quickly to opportunities and to kind of project that, so to speak, power. In ways that, quite frankly, an economic development commission could never do.'",
        "'speaker_3': 'So that would be one. That's what we mean by Nimble.'",
        "'speaker_8': 'That's what I envision.'",
        "'speaker_0': 'And I'd like to share. We currently do send out letters that I signed to businesses welcoming them. But it doesn't have the names of CEOs like that. That would be much more impressive. Vice Mayor.'",
        "'speaker_2': 'Yeah, I think that's fine. And that when you talk about deal closing, no deal that involves the cities can be closed without coming to the council. First of all.'",
        "'speaker_3': 'I think we meant that.'",
        "'speaker_2': 'And I think we need to be precise here. And what you describe, I think there is a lot of weight by having a a blue ribbon committee or an ad hoc group of CEOs who want to be part of that push.'",
        "'speaker_2': 'But I'm looking more at the what we're going to do, not how we're going to do it and the what we're going to do. I don't want a committee of just CEOs defining recommendations to come to Council on Economic Development.'",
        "'speaker_3': 'That's not their task.'",
        "'speaker_2': 'And I see that as an economic development commission task. Is that that policy? Is built on what we've done in the past and what we've updated here. And I think to have that done in the in the clear light and sometimes messiness of a of a of a chambers in front of commission is very valuable.'",
        "'speaker_2': 'And I think we can also answer some tough questions that we may have to look at. The real value of land at Alameda point is one is a question I think we need to challenge whether or not the fiscal neutrality policy that was put in place when the BRAC first started happening is really valid today, I think'",
        "'speaker_2': 'is another one. I'd like I'd like to see us explore the whole question we dealt with in the past. Big box are no big box here that came out of the Economic Development Commission, hard work that they did in engaging with the community to get a community take on an economic policy.'",
        "'speaker_2': 'The two bills that came from Sacramento last year, those infrastructure bond bills. Once a Senate bill. Once the Assembly bill. Trying to address closed military bases. Whether or not we should pull the trigger on that as an economic development tool can be studied by a commission.'",
        "'speaker_2': 'With the assistance of staff, with the research of staff and an a recommendation come council. That's what I'm looking for. And again, I'm looking for accountability. I'm looking for traceability. So we understand when decisions were made, how they were made and what the what the circumstances that led to that recommendation were by virtue of of minutes of'",
        "'speaker_2': 'these. I think it can be nimble and I think it can be directed if the council takes the lead and gives good direction on what those priorities are and. Those priorities can be informed again by. Say the the updating of strategic plan.'",
        "'speaker_2': 'That's a perfect, I think, a perfect task for a commission that's made up of a a defined but a broader section of. Of people as, as we've done in other commissions. Yeah, that's, that was my goal in bringing this forward.'",
        "'speaker_0': 'Member data.'",
        "'speaker_3': 'Just to quickly summarize now, my view of the economic development organization in terms of functions. To me, the issues are broadly stated one of planning what are your goals? What are your visions? What are your objectives? When I'm planning, monitoring, are you doing it?'",
        "'speaker_3': 'And then finally implementation. My feeling is that our emphasis should be on implementation. But to the extent that planning and monitoring and planning mostly is an issue, I mean, one way that you can deal with that separately from all this is I have an economic development task force who helps put together our updated economic development strategy.'",
        "'speaker_3': 'And then whether that task force, you know, goes on to continue as a commission. I don't know. But there are different ways we can plan and make sure that we're looking at the right vision, the right tasks, that the economic development ask for the mayor's task force or or an ad hoc committee if they're not working in'",
        "'speaker_3': 'a vacuum.'",
        "'speaker_0': 'Mr. Donat, you want to respond to any of these comments?'",
        "'speaker_4': 'I'm fine. Okay.'",
        "'speaker_0': 'Any other council comments?'",
        "'speaker_2': 'What I believe in this I'm going to move that we direct staff to. Although the parameters of the Council referral that I submitted and reform an economic development commission that includes the elements that were presented in our report and parameters for providing council direction on the tasks.'",
        "'speaker_6': 'I'll second that.'",
        "'speaker_0': 'Any discussion. All those in favor. I oppose.'",
        "'speaker_3': 'I oppose.'",
        "'speaker_0': 'I suppose.'",
        "'speaker_5': 'I abstain?'",
        "'speaker_0': 'So at this point, it doesn't pass it. It fails.'",
        "'speaker_3': 'Well, then. So let's make a motion.'",
        "'speaker_0': 'But to make.'",
        "'speaker_3': 'A motion that I'd like to make is I would like to move staff's recommendation regarding the audit right there on page 22 of 23.'",
        "'speaker_0': 'We have a second. Second. Any discussion. So I'll discussion if. We can continue what we're doing then and have stuff. You're waiting for council to make a decision, which is, you know what? That would be my concern. I would hope that we can support staff so that we can proceed.'",
        "'speaker_0': 'And and honestly, if it doesn't work, we can always try again. I mean, this is what happened in 2013. The commission was disbanded. The decision was made to proceed with this committee. The committee was not seated. And since I've been mayor, staff has been ready to sit this committee and move forward.'",
        "'speaker_0': 'But in reality, if it doesn't work out and council always gets to weigh in and I would hope that we can work with staff so that we can start moving. So I would second the motion. I'm yes member Odie.'",
        "'speaker_6': 'I still have concerns on how this commission is composed and. Know how somebody gets on there, whether that's just by appointment, by my staff, putting them on there, by the mayor putting him on there. I mean, the council not having any input in who these the members of this.'",
        "'speaker_6': 'What do we call this economic advisory.'",
        "'speaker_0': 'Panel member de SAC.'",
        "'speaker_3': 'On page 22 of 23 with a recommendation. If staff concurs, staff will return to council or more recommendation on the membership format of the mayor's economic table.'",
        "'speaker_6': 'But that wasn't in the staff report. That was in the in the presentation. So.'",
        "'speaker_0': 'So did you want staff to address your question?'",
        "'speaker_6': 'Was that part of the is part of the motion to. Clarify that or.'",
        "'speaker_3': 'My motion to it was on page 22 of the M.'",
        "'speaker_6': 'EDT presentation of.'",
        "'speaker_3': 'The.'",
        "'speaker_6': 'I don't need any more clarification. Thank you.'",
        "'speaker_0': 'Or any other member comments.'",
        "'speaker_2': 'The comment I, I don't think this provides the visibility or the, the proper stage for setting policy and tackling some of the. The harder economic questions that are going to come at us.'",
        "'speaker_0': 'All right. I'm going to go ahead and call the question. All those in favor. I.'",
        "'speaker_5': 'And I'm abstaining again. And I'm going to explain why. It's something I rarely do, but I am troubled by aspects of both proposals. I feel that we may just be adding another layer of bureaucracy to what a fairly clean department is already doing.'",
        "'speaker_5': 'I think there's.'",
        "'speaker_0': 'I'm sorry at this point. That was supposed to happen during discussion. So the question isn't, well, yes, you don't explain your votes afterwards. However, I thought what she was doing was trying to move this ahead because it failed again.'",
        "'speaker_6': 'We started voting on it though.'",
        "'speaker_0': 'I'm sorry we started off, but I heard we had.'",
        "'speaker_6': 'Heard the other.'",
        "'speaker_0': 'One favor. I didn't finish the vote. Oh, okay. I just heard that. But it was 2 to 2 and I'm sorry. No, we haven't finished the vote.'",
        "'speaker_5': 'Well, it is going to be to to to again.'",
        "'speaker_0': 'So let me finish calling the question, please. All those opposed.'",
        "'speaker_6': 'No, no.'",
        "'speaker_0': 'All right. So that was two in favor. One abstention and to oppose. So at this point, I'd like to proceed with the next agenda item. So it's almost. We actually have two more items.'",
        "'speaker_2': 'In a preventive preemptive motion.'",
        "'speaker_1': 'No. 11.'",
        "'speaker_5': '11.'",
        "'speaker_0': 'Okay.'"
    ],
    "Informational Report on Waste Collection Rates and Fees for Alameda County Industries.": [
        "'speaker_1': '60 Recommendation to accept an informational report on establishing integrated waste collection ceiling rates and service fees for Alameda County Industries for rate period 14th July 2015 to June 2016.'",
        "'speaker_7': 'Madam Mayor, Members of the City Council, I am Liam Garland from the Public Works Department and we are about to move pretty quickly through an informational report. In less than 15 minutes we'll actually have five presenters. So here we go.'",
        "'speaker_7': 'Oh, we're.'",
        "'speaker_0': 'Sorry to interrupt. And we have nine speakers at this point.'",
        "'speaker_7': 'Yes. Oh, we will be presenting an informational report on adjusting garbage rates as we do annually with one unique feature this year, which is the fact that the sorters at Alameda County Industries Facility in San Leandro are receiving a bargain for heightened salaries and wages and benefits.'",
        "'speaker_7': 'And what we're going to do is I'm going to provide a quick overview of the franchise, some of its successes and failures. I'll turn to Marva Sheehan from H.f. and our consultant who works with us closely on our franchise to walk through the options in front of the counsel for responding to those labor increases.'",
        "'speaker_7': 'Then we're going to hear directly from two representatives of Alameda County Industries and then a representative from the International. I'm going to Longshore and Warehouse Union, the ILWU WTU. That's the plan. Let me just emphasize that this is an informational item.'",
        "'speaker_7': 'We'll be back in two weeks to actually take action for setting rates for the subsequent year, and that's beginning July 1st, 2015. So I'll now provide the the overview of the franchise and some of its successes and challenges.'",
        "'speaker_7': 'And here you see are the basic infrastructure of picking up trash and recyclables and compost, lots of trucks. Those trucks are powered by compressed natural gas. Those trucks are making 2.9 million pickups per year in Alameda. This is a lot of work happening.'",
        "'speaker_7': 'And guess what? That work is having a great benefit. If you look at our diversion rate, we're at 76%. That's one of the highest diversion rates in Alameda County. So that that's a testament to a lot of hard work of Alameda residents, businesses, Alameda County Industries, community groups here like Community CASA, Community Action for Sustainable Alameda, I'",
        "'speaker_7': 'believe. And of course, city staff as well. So there's a lot to praise about that work. Here's one challenge. We have something called a negative balancing account on this franchise. Essentially, it's a negative million dollar balance account. And I just want to quickly describe where that comes from.'",
        "'speaker_7': 'If you take a look at this chart, the gap between the blue and that red line describes most of the balancing account. To start to explain that the blue line is where prior councils set rates. The red line is where is the actual revenue that was recovered from those rates.'",
        "'speaker_7': 'So going into detail on the blue line, you see that the rates there have been some significant rate increases over the past eight years or so, above 10% rate increase in 2007 and almost 10% increase in 2009 and then a 10% increase in 2013.'",
        "'speaker_7': 'Our lowest rate adjustment was actually last year, 2.62%. And if we focused for a moment just on 2011, you'll see that we, the city council, set an increase of 5%, yet actual revenue declined that year. So I don't that doesn't mean I was just at 4.35%.'",
        "'speaker_7': 'That means actual absolute revenue declined year over year. The economy obviously has a big part to do with that, but there's other dynamics that are driving that. There's some of that gap between red and blue line is that negative balancing account.'",
        "'speaker_7': 'Now, here's the good news. If you look at 2014, the blue in the red line, they're on top of each other. And that is really good news for the franchise. That is why one of the reasons why the balance sheet count has been reduced this year from about 1.4 million to about 1 million.'",
        "'speaker_7': 'And when we look forward five years out, assuming a couple of things and doing some scenario planning, the most likely scenario in 2020 is that the balancing account is net positive. So it's no longer negative. It's right in that middle kind of yellowish box of a plus 300,000.'",
        "'speaker_7': 'The worst case scenario is upper left. It's still a negative about a million. So that's essentially the way it is now. And the best case scenario is in your lower right, it's a plus 2 million. And again, our best bet is that it's right in that middle, middle yellowish category of up 307,000.'",
        "'speaker_7': 'So that's the the quick summary of some of the successes and challenges of the franchise. And I'm now going to hand it off to Marvet to walk through the options in terms of handling this year's annual adjustment.'",
        "'speaker_0': 'Can you clarify, are these slides available online? They just presentation?'",
        "'speaker_7': 'No, they are not. But they will be. And we can make that happen in the morning. And when we publish the agenda for the next meeting, when the action is taken, these will be a part of that.'",
        "'speaker_5': 'That part of our packet.'",
        "'speaker_7': 'Yes, exactly.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Good evening, Mayor and Council.'",
        "'speaker_0': 'So I am going to. They talk about the actual rate application.'",
        "'speaker_1': 'The HCI submitted their.'",
        "'speaker_0': 'Rate application.'",
        "'speaker_1': 'This year. We use what we call the index method, and in that we really just look at the changes in CPI and we use different indices for the different expenses and also look at their collective bargaining agreement and adjust expenses according to that.'",
        "'speaker_1': 'And then this is just the collection company. So we.'",
        "'speaker_0': 'Went through that review and for that part, just on the pure, according to their contract, what the.'",
        "'speaker_1': 'Adjustment would be would be a 2.8% adjustment.'",
        "'speaker_0': 'Then they also.'",
        "'speaker_1': 'Submitted.'",
        "'speaker_0': 'With this application a.'",
        "'speaker_1': 'Special rate adjustment.'",
        "'speaker_0': 'And it's relating to the laborers at their material recovery facility. Murph, you're going to hear Murph a lot tonight. So in January and 2014, ACR was approached regarding the San Leandro Living Wage Ordinance, their facilities in San Leandro.'",
        "'speaker_1': 'In October, the ILWU and RCI began discussions on a collective bargaining agreement. And then beginning in December, the workers started receiving the living wages and they have still been working through in those negotiations. Again, the rates that we're setting are the ones going into effect.'",
        "'speaker_0': 'July 1st.'",
        "'speaker_1': 'And. When they submitted this special application rate adjustment, they submitted.'",
        "'speaker_0': 'What's the incremental cost for providing its.'",
        "'speaker_1': 'Employees, the union wages and benefits. So they we.'",
        "'speaker_0': 'Calculated and we went through and.'",
        "'speaker_1': 'Looked at all of those adjustments.'",
        "'speaker_0': 'And they calculated the new cost. We subtracted out what the cost that they had been paying. So we're getting just that incremental cost. They included some profit.'",
        "'speaker_1': 'And then we've included this. They included the city.'",
        "'speaker_0': 'Franchise fees on those.'",
        "'speaker_1': 'Numbers. They took those total cost and they.'",
        "'speaker_0': 'Allocated it to their three franchises.'",
        "'speaker_1': 'For the city of Alameda, City of San Leandro and the city of Livermore, based on each city's proportional share of ten and each that has been processed. So in doing.'",
        "'speaker_5': 'That, I just stop you here. Is any of this material in the report?'",
        "'speaker_0': 'It's in this. That was in the staff report, but it wasn't presented in charts like this. Really? We normally get a report like this attached to the package so that we can all review in advance.'",
        "'speaker_5': 'And the public can see it ahead of time.'",
        "'speaker_7': 'What you'll see as one of the reasons why it was not part of the packet is that there's a new option being presented. So a lot of the same information was presented in the information report. But we've also had late breaking action in the last week with a new option, and that is part of the reason why'",
        "'speaker_7': 'we took extra time to complete these slides.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_6': 'I said a clarifying question. We go back to the previous slide. So the Alameda San Leandro in Livermore is going to those other two cities and requesting. Requesting that they pay their share. Sorry.'",
        "'speaker_0': 'And is there, like, a time deadline? Why this has to be addressed tonight as opposed to coming back in the future with the report?'",
        "'speaker_7': 'Sure. Pardon me. Exactly the. Exactly.'",
        "'speaker_0': 'Actually what I'm suggesting is come back informational with the report and then come back for a vote. Does it have to be approved tonight or in two weeks, in two weeks, or do we have that much time? We have a month.'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'This is purely informational for tonight.'",
        "'speaker_0': 'I think the mayor is asking if the for 21 council meeting where you're asking for a rate increase, does the rate decision have to be made on 421 or can that be made at a later date?'",
        "'speaker_7': 'It could be made at a later date there. The sooner the better, given the fact that the rate if the rate adjustment is going to account for the increased labor costs. There's three cities involved in that.'",
        "'speaker_0': 'And so they're going to ask you how many pages report on page six. How many more pages do we have?'",
        "'speaker_7': 'About 11. Remember, the whole presentation only takes 12 or 13 minutes if we go if we go all the way through.'",
        "'speaker_5': 'The question here is. Okay. We have public speakers on this one and they've been waiting. It's midnight. They've been here since seven. So I certainly wouldn't want to preempt them. But I, I as a council member, I get that this is informational, but I really prefer to have read the material before it's presented because then I could'",
        "'speaker_5': 'even ask you questions about it. But is there any harm in you're doing your presentation on the 21st when we actually vote on the rate increases? Is that staff we haven't submitted, have we submitted? Thursday is the deadline yet.'",
        "'speaker_7': 'So those materials will be submitted on Thursday. We'll have the the presentation updated based on the feedback we get tonight. All uploaded on Thursday for the meeting in two weeks.'",
        "'speaker_0': 'So is there five more pages, 11 pages total? Is that what you're saying or. Yes. All right. These continue. Okay. I'm just going to tell you, it's very hard for me to actually read these numbers, these tables some of these tables are very hard for me to read.'",
        "'speaker_0': 'If we're supposed to be weighing in on them, I can't. This is bigger, but the small columns. Go ahead.'",
        "'speaker_1': 'Okay. So. That is, you can see what the impact hopefully.'",
        "'speaker_0': 'You can see on the impact.'",
        "'speaker_1': 'Here.'",
        "'speaker_0': 'We've got the 20 gallon rate and the 32 gallon rates. If you notice, the majority of the ratepayers.'",
        "'speaker_1': 'In the city are in the 20 and 32 gallon containers. So your current rate when we go to app. Sorry, wrong way. The 2.8, which is the contract, would go up $0.80 if we did the full special rate adjustment.'",
        "'speaker_1': 'It would go up $3.01. That's the first one. And the three one, the 32 gallon would go up a dollar one with the full 10.58% went up to $3.80. Per month on a per month basis. The. Walks down below is just to show that there.'",
        "'speaker_0': 'Will be.'",
        "'speaker_1': 'Incremental and. There will be incremental increases, but ranging between 11 and 17% in the future related to this. This is the new option that you're going to hear about from ACR tonight, this middle green part in the middle of the 7.7.'",
        "'speaker_1': 'They are going to describe that. So with that option, again, we're starting at the $0.80 with this new.'",
        "'speaker_0': 'Option, they're going to talk about that they presented to us.'",
        "'speaker_1': 'As $2 and 20 compared to the three to. And the dollar to 77 and the 380.'",
        "'speaker_0': 'The future impact is slightly higher because we're delaying what they're what they are doing.'",
        "'speaker_1': 'And actually I can talk to I'll come back. They're going to they're pushing out some of the increases.'",
        "'speaker_0': 'So we're getting a lower increase in this first year and you'll see a slightly higher between the.'",
        "'speaker_1': '27 and $0.39 a month in the next four years after that. So ac.'",
        "'speaker_0': 'I can't. Kenny will talk about this new option. This is what.'",
        "'speaker_1': 'They just brought to us recently. And.'",
        "'speaker_7': 'Thank you, Madam Mayor.'",
        "'speaker_8': 'COUNCIL My name is Kent Cunningham with Alameda County Industries, and I've had the unique experience here of having to work with staff on getting them up to speed on the impacts, the financial impacts of this labor organization with HCI.'",
        "'speaker_8': 'And I've also had the luxury of working with labor on getting them to understand what the financial impacts are and what we need to do. And as a result, we just signed an IOU with the with with labor, where we've smoothed out the rates or the impact on the rates, I should say, and and did a couple'",
        "'speaker_8': 'other things where the company itself gave up the profitability, which you saw in an earlier slide. And then the cities come forward and said, all right, we'll drop our incremental franchise fee on that as well. And we're also throwing.'",
        "'speaker_7': 'In where.'",
        "'speaker_8': 'We'll we're going to look at a pilot program for multifamily annuals, which has become kind of a big issue lately. We've had a lot of a lot of requests for that. So we're going to study that in the pilot program.'",
        "'speaker_8': 'I want to point out that the financial impacts of bringing everyone up to speed and getting labor where it needs to be, I is is a big, big impact on the company. We're not a huge company. The other thing is for labor, getting health benefits in place for for labor is real important.'",
        "'speaker_8': 'And so the idea is, with this letter of understanding, if we get the the revenue increases that are needed from the cities will be able to implement that. And hopefully we can have that done by July 1st. So there is a bit of an urgency here.'",
        "'speaker_8': 'And we also have a banking relationship that's they're looking for information, too, because of paying the living wage. Things have gone up in and they're sitting in the wings waiting to see what happens. And with that, I want to ask Andy Rose, our financial advisor, and he's a specialist in waste financing, waste and recycling financing to speak'",
        "'speaker_8': 'to that in our relationship with our bank. Thank you.'",
        "'speaker_7': 'Thank you, Madam Mayor and council members. I will really try to be brief. In a perfect world, we wouldn't need banks. My job with this company and in fact, most of the solid waste and recycling companies of any size in California is to help them arrange financing.'",
        "'speaker_7': 'In the old days, you know, decades and decades ago, cities and companies would have like a seven page six or seven page agreement, which basically said you, the private company, will pick up garbage and we will pay you a fair, you know, rate for that.'",
        "'speaker_7': 'Things are much more complicated now. But the key is still cooperation. And I think this option, the most recent option that has been presented, is a classic example of great cooperation between labor management and a city. Why does that relate to the banks?'",
        "'speaker_7': 'Because we have been able to so far with their bank say we know there's a problem. We realize we have violated some of our financial covenants because of the living wage increase. But we will fix it and we will fix it cooperatively and only about four or five banks that really will do this kind of business.'",
        "'speaker_7': 'The rest of them you go in and if you go into your basic banker and say, I have a solid waste company, their eyes roll up in their head. They have no idea how any of this works. It's important that those banks trust that this public private partnership, if you will, for not only this city and this'",
        "'speaker_7': 'company, but many cities and California and many companies works. I think you have an opportunity here to really show that that it does work and that the banks can trust them. These companies are exceptionally capital intensive, and that isn't just small companies like this.'",
        "'speaker_7': 'Waste Management, I think, has a billion or two of debt outstanding. So it's important. In a perfect world, there would be bankers, but unfortunately, these companies need their bankers. My job is to do that. The one slide here is just meant to show you that we have some negotiations still to do with the bank.'",
        "'speaker_7': 'So when you talk about the urgency of the timing, it is urgent. Two factors. One, their credit agreement expires at the end of June. That means at that point, they have to pay off all their debt unless we do a new agreement.'",
        "'speaker_7': 'And second, it will take a little time to do that. But third, most importantly, fixed charge is sort of what we live and die on. And that means do you have enough cash plus a little cushion to pay your debt service?'",
        "'speaker_7': 'You can see that even with this option and the rate increase that's being asked for, they will be violating their covenants for the next three years. We can fix that. We can get the bank to readjust the principal payment schedule so that they will be in compliance.'",
        "'speaker_7': 'But the bank needs to know that these three cities are going to work in cooperation with with this company. I think what they've done is is great, you know, in evening out the increases rather than hitting with one large one now but I can tell you it's extremely important what you and cities like you and companies like'",
        "'speaker_7': 'this have done has made California a leader in the recycling industry and the recycling diversion percentages in the environmental industries in general. California is now starting to lead in living wage and prevailing wage and actions. And I think you have an opportunity here basically if you approve this option, to continue California's and the city of his leadership'",
        "'speaker_7': 'in both. Thank you. You. Good evening or good morning. Members of the council, mayor harry herrera spencer. My name is Fred Becker and I'm the secretary treasurer of ILWU Local six. I wanted to give you a brief overview of where why we're here in.'",
        "'speaker_7': 'In Alameda County and throughout the country, there's a shift from disposal to recycling is as the primary way that we want to handle our our trash. It's about having a sustainable future for our children and the planet that we can.'",
        "'speaker_7': 'We can enjoy. We can bring tourists to and. Up until December of 2013, Alameda County really had a standard of poverty for the workers who sought material that that's in our trash. That wasn't true of the drivers or the mechanics who work in the industry.'",
        "'speaker_7': 'They're on the same level as the garbage, the people who collect garbage and dispose of it in the landfills. In 2013, the civic leadership of the city of Fremont approved rate increases, which created a standard which we, you know, recognizing the fiscal realities that that cities face right now.'",
        "'speaker_7': 'We we. I think can't use the word smooth. We've we've put in a progression that that reduces the impact in any particular year. And Oakland and now Hayward have adopted similar standards to the point where we can say that we have an area standard in Alameda County which will have recycling workers making $20.94, which is not any'",
        "'speaker_7': 'kind of princely wage. That's the kind of wage that they're making in San Francisco and San Jose at this moment. They're making more than that, but they'll be making $20 in 94 starting in 2019. The slide up there was incorrect.'",
        "'speaker_7': 'This is actually one more year that that that should be included, which is 2019 through 2020.'",
        "'speaker_0': 'Let me interrupt real quick. So then what that information be included when it comes back?'",
        "'speaker_6': 'Thank you for clarifying questions.'",
        "'speaker_0': 'Brody.'",
        "'speaker_6': 'Maybe you're going to get to this. But what were they making before all of this?'",
        "'speaker_7': 'Countywide the wage increase in minimum wage. These people were making minimum wage. $9. No medical benefits and $99. Correct. Okay. They're currently as as the slide showed you, they're currently making 1459. So. We? So the cities of Fremont, Oakland, Hayward and the overall governing body for trash for recycling in Alameda County stop waste or have recognized the'",
        "'speaker_7': 'standard that we created starting in Fremont as as a fair way to treat the people who do the important dirty dangerous work of recycling our recyclables. And we are happy to say that as of last week, I and Local six have an agreement that on on what a wage package and benefits will be.'",
        "'speaker_7': 'We've as Kent said, we've deferred some of the benefits to make it make the lift not so big. The other companies we've dealt with had medical benefits in place. And here there's going to be a big lift in the first year if you look at the numbers that were there.'",
        "'speaker_7': 'There's a big lift in the first year because of we have to establish medical benefits for people. And following that, you'll see that the increases are very modest even with that increase. Looking at the at at the second slide, you'll see that over the years you've had that rate increases that were higher than what's being proposed right'",
        "'speaker_7': 'now. And it didn't. And that was with paying people truly poverty wages. So the ACR workers have joined the campaign, which has been going on for three years in Alameda County, to to get respect and a decent living that they can support their families with.'",
        "'speaker_7': 'And these are the people who make zero waste, which is a laudable policy, which we I think all support of that. They're the people who make it possible by their labor. So when we look at it, we know that this is a matter of civic will.'",
        "'speaker_7': 'When we look around the bay and we see that San Francisco and San Jose are already paying in excess of what we're talking about, paying five years from now on what people would be earning. We believe that it's a matter of of the kind of cooperation that we've been blessed to receive in terms of civic leadership with'",
        "'speaker_7': 'the companies that we work with and and our membership working together to make a reality which is implementing a good policy and taking care of the people who do it. And I don't think that when when, you know, recycling is pretty magical for most people, where you put it out on your curb and you never have to'",
        "'speaker_7': 'worry about it again. It's not so magical to the people who who do the work. And I think that along with the education, we need to recognize that this is the way that we handle garbage now and that this is the way that that, you know, the jobs in the sanitation industry have been jobs that are good'",
        "'speaker_7': ', blue collar jobs that support people's families. And there's no reason that the recycling industry should become some kind of local industry and other places are not doing it. We like your support in making sure we make it a reality for a larger part of Alameda County.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'And with that, we'll sum up on this last slide. And I would just like to use the pointer to show a couple of things here. So the the informational report focused on two options, that option right there, which is essentially just the indexed increase.'",
        "'speaker_7': 'And it focused on this option, which was that 10.58% increase. And the new option that ILWU and HCI in the city are presenting tonight is that one right in the middle, the seven points, seven 0%. And for the monthly impacts for most of our rate payers would be about 220 per month or 277 per month.'",
        "'speaker_7': 'And with that, we'll close our presentation and are happy to answer any questions you may have.'",
        "'speaker_5': 'May I? Mary Spencer.'",
        "'speaker_0': 'Rascoff.'",
        "'speaker_5': 'Thank you. Um, thank you, Mr. Garland. We look forward to having a more complete packet. I did sound like you were all working. So the 11 hour. So I want to disclose at the outset that I have both visited the ACI recycling facility out in San Leandro and went up in and, you know, stood and watched the'",
        "'speaker_5': 'recycling line workers. And it is a very educational process to see and it's true what Mr. Packer just said. We don't really think once we get those bins out on our curb on the right day and we don't really think about what happens after that, but these folks stand in an assembly line.'",
        "'speaker_5': 'It's a conveyor belt and it goes by and they're picking out.'",
        "'speaker_0': 'Sorry, you have questions.'",
        "'speaker_5': 'That shouldn't be on there. Yes, I will get to that. And I also met with the Dover. It's a mr. Kenny from RCI. So I could get both of, you know, all perspectives on this. One of the things that troubled me is that so the current rate that ACA is paying hourly to these recycling workers is $14.59'",
        "'speaker_5': '. That's only $0.02 more than the hourly rate that they were paying these workers before the before the last year, before they joined with ILWU. Okay. I'm getting people shaking their heads, but I'm looking at table one, the hourly rate and.'",
        "'speaker_5': 'Excuse me, they weren't. No, no, no, it's. No, they weren't. The recycling workers were being paid $9 an hour before they joined the union, and then they went to $14.59, and there'll be incremental increases after that. But the burdened rate, the the rate that the company pays with the benefits only went up $0.02 because prior to this'",
        "'speaker_5': ', the ECI was paying the temporary agency the fee to supply these workers. And so for some of these workers that were so-called temporary had worked for the company for 13 years. So I'm I'm troubled that that went on for as long as it did.'",
        "'speaker_5': 'And then there's also I've certainly I'm happy to see the new figures come up, and I'm certainly willing to consider the increase that's being proposed. But I am also aware that at the same time, ECI is talking about reducing the workforce.'",
        "'speaker_5': 'Is that correct? That that at some point the workforce would be cut almost in half because the number of shifts would be reduced.'",
        "'speaker_7': 'So one of the options in the future is retooling the facility and essentially updating the facility, which would obviate the need for one shift of workers. And that's not something contemplated for this year. It's a possibility four years out.'",
        "'speaker_5': 'So what I wanted to make sure is, though, that so we say the council does decide to increase the rates that our residents pay. But then that's to help absorb the increased salaries. So then if half of that workforce goes away, don't those costs go down as well?'",
        "'speaker_7': 'They would. And those the rate payers would see the benefit of that decline in costs.'",
        "'speaker_5': 'Okay. And are we also being asked to help pay for the retooling of this facility?'",
        "'speaker_7': 'No. No. Was.'",
        "'speaker_5': 'Well, not in this calendar year, but are we in another?'",
        "'speaker_7': 'The short answer, I believe, is no. But Kent is going to going to correct me.'",
        "'speaker_8': 'I if we were to retool, the only way it would be possible is if we were able to come back and say, all right, this is what we can save the ratepayers. And at this point in time, there's no definitive plans, has been ideas kicked around, but there's no definitive plans right now to do any type of'",
        "'speaker_8': 'retooling. There's a lot of challenges to that. And it's very capital intensive to.'",
        "'speaker_5': 'Okay. And then the last question for now and I'll let others speak is that this is a great thing that we're doing the recycling and getting things out of the landfill. But as we increase recycling and composting, aren't we also reducing revenues that, you know, less is going into the garbage and so so are you are these'",
        "'speaker_5': 'rates.'",
        "'speaker_8': 'That's a long term issue with what we call migration in our business, where people are going to smaller containers. That has to do with the collection rate structures and how they're structured. Most of the rate structures are based on structures that were built 15 years ago to promote recycling, so the recycling bin was free.'",
        "'speaker_8': 'Those days are going to change over the next ten years, but how that's going to happen, that's going to be in concert with the city.'",
        "'speaker_5': 'Not before us right now. All right. Thank you.'",
        "'speaker_0': 'Any other member questions at this point? I'm going to go ahead of speakers Ra Ra Ra Alvarado. Then William Dell and Ken Dell.'",
        "'speaker_6': 'I'm not going to see. Least got me to smile.'",
        "'speaker_7': 'Smart Rob Radio. I'm still the executive director of the Berkshire Business Association. I think the reason I'm here this evening is I go back to when I first got the franchise. And frankly, if memory serves me correctly, they were promised X number of residential units that were going to create X number of dollars of revenue.'",
        "'speaker_7': 'And that never happened. And they've kind of been chasing their tail ever since. I'm here to tell you, they are incredibly receptive to my organization and my members. They're not perfect. Human beings run the company. Human beings pick up the garbage and the recycle.'",
        "'speaker_7': 'But when there's a problem, we call them and they are incredibly receptive to dealing and addressing the problem. We we cut a deal with good ol Louie Pellegrini back there, waved to the crowd Louie about the garbage cans on Park Street.'",
        "'speaker_7': 'Those God awful, ugly and crappy green cans got turned out. We put in the plastic ones that can be picked up by the claw on a temporary basis. And because we placed them in areas that was easy to pick up with the claw, they start picking up five days a week instead of three days a week.'",
        "'speaker_7': 'And I think you will all agree, if you've been paying attention and I know the five of you have and you folks to thank you, that, you know, the whole overflow issue on Park Street and in the district has improved greatly.'",
        "'speaker_7': 'So I'm here to urge you. To give them the consideration they need. They're doing the best job they can, and I know they are. I believe that this deal that's been worked out between management and labor and I'm thrilled to death to see that.'",
        "'speaker_7': 'Seems they all seem to be on the same page. So, you know, I'm urging you to give them consideration. I think they're doing a terrific job. I will not bore you, Mayor Spencer or Councilmember Odie with my family tree of garbage until two weeks, because it's just too damn late to do that.'",
        "'speaker_7': 'But yeah, you're welcome. But if anybody in this room or who still maybe watching it on TV, if you think picking up garbage is easy, it ain't. And the only little kind of funny thing I will tell you is, you know, when my dad was a garbage man doing chemical in Oakland recycling was this, Hey, Ronnie, I'",
        "'speaker_7': 'got an old dead battery. What should I do with it? I'll throw it in the back of the truck. They're doing a great job. Give them the consideration they deserve. Thank you. Yeah. Oh, that's not. Morning. Morning, Madam Mayor.'",
        "'speaker_7': 'And Council. My name is William F now because I put the F because there's another William Doyle down the street from me that gets mixed up once in a while. And I'm a fourth generation Alameda and I own a house here and my boy had to leave.'",
        "'speaker_7': 'He was behind B, he'd be fifth and I'm getting here. I've been a member of Local Six since 1956 and I work 49 years active. I'm retired now for the last ten years and it's always been good to me.'",
        "'speaker_7': 'It's always been a good union that takes care of their people. And I'm here to support what Freda Becker has said here. And ACA ACA corrected their mistakes. We we were here at your council meeting here last year, the different council, and we pointed out some of the defects at ACA I had with the U.S. temp agency'",
        "'speaker_7': '. Since then, they've corrected that. And unfortunately, because of labor needs, I mean, the the workers need the to bring up the higher wages, the company will have to increase their wages because they're going to put out more money, you know, and once they once they correct that because they were the a lot of the money was going'",
        "'speaker_7': 'to what I call the robber baron, the temp agencies. They were stealing from those people and they were taking a huge amount of money from people that were working very hard, not getting any benefits. And I think they need them.'",
        "'speaker_7': 'And I hope your council members will take that into consideration and approve it. Thank you.'",
        "'speaker_0': 'Thank you. So does that mean Ken Dow is not here? All right. Thank you. The Reverend Yoshi them, Brooke Anderson and then Ava Zapata.'",
        "'speaker_7': 'At Mayor Council members Michael Yoshi, pastor with Buena Vista United Methodist Church and also resident of Alameda. There is good morning to you and there is no better place. I'd love to be at 12:35 a.m. that at the city council.'",
        "'speaker_5': 'And he wouldn't tell a lie, right?'",
        "'speaker_7': 'Yeah, I wouldn't. Well, at least for this issue. And I'm very pleased about the proposal and the recommendations that are coming forward to you. Most of you know, Buena Vista Church is 117 years old. You started in 1898 and serving immigrant populations.'",
        "'speaker_7': 'And in the course of the last couple of years, we've been doing a lot of work around immigrant community support, and that led us to meeting people who work at ECI because the majority of the workers there at ACR immigrant populations, and we've been very involved in the campaigns for living wage or equitable salaries and for better'",
        "'speaker_7': 'support of social equity for the place of immigrants in our communities. And many, many of the times you all know this, they're the people doing the jobs behind the scenes that you don't see visible but are really taking care of things for our communities.'",
        "'speaker_7': 'And so I was going to call you Congresswoman, ask the council member, ask him, I'm glad you went to HCI to see what they do. I've been educated by the job that they do to clean up the garbage we give them.'",
        "'speaker_8': 'You know.'",
        "'speaker_7': 'I heard a preacher once say Jesus was like a garbage man because he cleans up all our stuff, you know? It makes it good. Well, so these folks who do the cleaning up and the sorting out for us out of our recycling, do a tremendous job with you.'",
        "'speaker_7': 'Do. And it's not an easy job. And I'm just happy that I heard that through the collective bargaining arrangement and the work between management and labor, that they have a proposal before you now that can help with bringing them the equitable wages that they really deserve.'",
        "'speaker_7': 'And the benefits are not just for them. And we've heard it said also you raised the issue around the temporary agency issues. We had written a letter to ACA, I think, over a year ago about some of those issues.'",
        "'speaker_7': 'And that's why I'm pleased that they've responded and they have come to the table with with Labor to bring some solutions. And I really do think that this is a great model, an example of how people can work together.'",
        "'speaker_7': 'And so now takes.'",
        "'speaker_8': 'The city.'",
        "'speaker_7': 'To join that partnership and make this happen for not only for these workers and also for the company, but also for our community as well. I think the social gains that we reap from this will be immeasurable for us going forward.'",
        "'speaker_7': 'So I really want to just add the support for this proposal before.'",
        "'speaker_0': 'Thank you. Hi. Good morning. Mayor and city council members.'",
        "'speaker_1': 'My name is Brooke Anderson.'",
        "'speaker_0': 'I'm with the Movement Generation Justice and Ecology Project, which is a coalition member as well as a steering committee member of the Campaign for Sustainable Recycling in Alameda County. And I'm here tonight to support the rate increase that would go to gain RCI workers up to the Alameda.'",
        "'speaker_1': 'County Workers Standard. I have met a lot of the ECI workers.'",
        "'speaker_0': 'I was out on some of the picket lines in protests. Encouraging the.'",
        "'speaker_1': 'Company to get up to the living.'",
        "'speaker_0': 'Wage was with the workers. It wasn't even this late. I think.'",
        "'speaker_1': 'It was midnight when they.'",
        "'speaker_0': 'Voted.'",
        "'speaker_5': 'To join the union.'",
        "'speaker_1': 'And, you know, many of them were here tonight and I know would have wished to have been able to speak with you had they not.'",
        "'speaker_0': 'Have to wake up at 4 a.m. to get back to sorting the city's trash. And they do a very dirty, dangerous job. They're often sweating through needles and asbestos and diapers and dog feces, everything. You can imagine that people put into a recycling container and deserve our our respect and our support at the same time, day in'",
        "'speaker_0': 'and day out. All I think about is climate justice. What is it going to take to pull us back from the brink of ecological collapse as we see increasing droughts and heat waves and wildfires and floods and hurricanes that we have brought on with our irresponsible behavior toward the planet.'",
        "'speaker_0': 'And we know that transitioning our waste system from one of landfill and incineration toward one of zero waste policies is exactly part of that puzzle. And that recycling is essential to that. And these recycling workers, they are heroes of the climate justice movement.'",
        "'speaker_0': 'And we want to see them have fair wages and have respect and dignity and democracy on the job. Otherwise, the recycling work that they do is not sustainable at all and is really treating those recycling workers as the same trash that we know.'",
        "'speaker_0': 'And we know Alameda County is better than that. And I want to really urge you guys to do the right thing and increase the rates to support the workers wages. And I know I speak with I'm confident, I speak for the rest of our environmental partners in the coalition, folks like the Sierra Club, the Global Alliance for'",
        "'speaker_0': 'Incinerator Alternatives, and supporting that rate increase as well. Thank you. Thank you. Eva Zapata. Pablo Sanchez. Patricia Lambourne. Brian McDonald. Would you like to read it? Yes, please. Come on up. And then I think you're our last speaker.'",
        "'speaker_1': 'My name is Jamie Willis. I'm with the LW and I'm speaking for Patricia Lambourn, who had to leave earlier. My name is Patricia Lamborn. I have lived in Alameda at three, two, two, six and ten all avenue for the last 23 years.'",
        "'speaker_1': 'I have been grateful to live in a safe and clean city. I was proud when we added recycling to our garbage program. I'm always impressed with the kind and courteous work done by the ECI drivers. I believe they earn a fair wage and they should.'",
        "'speaker_1': 'I am shocked and saddened to hear that once removed from my home, workers dealing with the hard and dirty work of sorting are underpaid and have been cheated out of the living wages owed them. If we are proud to recycle and care about our planet, it includes the workers who do the work.'",
        "'speaker_1': 'I support the high recycling workers and their effort to achieve decent and fair wages, health care and safety and security in their work. I know I may see what should be a reasonable increase in my monthly garbage bill.'",
        "'speaker_1': 'I am willing to do that. It is a responsible and decent way to treat these workers. They make a valuable contribution to my community. I also support ongoing oversight of ECI in their employment practice and fair rate increases.'",
        "'speaker_0': 'Thank you for your attention. Thank you. Counsel comments and Brody.'",
        "'speaker_6': 'I'll try to be brief, but just because this is late doesn't mean that it, you know, it doesn't deserve the attention in the comments and it doesn't mean it's less important. So please bear with me if I go on a little bit long.'",
        "'speaker_6': 'So. I guess the question is pretty simply stated in the staff report. You know, we're being asked to pay our our fair share, our portion of the incremental increase of the wage and benefit increases. And I really I'm impressed by the way management, labor, the city, the banks are able to come together.'",
        "'speaker_6': 'And, you know, the first proposal we we saw was a $3 and two cent increase. And now, you know, you've all been able to work together and come up with $2.20. So I appreciate all that effort and all of that collective bargaining.'",
        "'speaker_6': 'And, you know, the comment that, you know, oh, what if there's a you know. Sorry. I'm a little bit late here. If you mechanize or eliminate one of the shifts and I pretty much I know Fred for a while and I pretty much have a lot of faith that he's going to be able to stand up and'",
        "'speaker_6': 'protect his workers. So I'm not too worried about that. You guys are going to have a worthy adversary in the ILWU. And as far as the point of, you know, if we get to the point where, you know, we have zero waste and recycling, I mean, that happens while I'm sitting up here.'",
        "'speaker_6': 'That's a problem I really would really like to have to have to face. So, I mean, that's kind of what our goal is. But I want you to talk a little bit about these workers. You know, I also had a chance to go to the murf, not not the HCI one, but the waste management one and the'",
        "'speaker_6': 'Callaway Solutions one. And I think to pay these employees, these workers $9 an hour, I mean, it's obscene when you see the work that they have to do. It's a hot, dusty, dirty place. They're all, you know, dressed in their clothes and their other gloves and stuff is coming down this conveyor belt.'",
        "'speaker_6': 'I mean, to me it's really fast and they got to pick out and they've got to sort everything, you know, they got to sort out the bottles, they have to sort out the plastic, they have to sort out the newspaper, they have to sort out the cardboard, you know.'",
        "'speaker_6': 'And then as one of the speakers mentioned, there's needles, there's human waste, there's body parts, from what I've heard at some places, and they're doing this work. And to pay them $9, again, I think that's obscene. And I'm glad that we're you know, we're taking efforts to to get these valuable workers up to a living wage.'",
        "'speaker_6': 'You know, when I first sat down with Fred and where he was talking about the challenges, you know, now we have workers that we're getting paid $9 an hour and not being able to afford to live here in the Bay Area.'",
        "'speaker_6': 'And they were on Medi-Cal now suddenly losing their Medi-Cal because they had an increase in in their in their wages. You know, that was great for for them. And it was even better that, you know, they were able to look to ILWU and I did the right thing and agreed to give them benefits.'",
        "'speaker_6': 'And, you know, I did my rant earlier about, you know, how the taxpayers are subsidizing, you know, these labor costs and. I'm just really excited that we're doing the right thing, that Akai is doing the right thing. And I would encourage any of my colleagues and I don't want to prejudge.'",
        "'speaker_6': 'And if you haven't been to the Murph and seen the work that that these recycling orders do, I mean, I would encourage you to go out there and do it. And and even members of the public that, you know, think that maybe they're a little uncomfortable paying 220 versus $0.80, but maybe I could work on, you know'",
        "'speaker_6': ', some type of tours where where people can actually come in and and understand the hard work and respect all of the efforts that all these recycle workers are doing. So I want to thank everyone for all their hard work on this every day.'",
        "'speaker_3': 'So I have a quick question on attachment. One of the detailed staff report, the H e, the consultants economic analysis. I see that, you know, R as single family residential 20 gallon could potentially go up to $29.26 a month or $30.'",
        "'speaker_5': 'Through your Exhibit one.'",
        "'speaker_3': 'Attachment. Exhibit three. Exhibit three and then go down to attachment one, page 15 of 16. So when I look at that and I look at cities like San Leandro, you have their 20 gallon down at 21.6 or or Livermore, their 20 gallon is at 1936.'",
        "'speaker_3': 'I just want to make sure that we're not the only city who's going to be doing good. I mean, I don't want I don't want Livermore or San Leandro who are part of the HCI community for rewriting on us and what would explain why their rates are so much lower than ours?'",
        "'speaker_6': 'We asked this early.'",
        "'speaker_8': 'I know the other cities were asking them the same thing to do special rate views and increase their rates just as well. I were trying to ask everyone to increase their rates based on their fair share, which is the tonnages.'",
        "'speaker_8': 'Our meters, about 31% of the tonnage. Livermore has more. San leandro is actually less. There's different dynamics in the different cities as far as how rates are developed. For example, in san leandro, they have a very large industrial base that usually subsidizes residential rates, much more so than in Alameda.'",
        "'speaker_8': 'And those rates are set based on that sort of thing. Livermore has a lot cheaper landfill fees.'",
        "'speaker_7': 'There than we do here.'",
        "'speaker_8': 'You know, the landfill fees out there are about $45 a ton, whereas here they're.'",
        "'speaker_7': '$80. $85 a.'",
        "'speaker_3': 'Ton. Well, thank you. I think well, I think what what we really need to see is we got to make sure that we're not getting reloaded on. Yeah. And we need to separate. We'll need to see the details.'",
        "'speaker_3': 'Quite frankly, that's the purpose of tonight, is to ask the questions, gather the information.'",
        "'speaker_0': 'Okay. Thank you. Do you have any other questions at this point?'",
        "'speaker_3': 'Oh, no. I think the residents of Alameda clearly want us to do this. Don't get me wrong. I think they do. I think the residents input an additional. With dollars and $0.20 in the context, I think they can.'",
        "'speaker_3': 'But by the same token, I think the residents also want us to make sure that San Leandro or Livermore isn't free riding on us. And likewise, I'm sure we wouldn't want a free ride on them. So what we need is if I sounded a bit snippy, we just need the information.'",
        "'speaker_3': 'I appreciate all the work that ACA has done for Alameda all through the years, and I know that every time ACA comes by my place, you know, the driver is really nice and friendly. We always say hello. And I also I just want to also quickly say I appreciate his executive director, Rob Ratto, coming out here and'",
        "'speaker_3': 'voicing his opinions. And he did. And I certainly appreciate it. I understand the background and understand this industry. If I sounded snappy, please read it to the hour. So but I think I think the residents would like to see this done.'",
        "'speaker_3': 'They also want us to gather the information.'",
        "'speaker_0': 'Thank you. Any other comments?'",
        "'speaker_2': 'I think paying the fair wage and getting the benefits us and and our fair share and I think that follows on how some member states are set.'",
        "'speaker_0': 'Member Ashoka.'",
        "'speaker_5': 'And I would also echo that, that I think if, you know, nobody likes to see their bills go up. But I think that we also want to know that we're not creating a hardship for people to live and work in this area and we want to do the right thing.'",
        "'speaker_5': 'And I concur with remember days ago when these numbers come back, we want to see clearly where all the increases are going. I do want to commend ACA about this pilot program on the multifamily bulky pick sets for anybody who's going to watch this on tape because they're not still up tonight.'",
        "'speaker_5': 'But, you know, we see this problem with couches and furniture being abandoned on the the streets, which is illegal, by the way, don't do it. But some of the problem was that the if you were above a certain number of units, like four, you didn't get a large dumpster.'",
        "'speaker_5': 'Now this is going to change. And how soon can we anticipate that, by the way? You're going to work it out. So by the time you come back on, the 21st will have a date. But by July 1st, we can expect that.'",
        "'speaker_5': 'Okay. So anyway, I bet. And also, Reverend Yoshi, thank you for your your remarks. They, I think, really were just spot on. And it is commendable to see all these different entities working together, labor, the company and the banks.'",
        "'speaker_5': 'So thank you all for your participation.'",
        "'speaker_0': 'Okay. And I also want to thank you all for actually still being here at 10 minutes to 1 a.m.. My comments go to first of all, I'm looking forward to seeing the report in advance. I appreciate that there was apparently negotiations that brought the rate down.'",
        "'speaker_0': 'I was concerned about the higher rate of up to $57 per year. I would like to see the annual included, not just the monthly when this comes back with the different options or whatever. How are you going to break it down but also include the annual.'",
        "'speaker_0': 'I thought the member Ashcroft raised a good point earlier in regards to the amount that the company was paying to the. To the temp agency. That needs to be discussed here because that was the out of pocket before, regardless of the rate that the employees are receiving, is higher.'",
        "'speaker_0': 'But the temp agency, it's my understanding and this is what I want to have come back in writing. I want to know what the temp agency was charging, what the company was paying out of pocket then, because it's my understanding that there's been a shift that now that temp agency has been taken out of the equation, leaving'",
        "'speaker_0': 'money, more money available than to go to the employees to cover the employees wages without necessarily increasing the out-of-pocket cost to the company. So I want to see those numbers come back. So I think that that's very legitimate because and I want to know exactly what the temp agency was being paid, for instance, in the past year'",
        "'speaker_0': '. I'm not sure how long this contract has been, but I want to know what the temp agency was being paid because that's no longer being paid. A concern I have is that the company should not be profiting from this, and I cannot tell from these numbers.'",
        "'speaker_0': 'The. On one of these pages, it says, okay, so I want to see the annual increase, but it speaks to a net income for the company. It does not tell me what the gross income is. And this memo from HCI on page two of five, it speaks to net income depreciation and whatnot.'",
        "'speaker_0': 'I can there's no gross income here. So that to me is missing because I cannot tell what the profits are from the company separate from the wages and in order. And at the same time whether or not $2 me or $2.20 may or may not seem that significant.'",
        "'speaker_0': 'We're talking about an annual basis and then we're talking about year after year. So it's important to me that this not result in a revenue increase or that that be shown clearly that we are asking our our homeowners and businesses to pay more to increase it.'",
        "'speaker_0': 'So I need to know how it impacts the company. I can't tell from what's provided here what the. We know what the wages are of the people that are picking up the trash. That's what we've been hearing. I have yet to hear how much money the corporate corporate earned.'",
        "'speaker_0': 'I don't see any disclosure. So without that, I'm I actually can not necessarily support the rate increase because from what I can tell, they were paying the temp firm before. And now all that money is going to the employees because the middle man has been eliminated.'",
        "'speaker_0': 'But but it's important. And we all hear continually, continually, unfortunately, that there are people that are being pushed out of our community because they cannot afford the increases. And we are expecting water to go up. We've had rents go up, then this going up.'",
        "'speaker_0': 'It needs to be justified that it clearly does not result in an increase to the company. And with these numbers here, I think it's been sufficient. And then I also. So the regional rates, I think that that needs to come back clearly within the presentation.'",
        "'speaker_0': 'It was on page 15 of 16 on exhibit three. And then there's also a statement in regards to the balancing account that there's a -$1.66 million that I believe the city owes ACA and that needs to be addressed.'",
        "'speaker_0': 'What is the plan to address that? I don't I saw the statement in there, but I don't see any comments in regards to how we're addressing that and that obviously that's an issue. It appears that there is a reduction in that amount of $371,000.'",
        "'speaker_0': 'However, if here we have a company that appears to be struggling, they're coming to us to ask for more money. And it appears that the city owes them two thirds of $1,000,000. So that that's something that I think should be addressed.'",
        "'speaker_0': 'All right. Any other comments? Thank you very much. And we have one more agenda item. Well, actually seven. City manager. Did you have communications?'",
        "'speaker_7': 'Yes. I'd like to go to bed now.'",
        "'speaker_0': 'All right. Eight. Sorry. A few more minutes. Eight. Oral communication on agenda. Do we have any more those? No. All right, now.'",
        "'speaker_5': 'I need to announce that I attended the last.'",
        "'speaker_6': 'That's.'",
        "'speaker_5': 'That's. That's a public vote.'",
        "'speaker_0': 'We're not quite there yet. Nine a we have a council referral, and I'm going to hand it off to member de Saag.'"
    ]
}