{
    "Grant for Preserving Bostons Voices Project.": [
        "'speaker_0': 'Thank you. Docket 093530937 will be referred to the Committee on Public Safety. Criminal Justice. Mr. Clerk, can you please read docket 09380938 message?'",
        "'speaker_1': 'An order authorizing the city of Boston to accept and expand the amount of $39,155 in the form of a grant for the recording risk grant awarded by the Council on Library and Information of Information Resources to be administered by the Office of the City Clerk.'",
        "'speaker_1': 'The grant will fund the preserving Boston's voice, this project digitizing the Boston 200 Community Oral History Collection.'",
        "'speaker_0': 'Thank you. The Chair recognizes Council BLOCK Chair of the Committee on City Services and Innovation Technology Council of Barking of the Floor.'",
        "'speaker_4': 'Thank you so much, Mr. President. On behalf of the committee, I'm seeking a suspension of passage of this docket today. It's obviously less than $40,000. But I wanted to inform the the council about what it's really for. So this project, it was described in the brief description as preserving Boston's voices, digitizing the Boston Community Oral History collection'",
        "'speaker_4': '. But the details on that is actually that the city archives that they want to provide digital and public access to this community. Oral history recordings, which were created by the Boston Bicentennial Commission between 1974 and 1976, in which period the Commission recorded oral histories with a wide cross-section of Boston's residents, including members of Boston's black and immigrant'",
        "'speaker_4': 'communities. Due to their age and over a decade of storage and poor environmental conditions, these tapes are at serious risk of degradation and cannot currently be accessed. Transcripts and partial transcripts exist for approximately half of the recordings and show the interview.'",
        "'speaker_4': 'Content includes immigration, the African-American experience in Boston, Boston's social movements, urban renewal and a wide variety of local history topics. This project will preserve the recordings through digital reformatting, produce descriptive metadata for the recordings and make the recordings available to the public in the Boston City Archives Digital Access Portal.'",
        "'speaker_4': 'So I think it's a really important, vital project. It's also exciting because it's the type of thing that we'd like to do 50 years on today, doing a bunch of oral interviews with Bostonians in the coming years. So it's a it's a nice model for us.'",
        "'speaker_4': 'I've had the chance to read a few of the transcripts from these, and they're just like so full of detail of kind of Bostonians perspective on their lives back in the seventies. And I just want to commend our archival staff has done an exceptional job applying for grants.'",
        "'speaker_4': 'They really hold a really precious treasure trove together a little bit too much with duct tape and chewing gum. And I'm hoping that a design process that we're currently in is going to give them some better facilities overall.'",
        "'speaker_4': 'But in the meantime, they've secured this obviously relatively small grant, and we wouldn't want to lose any of those tapes. And so I hope that the council can support this motion for suspension passage. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Counsel. BLOCK each seek suspension of the roles and passage of docket 0938. All those in favor say I oppose. Same day the ayes have it. Docket zero 948 has passed. Mr. Clerk, can you please read docket.'"
    ],
    "Reauthorization of the Sheltered Market Program for City Contracting.": [
        "'speaker_1': '09390939 message in order for your approval, in order to fully authorize the creation of a sheltered market program during the pilot, which ended on June 2022, we learned that this is a powerful and necessary tool to advance our administration's mission to foster equity in city contracting.'",
        "'speaker_1': 'Following the success of the sheltered market program is critically important to our larger efforts to ensure that Boston is an economically equitable city that offers opportunities for our communities to build wealth. To that end, I request that the Council reauthorizes the sheltered market program for an additional three years.'",
        "'speaker_0': 'Thank you. The Chair recognizes Council Arroyo, Chair of the Committee on Government Operations Counsel. Arroyo, you have the floor.'",
        "'speaker_3': 'Thank you. President Flynn As Chair of government operations, I am seeking suspension of Rule 33 so this matter could be adopted. This order was sponsored by Man Michel, who and first introduced his body on December 1st, 2021, and passed unanimously, unanimously on December 15th, 2021.'",
        "'speaker_3': 'This order authorized the creation of a sheltered market program as a pilot tool with the purpose of advancing equity in city contracting pursuant to Massachusetts General Laws. Chapter 30 B 18. A sheltered market program allows the city to designate certain contracts for procurement from one or more classes of disadvantage vendors.'",
        "'speaker_3': 'The purpose of a sheltered market program is to create an environment that allows for small, local and diverse businesses to build their capacity to complete to compete on contracting opportunities. This pilot program was conducted as a close partnership between the administration and Finance and Economic Opportunity and Inclusion Cabinet.'",
        "'speaker_3': 'Within a short timeframe, the city was able to award more than 700,000 contracts under the pilot program. Due to the success of the pilot program and as chair of the Government Operations Committee, I recommend that we take this up today and suspend in pass.'",
        "'speaker_3': 'Thank you. Council President Flynn.'",
        "'speaker_0': 'Thank you, Councilor. I think suspension of the rules and passage of docket 0939. All those in favor say aye. Aye. All right. All opposed. Nay. The ayes have it. The docket is passed. Reports of public offices in others.'",
        "'speaker_0': 'Mr. Clark please report could see over 94020949 together please.'",
        "'speaker_1': 'Duncan number 0940. No. This was received from the mayor of her absence from the city on Saturday, July 16, 2022, at 7:35 p.m. until Wednesday, July 20th, 2022, at 5:05 p.m.. Duncan number 0941 notice was received from counsel and we hear of her absence from the August 10th, 2022 meeting.'"
    ],
    "Mayor's Action on City Council Papers of July 13, 2022.": [
        "'speaker_1': 'Effective July 25, 2022. Lucky Number 094. A notice was received from the City Clerk in accordance with Chapter six of the ordinances of 1979 regarding action taken by the Mayor, a point taken by the Mayor on papers acted upon by the City Council at its meeting of June 29th, 2022, in docket number 0949.'",
        "'speaker_1': 'Notice was received from the City Clerk in accordance with Chapter six of the ordinances of 1979 relative to action taken by the Mayor and papers acted upon by the City Council at its meeting of July 13th, 2022.'",
        "'speaker_0': 'Thank you. Dockets. Docket 0940. To. She recognizes counsel theory just with respect to dark as 0944. I'm of the opinion I believe that the Boston Employment Commission I believe it requires you to be a resident of the city of Boston to serve on the Boston Employment Commission.'",
        "'speaker_0': 'So at the very least, we could just maybe put that aside until we get confirmation, given that the appointee is from Quincy. Thank you, Mr. President. Anyone else have any further comments on this issue?'",
        "'speaker_5': 'I was so excited.'",
        "'speaker_0': 'That she recognized this council. Fernandez Anderson. Council. Fernandez Anderson. You have the full.'",
        "'speaker_6': 'Council clarity you're referring to Darren.'",
        "'speaker_7': 'How correct.'",
        "'speaker_6': 'He's a constituent in my district and lives in my district. I doorknocked his home at least three times. I can confirm that he lives there, but if we need further documentation, I guess.'",
        "'speaker_0': 'Through the chair to my colleagues, so is when he is at Quincy Street.'",
        "'speaker_6': 'Oh.'",
        "'speaker_0': 'That's it's it's listing address of Quincy, Massachusetts, which also technically could be the address of the union that he works at. So again, I just perfect it very good. So if through the administration they can just clarify and resubmit with his correct address as opposed to his business address, given that he's going serving on the bison.'",
        "'speaker_0': 'And I know Darrell Darrell actually served here as a member of the council, very thoughtful, fine, hardworking gentleman. But with respect to the Boston employment question, I believe you have to be a resident of the city of Boston.'",
        "'speaker_0': 'He clearly is a resident city boss. It looks like it might be a typo here or they might just need to put his soul. May understand. Thank you. Thank you. Council clarity for bringing that to our attention. Um, Mr. Clarke, can we, um, hold that docket on, put it on file until we get some further clarification?'",
        "'speaker_0': 'They all go through one file. We'll just get a. Okay. Thank you, Doctor. 094020949 will be placed on file, and we will review that with an updated letter from the mayor's office as well. Mr. Clark, please read Dr..'",
        "'speaker_1': '095009502 Constable Bonds for Carla Arias. Dominique Chester, Inez, Chester, John Console, Tamika Dash and Mark Weissberg has been duly approved by the collector treasurer where received and approved.'"
    ],
    "Federal Grant for Fire Department Safety Training and Fitness Equipment.": [
        "'speaker_1': 'be administered by the police department, the grant will fund two full time domestic violence advocates who will work with social service agency partners at the Boston Public Health Commission. Family Justice Center submits a report recommending that the order to pass and docket number 0375 the Committee on Public Safety and Criminal Justice, to which was referred on March'",
        "'speaker_1': '16, 2022. Docket number 0375 message in order authorizing the City of Boston to accept and expand the amount of $555,166.40 in the form of a grant for the federal fiscal year. 20 Assistance to firefighters grant awarded by the Federal Emergency Management Agency to be administered by the fire department.'",
        "'speaker_1': 'The grant will fund safety, training and fitness equipment to support officer health and wellness submits a report recommending the order to pass.'",
        "'speaker_0': 'Thank you. The Chair recognizes Counsel of Clarity, Chair of the Committee on Public Safety and Criminal Justice Council Flannery over the fall. Thank you, Mr. President. The committee held a hearing on July 26th on the aforementioned public safety dockets that were just read into the record by clerk justice to be administered by the Boston Police Department in'",
        "'speaker_0': 'the Boston Fire Department. And it was sponsored by Mayor Wu. The dockets 0274 and 0349 will be administered through the police department with the support of valued and trusted community partners. The Shannon Grant will fund regional and multiple multidisciplinary approaches to combat gun violence through coordinated prevention and intervention, law enforcement and reintegrated programs.'",
        "'speaker_0': 'The community partners for this grant are selected through a competitive RFP process and they include the Boston Public Health Commission, Boston Center for Youth and Families, BMC and VAP, among others. There has been an increase in investment to $350 per young person Docket 0349.'",
        "'speaker_0': 'That grant will fund, as mentioned, two full time domestic violence advocates who work with social service agency partners at the Boston Public Health Commission and the Family Justice Center. And it was explained during the hearing that these advocates will reach out to victims of domestic violence and provide services, including assistance with obtaining restraining orders.'",
        "'speaker_0': 'BPD explained that the advocates will be located in District B two and B three and will be providing assistance in District C-11. With respect to the docket 0348 and 0375, those grants will be administered by the Boston Fire Department.'",
        "'speaker_0': 'Target 0348 will fund decontamination equipment, vehicle and maintenance expense for the hazard response team over at the Boston Fire Department and docket 0375. That grant will fund safety, training and fitness equipment to support the Officer Health and Wellness Program, which was also referred to the committee back on March 16, 2022.'",
        "'speaker_0': 'As a result of the public testimony hearing as Chair of the Committee on Public Safety and Criminal Justice, I recommend the following docket starting 0274.4034820349 and docket 0375 pass. Thank you, Mr. President. Thank you, Counsel, for clarity. We will take a vote on the counsel 36 acceptance of the committee report and passage of docket 0274.'",
        "'speaker_0': 'All those in favor say aye. Opposed say nay. Talk of 0274 as passed counsel clarity six acceptance of the Committee report and passage of docket 0348. All those in favor say I opposed say no docket 0348 has passed counsel clarity six acceptance of the Committee Report and passage of docket 0349 All those in favor say I am'"
    ],
    "Grant for Dialogue to Action Program by the Office of Resiliency & Racial Equity.": [
        "'speaker_0': 'opposed, say nay talk in 0349 has passed counsel clarity six acceptance of the Committee report and passage of docket 0375 All those in favor say I. Our policy document 0375 has passed. Mr. Clerk, please read.'",
        "'speaker_1': 'Dawkins 0351 Duncan Hunter 0351. The Committee on Civil Rights and Immigration Immigrant Advancement, to which was referred on March 9th, 2020, to talk a number 0351 message in order authorizing the city of Boston to accept and expand the amount of $36,250 in the form of a grant for the dialog to action awarded by the Boston Redevelopment Authority'",
        "'speaker_1': 'to be administered by the Office of Resiliency and Racial Equity. The grant will fund four program from programmatic activities to deepen participants understanding of racism in historical and present day forms and foster a sense of agency to change the system through actions that individual, interpersonal or systemic levels.'",
        "'speaker_1': 'Submits a report recommending that the order ought to pass.'",
        "'speaker_0': 'Thank you. The Chair recognizes counsel and chair of the Committee on Civil Rights, Immigration Advancement Counselors and your support.'",
        "'speaker_6': 'Thank you, Mr. Chair. This matter was sponsored by Mayor Michelle Wu and referred to the Committee on March nine, 2022. The committee held a hearing on July 21st, 2022, where public comment was taken and where President Flynn was present.'",
        "'speaker_6': 'This grant will allow the Office of Resiliency and Racial Equity to use these funds through the dialog to action for programs to provide education and understanding of racism in historical and present day forms. The grant will seek to develop ways to make changes through action.'",
        "'speaker_6': 'Lori Nelson, Chief Resilience Officer from the Mayor's Office of Resilience and Racial Equity, attended the hearing and has provided support of the grant. Ms. Nelson explained that the grant will be used for community impact projects, which will examine how the community looks at reality and race matters to collectively move forward.'",
        "'speaker_6': 'I inquired about the Dialog Action Initiative, which is a pilot program, and Nelson explained that Dialog Action provides education on race matters, has two staffers and also uses fellows, as Nelson reviewed some of the external partners, which include King Boston.'",
        "'speaker_6': 'Many of us are familiar. Ms.. Nelson described the takeaways from the initial pilot program, which included the following the importance of having historical place places of race in Boston and supporting cultural differences through an inclusionary approach. Unifying the community around difficult topics and creating safe spaces so that people have a place for their voices to be heard'",
        "'speaker_6': '. And I asked her specific neighborhoods were targeted in these pilot programs. Ms.. Nelson explained that the goal in the initial framework was to target every neighborhood and that through coalition building, the objective is to target neighborhoods that may not have had these types of conversations.'",
        "'speaker_6': 'And I asked if any barriers existed to execution in the programing and the programs or discussions will be in person. And we had a robust and really interesting conversation about the work that trying to do around having those citywide conversations.'",
        "'speaker_6': 'The committee discussed the information and education are key components of dialog to action initiative and comment from the public to discuss civil rights matters in general. Passage of this order will allow the office to use these funds to support the continuing pilot for dialog action objectives.'",
        "'speaker_6': 'Having these funds will allow for expansion and continuation of programs and resources to help better understand racism historically in present day and to implement personal and systemic changes. The Chair of the Committee on Civil Rights and Immigrant Advancement, to which this following is referred, I submit a report recommending that this docket ought to pass.'",
        "'speaker_6': 'Thank you, Mr. Chair.'"
    ],
    "Home Rule Petition on Electronic Absentee Ballots for Uniformed Services Voters.": [
        "'speaker_0': 'Thank you. Consultation. Consultation seeks acceptance of the committee report and passage of docket 0351. All those in favor say I am opposed. Say no. Docket 0351 is passed. Mr. Court, can you please read docket.'",
        "'speaker_1': '0682068 to the Committee on Government Operations, to which was referred on May 25th, 2022, docket number 0682. Or for a home rule petition regarding electronic application and transmission of absentee ballots for absent uniformed service services voters submits a report recommending that the home rule petition are to pass in a new draft.'",
        "'speaker_0': 'Thank you. The Chair recognizes Counsel Arroyo, chair of the Committee on Government Operations Counsel. Arroyo You have the floor.'",
        "'speaker_3': 'Thank you. Counsel President Flynn The Committee on Government Operations had a working session on July 14, 2022, on Docket 0682, a petition for a special law relative to an act on electronic application and transmission of absentee ballots for absent uniformed uniformed services voters, which was sponsored by Councilor Evan Murphy.'",
        "'speaker_3': 'And at Flynn, I would like to thank my council colleagues for attending Counsel Murphy and Counsel Louie ten. I'd also like to thank members of the administration Robert Santiago, Commissioner of the Mayor's Office of Veteran Services. Anita Tavares, Commissioner of the Boston Election Department.'",
        "'speaker_3': 'And Sabino Piemonte, head assistant Registrar of Voters for the Boston Elections Department for their participation, as well as the law department for reviewing and providing language suggestions in preparation for the working session. This home rule petition would authorize the city of Boston to allow absent uniform services voters defined as those located outside of their voting district.'",
        "'speaker_3': 'For absentee ballots electronically. During the working session, we heard from the administration on the limitations of snail mail when sending ballots to uniformed services voters, including the amount of time and the potential changes in assignments and locations. Additionally, to ensure we included all branches of our armed forces, the Air National Guard and the Army National Guard were'",
        "'speaker_3': 'added to the second whereas clause as well as including overseas citizens. So the title to the title as did not exclude similarly situated individuals protected under the federal law the Uniformed and Overseas Citizen Absentee Voting Act. Lastly, the Committee reviewed the changes by the law department, which was only adding the phrase a secure electronic voting system.'",
        "'speaker_3': 'In the second section of the second sentence of section one before the word email. As Chair of the Committee on Government Operations, I recommend that this docket ought to pass in a new draft. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Counsel Royal. The chair recognizes counsel and Murphy. Counsel. Murphy. You have the floor.'",
        "'speaker_2': 'Thank you, President Flynn. And thank you, Chair Arroyo, for your leadership. And I won't repeat what you said. We did have a great session to work through the language and make sure that, as you know, Massachusetts citizens have a right to vote in all elections, even if they're deployed or stationed overseas.'",
        "'speaker_2': 'And this is going to help those who are overseas make sure they're able to vote. So the uniformed and Overseas Citizen Absentee Voting Act is a federal law that guarantees voting rights for the United States military, who are known as uniformed service voters.'",
        "'speaker_2': 'So I am also urging our my colleagues that we pass this home rule petition so that we are allowing our military to vote when they're out of their district. So thank you very much.'",
        "'speaker_0': 'Thank you, Councilor Murphy. I will speak very briefly on this. I just want to echo what Counsel Murphy, Counselor Arroyo, highlighted the importance of making sure that military personnel serving overseas have the same rights as anyone else does in the state.'",
        "'speaker_0': 'So this would be a tremendous opportunity accomplishment for service members so that they can vote electronically while they're in various other locations outside of the United States. I want to thank my city council colleagues for supporting this. I want to say thank you to my city council colleagues for supporting veterans issues.'",
        "'speaker_0': 'I want to say thank you also to may as well as well and Commissioner Santiago for their important work as well. Counsel Arroyo seeks acceptance of the committee report and a new draft and passage of Docket 068. To all those in favor, say I like you.'",
        "'speaker_0': 'Mr. Clerk, can we take a roll call? Vote, please.'",
        "'speaker_1': 'Roll Call vote on docket 0682. Councilor Arroyo. Yes. Councilor Arroyo. Yes. Councilor Baker. Councilor Baker. A council book. Councilor book. Councilor Brady. Councilor Brady. Councilor Coletta. Councilor Coletta. Yes. Councilor Fernando Sanderson. Councilor for an sense. And yes. Council 30.'",
        "'speaker_1': 'Yes. Council three. Yes. Councilor Flynn. Yes. Councilor Flynn. Yes. Council Lara. Lara yes. Council Illusion Councilors and yes. Council. Let me here. Councilor Murphy. Councilor Murphy. Yes. And Council. World. Yes. Council. World. Yes. You.'",
        "'speaker_0': 'Thank you, Doctor. 0682 has passed and a new draft. Mr. Clark, can you please. 3086240685 together, please.'",
        "'speaker_1': 'Economy 060862 The Canadian Suit City Services Innovation Technology, to which was referred on July 13, 2022. Docket number 086 to message in order for your approval in order to reduce the fiscal year 22 appropriation for the reserve for collective bargaining by $145,115.'"
    ],
    "Supplemental Appropriation Order for the Property Management Department for FY23 Collective Bargaining Agreement with MPPA.": [
        "'speaker_1': 'NPA submits a report recommending that the report ought to pass in docket number 0865, the Committee on City Services and Innovation Technology, to which was referred on July 13, 2020 to Lucky Number 0865. Message In order for a supplemental appropriation order for the Property Management Department for fiscal year 23 in the amount of 108,005 $158 to cover'",
        "'speaker_1': 'the fiscal year. 23 costs contained within the collective bargaining agreements between the city of Boston and the Municipal Police Patrolmen's Association and PPA. The terms of the contract include base wage increases of 2%, 1.5% and 2% to be given in each of in October of each fiscal year of the contract term filed in the Office of the'",
        "'speaker_1': 'City Clerk on July 11, 2022, submits a report recommending that the report ought to pass.'",
        "'speaker_0': 'Thank you. The Chair recognizes Council BLOCK Chair of the Committee on City Services Innovation Technology Council. You have the floor.'",
        "'speaker_4': 'So much, Mr. President. As is mentioned in the committee report, we held a hearing on this on July 18th, 2022. All four of these dockets per usual with collective bargaining pairs of dockets where we both would take the money out of the existing reserve and then attribute it to the appropriate department.'",
        "'speaker_4': 'The two ones up for consideration here are the school traffic supervisors who manage folks what crossing the street are kids when they go to veeps. And then the municipal police officers who folks so well. One of their main stations obviously is city hall and we pass them every day.'",
        "'speaker_4': 'Both contracts follow the pattern of the recent round of contracts of 2%, 1.5% and 2% raises over the three years of the contract. Remind the Council that because these have been out of contract for a while, most of those are retroactive payments.'",
        "'speaker_4': 'And the last one is effective this September. And obviously a number of these will be up in the near future. And so one thing that's come up with many of these is sort of the question of does that really reflect the inflation and the competitiveness of our labor situation right now?'",
        "'speaker_4': 'And I think one of things the administration said is, you know, we've got another round that are coming up soon enough with that are, you know, about the kind of years going forward. Both of them have a one time lump sum payment, non precedent setting kind of.'",
        "'speaker_4': 'It's something that's been done for a bunch of our civil unions to kind of just acknowledge the difficulty of this work over the last few years. So in the case of the municipal officers, it's a $1,000, one time lump sum payment minus standard deductions.'",
        "'speaker_4': 'And then for the traffic supervisor to which is a part time role, it's 375 minus standard deductions. The agreement also updated the military leave policy for in the same way that some other prior ones had. And it was basically just realigning us with the way that the feds had rewritten that and making it a little bit more'",
        "'speaker_4': 'supportive and generous to our our members who might be doing military service. And then the the traffic supervisors one codifies the COVID vaccine policy. That's not. Part of it on the municipal one because it had already been done without union prior to this agreement.'",
        "'speaker_4': 'And then the municipal officers.'",
        "'speaker_6': 'Also.'",
        "'speaker_4': 'The city of Boston, paid parental leave policy and the addition of Juneteenth as a as a holiday for them were both formalized. Again, neither of those provisions are in with the traffic supervisors because it's part time work, not a full time.'",
        "'speaker_4': 'I think we were joined by Councilors Murphy, Brayton and Flynn at the hearing. Thank you to my colleagues for joining. And I think just a kind of overall theme on both of these fronts was that, you know, the council councilors in attendance certainly felt like the municipal police officers and the traffic supervisors are not paid enough.'",
        "'speaker_4': 'And that with traffic supervisors, you know, obviously, if those positions go unfilled, we see you know, we don't we don't have folks supervising those crossings to school. And it's really important to us that they be safe. And then our municipal police officers, we have a substantial number of vacancies right now.'",
        "'speaker_4': 'And so there's also a small increase to the the base rate for them on details that they do, which are somewhat different from the details that the D does. But I think the basic view that their their jobs have changed a bit with the passage of the Police Reform Act last year.'",
        "'speaker_4': 'And and that also has caused cause a lot of turnover. And so thinking about in the same way that we are with the park Rangers, how we make those really competitive, appealing jobs going forward and making sure that they're doing the things that the city wants, wants those roles to be doing is, as I said, they're really'",
        "'speaker_4': 'important folks that welcome here in the building. So that was sort of all kind of on the table for future conversation and just wanted to raise it here. But my recommendation today would be that all four of these dockets pass through council.'",
        "'speaker_4': 'Again, they're very much in line with the other ones that we've been considering and passing, and that does leave our collective bargaining reserve overall at 4.7 million for FY 22 and 75.3 million for FY 23. So thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Thank you, counsel. BLOCK Would anyone else like to speak on these matters before we take a vote? I just I just wanted to highlight and thank Council BLOCK for having these hearings. We have a lot of municipal workers that are low paid workers.'",
        "'speaker_0': 'We expect them to live in the city with the residency. Municipal police officers, I believe, are making like $16 or $17 an hour. We had we hired several recently and they they left they quit at the at the first day because because the salary is so low.'",
        "'speaker_0': 'This is this is certainly something we support a pay raise for those dedicated workers. But it's really it's really not enough. It's almost it's almost embarrassing. And in my opinion, we need to do a better job of paying our municipal police officers.'",
        "'speaker_0': 'They protect us here in this building. Most of them, I think 60% of them are officers of color. And we owe it to these workers to give them a decent wage and treat them fairly and treat them with respect, but giving them 15, $16 an hour and making them live in the city.'",
        "'speaker_0': 'That's a recipe for disaster. Let me recognize Councilman Murphy. Councilor Murphy, you have the floor.'",
        "'speaker_2': 'To President Flynn, and thank you, Councilor Buck. I just want to go on record to say that I hope that the administration and us as a council will have more conversations. And this will prompt us to highly consider raising wages for the lowest paid workers who are struggling to live here in the city.'",
        "'speaker_2': 'The salary structure we have is just not enough to attract talent, especially with such high inflation, skyrocketing gas prices and a booming real estate market. Many departments are struggling to find new hires and keep them. And we need to give back to our council workers, our city workers.'",
        "'speaker_2': 'We are running a city government and we need all hands on deck and we have to provide fair wages to our hardworking staff so that we can continue to succeed together. And I assume it will. But when we have the working session on our own raises and the mayor's raisers raised, I hope that we talk about all'",
        "'speaker_2': 'of the city employees. And I know I was there one day, and I know the mayor and other councilors have showed up to Starbucks and other youth workers across the city that we do want to advocate for and make sure that they have a living wage.'",
        "'speaker_2': 'But if we're fighting for our baristas at the coffee shops across the city, I do believe we should also be standing up and fighting for our municipal police and the workers that are here in city hall and across the city keeping our city running just like we are.'",
        "'speaker_2': 'So I just want to go on record and say that.'",
        "'speaker_0': 'Thank you. Thank you. Councilor Murphy. The chair recognizes Councilor Baker. Council Baker. Thank you all just. Well.'",
        "'speaker_3': 'Thank you, Mr. Chair. Just want to kind of reinforce what you had said and what Councilor Murphy had said. We need to look at the structure and the way we pay it. And we're just talking about the security guards now.'",
        "'speaker_3': 'It's across the board in the city. I come from a city city department background and the step raises are out of line. The entrance isn't enough at $16, I think we said then when someone goes through on the steps, they're still only at 23 or $24.'",
        "'speaker_3': 'So we need to and we are on a level unable or not allowed to have those discussions. So however we however we communicate that this is important to us, that we need to look at step raises and increasing those, especially in this time when we talk about needing to attract talent at at higher levels.'",
        "'speaker_3': 'And I totally agree with that. We need to pay more at the higher, higher level to be able to attract real talent here. And our raises are a little kind of separate from that. But to be able to attract talent, it needs to start at the bottom increases all the way up.'",
        "'speaker_3': 'We've we've had a pretty good run as far as taxes in our in our income coming in to the city of bonds. So it's time for us to to start using some of that on our on our employees that are better lower paid.'",
        "'speaker_3': 'So thank you. It is a little off topic of of these union contracts here, but it's whenever we get a chance to talk about something like this, we need to talk about it. So thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you, Counsel Baker. The Chair recognizes Councilor Borg. COUNSEL Buck, do you have the floor?'",
        "'speaker_4': 'I apologize, Mr. President, just to seek our acceptance of the committee report.'",
        "'speaker_0': 'It's okay. Thank you. Council BLOCK. Council BLOCK seeks acceptance of the committee report and passage of Docket zero 682. All those in favor say aye. Aye, aye. Opposing 8.0682 has passed Council BLOCK six acceptance of the Committee Report and passage of docket 0863.'",
        "'speaker_0': 'All those in favor say aye. Aye, aye. Our policy nay docket zero 683 has passed Council BLOCK six acceptance of the Committee report and passage of Docket 0684. All those in favor say aye. Aye, aye. Our policy nay docket 0684 has passed Council BLOCK six acceptance of the Committee Report and passage of 20865.'",
        "'speaker_0': 'All those in favor say aye. Aye. Our policy nay docket 0865 has passed. We're on to motions, orders and resolutions. Mr. Clerk, please read docketed 095530960 together.'",
        "'speaker_1': 'Lucky number 0955 Councilor Murphy offer the following order for home rule petition regarding the disability pension call. Matthew Maurice Duncan Number 0956. Councilor Murphy offer the following order for a home rule petition regarding the disability pension for Henry Jean Duncan.'"
    ],
    "Home Rule Petition on Disability Pension for Richard Cintolo.": [
        "'speaker_1': 'Number 0959 Councilor Murphy offered the following order for a home rule petition regarding and disability pension for Scott O'Brien and Duncan. Number 0960. Councilor Murphy offer the following order for a home rule petition regarding the disability pension for Richards until.'",
        "'speaker_0': 'Thank you. The chair recognizes Counsel Murphy of the floor. So take action.'",
        "'speaker_2': 'On these petitions today and we keep them in committee so we can hold a working session before our next council meeting, so we can get the language correct before we vote and send them back up to the State House for approval.'",
        "'speaker_2': 'As many of you remember, these six police officers who were injured in the line of duty was brought forward by Councilor Sabby George last session and were all unanimously passed. And I have been working with the police union and the State House because the state initially rejected these home rule petitions due to the Public Employee Retirement Administration'",
        "'speaker_2': 'Commission not supporting the language the council in the Mayor previously approved. We have the proper language now, so we can add that in our working session. And I also know that we have the home rule petitions for Kurt Stokes and Elaina McAllister that are still in committee, and we will have working sessions to also include the proper'",
        "'speaker_2': 'language in their home rule petition so we can vote on their disability and retirement at our next council meeting and get them all up to the State House for passage before their next door session. So thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Counsel Murphy The Chair to Counsel Murphy. Um, Counsel Murphy Well, will stoke and Curt, Stockholder and Elaine also be added to the other police officers that are going up.'",
        "'speaker_2': 'So the chair. Arroyo may know better, but I know talking with Councilor McMahon that they're still in committee. So I didn't need to put them back. But because the state house rejected them, I filed so that they'll stay in the committee so we don't have to refile them and we could have working sessions.'",
        "'speaker_2': 'Maybe we'll have all eight together. We may need to have two separate, but I think Chair Arroyo would know better on that. And then we could vote on all eight of them at the next council meeting in the state House said if we have them up to them by then, they will be able to pass before next'",
        "'speaker_2': 'session. Next session.'",
        "'speaker_0': 'Thank you, Counselor Murphy, for the important work that you're doing on this. The chair recognizes Counselor Arroyo. Counsel Arroyo, you have the floor. Thank you.'",
        "'speaker_3': 'There you go. Thank you. President Flynn. Thank you, Counselor Murphy. So we already had a hearing for Curtis Duncan Jr. And what will end up happening is we will have a working session with the ones that we've already had hearings on and we will go forward with those by.'",
        "'speaker_3': 'The goal is to get these before this body on August 31st. Don't see anything stopping us from that. The one thing I will note is that I am fairly certain that last year, when the council voted on this, they actually voted on three of these names.'",
        "'speaker_3': 'And so I have to go look back and make sure that some of these folks have actually had their hearings and have provided medical records. Because if I remember correctly, the initial drop from an SS, Abby George had these names on it, but the final one that we voted on had Harry Jean, Terry, Cotton and Ryan the'",
        "'speaker_3': 'name. And so I have to make sure that all of these names have actually been vetted with medical records and hearings. But the ones that already have which are the names I just said for certain, I have to go look and make sure that I'm accurate on these other ones.'",
        "'speaker_3': 'And the ones that we've already done that have already been filed will be going up before August 31st, so or on the August 31st. So I will make sure that as a committee we send out to folks those videos of their hearings so that folks can familiarize with familiarize themselves with it, as well as the actual working'",
        "'speaker_3': 'session date. When we schedule it, it will be this month so that folks can come in and speak to the changes that the State House is asking for, for uniformity. I think it is a good sign that the State House is asking for uniformity on that because it indicates to me that they are looking towards passage of'",
        "'speaker_3': 'these and so we will do all of that in that session. I have to make sure that all of these names have already had a hearing. I'm not certain that they have. If they haven't, then I can't guarantee those names will go up on the 31st.'",
        "'speaker_3': 'But the other ones will we won't hold them back for that. And so I just have to double check on that before the 31st.'",
        "'speaker_0': 'Thank you and thank you, Counsel Arroyo. I'm just wondering if I'm just wondering from the chair to Council Royal. I'm just wondering if if we're able to determine if we're able to do a little bit of research now to determine if the actual hearing was held on those.'",
        "'speaker_0': 'Three individuals, maybe. Maybe legal counsel can check while we're still we're still meeting them. We just need to confirm. Okay. Okay. Thank you. Okay. Thank you, counselor. We'll take a brief recess. We are in the process of reviewing dockets 095520960.'",
        "'speaker_0': 'We are seeking some follow up information from. Legal counsel, but at this time, could I recognize counsel? ARROYO Counsel. Arroyo, you have the floor.'",
        "'speaker_3': 'Thank you, Mr. Chair. It does seem that we did. Now, I remember we did two votes. We had one set, and then we the second set later in that year, the pandemic and all the zooms blur together. But these all went up together, so they'll go all together as one unit.'",
        "'speaker_3': 'And then we will add Kirk's Stoneking, Jerry and our AMS on there. I was told by our our counsel that there's one edit that may come from the state that we don't have yet, but that we should have it by the 31st.'",
        "'speaker_3': 'So what we will do is schedule that meeting and give ourselves time to actually get that at it. But once that happens, we'll have a working session and do that and then we will send out all of these committee hearings that happen so that folks can get familiar with them who were not here last year.'",
        "'speaker_3': 'Thank you.'"
    ],
    "Ordinance on Display of Flags on City Hall Plaza.": [
        "'speaker_0': 'Thank you, Counsel Arroyo. So dark at zero nine, 552.0960 will be referred to the Committee on Government Operations. They'll stay in committee, basically. Mr. Clarke, please read. Dawkins 0961909. Each year.'",
        "'speaker_1': 'Policy regarding the display of flags on City Hall Plaza.'",
        "'speaker_0': 'The Chair recognizes this council blocking of the floor council block.'",
        "'speaker_4': 'Thank you so much, Mr. President. Mr. President, if I could suspend Rule 12 and add you to this docket.'",
        "'speaker_0': 'Sitting in here. No. Objection. So order.'",
        "'speaker_4': 'Excellent. And a. Well, I'll also be speaking through the chair of government operations essentially and passage, but I'll leave that to the chair. So, you know, I think I. Many of us have the experience of walking out of government center to stop and looking up and seeing the three city flagpoles and then seeing behind them city hall'",
        "'speaker_4': '. And if you walked out, if you weren't a city councilor, you were just a resident of the city of Austin, and you walked out and you looked up at the flagpole and you saw a flag you didn't happen to know of flying on the third pole.'",
        "'speaker_4': 'You might well say to the person with you, Oh, I wonder why the city's flying that flag today. I wonder what flag that is. And I think the reality of the situation is that when people see our three flagpoles, they're with the the US flag, the state flag, and often, but not always the city of Boston flag'",
        "'speaker_4': 'and city hall behind it, they identify those flagpoles with city hall. And that has been the kind of history of that site. What the Supreme Court basically said to us and the decision that came down a couple of months ago was, yes, that's true.'",
        "'speaker_4': 'And it clearly looks like these flagpoles should be operated as kind of an extension of city hall and express in the city's messages. But the way you guys were running your program to manage the third flagpole opened you up to a different interpretation because we were running a, um, a program where people could basically just fill out'",
        "'speaker_4': 'an application and say, Hey, I want my flag up there. And we would raise it. And in the context in which we're doing that, taking all comers, it's that not acceptable under the First Amendment to pick out one entity and in this case can't and say you can't raise your flag.'",
        "'speaker_4': 'And I think, you know, the court gave us a thoughtful and reasonable judgment on that front. And fortunately, it also laid out a roadmap in the decision by Justice Breyer for how the council could and really the city could reassert the fact that those flagpoles are an extension of city hall and are a place where we express'",
        "'speaker_4': 'the messages of the city of Boston. And the way I would think about this from a kind of First Amendment perspective is that you could have any sign you wanted and walk down Cambridge Street in protest. And your First Amendment right is to have that sign in your hands saying whatever you want to say.'",
        "'speaker_4': 'If you want to hang that sign up on City Hall, our property management department would be within its rights to take it down and saying, Oh, that's not something that the mayor of the council put up on the building.'",
        "'speaker_4': 'And so basically what this is about is identifying the flagpoles as a site of government speech in the same way that what we do with the lights or with anything hanging from city hall, etc., is a site, a government speech expected expressing the messages of the city of Boston.'",
        "'speaker_4': 'And I think that's important because I think that our residents, when they see the flagpoles, they do expect those messages to be coming from us. And obviously, both this body and the mayor are the duly elected representatives of the people of Boston.'",
        "'speaker_4': 'And so the ordinance that's before you today would basically follow the Supreme Court's recommendations. And it's been reviewed by the city's Supreme Court legal counsel and to set up a policy that would follow what the court suggested, which is that we clearly be making a kind of codified city decision when we raise a flag on that third'",
        "'speaker_4': 'flagpole that isn't the city of Boston swag. And so this creates to pass for that one runs through this body by through a resolution and the other runs through a mayoral proclamation that said either side of the fifth floor can do that and.'",
        "'speaker_4': 'And you know, I think there's a couple of reasons to seek suspension of passage today. One is that it? Having been told, hey, you need to have a different policy on this if you want to operate a flag raising program.'",
        "'speaker_4': 'I think that it makes sense for the city to have that policy in place as soon as possible and kind of end this interregnum. And also know that, you know, there are communities that we often on this council wanted to support and raise flags for.'",
        "'speaker_4': 'I think there's a lot of folks who would love to see a mayoral proclamation enabling us to raise the Dominican flag next week on Restoration Day. I heard recently from Councilor Flaherty that, you know, there might be an opportunity later in the month to support Ukraine with the flag raising.'",
        "'speaker_4': 'These are all decisions that would, under this new policy, have to be made by other council resolution or a proclamation of the mayor. But none of that can happen unless we actually codified this new policy in statute. So I think it gives us an opportunity to follow the law.'",
        "'speaker_4': 'Be clear, based on the Supreme Court decision that we got and go back to a mode and sort of on better footing this time where we as the represented city of Boston Express, you know, all of the all of the cultures and messages that we'd like to include and celebrate using that flagpole as an extension of that'",
        "'speaker_4': '. So I'm really grateful to my colleagues that Councilor Councilor Lujan, who's one of the one of the legal minds of the council and to President Flynn. And I can also say that, as I mentioned before, both the Supreme Court council that the city retains for Supreme Court advice and also the law department has reviewed this legislation in'",
        "'speaker_4': 'detail. So thank you, Mr. President. And as I mentioned, it's, I think, the business of the chair since of the current operations, but we are seeking through him suspension of passage today.'",
        "'speaker_0': 'Thank you, Counsel. BLOCK. The chair recognizes Constitution. Constitution. You have the floor.'",
        "'speaker_6': 'Thank you, Mr. Chair. I won't speak long because I think Counsel Robert covered most of it. But, you know, we as a city city council, we love our flag raisings. For too long now, too many of our communities haven't had the opportunity to raise a flag because of this outstanding Supreme Court litigation that has been costly and'",
        "'speaker_6': 'time and has taken a lot of our time and attention. Justice Breyer gave us good guidelines on which we could have flag raisings that really our speech that we endorse here as a body or endorsed by the mayor, both in terms of celebrating the diversity of our city and the richness of our cultures and the causes that'",
        "'speaker_6': 'we support. And I think the language in the ordinances was reviewed and edited and made as inclusive as possible. So I think this is a good path forward so that we can start raising flags. Council said next week the Dominican flag.'",
        "'speaker_6': 'There are many flags that, you know, celebrations that we have for the remainder of the year, for next year that we want to start getting started on. So I think this is a fair ordinance in response to the Supreme Court's decision, and it allows us to get back to the business that we're doing in supporting the speech'",
        "'speaker_6': 'that we want to support on City Hall Plaza. Thank you.'",
        "'speaker_3': 'Thank you, Councilor Lui. Jen. I recognize Council President Ed Flynn.'",
        "'speaker_0': 'Thank you, Counselor Arroyo, and glad to partner with my my colleagues. And, you know, when city council is in with Mayor Wu's team as well, I think flying a flag on city hall. Has the opportunity to bring us together as a city.'",
        "'speaker_0': 'We celebrate various countries. We celebrate their contributions and sacrifices to the United States, whether it's whether it's Mexico, whether it's Ireland, whether it's. Um, another country. But it's about bringing people together. It's about recognizing the sacrifice that immigrants have made to our city and to our country and the other.'",
        "'speaker_0': 'The other aspect I'd like to highlight, too, was I always love looking up when I see a flag and seeing the P.O.W. and my flag, which is often in many city and state buildings, and that's the prisoner of war missing in action.'",
        "'speaker_0': 'And that's to remember service members that are unaccounted for. Still to this day serving serving overseas. But that flag is also a reminder to. They are family, that our city did not forget them or our country did not forget them.'",
        "'speaker_0': 'So when I see that, when I see that flag, I have a smile on my face because I know that those military families are being thought of by our city government or by our federal government. Thank you, councilor.'",
        "'speaker_3': 'Thank you. Council President Clinton. In order for me to speak on it, I.'",
        "'speaker_0': 'The chair recognizes. Counsel Baker. Counsel Baker. You have the floor. You sure?'",
        "'speaker_3': 'Okay. Thank you. Thank you, Mr. Chair. I just had a question. So through you to either one of the the the lead sponsors, every flag raising will have to have a resolution come through here. What is the mayor's if so, if the mayor wants a flag raising, that will have to be a resolution that comes through here'",
        "'speaker_3': 'and a vote on it.'",
        "'speaker_0': 'But the chair recognizes counsel, board counsel. What can you respond to that question?'",
        "'speaker_4': 'Yes, thank you. No, it's it's either a mayoral proclamation or a city council resolution. So the idea being that the way that the council expresses sort of the sense of the body formally is by resolution. The way the mayor expresses is through proclamation.'",
        "'speaker_4': 'I think folks have often seen folks receiving know their equivalent on the mayoral side with that folder in the proclamation. And so it's basically the idea that either body the key thing from the court's decisions perspective was that we needed to kind of express it as officially our message, like from the city of Boston.'",
        "'speaker_4': 'So the idea is we we use either the council's way of sort of expressing official things or the for the mayor's way.'",
        "'speaker_3': 'And one more question. Would the what the mayor's proclamation have to be voted in this body here.'",
        "'speaker_0': 'Which the chair recognizes council? Look.'",
        "'speaker_4': 'No, it would follow the same the current path by which the mayor promulgates proclamations, which is unilateral on her side.'",
        "'speaker_3': 'Okay. Thank you, Mr. Chair. I, I think I'm a little concerned about taking votes on up or down on different flags. I'm going to support this here today. But I think where we potentially can be the brunt of the joke on this one here, because I think the I think what will come in front of us all'",
        "'speaker_3': 'the time will be those really controversial ones. And we'll have to vote on them and we'll be in the paper when it comes to Satanic Temple and whatever other sort of fringe groups come in front of us, that that that want to have their flag sewn.'",
        "'speaker_3': 'I'm trying as I'm trying to see around that. So again, I'm feeling like I'm going to support this. But I do think there is potential in the future for. Ask to be in the middle of a Supreme Court fight that we don't necessarily want to be in or should be in.'",
        "'speaker_3': 'So I do have some concerns and. I'll figure out the vote when I. When it's in front of me.'",
        "'speaker_0': 'Thank you, Castle Baker. I'm going to go to council break, and then I'm going to go back to council. Council balked at. You need to say something immediately. I was just hoping.'",
        "'speaker_4': 'Because it's directly on Councilor Baker.'",
        "'speaker_0': 'That she recognizes council.'",
        "'speaker_4': 'So so just because it's another point of clarification, part of what's shifting here is that whereas for before there was like an intake form for people to raise their hand and say, hey, I want my flag raised because these are expressions of the, of the city.'",
        "'speaker_4': 'Like there there is not an intake form type thing. So basically like there's only going to be a resolution to even be voted on. That could lead to a flag raising by the city council. If a member of this body introduces said resolution.'",
        "'speaker_4': 'So to Councilor Baker's point about sort of like people putting things up for to kind of force draw votes like it would only be if somebody on this council move such a resolution that it could be voted on.'",
        "'speaker_4': 'I just want to clarify that.'",
        "'speaker_0': 'Thanks. Thank you, Councilor BLOCK. The chair recognizes Councilor Braid and council bread. You of the floor.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you to Councilors Barclay Vision and yourself, President Flynn, for initiating the formal codification of the city policy regarding regulating our city. Manage public spaces for government speech. I think one of the things that we basically didn't have, we didn't have a formal codification of a policy to or over oversee the flag'",
        "'speaker_6': 'raising issue. So that got us into trouble. And it begs the question, you know, as we think one of the issues that we've been working on, as in offices, is to review the re qualification of our ordinances. And I think this is an opportune time to, uh, to look at all of these issues.'",
        "'speaker_6': 'I know this is a slight sort of segway or a sidebar to the conversation about specifically to the flag raising issue. In Chapter eight of the Ordinance of 1975, the city established a uniform procedure for the adaptation and probably promulgation of forms and regulations by the city departments adopting the State of Massachusetts, Massachusetts State Administrative Procedures Act'",
        "'speaker_6': '. So, you know, after 50 years, I think the Supreme Court has, in the case of the flag raising issue, has given us a timely reminder that we need to maybe initiate a review of how all of our department regulations are adopted and promulgated.'",
        "'speaker_6': 'And, you know, in the context of reviewing our codification of our ordinances, I look forward to digging deeper into that and trying to get some consistency. You know, with this an issue with clarification of the flag raising issue, I'm sure there's other issues that we need to attend to as well.'",
        "'speaker_6': 'Just do it in a matter of Good Housekeeping and putting everything in order. Thank you.'",
        "'speaker_0': 'Thank you. Counsel. Brady in the chair recognizes counsel. Royal counsel. Royal, do you have the floor?'",
        "'speaker_3': 'Thank you, counsel. President Flynn, as chair of government operations, I will be seeking suspension of Rule 33 so that this matter can be adopted today. I think much of sort of the nuance on the new legal sort of findings as well as why it's important, have already been discussed.'",
        "'speaker_3': 'So I'm going to keep it very short just to say that this ordinance doesn't conflict with any city of Boston code or ordinances. And I'd also like to thank the original co-sponsors of the ordinance councilor back in the region for bringing this to the floor so that we can clearly establish guidelines for the display of flags by'",
        "'speaker_3': 'the city of Boston. And I think it's already been said, but this has already been vetted by both our law department and our council that we use for Supreme Court cases. All right. And so I think this is ready to go today, which is why I'm offering it up as a suspended passed.'",
        "'speaker_3': 'Thank you to the makers. Thank you as well to you as an original co-sponsor present one.'",
        "'speaker_0': 'Thank you. Thank you. Counsel Royall the chair recognizes counsel Murphy. Counsel Murphy, you have the ball.'",
        "'speaker_2': 'Thank you. Counsel. President So I did have some concerns when I first saw this that this would be a violation of free speech. And I do have to say thank you to Counselor Bach for using my concerns there.'",
        "'speaker_2': 'When you talked to me through that, the one question that I still have and if one of the original sponsors could reply, why does the mayor need us also? Why can't it just be a decision by the mayor?'",
        "'speaker_2': 'Why are we the council also weighing in on the flagpoles, which I thought were the mayor's flagpoles, because I know in the past we have this balcony out here and maybe that's a different conversation the council can have on if we want to hang flags off our council back balcony.'",
        "'speaker_2': 'But if someone could just clear that up, that would be helpful.'",
        "'speaker_0': 'Thank you. Thank you. Councilor Murphy, the chair recognizes Councilor Bourque to respond to that question from counsel.'",
        "'speaker_4': 'Murphy Thank you so much, Mr. President. I think so. First of all, obviously, there's no requirement that the Council ever take resolution action to lead to it to a flag raising. And so certainly it could become the pattern and practice that we ceded that to the mayor.'",
        "'speaker_4': 'I think that that said, I'll be a little bit of an institutionalist here. I think that this council represents the city of Boston just as much as the mayor does. And so when we're talking about an ordinance that we would codify into our municipal code, I think it would be it would sort of be a shame for'",
        "'speaker_4': 'the council to kind of cede its right to also establish a message of the city of Boston, even if in practice, we end up deciding that it's it makes more sense to let the mayoral proclamations become the default or something.'",
        "'speaker_4': 'I think that it would sort of be a a seeding of sort of like. Are kind of like rights and prerogatives to also express messages on behalf of the city of Boston, which I take us to be doing every time we file a resolution on something.'",
        "'speaker_4': 'So I think that's the that's the reason. And that said, obviously, like, you know, when you think about even just timing things, right, like if this were to pass today and we're talking about the the being able to raise the flag as the city for the Dominican Restoration Day on Tuesday because we don't have a resolution before'",
        "'speaker_4': 'us here. Obviously, that would be done by mayoral proclamation. So and I think obviously there will often be times where the council's Wednesday meeting schedule is such that it makes more sense to do it by proclamation. But I will just say that I would feel queasy about giving up our prerogative as a duly elected body representing Boston'",
        "'speaker_4': 'to also be a decision maker on this. So thank you, Mr. President.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, counsel. Does anyone else have any questions or comments on this? Um. Would anyone like to add their name? Please raise your hand. The Mr. Kirkland, please add counsel of Royal Counsel and counsel of Colorado, counsel in front of his name as Andersen.'",
        "'speaker_0': 'Please have counsel. Varro counsel. Clarity. Please. Please. Council world. Council is blocking motion and are seeking suspension of the rules and passage of docket 0961. All those in favor say aye. I opposed say no. The ayes have it.'",
        "'speaker_0': 'Docket 0961 has passed. She wanted to be a spy, so.'",
        "'speaker_2': 'Sorry. It was. It's okay. Thank you.'"
    ],
    "Hearing on Safety Concerns and Measures for Double-Decker Buses.": [
        "'speaker_1': 'DAWKINS 0962 lucky numbers 0962 consoles turn off at the following order for a hearing to discuss safety concerns associated with double decker sightseeing busses and reclaiming a double decker bus. Public safety measures in the city of Boston.'",
        "'speaker_3': 'Thank you, Mr. Clarke. The chair recognizes Council President Flynn. Council President. Fine. You have the floor.'",
        "'speaker_0': 'Thank you, Tom Silver. And. This would be a hearing to discuss the process of double decker sightseeing bus. But it's really an opportunity for us to learn more about safety challenges a double decker bus has in the city.'",
        "'speaker_0': 'This is not to stop the operation of a double decker bus, but it's to get some clarification on making sure that everybody is safe. Tourists, the driver, pedestrians. When there is a double decker bus, a lot of them, we see them around.'",
        "'speaker_0': 'We see tourists in downtown Boston on a lot of sightseeing busses. But I'm just I just want to make sure that we present and provide the best safety for everybody. And that includes those that go on double decker busses.'",
        "'speaker_0': 'It's an issue we haven't focused much attention on. So this is something that's important to make sure that double decker busses are safe. And I'm looking forward to learning more about the process of keeping everybody safe. That would use the double decker bus.'",
        "'speaker_0': 'Thank you, Mr. Councilor.'",
        "'speaker_3': 'Thank you. Council President Flynn, would anyone else speak on this matter? Chair recognizes Councilor Coletta.'",
        "'speaker_6': 'Thank you. Please add my name. I just want to thank the baker for sponsoring this and calling attention to this issue. My district sees over 2 million people, visitors to the North End in Charlestown. So there's no doubt in my mind that these types of vehicles would follow the Freedom Trail to see some of our historic treasures'",
        "'speaker_6': ', like the Power of Your House and the Bunker Hill Monument. And I'm just now finding out about these busses to victory honors. So. And their safety concerns. So I look forward to the hearing, and I thank you for your oversight and leadership on this.'",
        "'speaker_3': 'Thank you. Thank you. Councilor Clare, would anyone else like to speak on this matter? Seeing no hands. Would anyone else like to sign on? Mr. Clarke, please add Councilor Baker, please that councilor back please. That Councilor Braden, please add Councilor Coletta, please add Councilor Fernandez Anderson please add councilor clarity please add Councilor Lara please add Councilor Lui'",
        "'speaker_3': 'Jan please add Councilor Murphy to is that Councilor Will Rowland please add my name. Docket 0962 will be referred to the Committee on Planning, Development and Transportation. Mr. Clarke, can you please read. Docket 963.'"
    ],
    "Hearing on COVID Recovery Grants from the Bipartisan Infrastructure Law.": [
        "'speaker_1': 'Duncan number 0963 Council a block off of the following order for a hearing regarding enhancing Boston's COVID recovery via grants provided by the bipartisan infrastructure law.'",
        "'speaker_0': 'Thank you, Counselor Arroyo. The the chair recognizes counsel. Board counsel. You have the floor.'",
        "'speaker_4': 'Thank you so much, Mr. President. And may I also add Counselor Bryan Morales, an original co-sponsor of this.'",
        "'speaker_0': 'Counsel, were also ordered. So our.'",
        "'speaker_4': 'Great. Wonderful. So the bipartisan infrastructure law folks have heard about it. It provides an immense amount of funding for infrastructure across the country, but a lot of it is determined by competitive grants. And so it's really important that the city of Boston be an applicant and a strong and competitive applicant for as many of grant those grants'",
        "'speaker_4': 'as possible in order to get millions and millions of dollars directed towards high priority things in the city across a lot of different categories of infrastructure. Potential areas include road, rail and transit, port infrastructure, busses and bus facilities, vision zero, plan implementation, pedestrian safety, charging and fueling.'",
        "'speaker_4': 'Infrastructure low and zero emission school busses. We like reconnecting communities that are divided by highways, flood mitigation assistance, brownfields, remediation, energy efficiency and conservation energy specifically, and schools energy resilience code adoption which relates to Berto and the stretch code out of the state.'",
        "'speaker_4': 'Cybersecurity Smart Grid supports waste and groundwater storage. So just like a huge carrot set of categories of things and there's kind of a dizzying array of notices of funding availability that are coming out of the federal government on a kind of complicated time schedule.'",
        "'speaker_4': 'And a bunch of these opportunities have to be applied for by our state like various departments, and the city might be partnering with them, or some are what the person who's eligible is actually the Metropolitan Area Planning Council, but a bunch of the grants, the relevant applicant is the city of Boston.'",
        "'speaker_4': 'And so this notice is really just to, um, to stress the fact that we want to make sure that we, the city are applying for every one of these that we can and that the Council should be informed about what those applications are, the ones that we've made, the ones that we plan to make.'",
        "'speaker_4': 'And if we're not applying for any of these opportunities, I really want to make sure that we all understand is it because we really don't qualify? We have good reason to think we wouldn't be competitive. You know, there's huge opportunity here for us to really advanced our Complete Streets initiative.'",
        "'speaker_4': 'Recharge Boston, our Vision Zero Action Plan. The Imagined Boston 2030 plan. Go Boston 2030. There's just a lot of things that we have been dreaming of for some time, and I would say we're probably one of the better positioned municipalities in the country in terms of the amount of that kind of planning that we've done, but we're'",
        "'speaker_4': 'not planning to actually turn into implementation. And so I'm super grateful to Christopher Robin Milliken, who is one of our fellows this summer, who did a in-depth dove for my office on all of these application opportunities. And we also talked to the administration.'",
        "'speaker_4': 'And so there's some reference in the in the hearing order to some of the applications that they have already put in, including this 9.3 million one for the clean school bus program that they put in in July, and an $100 million one for national infrastructure project assistance.'",
        "'speaker_4': 'But there's, for instance, the safe streets and roads for all. Grant is coming up in September and then a whole bunch more that have that have no fees that are due to come out in the third quarter of 2022.'",
        "'speaker_4': 'So it's such a robust are doing a great job for us, chasing down all of the potential opportunities. And we feel like it's very important for the residents of Boston to know that we're on top of this and for the council to have a voice in it and for us to start getting ready for opportunities where we'",
        "'speaker_4': 'might get significant federal funding. So it feels to me like a very important part of our recovery, Mr. President, and thrilled to be co-sponsoring this with the council overall today.'",
        "'speaker_0': 'Thank you. Thank you. Counsel. Walk the chair recognizes council. We're all council world. You have the floor.'",
        "'speaker_3': 'Thank you, President Flynn. And thank you to Councilor Black for leading on this. The bipartisan infrastructure law is an opportunity to provide real investments in climate change, reduce and prevent pollution, create lasting environmental change, improve the air quality and quality of life in our city through improving infrastructure.'",
        "'speaker_3': 'Vision zero Boston Action Plan and imagine Boston 2030 to directly address community interests around traffic, calming measures, improvement, transit and walkability, and reconnect to communities. It is a grant that can advance our city initiative, provide solutions to community community concerns.'",
        "'speaker_3': 'An opportunity like this has a potential to have major impact on our neighborhoods and, by extension, residents. Neighborhoods like Dorchester, Mattapan and Rock. Roxbury has suffered because of lack of infrastructure in the past, with Dorchester, Dorchester having some of the highest temperatures to date.'",
        "'speaker_3': 'As a result, how are we centering environmental justice, communities and concerns in this conversation? How are we prioritizing those most impacted by a lack of infrastructure investment? And how are we ensuring that input makes implementation of these grants are distributed equitably?'",
        "'speaker_3': 'I'm excited to engage with questions like these and ensure that communities that have been overlooked can be heard and represented. I'm looking forward to collaborating with the council, our state and congressional colleagues and all involved departments and engaging our community in this process.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, counsel. Overall, the chair recognizes counsel to counsel. Carter, you have the full.'",
        "'speaker_6': 'The President. Flynn And just to indulge me for just for a quick moment, I forgot to recognize the North Shore Community College public speaking course led by old left Sherry Rafferty. She's a Boston resident. I was going to tell her to provide a grade for me in my public speaking, so hopefully she will watch this in the'",
        "'speaker_6': 'future and I want to thank them for being here. But I just wanted to thank the baker for this and to please add my name in always for your due diligence. Ensuring the city of Boston is doing what it needs to do to get the most out of these funds to transform and protect the public realm.'",
        "'speaker_6': 'We find ourselves yet again with a once in a generation transformative opportunity. And I found myself in conversation with many advocates discussing our waterfront. No are no shock and no surprise in saying out loud that I expect the city of Boston to be competitive when going after this money because we desperately need it.'",
        "'speaker_6': 'There is a special earmark in this federal package that will make our infrastructure resilient against the impacts of climate change and extreme weather events. This legislation is the largest investment in resilience of physical and natural systems in American history, in American history.'",
        "'speaker_6': 'And so Councilor Bach eloquently stated in in her order that due to the short term and competitive manner of these opportunities, we must act with urgency. I echo that and just to summarize my own take on this, I encourage all of us to do what we can to go get this money because we need it.'",
        "'speaker_6': 'So I look forward to hearing from the administration and better understanding what grants they will apply for and how it will promote our city's goals for a more green and resilient future ahead. Thank you.'",
        "'speaker_0': 'Thank you, Counsel. Clara, the chair recognizes counsel Brett and counsel Brett. And you have the floor.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you to the makers for bringing this very important issue to light. I think it's critically important that we use and use every all of our resources to try and maximize the benefits of these these infrastructure grants.'",
        "'speaker_6': 'As councilor collectors already mentioned, this is a once in a generational opportunity. And, you know, in our conversations with some departments over the past few years, one issue that came up was just the the support and infrastructure within our within our administration, within government relations, etc., to really execute a timely application for these grants.'",
        "'speaker_6': 'So it's really important that we ensure that the departments have the support necessary to be successful in these competitive applications. And I hope that we can have a robust conversation and support all of our departments to every in every way so that they can take advantage of this opportunity.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Counsel Right in the chair, from the chair to council. Just a quick question. Is there a central location where we find out about competitive grants or or what is the process of cities and states finding out about competitive competitive grants that they must apply for?'",
        "'speaker_4': 'Yeah. So I think that's part of the challenge here is that the different grant opportunities were sort of assigned to the different executive offices in D.C. and then those are responsible for putting out these no photos. So in the notices of funding availability.'",
        "'speaker_4': 'And so I think basically what's happened is like, you know, our Transportation Department is sort of tracking the ones from the Department of Transportation federally and, you know, and like and then once they're from the EPA, our environment department would be tracking.'",
        "'speaker_4': 'But, um, but that's part of the reason to really make sure that the city is both keeping a unified list and that it's kind of like that there's wide availability and knowledge, but that is for the council. So I know that I think that the and folks have been trying to keep such a list, but I think'",
        "'speaker_4': 'it's something that should be shared with the council. And, you know, and like I mentioned to Christopher Robin in my office has done a great job of digging out all the deadlines and what hasn't been issued yet. But there is a slightly crazy aspect to this where you sometimes just have to like wait for the no votes'",
        "'speaker_4': 'to drop and then suddenly they will have all these detailed regulations and also a deadline that's like not very far away. So to councilor grade in this point, it becomes very important for the departments to be nimble and ready and able to throw some personnel time into getting those applications in.'",
        "'speaker_4': 'And it really can be the difference. You know, I mean, we when you think about how big I mentioned the school bus one, it's 9.3. The I think the we put in an April for a raise one for Roxbury that would be 25 million if we got that one of these the mega ones, 100.'",
        "'speaker_4': 'I mean, these.'",
        "'speaker_6': 'Are.'",
        "'speaker_4': 'These are things where it makes sense for us to be like ready to go on a dime. But it is a little bit of a crazy decentralized process federally.'",
        "'speaker_0': 'Thank you, counselor. Walk with anyone else, so to speak, on this matter. But anyone like to add their name? Please raise your hand. Mr. Clarke, please add Councilor Baker, please add Councilor. Royal Councilor Braden Council Aquatic Council Fernandez Innocent Council.'"
    ],
    "Hearing on Monkeypox Virus and City's Response Plan.": [
        "'speaker_0': 'Florida Council. Borough Council. Asian Council of Murphy. Please add the chair. Dawkins 0963 will be referred to the Committee on Boston's COVID 19 recovery. Mr. Clerk, please read Docket 0964.'",
        "'speaker_1': 'Duncan Members 0964 Councilor Murphy offer the following order for a hearing to address the monkeypox virus in the city. Strategy for the breakout.'",
        "'speaker_0': 'Thank you. The chair recognizes counsel. Murphy. Counsel Murphy. You have the floor.'",
        "'speaker_2': 'Thank you, counsel. President Flynn and I would like to suspend the rules and add Counselor Baker as an original sponsor, please.'",
        "'speaker_0': 'Counselor Baker was added.'",
        "'speaker_2': 'Thank you. So since the first U.S. monkeypox case was identified in mid-May, more than 6600 probable or confirmed cases have been detected in the United States. Cases have been identified in every state so far except Montana. In Wyoming.'",
        "'speaker_2': 'Last Thursday, August 4th, the federal government declared a public health emergency against the monkeypox virus to bolster the response to the outbreak, which would free up money and other resources to fight the virus. As of Thursday, August 4th, Massachusetts state officials had reported 157 confirmed cases of monkeypox.'",
        "'speaker_2': 'Vaccination efforts nationwide have been criticized as slow and lackluster. The federal government said it had limited supply of the genius vaccine in its stockpile in Massachusetts has requested a total of 26,271 doses and so far has only been sent 16,251 of that allotment.'",
        "'speaker_2': 'It should be noted also that the virus is not unique to the LGBTQ community in these individuals shall not be stigmatized for it. The COVID 19 pandemic is still not over with. The new high transmission will be a five omni kron sub variant lurking.'",
        "'speaker_2': 'Boston must be prepared to handle two public health threats simultaneously. And as we know on the city council, we should be up to date with all the available information regarding monkeypox in order to best protect and educate our constituents.'",
        "'speaker_2': 'We learned many lessons dealing with COVID 19 over the past two years, so now is the time to implement what worked and also change what didn't and be a role model for other cities on how to deal with this public health threat.'",
        "'speaker_2': 'This is why I am ordering a hearing with the appropriate committee of the Boston City Council to address the monkeypox virus and discuss the strategy for the city, including preventative steps, availability and access to testing and vaccinations, treatments, and increasing knowledge and awareness of the virus to all of our residents.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilor Murphy, the chair recognizes Councilor Baker. Councilor Baker, you have the.'",
        "'speaker_3': 'Floor. Thank you, Mr. President. I just want to thank Councilor Murphy for allowing me to sign on with this. Like you all know that the best tool to have when there is an issue in public with public health and safety is is education.'",
        "'speaker_3': 'We were an educated body when it came to COVID. We had we had regular meetings, were up to speed on what we should be doing to protect ourselves, protect our families. No difference here. We should know what this what this virus is remains.'",
        "'speaker_3': 'You know, we don't want to go back to the the days of the AIDS epidemic when people were afraid to interact with with, you know, certain communities. And, you know, it was people like Lady Di that went into the hospitals and embraced people that were sick with AIDS and shook their hands and and showed them love.'",
        "'speaker_3': 'So it's it's almost running a parallel path, not namely what the AIDS epidemic was. But we need to, like I said, stay informed. And I appreciate Councilor Murphy for allowing us to have the hearing and become informed.'",
        "'speaker_0': 'Thank you, Councilor Baker. The chair recognizes Councilor Braid and Councilor Braeden. You have the floor.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you to Castro Murphy for raising this issue and trying to really throw light on the severity of the monkeypox virus outbreak. The initial medical and public health coverage of the monkeypox outbreak has concerned, as concerningly, framed the monkeypox as only being transmissible by, by and addressed to L.G.B.T.'",
        "'speaker_6': 'Communities, and particularly men who have sex with men. These perceptions of monkeypox have echoed stigmas and fears of the early HIV and AIDS epidemic as because of what he referred to. But monkeypox can be transferred to anyone through close personal contact, including touching objects or fabrics and surfaces that have been used by someone with monkeypox, as well'",
        "'speaker_6': 'as by rat respiratory secretions. The factual and accurate public information dissemination is essential to try and stop this outbreak and prevent transmission and ensure awareness of and access to vaccines, vaccinations and treatment. We hope that we've learned from the recent outbreak of COVID.'",
        "'speaker_6': 'There were many hard lessons it took. It wasn't totally novel, a virus that was spreading across the world at incredible speed. And it took us some time to to get get our act together and address the issues. And I'm hoping that in working with our public health professionals in the city, that we can have factual information and'",
        "'speaker_6': 'have a really robust and appropriate response to this outbreak. Thank you.'",
        "'speaker_0': 'Thank you, Counsel. Bright and. Would anyone else like to speak on this matter? Would anyone else like to add their name? I would also like to reference. I have reached out to the city of Boston. Public Health have been on several calls with them on this on this issue.'",
        "'speaker_0': 'And we do have a conference call that will be scheduled soon, I guess. But certainly this this hearing is critical. We'll learn as much as we possibly can. So I want to say thank you to Councilor Murphy and Councilor Britt Baker for bringing this forward, but also to the city of Boston Public Health Commission that has been'",
        "'speaker_0': 'working on this. So please raise your hand if you'd like to add on Mr. Clarke, please add. Councilor Arroyo. Councilor Borg. Councilor Braden. Councilor Clara Council. Florida Council. Our Constitution. And in the chair. Docket 0964 be referred to the Committee on Public Health, Homelessness and Recovery.'"
    ],
    "Hearing on Green Stormwater Infrastructure Capacity.": [
        "'speaker_0': 'Mr. Kirk, please. RE Docket 0965.'",
        "'speaker_1': 'Duncan, Emma 0965 Council of Biochar for the following order for a hearing on increasing green stormwater infrastructure capacity at Boston Water and Sewer in the city of Boston.'",
        "'speaker_0': 'But she recognizes Counselor Bork. Counsel Bork, you have the floor.'",
        "'speaker_4': 'Thank you so much, Mr. President. Mr. President. I'd like to seek to suspend Rule 12 and add councilors Braden and Colette as original co-sponsors.'",
        "'speaker_0': 'Seeing and hearing. No objection. Both are out.'",
        "'speaker_4': 'Great. Thank you. And I also want to acknowledge we and I think there are many fans of green infrastructure in the council house. So if we could add more people, I would also be adding Councilor and Councilor Laura.'",
        "'speaker_4': 'But it's I'm glad that there's such a caucus of support. I also want to start by offering a shout out to Alaskans and other one of our summer fellows who worked on this hearing order for us and has been doing a tremendous amount of research to back it up.'",
        "'speaker_4': 'So Boston, as some folks may know, but others may not, we maintain actually one of the oldest and largest traditional gray storm water systems in the country. And unfortunately, you know, it really it right now can only deal with several inches of rain in a 24 hour period.'",
        "'speaker_4': 'We've got, you know, storms that are projected more and more often to overwhelm the systems. BWC, our Boston Water and Sewer has expressed the need to expand its capacity. We're under a federal order not to let too much phosphorus go into the Charles River, which again involves having a greater capacity system.'",
        "'speaker_4': 'But unfortunately, the ways in which we have pursued greater capacity in the city of Boston have really been kind of gray in the sense of concrete and not looking enough. I feel at greenest green stormwater system solutions. And, you know, we've even set forward a plan for stormwater management, carbon neutrality and assess GSI in various places in'",
        "'speaker_4': 'the city. But in terms of our actual implementation, we are lagging behind cities like New York, Philadelphia, Seattle, which have developed plans and models and have hundreds of GSI developments across their city. And I saw this firsthand when I went to Philadelphia, actually looking at their Power four program.'",
        "'speaker_4': 'They've done so much green stormwater infrastructure that they have a whole division of their water department now, which is their water and sewer that just maintains green stormwater infrastructure. And it's been a great source of jobs for the power for folks who have trained up on the maintenance for these green stormwater installations and have become experts in'",
        "'speaker_4': 'it. And, you know, it's one of those things where I think the way that we've been thinking about it often in the city of Boston is, oh, green infrastructure, which might mean putting in a rain garden or a bio swale or just, you know, anything where you've got a kind of nature based solution.'",
        "'speaker_4': 'We look at that sometimes and we say, Oh, well, those porous pavers, they might need a little bit more maintenance, they might need to be vacuumed or they might need to be swept. And we don't have that capacity today.'",
        "'speaker_4': 'And so it sort of makes sense in a kind of immediate sense, oh, let's go with the set and forget it concrete. But in the long run, Philadelphia's run the numbers and found that this would save an enormous amount of money if you put the green infrastructure in first just because of how much better it handles the'",
        "'speaker_4': 'water. And and I feel proud of the fact that Boston's one of the first cities in America to really do to scale green stormwater infrastructure. We did it more than 100 years ago with The Mighty River, which is just a giant green stormwater initiative in the middle of the city.'",
        "'speaker_4': 'And it's time for us to do it again more and more. And I think that there's an opportunity to create great jobs for our young people doing this opportunity to engage our communities. But engaging our communities shouldn't look like a world where because we haven't come up with a real system for green stormwater maintenance, we're saying we're'",
        "'speaker_4': 'only going to put green stormwater in where some community group agrees to maintain the installation, because the reality is that creates a city of haves and have nots and place in it and the opposite of an environmental justice approach.'",
        "'speaker_4': 'So I was really excited to see the mayor announce England coming in as our first director of Green and infrastructure last week. And I think there's a huge opportunity to work with Boston Water and sewer and also public works and all of our departments to kind of put in infrastructure to make our standards green and then also'",
        "'speaker_4': 'to have a real maintenance plan attached to all those that's going to serve our communities well. But I think it's something that the council should be paying close attention to. And I'm thrilled to be joined by my co-sponsors, Brian.'",
        "'speaker_4': 'And. So thank you, Mr. President. And thank you again to Alice.'",
        "'speaker_0': 'Thank you, Counsel. The next original co-sponsor was Counsel Braden and Counsel Braden. You have the floor.'",
        "'speaker_6': 'Mr. President, and thank you, Councilor Bochum, Councilor Collado, for co-sponsoring this. You know, the green stormwater infrastructure capacity, the green stormwater is sort of a pet, a pet project for me. Many years ago we had a persistent problem with it was a big rainstorm.'",
        "'speaker_6': 'We had incidents of of one instance of having 18 inches of water in our basement. And we discovered that in an extreme, after a lot of weather rain, that the rainwater was just accumulating in the. And we were just coming in to our basement.'",
        "'speaker_6': 'And then we went to a presentation that was hosted by the Awesome Brian CDC, and it was a presentation by the Charles River Watershed Association, and they presented a presentation on Rain Gardens and Bio Swales. And we, we went home and we, we, we worked, we got some help and we, we created our own rain garden in'",
        "'speaker_6': 'the backyard. And all of the rainwater that hits our roof goes into our yard. So it we don't have a flooding problem in our basement and any longer. So this is just sort of a micro project that we have we've used in our in our family to manage stormwater.'",
        "'speaker_6': 'But when you scale that up, we had a someone from the the Boston Water and sewer came by recently and we showed him our rain garden and he was like, wow, if we could more get more people to do this, it would take so much of the stormwater out of our system and and and help alleviate some'",
        "'speaker_6': 'of the flooding issues that we have. So and I feel that, you know, not only do we need to do this on a on a on a on a city level in our city departments, and think about new but new neighborhoods that have been developed and in East Boston and Allston that we need to be thinking about'",
        "'speaker_6': 'stormwater management in a very proactive and very strategic way. But I also think that we need to engage with our residents of the city to try and encourage, you know, sort of this micro approach of of individuals, households having having a rain garden in their yard to to try and alleviate the the increased threats of stormwater, increased'",
        "'speaker_6': 'weather events with very heavy, precipitous rain is is a very real threat, especially we're not going to have sea water in a square, but we are going to have problems with stormwater. And I really welcome this hearing and I hope to learn more about this issue and to also help educate our residents across the city.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Council grade and the chair recognizes council, cholera council. Quite a few of the floor.'",
        "'speaker_6': 'Thank you. Council. President Flynn. I want to thank the maker and including me as a co-sponsor as well as my co-sponsor, Councilor Braden. A Forgotten Crisis and tangential issue two flooding due to sea level rise is mitigating stormwater runoff and the unprecedented levels of precipitation seen in recent years.'",
        "'speaker_6': 'Mitigation measures have been implemented to protect our coastline from flooding, but we do not account for the water that comes through our sewer systems below our streets. New development is typically built on elevated platforms, just like they are in.'",
        "'speaker_4': 'In East.'",
        "'speaker_6': 'Boston, which has helped somewhat. But when there are major storms like the bumble genesis that took place in 2018. Council President Flynn, I know you remember this quite well as on day three of your tenure, but water not only went up and over these elevated platforms, but they went underneath through our drainage system.'",
        "'speaker_6': 'And so it really was the main reason why Jeffrey's point was flooded. And so the frequency of severe storms is increasing. And our stormwater infrastructure, mostly built in the mid-century, is not equipped to handle the volume of water that we're seeing at this present day.'",
        "'speaker_6': 'So in this conversation, I'd like to understand how the EPA is looking at this and what standards for any new development taking place and how folks are contributing to green stormwater infrastructure in their own buildings. Copenhagen planners are thinking about the rain too and have required a certain percentage of green spaces.'",
        "'speaker_6': 'Council Brayton mentioned rain gardens, etc., which could be which could supplement strategies of what we're doing. So I look forward to the hearing and again, grateful to be added as co-sponsor. Thank you.'",
        "'speaker_0': 'Thank you. Counsel. The chair recognizes council. Borough Council are you have the floor.'",
        "'speaker_6': 'Thank you, President Flynn. And thank you to the makers and councilor. Councilor, Councilor Brading and Councilor Coletta for moving this forward. This is something that I'm really incredibly excited about as the chair of the Environmental Justice Committee. Part of the work that we did during the conversation about ARPA was to earmark two and a half million dollars'",
        "'speaker_6': 'to build new infrastructure around waste and compost. And I think that this is moving us in the same direction. Ultimately, if we want to be a city that is climate resilient and we want to make sure that we are looking at environmental justice with an equity lens, we're going to have to build our own infrastructure and we're'",
        "'speaker_6': 'going to have to build our infrastructure not at the cost of the, you know, economic empowerment of the people here in our neighborhoods. And so I think that this is not only an opportunity to further create jobs, but I think it's an opportunity for us to really realize the dream that we have for Powercor, right?'",
        "'speaker_6': 'That it's kind of like a hub that continues to grow and provide jobs for young people, particularly in green infrastructure, so that we are a climate resilient city, but we're also providing economic opportunity and well-paying jobs to the people here in the city of Boston.'",
        "'speaker_6': 'So I'm really excited to support it. I thank you so much for putting it on the floor. And I am happy to steward it through the Environmental Justice Committee.'",
        "'speaker_0': 'Thank you. Thank you, counsel. Laura, that she recognizes counselors and counselors. And you have the floor.'",
        "'speaker_6': 'Thank you. President Flynn, I also want to thank the sponsors. I want to thank counselor back for introducing introducing this hearing order. We hear a lot from folks in the city wide issue. So I hear from folks in all of our neighborhoods about the issue of flooding, whether on Mercy Boulevard or in different areas.'",
        "'speaker_6': 'The city has about 666 miles of underground stormwater pipes that are, as everyone has said, are quite old that we need to update. One of the really great things about the city is our fiscal strength and our ability to bond for infrastructure and to bond for projects.'",
        "'speaker_6': 'In 2020, the city bonded for the first time green social bonds in the amount of $25 million to update our municipal infrastructure and make them climate resilient. And $35 million for affordable housing projects. We can do that here with green stormwater infrastructure.'",
        "'speaker_6': 'And it should be continued to be a key component of the Green New Deal for the city. There have been discussions already about looking at four point channel as a way to create more flood gates and to create flood gates around the city.'",
        "'speaker_6': 'So I'm really excited for this conversation, and I think that we should be leaning into our city's fiscal strength and making sure that we are putting our resources to bear on this really important issue and protecting our communities, especially our most vulnerable communities that our communities as well.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_0': 'Thank you, counselors. And. Would anyone else like to speak on this matter? Or sign on. Please raise your hand. Mr. Kirklees. Council. Royal Council Councilor Baker. Counsel Fernandez Innocent Counsel Florida Counsel Lara. Counsel and counsel Murphy and the Chair.'",
        "'speaker_0': 'Before I assign it to a committee, let me. Let me recognize Counselor Bork. Counsel Bork. You have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I think we had been thinking because my committee, City Services and Innovation Technology, oversees space and water and sewer that we would be seeking for it to come to my committee. But I also it's obviously been an environmental issue, and cancer is the Environmental Justice Committee.'",
        "'speaker_4': 'So I don't know if we could potentially, like have it have it come to us and have a joint hearing or have a go at her and have a joint hearing. I just I want to make sure that the water and sewer piece is there.'",
        "'speaker_4': 'And obviously, my committee has got jurisdiction over them within the council. But I also would love to be partnering on this. So whatever you think is okay.'",
        "'speaker_0': 'The this will be the this this would be the first time I was assigned to two committees at the same time because it does overlap both committees. So I will, um, I will place it in both both committees.'"
    ],
    "Hearing on Construction and Utility Permits Coordination.": [
        "'speaker_0': 'Um. So we in the Committee of City Services innovation in technology in. In the the Committee on Environmental Justice. Mr. Clarke, can you please read?'",
        "'speaker_1': 'Dawkins 0966 Duncan members 0966 Councilors Coletta and Flynn offered the following order for a hearing regarding the coordination of construction and utility permits.'",
        "'speaker_3': 'Thank you, Mr. Clarke. The Chair recognizes Councilor Coletta.'",
        "'speaker_6': 'Thank you. Vice President Arroyo. So I never know how. Sorry. Vice President Arroyo We love nuts and bolts in District one. I'm pleased to present this hearing order regarding the issuance and coordination of construction and utility permits in the city of Boston.'",
        "'speaker_6': 'This city is growing exponentially, and for the densest neighborhoods like East Boston, North and like like South Boston, there's a lot of activity when it comes to roadwork and development projects that require digging and the temporary loss of parking on our city streets.'",
        "'speaker_6': 'What I'm seeing and these Boston and have for the last three years is that somehow all of the roadwork that could happen at any given time takes place at the same time in two block radius. And it's it's a nightmare.'",
        "'speaker_6': 'In Eagle Hill in 2019, Boston, water and Sewer was digging up 100 year old pipes while Eversource and National Grid were replacing their infrastructure, while numerous development projects shut down streets and sidewalks while the city also repaved streets.'",
        "'speaker_6': 'This exact thing happened a day square a couple of months later, and today it's happening in Jeffries Point. The problem is not the work. Digging up streets to improve our infrastructure clearly needs to happen. The problem is a lack of coordination and notice to residents about what is happening.'",
        "'speaker_6': 'And I'm sure District city councilors have heard this numerous times and the lack of consideration for the number of projects and how it will impact residents quality of life. To be able to traverse their streets and go through their neighborhood without conflicting detours, which is happening right now in Boston, where because Boston water and sewer has no'",
        "'speaker_6': 'idea that National Grid is digging up another street, the detours point to each other and it's just extremely frustrating. I've already been in contact with Public Works, the Bus, Transportation Department and Special Services to better understand the behind the scenes machinations of the permitting approval process in the city of Boston.'",
        "'speaker_6': 'I'm thankful for their participation in a neighborhood walk through tomorrow just to see how impactful this is for those who would love to be in the weeds of nuts and bolts. I'd be happy to describe the callback system to you all, which is something that was described to me by Public Works, and it is what governs these'",
        "'speaker_6': 'approvals. And my goal with this hearing is to identify the obvious low hanging fruit, which is to allocate resources both time and money to implementing a better system or supplementing the kobuk system with with something that provides better coordination.'",
        "'speaker_6': 'So thank you again to my co-sponsor, Councilor Quinn, for this, and I look forward to the hearing.'",
        "'speaker_3': 'Thank you, Councilor Coletta. The chair recognizes Council President Flynn.'",
        "'speaker_0': 'Thank you, Counselor Arroyo, and thank you, Counsel Collado, for including me and counsel for the important work that you're doing on this, as well as all of our colleagues that are especially district councils, but certainly at large as well.'",
        "'speaker_0': 'But district counselors are often the ones that receive the call from concerned residents about a street being dug up. And they're asking, why is the street being dug up? Because six months ago it was dug up previously. And, you know, residents are asking, why can't we coordinate digging up streets almost at the same time or at least'",
        "'speaker_0': 'know what the schedule is? So if there is a street that needs to be dug up, maybe water and sewer could be in there and then keep the street open and then. Maybe, you know, another utility company might have to do some work there as well.'",
        "'speaker_0': 'But I think the council, of course, summed it up best. It's about communication. It's about working together. It's about working with our district city councilors. It's about working with our large city councilors. It's about working with owners as well and everybody working together, especially on communication.'",
        "'speaker_0': 'So we all know what schedules of construction are taking place in our neighborhoods because it is our job as district councilors to communicate a message effectively to our residents why a street is being closed, and what the other options are when that street is closed.'",
        "'speaker_0': 'You know, you can't drive on this street, but you can drive on several streets later. Council also pointed out parking. If we're closing a street down for two weeks and three weeks is the recommendation on where to park a vehicle.'",
        "'speaker_0': 'So these are all important issues. These are all important questions that this this hearing will highlight. So I just want to say thank you to our council for the important work and for my colleagues that they're doing on this issue.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Councilor. Thank you. Council President. Alan, would anyone else like to speak on this issue? Would anyone else like to add their name? Mr. Clarke. Please add Councilor Baker. Councilor Barker. Councilor Brading Councilor Tanya Fernandez Anderson Councilor Flag City Councilor Laura Councilor Louis Chan Councilor Murphy Council.'",
        "'speaker_3': 'Overall and please add my name. Docket 0966 will be referred to the Committee on City Services and Innovation Technology. Mr. Clarke, can you please read dockets?'"
    ],
    "National Purple Heart Day 2022 Resolution.": [
        "'speaker_1': '0967 Duncan 0967. Councilors Flynn and Murphy offer the following resolution recognizing National Purple Heart Day 2022.'",
        "'speaker_3': 'Thank you, Mr. Clarke. The Chair recognizes Council President Flynn. Council President Flynn, the floor is yours.'",
        "'speaker_0': 'Thank you. Thank you, Councilor Arroyo. And thank you, Councilor Murphy, as chair of Veterans Services as well. August 7th just passed to his national Purple Heart Day. And that day is a national day that we honor. We remember we recognize the service and sacrifice of a Purple Heart recipient.'",
        "'speaker_0': 'And that is a person that was wounded. In service to our country or it's a person that was killed in service to our country that that person shed blood shed blood for our country. So it's a it's an important day for us to remember, to think about those disabled veterans that were wounded, those veterans that were killed'",
        "'speaker_0': 'in action also. And to remember their family and to remember their sacrifice and their heartache and their pain. Losing a loved one, losing a son, losing losing a daughter. That veterans coming home that might be a Purple Heart recipient might be still suffering from.'",
        "'speaker_0': 'Various wounds that he or she received in combat. And it might be having a terrible impact on that person's family, their spouse or their parents. They might be engaged in the VA medical system, in mental health counseling for the rest of their life.'",
        "'speaker_0': 'So it's important for us to remember the incredible sacrifice and service of our Purple Heart recipients on this day and honored to partner with Counselor Murphy. But I also would like to suspend and pass this resolution today so that we can recognize those that are recipients of the Purple Heart in their family.'",
        "'speaker_0': 'Thank you, Counselor.'",
        "'speaker_3': 'Thank you, Mr. President. Flynn. Counselor Murphy. The floor is yours.'",
        "'speaker_2': 'Thank you, Counselor Arroyo. And thank you, President Flynn. And as the chair of Veteran Military Families and Military Affairs, I fully support this resolution in declaring August 7th as a national Purple Heart Day. President Flynn already quite nicely summed up the importance of this resolution.'",
        "'speaker_2': 'But still to know this day offers Americans a special opportunity to say thank you to the nearly 2 million brave men and women who fought for our nation's freedom and bear the physical scars of war. It is the ultimate sacrifice for our country.'",
        "'speaker_2': 'And I applaud such recipients of the Purple Heart Award and just want to say thank you that we suspend and pass. I hope our colleagues join us in that. Thank you very much.'",
        "'speaker_3': 'Thank you, Counselor Murphy. Would anyone else like to speak on this matter? Seeing no one else. Would anyone else like to add their name? Mr. Clarke. Please add. Councilor Baker. Councilor. Councilor Braden. Councilor Fernandez. Anderson. Councilor. Clarity. Councilor.'",
        "'speaker_3': 'Laura. Councilor Lui. Gen. Councilor. Rail. And please add my name. Oh, hold on 1/2. Councilors Flynn and Murphy seek suspension of the rules and adoption of Docket 0967. All those in favor say I post, they make. The ayes have it.'"
    ],
    "Recognition of National Community Health Center Week.": [
        "'speaker_3': 'Docket 0967 has been adopted. Mr. Clarke, if you would, please read in to the record docket 09680968.'",
        "'speaker_1': 'Councilor Murphy offer the following resolution recognizing August 7th through the 13th as National Community Health Center Week.'",
        "'speaker_0': 'Thank you, Mr. Clarke, and thank you to Counsel Arroyo. The Chair recognizes Counsel Murphy. Counsel Murphy. You have the full.'",
        "'speaker_2': 'I do. Council President Flynn. So August 7th through the 13th of this year marks the annual celebration of the National Community Health Center Week, honoring the extraordinary contributions our community health centers provide to every community across the nation.'",
        "'speaker_2': 'And here in Boston, we have 22 community health centers that serve one third of our residents in the city, including myself and my children. So the community health centers serve as a beacon of strength, service and care in their communities.'",
        "'speaker_2': 'And this National Health Center Week honors those frontline providers, staff and beloved patients who lost their lives during the ongoing COVID 19 pandemic. From the very beginning of the crisis, community health centers began finding groundbreaking ways to provide preventative and primary care to their patients.'",
        "'speaker_2': 'And we know the incredible work they did in trying to get the vaccines out. And all of the health centers do great work that I know many in East Boston and the Mattapan Health Center really came together and did great work trying to make sure that the residents were educated and had access to that.'",
        "'speaker_2': 'And each day of the National Community Health Center Week celebrates the work and services of health centers provide to the unique populations within their communities, and highlights the innovative solutions they produce to address the most pressing health care issues that our residents face.'",
        "'speaker_2': 'So I hope it be resolved that the Boston City Council recognizes August 7th through the 13th as National Community Health Centers Week, which will honor our critically important health care centers that keep our communities healthy and thriving. So I do ask that we suspend and pass this, please.'",
        "'speaker_2': 'Council President Flynn. Thank you.'",
        "'speaker_0': 'And thank you. Counsel Murphy. Would anyone else like to speak on this matter? Would anyone else like to add their name? Mr. Clarke, please add counsel. Royal Counsel Baker. Counsel Blair Counsel Braden Counselor Fernandez Andersen. Counsel Farrelly Counsel.'",
        "'speaker_0': 'Lara mara Constitution. Council were all employees at the chair. Counsel Murphy seeks suspension of the rules and adoption of Docket 0968. All those in favor say aye. Aye, aye. Opposing nay. The issue of Advocate 0964 has been adopted.'",
        "'speaker_0': 'Mr. Clarke, we're on to personnel orders. Can you please read the docket? 0969.'"
    ],
    "Appointment of temporary employee Asli Ercem in City Council.": [
        "'speaker_0': 'Let me here she has suspension of the rules and passage of docket 0984. All those in favor say aye. I opposed say no. The ayes have it. The docket is passed. Mr. Clerk, please read Docket 098 Fast.'",
        "'speaker_1': 'Talking number 0985 Counsel send for counsel.'",
        "'speaker_0': 'To seek suspension of the rules of House have been docket 0985. All those in favor say aye. I also say nay. The ayes have it. The docket is passed. We're moving on to late files. We have we have full rate files.'",
        "'speaker_0': 'One. One is a personnel order and the others are in removal. Hearing orders and resolutions. The late file matters should be on everyone's desk. We'll take a vote to add these into the agenda. All those in favor of adding the late financial matters into the agenda say thank you.'",
        "'speaker_0': 'Matters have been added to the agenda. Mr. Clerk, can you please read the first file into the record? It's. It's the. It's the resolution, right? The person. What are the personnel on first? Look.'"
    ]
}