{
    "Rezoning of 2929 W. 10th Ave. in Sun Valley from PUD to C-MX-5.": [
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to the Council as a whole and please refrain from individual or personal attacks council members. All right. We will move on to our first public hearing in Kathmandu. Will you please be accountable?'",
        "'speaker_0': '1013 on the floor.'",
        "'speaker_11': 'But to move the council bill 18 1013 be placed upon final consideration to pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 1013 is open. May we have the staff report?'",
        "'speaker_8': 'Thank you. Good evening. Members of the council Andrew Webb here from Community Planning and Development to present on this proposed rezoning of property at 2929 West 10th Avenue from pad 487 to see Annex five. This proposed rezoning is in Council District three.'",
        "'speaker_8': 'It's in the Sun Valley neighborhood along federal between 10th Avenue and Halden place. This rezoning includes several other properties within the boundary of PWD for 87, in total about 12 acres, comprising a campus of health care and social service facilities and parking known as the Castro campus.'",
        "'speaker_8': 'A key reason behind this proposed zoning is are the limitations imposed by the existing former Chapter 59 PDP 47 that that put limits residential care uses on the site to use 0 to 12 years of age. The city does own a 43,000 square foot building at 2929 West 10th that it would like to repurpose for a solution'",
        "'speaker_8': 'center that would provide emergency mental health care and transitional housing to people experiencing homelessness. The structure was previously used as a family crisis center, which provided temporary housing to youth during family displacement and emergencies. That facility closed in 2016 as part of a reorganization of those services, and Department of Human Services would like to reestablish a new'",
        "'speaker_8': 'adult residential care use at this location. As I mentioned, the current zoning is pegged for 87. About a quarter of the site was zoned out of beauty for 87 to see Annex five in 2017, the PWD had two sub areas, so this proposed rezoning would be to the other sub area of this former Chapter 59 PD.'",
        "'speaker_8': 'Surrounding zoning includes quite a bit of CSX five directly to the east and then CMCs eight as you get further east and north of the site OSA at at Rudy Park to the north of the site IMAX and XY.'",
        "'speaker_8': 'So commercial corridor and mixed use zoning along federal boulevard to the west and south of the site, S.R. eight and to the southeast of the site and Annex three to the direct south of the site where there are quite a few established industrial uses.'",
        "'speaker_8': 'Land use includes the on site, includes the Richard T Castro Human Services Center and health clinic and parking uses surrounding uses include Fairview Elementary directly to the west of the site across or east of the site across Decatur.'",
        "'speaker_8': 'Recreational use is to the north, multi-unit residential in the Sun Valley, housing to the south and east and commercial and industrial uses. This 45 degree aerial gives some perspective on kind of lot layout and scale of development in the area.'",
        "'speaker_8': 'These photos show development on and proximity to the site, including commercial development along federal directly to the west of the site. A view of the site from the corner of Federal and Holden Place. A view of the site from 10th Avenue showing the structure at 2929 West 10th that the city would like to repurpose image of the'",
        "'speaker_8': 'recreation center and park to the north. The middle photo there on the right side of the screen is development to the east of the site, across to Carter Street. And then finally. Bottom right there is some of the an example of the DHB housing in Sun Valley.'",
        "'speaker_8': 'And I should note that this may be somewhat out of date as I believe that redevelopment of that area into a kind of more of a mixed use development has recently begun, and some of those structures have been demolished.'",
        "'speaker_8': 'Again, this proposal is for C-Max five. That stands for Urban Center Neighborhood Context Mixed Use. With a maximum height of five storeys, the zone district promotes mixed use centers with moderate to high building heights, prioritizes an active pedestrian realm with high build to requirements and shallow setbacks, and is intended for redeveloping areas around transit stations.'",
        "'speaker_8': 'In terms of the process for this proposed rezoning, we received, we sent out the informational notice of receipt in April of last year. There have been multiple community meetings to present and discuss the project starting in June of 2017.'",
        "'speaker_8': 'The planning board hearing was held on in September. The planning board did recommend approval. The Land Use Transportation and Infrastructure Committee considered this rezoning on October in early October and the first reading at City Council was in mid-October.'",
        "'speaker_8': 'The final public hearing has been postponed a couple of times in order to provide time for the neighborhood association, the Sun Valley Community Coalition, to work with the the applicant and the proposed operator of the site on a good neighbor agreement addressing some neighbor concerns.'",
        "'speaker_8': 'The registered neighborhood organizations listed here consider the site to be within their boundary and all have been notified at multiple points throughout this rezoning. We have received several instances of written comment from the Sun Valley Community Coalition, which has voted to oppose this rezoning.'",
        "'speaker_8': 'The their full text of their of their comments is included in detail on the staff report. But to summarize, the neighborhood has indicated a desire that the crisis center be used for a youth facility. Among other things, to approve a rezoning.'",
        "'speaker_8': 'The as you know, the council must find that it is consistent with these five criteria from the Denver zoning code. With regard to the first criteria and consistency with adopted plans, there are three plans that affect the site, including that comprehensive plan and blueprint Denver and then the Decatur Federal Station Area Plan, which was adopted in 2013'",
        "'speaker_8': 'with regard to the comprehensive plan. This proposed rezoning would forward advance several policies and strategies in a comprehensive plan aimed at encouraging mixed use higher density development where people can live and work near high quality transit. The nearby Decatur Federal Station is a major rail and bus transit node.'",
        "'speaker_8': 'Blueprint identifies the majority of the site for transit oriented development and identifies the southern third of the site for employment uses and indicates that it are designated as an area of change. The site is served by a commercial arterial and enhanced transit corridor along federal and then a mixed use collector along the east side along Decatur and'",
        "'speaker_8': 'a residential collector to the south along 10th. All of these streets are consistent with recommendations for appropriate street types for the CMC's five zone district. The Decatur Federal Station area plan identifies the northern part of the site for transit oriented development and then identified the southern part of the site as employment transit oriented development, recognizing some of'",
        "'speaker_8': 'the existing industrial uses, especially south of 10th Avenue here. The plan also recommended a building height of five stories for the site. The kind of gray box you see in this map is actually the the Richard Castro Family Services Center.'",
        "'speaker_8': 'The map highlights some major public buildings in the area. With regard to the other criteria, this request will result in the uniform application of the CMC's, his own district's building form, use and design regulations. It will further the public health, safety and welfare by implementing adopted plans and policies for walkable development to support transit oriented redevelopment.'",
        "'speaker_8': 'And with regard to justifying circumstances. The applicant cited a change community change in the area, including the opening of the Decatur Federal RTD station and a major Denver Housing Authority redevelopment underway of the Sun Valley Homes to the Eco Village.'",
        "'speaker_8': 'Mixed use mixed income development. Finally, with regard to the final criteria, the urban center and neighborhood context is intended to promote pedestrian scaled areas that enhance the convenience and enjoyment of transit and walking. And the C-Max five zone district is appropriate for this location.'",
        "'speaker_8': 'Based on the criteria in the zoning code. So with that, CPD recommends approval based on a finding that all review criteria have been met. And I'm happy to answer any questions you may have.'",
        "'speaker_0': 'Thank you very much. There are 12 individuals signed up to speak this evening, so I'm going to call the first five up to this front bench so that we can get through everybody. The timer will start as soon as I call your name, so step right up to the microphone and start your remarks.'",
        "'speaker_0': 'First five, we have Jay Flynn, David Roybal, Kathleen Cronin, Jeannie Granville and Jerry Burton. So if you could come up to the first bench and J. Flynn your first.'",
        "'speaker_2': 'Good evening. My name is Jay Flynn, and I work at the Mental Health Center of Denver. I am also a citizen of the city and county of Denver. I wanted to share how important the services that will result in this zoning change are.'",
        "'speaker_2': 'I feel like they're essential to the well-being of the citizens of the city and county of Denver. I've been honored to work with the Neighborhood Degree Association on a Good Neighbor Agreement, which we have signed in which the neighborhood is assigned.'",
        "'speaker_2': 'And I believe in my heart that we will do a great job being a good part of the neighbor, could be a good neighbor and developing a program that will move Denver forward in its wellness and help citizens recover from their mental illness and help people in crisis early in their crisis, before their crisis reaches a proportion'",
        "'speaker_2': 'where they end up in jail or they end up a danger to themselves or in hospitalizations. I think this would be a really valuable service and we need this zoning change to make that happen. I appreciate the neighbors concerned.'",
        "'speaker_2': 'I understand that we've been in many meetings with them and I feel for them in my heart. I'm committed to making this an addition to the neighborhood that will make the neighborhood a safer place and not a more difficult place.'",
        "'speaker_2': 'Thank you so much and have a wonderful evening.'",
        "'speaker_0': 'Thank you. Next up, David Roybal.'",
        "'speaker_3': 'They Roy Barnes have a 42 West Ninth. Next representative for City Council District three. Born and raised in this area since 1987. Dealt with some very hard things in my life coming up. Nobody would have survived it, either be dead or in jail or prison.'",
        "'speaker_3': 'And here I am running for public office. And that's what the city deserves. Somebody that came from the bottom, from the ghetto that's been there, that when there's violence at the age of seven, you know, being hurt.'",
        "'speaker_0': 'Mr. Lane Could you could you speak to the issue at hand?'",
        "'speaker_10': 'Well, there's a lot of history to this place, you know, being there in 2003, me and my sister being there.'",
        "'speaker_3': 'In the Denver Crisis Center. So much hurt and pain from kids being removed out of homes in there and a lot of corruption, you know, teenage girls getting knocked up by staff there. You know, it's in the newspapers.'",
        "'speaker_3': 'I seen it. Witnessed it. And having to nonprofits, you know, close with in the last ten years within the Sun Valley a church a battered women's shelter. You know, I hope to see this get used for the community and not have not have this place open to outsiders to come use drugs.'",
        "'speaker_3': 'And with the high crime and 14th and federal, you know, that needs to be mentioned, me being there firsthand, dealing with it. You know, I hope this this helps the community better as a community and just not put more money to make.'",
        "'speaker_3': 'Because if it's a nonprofit was the highest paid nonprofit already working with the Denver Police Department. So, you know, they're going to get this contract. And then same with the building, with the human service rezoning that's going to be coming up.'",
        "'speaker_3': 'And the stadium, the new stadium redevelopment, it's a lot of a lot of building going on. And I think we're getting too head of.'",
        "'speaker_10': 'Ourselves because the city's already going to get it.'",
        "'speaker_3': 'When when the Castro building gets in the air, the Sun Valley is not for sale. We do not want it to be yuppie washed, like to five points. We don't want it to come turn it to some rich neighborhood that does not cherish the culture and history.'",
        "'speaker_3': 'And we hope that the culture and history and the new redevelopment of the Sun Valley makes makes a better neighborhood. So nobody have to go through what I've been through or my sister or other people been through. And I'm here and I'm a survivor.'",
        "'speaker_3': 'And if I get elected, I'm going to be right there in the front lines, pushing this this forward and making sure that that the power belongs to the people in the community and not know corruption, as I read developers, corporations, all that.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Kathleen Cronin.'",
        "'speaker_12': 'Thank you. Members of the council. I'm Kathleen Cronin. I'm the director of Earthlings.'",
        "'speaker_6': 'Earthlings works with the homeless population in Sun Valley.'",
        "'speaker_1': 'We're located at 2746 West 13th Avenue.'",
        "'speaker_12': 'We've been there in a home on a property owner, not a homeowner property owner there since 2013.'",
        "'speaker_6': 'I'm speaking in favor of the rezoning. I believe it is in keeping with the plans, as the PD folks.'",
        "'speaker_1': 'Have spoken about.'",
        "'speaker_12': 'I believe that the only objections that would be raised.'",
        "'speaker_1': 'To this is because of the planned use, which is to provide for mental health.'",
        "'speaker_6': 'Services for those folks that are experiencing homelessness.'",
        "'speaker_12': 'It would be our position.'",
        "'speaker_1': 'As Earthlings.'",
        "'speaker_12': 'That we would be in favor of this use and also in favor of the.'",
        "'speaker_6': 'Rezoning. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jeannie Granville.'",
        "'speaker_1': 'Good evening. My name is Jean Granville and I am here as president of the Sun Valley Community Coalition, which is the registered neighborhood organization. We have supported most recently several rezoning efforts that would allow for increased density of affordable housing.'",
        "'speaker_1': 'And we are currently have debated quite a bit and our initial vote for this particular rezoning was negative or not in support. And our update after we had worked extensively on a Gina continues to be not in support and that is for a couple of different reasons, one of which is that after an extensive period, six years'",
        "'speaker_1': 'since the Decatur Federal Station area plan, there has been a regular and, as I said, extensive zoning planning process that the city has chosen not to be involved in. I think that you saw the map which showed a lot of the housing density that would be in the upper half of the neighborhood and that the southern half'",
        "'speaker_1': 'would be more of an employment use. Since that plan was first developed, some of that housing has changed to now where we will have 2000 plus children living in DHP housing. That's not including some of the other housing that could also be built because DHS will be building density on a smaller print footprint, which will allow for'",
        "'speaker_1': 'even more housing. But 2000 children that will be literally right next door living and playing. And the concern is that with 2000 children, we already have vulnerable families living there that have experienced trauma for a wide variety of things, including domestic violence and issues related to mental health.'",
        "'speaker_1': 'As a vulnerable population. I think there is some concern that even with the Good Neighbor Agreement, which I do have to commend Mental Health Center and the Office of Behavioral Health Strategies for sitting with us that that that does not negate that there will continue to be those children right there at the doorstep.'",
        "'speaker_1': 'The other thing is, is that so and with that there was also a preference that the and had been talked really quite extensively since the FCC, the Family Crisis Center, had closed quite a bit of conversation about keeping that as a mental health service center.'",
        "'speaker_0': 'I'm sorry about your time as possible day treatment. Thank you. All right. Next up is Jerry Burton. And I'm going to invite Phil Kasper, Brian McCann, Chris Rolston to Poorer Towers and Jesse Paris to the front row. You will be next.'",
        "'speaker_7': 'Go ahead. Oh, thank you. My name is Jerry Burden. I'm a veteran. I'm homeless right now. But at the same time, I used to live over there at Decatur.'",
        "'speaker_14': 'Place apartment, me and my daughter.'",
        "'speaker_7': 'It's a good area. I mean, change is good, but at the same time, it isn't good if we use it for what we really need it to be used for. And I think I get doesn't want to see it become like five points.'",
        "'speaker_7': 'I can no longer move over. I can't Fivepoint used to be an area that was of people of color and I can move in over there no more. And I just don't want this area over here to be the same.'",
        "'speaker_7': 'It'll be good if you put more 0 to 30% apartments or whatever that people are that are experiencing or are unhoused right now that can be able to move into. And that's all I got to say on that matter.'",
        "'speaker_7': 'But as far as everything else, I'm down, but I'm not down because I know how things go. I it's funny, too, how every time we we make a decision, it's convenient for the councilman to make the decision and not and not put us first.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Phil Kasper.'",
        "'speaker_2': 'My name is Phil Kasper. I'm a 32 year resident of Denver. Dropped in the dirt here 60 years ago and I live at 2516 west holding 2516 West 13th Avenue. Most of the residents in Sun Valley have experienced homelessness and understand its stresses, challenges and tragedies.'",
        "'speaker_2': 'So it's not that we don't understand the needs of homelessness in our community. The fact is that our community is extremely stressed and we need to preserve a safe environment for the children that are there. We've worked 30 years to counter the negative aspects of 50 years of of being ignored by the city of Denver.'",
        "'speaker_2': 'So this community has the highest percentage of children in the state, and no other community in the country has been identified as having a higher percentage at 66% ten years ago. And the zoning change allows the city to impose uses that are not yet revealed to our community.'",
        "'speaker_2': 'Our objections revolve around the risk that the city will use the zoned campus for purposes that will injure the children and families and undo the work that's been done there. The city will place we are worried that the city will place a shooting gallery in the neighborhood.'",
        "'speaker_2': 'The prospects of having higher homeless population on the river. Mentally challenged individuals wandering through the neighborhood with 2000 children. The city now is not participating in the redevelopment of the Sun Valley Eco District to the extent that would inform us about the uses that are proposed for that property.'",
        "'speaker_2': 'We believe that those there are uses already identified. However, we have not been informed of them. There is a plan and it has not been revealed to us. Is there a plan to allow people to use Schedule one narcotics in any part of that site?'",
        "'speaker_2': 'Is there a conspiracy to circumvent federal drug laws? Will our taxes be used to defend in court challenges from the federal government? If council approves a drug shooting gallery for the zoned site that is 29, 29 or any other location in Denver.'",
        "'speaker_2': 'That's my biggest fear.'",
        "'speaker_0': 'Thank you. Next up, Brian McCann.'",
        "'speaker_7': 'Brian McCann. I live at 27, 27 West holding place, and I'm against the rezoning because I don't know what's going to be coming into the community. I'm a new face in the community, but still live there and it's getting better over the years that I've been there.'",
        "'speaker_7': 'But. I don't see the benefit of not telling us what the reasonings for. I do believe that most of my points have been spoken already and more will be coming up. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Chris Richardson.'",
        "'speaker_1': 'Good evening, everyone. Chris Larson. I run the Sun Valley Youth Center. My goal today was a filibuster and have a whole bunch of kids sitting here. And we decided not to do that. And here's why. Our families are afraid.'",
        "'speaker_1': 'They're afraid to come to the government right now and complain about anything. We're working with refugees and little kids. So I've been in Sun Valley 20 years. This is my 21st year. I don't age, though, guys, so it's okay.'",
        "'speaker_1': 'And I think the thing is, for years and years and years, we've been planning Sun Valley and now it's starting to come to the full development. There's actually cranes that have knocked down community housing. 58 families have now been displaced.'",
        "'speaker_1': 'People are afraid. They're afraid of what's coming in and they're afraid that we're not going to be good on all this planning for them and for the community. We've been talking about having spaces and places for kids like some of our kids have to go to the east side to receive mental health services.'",
        "'speaker_1': 'The building is no longer a crisis center. We're all in agreement that that was not a good place to have an orphanage where kids were emancipating. We're all about that. But we've been asking and advocating in 20 years of planning for a mental health middle school, for a mental health high school.'",
        "'speaker_1': 'We love mental health center of Denver for the purposes of youth and families. And so the concern for myself and for the youth in the community that I serve is how can we for a zoning use? And this is what's hard is that the zoning came to us with a youth attached to it.'",
        "'speaker_1': 'So that's why we're speaking to the youth so strongly. We don't know what's going on between that what's going to happen with the West Side Health Clinic. We've heard they're staying. We've heard they're going. That's really convenient for a family that doesn't have vehicles for single moms with lots of kids.'",
        "'speaker_1': 'We want to continue to keep some of those services there. So our biggest complaint is that this use does not meet any of the planning where we were talking about furthering and bettering our community. This isn't being designed for families to come.'",
        "'speaker_1': 'It's not being designed for single moms to go and get some parenting assistance and help and things like that. I think to Jean's point, when we were talking about the planning and all the housing going closer around the stadium, that's not the case anymore.'",
        "'speaker_1': 'All of the plans keep changing. So now all of the first phase of housing is going to be built correct directly right in the backyard. So when we took the kids up to the crisis center to go visit and see what this thing could look like, we're talking about people that are going through rehab and people that'",
        "'speaker_1': 'are going through treatment. I'm sure there's going to be drug use. I'm sure there's going to be smoking going right up into the kids balcony. We have kids with asthma. We have kids with all kinds of issues. So our biggest concern is that is now going to back right up into the community where there's already going to'",
        "'speaker_1': 'be 5000 kids coming in or 2000 or it doesn't even matter. 300 kids like we need to advocate for them because they aren't able to come and speak for themselves. And in a community where kids outnumber adults and it will continue to be that way as long as there's public housing going in which it is.'",
        "'speaker_1': 'We want to make sure that this space can be used for the betterment of their lives and in the betterment of their.'",
        "'speaker_12': 'Mental health as well.'",
        "'speaker_0': 'Thank you. Next up, tips for a tower.'",
        "'speaker_1': 'I'm going to stand next to her. Okay.'",
        "'speaker_6': 'My name's Zipporah and I've been going to this only church for a while. Okay.'",
        "'speaker_1': 'Sorry she was going to try and speak and she will not.'",
        "'speaker_0': 'Well, thank you for coming down. And thank you. Thank you very much. Next up, Jesse Paris.'",
        "'speaker_14': 'Good evening, members of council. My name is Jesse Paris. I'm representing for Denver Homicide Lao Black Star Action Movement for Self-defense and Positive Action Commitment for Change. And I'm also an at large candidate for 2019. We are definitely against this, especially after hearing all the testimony from the community.'",
        "'speaker_14': 'We do not have any kind of guarantee that this justice is going to be for what you say it is going to be for. The community has come out and let you know this straight up. So I would ask that you honor the wishes of the community and vote no on this proposed rezoning, because we don't need'",
        "'speaker_14': 'any more unintended consequences from these redevelopments, these rezonings, and these other things that you guys do. The community is fed up. This community has been ostracized. It's been neglected. And this is where the majority of children reside and live and play.'",
        "'speaker_14': 'And to see that you are not taking all of that into account. What this reasoning is a shame for this council. So with that being said, I urge you strongly urge you to vote no on this rezoning. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_2': 'Yes. My name is Chairman Sekou. Up next, Mayor City County of Denver, 2019, founder, organizer of Black Star Action Movement for Self-defense Defense. I'm going to speak from personal experience. I'm appliance. Image City. Me tell you what I went through with them.'",
        "'speaker_2': 'To court cases. Gentrification related because I refuse to use my Section eight to go outside the city. Four years. It took me to going to over 700 places in four years looking for a place in the city, countered Denver.'",
        "'speaker_2': 'They couldn't direct me to one. And when they couldn't do that, they moved to take the Section eight away from me. I had to go to court twice on the same day. Finally, Susan Fine, who's the Section eight federal representative, found me a place on the east side where I reside now 3421 Elm Street and 15 minutes'",
        "'speaker_2': '. The stuff in there is racist. As for the statistics as to how many black people do you have working in all of your sites? Ask not how many minorities. Oh, no, don't play that one, because you're going to find brown people.'",
        "'speaker_2': 'You're going to find women who qualify for minorities. I couldn't even get a black counselor. And when I asked for one, I demanded one. I had to go to court to get my ID. So they found me a student who just got out of college.'",
        "'speaker_2': 'No senior staff whatsoever. And then for the facility that's right behind me where I live on 34th, then Elm Street, the one that's located on your door, your diet, you check out the staff in there. They had four black people in their number now and they quit on the job because of racism, employment, bouncing Germans.'",
        "'speaker_0': 'Could you please speak to this zone.'",
        "'speaker_2': 'We're talking about? Did you get ready to do this whip? So this is apropos because you're asking me to support a corporation. That's racist. That's twice the premise. And they look for nothing but the gentrification of our neighborhood to establish white rule, including to step in.'",
        "'speaker_2': 'You better check out who you dealing with, because I'm coming up for certification and I have the strength and the courage to tell the truth about what you do to me. Yeah. And you say to people that Skip.'",
        "'speaker_2': 'Scared so they could lose their right to mental health and then boxes in the business of driving folks crazy. Were you in the mental health business to fix both? You be out of business. Think about it. And now they're increasing their services because they are in the process of not mental health, but mental.'",
        "'speaker_2': 'I'm sorry.'",
        "'speaker_0': 'Your time is up. Your time is up. Next up, we have Barry and Thompson.'",
        "'speaker_4': 'And that puts a lot.'",
        "'speaker_6': 'Good evening, counsel. People short and sweet. Just like I said before, gentrification. So you want Sun Valley to be another five point? Is that what you all want to do? What you say on paper and what you do are two different things.'",
        "'speaker_6': 'And for that I say nay. People in this in Sun Valley have gone through a lot of trauma. I grew up in a city in a barrio in Tucson, Arizona, with the same exact problems, with the exact same gentrification that went out.'",
        "'speaker_6': 'What happened? All white. Where would. Where were the minorities? Poor get poorer at the expense of rich people raping them. Nay, thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions from members of council? Councilman Brooks?'",
        "'speaker_3': 'Yes. Whoever put together the neighborhood agreement or the neighborhood who drafted that, worked on it over that is. Just come to the mike. So this this bill was postponed because the neighborhood agreement was not yet executed and fulfilled.'",
        "'speaker_3': 'And now are we to understand that it's been fulfilled now?'",
        "'speaker_2': 'Yes, that's correct. It's been finished and signed on both parties.'",
        "'speaker_3': 'Okay. So their comment saying that the execution of this actual facility may not be for those who are experiencing homelessness. Is that fulfilled in the neighborhood agreement? Is that spelled out? How many people will you be serving?'",
        "'speaker_2': 'Yes, that I believe is really clear in terms of who will serve. How many people we serve, how many people we serve at a time. And what the service was will look like. And it will be for people experiencing a mental health crisis and.'",
        "'speaker_3': 'How many formerly homeless.'",
        "'speaker_2': 'We don't know how many will be technically homeless. We won't discriminate based on whether somebody's homeless or has a house. If they're in a mental health crisis, they can be served. They're okay. We expect that a number of them will indeed be homeless or a larger percent will be homeless.'",
        "'speaker_3': 'How many will you be serving?'",
        "'speaker_2': 'I guess our crisis unit will have 16 people and our we'll have 30 transition beds where people can stay 30 days so that we're not releasing people straight out into the street but have time to find them. Longer term housing.'",
        "'speaker_3': 'Okay, great. And for the neighborhood that signed on, you didn't have any disagreement with signing on? Is that what I'm hearing?'",
        "'speaker_1': 'I think that if you read the comments in my update, we felt that it was in the best. We were involved in discussions on this. After the fact, the city went ahead and filed. We reached out to invite them to come talk about the zoning.'",
        "'speaker_1': 'And at that time, it was disclosed that the reason for the rezoning was to allow for the because the the the crisis center building had to be re zoned in order to allow for its use as a as an adult facility.'",
        "'speaker_1': 'Our first after several conversations, our first vote was no, but we did get a very strong impression that the city was determined. And we looked at other we offered other kinds of alternative plans and uses and even saying, could it be for women and and children?'",
        "'speaker_1': 'You know, women primarily because that's more reflective of our current population. Those were all kind of rejected. And so it was felt that in the best interest of the neighborhood that we frankly enter into our start the process of working on a good neighbor agreement to really try and get some accountability and oversight and potential protection for'",
        "'speaker_1': 'some of the concerns and get getting some of the concerns addressed even with that. Then after we looked at to sign the GINA and the reason for signing the Gina was because we were told really clearly that frankly, there wouldn't be a lot of incentive to accept that.'",
        "'speaker_1': 'Gina if it passed and we hadn't signed it. We went ahead and did it. There were still people who felt that they were doing it reluctantly and had no choice.'",
        "'speaker_3': 'Thank you. Okay, ma'am, did you did you have some. No, I'm sorry.'",
        "'speaker_1': 'We just you asked for everybody. That was a part of it. So I was.'",
        "'speaker_12': 'Like, yes.'",
        "'speaker_0': 'If you're going to could you come up to the microphone, answer that question so that everybody watching on can hear you, too?'",
        "'speaker_1': 'Yeah. So to Jean's point, yeah, I think we signed it, because if there's a use coming that we really can't stop, we want to make sure that we have some power in that agreement, if that makes any sense.'",
        "'speaker_1': 'So we did end up having to have a mediator help us do that good neighbor agreement. So it was not a simple process, took lots and lots and lots of writing, but we got to the point where we all feel comfortable with 90% of it.'",
        "'speaker_1': 'There's still a lot of it that we don't feel comfortable because part of it is with the city and the city doesn't do a good neighbor agreement.'",
        "'speaker_2': 'Okay. Thank you. And I can say for mental health Senator Denver and I can just say it, but we we really would have been happy to sign a good neighbor agreement. In any case, we have good neighbor agreements with pretty much all the neighbors, many of the neighborhoods, most of the neighborhoods we're in already.'",
        "'speaker_2': 'And our anticipation was whether there was a conflict in zoning or not. We would have signed a good neighbor agreement.'",
        "'speaker_3': 'And tell me your name, sir.'",
        "'speaker_2': 'I'm Jake Flynn. I'm the vice president for adult services with Mental Health Center of Denver.'",
        "'speaker_3': 'Mr. Flynn well, one last question here for you, sir. You can still sign a good neighbor agreement that does not have to be tied to the zoning. So would you be willing to enter into kind of an hours of operation agreement, how the facility would be run when a facility is shut down from the hours of operation'",
        "'speaker_3': ', things like that?'",
        "'speaker_2': 'Yeah. Yes. And we have indeed signed this good neighbor agreement already. And I think we would have been happy to sign one very similar to the one we came out with. My biggest our biggest conversation points were about making sure that the Good Neighborhood Agreement respected sort of the rights and dignity of the people we would serve'",
        "'speaker_2': 'in treating them like people and not like possessions.'",
        "'speaker_3': 'Thank you, Mr. Flynn. Andrew, one quick question. I don't know if you can pull up the surrounding. I just want to get to the context, the question before. For us is not the use, but it's actually the rezoning.'",
        "'speaker_3': 'But. You know, city council. One of our criteria is health, safety and welfare. So I want to make sure I ask that question about the use. This currently is. It's a PD.'",
        "'speaker_8': 'That's correct.'",
        "'speaker_3': 'And under the PD, what's the height limit?'",
        "'speaker_8': 'The party does not actually stipulate height limits. I don't believe it just lists, uses and floor area ratio of the.'",
        "'speaker_3': 'Hot talking ability be built on this from the floor area.'",
        "'speaker_8': 'Depend on on the on how much parking was needed to be provided. So it would vary but probably similar to what is allowed now or similar to what is proposed by the the the proposed new zone district.'",
        "'speaker_3': 'Could you get something over 60 feet? 56 feet? From our standpoint.'",
        "'speaker_8': 'It would depend, you know, if if a large amount of the site was left empty. Yep. You could possibly. Yes. Okay.'",
        "'speaker_3': 'And so looking looking around the area, it looks like there is some same x five. There is a max eight. Is that in the orange?'",
        "'speaker_8': 'In the orange is S.R. X eight, which is the residential mixed use district. And then there is CMCs eight and red up to the north and east of the site.'",
        "'speaker_3': 'Okay. So you concur this plan, support to support the Arizona.'",
        "'speaker_8': 'Absolutely. The plan support from Blueprint and the Decatur federal plan are very clear. Okay.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thanks. Thank you. Councilman Brooks, Councilman Espinosa.'",
        "'speaker_3': 'Can you stick around? So help me out here. You know, a lot of the conversation has been centered on on 29, 28. West was 10th. But were the rezonings for the entire Peddie area? Is that correct? That's right.'",
        "'speaker_8': 'That is correct. The PD, when it was originally adopted in 1999, had two sub areas. One of them is the one that we're considering that you're considering this evening. And the other one is the site that is essentially to the north, the northeast corner of the site, so framed by Decatur and Holden place.'",
        "'speaker_8': 'It's now CM five and is shown on this map is kind of just mixed in with additional CM X five to the east but it was zoned in 2017.'",
        "'speaker_3': 'So so 19 do you know. So in 1999 the LPA for the for the West Line was established. Do you know if this PD predated or postdated that?'",
        "'speaker_8': 'I do not.'",
        "'speaker_3': 'Because one of the things I'm struggling with is it would be one thing if we were talking about a rezoning of the of the the zone lot that sort of well, we are talking about the entire zone lot.'",
        "'speaker_3': 'But if we were talking about the parcel that captures the the subject property, because this is this an area that is six times over six times bigger than just where 2929 is. And and, you know, APD is is got a lot of a lot of constraints to it by design.'",
        "'speaker_3': 'So that was a negotiated outcome sort of well was well aware of where we were going and where we were headed. I think the only sort of new thing over there is the Lakewood Gulch, you know, the widening that sort of got expedited by the tragedy.'",
        "'speaker_3': 'But I don't know, maybe urban drainage probably had plans for that. Even that predated 99. I don't know. So I'm I'm struggling with the area did what was this the planning board's recommendation by.'",
        "'speaker_8': 'The planning board recommended to approve the rezoning. And I think the main reason for the proposing to amend the whole thing is several fold. One is that it is a former Chapter 59 PD with for a ratio and other calculations that are essentially based on the the area of of what is we're currently talking about tonight which'",
        "'speaker_8': 'was technically called sub area two in the original PD. So amending out just a section of it. The code doesn't provide really for amending out just a section of of an old code PD unless it has already identified that area in some way.'",
        "'speaker_3': 'So you'd almost have to amend the PD first before then rezoning.'",
        "'speaker_8': 'That's right. Just a.'",
        "'speaker_3': 'Partial. So too. Then this gets to the slide about future street types. You're you're referencing future city types in the zoning district standards don't make any reference to commercial arterial or enhance transit corridors. So what are the street types using the existing designations?'",
        "'speaker_8': 'I want to make sure I understand the question.'",
        "'speaker_3': 'The existing the existing street designations. So. So if I look at the district standards and I've got them here. If I can call them up. Oops, the you know, it references arterials and collectors. Right. And so not commercial arterials and enhance transit corridor.'",
        "'speaker_3': 'So is that a collector? I mean I mean, is that an arterial.'",
        "'speaker_8': 'That federal is an arterial? And is it designated specifically as a commercial arterial and separately as an enhanced transit corridor?'",
        "'speaker_3': 'The reason why I'm asking is that we actually in the zoning code, we actually designate arterial and then we make a distinction called major arterial. Is federal considered a major arterial?'",
        "'speaker_8': 'I would have to look at how how public works designates them. As you may know, public works has a slightly different map. Most recently published, I believe in 2017 that that does have some current street designations. I would have to look at that and confirm.'",
        "'speaker_8': 'I would be surprised, however, if Federal was not considered a major arterial.'",
        "'speaker_3': 'Because it specifically says CMC's five applies to areas or intersections that are primarily by collector or arterial streets. Right. And that's true for the eight story category. But then for for trawl at 12, 16 and 18, it's primarily served by major arterial streets.'",
        "'speaker_3': 'It doesn't even mention collectors. And so this is what is giving me pause is we're talking about a sixth of a property that is on what I would probably suspect that Public Works considers a major arterial. We are definitely within a half a quarter mile of of of a major trans high frequency transit corridor.'",
        "'speaker_3': 'It's it's an enhanced transit corridor. It's a commercial arterial. We're definitely within a quarter mile of the light rail station, definitely within a quarter mile of a major park and system. And so. I am I am struggling here.'",
        "'speaker_3': 'So the last. So I'm curious, did any of that come up in a planning board?'",
        "'speaker_8': 'It did not. Are you thinking about the is it is it the the designation of the of the five storey height limit? Or are you thinking that maybe perhaps I should be.'",
        "'speaker_3': 'Looking at the Decatur Federal Station area, I mean, station area plan language that's cited in the staff report and it says encouraging mixed in the character area that this is part of it says that the encouraging mix of building heights and variations formed respect maximum of building heights of 5 to 12.'",
        "'speaker_3': 'This plan, this map seems to suggest it's five only. But the language actually shows that variety in this particular area. And so I'm just going and looking at the level of investment that we are making today in federal we have historically made in the East West connections and wondering why why were if there's any other dialog or'",
        "'speaker_3': 'just simply because, again, I'm not struggling with this. If we're only talking about the piece that's on the collector street but the six times folded this it's placement, it's proximity to this level investment. I have to contemplate the balance of this property with respect to everything else.'",
        "'speaker_3': 'So that's why Mike and my questions. Thanks.'",
        "'speaker_0': 'Thanks. Thank you. Councilman Espinosa. Councilman Lopez.'",
        "'speaker_10': 'Thank you, Mr. President. I wanted to ask Jeff Holliday if you can come up somebody from Denver Human Services or Office of Behavioral Health. I'm going to ask some questions about the Good Neighbor agreement. Where does the Good Neighbor agreement live in?'",
        "'speaker_10': 'How is it.'",
        "'speaker_7': 'Enforced? I'm sorry, Councilman Lopez. I couldn't hear the last part of your your comment.'",
        "'speaker_10': 'Good neighborhood agreement that was signed. Where does that live? Where does that live long term? How is it enforced? And I saw provisions on it on reporting out. So walk walk that through for us and for the folks here in this room just to understand what this is, what the agreements are, and how is this a document'",
        "'speaker_10': 'that's going to see life?'",
        "'speaker_7': 'Thank you for the question. So ostensibly, the Good Neighbor Agreement lives between both parties. Mental Health Center of Denver and the Sun Valley Community Coalition as a as a third party Office of Behavioral Health Strategies will monitor when services are stood up in the building the the services that are being rendered.'",
        "'speaker_7': 'You'll notice in the Good Neighbor Agreement that it references a community advisory committee. Neighbor advisory committee, I think is is how it's it's framed in the good neighbor agreement. You'll also notice that my office is a party to that neighborhood advisory committee.'",
        "'speaker_7': 'And so my role in part is to ensure that the provisions of the Good Neighbor Agreement, as they're agreed upon between the parties, is appropriately addressed as a function of that meeting.'",
        "'speaker_10': 'Why doesn't the.'",
        "'speaker_0': 'The.'",
        "'speaker_10': 'The neighborhood advisory committee a party here on page seven. Number three. Is there is is there any reason why it's not specifically mentioned.'",
        "'speaker_7': 'Say the first part again. Councilman Lopez, I'm having a hard time hearing what you're what you're saying. Sorry. It's just my is my bad ears.'",
        "'speaker_10': 'No, no, no. It's okay. Good neighborhood agreement. Page seven says a specific information to be contained in these reports will be agreed upon between the Office of Behavioral Health Strategies, Sun Valley Community Coalition and MHC d. Why didn't we include a neighborhood advisory committee in their.'",
        "'speaker_7': 'I'm not sure I understand your question, but the good neighbor agreement. I could grab my copy and take a look at this specific reference.'",
        "'speaker_10': 'Oh, let me let me just repeat this. So the office so the specific information to be contained in these reports, this is the Good Neighbor Agreement. Page seven will be agreed agreed upon between Office of Behavioral Health Strategies, Sun Valley Community Coalition and Mental Health Centers of Denver.'",
        "'speaker_10': 'My question is, is why wasn't why isn't the NPC, the Neighborhood Advisory Committee included in there? Is it? I see that there's the Sun Valley Community Coalition. Is it because they're parties of that? They make up the NCC?'",
        "'speaker_10': 'I was wondering why the NAACP was not just. Put out in here in terms of reporting?'",
        "'speaker_7': 'Well, I can't presume to know how each party was thinking, except what I would say in my involvement is, at least from my perspective, where we addressed the Neighborhood Advisory Committee and the work that that committee would do on an ongoing basis satisfied the concerns that were raised as a part of the of the mediation.'",
        "'speaker_10': 'Okay. Who's enforcing the genny? If something if there is a complaint, let's say, if there is an issue that arises that purports to violate the agreement. How is that enforced? What happens?'",
        "'speaker_7': 'So the parties that are named as as participants in the Neighborhood Advisory Committee as as a as a starting point, would engage in a and a consensus building activity where there are points of disagreement. If the dispute if that doesn't resolve it, then they would bring the matter to myself and whomever is the expanding authority of the'",
        "'speaker_7': 'services contract once that is left.'",
        "'speaker_10': 'One more question on on this particular let me just go forward that MHC is the provider in the Good Neighborhood Agreement. The city can switch providers, right. We have to still do we have to have an agreement with them to provide services, a service agreement that that.'",
        "'speaker_7': 'That's correct. Councilman Lopez. If the city were not happy with the services that were being provided by MHC, they could certainly seek a different vendor for those services.'",
        "'speaker_10': 'What happens to the Good Neighbor Agreement if we seek another vendor?'",
        "'speaker_7': 'The Good Neighbor agreement would presumably. It's a good question. Currently, the good neighbor agreement is is a requirement for for the vendor, I presume that that would carry over. Certainly that would be my my perspective, that I would want to see any vendor that goes into that space.'",
        "'speaker_7': 'If it weren't MH CD enter into a good neighbor agreement with the community on record.'",
        "'speaker_10': 'Could you make a commitment and can the city make a commitment on making sure that any subsequent vendor that the Good Neighborhood Agreement could live, that it would be required that they enter into that at least be as a signatory to this good neighborhood agreement?'",
        "'speaker_7': 'Well, I would make a commitment on behalf of my office as somebody who oversees the the service contract, that if if an occasion arose where we had a different vendor, that I would require that they enter into a good neighbor agreement with the community.'",
        "'speaker_10': 'Is that in jeopardy? Mr.. HALL. Let me ask I'm looking to the administration. Is this something that. Is this is this good neighborhood agreement, good for any other vendor? Is this a requirement for end? Are we willing as a city if, let's say that another vendor comes in or bids in the future, does this good neighbor agreement'",
        "'speaker_10': ', are we going to require that they be a signatory to that?'",
        "'speaker_12': 'Councilman. I'm going to jump in here. Sky Stuart mayor's office. It was a requirement.'",
        "'speaker_1': 'In the RFP. We issued that any provider have a.'",
        "'speaker_12': 'Good neighbor agreement, so we're going to continue to have that requirement in place.'",
        "'speaker_10': 'Okay. Thank you. The current site and I'm going to look at CPD the uses are there and what we're understand is that there has been a use that has been defined. Have I heard testimony that people are not aware of what the use will be?'",
        "'speaker_10': 'What are the current uses of the PD and explained to me is my understanding that in order for the Family Crisis Center to be utilized in a way that would help homeless individuals and provide these services, that's not allowed in the current PD, that you'd have to change the whole rezoning to allow that.'",
        "'speaker_10': 'PD What's allowed now? Like what are the uses now? From what I understand, because I only all disclosure, I live about five, five and a half blocks from the site. Sure. So I know it is the Castro building and the Sam Sound website health clinic and the Family Crisis Center, which is now empty.'",
        "'speaker_8': 'That's correct. So those three uses that you just mentioned are permitted uses. The PD allows for an office use that covers the the the Castro Center, a health care facility use with overnight stays for the for the clinic and then for for this component of the site.'",
        "'speaker_8': 'It allows and I have the language here up on screen. I'm not sure if you if you're able to see it, it allows day and night care facilities for youth 0 to 12 years of age. And then finally the PD allows parking.'",
        "'speaker_10': 'Okay. And my last question is I I'll just if I may, Mr. President, just one one more is if I can ask Lisa Lumley, the division of Real Estate. There are fears that we heard in this hearing tonight that there's going to be gentrification and redevelopment and that the city can do something with this site, that we'",
        "'speaker_10': 'would sell it, that there are other uses. You are the division or you represent the division of real estate in the city. Is there any offer on these sites? Is there any intent to sell any of these properties that are under question to any kind of third party?'",
        "'speaker_10': 'Or are we going to develop it into anything aside from what's there?'",
        "'speaker_12': 'Good evening, Lisa. Lovely division of real estate. No, actually, I can let you know that Human Service has approval to move forward to invest significant amount of money in the building to retrofit an upgraded.'",
        "'speaker_10': 'In the Castro building.'",
        "'speaker_12': 'Yes, in the Castro building. I'm sorry. And so the plans are to stay put. We are not looking to redevelop the site. It is a full investment from human service that they intend to be in that community and continue to serve it.'",
        "'speaker_12': 'This is just about trying to address the use the the existing produce for the Family Crisis Center, knowing it's a city owned building that for the majority of it has to sit empty because it's non-compliant in its current state.'",
        "'speaker_10': 'What about Denver health in particular? Sam Sanders, The Westside Health Clinic? Is there any intent on them or interest on them in leaving?'",
        "'speaker_12': 'Not that I'm aware of. I can't speak on behalf of Denver Health, but not that I've had any conversations with.'",
        "'speaker_10': 'Okay, all. Thank you.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Lopez. Councilman Black.'",
        "'speaker_1': 'Thank you, Mr. President. Most of my questions have been answered. I just had.'",
        "'speaker_6': 'One question.'",
        "'speaker_1': 'For you, Andrew. I noticed there was just one no vote from the planning board. Did that person explain why they voted no?'",
        "'speaker_8': 'Yes. There was one no vote from from someone who works in that area of the city. And I believe her explanation was that she wanted to to indicate her support for community members that were in opposition.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Councilwoman Black. Councilman Flynn.'",
        "'speaker_7': 'Mr. President, I'm sure that under the I was looking through the staff report and the all the various the the original pad in 99 and because we're rezoning the entire pad, not just 29, 29. I'm curious what other restrictions and stipulations were made in that that are going to expire by virtue of approving this over the entire'",
        "'speaker_7': 'site rather than just the old family crisis center? What what else? What other protections and stipulations is the neighborhood losing by by eliminating the PD?'",
        "'speaker_8': 'The the regulation that you see on screen here about the day and night care and therapy facility for youth is probably the most the most limited requirement or allowance use allowance in the current.'",
        "'speaker_7': 'But I think some of the other restrictions had to do with parking, mostly parking.'",
        "'speaker_8': 'Exactly.'",
        "'speaker_7': 'That's requirements, etc., setbacks.'",
        "'speaker_8': 'That's correct. And and so the new the new zoning, the CMC's zoning allows for a more pedestrian oriented built environment and potentially less parking than would be off street parking would be required by this this older PD.'",
        "'speaker_7': 'Mm hmm. Councilman Espinosa, right out of the box, asked most of the questions that were also on my mind. But one other. Since you have that up on the screen, would it have been possible to amend the PD simply to take that out and just leave it as a PD, but replace that one phrase to take out'",
        "'speaker_7': 'the 0 to 12 year old clients and allow 18 and above.'",
        "'speaker_8': 'We we don't really have a pathway currently that is in use to amend old code PDS and the policy has been to find appropriate new code zone districts to replace those PDS.'",
        "'speaker_7': 'To your knowledge, is this the first PD that at least since since in this term of the council that where we are rezoning the entire PD to something else but only because of a one of the parcels in it if you can.'",
        "'speaker_7': 'You understand the.'",
        "'speaker_8': 'Question? I do. I do understand.'",
        "'speaker_7': 'It seems to me the other times we've eliminated PDS and replaced it with 2010 zoning. The reason was the entire.'",
        "'speaker_8': 'That's right.'",
        "'speaker_7': 'Acreage of that had to be defended, too. Right. But here we're only looking at the Family Crisis Center. And can you think of another PD that we've eliminated that dealt only with a small parcel?'",
        "'speaker_8': 'I can't think of one specifically a rezoning that was specifically because of a small parcel. But some of the some of your colleagues in the council may recall a rezoning like that.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_0': 'Councilman connected. You want to help answer that?'",
        "'speaker_1': 'We did a rezoning of a pad because of a walkway limitation, because the walkway violated the PD. So we did an entire PD rezoning because a walkway didn't fit the criteria.'",
        "'speaker_6': 'For the entire site.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Flynn and Councilwoman Kennedy. Next up, Councilwoman Ortega.'",
        "'speaker_9': 'That's one point. I'm doing okay. Thank you, Mr. President. I also have a couple of questions. Mr. Holiday, would you mind coming forward? What are the current, I don't know, uses or operations that are occurring in that building today?'",
        "'speaker_7': 'Councilwoman Ortega I would have to defer to our DHS colleagues that own services that are going on in that building today.'",
        "'speaker_9': 'What do you hear from DHS? Would you mind coming forward, whoever the.'",
        "'speaker_1': 'Good evening, counsel. Bettina Schneider. I'm the chief financial officer at Denver Human Services. Currently, we operate the ordering process with our child welfare division, child protection division. There is a Denver Police Department presence there that interviews the kids.'",
        "'speaker_1': 'There is a pediatric clinic from Denver Health. It is a closed network, so we don't have kids. Just walk in and say, hey, I want to see a doctor.'",
        "'speaker_12': 'We would send them to.'",
        "'speaker_1': 'West Side across the parking lot. So we do have a current operation in that building.'",
        "'speaker_9': 'So how does this change? Assuming this zoning passes tonight and MHC is able to put their clients into the building.'",
        "'speaker_1': 'We are looking to relocate the order in process to a different city building. I'm the one we're looking at right now is at 405 South Platte.'",
        "'speaker_9': 'And what's the timing of that?'",
        "'speaker_1': 'We've actually already hired an architect. So looking at converting basically like a warehouse office building into a medical clinic, a space for the district attorney's office and the city attorney's office. They actually have a presence at the FCC building now as well.'",
        "'speaker_1': 'And for our staff and child protection. So I'm sorry, the timing of it, we were hoping to have it completed by May or June, but it's construction takes a remodeling.'",
        "'speaker_9': 'So will that take up that entire property at 405 South Platte?'",
        "'speaker_1': 'We will use the first and second floors. It's a three story building. The first and second floors would take care of the ordering process. And we're looking to relocate some administrative staff to the third floor of that building.'",
        "'speaker_6': 'Okay.'",
        "'speaker_9': 'And will any of that include beds?'",
        "'speaker_1': 'Bed space. Yeah, we are looking at it so that we need a washer and dryer and there would be like a sleeping area and it would be an emergency type situation if kids had to spend the night because we couldn't find a placement for them.'",
        "'speaker_9': 'Similar to the way that the current location operated?'",
        "'speaker_1': 'Yes, absolutely. Yeah. We're not looking to change the current operation.'",
        "'speaker_12': 'Just move it to a new location.'",
        "'speaker_9': 'Right, right, right. So you're not going to have classrooms in some of these.'",
        "'speaker_0': 'Kids will not take it. Sorry to jump in. If there are questions about what's going to happen at 405.'",
        "'speaker_9': 'This is directly related. This is directly related. And it's important to know and understand, you know, the sequencing of what's happening here. So that's helpful. Thank you. I have no no further questions. So how soon would it mean planned to be in this building, assuming this passes tonight, Mr. Flynn?'",
        "'speaker_2': 'My understanding is that given the scheduling of moving some of the present folks that are working there out to the South Platte building, that we would at the earliest start operation in March of 2020 and somewhat more likely June of 2020.'",
        "'speaker_9': 'So so this move would require it made CD to do some major renovation of the building.'",
        "'speaker_2': 'Yeah, we're planning it with the city, and the city's actually doing the renovation. Okay.'",
        "'speaker_9': 'Can somebody speak to what that cost is? Lisa, I'm looking at you, but I don't know if there's somebody else that could speak to what it will cost to do the renovation of this building.'",
        "'speaker_12': 'Councilwoman. I don't know that I have an exact number today. I know that they've been trying to work on it and work on the timing as certain things have been delayed, they've had to adjust. That's something that we can get back to you on.'",
        "'speaker_12': 'Okay.'",
        "'speaker_9': 'So I guess I'm trying to understand because the building we're moving the kids to is the very building that MHC was originally going to go into for this very purpose for the solution center. And I'm trying to understand if there's a huge cost difference between what they would have spent there.'",
        "'speaker_9': 'I know it's a much more it's a whole different building. It's more of a commercial building.'",
        "'speaker_12': 'What I would say is that the the reason the Family Crisis Center was considered after four or five was given, it's build out and it's residential the way it had been originally built, residential, even though it was for youth versus adults.'",
        "'speaker_12': 'I don't know that. I don't know how how huge the cost differences. And like I said, we can get back to you on that. I know the part of that cost difference is going to Albertina Luft play into human services.'",
        "'speaker_12': 'Oh, I'm sorry. I'm sorry. It part of that will play into those some of what she mentioned the administration for moving some people from Castro down that will help their overcrowding as well. So there'll be a blending of that at the four or five building.'",
        "'speaker_9': 'All right. And someone that can speak to the agreement, will sex offenders be allowed at the site?'",
        "'speaker_2': 'No, we are not allowing any registered sex offenders at the site.'",
        "'speaker_9': 'Who's going to do the screening?'",
        "'speaker_2': 'We're asking the police to do the initial screening. And when people get to the site, we'll also run a callback, a CBI background check. But we'll ask the police first because most folks will be coming to the site via first responders.'",
        "'speaker_2': 'The concept is first responders bring people to the site, then there are no walk ins, so nobody can just simply walk in and present for services. It's really geared to help first responders who are in the field working with people who should not be arrested.'",
        "'speaker_2': 'There's no reason to arrest them, but they are in a crisis.'",
        "'speaker_9': 'So, Jay, I just want to ask Mr. Flynn, I should say sorry, how what's the difference between how many people were going to be served at the solution center, at the old location versus this location?'",
        "'speaker_2': 'The plan is the same.'",
        "'speaker_9': 'Exactly the same. Can you just tell us why that was? That site was rejected over this one. I mean, this one wasn't even on the table.'",
        "'speaker_2': 'But I'm you know, I would have to defer to the city in terms of why they changed the plan for the building. My understanding was that the first building is much more expensive to renovate.'",
        "'speaker_9': 'Okay, I thought it was an MHC decision, but I could be wrong about that. So there's someone that can just speak to that that would be helpful.'",
        "'speaker_8': 'Tyler Jacko at the Department of Finance.'",
        "'speaker_14': 'So the main reason why four.'",
        "'speaker_8': 'Or five was not an.'",
        "'speaker_14': 'Appropriate use was because after further discussion about both programing for the site.'",
        "'speaker_10': 'As well as renovation.'",
        "'speaker_8': 'The best case scenario for the site was actually demolish.'",
        "'speaker_14': 'The building.'",
        "'speaker_10': 'And rebuild.'",
        "'speaker_8': 'And on that particular site there was actual when you go through that process, there'd be a lot of environmental remediation driving up the costs of trying to do the same services on that particular site to an enormous degree.'",
        "'speaker_8': 'I think we're talking almost five years ago, close to $7 million to do that entire process, which.'",
        "'speaker_14': 'We're just estimates. And given all estimates and construction.'",
        "'speaker_8': 'Over the years, those have come up woefully short. So imagining that costs would go up over.'",
        "'speaker_9': 'Time, did we not do a Phase one environmental when we purchased that?'",
        "'speaker_10': 'It was a part.'",
        "'speaker_14': 'Of the process, so we were actually having to go through the.'",
        "'speaker_8': 'Purchase of the building at the same time of kind of looking for a particular user.'",
        "'speaker_14': 'So it was done, so was.'",
        "'speaker_8': 'Known of those particular pieces, but that wouldn't be affected if you're renovating the building versus actually demolishing and rebuilding.'",
        "'speaker_9': 'I have two other very brief questions, but if you want to defer to others and put me in the back of the queue, I'm okay with that. Okay.'",
        "'speaker_0': 'Thank you, Councilwoman. Naughty Councilman.'",
        "'speaker_11': 'Yes, Mr. Flynn. Mr. Flynn, can I ask a question?'",
        "'speaker_2': 'Of course.'",
        "'speaker_11': 'Sir. Just on the Good Neighbor Agreement, do you have a copy of.'",
        "'speaker_2': 'I think the city council has a copy and Jeff has a copy. I know, but you can certainly ask me a question. I'm very familiar with the.'",
        "'speaker_11': 'Okay. Again, on page three, I like you mentioned about sex offenders. I guess there's about five other categories of individuals that would not be admitted to to the service right. Persons in need of a 72 hour hold.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_11': 'Under arrest, medical crisis, chemical dependency, alcohol plants, not appropriate for a shelter is wrong. And will the police be triaging all those? Categories of anyone they bring over to the solution center.'",
        "'speaker_2': 'Yeah, they will triage as well as they're able. And then we will have nurses at the solution center. So they will do another triage. Just some somebody gets there and we find out, for instance, they have a bad head wound and we would call an ambulance and move them to a hospital like Denver Health where they could'",
        "'speaker_2': 'get the medical care they need.'",
        "'speaker_11': 'So the police missed one of these categories. Then your staff, when they do their triage, they pick up on it. What happens then is then in there, in the section you goes about unplanned discharges. It talks about security officers, where they're going to be held there until they find transportation or they're going to be escorted to federal'",
        "'speaker_11': '. What's going to happen with that, that patient?'",
        "'speaker_2': 'So, for instance, if somebody comes and the police thought they did not need to be placed on a 72 hour hold, but we find they are an imminent danger to themselves and they're likely to hurt themselves quickly or soon and need to hold.'",
        "'speaker_2': 'We'll place them on a hold there, call an ambulance and get them to go and move them, transport them to a higher level of service. So if somebody most of these categories are for folks who need a higher level of service, so instead of turning them loose in the street, we're going to get them to that higher'",
        "'speaker_2': 'level of service.'",
        "'speaker_11': 'And will a police officer stay there until you do that triage?'",
        "'speaker_2': 'Yeah, they'll stay there. The plan is. They'll stay there, too. We do, too. Indeed. Until we do that initial triage.'",
        "'speaker_11': 'Okay. And so that any in any other unplanned discharge like that, the security officer will escort that that that patient, their client to the bus driver to.'",
        "'speaker_2': 'Yeah, that's correct. And that would only be for unplanned discharges or for people who did not need to be placed on a hold, weren't dangerous, but still wanted to leave. We'd make sure they got out of the neighborhood with the safety officer.'",
        "'speaker_11': 'Well, safety and security has been, you know, a big issue. And you've heard it tonight. It's been a big concern of mine. And so I just want to make sure you've tightened up all that security so there won't be any patients released to go into the community that's not unescorted or you'll be able to manage that.'",
        "'speaker_2': 'Yes. For people for unplanned discharges. We know that in the 30 day program, we'll have lots of people that we want to leave the program to go look for housing. Part of our plan, for instance, in the morning when kids are at bus stops, we're going to have staff go over there with them to make sure everything's'",
        "'speaker_2': 'calm. At the bus stop on federal, we're going to have two safety officers on staff 24 hours a day, seven days a week.'",
        "'speaker_11': 'That's good. At 30 days, I should be more stabilized than obviously when they first come to you.'",
        "'speaker_2': 'So that's certainly our hope.'",
        "'speaker_11': 'Okay. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman new Councilwoman Cannick.'",
        "'speaker_1': 'Thank you very much. My first question I think is from you, Mr. Flynn, which is, is there any plan to use this site for supervised injection?'",
        "'speaker_2': 'Not in the part of MGD and not in part of the city that I know of. And I have not heard anybody say anything to that effect, certainly not on the first floor and third floor that we'll be using.'",
        "'speaker_2': 'Absolutely no planning for any such thing.'",
        "'speaker_1': 'And Councilman Brooks, as someone who's been involved in this conversation, have you seen any proposal to use any site in this site that's being zoned today for that use?'",
        "'speaker_3': 'Councilman, thank you for the question. We have not even begin to look at location for sites. So it's absolutely ridiculous for us to even think about this being one of the sites that once it passes the state, we'll start a location conversation around May or June.'",
        "'speaker_1': 'Thank you. My other questions are for our city attorney, Kirsten Crawford. It's very tempting to want to have a conversation about the folks who will be staying in a portion of this site, because that's what many of the speakers have raised.'",
        "'speaker_1': 'And I guess I want to ask you, you've recently admonished us or warned us that we need to be talking about the criteria. So I just want to ask, are we allowed to base any form of the zoning decision on who will be occupying a portion of the site after it's owned?'",
        "'speaker_1': 'The short answer is no, and especially in the context of tonight's staff report, the criteria is in the staff report. The criteria depends on meeting whether there's plan support. What is actually going to happen on the site is not part of the criteria.'",
        "'speaker_1': 'And, you know, there's also the Federal Fair Housing Act, which would, you know, suggest that council ought to consider whether any of these comments would, you know, be discriminatory or appear discriminatory based on what the uses are. So I appreciate the question.'",
        "'speaker_1': 'It is a good one and I would encourage council members to tailor their questions to what is contained in the staff. Can you just clarify briefly, you mentioned the fair housing. What's the status that could be, you know, implicated in the conversation that's been happening tonight or the testimony we've been hearing about who the who will be'",
        "'speaker_1': 'on the site? Well, the the Fair Housing Act protects disabilities, mental health disabilities, mentally disabled, recovering alcoholics, drug addicts. So any status that would fit within one of those classes is protected by the Fair Housing Act. So it would be prohibited to make a decision about the zoning based on someone with one of those disabilities being a'",
        "'speaker_1': 'future resident. That's right. Okay. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman. Can each. All right. We have a few people who are back in the queue. Councilman Lopez?'",
        "'speaker_10': 'Yeah. May I speak? Jean Granville, if you can come up.'",
        "'speaker_6': 'Hmm.'",
        "'speaker_10': 'As you know, I was not part of the good neighborhood agreement processes, kind of. I respect your space and your bargaining space there. Can you talk a little bit about the so you had you would sent an email to me asking me for a delay?'",
        "'speaker_1': 'Yes.'",
        "'speaker_10': 'Yes. What was the reason for the delay? To delay the rezoning? Because it was happening supposed to happen last month.'",
        "'speaker_1': 'Right. Are you talking about the first request? The first request? Yes. The first one was because we had not we did not have a Jeannie at that time on at our August 7th meeting after the city had delayed.'",
        "'speaker_1': 'I think the neighborhood to give the neighborhood time to kind of get used to the idea to find out more about and get some of the questions asked about the use. And I understand, you know, the Fair Housing Act, but just to understand it better, we had we had the vote and it was pretty clear to us'",
        "'speaker_1': 'that the city was determined to move forward despite some of our alternative uses. And it was really felt that it was in the best interest. And so in my conversation with the city and I'm using that collectively with with the team, you know, I said, why don't we at least start looking at a good neighbor agreement?'",
        "'speaker_1': 'Because people were very concerned. It was you know, people were very clear they were against it. And if we were going to move it at all, perhaps a good neighbor agreement might make a difference, too, to start addressing some of those concerns.'",
        "'speaker_1': 'Plus even give us a better idea of what was really planned in there. We had had a lot of reiterations at first. It was a lot of bad a homelessness. It really ended up to be a lot more about mental health crises.'",
        "'speaker_1': 'So our, our, our, our, our, our request was really because at the time we were scheduled in, I guess it was September, I think September 13th, we were scheduled to have the final hearing. We had just not even gotten back a response to our changes.'",
        "'speaker_1': 'We had gotten an offer from the agency, which is about three pages. We were pretty disappointed because there was a 27 page good neighbor agreement that had been done in Seattle for the model that this is based on.'",
        "'speaker_1': 'And we were kind of disappointed because there really wasn't very much substance in it. And so we were in the process of responding and we had not heard back except to hear that it would be another ten days beyond the 13th before they could even respond to us.'",
        "'speaker_1': 'So so we were we were just getting started really on the whole good neighbor agreement process.'",
        "'speaker_10': 'So we got that request. I was right on the reasons why. I mean, I think it was important to make sure that we had enough process. A lot of people come to these chambers and say, well, we don't.'",
        "'speaker_10': 'There was the process was flawed. Is not enough process. Do you feel that we've had enough process to this point to get to this point and enough community input, enough process?'",
        "'speaker_1': 'I think that we've done as good a job as we can do right now. I understand there's a few errors that you know will have to be rectified.'",
        "'speaker_10': 'On point those.'",
        "'speaker_1': 'Right. And even to the standpoint of including the Community Advisory Committee, in terms of determining the reporting, I don't think it was really an intent to exclude them. It was just that the Sun Valley Community Coalition had very specific concerns about that, that the reporting would be substantive.'",
        "'speaker_1': 'I think that we've done as good a job for right now as we can. I'm sure it's going to be a work in progress that hopefully with the community advisory group in place, we can further sift that out as we go.'",
        "'speaker_10': 'The Community Advisory Group, who all was that? I mean, you don't need any mentioned names, but was there enough community on the community advisory group?'",
        "'speaker_1': 'It was it was representative of really all segments of the community. We never have as many residents who are actually living. I think it was mentioned that there is a lot of fear, there's a lot of concern that, you know, if.'",
        "'speaker_1': 'They are anything other than, you know, grateful for the housing, which many of them are, that that might be held against them. But we did have involved in the process and beyond just the working group, also an executive committee that had residents on it, not nearly as many.'",
        "'speaker_1': 'We I have to say, we made an executive decision not to put this out in the community and raise the alarm because and try to get as many people down here to really voice their concerns, because we don't want to retraumatize people, many of whom have suffered some of these same instances.'",
        "'speaker_1': 'We also don't want to be defined, you know, as as a neighborhood in it, you know, one way or the other. We just want to become the neighborhood that we outlined, you know, in the Decatur federal plan that is really going to create additional affordable housing and opportunity for people who have not had that opportunity in the'",
        "'speaker_1': 'past. Okay.'",
        "'speaker_10': 'I appreciate that. So and you signed it. I saw Lisa saying I did.'",
        "'speaker_1': 'Yes. And she she's a resident as well. And she's also the vice president of the Sun Valley Community Coalition who had intended to be here to speak tonight but had an emergency at Denver Health with her daughter.'",
        "'speaker_10': 'The two errors, if I may ask questions about that, Mr. President.'",
        "'speaker_0': 'Again, I just ask that you keep it to the rezoning and identify how that is relevant to the criteria. If we're going to dig into questions, if there are things about the good neighbor agreement that can be handled outside of our hearing here is really about the zoning criteria.'",
        "'speaker_10': 'Mr. President, this is a rezoning in my district, so I would like the opportunity to ask those questions. One, because in the Good Neighbor Agreement, the rezoning says 2929, West 10th Avenue, the good neighbor agreement says 2727.'",
        "'speaker_6': 'Right.'",
        "'speaker_10': 'How do we go about fixing that? What's what's the correct one? And I think for the purpose of the rezoning, I think this is very important.'",
        "'speaker_1': 'Now, I know. And that was not I'm sorry. I apologize. The it it came to us as a PDF, the final copy, and it rests with the mediator at this point. So we'll get back with him to get that changed.'",
        "'speaker_1': 'I guess we could either initial it or just sign it if if mental health center is willing to reassign it again, as is with the changes.'",
        "'speaker_10': 'Thank you. I'll bring the other one up.'",
        "'speaker_0': 'Thank you. Councilman Lopez, Councilman Espinosa.'",
        "'speaker_3': 'Had two questions for council. So, Councilwoman Kennedy, you brought up the prior rezoning where we were the we re zoned to a base zone district from a pad on a walkway. But one of the comments I made at that point in time was that, you know, that could have been resolved by a variance rather than a wholesale'",
        "'speaker_3': 'rezoning. But can you can you can you that can you do that with uses? Can you get a variance on uses?'",
        "'speaker_1': 'That's a legal question, but I'll defer to Nate Lucero.'",
        "'speaker_3': 'Okay. Good evening, Members Council Services and city attorney. Councilman Espinosa, can you ask the question? I'm wondering if this party could have simply gone through the Board of Adjustments and requested a variance on on a use to allow this use on this in this beauty.'",
        "'speaker_3': 'You cannot request a variance in a pud. It would have to go through a rezoning process or a PD amendment. Okay. So. Right, it's a great. So the only way to amend the PD is through the redo the rezoning process.'",
        "'speaker_3': 'Correct. And then but then confirm that because this is going to to a cmcs five zoned district, the applicant, if it were to be denied today, the applicant could go in tomorrow and apply for a PUD. Correct? That's correct.'",
        "'speaker_3': 'Thank you. A different zone district would not be barred by the blackout period in the charter. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. Let me just continue with a couple more questions that I had. And, Lisa, you won't be the one to help answer this. In the agreement that we have with them said, will they be a tenant or will they be an owner of the building?'",
        "'speaker_9': 'We're not selling the building. Correct. Okay. You could just say that on record. That would be helpful. And how long is that agreement in place?'",
        "'speaker_12': 'Oh, then I may ask Tyler to come up as well. So we haven't fully executed it yet because we needed this to move forward. But they would not be owners of the building. They would be it would be a service agreement.'",
        "'speaker_12': 'Like we have a number of our agreements in the city where the building is a part of that service agreement.'",
        "'speaker_9': 'Okay. And then I just wanted to ask Skye a question about how the mayor's executive order comes into play. I know with some contracts, we have put them out to bid after a certain period of time. How would this be looked at?'",
        "'speaker_9': 'And is there sort of a a designated length of time before the XO goes into effect? So, yes, the.'",
        "'speaker_1': 'Competitive selection policy that's incorporated into XO eight calls for contracts to be rebid every 3 to 5 years. So this contract has not been executed yet.'",
        "'speaker_12': 'I believe it will be coming to council as soon as that happens. So you will see that at that time. But I anticipate.'",
        "'speaker_1': 'It being in that 3 to 5 year time.'",
        "'speaker_12': 'Frame that's called for in the competitive selection policy.'",
        "'speaker_9': 'And that contract will be for renovation as well as operations. Or will those be separate?'",
        "'speaker_12': 'They'll be separate contracts. The contract with MH KD will just be to provide services.'",
        "'speaker_9': 'Okay. And I'm assuming that comes out of the Office of Behavioral Health Budget, correct?'",
        "'speaker_1': 'I believe so.'",
        "'speaker_12': 'We've moved those dollars around a couple of times, but Tyler's nodding at me. So, yes. Okay.'",
        "'speaker_9': 'Which is now housed at the Denver Department of Public Health and Environment. Okay, great. Um, let's see. I think I just have one last question, and that was tied into this question about the cost. So I think I'm done.'",
        "'speaker_9': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman.'",
        "'speaker_11': 'Real quick question, Kirsten, just a question about the public safety and public health, safety and welfare criteria. I was asking a lot of questions about the safe management of clients and the triaging of that facility. And I was thinking that that fit into that category as a criteria for a safe.'",
        "'speaker_11': 'I'm worried about the safety of what's going to happen with the facility. And so and I see that in the criteria. Is that not correct? And that was my question. Was that in line with that?'",
        "'speaker_1': 'So Kirsten, cover Legislative Council. The Public Health, Safety and welfare criteria is a very broad criteria and a lot of things do arguably fit within that criteria. But the problem with that being raised with respect to the uses on the site is that you're you're approving the rezoning of a use, but not the exact thing that will'",
        "'speaker_1': 'go into the building, although we are talking about that tonight. So while there's plans for something that's not absolutely 100% definitive at this point in time, so in my opinion, it's while I think it's okay to ask the question, I don't think it should be the basis of, you know, the approval or the not approval of the'",
        "'speaker_1': 'rezoning.'",
        "'speaker_11': 'It seems like public welfare is a very concern for that neighborhood, you know, with those type of patients being treated there. So it seemed like it fit very much in line with with the criteria to me. I can understand the difference.'",
        "'speaker_11': 'But but, you know, I'll just let it go. That.'",
        "'speaker_0': 'All right. Thank you, councilman. New seeing no other questions. The public hearing for council bill 1013 is closed. Comments by members of council. Councilman Lopez.'",
        "'speaker_10': 'Thank you, Mr. President. First of all, I want to thank everybody for coming tonight to the hearing and also thank you to the community and all parties that are part of this rezoning. Thank you for your work. Thank you for your due diligence.'",
        "'speaker_10': 'Thank you for the questions. And thank you for your participation. I think, you know, when I was first contacted about this zoning application, I thought to myself, I thought one the Sun Valley Neighborhood Plan, the vision for Sun Valley and how this fits in.'",
        "'speaker_10': 'And a lot of that was the question of, well, this is a historically a very disenfranchized community from design. Two, two now. And here's another use like this in the West Side. And I think to myself, how why aren't we doing this more in other areas, right?'",
        "'speaker_10': 'Why aren't these uses existing in other areas? Why is it just downtown District nine, District three, in some of these areas? And I have to think about this. Right. And I have to think about the uses and how they you know, we can't just look at the city in terms of these boundaries within our own council districts'",
        "'speaker_10': ', but our how are we making sure that we are doing our part no matter what zip code we live in? And how does it make how do we make sure that the city understands that that's also important to.'",
        "'speaker_10': 'That it's not just in certain corners of the city. However, I'm very familiar with the Family Crisis Center because it has been empty for quite a while, has been underutilized for quite a while. When we started taking in when, when, when, when we had the refugee crisis, a lot of the young people that are unaccompanied coming to'",
        "'speaker_10': 'this country, one of the first things we did was ask at the Family Crisis Center, be considered for federal dollars to be able to do that much to so many people's disdain and controversy. Oh, my God. They were empty.'",
        "'speaker_10': 'We pushed for that. We didn't get those dollars from the federal government. It wasn't chose as a site. Yeah. So it remained empty. It's one thing to have. To just have units that are not connected to supportive services, that are not going to help somebody get out of poverty, that are not going to help treat them, treat'",
        "'speaker_10': 'some of the trauma that they've experienced. That's not the solution center. The solution center is going to be doing that. It's going to be focused on making sure that folks who have expected that are experiencing homelessness or have experienced homelessness combined with the trauma that that only services, the mental health services can help with.'",
        "'speaker_10': 'As provided. I think about the rezoning. You have two major or three major uses there. And what's being asked of us is to consider in this pardon every time. For those of you who are running for city council or have an interest in city council and what we do, rezoning is a huge part of it.'",
        "'speaker_10': 'And if you intend to occupy one of these seats, you got to understand Pewds and how detrimental they have been to the city and how restrictive they are and how it's the opposite of what we want to be able to see.'",
        "'speaker_10': 'If you want a planned zoned district, right? If you want a zone district that that's modern and that fulfills the vision of Sun Valley. It's not a pudi. The West Side. And this area has a lot of need for health services, even though we built a brand new Denver health clinic.'",
        "'speaker_10': 'Federico Pena Southwest Denver Health Clinic. It is still one of the top needs in the area. I doubt that the Sam Sandoz West Side Health Clinic is going to go anywhere. I doubt that Denver Health is going to hightail it out.'",
        "'speaker_10': 'There are a lot of people who are still uninsured and still struggling and that and have that need. Denver Health is one of those and key parts to it. The Rich Castro building was a project of the city's and the bond a long time ago and a need and it's still there.'",
        "'speaker_10': 'That need is still there. Those are employees we are talking about. That's a human services center, though, one one of the most requested things of the city and the needs demonstrated needs in that part in our part of the city is for human services.'",
        "'speaker_10': 'I doubt highly that the city would hightail the rich Castro building out. But the one thing that remains empty is the Family Crisis Center. Right. So the PD is the one thing that's prohibiting us as a neighborhood and as a city from even doing anything in the future on.'",
        "'speaker_10': 'Any other future use. However ridiculous or sublime it could be, would be restricted by the PD. We'd have to come in these chambers and fix the beauty for all the other services and all the other suggestions that I think are awesome that can be used at a campus like this.'",
        "'speaker_10': 'Guess what you have to do. PWD won't let you do it. You have to come back in here and reason it and guess what you would have to rezone it to. This is the rezoning that is envisioned in the Sun Valley Neighborhood Plan.'",
        "'speaker_10': 'The same plan that I was asked by Mr. Casper and the Sun Valley Coalition to implement. I did a legislative rezoning to implement that. So the zone districts are what match in the plan? Way before Denver got hot again.'",
        "'speaker_10': 'So I want to make sure people understand the history there. Right. Safety is a big issue. And I want to go on record. This is a big issue. And as a young woman who was in this room, who I understand what her concerns are, even though there was only a few words at the microphone.'",
        "'speaker_10': 'You heard tonight in these chambers what the protocol is? Who's going to be here and who isn't? And even I have some thoughts about that. I may not agree with that. Addictions are hard. But you know what? In concerns for and out of respect for what's being discussed in the community and what they want to see to'",
        "'speaker_10': 'make sure that that those safety that that those safety boundaries are there. They're there. But we also have to remember that this this good neighbor agreement, that's why it was important for me to see this process is because that's the commitment you heard tonight, the commitment from the city, commitment from behavioral health for a mile from mh'",
        "'speaker_10': 'CDD on what the protocols are going to be sex offenders here. That's a big that was a big worry nobody's shooting up Phil Casper we're not sponsoring anything like that on site. That's a worry, right? People who are intoxicated or anything else that was right here that was just said on page three of the good neighbor agreement'",
        "'speaker_10': 'is that's not there. Right. So you can rest assured of those issues. But understand at the same time that these are also human beings that want to also lift themselves out of poverty. There are people who who have homes.'",
        "'speaker_10': 'And there are people who don't. You don't have to go far away. But across Federal Boulevard in my neighborhood, I know where there's some folks who are homeless previously and they're living out of a garage. Or the living.'",
        "'speaker_10': 'They're renting a room. They know pod or good neighbor. Agreement for that on my block. It's none of my business. As long as they have a roof over their head. We cannot follow somebody because they're homeless. They don't have to be escorted to a bus stop because they're homeless.'",
        "'speaker_10': 'They're not in jail. They're not on probation. They're just being they need help. And as a community, I understand I understand the worries. That's the stereotype that we've been programed in thinking. But that's not fair. So when I hear testimony, I want you to understand that the use is a valid use.'",
        "'speaker_10': 'The rezoning under the conditions that we are allowed are valid conditions. Because the good neighbor agreement and because of the process, I think that helps address those issues. Not every rezoning has one. And I also want to make sure that the city understands that this is something that we expect.'",
        "'speaker_10': 'You don't short change a zip code or neighborhood or the process. That's why on council I asked when Steve Charbonneau asked, Hey, no, we're almost there. Please consider the delay, even though it was unpopular here on this dais.'",
        "'speaker_10': 'That's why. Because whether you have a good neighbor agreement on the east side of Denver or whatever neighborhood it is, it should have the same weight and the same respect on our end. Right. So and so I want to I want to just put that out there.'",
        "'speaker_10': 'The neighborhood plan. Right. Was only adopted five years ago. It calls for the zoning type of cause with the higher density. I hope that people see this and the city look at this as an opportunity to modernize the campus, to make this a campus, a real campus that addresses that.'",
        "'speaker_10': 'That helps whether you're looking for health care, you're looking for housing or you're looking for help. Right. That this campus addressed that and becomes a modernized campus, that it connects to the rest of the neighborhood and not turn its back on the neighborhood.'",
        "'speaker_10': 'Right. Physically and figuratively. I want to thank you, mental health center of Denver, for coming to the table and making sure that their space for this, for listening to this and for signing on to a good neighbor agreement with these residents.'",
        "'speaker_10': 'The Sun Valley Community Coalition, y'all are one of the most organized group of folks in the community in this city. And I appreciate that energy. So so knowing that you are still part of this, you are part of the agreement, DACA, for being at the table and giving us the information we need and then finding a solution'",
        "'speaker_10': 'to help mediate the process. Steve Charbonneau is a good facilitator, from what I hear. So I wanted to put that out there. The Sun Valley Youth Coalition, you are the youth center. I think it's absolutely awesome that the youth are involved.'",
        "'speaker_10': 'However, I want to make sure that they understand the provisions of these good this good neighbor agreement and they understand there's nothing to be afraid of. But we respect on a HD CD so that you all make sure that that's the case.'",
        "'speaker_10': 'The last thing I want to say. Well, I just want I want to leave this I want to leave this these these comments. And I do see this as something that that should not just move forward, but be approved tonight.'",
        "'speaker_10': 'I heard the testimony here after I got written testimony. Not in this zip code. Not too many people are far away from actually being considered clients of these services. Let's just be honest. There are a lot of people who are just a breath away from being homeless.'",
        "'speaker_10': 'And this is something that I believe in our district and our neighborhood very, very compassionate. Whether it was Barnum, whether it was the West End Flats, which are throughout our neighborhood or even this or even in southwest Denver.'",
        "'speaker_10': 'The issue is never whether this is a youth that we support or not. The issue is never whether this is services that we support or not, it's doing it the right way. So I want to thank you, thank the city, the administration and my city for helping for committing to doing this the right way.'",
        "'speaker_10': 'So with that, I do support this moving forward. Yeah. That's all. Oh, yeah. The one little quip I had was that I think people in this neighborhood are much more danger crossing and federal than any kind of use like this.'",
        "'speaker_0': 'But thank you, Councilman Lopez. Councilman Espinosa.'",
        "'speaker_3': 'First off, I want to apologize to my colleague for disagreeing with him again in this area. But I'll explain why. And but before I even get into my explanation, I do want to make it very clear that I don't take any issue with the center and what it does and what it's intended to provide and what it's'",
        "'speaker_3': 'aspiring for. But I want them to get to. Yes, in an appropriate way. So I don't fear so. First Deputy. Well, you know, pwds are constrained by design while they are annoying to administer by staff. They provide certainty and predictability, usually wrought by a collaboration of landowners working with community.'",
        "'speaker_3': 'And we need to understand that that their that they have their usefulness. You know, they don't need to only be gone to on a regular basis, but there are times when it becomes appropriate. So I'm going to cite our own zoning code here.'",
        "'speaker_3': 'This is section 90 611, item B, that section 96 one is planned unit development district D B is unique in extraordinary circumstances that justify the use of a D district include but are not limited to the following. And then there are four situations, but they're not limited to those four.'",
        "'speaker_3': 'But let's go to item three, which is where a development site is subject to an existing PD, which this is, and rezoning to a new PD district will bring the site closer to conformance with current zoning regulations and adopted plans.'",
        "'speaker_3': 'That's when it's appropriate to use a PWD or in so. So if we're changing a use that would that is allowed in a a in a current zone district. I would say that making an amendment via PD is getting us closer to conformance with current zoning regulations and adopted plans.'",
        "'speaker_3': 'So I do think that whether we use the specific mention of PD of that of that rule, which is 9611, B three, or we use the broader thing which is but are not limited to I do think that we could have used a PD to sort of address what are my actual concerns with this zoned district.'",
        "'speaker_3': 'I mean, as with this MAP amendment, the existing FAA are on the on the agenda is consistent with adopted plans unless it goes north of 12. With no one said we want to curtail development height here to be consistent with adopted plans.'",
        "'speaker_3': 'But there are a whole bunch of district standards in the CMCs five that radically alter that radically alter what can be done on this site today that are restricted by the PD. And I don't think it would have been appropriate to I mean, I do think it would have been appropriate to amend the PD areas concurrent with'",
        "'speaker_3': 'a C know and do a concurrent rezoning application for a CM five for the parcel that is adjacent to the collector street. You know, because that zone district, the CM x five is appropriate for the collector street and it is consistent with these maps but not consistent, I mean, but not appropriate for a major arterial such as'",
        "'speaker_3': 'federal. And so, you know, the the real, you know, going that approach, doing an amended PD and either just adding this use to that portion of the site or going with a concurrent rezoning and parcel out. I mean, porting, you know, amend the map, the PD area so that you can create this rezoning opportunity.'",
        "'speaker_3': 'The zone lot would preserve the negotiated outcomes and the other 83% of the PD area. That is significant. One, we're rezoning 16 to 18% of the land area. I mean, we're rezoning the entirety of the area. Would I in a way that I I'd you know I see based on the criteria is being inappropriate to address a'",
        "'speaker_3': 'concern that involves one building on a portion of a 16% of the site area itself. So granted, doing so wouldn't address some of the youth concerns presented here tonight, but it would address the failures to meet the rezoning criteria.'",
        "'speaker_3': 'Among them are the justifying circumstances and consistency with district purpose and intent. Rezoning of the entire PD to address a use issue on a portion is creating more problems than it solves and a lot of potential unintended consequences.'",
        "'speaker_3': 'So I do think that there is a way forward. I asked that question specifically on whether an applicant could immediately turn around and go to a party. Because I do think that we can address this without essentially creating a potential long term unintended consequence on the balance of the property there.'",
        "'speaker_3': 'And you don't have to look very far. I get to go by 44th and Tennyson in my neighborhood. And what a base zone, district C, you know, CMS five or in that situation can do once you open up the entirety of our form.'",
        "'speaker_3': 'It can be anything. But with this put in place that was negotiated. We have predictability and there's nothing wrong with predictability. This community is probably reeling by the fact that it has been an unpredictable place for a long period of time.'",
        "'speaker_3': 'That is why it has welcomed so much intervention by CPD with multiple plans. And while it's welcoming the Eco District and there are many, many things that are intended to capture a very vibrant and holistic community. And I think this piece actually can and should be part of it.'",
        "'speaker_3': 'But rezoning in this way, that parcel for this reason, is, is to overlook the a whole lot of the criteria I named, too, I actually could touch on for. Fairly easily. Thanks.'",
        "'speaker_0': 'I think Councilman Espinosa. Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President. I while I am concerned about the circumstances here, where we are rezoning the entire area because of a desire to change the use on a smaller portion of it that doesn't conform to the PD.'",
        "'speaker_7': 'I think it has been demonstrated that the application does meet all five criteria. I want to I just want to remind people, including my my neighbor to the north, Councilman Lopez, that we do have facilities all around the city in Council District two.'",
        "'speaker_7': 'In fact, we have we are the home of the single largest substance abuse treatment center and the largest mental health facility in the city in county of Denver, both of them on the Fort Logan campus, both of which routinely accept criminal referrals from the Department of Corrections, from probation, from community corrections, and especially at Fort Logan Mental'",
        "'speaker_7': 'Health Institute. The state may soon restricted and not allow civil referrals because of the backlog in state courts that have a need for access for quicker determinations of of competency. We also in Council District two, we are the home to at least that I can think of three long term residential facilities operated by M.H. CD and we'",
        "'speaker_7': 'are in the happy to see the Good Neighbor agreement negotiated here because we are in the midst of renegotiating the Good Neighbor Agreement on the Sanderson Apartments to address some of the issues that have occurred there. So I'm very happy to see the framework that Sun Valley has set up, and maybe that will help us serve as'",
        "'speaker_7': 'help serve as a model for us to to finalize our agreement, I believe, next month. So I just wanted to point out that we do have, I think, at Fort Logan alone between the arts program run by SIU School of Psychiatry and the State Mental Health Institute, at least six times the number of long term residential beds'",
        "'speaker_7': 'that this solution center will have at your site. So I am supportive of this rezoning, and I think that the criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn, Councilman Lopez. Oh, Councilman or take up. I'm going to go to you first since you haven't had a chance to present Councilman Woman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I've sort of vacillated back and forth on on where I'm going to land on this issue just because of some of the history of kind of where we've gone with where we're going to serve folks in our city.'",
        "'speaker_9': 'And this is a process led by the city, not a process led by a developer, which is normally the case. And there should be extra over communication as well as extra work that we as a city do when we're going in the community.'",
        "'speaker_9': 'And we should not be treating low income communities any different than we would any other part of the city in terms of approach expectations around, you know, early notification around how we engage community. I am a little concerned about and I didn't ask the question about whether or not Sun Valley Community Coalition is in fact a legal'",
        "'speaker_9': 'entity. I don't know that that matters or not. I think the commitment is there from limited to to do what is being what has been sort of agreed upon between the community and image CD. I am happy that we will look at the opportunity in the future for the executive order to be implemented and that we're not'",
        "'speaker_9': 'trying to sell the property. The city will continue to own that. I think all of that just ensures that we continue to have community engagement in that part of the process so that as the project would move forward, that is an expectation of the community that it it's not just going to operate in perpetuity.'",
        "'speaker_9': 'We saw this with a whole different operator in our city that I won't get into the details of, but there is some importance in in just continuing to function in that way. I currently serve on the Crime Prevention and Control Commission, and I'm serving on a body that's looking at a a rewrite of our group living ordinance'",
        "'speaker_9': '. And there is absolutely a need and a. And four different housing models that serve the group housing needs of people that cover a variety of categories. So there's absolutely a need. I'm not happy that we have said we're going to no longer look at the site that we were going to put homeless men in.'",
        "'speaker_9': 'Folks that are chronically mentally ill. But now we're going to take kids who come in in the evenings or, you know, UN emergencies, and we're going to put them at that building. So how is it not good for men, but yet it's going to be good for children.'",
        "'speaker_9': 'I'm assuming we're going to spend the money that is needed to do the environmental abatement on that building. I don't know what those costs are yet. I'm sure we'll see that one brought before us at some point in time.'",
        "'speaker_9': 'But again, this is where the details matter and how we look at these things and how we make decisions around, you know, what we're being asked to do. We're being asked to rezone this. But for me, all those details matter.'",
        "'speaker_9': 'Because there is such a great need for this type of housing. I'm leaning towards supporting this, but I'm not happy with the fact that we could have used that in a way that building in a way to better serve the community.'",
        "'speaker_9': 'And I am concerned about the gap period about where children will go while this building is being renovated, while the other building is being renovated, so that we, in fact, have a place that that screening can be done if we have to keep a kid overnight because they're brought in three in the morning because of whatever situation'",
        "'speaker_9': '. I worked at Human Services, got a chance to see, you know, some of the situations that our caseworkers have to deal with on on a regular basis. And we need to make sure that gap is closed so that there is a place for our children that are picked up in the city of Denver, can go and be'",
        "'speaker_9': 'safe while we're working towards getting them connected to, you know, whatever services might be available. I know we have a lot of forgetting the right word, families that take these children in because we no longer have the crisis center playing that role in our city.'",
        "'speaker_9': 'So I'm going to just stop at that. But I think in the future, as a city, we can do and should be doing a better job in how we get out front and communicating with our with our neighbors about the details and not have people having to.'",
        "'speaker_9': 'To call and ask questions because they're hearing rumors about something going on in a building in their neighborhood that wasn't completely shared upfront with with the neighbors about how this was coming about. So. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Lopez, you have already been up to express your thoughts on where you are on this. I see you back in the queue. I will ask you to keep it as short and concise as possible to add to what you've already said.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_10': 'Thank you. I appreciate that. Mr. President, let me remind the council. That in 2017 we did rezoning this party. And as for the Denver health or the Denver Denver Indian Health Services, they could not deliver services. They could not even operate the Denver Indian Health Family Health Services, including dental, health care for folks, especially for native folks'",
        "'speaker_10': 'in this city. They could not open up or operate because of the Pudi. We reasoned it. It was unanimous. And I went through. So it's all about the youth on this one.'",
        "'speaker_0': 'Thank you very much, Councilman Lopez. Seeing no other comments, I will just add my thanks to everyone for being here, for sticking it out, for coming down and sharing your opinion to all the work that you did with the Good Neighbor Agreement to staff for putting together all of this work.'",
        "'speaker_0': 'You know, there are a lot of things that we talk about and a lot more that this council would love to talk more about that unfortunately, don't fall under the charge that we have on the criteria. And I just wanted to point to the staff report, and I think you did a great job articulating how this met'",
        "'speaker_0': 'the legal criteria. And for that reason, I will be voting yes tonight. Madam Secretary, roll call on Council Bill 1013.'",
        "'speaker_10': 'LOPEZ All right.'",
        "'speaker_6': 'BLACK Hi. Brooks, I. ESPINOSA No.'",
        "'speaker_3': 'No.'",
        "'speaker_6': 'Flynn, I. Herndon High Cashman can reach Lopez. I started with.'",
        "'speaker_10': 'I'm going to do it again.'",
        "'speaker_6': 'Ortega.'",
        "'speaker_9': 'A reluctant tie.'",
        "'speaker_6': 'Assessment. Hi, Mr. President.'",
        "'speaker_0': 'Hi. I'm secretary. Please close voting. Announce the results.'",
        "'speaker_6': '11 times when they.'"
    ],
    "Zoning Change for 1845 W 46th Avenue in Sunnyside.": [
        "'speaker_0': 'Will have a noise when they come to Bill 1013 has passed. Councilman. Will you please put Council Bill 1381 on the floor?'",
        "'speaker_11': 'I move the council bill 18 1381 be placed by final consideration to pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 1381 is open. May we have the staff report? Good evening, Council. My name is Eugene Howard with Community Planning and Development. I will be bringing forward the application for 1845 West 46th Avenue and thank you for the opportunity.'",
        "'speaker_0': 'So this request for rezoning is in Council District one in the Sunnyside neighborhood. The subject parcel is located on the northwest excuse me, northeast corner of Shoshone Street and West 46th Avenue. The property itself has approximately 7460 square feet.'",
        "'speaker_0': 'The request before us is to change the zoning from the Urban Neighborhood Context Single Unit to the Urban Neighborhood Context to unit. I do have the applicant here present. Should there be any questions at the conclusion of this presentation?'",
        "'speaker_0': 'And the purpose stated in the application was so that the zoning of this parcel is in better alignment with its adjacent neighbors. So looking at the existing zoning currently in place, the subject site, as I mentioned, is a single unit zoned district.'",
        "'speaker_0': 'It is adjacent to one other single unit parcel. However, the remaining for the most part, the majority of the remaining properties on the site do already have the two unit classification. Looking at the land uses. This parcel is currently being used as a single family structure on a block predominantly used for single family, single unit residential.'",
        "'speaker_0': 'We do have a couple of duplexes in the vicinity as well as some other multi-unit uses nearby. The Urban Neighborhood Zone District that is being requested does allow for the urban house form, the duplex residential form as well as the tandem house.'",
        "'speaker_0': 'So those three are the building forms allowed in the two unit zoned district. The C designates the minimum square footage for a zone lot. That being 5500 square feet. So the subject property is in excess of that requirement.'",
        "'speaker_0': 'Looking at the context, the upper right image is of the existing property. The lower image is the look across 46th Avenue to the south. Again, we see some other residential uses there. Expanding our view out from the subject site.'",
        "'speaker_0': 'Starting at the upper left, we see some level of redevelopment occurring in the general area. Everything from two units over to larger single family uses on North Korea, this street. That lower image is of other, larger single family residential construction that's relatively new.'",
        "'speaker_0': 'And then the last image on the lower left shows us some townhome, another duplex development that's happened in the nearby area. Looking at the process, the applicants did provide the city and staff with a completed application in August of 2018.'",
        "'speaker_0': 'It was appropriately posted for our planning board hearing, which took place in mid November. Planning Board did unanimously vote to proceed or move this application forward to the Land Use Transportation and Infrastructure Committee, which heard this case on December 4th.'",
        "'speaker_0': 'We also received a unanimous vote to proceed to this public hearing. We go the registered neighborhood organizations that were notified. There are the four listed here on the screen. As of this evening, prior to this hearing, we had not received any formal comment from any of the four resident or registered neighborhood organizations.'",
        "'speaker_0': 'Moving forward to the criteria, as you heard in the previous case, there are five areas that staff reviews related to any rezoning that comes before us. So starting with consistency with adopted plans, there are three plans in place for this subject site, the Denver Comprehensive Plan from 2000, Blueprint, Denver from 2002, and then the Sunnyside Neighborhood Plan'",
        "'speaker_0': ', which was originally approved in 1992. Moving forward, looking at the comprehensive plan, staff has found that this application satisfies the three strategies listed in the comprehensive plan, the first being environmental sustainability. Should this site redevelop and redevelop using the two unit zoned district designation, it would be a way of promoting infill development and making good use of'",
        "'speaker_0': 'land and resources and reducing continuous sprawl. Looking at the Landrieu strategy around infill development. So this again speaks to that and also would be consistent with the surrounding zoning that exists on three sides of this parcel and then the neighborhood strategy where landowners are encouraged to invest in their properties.'",
        "'speaker_0': 'So this could potentially be a reinvestment in the Sunnyside neighborhood should the site redevelop at some point in the future. Blueprint Denver sees this or calls this area a single family residential area. In an area of stability. Staff finds that this request is consistent as the single family residential would allow for a variety of uses, including two'",
        "'speaker_0': 'unit residential. The property is already adjacent to two unit zoning on three sides. As I mentioned, areas of stability are do allow for a certain level of redevelopment and new development. And the subject property is located on a residential collector street, which is really meant to help connect residents to amenities that exist in the neighborhood.'",
        "'speaker_0': 'And in this particular area. We have an unnamed park, we have a middle school, we have a U.S. Postal Service location. We have a variety of commercial, retail and industrial uses which could allow for employment opportunities for residents within the neighborhood moving forward.'",
        "'speaker_0': 'Looking to the Sunnyside plan, while it is one of our older plans, there were two elements within it that we found in support of this application and that being a call for harmony, if you will, and architectural diversity.'",
        "'speaker_0': 'And should this site redevelop, it could add to that fabric, that mix of residential uses that the Sunnyside plan would suggest, and also keeping the residential character of the surrounding area of that block would further the goal of maintaining and stabilizing the residential character that's in place.'",
        "'speaker_0': 'Moving on to our other review criteria. Criterion two we feel it's been met as the urban neighborhood to unit zoned district would result in the uniform application of that zoning. Given that this property is surrounded by that zone district already, we believe that it would further the public health, safety and welfare by having this location should it'",
        "'speaker_0': 'redevelop be in close proximity to amenities that have been mentioned. Again, the park open space, a middle school, the commercial, retail and industrial areas which could lend themselves to employment for anyone living there as well as our building form standards.'",
        "'speaker_0': 'Looking at criteria number four, for a to be particular, we feel that this has been satisfied because the area has changed and is in the process of changing with the redevelopment that's already occurred. And then criterion five Consistency with neighborhood context, zone district purpose and intent.'",
        "'speaker_0': 'Given that the applicant is not looking to change the neighborhood classification of urban neighborhood, it would be consistent with that as well as the existing zoning on three sites. So given that review and given the criteria, staff would like to ask you all to consider approval of this application.'",
        "'speaker_0': 'We feel that it has satisfied all the criteria required for a rezoning. So thank you very much and I'm happy to answer any questions. Thank you very much. We have six individuals picked up this week, signed up to speak this evening.'",
        "'speaker_0': 'So if you have signed up for this one, if we could if you could come down to this front bench so that we can get through everyone in a timely fashion, that would be appreciated. First up is Ray Williams, followed by a David River.'",
        "'speaker_0': 'Ray Williams. I might have mistakenly done that. I was just putting.'",
        "'speaker_8': 'Down to be here for.'",
        "'speaker_10': 'Answering questions as the property.'",
        "'speaker_0': 'Owner. That's right. If you could just introduce yourself and then we'll know that you're available.'",
        "'speaker_10': 'Ray Williams and the property owner at 1845 West 46th Avenue. And I'm available for questions.'",
        "'speaker_0': 'Thank you very much. David Rubel Let's see that he's still here. Jerry Burton. All right, Chairman CQ.'",
        "'speaker_2': 'Term of so-called next mayor is due to come in December 2019. Oh. This one. Qualifies all the criteria. That's just true. And to allow larger developments the opportunity to make money on rezoning and not let smaller folks do the same thing is not only immoral and unjust is just downright hypocrisy.'",
        "'speaker_2': 'How are you going to tell him he can't do it and you gave it to folks who's doing 200,000 units? Changing zoning. You can't do it. You can't do it. And see that sets the city up for lawsuits.'",
        "'speaker_2': 'Only problem is, the small folks like him ain't got no money to give no attorney more money than what the property is worth to go get it. So you got to be fair. You got to be fair. And yet this is exactly what happens to poor people because it's a rental unit.'",
        "'speaker_2': 'He doesn't live in that. It's a property profit producing thing, which is legal to do under the cab system in America. There's nothing wrong making no money or no property. But when you do it this way, what does that do for poor people who got to rent?'",
        "'speaker_2': 'Who got to pay the market value. And the market value goes up on this kind of rezoning because look where the property is located. Major transit, that's a selling point. Got curb appeal. Hey, we can really increase the property value of that property with a zoning change to hundreds of thousands of dollars and possibly millions in the'",
        "'speaker_2': 'future. If this thing keeps going the way it's going in terms of rent is too high and we can't afford it, we can't afford it, and we can't make him do that or accept Section eight to do that.'",
        "'speaker_2': 'So what do we do? But we got to move. We got to get out of City County, Denver, out of the city of high income. And you tell me you're trying to create a city of diversity and you're running folks out who are poor just aren't owning changes like this because you increased the market value.'",
        "'speaker_2': 'You pushed the profit over the people. And then you end up with a city with nothing but both looking like Boulder. And then you look up there. Self-interest. Not one of your poor. Not one we don't know. Could take one seat and no policy position in this city representing poor people who are actually poor.'",
        "'speaker_2': 'Talk to me about this mess.'",
        "'speaker_0': 'Thank you very much. Next up, Mariana Thompson.'",
        "'speaker_6': 'Short and sweet, ugly books once again. Come on, people. What about subsidized housing? We got 23,000 children in Denver. School system unhoused. If that doesn't hurt you as a parent, that's one thing. My children never had to suffer, and I'm now advocating day after day to get in surveys from people.'",
        "'speaker_6': 'Ugly boxes. Gentrification? No.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce. We have.'",
        "'speaker_14': 'Good evening, members of council. My name is Jesse Perez. I'm representing for Denver Homicide Low Black Star Action Movement for Self-defense and Positive Action Commitment for Social Change. We are definitely against this rezoning. Like was previously stated. We have a housing crisis in the city.'",
        "'speaker_14': 'This is not affordable by any means. This rezoning change for this property that is in question, this whole neighborhood, this whole part of the city, which is in Espinosa's district, by the way, has been rapidly gentrified. The original natives of the area cannot afford to live in the neighborhood anymore.'",
        "'speaker_14': 'They are being displaced and they are being put out. And this seems to be a pattern in all areas of the city, but it's more obvious. In this district, in this neighborhood, who are asking you to vote no on this.'",
        "'speaker_14': 'We have a housing crisis. This is not answering nor dealing with the crisis at hand. This is just putting more money into people's pockets that already have money. This is just enriching those that already have the means to enrich themselves.'",
        "'speaker_14': 'And it is completely neglecting those that are poor and downtrodden and homeless. And the city has made, in an effort to completely put them out of sight, out of mind, to increase tourism and make this the city, the world class city that neglects homeless people, that neglects people of color, specifically black and brown people.'",
        "'speaker_14': 'And criminalizes the homeless on a basis of just being homeless. So, yeah, everybody, listen, I'm asking you to vote no on this and sweep council like they sweep the homeless every night. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council?'",
        "'speaker_2': 'Yeah. I got a question.'",
        "'speaker_0': 'Councilman Espinosa? Yeah.'",
        "'speaker_3': 'So, Ray, can I ask you a few questions? And I wasn't expecting the comments that we got, so don't. You're going to read into that? Don't freak out by the questions. So how long have you resided in this property?'",
        "'speaker_8': 'I have not resided in the property. I've owned it since 2005 when it was a foreclosure and I bought it out of foreclosure.'",
        "'speaker_3': 'So no one was living there at the time. It was a hot home. But it is. Is it currently occupied?'",
        "'speaker_10': 'It's been rented.'",
        "'speaker_14': 'I had to rehab the property from despair.'",
        "'speaker_8': 'And it's been rented.'",
        "'speaker_10': 'Since that time.'",
        "'speaker_3': 'Okay. Thank you. No further questions.'",
        "'speaker_0': 'All right. Seeing no other questions. A public hearing for Council Bill 1381 is closed. Comments by members of Council. Councilman Espinosa.'",
        "'speaker_3': 'So. Jesse. Thank you. You said what I've been saying in so many forums, so many times up here, exactly what still is going on in this district. And I'm upset. Right. Because the you know, when I first said, hey, we have a gentrification problem in northwest Denver and we need to do something.'",
        "'speaker_3': 'And the only person that really can wield that sort of power in a strong mayor government sort of overnight. Is the administration. And shortly thereafter, about a year, even a vulnerability study had been done in 2015. They took a year for us to see it and then it was mapped out what we already knew was going on'",
        "'speaker_3': 'in northwest Denver and then still no action in it was told that it was a market problem and that the city couldn't do anything about it. And then in Coffy happened. And you bet, that brought a whole bunch of attention to the issue.'",
        "'speaker_3': 'And even though we had built an office of hope. We killed Hope and replaced it with a nest. And that the good news is, is NEST is focused on gentrification matters. But guess what? Where it's not focused on northwest Denver.'",
        "'speaker_3': 'You know, the priorities are in the northeast section, in the southwest section of the city. But it is still happening in northwest Denver. So I don't fault it is that there is a problem in the in the mean it is a opportunity the market forces are what drive this thing.'",
        "'speaker_3': 'But they are come when this happens and I don't fault the applicant in any way, shape or form. With this happens, they're making a voluntary request for the city to grant them additional entitlement, and they can make an easy case.'",
        "'speaker_3': 'But when they're coming in and asking, why not put strings on that? Councilman New came into office with a proposal a binder three inches thick about about infrastructure fees because when you build these things, you have impact that we all bear the cost of.'",
        "'speaker_3': 'And you can do that. There's a way to to put a certain surcharge in this process. And I'm using the wrong legal terms, but we all get it. And so it's not the problem, the applicant that we have not put the tools in place to do this.'",
        "'speaker_3': 'So you're not going to see me opposing this rezoning in any way, shape or form. And in fact, if you watched Luti committee, you're wondering sitting there, why aren't we doing both proposals at the same time? So at least that other property owner has the ability to get on entitlement that some other savvy developer is going to'",
        "'speaker_3': 'eyeball at some point and go, Look, there's a donut hole there. Maybe I can buy this property out for what its existing entitlement is. Will pay my less than thousand dollars to file a mean to do an application and and be able to double the amount of housing that I can sell there.'",
        "'speaker_3': 'Because it's when you have a parcel this big 7000 square feet, you could cover it with about a 9000 square foot home. Good luck selling that. As desirable as my district is, $3 million home is hard thing to sell.'",
        "'speaker_3': 'But two $1.5 million homes. Doable. That's crazy. Because in 2005, this was a foreclosure and that was a tough area to bank on. And a lot of people who didn't have a lot of means were living there. And a lot of those people who were renting and again you're not you're not this were had their property sold'",
        "'speaker_3': 'out underneath them and a lot of people when the market finally hit and it's hit over here. If you went over there when I started my time in office, 46 did not have a single new build on it.'",
        "'speaker_3': 'On this side of town. On the east side of town. You. Now there are in the tens of new units on that street between 40 tiona and pacos and that's the market. It is forcing people out of viable, affordable homes and being replaced with four or five.'",
        "'speaker_3': 'And who knows what the market is these days? And we. Could do something about it. We should do something about it. And we have not. Part of the reason why I announced that I was not going to run for reelection because I found that, like ballot measures.'",
        "'speaker_3': 'Sometimes you can move this body better as a constituent outside on the other side of the dais than you can on this side of the desk. And I bet you would be a partner with me on that because he bought this area when it was vulnerable.'",
        "'speaker_3': 'And the project right across the street houses a lot of subsidized Section eight units, but it's a great project. And this will be a great neighborhood, but it would be a greater neighborhood if we could somehow capture this wealth and this prosperity, but not displace people in the process.'",
        "'speaker_3': 'And we need to build those tools. So I use this to get on my my stump speech, but it does meet all the criteria, just like all the surrounding properties do. It does make sense. I just encourage the developer to build something that is sensitive to the public realm, has good quality, character, durability, and will last as'",
        "'speaker_3': 'long as many generations as is the housing stock has in that neighborhood today. And so with that, I'll be supporting the rezoning.'",
        "'speaker_0': 'Thank you, Councilman. As for noticing the other comments, I'll just add thank you to everybody who stuck with us this late into the evening. And again, thank you to staff for great presentation and for articulating the staff report why how this met all the legal criteria.'",
        "'speaker_0': 'And for that reason, I will be supporting this tonight. Madam Secretary, roll call.'",
        "'speaker_6': 'Espinosa by Black Eye Brooks. Flynn.'",
        "'speaker_2': 'All right.'",
        "'speaker_6': 'Herndon. Cashman.'",
        "'speaker_2': 'All right.'",
        "'speaker_6': 'Can you. Lopez. All right. New or Ortega y assessment. Tonight.'",
        "'speaker_0': 'Get to me.'",
        "'speaker_6': 'I'm sorry, Mr. President.'",
        "'speaker_0': 'I. All right, Madam Secretary, please close the building, announce results.'",
        "'speaker_6': 'Lebanese.'",
        "'speaker_0': 'Lebanese calls about 1381 has passed. On Monday, February 11th, Council will hold a required public hearing on Council Bill 1477, changing the zoning classification for 1709 and 1717 Washington Street in North Capitol Hill. Any protest against Council Bill 1477 must be filed with the Council offices no later than noon on Monday, February 4th, 2019.'"
    ]
}