{
    "Donation to the African American Heritage Society of Long Beach.": [
        "'speaker_0': 'Thank you very much. We're going to go ahead and do item ten now, which is a transfer item, please.'",
        "'speaker_1': 'Communication from Councilwoman Allen recommendation to increase appropriations by $500 to provide a donation to the African American Heritage Society of Long Beach.'",
        "'speaker_0': 'Councilwoman.'",
        "'speaker_2': 'Thank you very much. I support this item.'",
        "'speaker_0': 'I need. I need a second on this item.'",
        "'speaker_2': 'Please keep it up right now.'",
        "'speaker_0': 'Okay. I have emotion and I have a second becomes memory Ranga. If there's any public comment on this item.'",
        "'speaker_3': 'If there are any members of the public that wish to speak on this item, please press star nine. If you're calling in by phone or used to raise a hand feature. Seen none. That concludes public comment.'",
        "'speaker_0': 'Okay. Let's go and do a roll call. Vote for you.'",
        "'speaker_1': 'District one. I district to.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District three. My district for my district five i. District six. I District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Study of Local Preference Ordinance and Extreme Procurement Makeover Project.": [
        "'speaker_0': 'Thank you. We're going to take item 11, please, which is the local preference medium.'",
        "'speaker_1': 'Communication from Councilwoman Allen, Councilwoman Mongo, Councilwoman Sara Recommendation to request City Manager to work with the Financial Management Department's Purchasing Division to ensure a study of the current local preference ordinance is included in the Extreme Procurement Makeover Project and report back to City Council in no more than 180 days.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_2': 'Yes. Thank you, Mayor. I just want to say, first of all, thank you to Councilwoman Ciro and Mongo for joining me on this item. And we all understand just the importance of keeping spending locally. And this policy has not been updated for over a decade.'",
        "'speaker_2': 'And this is something that I am very passionate about. Local businesses are the heart of our city and we need to make sure that we give them preference. These businesses have decided to invest in our city. They hire in our city.'",
        "'speaker_2': 'They also support other local businesses and restaurants. And local businesses who operate in the city. Need to know that if they decide to open up shop here or open up a business here in our city, that we're going to support them as a as a city and that we are also, as a city invested in their success'",
        "'speaker_2': '. So I also want to thank Jeremy Harris of the Chamber of Commerce and the Delbert for their letter of support with this item. I appreciate I definitely appreciate the support, but also their interest in being an active partner in our procurement makeover.'",
        "'speaker_2': 'One of the things that I'd like to make sure that you reach out to the following groups as part of this makeover process. So that would include the Chamber, the Long Beach Economic Partnership, any business associations across the city, the deal, Bay, these groups and these members will be on the other end of the Nube procurement systems'",
        "'speaker_2': 'and they can help us. You know, have been included in this process. They'll help us be the best this can be. And I just know from from my past life in business, in business and doing a lot of pure procurement with the city and other municipalities across the state, how important it is for these cities to focus'",
        "'speaker_2': 'on on their local vendors. And I'm telling you, it does make a difference. It's better for us. It's better for our city. It's better for for our workers. The first step was taken in 2009 when our local preference was first established, but the cap of 100,000 was too low then, and inflation has almost made this comical now'",
        "'speaker_2': '. So I think a preference of 10% was a good start. But it may not be enough to entice businesses elsewhere in our area to open offices or move their headquarters to Long Beach. So I want to thank the mayor and council who first took the step back when the mayor was first council member of the first District'",
        "'speaker_2': '. I. A stronger local preference program will further empower local firms, many of which are designated small business enterprises, their minority owned business enterprises, their woman owned business enterprises. And they all need to compete successfully with established firms outside the city.'",
        "'speaker_2': 'And that may not share many of those characteristics. So it is my hope that all city employees who are involved in any purchasing decisions when possible, that we that we keep it local. So I do hope that my colleagues will support this logical next step in strengthening our local purchasing and our local economy, especially for small businesses'",
        "'speaker_2': '. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sara.'",
        "'speaker_2': 'Thank you, Mayor. And I also want to thank Councilmember and Councilwoman Allen for leading on this item, as well as Councilman Mongo for supporting it. You know, I think that this is a great next step because as we're in this opportunity to be able to work on recovery, it's great to be able to review our local preference'",
        "'speaker_2': 'ordinance because we want to make sure that as businesses as well as nonprofit are getting back on their feet, that we consider how as a city that we help them do that. So I appreciate this item and that I hope that, as Councilwoman Allen said, it'll help to increasing jobs but also increasing, hopefully internship and fellowship opportunity'",
        "'speaker_2': 'for those that we are getting from college or even our colleges that we're proud of locally, so that we're able to grow and retain those talents and keeping them in their city. So thank you. I appreciate this item and I support it.'",
        "'speaker_0': 'Thank you so much. Councilman's in the house.'",
        "'speaker_2': 'Thank you, Mia. And a huge thank you to Councilwoman Ellen Taro and Mongo for bringing this item forward. I think it's very important, especially right now as we're trying to recover from COVID and a lot of our small businesses are being affected citywide, nationwide, worldwide.'",
        "'speaker_2': 'Great. But one of the things that I'm I think that this council has is that we're always very focused on our small businesses and making sure that we support them. So thank you very much for this. And I also wanted to make sure that our staff while looking into into this thank you, also includes the LGBT Q'",
        "'speaker_2': 'plus chamber of Commerce, which I think is very important. And also the look into making sure that we extend this also to our disabled business owners. I think that's also very important. So thank you again for this item.'",
        "'speaker_2': 'And I supported who hide it.'",
        "'speaker_0': 'Thank you, Councilman Mongo. Councilman Mongo.'",
        "'speaker_2': 'Thank you. I just want to thank Councilman Allen. She's been an advocate for this long before she was a councilwoman. I remember working on this with her and now State Senator Lena Gonzalez. And it's just such an important program.'",
        "'speaker_2': 'And we really need to do whatever it takes to get these bids to local businesses. It really comes back to the city ten fold. Thank you so much.'",
        "'speaker_0': 'Thank you. Next up is customary, Ringo. Thank you. Thank you, Cindy, for bringing this forward, this long overdue. The limits were just too low, and we need to have more participation for our lives, as well as LGBTQ people who to participate in this process.'",
        "'speaker_0': 'But I think we also need to encourage them to participate in the procurement process by getting the education they need. A lot of them don't know the process of how to get a contract with the city or how to apply for a contract with us.'",
        "'speaker_0': 'So I think we also need to make sure that we include a educational component to improving our are our opportunities for how maybe we be applying for contracts with the city. So thank you for bringing this forward. A proposal we agree with.'",
        "'speaker_0': 'Thank you. Thank you. I have count. I have Vice Mayor Richardson. Thank you. First of all, this is a great item. Thank you, Councilwoman Allen and the COSIGNERS for bringing this forward. Tell you it's been a big item of discussion.'",
        "'speaker_0': 'I think these goals are great. Going from 10 to 20, right out of date. That's great. And I would love to see that. And I'll see how we can get higher. We talked about this a lot when we did the the listening tour and that everyone had planned.'",
        "'speaker_0': 'And there were some, some really good things that we learned, particularly, you know, when people do procurement in Long Beach and it's hard to navigate. You have folks who have to go to different departments and have different processes to certify as maybe we be and we we've got school districts and we've got transit and we've got all'",
        "'speaker_0': 'these agencies. We also have to certify the woman or to certify the person of color. You have a different process for each one of these, and there is a lot of interest in seeing if we can partner as a part of this and streamline and have one process where if you want to sign up and certify that'",
        "'speaker_0': 'you're an African American business or your local locally on business, your certification in the city can have a me too with other agencies. These were great ideas. I heard about an incident with a local business owner when she needed to produce her her birth certificate to show that she was African-American.'",
        "'speaker_0': 'She was clearly African-American, but she she didn't have a birth certificate. She didn't have a race on a birth certificate. So she needed to go prove it. She had to go get her father's military records showing he was African-American and show that he was her father on her birth certificate.'",
        "'speaker_0': 'I think that whole process can be updated. So I love an extreme makeover. The other thing I would say is so we should learn from some of those things. But we also pushed and made sure and I'm not sure how much if the city manager could say we pushed in the recovery plan to put, I believe it'",
        "'speaker_0': 'was $200,000 and or some number around doing a comprehensive study. And what I don't want is for multiple efforts, because that was just funding this past year. So I would love for all that to dovetail. So we have one comprehensive study that comes back, and it's a true comprehensive makeover.'",
        "'speaker_0': 'It is. John Cox, one on the line.'",
        "'speaker_3': 'This is Tom. So. I think I heard the question. But yes, essentially, the council women's item is.'",
        "'speaker_0': 'Dovetailing very nicely into the.'",
        "'speaker_3': 'Existing effort. That is our extreme purchasing makeover. So we believe it's all coordinated. We'll be able to incorporate this in and come back with all of those changes to our purchasing system, many of which will meet our goals of the reconciliation plan.'",
        "'speaker_0': 'And recovery as well. And are we using the recovery dollars for the extreme makeover?'",
        "'speaker_3': 'We'll get back to you on that. I'm not sure. I think we had already funded some of that. A lot of it is internal staff and then we have the Recovery Act money.'",
        "'speaker_0': 'So I'll get you back a response on that. Awesome. Well, I think this is this is incredible work. I'm happy to support it. Thanks so much, Councilwoman Allen. Great item. Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Councilman Allen, Soli and Mongo, thank you very much for this item. As a small business owner, I think it's a step in the right direction. And I applaud your efforts to help all the small business owners, because it's not always what people think.'",
        "'speaker_2': 'As Councilman Allen knows. And it's it's really hard to keep things going. So thank you.'",
        "'speaker_0': 'Thank you for public comment on this item.'",
        "'speaker_3': 'If there's any members of the public that wish to speak on this item, please use the raise hand feature or press star nine if dialing in by telephone. Seen none. That concludes public comment.'",
        "'speaker_0': 'Road covered.'",
        "'speaker_1': 'District one. High district to.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six. District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District nine.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Ordinance on Covid-19 Worker Retention.": [
        "'speaker_0': 'Thank you. I've had a request to do ordinance 18 and 19. So let's go to Ordnance 18, the first reading, I believe.'",
        "'speaker_1': 'Report from City Attorney Recommendation to declare ordinance relating to COVID 19 worker retention. Read the first time and lead over to the next regular meeting of City Council for Final Reading Citywide.'",
        "'speaker_0': 'I have a motion by Vice Mayor Richardson. And I have a second backcountry ranger does as a staff need to give an update on this ordinance or I mean we have it. Which audience? And I'm sorry, do we?'",
        "'speaker_0': 'The question was whether or not we need to.'",
        "'speaker_3': 'Give an update on the ordinance.'",
        "'speaker_0': 'Oh, I just I just wasn't sure if there was any, any, any update from staff on the ordinance as presented to us or not? No, I don't think so. This is what you would ask us to do.'",
        "'speaker_3': 'And we're ready for first reading.'",
        "'speaker_0': 'Okay. Just making sure. Okay. There's a motion from the second Vice Mayor Richardson. Anything. Having scored okay. Gives me ringa. Okay. Is there any public comment on this item?'",
        "'speaker_3': 'If there's any members of the public that wish to speak on this item, please raise hand feature or dialing in by telephone press star nine. Our first speaker is Christina.'",
        "'speaker_2': 'Hello. Good afternoon, Mayor and Council. My name is Christina. You guys hear me?'",
        "'speaker_3': 'We can hear you.'",
        "'speaker_2': 'Yeah, great. I am speaking on behalf of Unite Here Local 11, the Hotel Workers Union. We want to thank the Council for taking the initiative for the hotel workers and building services workers and leading the region as our members face mass layoffs at the height of the pandemic.'",
        "'speaker_2': 'Many are still struggling to recover. We urge you to adopt these permanent regulations to unite our industry, which is the economic backbone of the city, is especially sensitive to disruptions in the economy. We faced this reality back during 911, which is why the city of Santa monica responded by passing the right to recall ordinance.'",
        "'speaker_2': 'The hard worker, working hotel housekeepers and janitors that welcome guests into the city every day deserve to have some basic job security, not just during the pandemic. But if, God willing, we are to experience another massive disruption in the future.'",
        "'speaker_2': 'Thank you again to the entire Council. So that has been supportive of these regulations since they were first enacted and we are encouraged to see the council headed in the right direction this evening. Thank you so much.'",
        "'speaker_3': 'Our next speaker is Rob, north of.'",
        "'speaker_0': 'Thank you. Good evening. Mayor Garcia, Vice Mayor Richardson and members of the council. My name is Rob. No talk from the policy director of the Los Angeles County Federation of Labor. And I'd like to thank the Council tonight for your collective leadership in moving this item forward and strongly encourage your vote to make right of recall and'",
        "'speaker_0': 'retention permanent policies for hospitality and janitorial workers. This is a tool that will greatly assist workers in two essential industries as they pieced their lives back together after the pandemic. And it's a tool that will greatly assist the city in its overall economic recovery.'",
        "'speaker_0': 'And further passing. This policy will yet again show that Long Beach is a national leader. And let me explain. As fate would have it, there was an article over the weekend highlighting the crisis currently being faced by housekeepers and other service workers seeking to get rehired after the pandemic and recover their wages and benefits.'",
        "'speaker_0': 'And by passing tonight's policies that not only benefit Long Beach workers, the Long Beach economy, but you also give a ray of hope to a work to other workers in the hospitality janitorial industries across the rest of the nation.'",
        "'speaker_0': 'And you'll be the first to have this policy for both hospitality and janitorial workers. So, again, thank you for your time. And that's proved yet again that Long Beach does, in fact, lead. Thank you for your time.'",
        "'speaker_3': 'Our next speaker is Grazia Lopez. There is.'",
        "'speaker_2': 'Good evening, Mayor, and members of the Council. My name is Gracie. Local three is Director of Link Lambert Coalition for Good Jobs. Thank you, Vice Mayor Richardson and Councilwoman and they had Councilwoman Allen for bringing this item forward.'",
        "'speaker_2': 'We strongly support making Long Beach right of record retention, permanent policies in Long Beach. We need to ensure that there is an equitable recovery for all. And as many of us know. Right. Hospitality and janitorial workers are the key to this ongoing recovery.'",
        "'speaker_2': 'Making these protections permanent policies in Long Beach is critical for businesses and workers. We today we hear more and more of businesses reporting difficulty filling open jobs as these key industries begin to slowly recover. It is essential for businesses to have a pathway to quickly rehire qualified and experienced staff that we that were laid off as a'",
        "'speaker_2': 'result of this crisis. These policies are economically sound for business right to record retention, remove the economic costs associated with onboarding new employees, which can cost thousands of dollars per employee. Lastly, Miami Beach has invested millions of dollars in this downtown hospitality industry with the promise of a return of good jobs for Long Beach residents.'",
        "'speaker_2': 'Locking in permanent right to recall and retention ordinance for these two industries help to protect that promise of a return of good jobs to Long Beach residents. We urge you to make the Long Beach right a record retention, permanent policies in our city.'",
        "'speaker_2': 'These policies will help spearhead a strong, robust recovery. Thank you so much.'",
        "'speaker_3': 'Our next speaker is Ann Burdette.'",
        "'speaker_2': 'Good evening. My name is Brigette. And first of all, I just want to say I every day I get more proud of being Long Beach. So thank you for making me feel so proud of my community every day.'",
        "'speaker_2': 'And on behalf of the faith communities of Long Beach and Clergy and Laity United for Economic Justice, I want to thank this council especially for recognizing and it is a moral imperative to safeguard the livelihoods of those residents that have been most terribly affected by this pandemic.'",
        "'speaker_2': 'Guaranteeing the right of essential hotel and janitorial workers to return to their jobs is an enlightened policy, and it demonstrates your ethical and economic commitment to equity. Making the right to recall a retention policy enforceable as a permanent ordinance is the next important step to ensuring the safety and well-being of our city.'",
        "'speaker_2': 'And we include strongly support items 18 and 19 and urge you to repeat your unanimous vote in favor of this policy that you made on February 15. Thank you again for your diligence and for your integrity in moving these items forward with your yes votes tonight.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Our final speaker is Gary Heidrich.'",
        "'speaker_0': 'Good evening, Mayor and city council members. My name is Gary Hetrick and I reside in the Fort District. I'd like to begin by thanking the Council and the mayor for your leadership on this. I think there's a critical issue.'",
        "'speaker_0': 'I also echo what the other speakers have just mentioned. I'm speaking out tonight as co-president of the Language Chapter, the California Faculty Association Association. BE we represent over 2900 faculty, coaches, librarians and counselors. At issue, I'll be on behalf of our members.'",
        "'speaker_0': 'I urge you to make the right to recall and retention permanent policies. Hospitality and janitor. Janitorial workers are essential workers who not only suffered greatly during the pandemic, but are key to our region's recovery. These policies are critical to protecting the lives and the livelihoods of Long Beach workers and also helping ensure that businesses recover.'",
        "'speaker_0': 'CFA Long Beach support for these ordinances making these ordinance permanent is really simple. First, CSU educates the majority of essential workers in our state. Many of our students, as well as parents of other students, are essential workers. Both will directly benefit from these two policies.'",
        "'speaker_0': 'Second, Sue Shelby has proven to be a pathway to the middle class for thousands of working class and first generation students. Although Shelby is one of the most successful drivers of upward social mobility in this country, this only works if working families and working students in these essential industries have the economic stability to take advantage of, casual'",
        "'speaker_0': ', be and can afford the cost. These policies will help ensure that happens. I urge you to make these protections permanent. Recovery means everyone. Thank you for your time and your leadership.'",
        "'speaker_3': 'That concludes public comment on this item.'",
        "'speaker_0': 'Thank you. Let's go and do a role. I believe that also I don't have any more comment from the council. So let's go ahead and do a we'll call the police district one.'",
        "'speaker_1': 'I district to.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District three, my district four.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District seven. I. District eight. District nine.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Ordinance on Covid-19 Worker Recall.": [
        "'speaker_0': 'Thank you. Next up is the ordinance number 19.'",
        "'speaker_1': 'Report from City Attorney Recommendation to declare ordinance relating to COVID 19 worker recall. Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'We have a motion by Vice to be represented a second by Councilmember Ranga. Is there any public comment on this?'",
        "'speaker_3': 'If there's any members of the public that wish to speak on this item, please use the raise hand feature or press star nine if dialing in by phone. Our first speaker is Veronica Lagunas.'",
        "'speaker_2': 'The photos in. No matter.'",
        "'speaker_4': 'What. Afternoon, everyone on. You know, ration. Whatever.'",
        "'speaker_2': 'The failure of.'",
        "'speaker_4': 'The sun is very bright, but the animal connections are going to.'",
        "'speaker_2': 'Be.'",
        "'speaker_4': 'Inoperable. What about.'",
        "'speaker_2': 'This? Yeah, well, I won't use the radio.'",
        "'speaker_4': 'My name is Veronica Laguna. I am a member of the Union Continua.'",
        "'speaker_2': 'Feel good. You are a long way to that and I feel that.'",
        "'speaker_4': 'During the pandemic, the city of Long Beach was the first one to guarantee continued.'",
        "'speaker_2': 'I feel like it's all a bit of a Hegarty. I look at Bill.'",
        "'speaker_4': 'Are to making sure that all workers from the hotel industry and janitorial services continue to.'",
        "'speaker_2': 'At the hearing. I got to ask you about the traversal. That's what it gets that I don't know if.'",
        "'speaker_4': 'They had the guarantee to going back to work in case the buildings were closed down or the hotels were closed down. Go ahead. Continue with.'",
        "'speaker_2': 'So I'm okay with that. If someone got a different area than being a reporter.'",
        "'speaker_4': 'So we knew that our jobs, we knew that our jobs were guaranteed, were safe, and our security was also safe. Continuing.'",
        "'speaker_2': 'In this moment, both every moment that bear that egg, that straw Trevor who compromised Trevor but his been.'",
        "'speaker_4': 'And so at that time we understood that the Syrians language sent a very clear message, making it very clear that our jobs and our safety and security were not going to be compromised.'",
        "'speaker_2': 'Oh, definitely. Mozart, likely. Yeah, I love Nembutal. They'll come in there, they can, they'll start using. I said it's a little bit of my name.'",
        "'speaker_4': 'So now we ask you a city council and city mayor to help us police make this law a permanent law.'",
        "'speaker_2': 'Can I tell you then? I said if I could pull them off the use of a handful of partners to give them a strava math hour. I almost l'conomie almost like weather bike.'",
        "'speaker_4': 'And to make sure that we can come back to work being sure that our jobs are secure, safe, particularly now knowing that the economy is very weak and that we need to recover. Thank you very much.'",
        "'speaker_2': 'That's it.'",
        "'speaker_3': 'That concludes our comment for this item.'",
        "'speaker_0': 'Thank you very much. And then with your roll call vote, please.'",
        "'speaker_1': 'District one. My district to my district three i. District four.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five. District five. District six, i. District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District nine. High emotion is.'",
        "'speaker_2': 'Key, but it's well.'",
        "'speaker_1': 'Received. Motion is carried.'"
    ],
    "Ordinance to Prohibit Spectators at Street Races and Reckless Driving Exhibitions.": [
        "'speaker_0': 'Thank you. Let's do the final audience of the night, which is audience 16. And then we'll go back to the I did a comment, general public comment and the rest of the agenda. Madam Kirk, can you read item 16?'",
        "'speaker_1': 'Report from City Attorney Recommendation to declare ordinance relating to prohibiting spectators at street races, sideshows and reckless driving exhibitions. Read the first time and later the next regular meeting of City Council for Final Reading Citywide.'",
        "'speaker_0': 'Let me turn this over to Councilman Super now. Okay. Thank you, Mayor Garcia. I move that we accept the recommendation and declare an ordinance amending the Long Beach Municipal Code. My motion also requests that we adopt the proposed seven page ordinance exactly as written without amendments.'",
        "'speaker_0': 'The City Attorney's Office has created an ordinance that aligns precisely with City Council's directive and unanimous vote on July 20th, 2021. It is modeled after the ordinances of San Jose and Anaheim. And both those municipalities were referenced in my council presentation on July 20th.'",
        "'speaker_0': 'Further, our city attorney's office sought and received input from both the city prosecutor's office and the Long Beach Police Department. That input included vetting, fine tuning and final signoff. That action is perfectly aligned with our goal to provide law enforcement with the necessary tools.'",
        "'speaker_0': 'For these reasons I'm asking we approved the ordinance as proposed. I'd also like to thank our city attorney, city prosecutor and LBP for their collaborative and comprehensive work. Last, I'd like to remind everyone of our goal that the ordinance should act as a deterrent.'",
        "'speaker_0': 'With other ordinances existing in our region. Our city should never be a target due to inadequate or non existing laws. This ordinance has put us on a path to achieving that goal. I respectfully ask for your support. Thank you.'",
        "'speaker_0': 'Mr. Mayor, that is an emotional thank you. As acknowledged, I think Mr. Mayor is gone. I don't have the view. I think he has a commitment at 6:00. And so if you have your sacking, we'll just raise your hand and I'll know speaking.'",
        "'speaker_2': 'Okay?'",
        "'speaker_0': 'Okay. Councilwoman Price.'",
        "'speaker_2': 'I support the motion and I thank Councilwoman Sabrina for bringing it forth.'",
        "'speaker_0': 'Okay, I'll add a council comment. And if you have council comments, just raise your hand. First of all, thank you, Councilman Supernormal, for trying to take on this issue. I think people want to see a resolution to the street takeovers and we have a lot of them in North Hollywood, I would say.'",
        "'speaker_0': 'I did raise this raises concern that I had some good conversation. The city prosecutor raised the concern about the youth who are spectators. And we talked about it last time. And I want to bring it up again that as we implement this this this ordinance, I'm going to support this.'",
        "'speaker_0': 'And I would I want to make sure that what we've learned is people under 26, they they respond to positive intervention. We have data on this. We've created the program, the past program to specifically talk about work with this audience.'",
        "'speaker_0': 'I don't believe that attending a street takeover should leave a black mark that ultimately can keep them from getting a job or connected to the things that we're supposed to be doing or getting an apartment or get into purchasing a home.'",
        "'speaker_0': 'So I think that we need to lean in and make sure we use the programs that we have. If somebody breaks the law, I think there needs to be a penalty. However, we need to make sure that we're being developmentally sensitive, particularly with young people.'",
        "'speaker_0': 'So I want to is the prosecutor here today and I have a question for him. Good evening. Members of the city council, this is Doug Halbert, Long Beach City here. Thank you. Hey, Doug, I will I want to just request that you tell us how we can engage, particularly with young people on this, you know, path was'",
        "'speaker_0': 'originally we talked about, you know, 24, 26 was the point when brains are fully developed and we have a lot of resources in the city, educational, you know, other things. And so the way, you know, path is work is not largely pretrial.'",
        "'speaker_0': 'So you get your ticket, then you get a letter from prosecutor says, look, you can stand in front of a judge and pay a fine or you can come in and connect and get on the right track or whatever it is.'",
        "'speaker_0': 'How would you engage path with this ordinance? It would be my first question. Well, first of all, I support the ordinance. I think it's a good idea and definitely needed in the city of Long Beach. Most of our path diversion and most of our diversion programs in general are pre filing diversion.'",
        "'speaker_0': 'So they don't actually go to court and they get a letter that they're offered to participate in a diversion program. If they take us up on that offer and they complete the diversion program, then they do not have to go to court or pay a fine or suffer any of the criminal consequences.'",
        "'speaker_0': 'So the PATH Program is a jobs based diversion program for mostly 18 to 24 year olds. And that's because that matches the grant that's available to Pacific Gateway, and it helps connect them to jobs or employment or some type of job skills to make them more employable.'",
        "'speaker_0': 'That's what the PATH program does. We have other programs as well. But since you mentioned the PATH program, that that one is geared towards young adults under the age of 24 and younger who have cases in my office.'",
        "'speaker_0': 'Fantastic. I think that's great. You know, I support the discretion that you have as a prosecutor to determine, you know, the best course of action. But what I like that we you know, we don't just have sticks, we have carrot.'",
        "'speaker_0': 'You can issue citations and we can do the things that need to happen. However, we you know, we're a local community, so we can handle our local youth a certain way. I think that's good. I think I think that satisfies my question.'",
        "'speaker_0': 'I'm happy to support the ordinance and comfort it, knowing that our prosecutors are going to get it passed. And I think, you know, I would encourage you to, you know, like. If people get questions because we got a lot of questions about what happened since these take over.'",
        "'speaker_0': 'Are largely young people out there. I think we should talk about we have more than one tool in the tool shed. I think that's important for us to know in how we are sensitive and how we deal with young people.'",
        "'speaker_0': 'That those are my comments. Any other comments he has raised? Okay. I see Councilman Ciro.'",
        "'speaker_2': 'I want to thank Councilmember Sabrina for bringing it forward. I mean, I do, you know. Agree that it can be dangerous and that we do need to figure out how to address it. But at the same time, I think when it initially came up, I did have concerns with what it means for young people, especially not just'",
        "'speaker_2': 'young people of color, but who are also immigrant and even maybe undocumented. I don't I certainly wouldn't want them being at an event and then getting caught and being not just only going through proceedings, but also being deported as well.'",
        "'speaker_2': 'And so I do want to make sure we do look into programs that can provide alternative ways and where they can learn their lesson, but also not have it be a mark against them as they move forward into whether it's higher education or jobs or other opportunities.'",
        "'speaker_2': 'So so those are some just having worked with young people of color and nonprofit and pretty. And it's particularly important for me that we we don't criminalize them for the, you know, for the things that they do as young people.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'And ask anyone else. I see two hands. Counsel Now for your first. Your immediate counsel.'",
        "'speaker_2': 'Sorry about that. You think after all this time I would get that. So. Thank you, Vice Mayor. And I also wanted to thank council member Super Scott for bringing us this item last summer. And the city attorney for drafting the ordinance.'",
        "'speaker_2': 'I do agree with you, Vice Mayor, that I think that we could utilize a path that would be that would be great. I do think that these street races and fight shows are dangerous and harmful. They interfere with traffic.'",
        "'speaker_2': 'They disrupt businesses. And and I think it's important that the city that we do everything that we can do to stop these events that are happening all across the city. I think in all of our districts, this is happening.'",
        "'speaker_2': 'I know I've seen the races down here along the the ocean corridors over the pike and Rainbow Harbor, and these are just happening on a regular basis. So I'm glad that that council members, if we're not took took a lead on this.'",
        "'speaker_2': 'I do also believe that these penalties are necessary to deter these events from happening. And in focusing on areas is a good start because they are a big part of the issue. But we also need to focus on the drivers of these events and these events would never even happen without the driver.'",
        "'speaker_2': 'So I think also exploring solutions to focus on those individuals is good too. I also believe that if a spectator is founded violation of this policy, that we have to make sure the extent of their involvement. I know there was a one of these takeovers over at the town center and my cousin had called me, you know'",
        "'speaker_2': ', he was over there and he's like, I saw that. And so I just, you know, we just, you know, I hope and trust that the Long Beach Police Department will make sure that we do understand the assault, that that the extent of this involvement of folks and that just not bystanders are or people that are happened to'",
        "'speaker_2': 'be in the area. So I trust that that that that that that will have that that will happen. And so thank you very much. And I will be supporting this item today.'",
        "'speaker_0': 'Fantastic. Thank you. Can make complements and data.'",
        "'speaker_2': 'Thank you very much, Mayor. Thank you, councilmembers, for leading on this very important item. I'm very supportive of this item. I know that our young people sometimes feel that they are invincible. And so they they really feel that it's not dangerous.'",
        "'speaker_2': 'But when you're really creating a circle of people and then you have cars that are showing off, it just really terrifies me. And, you know, it's just a matter of time before something really bad happens. And, you know, I would not want to see that here in our in our city.'",
        "'speaker_2': 'So I really applaud Councilmember Super now for bringing this item forward. I also do agree that we have to make sure that we do let everyone know who participates, that this is not allowed in Long Beach. But at the same time, like other colleagues of mine have said, we do have to.'",
        "'speaker_2': 'Kind of be sensitive to some of the people that might be doing this. But also we have to send a firm message that this is not allowed. We're not going to allow people to come in and put innocent lives at danger.'",
        "'speaker_2': 'And so with that, I will absolutely be supporting this item.'",
        "'speaker_0': 'And tastic. Thank you. Any public comment on the item?'",
        "'speaker_3': 'If any members of the public wish to speak on this item, please use the raise hand feature or press star nine if dialing in by phone. Seen none. That concludes public comment.'",
        "'speaker_0': 'Fantastic. Thank you, Councilman Supernova. This great item will go ahead with our roll call vote.'",
        "'speaker_1': 'District one, district two. I. District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five. District six. I. District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District nine.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'All right. Thank you. I want to just check in with the clerk on what items we have next to do.'",
        "'speaker_1': 'Items 13, 14, 15 and 20.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'And public comment.'",
        "'speaker_0': 'So that's what I'm going to ask. Let's do public comment now and then we'll do the rest of the items in in that order.'"
    ],
    "Airport Improvement Program Grant for Runway 12-30 Electrical Improvements Project.": [
        "'speaker_0': 'All right. Thank you. Let's move on to the next agenda item, please.'",
        "'speaker_1': 'Item 13 report from Longreach Airport. Recommendation to authorize city manager to execute all documents with the Federal Aviation Administration for airport runway project in an amount not to exceed 7 million. District four and five.'",
        "'speaker_0': 'Thank you. Their emotion. On OKC council. Urunga is our second. Okay. I see. Councilwoman Burro. Something wrong? You want to say anything? Matter of fact, there's a staff report on this. Oh, this is your own. This is. Yeah.'",
        "'speaker_0': 'This is this is is their staff report.'",
        "'speaker_2': 'One low press release can provide a brief staff report on this item.'",
        "'speaker_0': 'Okay. Thank you. Good evening, Vice Mayor Richardson and members of the City Council. This item this evening relates to the acceptance of the Federal Aviation Administration airport improvement grant funds for electrical improvements to airport runway 1230 are main runway at the Long Beach Airport.'",
        "'speaker_0': 'Runway 1230 is a primary air carrier runway. In early 2020, an airfield lighting investigation was performed in the results recommended replacement of the existing runway lighting and associated equipment due to its age. The need to be and the need to be brought up to current standards and the probability of electrical failures in continual repair.'",
        "'speaker_0': 'The runway electrical improvements will preserve and enhance safety and will align with the airport's sustainability efforts. The existing fixtures will be replaced with energy efficient LED fixtures. A grant offer from the FAA is pending. The estimated cost of the project is 6.8 million, of which approximately 6.2 million will be federally funded.'",
        "'speaker_0': 'The airport share of approximately 600,000 will be funded with airport revenue. City Council authorization to accept the grant award is requested this evening so that the grant may be fully processed in the timeframe required by the FAA staff request council approval of the recommended action.'",
        "'speaker_0': 'This concludes my report. I'm available for any questions regarding this item. Thank you. Fantastic. Thank you. It was moved by Durango. Who was the second?'",
        "'speaker_2': 'I'm counting on.'",
        "'speaker_1': 'Councilwoman Sara was the second on the side of.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Councilwoman Mangal, second in line.'",
        "'speaker_0': 'Okay. I will be recognized. Okay, Councilman. You can see anything.'",
        "'speaker_2': 'Just that it's great that the airport is continuing to move forward and making progress. Thank you.'",
        "'speaker_0': 'Gentlemen. Super. Thank you. Thanks for the report. Mr. Rios. I had a question on the construction related to this grant. Is it your anticipation that this would be done overnight in the proximity of runway 30? The Project Council of Super not.'",
        "'speaker_0': 'The project will consist of some day work, some evening work as well as the closure over approximately three weekends. We are currently in the selection process of a contractor. We anticipate that those bids will be opened mid-March and once we have selected a contractor will begin the process of a schedule and then be able to provide a'",
        "'speaker_0': 'more detailed schedule for the council and do us and do council briefings as we did with our previous projects. Okay. I would just like to add that our request would be that the contractor is made well aware of the impacts of construction noise in the overnight hours.'",
        "'speaker_0': 'So we don't have a repeat of what's happened in the past. Thank you. All right. Thank you. Any public comment on this item?'",
        "'speaker_3': 'There's any members of the public that wish to speak on this item. Please use the raise hand feature or dialing in by phone. Star nine. Dave Shukla.'",
        "'speaker_0': 'Hello again. Please consider Dark Sky principles. Pittsburgh's a great example. You can save a lot of electricity, save a lot of money. And the night sky looks wonderful when you can see the stars. Thank you.'",
        "'speaker_3': 'That concludes public comment for this item.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'District one. My district to.'",
        "'speaker_2': 'Right. District three.'",
        "'speaker_1': 'My district for.'",
        "'speaker_0': 'My.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District nine.'"
    ],
    "Resolution to Accept Grant Funds and Execute Documents for The Center for Inclusive Business and Workforce Development Project.": [
        "'speaker_0': 'I.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Thank you. 14.'",
        "'speaker_1': 'Please report from Economic Development and Public Works recommendation to adopt a resolution authorizing city manager to execute all documents. To accept grant funds from the California Governor's Office of Business and Economic Development in an amount not to exceed 5 million for the center project at 1858 Atlantic Avenue and authorize city manager to execute all documents to facilitate'",
        "'speaker_1': 'the construction of the Center. District six.'",
        "'speaker_0': 'Thank you, Councilman Miranda. This is a great project, a very well done graduate to Central China for their opportunity to apply for this private equity grant and looking forward to the completion of this project. And I will defer my motion to Councilwoman Sorrell.'",
        "'speaker_0': 'And I thank you, Councilman Valle.'",
        "'speaker_2': 'Thank you, Councilmember Urunga. Yes. I'm just excited that we're able to proceed. I just want to thank Senator Lena Gonzalez again for the $5 million that she advocated for to build this workforce development center, that center she's leading.'",
        "'speaker_2': 'And just really glad that they're able to move forward in this. I thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, do they have.'",
        "'speaker_2': 'Thank you again. Congratulations to Councilmember Ciro for this amazing item and to Central Time. And this is a testament to what great partnerships can do together. So I'm very, very happy to support this item and look forward to seeing the end results.'",
        "'speaker_0': 'Fantastic. Seeing no further hands on my comments. Congratulations to Central China and Councilwoman Zoro and thanks for acknowledging council. Excuse me, Senator, leading the dollars on on this effort. I think this is going to be a great center.'",
        "'speaker_0': 'I think we need more centers like this in our city. I think central China has a great track record. I know that they've had some challenges with respect to timelines and funding. This is certainly great news. And to the city of Long Beach Economic Development Department, this is you know, this is going to be a good feather'",
        "'speaker_0': 'in the cap as well. And being creative with figuring out how to partner with the city and central China to make this happen. And this is the kind of partnership innovation our city needs to see. As a public comment on this item.'",
        "'speaker_3': 'If there are any members of the public that wish to speak on this item, please press star nine. Or if dialing in by phone or Italian by phone press star nine or use a raise hand feature. Our first speaker is Jessica Quintana.'",
        "'speaker_3': 'Jessica ton. Jessica Quintana You're muted.'",
        "'speaker_2': 'Okay. Can you hear me now?'",
        "'speaker_0': 'We can hear you now.'",
        "'speaker_2': 'Okay, great. Thank you. Apologize for that. So good evening, Vice Mayor Richardson and members of the City Council. Thank you so much for the opportunity to speak. On behalf of Spencer Chandler, board of directors and the 50,000 families that we serve annually through our employment services, small business development, our immigration legal services, youth development programs, and most'",
        "'speaker_2': 'recently, the thousands of families to support COVID 19 response and vaccine outreach and education program. We truly appreciate the support of Senator Lena Gonzalez and the leadership of our mayor, Robert Garcia, and all of our council members on this important item that truly aligns with the city's Racial Equity and Reconciliation Initiative and with the Economic Development Blueprint'",
        "'speaker_2': 'Initiative supporting long term economic recovery and sustainability for our communities of color. We look forward to continuing to work with Eric Romero and we just want to thank John Keiser. I know he's leaving our city, which are truly fucked about, but he's been with us through this project since the very beginning, three years ago when we first'",
        "'speaker_2': 'started this initiative. So just like you said, Vice Mayor Richardson, it's been a long time. You know, we've had some peaks and valleys, but but it's a learning blessing. And I think that other organizations and opportunities for other nonprofits who are invested in economic development, which we all know we need the most, looking towards our economic recovery'",
        "'speaker_2': 'for the city of Long Beach, for our communities of color, we're going to need some best practices and how do we develop these public private partnerships? So we're truly grateful on behalf of this report. And we just want to thank John for all his support and leadership.'",
        "'speaker_2': 'He's done a tremendous job, and we look forward to working with Eric Romero and his team. They're fantastic. And so, again, thank you so much.'",
        "'speaker_0': 'Thank you for the public comment.'",
        "'speaker_3': 'That concludes public comment.'",
        "'speaker_0': 'Well, let's move move on to our roll call vote.'",
        "'speaker_2': 'Mr. Vice Mayor Richardson, I was cued up. I'm not sure if you have the cue.'",
        "'speaker_0': 'No, we're all raising our hands. Oh, but I recognize you.'",
        "'speaker_2': 'Okay. Thank you for doing so. So I wanted to congratulate Senator Shaw for this accomplishment tonight and this action tonight. I think that's great. And casserole and sorrow. I wanted to just highlight one of the services, the many services that you provide.'",
        "'speaker_2': 'But I recently was educated on on just how in-depth you provide legal services, which is an area that I'm very familiar with in the work that you do, is really, really hard to get pro bono support for on a consistent basis.'",
        "'speaker_2': 'And I know how time intensive that legal work is. And I just wanted to I know you do perform a lot of services, but just having recently learned the depth of the legal services that you provide and being familiar with those services are what those services are and what they entail.'",
        "'speaker_2': 'I just wanted to acknowledge that you do that. It's really rare to see a nonprofit that delivers those services on a consistent basis, and it's very difficult for people to get those legal services in court without getting the type of individualized attention they need.'",
        "'speaker_2': 'And I know that's a big focus for central trough. And since that's an area that's in my wheelhouse, more so than all the other services you provide. I just wanted to take a moment to comment on it. So thank you.'",
        "'speaker_0': 'All right. Thank you. Let's move on to the roll call vote, please.'",
        "'speaker_1': 'District one, district two. District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District for.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District seven, i. District eight. Art District nine. And motion is carried.'"
    ],
    "Improvement and Reimbursement Agreement with Kilroy Realty for Kilroy Airport Way Project.": [
        "'speaker_0': 'Thank you. Congratulations, Central Chair. I would just want to remind the council I. I don't have the cue system. So you won't be recognized using a hand raised hand function or just wave your hand and I can see it and make sure that we don't overlook anyone.'",
        "'speaker_0': 'I believe we have item 15 next to that, correct?'",
        "'speaker_1': 'That is correct. Report from economic report from Economic Development and Public Works. Recommendation to authorize City Manager to enter into an improvement and reimbursement agreement with Kilroy Realty LP for the repair, repaving and re stripping of public right away located within Arrow Long Beach on the stated terms and conditions.'",
        "'speaker_1': 'Authorize City Manager to negotiate and amend any terms as needed to expedite the project and increase appropriations by 2,600,000 for the improvement of Kilroy Airport Way, District four.'",
        "'speaker_0': 'Thank you. Recognize Councilman Shuler? I'll go ahead and make the motion. And taxes are second. It was right hander. I'll take it. And is there any public comment on this item?'",
        "'speaker_3': 'If there's any members of the public that wish to speak on this item, please use the raise hand feature or if dialing in by phone by pressing star nine seen none. That concludes public comment.'",
        "'speaker_0': 'With our vote with.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'And.'",
        "'speaker_1': 'District two.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District three. I district for. All right, District five. High District six i. District seven. I. District eight. District nine.'",
        "'speaker_0': 'All right.'"
    ],
    "Resolution to Comply with SB 1383 Regulations per SB 619 Statute.": [
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Great. And then we have item 20.'",
        "'speaker_1': 'Report from Public Works recommendation to adopt a resolution to authorize city manager to submit a notice of intent to comply with the regulations of Senate Bill 1383 per the Senate Bill 619 statute citywide.'",
        "'speaker_0': 'Thank you. Every staff report here.'",
        "'speaker_2': 'Marin County Property team. Can we provide Aaron rolling with panelist access, please? Thank you.'",
        "'speaker_1': 'Yes. We're promoting her right now.'",
        "'speaker_0': 'For.'",
        "'speaker_3': 'Mayor in council. We're getting the staff on.'",
        "'speaker_0': 'But I'll just give a real summary. We did this action. That's what we did. Yeah, we did this action last meeting.'",
        "'speaker_3': 'But the state asked for some pretty minor changes to the actual documents that you're going to approve. And we need to get those approved tonight so we can submit them by March 1st tonight and be in compliance with state law.'",
        "'speaker_3': 'So this is essentially.'",
        "'speaker_0': 'What you saw last week, just slightly modified. Fantastic. Thanks for clarifying. Is there a motion in the second I can move your fingers or a second? Second Sunday. Has there any public comment here?'",
        "'speaker_3': 'If any members of the public wished to speak on this item, please use a raised hand feature or if dialing in by phone by pressing star nine. Dave Shukla.'",
        "'speaker_0': 'Oh, hello. Thank you. Very briefly. I'd really like to see green beans throughout the entire city. I think also we need collection points for organic. We need soil creation. We need the ability to allow vendors who already do this, to do it in the most cost effective or least zero leased vehicle.'",
        "'speaker_0': 'Miles traveled way possible. We want. As fewer listeners as possible. Thank you.'",
        "'speaker_3': 'I conclude.'",
        "'speaker_0': 'Thank you. Thank you. Councilwoman Mungo's queued up.'",
        "'speaker_2': 'Thank you. I could because I was going to make some comments related to the implementation of the system may actually be less environmentally friendly than the system we currently have in place. And so while we are working towards meeting the statewide goals, I think it's also important for us to continue to advocate for the most effective and'",
        "'speaker_2': 'environmentally friendly option for Long Beach, which may be different than environmentally friendly options for cities that live closer to landfills. Thank you.'",
        "'speaker_0': 'Thank you. Let's have a look.'",
        "'speaker_1': 'District one. High District two.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District four. By District five. I. District six. I. District seven. I. District eight. District nine.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Motion is carried.'"
    ]
}